{
  "number": 101,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 11,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, Allah mentions the word al-qari'ah, which is one of the names of Doomsday, such as al-haqqah, as-sakhkhah, ath-thammah, and al-Gasyiyah. Judgment Day is also called al-qari'ah because it shakes everyone's heart out of its terror. The word al-qari'ah is also used to refer to a great disaster. Allah says: And the infidels are always plagued by their own deeds. (ar-Ra'd \/ 13: 31) This means that they are plagued with disasters that strike their hearts and hurt their bodies, so that they complain about it.",
      "text_tafsir": "Dalam ayat ini, Allah menyebutkan kata al-qari'ah, yaitu salah satu nama hari Kiamat, seperti al-haqqah, as-sakhkhah, ath-thammah, dan al-Gasyiyah. Hari Kiamat itu juga disebut al-qari'ah karena ia menggetarkan hati setiap orang akibat kedahsyatannya. Kata al-qari'ah juga digunakan untuk menyebut suatu bencana hebat. Allah berfirman:\n\nDan orang-orang kafir senantiasa ditimpa bencana disebabkan perbuatan mereka sendiri. (ar-Ra'd\/13: 31)\n\nMaksudnya mereka ditimpa malapetaka hebat yang mengetuk hati mereka dan menyakiti tubuh mereka, sehingga mereka mengeluh karenanya.",
      "text_translation": "Hari Kiamat,",
      "text": "اَلْقَارِعَةُۙ",
      "text_translation_en": "OH, the sudden calamity!",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In this verse Allah repeats the word al-qari'ah in the form of a question to call attention to humans to understand because of the enormity of the Doomsday and riots which makes the heart wry, so it is difficult to describe it correctly and difficult to know the truth.",
      "text_tafsir": "Dalam ayat ini Allah mengulang kata al-qari'ah dalam bentuk pertanyaan untuk meminta perhatian agar manusia memahami karena dahsyatnya kejadian hari Kiamat dan huru-hara yang membuat hati kecut, sehingga sulit menggambarkannya dengan tepat dan sulit mengetahui dengan sebenarnya.",
      "text_translation": "Apakah hari Kiamat itu?",
      "text": "مَا الْقَارِعَةُ ۚ",
      "text_translation_en": "How awesome the sudden calamity!",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "Allah repeats the word al-qari'ah is to describe the awesomeness of the Day of Judgment, as if there is nothing that can be used as an example for al-qari'ah. However imagined, al-qari'ah is greater than that.",
      "text_tafsir": "Allah mengulangi kata al-qari'ah itu adalah untuk menggambarkan kedahsyatan hari Kiamat itu, seakan-akan tidak ada sesuatu pun yang dapat dijadikan contoh untuk al-qari'ah itu. Bagaimana pun mengkhayalkannya, al-qari'ah lebih hebat dari itu.",
      "text_translation": "Dan tahukah kamu apakah hari Kiamat itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا الْقَارِعَةُ ۗ",
      "text_translation_en": "And what could make thee conceive what that sudden calamity will be?",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "Because it is very difficult to know the truth of al-qari'ah, in this verse Allah explains the time of His coming. At that time, the human condition was like flying around a lamp at night. This analogy is to describe the human condition of confusion and uncertainty in its purpose. People on that fateful day are scattered everywhere, confused, and unsure of where to go, what to do, and why they are gathered there. This condition does not change as the termites do not determine the direction. In another verse, God says: They are like grasshoppers flying. (al-Qamar \/ 54: 7)",
      "text_tafsir": "Karena sangat sulit mengetahui hakikat al-qari'ah, maka dalam ayat ini Allah menjelaskan waktu kedatangannya. Ketika itu, keadaan manusia bagaikan laron yang beterbangan di sekeliling lampu pada malam hari. Penyerupaan ini adalah untuk menggambarkan keadaan manusia yang kebingungan dan tidak menentu arah tujuannya.\n\nManusia pada hari yang dahsyat itu bertebaran di mana-mana, bingung, dan tidak tahu ke mana akan dituju, apa yang akan dikerjakan, dan untuk apa mereka dikumpulkan di sana. Kondisi ini tidak ubahnya seperti anai-anai yang tidak berketentuan arahnya. Dalam ayat lain, Allah berfirman:\n\nSeakan-akan mereka belalang yang beterbangan. (al-Qamar\/54 : 7)",
      "text_translation": "Pada hari itu manusia seperti laron yang beterbangan,",
      "text": "يَوْمَ يَكُوْنُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوْثِۙ",
      "text_translation_en": "[It will occur] on the Day when men will be like moths swarming in confusion,",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, God reveals that the ruined mountains flow from their place like fine feathers blown away by the wind. Then what is the condition of the human being with such a weak body when experiencing the al-qari'ah? There are many in the Qur'anic verses about the state of the mountains on the Day of Judgment, among which God said: And thou shalt see the mountains, that thou supposedst, and where they are, when they go (as) the clouds do. (an-Naml \/ 27: 88) And the mountains were as a drop of a sand-cast; (al-Muzzammil \/ 73: 14) And the mountains were carried away into mirth. (an- Naba '\/ 78: 20) All these statements explain that the great and mighty mountains should not be moved, but the Qari'ah can destroy them, let alone the weak creatures.",
      "text_tafsir": "Dalam ayat ini, Allah mengungkapkan bahwa gunung-gunung yang telah hancur itu beterbangan dari tempatnya seperti bulu halus yang diterbangkan angin. Lalu bagaimanakah keadaan manusia yang mempunyai tubuh yang lemah itu bila mengalami al-qari'ah itu.\n\nBanyak terdapat dalam Al-Qur'an ayat-ayat tentang keadaan gunung-gunung pada hari Kiamat, di antaranya Allah berfirman:\n\nDan engkau akan melihat gunung-gunung, yang engkau kira tetap di tempatnya, padahal ia berjalan (seperti) awan berjalan. (an-Naml\/27 : 88)\n\nDan menjadilah gunung-gunung itu seperti onggokan pasir yang dicurahkan. (al-Muzzammil\/73: 14)\n\nDan gunung-gunung pun dijalankan sehingga menjadi fatamorgana. (an- Naba'\/78: 20)\n\nSemua keterangan tersebut untuk menjelaskan bahwa gunung-gunung yang besar dan kuat seharusnya tetap tidak dapat digerakkan, tetapi al-Qari'ah dapat menghancurkannya, apalagi manusia makhluk yang lemah.",
      "text_translation": "dan gunung-gunung seperti bulu yang dihambur-hamburkan.",
      "text": "وَتَكُوْنُ الْجِبَالُ كَالْعِهْنِ الْمَنْفُوْشِۗ",
      "text_translation_en": "and the mountains will be like fluffy tufts of wool....",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "In these verses, God explains the rewards for those who do many good deeds, that is, when their deeds are weighed and their weights are heavy because they do many good deeds. The reward for these people is eternal happiness in heaven. They live in it full of happiness, happiness, and contentment. We must believe in the fact that we have the balance (balance \/ balance) mentioned in this verse and in His Word: And We will set the proper scales on the Day of Resurrection. (al-Anbiya '\/ 21: 47)",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menjelaskan tentang ganjaran bagi orang-orang yang banyak melakukan amal kebajikan, yaitu ketika amal mereka ditimbang dan timbangannya berat karena banyak mengerjakan amal-amal saleh. Ganjaran bagi orang-orang ini adalah kesenangan abadi di surga. Mereka hidup di dalamnya penuh dengan kebahagiaan, kenikmatan, dan kepuasan. Kita wajib mempercayai adanya mizan (neraca\/timbangan) yang tersebut pada ayat ini dan dalam firman-Nya:\n\nDan Kami akan memasang timbangan yang tepat pada hari Kiamat. (al-Anbiya'\/21: 47)",
      "text_translation": "Maka adapun orang yang berat timbangan (kebaikan)nya,",
      "text": "فَاَمَّا مَنْ ثَقُلَتْ مَوَازِينُهٗۙ",
      "text_translation_en": "And then, he whose weight [of good deeds] is heavy in the balance",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "In these verses, God explains the rewards for those who do many good deeds, that is, when their deeds are weighed and their weights are heavy because they do many good deeds. The reward for these people is eternal happiness in heaven. They live in it full of happiness, happiness, and contentment. We must believe in the fact that we have the balance (balance \/ balance) mentioned in this verse and in His Word: And We will set the proper scales on the Day of Resurrection. (al-Anbiya '\/ 21: 47)",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menjelaskan tentang ganjaran bagi orang-orang yang banyak melakukan amal kebajikan, yaitu ketika amal mereka ditimbang dan timbangannya berat karena banyak mengerjakan amal-amal saleh. Ganjaran bagi orang-orang ini adalah kesenangan abadi di surga. Mereka hidup di dalamnya penuh dengan kebahagiaan, kenikmatan, dan kepuasan. Kita wajib mempercayai adanya mizan (neraca\/timbangan) yang tersebut pada ayat ini dan dalam firman-Nya:\n\nDan Kami akan memasang timbangan yang tepat pada hari Kiamat. (al-Anbiya'\/21: 47)",
      "text_translation": "maka dia berada dalam kehidupan yang memuaskan (senang).",
      "text": "فَهُوَ فِيْ عِيْشَةٍ رَّاضِيَةٍۗ",
      "text_translation_en": "shall find himself in a happy' state of life;",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "God also explains the fate of the wicked, when the deeds of the wicked are weighed and their scales are lightened by the many evils and little good deeds of the world, they will be placed in the hell of hell for the torture of the wicked, the place of misery; a place where they are immersed in it.",
      "text_tafsir": "Allah juga menjelaskan nasib orang-orang jahat yaitu bila amal orang-orang jahat itu ditimbang dan timbangannya itu ringan karena banyak mengerjakan kejahatan dan sedikit mengerjakan kebajikan di dunia maka mereka akan ditempatkan dalam neraka Hawiyah tempat penyiksaan orang-orang jahat, tempat hidup sengsara; suatu tempat yang mereka dijerumuskan ke dalamnya.",
      "text_translation": "Dan adapun orang yang ringan timbangan (kebaikan)nya,",
      "text": "وَاَمَّا مَنْ خَفَّتْ مَوَازِيْنُهٗۙ",
      "text_translation_en": "whereas he whose weight is light in the balance",
      "juz_number": 30
    },
    "9": {
      "text_tafsir_en": "God also explains the fate of the wicked, when the deeds of the wicked are weighed and their scales are lightened by the many evils and little good deeds of the world, they will be placed in the hell of hell for the torture of the wicked, the place of misery; a place where they are immersed in it.",
      "text_tafsir": "Allah juga menjelaskan nasib orang-orang jahat yaitu bila amal orang-orang jahat itu ditimbang dan timbangannya itu ringan karena banyak mengerjakan kejahatan dan sedikit mengerjakan kebajikan di dunia maka mereka akan ditempatkan dalam neraka Hawiyah tempat penyiksaan orang-orang jahat, tempat hidup sengsara; suatu tempat yang mereka dijerumuskan ke dalamnya.",
      "text_translation": "maka tempat kembalinya adalah neraka Hawiyah.",
      "text": "فَاُمُّهُ هَاوِيَةٌ  ۗ",
      "text_translation_en": "shall be engulfed by an abyss.",
      "juz_number": 30
    },
    "10": {
      "text_tafsir_en": "In this verse, God explains the meaning of the word hawiyah in the form of a question, namely: what is the hell of Hawiyah and from what is it created? The Hawiyah Fire was a fiery flame in which sinners were cast into it in order to receive revenge for their crimes and crimes. This verse illustrates that if all the fires around the world were gathered and united, it would not be able to match the heat of the fire of Hawiyah.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan arti kata hawiyah dalam bentuk pertanyaan, yaitu: apakah neraka Hawiyah itu dan dari apa ia dijadikan? Neraka Hawiyah adalah api yang menyala-nyala yang sangat panas di mana orang-orang yang berdosa dijerumuskan ke dalamnya untuk menerima balasan atas kejahatan dan kemungkaran yang mereka lakukan. Ayat ini menggambarkan jika semua api di seluruh dunia dikumpulkan dan dipersatukan, tidak akan dapat menyamai panasnya api neraka Hawiyah.",
      "text_translation": "Dan tahukah kamu apakah neraka Hawiyah itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا هِيَهْۗ",
      "text_translation_en": "And what could make thee conceive what that [abyss] will be?",
      "juz_number": 30
    },
    "11": {
      "text_tafsir_en": "In this verse, God explains the meaning of the word hawiyah in the form of a question, namely: what is the hell of Hawiyah and from what is it created? The Hawiyah Fire was a fiery flame in which sinners were cast into it in order to receive revenge for their crimes and crimes. This verse illustrates that if all the fires around the world were gathered and united, it would not be able to match the heat of the fire of Hawiyah.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan arti kata hawiyah dalam bentuk pertanyaan, yaitu: apakah neraka Hawiyah itu dan dari apa ia dijadikan? Neraka Hawiyah adalah api yang menyala-nyala yang sangat panas di mana orang-orang yang berdosa dijerumuskan ke dalamnya untuk menerima balasan atas kejahatan dan kemungkaran yang mereka lakukan. Ayat ini menggambarkan jika semua api di seluruh dunia dikumpulkan dan dipersatukan, tidak akan dapat menyamai panasnya api neraka Hawiyah.",
      "text_translation": "(Yaitu) api yang sangat panas.",
      "text": "نَارٌ حَامِيَةٌ ࣖ",
      "text_translation_en": "A fire hotly burning!",
      "juz_number": 30
    }
  },
  "name": "القارعة",
  "name_translation_en": "The Calamity",
  "name_translation": "Hari Kiamat",
  "name_latin": "Al-Qari'ah"
}