{
  "number": 102,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 8,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, God reveals that man is busy boasting about his wealth, friends, and followers, thus neglecting his actions. They just keep talking, cheating by their descendants and co-workers without thinking of deeds that are beneficial to themselves and their families. Narrated by Mutharrif from his father, he said: I met the Prophet when he was reading al-hakumut-takatsur, he said, \"Son of Adam said, 'This is my treasure, this is mine. The Prophet said,\" O son of Adam! You have none of your wealth except what you eat and eat, or the clothes you wear out, or what you give away. \"(Muslim History) It is reported that the Prophet saw: If Adam's son had a valley of wealth , he really wants to have two valleys of treasure, and if he has two valleys of treasure, he really wants to have three valleys of treasure and not satisfy the human stomach (dissatisfaction) unless his stomach is filled with soil and God will accept repentance. (Analogy of Ahmad, al-Bukhari, Muslim, and at-Tirmidhi of Anas) Some scholars have argued that the meaning of this verse is pride in excess. One seeks to have more than others either property or position with purpose. simply for the sake of height and pride, not for use in the way of good or for the purpose of upholding justice and goodwill innya. Know that the life of the world is nothing but a game and a spectacle, ornament, and a proud one among you, and a race of riches and posterity, like the rain upon which the crops are admirable; and then (the plant) becomes dry and you see the yellow color and then it breaks down. And in the Hereafter is a severe punishment and forgiveness from Allah and His will. And the life of the world is nothing but false pleasure. (al-hadid \/ 57: 20)",
      "text_tafsir": "Dalam ayat ini, Allah mengungkapkan bahwa manusia sibuk bermegah-megahan dengan harta, teman, dan pengikut yang banyak, sehingga melalaikannya dari kegiatan beramal. Mereka asyik dengan berbicara saja, teperdaya oleh keturunan mereka dan teman sejawat tanpa memikirkan amal perbuatan yang bermanfaat untuk diri dan keluarga mereka.\n\nDiriwayatkan dari Mutharrif dari ayahnya, ia berkata:\n\nSaya menemui Nabi saw ketika beliau sedang membaca al-hakumut-takatsur, beliau bersabda, \"Anak Adam berkata, 'Inilah harta saya, inilah harta saya. Nabi bersabda, \"Wahai anak Adam! Engkau tidak memiliki dari hartamu kecuali apa yang engkau makan dan telah engkau habiskan, atau pakaian yang engkau pakai hingga lapuk, atau yang telah kamu sedekahkan sampai habis.\" (Riwayat Muslim) \n\nDiriwayatkan pula bahwa Nabi saw bersabda:\n\nSeandainya anak Adam memiliki satu lembah harta, sungguh ia ingin memiliki dua lembah harta, dan seandainya ia memiliki dua lembah harta, sungguh ia ingin memiliki tiga lembah harta dan tidak memenuhi perut manusia (tidak merasa puas) kecuali perutnya diisi dengan tanah dan Allah akan menerima tobat (memberi ampunan) kepada orang yang bertobat. (Riwayat Ahmad, al-Bukhari, Muslim, dan at-Tirmidhi dari Anas)\n\nAhli tafsir ada yang berpendapat bahwa maksud ayat ini adalah bangga dalam berlebih-lebihan. Seseorang berusaha memiliki lebih banyak dari yang lain baik harta ataupun kedudukan dengan tujuan semata-mata untuk mencapai ketinggian dan kebanggaan, bukan untuk digunakan pada jalan kebaikan atau untuk membantu menegakkan keadilan dan maksud baik lainnya.\n\nKetahuilah, sesungguhnya kehidupan dunia itu hanyalah permainan dan sendagurauan, perhiasan dan saling berbangga di antara kamu serta berlomba dalam kekayaan dan anak keturunan, seperti hujan yang tanam-tanamannya mengagumkan para petani; kemudian (tanaman) itu menjadi kering dan kamu lihat warnanya kuning kemudian menjadi hancur. Dan di akhirat (nanti) ada azab yang keras dan ampunan dari Allah serta keridaan-Nya. Dan kehidupan dunia tidak lain hanyalah kesenangan yang palsu. (al-hadid\/57: 20)",
      "text_translation": "Bermegah-megahan telah melalaikan kamu,",
      "text": "اَلْهٰىكُمُ التَّكَاثُرُۙ",
      "text_translation_en": "YOU ARE OBSESSED by greed for more and more",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "God then describes the state of pride among men or the quest to have more than anyone else will continue until they enter the grave. Thus, they have wasted their lives for what is worthless, both in the world and in the afterlife. Scholars argue that visiting the grave is the most potent antidote for the heart, because by visiting the grave people will remember death and the afterlife, which in turn will limit their unrealistic desires. The Prophet Muhammad said: I used to forbid you to visit the tomb, so now visit the tomb, because visiting the tomb will bring the glory of the worldly glory and remind you of the hereafter. (History of Ibn Majah from Ibn Mas'ud).",
      "text_tafsir": "Selanjutnya Allah menjelaskan keadaan bermegah-megah di antara manusia atau dengan usaha untuk memiliki lebih banyak dari orang lain akan terus berlanjut hingga mereka masuk lubang kubur. Dengan demikian, mereka telah menyia-nyiakan umur untuk hal yang tidak berfaedah, baik dalam hidup di dunia maupun untuk kehidupan akhirat.\n\nPara ulama berpendapat bahwa menziarahi kuburan adalah obat penawar yang paling ampuh untuk melunakkan hati, karena dengan ziarah kubur itu manusia akan ingat mati dan hari akhirat, maka dengan sendirinya akan membatasi keinginan-keinginan yang bukan-bukan.\n\nNabi Muhammad bersabda:\n\nSaya pernah melarang kamu menziarahi kubur, maka sekarang ziarahilah kubur itu, karena menziarahi kubur itu akan menjadikan zuhud dari kemewahan dunia dan mengingatkan kamu kepada kehidupan akhirat. (Riwayat Ibnu Majah dari Ibnu Mas'ud).",
      "text_translation": "sampai kamu masuk ke dalam kubur.",
      "text": "حَتّٰى زُرْتُمُ الْمَقَابِرَۗ",
      "text_translation_en": "until you go down to your graves.",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "Then Allah with this verse warns that boasting is not worth doing because of its bad consequences and creates chaos and hostility. Instead, God proposes to create harmony, to assist in upholding the truth and assisting in the welfare and preservation of society, by establishing high morals and good manners.",
      "text_tafsir": "Kemudian Allah dengan ayat ini memperingatkan bahwa bermegah-megahan itu tidak pantas dikerjakan karena akibatnya buruk serta menimbulkan kekacauan dan permusuhan. Sebaliknya Allah menganjurkan agar diciptakan kerukunan hidup, bantu-membantu dalam menegakkan kebenaran dan tolong-menolong dalam kebajikan dan dalam melestarikan hidup bermasyarakat, dengan membina akhlak yang luhur serta budi pekerti yang baik.",
      "text_translation": "Sekali-kali tidak! Kelak kamu akan mengetahui (akibat perbuatanmu itu),",
      "text": "كَلَّا سَوْفَ تَعْلَمُوْنَۙ",
      "text_translation_en": "Nay, in time you will come to understand!",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "God repeats his threat through this verse and is threat after threat, as if a master told his servant to do nothing, and then he repeated his words.",
      "text_tafsir": "Allah mengulang ancaman-Nya melalui ayat ini dan merupakan ancaman sesudah ancaman, bagaikan seorang tuan berkata kepada hamba sahayanya bahwa agar tidak mengerjakan sesuatu, kemudian tuan itu mengulangi ucapannya itu.",
      "text_translation": "kemudian sekali-kali tidak! Kelak kamu akan mengetahui.",
      "text": "ثُمَّ كَلَّا سَوْفَ تَعْلَمُوْنَ ",
      "text_translation_en": "And once again: Nay, in time you will come to understand!",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "This verse is a warning from Allah in the form of a command to be aware of that bad behavior. The desire to overdo can occupy someone to do work that is not useful. The opinion that he considered right was actually wrong. That's just a suspicion that must change, because it does not correspond to reality. Which must be the establishment is in accordance with the reality that can be witnessed by the eye, by feeling or based on a valid proposition.",
      "text_tafsir": "Ayat ini merupakan peringatan Allah dalam bentuk perintah agar waspada terhadap tingkah laku yang buruk itu. Keinginan untuk berlebih-lebihan dapat menyibukkan seseorang untuk mengerjakan pekerjaan yang tidak bermanfaat. Pendirian yang dianggapnya benar itu sebenarnya adalah salah. Itu hanya sangkaan belaka yang pasti berubah, karena tidak sesuai dengan kenyataan. Yang harus menjadi pendirian adalah yang sesuai dengan kenyataan yang dapat disaksikan oleh mata, oleh perasaan atau berdasarkan dalil sahih.",
      "text_translation": "Sekali-kali tidak! Sekiranya kamu mengetahui dengan pasti,",
      "text": "كَلَّا لَوْ تَعْلَمُوْنَ عِلْمَ الْيَقِيْنِۗ",
      "text_translation_en": "Nay, if you could but understand [it] with an understanding [born] of certainty,",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "In this verse, Allah describes some of the torments that the proud person will experience because of such negligence. They will be punished in the hereafter, and will surely see the place with their own eyes. Therefore, they should always ponder the severity of the torment in their minds to bring them good deeds and benefits. The meaning of the word \"see the underworld\" is to feel its torment, in accordance with the purpose of the Qur'an in its use of words.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan sebagian azab yang akan dialami oleh orang yang bermegah-megahan itu karena kelalaian tersebut. Mereka akan ditimpa azab di akhirat, dan pasti akan melihat tempat itu dengan mata kepala mereka sendiri. Oleh sebab itu, mereka hendaknya selalu merenungkan kedahsyatan azab itu dalam pikiran agar membawa mereka kepada perbuatan yang baik dan bermanfaat. Maksud perkataan \"melihat neraka Jahim\" adalah merasakan azabnya, sesuai dengan tujuan Al-Qur'an dalam pemakaian kata-kata tersebut.",
      "text_translation": "niscaya kamu benar-benar akan melihat neraka Jahim,",
      "text": "لَتَرَوُنَّ الْجَحِيْمَۙ",
      "text_translation_en": "you would indeed, most surely, behold the blazing fire [of hell]!",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "Then with this verse, God reinforces the content of the previous verse, that the punishment will be truly felt by the deceitful. Therefore, any and all groups should be held accountable to their Lord and refrain from acts that cause them to suffer. One must pay attention to the favors of God that are within him to be preserved and used in accordance with the function of the favors. They should also not commit crimes, create falsehoods, and hope for God's forgiveness only through the recognition of Islam by using profane names and titles, while violating the laws of the Qur'an and taking action the same as the enemy of Islam.",
      "text_tafsir": "Kemudian dengan ayat ini, Allah menguatkan isi ayat sebelumnya, bahwa azab itu benar-benar akan dirasakan oleh orang yang teperdaya itu. Oleh karena itu, siapa saja dan dari golongan apa saja hendaklah bertakwa kepada Tuhannya serta menghindari perbuatan-perbuatan yang menyebabkan mereka disiksa. Hendaknya seseorang itu memperhatikan nikmat-nikmat Allah yang ada padanya untuk dipelihara dan dipergunakan sesuai dengan fungsi nikmat tersebut. Juga hendaknya mereka tidak melakukan kejahatan, mengada-adakan kemungkaran, dan mengharap-harapkan ampunan Allah hanya semata-mata dengan pengakuan beragama Islam dengan memakai nama dan gelar yang muluk-muluk, sedangkan ia menyalahi hukum-hukum Al-Qur'an dan melakukan tindakan yang sama dengan musuh Islam.",
      "text_translation": "kemudian kamu benar-benar akan melihatnya dengan mata kepala sendiri,",
      "text": "ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِيْنِۙ",
      "text_translation_en": "In the end you will indeed, most surely, behold it with the eye of certainty:",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "God further strengthened His reproach upon them by saying that they would surely be asked that day about the pleasures they exerted in the world, what they had done with those favors. Whether they have fulfilled God's right to it, or whether they have kept the boundaries of God's law established in their enjoyment of the favor. If they don't, then know that those favors are the culmination of an accident in the hereafter. Narrated from the Prophet Muhammad, he said: Who among you who rises in the morning in peace or security in his place, healthy and well-nourished for his day, then it seems that the world with all its wealth has been entrusted to him. (History of al-Bukhari, Abu Dawud, at-Tirmidhi, and Ibn Majah of 'Ubaidillah bin Muhsan).",
      "text_tafsir": "Allah lebih memperkuat lagi celaan-Nya terhadap mereka dengan mengatakan bahwa sesungguhnya mereka akan ditanyai pada hari itu tentang kenikmatan-kenikmatan yang mereka megah-megahkan di dunia, apa yang mereka perbuat dengan nikmat-nikmat itu. Apakah mereka telah menunaikan hak Allah daripadanya, atau apakah mereka menjaga batas-batas hukum Allah yang telah ditentukan dalam bersenang-senang dengan nikmat tersebut. Jika mereka tidak melakukannya, ketahuilah bahwa nikmat-nikmat itu adalah puncak kecelakaan di hari akhirat.\n\nDiriwayatkan dari Nabi Muhammad, beliau berkata:\n\nBarangsiapa di antara kamu yang bangun pagi dalam keadaan aman sentosa pada dirinya atau aman di tempatnya, sehat wal afiat badannya serta mempunyai bekal hidup untuk harinya, maka seolah-olah dunia dengan segala kekayaannya telah diserahkan kepadanya. (Riwayat al-Bukhari, Abu Dawud, at-Tirmidhi, dan Ibnu Majah dari 'Ubaidillah bin Muhsan).",
      "text_translation": "kemudian kamu benar-benar akan ditanya pada hari itu tentang kenikmatan (yang megah di dunia itu).",
      "text": "ثُمَّ لَتُسْـَٔلُنَّ يَوْمَىِٕذٍ عَنِ النَّعِيْمِ ࣖ",
      "text_translation_en": "and on that Day you will most surely be called to account for [what you did with] the boon of life!",
      "juz_number": 30
    }
  },
  "name": "التكاثر",
  "name_translation_en": "Competition",
  "name_translation": "Bermegah-Megahan",
  "name_latin": "At-Takasur"
}