{
  "number": 104,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 9,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, God threatens that His wrath and punishment will come upon every one who curses, reproaches, and hurts them both before and behind them. The Word of God: O you who believe! Keep away from many prejudices, for some are sin and do not seek after other people's wrongdoings and let none of you persecute others. Do any of you like to eat the flesh of your dead brother? Of course you feel disgusted. And fear Allah, verily, Allah is the Beneficent, the Merciful. (al-justification \/ 49: 12)",
      "text_tafsir": "Dalam ayat ini, Allah mengancam bahwa kemurkaan dan azab-Nya akan ditimpakan kepada setiap orang yang mengumpat, mencela, dan menyakiti mereka baik di hadapan maupun di belakang mereka. Firman Allah:\n\nWahai orang-orang yang beriman! Jauhilah banyak dari prasangka, sesungguhnya sebagian prasangka itu dosa dan janganlah kamu mencari-cari kesalahan orang lain dan janganlah ada di antara kamu yang menggunjing sebagian yang lain. Apakah ada di antara kamu yang suka memakan daging saudaranya yang sudah mati? Tentu kamu merasa jijik. Dan bertakwalah kepada Allah, sesungguhnya Allah Maha Penerima tobat, Maha Penyayang. (al-hujurat\/49: 12)",
      "text_translation": "Celakalah bagi setiap pengumpat dan pencela,",
      "text": "وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍۙ",
      "text_translation_en": "WOE unto every slanderer, fault-finder!",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "This verse explains that people who hoard property are also threatened by hell because they enrich themselves and always calculate their wealth. That he did because he was very in love and happy with treasure as if there was no happiness and glory in life except with wealth. When he turns to his wealth, he feels that his position is higher than the people around him. He did not feel worried that disaster would befall him because he railed and tore the honor of others. Because of his pride, he forgets and is unaware that death is always with him, does not think about what will happen after death, nor does he contemplate what will happen to him.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang yang menimbun harta juga diancam neraka karena memperkaya diri sendiri serta selalu menghitung-hitung harta kekayaannya. Hal itu ia lakukan karena sangat cinta dan senangnya kepada harta seakan-akan tidak ada kebahagiaan dan kemuliaan dalam hidup kecuali dengan harta. Bila ia menoleh kepada hartanya yang banyak itu, ia merasakan bahwa kedudukannya sudah tinggi dari orang-orang sekelilingnya.\n\nDia tidak merasa khawatir akan ditimpa musibah karena mencerca dan merobek-robek kehormatan orang lain. Karena kecongkakannya, ia lupa dan tidak sadar bahwa maut selalu mengintainya, tidak memikirkan apa yang akan terjadi sesudah mati, dan tidak pula merenungkan apa-apa yang akan terjadi atas dirinya.",
      "text_translation": "yang mengumpulkan harta dan menghitung-hitungnya,",
      "text": " ۨالَّذِيْ جَمَعَ مَالًا وَّعَدَّدَهٗۙ",
      "text_translation_en": "[Woe unto him who amasses wealth and counts it a safeguard,",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "Then God made the mistake of swearing and cursing that the treasure he possessed would guarantee that he would live on forever. Therefore, his actions are the same as those of a person who will live forever and when he dies he will not come back to accept his crime for life.",
      "text_tafsir": "Kemudian Allah menyatakan kesalahan anggapan pengumpat dan pencerca bahwa harta yang dimilikinya itu menjaminnya akan tetap hidup di dunia selamanya. Oleh karena itu, tindakannya sama dengan tindakan orang yang akan hidup selama-lamanya dan bila ia mati tidak akan hidup kembali untuk menerima balasan atas kejahatannya selama hidup di dunia.",
      "text_translation": "dia (manusia) mengira bahwa hartanya itu dapat mengekalkannya.",
      "text": "يَحْسَبُ اَنَّ مَالَهٗٓ اَخْلَدَهٗۚ",
      "text_translation_en": "thinking that his wealth will make him live forever!",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "After threatening such people with severe torture, God also mentioned the reason for their actions in these disgusting acts. The reason is that they believe that all the possessions they have can help them with the difficulties they face. Threats in the form of the question, \"Who would have thought that his fortune could secure him from death?\" God answered, \"No! He will not be cast into the Hell of Hades, no one will pay attention to it, nor will he care.\" 'Ali bin Abi the rabbi once advised Kumail that the heirs would perish, while they were still alive, while the clerics would remain immortal even if their bodies had disappeared, because their virtues would remain in their hearts. In other words, the accumulation of wealth is condemned, ridiculed, and hated because humans do not get anything from their wealth. While scholars and scholars continue to be praised as long as there are people on earth who benefit from their knowledge.",
      "text_tafsir": "Sesudah mengancam orang-orang yang bersifat demikian dengan siksaan yang pedih, Allah menyebutkan pula sebab yang membuat mereka mengerjakan sifat-sifat yang terkutuk itu. Penyebabnya adalah anggapan mereka bahwa semua harta yang dimiliki dapat menolong mereka dalam menghadapi kesulitan-kesulitan yang dihadapi. Ancaman dalam bentuk pertanyaan, \"Siapakah yang menyangka bahwa hartanya itu dapat menjamin dirinya dari mati?\" Allah menjawab, \"Tidak! Sekali-kali tidak bahkan dia akan dilemparkan ke dalam neraka Huthamah, tidak ada yang memperhatikannya dan tidak pula yang mempedulikan.\"\n\n'Ali bin Abi thalib pernah memberi nasihat kepada Kumail bahwa orang-orang penimbun harta akan binasa, padahal mereka masih hidup, sedangkan para ulama akan kekal abadi meskipun jasad mereka sudah hilang, karena sifat-sifat keutamaan mereka tetap dikenang dalam hati. Maksudnya, penimbunan harta dikutuk, dicela, dan dibenci karena manusia tidak mendapat apa-apa dari harta mereka. Sedang para sarjana dan ulama terus-menerus terpuji selama terdapat di bumi orang-orang yang mengambil manfaat dari ilmu mereka.",
      "text_translation": "Sekali-kali tidak! Pasti dia akan dilemparkan ke dalam (neraka) Hutamah.",
      "text": "كَلَّا لَيُنْۢبَذَنَّ فِى الْحُطَمَةِۖ",
      "text_translation_en": "Nay, but [in the life to come such as] he shall indeed be abandoned to crushing torment!",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In these verses, God describes the power of Huthamah in the form of the question, \"Do you know what Huthamah is?\" God himself explained that Huthamah was the fire He provided to torment the wicked and the sinful. No one can know what it is except for the Creator.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menggambarkan kedahsyatan neraka Huthamah dalam bentuk pertanyaan, \"Tahukah engkau apa Huthamah?\" Allah menjelaskan sendiri bahwa Huthamah adalah api yang disediakan-Nya untuk menyiksa orang-orang yang durhaka dan berdosa. Tidak ada yang mampu mengetahui apa hakikatnya kecuali Allah penciptanya.",
      "text_translation": "Dan tahukah kamu apakah (neraka) Hutamah itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا الْحُطَمَةُ ۗ",
      "text_translation_en": "And what could make thee conceive what that crushing torment will be?",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "In these verses, God describes the power of Huthamah in the form of the question, \"Do you know what Huthamah is?\" God himself explained that Huthamah was the fire He provided to torment the wicked and the sinful. No one can know what it is except for the Creator.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menggambarkan kedahsyatan neraka Huthamah dalam bentuk pertanyaan, \"Tahukah engkau apa Huthamah?\" Allah menjelaskan sendiri bahwa Huthamah adalah api yang disediakan-Nya untuk menyiksa orang-orang yang durhaka dan berdosa. Tidak ada yang mampu mengetahui apa hakikatnya kecuali Allah penciptanya.",
      "text_translation": "(Yaitu) api  (azab) Allah yang dinyalakan,",
      "text": "نَارُ اللّٰهِ الْمُوْقَدَةُۙ",
      "text_translation_en": "A fire kindled by God,",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "Allah then states that the blazing fire is different from the fire of the world. He licked and ascended to the midriff, then entered the abdominal cavity to the chest and burned the heart. The heart is the one that feels the most pain from the other limbs. If the fire burns the heart, it means the torture he has reached its peak.",
      "text_tafsir": "Allah lalu menyatakan bahwa api yang menyala-nyala itu berbeda dengan api dunia. Ia menjilat dan naik sampai ke hulu hati, kemudian masuk ke dalam rongga perut sampai ke dada dan membakar hati. Hati adalah yang merasa paling sakit dari anggota-anggota badan lainnya. Apabila api sampai membakar hati, berarti siksa yang dirasakannya sudah sampai ke puncaknya.",
      "text_translation": "yang (membakar) sampai ke hati.",
      "text": "الَّتِيْ تَطَّلِعُ عَلَى الْاَفْـِٕدَةِۗ",
      "text_translation_en": "which will rise over the [guilty] hearts:",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "In this verse, God reveals that the fire is coating around them. They are not taken out of it nor are they able to go out on their own. In another verse, Allah says: Whenever they come out of it because of torment, they are returned (to it). (al-hajj \/ 22: 22)",
      "text_tafsir": "Dalam ayat ini, Allah mengungkapkan bahwa api tersebut berlapis-lapis mengelilingi mereka. Mereka tidak dikeluarkan daripadanya dan tidak pula mampu keluar sendiri. Dalam ayat lain, Allah berfirman:\n\nSetiap kali mereka hendak keluar darinya (neraka) karena tersiksa, mereka dikembalikan (lagi) ke dalamnya. (al-hajj\/22: 22)",
      "text_translation": "Sungguh, api itu ditutup rapat atas (diri) mereka,",
      "text": "اِنَّهَا عَلَيْهِمْ مُّؤْصَدَةٌۙ",
      "text_translation_en": "verily, it will close in upon them",
      "juz_number": 30
    },
    "9": {
      "text_tafsir_en": "Allah explains in this verse the condition of the inhabitants of the hell of Huthamah. According to Muqatil, the gates of hell were closed, while its occupants were tied to iron columns. The doors were never opened and there were full of all kinds of misery. The goal is to make them desperate for not being able to get out of the hell. May God save us from His wrath and preserve us from the power of the fire of Hell with His grace and grace.",
      "text_tafsir": "Allah menjelaskan melalui ayat ini keadaan orang-orang penghuni neraka Huthamah. Menurut Muqatil, pintu-pintu neraka itu ditutup rapat, sedangkan para penghuninya diikat pada tiang-tiang besi. Pintu-pintu itu tidak pernah dibuka dan di sana penuh dengan segala macam penderitaan. Tujuannya adalah untuk menjadikan mereka putus asa karena tidak dapat keluar dari neraka Huthamah itu. Semoga Allah menyelamatkan kita dari kemurkaan-Nya dan memelihara kita dari kedahsyatan api neraka dengan anugerah dan karunia-Nya.",
      "text_translation": "(sedang mereka itu) diikat pada tiang-tiang yang panjang.",
      "text": "فِيْ عَمَدٍ مُّمَدَّدَةٍ ࣖ",
      "text_translation_en": "in endless columns!",
      "juz_number": 30
    }
  },
  "name": "الهمزة",
  "name_translation_en": "The Traducer",
  "name_translation": "Pengumpat",
  "name_latin": "Al-Humazah"
}