{
  "number": 105,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 5,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this chapter, Allah reminds the Prophet Muhammad and his followers of an event that shows the greatness of God's power. The event was an invasion of an elephant army led by Abrahah's commander from Yemen to subdue the people of Mecca and demolish the Ka'bah. However, God destroyed them before the evil intentions were fulfilled. Elephant events are a very popular event among the Arabs, so they make dates for other events. The conclusion of his history is that a powerful warlord in Yemen wanted to take over the Ka'bah and destroy it, with the intention of forbidding Arabs from performing Hajj to the Ka'bah. His army then marched towards the Ka'ba with some elephants to scare it. When the troops arrived at a place called Muqammas (a place near Mecca), they rested there. The warlord sent his envoy to the people of Mecca to convey his purpose, not to fight the people but to destroy the Ka'bah. The people of Mecca became frightened and ran to the mountains around the Kaaba to see from afar what would happen and what the warlord would do. In this chapter, God also explained what happened to the army in the form of a question that Muhammad was not aware of in a very strange situation and a very terrible event that proved the power of God, His knowledge and wisdom to the army of elephants who wanted to destroy the Ka'bah. It is different from other events that have cause and effect.",
      "text_tafsir": "Dalam surah ini, Allah mengingatkan Nabi Muhammad dan pengikutnya dengan suatu peristiwa yang menunjukkan betapa besarnya kekuasaan Allah. Peristiwa itu adalah penyerbuan tentara gajah yang dipimpin oleh panglima Abrahah dari Yaman untuk menundukkan penduduk Mekah dan meruntuhkan Ka'bah. Akan tetapi, Allah membinasakan mereka sebelum maksud yang jahat itu tercapai. Peristiwa Gajah adalah suatu peristiwa yang paling terkenal di kalangan bangsa Arab, sehingga peristiwa ini mereka jadikan patokan tanggal bagi peristiwa-peristiwa lainnya.\n\nKesimpulan riwayatnya adalah bahwa seorang panglima perang yang berkuasa di Yaman ingin menguasai Ka'bah dan menghancurkannya, dengan maksud melarang orang-orang Arab mengerjakan haji ke Ka'bah. Lalu bala tentaranya bergerak menuju Ka'bah disertai beberapa ekor gajah untuk menakut-nakuti. Ketika iring-iringan angkatan perang tersebut tiba di suatu tempat bernama Muqammas (suatu tempat yang berdekatan dengan Mekah), mereka beristirahat di sana. Panglima perang mengirim utusannya kepada penduduk Mekah untuk menyampaikan maksudnya, yaitu bukan untuk memerangi penduduk tetapi untuk menghancurkan Ka'bah. Penduduk Mekah menjadi ketakutan dan lari ke gunung-gunung di sekeliling Ka'bah untuk melihat dari jauh apa yang akan terjadi dan apa yang akan dilakukan oleh panglima perang tersebut.\n\nDalam surah ini pula Allah menjelaskan apa yang terjadi terhadap pasukan bergajah dalam bentuk pertanyaan bahwa Muhammad tidak mengetahui keadaan yang sangat aneh dan peristiwa yang sangat dahsyat yang membuktikan kekuasaan Allah, ilmu dan hikmah-Nya yang tinggi terhadap tentara gajah yang ingin menghancurkan Ka'bah. Kejadian itu berbeda dengan kejadian lainnya yang mempunyai sebab dan akibat.",
      "text_translation": "Tidakkah engkau (Muhammad) perhatikan bagaimana Tuhanmu telah bertindak terhadap pasukan bergajah?",
      "text": "اَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِاَصْحٰبِ الْفِيْلِۗ",
      "text_translation_en": "ART THOU NOT aware of how thy Sustainer dealt with the Army of the Elephant?",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In this verse, God explains that He has failed to deceive those who want to destroy the Ka'bah. God revealed a way to thwart their deception, by sending a flock of birds that thronged them with rocks that came from the ground and made them crumble and their flesh fluttered everywhere. So the elephant army is like the leaves of a caterpillar.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa Ia telah menggagalkan tipu muslihat mereka yang hendak menghancurkan Ka'bah.\n\nAllah mengungkapkan cara menggagalkan tipu daya mereka, yaitu dengan mengirimkan pasukan burung yang berbondong-bondong melempari mereka dengan batu-batu yang berasal dari tanah sehingga menjadikan mereka hancur-lebur dan daging mereka beterbangan ke mana-mana. Maka tentara gajah menjadi laksana daun-daun yang dimakan ulat.",
      "text_translation": "Bukankah Dia telah menjadikan tipu daya mereka itu sia-sia?",
      "text": "اَلَمْ يَجْعَلْ كَيْدَهُمْ فِيْ تَضْلِيْلٍۙ",
      "text_translation_en": "Did He not utterly confound their artful planning?",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "In this verse, God explains that He has failed to deceive those who want to destroy the Ka'bah. God revealed a way to thwart their deception, by sending a flock of birds that thronged them with rocks that came from the ground and made them crumble and their flesh fluttered everywhere. So the elephant army is like the leaves of a caterpillar.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa Ia telah menggagalkan tipu muslihat mereka yang hendak menghancurkan Ka'bah.\n\nAllah mengungkapkan cara menggagalkan tipu daya mereka, yaitu dengan mengirimkan pasukan burung yang berbondong-bondong melempari mereka dengan batu-batu yang berasal dari tanah sehingga menjadikan mereka hancur-lebur dan daging mereka beterbangan ke mana-mana. Maka tentara gajah menjadi laksana daun-daun yang dimakan ulat.",
      "text_translation": "dan Dia mengirimkan kepada mereka burung yang berbondong-bondong,",
      "text": "وَّاَرْسَلَ عَلَيْهِمْ طَيْرًا اَبَابِيْلَۙ",
      "text_translation_en": "Thus, He let loose upon them great swarms of flying creatures",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "In this verse, God explains that He has failed to deceive those who want to destroy the Ka'bah. God revealed a way to thwart their deception, by sending a flock of birds that thronged them with rocks that came from the ground and made them crumble and their flesh fluttered everywhere. So the elephant army is like the leaves of a caterpillar.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa Ia telah menggagalkan tipu muslihat mereka yang hendak menghancurkan Ka'bah.\n\nAllah mengungkapkan cara menggagalkan tipu daya mereka, yaitu dengan mengirimkan pasukan burung yang berbondong-bondong melempari mereka dengan batu-batu yang berasal dari tanah sehingga menjadikan mereka hancur-lebur dan daging mereka beterbangan ke mana-mana. Maka tentara gajah menjadi laksana daun-daun yang dimakan ulat.",
      "text_translation": "yang melempari mereka dengan batu dari tanah liat yang dibakar,",
      "text": "تَرْمِيْهِمْ بِحِجَارَةٍ مِّنْ سِجِّيْلٍۙ",
      "text_translation_en": "which smote them with stone-hard blows of chastisement pre-ordained,",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, God explains that He has failed to deceive those who want to destroy the Ka'bah. God revealed a way to thwart their deception, by sending a flock of birds that thronged them with rocks that came from the ground and made them crumble and their flesh fluttered everywhere. So the elephant army is like the leaves of a caterpillar.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa Ia telah menggagalkan tipu muslihat mereka yang hendak menghancurkan Ka'bah.\n\nAllah mengungkapkan cara menggagalkan tipu daya mereka, yaitu dengan mengirimkan pasukan burung yang berbondong-bondong melempari mereka dengan batu-batu yang berasal dari tanah sehingga menjadikan mereka hancur-lebur dan daging mereka beterbangan ke mana-mana. Maka tentara gajah menjadi laksana daun-daun yang dimakan ulat.",
      "text_translation": "sehingga mereka dijadikan-Nya seperti daun-daun yang dimakan (ulat).",
      "text": "فَجَعَلَهُمْ كَعَصْفٍ مَّأْكُوْلٍ ࣖ ",
      "text_translation_en": "and caused them to become like a field of grain that has been eaten down to stubble",
      "juz_number": 30
    }
  },
  "name": "الفيل",
  "name_translation_en": "The Elephant",
  "name_translation": "Gajah",
  "name_latin": "Al-Fil"
}