{
  "number": 106,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 4,
  "ayat": {
    "1": {
      "text_tafsir_en": ". The first condition is derived from the sentence li li meaning meaning custom. 2. Preserve the good name, taken from the Qur'anic phrase because the Quraysh tribe or tribe was among the most noble tribes that gave birth to the Prophet Muhammad. So a trader should always maintain his reputation so that he can have the full trust of his subscribers, for he never lies or cheats, never misunderstands or hides the goods that the people and others need. 3. Conduct a business mission outside its territory, even abroad to expand its business environment and this requirement is taken from the sentence that means traveling. A trader will not succeed if he does not have a business mission outside his area. 4. Observe the situation favorably. He or she should pay attention to the climate, the situation, and the condition of the surrounding area. This term is derived from the sentence asy-shitai wa as-saif meaning: in winter and summer. The Quraysh also set up their business direction in the winter they traveled south to the state of Yemen, and in the summer north to the Syrian state. If all four of these conditions are met with careful attention it will bring about prosperity and prosperity never just to satisfy their passions. However, it should be used as a service to worship the God of the House and to use it to enjoy all the gifts of His providence, to produce prosperity, sufficient food and security from fear as stated in the sentence: \"Who fed them to quench their hunger and secure them from fear. \" So to be worshiped and to be praised is Allah the Owner of the Kaaba because near the Kaaba there is a kind of worship not found outside the city of Mecca which is tawaf in the House. Considering how tawaf is strange, because according to the natural law of each object surrounding another, it will gradually extend away from its headquarters or rotation point in accordance with sentrivical force or leaping force. If a stone is tied to a rope and is rotated then the stone that is missed must be thrown far out. Similarly in the field of spirituality, a merchant who was diligent in prayer and attended the study of clerics in his village after traveling abroad often distances himself from the mosque and his clergy. If he were to travel abroad he would have gone further from his religious source. This is not the case for people who are in the house of prayer. Although he went around seven times, he remained next to the House. Likewise, every trader who has become a tycoon or millionaire is constantly striving to worship God continuously (the court). (1-2) In the following verses, God describes the profession of the Quraysh as a merchant in a barren country with two majors in trade. In the winter to Yemen to buy spices coming from the Far East through the Persian Gulf and the second to Sham in the summer to buy agricultural produce that will bring them back to their dry land. The inhabitants of the desert (Bedouins) respect the Quraysh because they are considered neighbors (neighbors) of the House, residents of the holy land and serve to protect the Ka'bah, and keepers of the Ka'bah. Therefore, the Quraysh are safe and sound, either on their way or on their way home despite numerous robberies on the way. Because reverence for the House is a strength of soul and authority to preserve their safety in its trade missions north or south; until it became a habit and a favorite for business that made a lot of profit. The reverence of the House that met the Arab's soul was the will of God alone, especially as they saw how God destroyed the elephant army that wanted to destroy the Ka'bah, before they could approach it. If the homage to the House had little effect on the Arabs or none at all, the Quraysh people would have no intention of conducting such trade trips. Thus their resources will be depleted because their land is not fertile.",
      "text_tafsir": ". Syarat pertama ini diambil dari kalimat li ilaf yang artinya karena kebiasaan.\n\n2.Memelihara nama baik, yang diambil dari kalimat Quraisy sebab suku atau kabilah Quraisy itu termasuk kabilah yang paling mulia yang nantinya melahirkan Nabi Muhammad. Maka seorang pedagang pun harus selalu memelihara nama baiknya sehingga dapat kepercayaan yang penuh dari sekalian langganannya, karena tidak pernah dusta atau menipu, tidak pernah menyalahi janji atau menimbun barang-barang yang dibutuhkan oleh rakyat dan lain-lain.\n\n3.Mengadakan misi perniagaan ke luar daerahnya, bahkan ke luar negeri untuk melebarluaskan daerah lingkungan perniagaannya dan syarat ini diambil dari kalimat rihlah yang artinya bepergian. Seorang pedagang tidak akan maju jika tidak mengadakan misi perniagaan ke luar daerahnya.\n\n4.Memperhatikan situasi keadaan yang menguntungkan. Ia harus memperhatikan iklim, situasi, dan kondisi tempat di sekitarnya. Syarat ini diambil dari kalimat asy-syita'i wa as-saif yang artinya: pada musim dingin dan musim panas. Orang-orang Quraisy pun mengatur arah perniagaannya yaitu di musim dingin mereka pergi ke sebelah selatan yaitu negeri Yaman, dan di musim panas ke utara yaitu negeri Syam. \n\nJika keempat syarat ini diperhatikan dengan seksama niscaya akan mendatangkan kemakmuran yang merata dan kemakmuran itu jangan sekali-kali hanya untuk memuaskan hawa nafsu. Akan tetapi, harus dijadikan bekal untuk beribadah kepada Allah yang mempunyai Baitullah dan digunakan untuk menyukuri segala nikmat pemberian-Nya, agar menghasilkan kesejahteraan, cukup sandang-pangan dan keamanan dari ketakutan seperti diisyaratkan dalam kalimat: \"Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan.\"\n\nJadi yang harus disembah dan disyukuri itu ialah Allah Pemilik Ka'bah sebab di dekat Ka'bah itu ada satu macam ibadah yang tidak terdapat di luar kota Mekah yaitu tawaf di Baitullah.\n\nJika diperhatikan cara tawaf itu memang aneh sekali, sebab menurut hukum alam setiap benda yang mengelilingi benda lain, lama-lama akan bertambah jauh dari markasnya atau titik putarnya sesuai dengan daya sentrivical atau daya lompatan ke luar. Jika sebuah batu diikat dengan tali lalu diputarkan maka bila batu itu terlepas mesti terlempar jauh ke luar. Demikian pula dalam bidang kerohanian, seorang pedagang yang tadinya rajin salat berjamaah dan menghadiri pengajian pada ulama di kampungnya setelah sering bepergian ke luar daerah maka ia bertambah jauh dari masjid dan ulamanya.\n\nJika ia bepergian ke luar negeri tentu akan bertambah jauh lagi dari sumber agamanya. Tidak demikian keadaan orang yang sedang tawaf di Baitullah. Walaupun ia berkeliling sampai tujuh kali, tetapi ia tetap berada di samping Baitullah. Demikian pula hendaknya setiap pedagang yang telah menjadi hartawan atau jutawan tetap saja tekun melaksanakan ibadahnya kepada Allah secara terus-menerus (istikamah).\n\n(1-2) Dalam ayat-ayat berikut ini, Allah menerangkan profesi suku Quraisy sebagai kaum pedagang di negara yang tandus dan mempunyai dua jurusan perdagangan. Pada musim dingin ke arah Yaman untuk membeli rempah-rempah yang datang dari Timur Jauh melalui Teluk Persia dan yang kedua ke arah Syam pada musim panas untuk membeli hasil pertanian yang akan dibawa pulang ke negeri mereka yang tandus lagi kering itu.\n\nOrang-orang penghuni padang pasir (Badui) menghormati suku Quraisy karena mereka dipandang sebagai jiran (tetangga) Baitullah, penduduk tanah suci dan berkhidmat untuk memelihara Ka'bah, dan penjaga-penjaga Ka'bah. Oleh karena itu, suku Quraisy berada dalam aman dan sentosa, baik ketika mereka pergi maupun ketika mereka pulang walaupun banyak terjadi perampokan dalam perjalanan.\n\nKarena rasa hormat kepada Baitullah itu merupakan suatu kekuatan jiwa dan berwibawa untuk memelihara keselamatan mereka dalam misi-misi perdagangannya ke utara atau ke selatan; sehingga timbullah suatu kebiasaan dan kegemaran untuk berniaga yang menghasilkan banyak rezeki. Rasa hormat terhadap Baitullah yang memenuhi jiwa orang Arab itu adalah kehendak Allah semata, lebih-lebih lagi ketika mereka melihat bagaimana Allah menghancurkan tentara gajah yang ingin meruntuhkan Ka'bah, sebelum mereka sampai mendekatinya.\n\nSekiranya penghormatan terhadap Baitullah kurang mempengaruhi jiwa orang-orang Arab atau tidak ada sama sekali pengaruhnya niscaya orang-orang Quraisy tentu tidak mau mengadakan perjalanan-perjalanan perdagangan tersebut. Maka dengan demikian akan berkuranglah sumber-sumber rezeki mereka sebab negeri mereka bukanlah tanah yang subur.",
      "text_translation": "Karena kebiasaan orang-orang Quraisy,",
      "text": "لِاِيْلٰفِ قُرَيْشٍۙ",
      "text_translation_en": "SO THAT the Quraysh might remain secure,",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": ". The first condition is derived from the sentence li li meaning meaning custom. 2. Preserve the good name, taken from the Qur'anic phrase because the Quraysh tribe or tribe was among the most noble tribes that gave birth to the Prophet Muhammad. So a trader should always maintain his reputation so that he can have the full trust of his subscribers, for he never lies or cheats, never misunderstands or hides the goods that the people and others need. 3. Conduct a business mission outside its territory, even abroad to expand its business environment and this requirement is taken from the sentence that means traveling. A trader will not succeed if he does not have a business mission outside his area. 4. Observe the situation favorably. He or she should pay attention to the climate, the situation, and the condition of the surrounding area. This term is derived from the sentence asy-shitai wa as-saif meaning: in winter and summer. The Quraysh also set up their business direction in the winter they traveled south to the state of Yemen, and in the summer north to the Syrian state. If all four of these conditions are met with careful attention it will bring about prosperity and prosperity never just to satisfy their passions. However, it should be used as a service to worship the God of the House and to use it to enjoy all the gifts of His providence, to produce prosperity, sufficient food and security from fear as stated in the sentence: \"Who fed them to quench their hunger and secure them from fear. \" So to be worshiped and to be praised is Allah the Owner of the Kaaba because near the Kaaba there is a kind of worship not found outside the city of Mecca which is tawaf in the House. Considering how tawaf is strange, because according to the natural law of each object surrounding another, it will gradually extend away from its headquarters or rotation point in accordance with sentrivical force or leaping force. If a stone is tied to a rope and is rotated then the stone that is missed must be thrown far out. Similarly in the field of spirituality, a merchant who was diligent in prayer and attended the study of clerics in his village after traveling abroad often distances himself from the mosque and his clergy. If he were to travel abroad he would have gone further from his religious source. This is not the case for people who are in the house of prayer. Although he went around seven times, he remained next to the House. Likewise, every trader who has become a tycoon or millionaire is constantly striving to worship God continuously (the court). (1-2) In the following verses, God describes the profession of the Quraysh as a merchant in a barren country with two majors in trade. In the winter to Yemen to buy spices coming from the Far East through the Persian Gulf and the second to Sham in the summer to buy agricultural produce that will bring them back to their dry land. The inhabitants of the desert (Bedouins) respect the Quraysh because they are considered neighbors (neighbors) of the House, residents of the holy land and serve to protect the Ka'bah, and keepers of the Ka'bah. Therefore, the Quraysh are safe and sound, either on their way or on their way home despite numerous robberies on the way. Because reverence for the House is a strength of soul and authority to preserve their safety in its trade missions north or south; until it became a habit and a favorite for business that made a lot of profit. The reverence of the House that met the Arab's soul was the will of God alone, especially as they saw how God destroyed the elephant army that wanted to destroy the Ka'bah, before they could approach it. If the homage to the House had little effect on the Arabs or none at all, the Quraysh people would have no intention of conducting such trade trips. Thus their resources will be depleted because their land is not fertile.",
      "text_tafsir": ". Syarat pertama ini diambil dari kalimat li ilaf yang artinya karena kebiasaan.\n\n2.Memelihara nama baik, yang diambil dari kalimat Quraisy sebab suku atau kabilah Quraisy itu termasuk kabilah yang paling mulia yang nantinya melahirkan Nabi Muhammad. Maka seorang pedagang pun harus selalu memelihara nama baiknya sehingga dapat kepercayaan yang penuh dari sekalian langganannya, karena tidak pernah dusta atau menipu, tidak pernah menyalahi janji atau menimbun barang-barang yang dibutuhkan oleh rakyat dan lain-lain.\n\n3.Mengadakan misi perniagaan ke luar daerahnya, bahkan ke luar negeri untuk melebarluaskan daerah lingkungan perniagaannya dan syarat ini diambil dari kalimat rihlah yang artinya bepergian. Seorang pedagang tidak akan maju jika tidak mengadakan misi perniagaan ke luar daerahnya.\n\n4.Memperhatikan situasi keadaan yang menguntungkan. Ia harus memperhatikan iklim, situasi, dan kondisi tempat di sekitarnya. Syarat ini diambil dari kalimat asy-syita'i wa as-saif yang artinya: pada musim dingin dan musim panas. Orang-orang Quraisy pun mengatur arah perniagaannya yaitu di musim dingin mereka pergi ke sebelah selatan yaitu negeri Yaman, dan di musim panas ke utara yaitu negeri Syam. \n\nJika keempat syarat ini diperhatikan dengan seksama niscaya akan mendatangkan kemakmuran yang merata dan kemakmuran itu jangan sekali-kali hanya untuk memuaskan hawa nafsu. Akan tetapi, harus dijadikan bekal untuk beribadah kepada Allah yang mempunyai Baitullah dan digunakan untuk menyukuri segala nikmat pemberian-Nya, agar menghasilkan kesejahteraan, cukup sandang-pangan dan keamanan dari ketakutan seperti diisyaratkan dalam kalimat: \"Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan.\"\n\nJadi yang harus disembah dan disyukuri itu ialah Allah Pemilik Ka'bah sebab di dekat Ka'bah itu ada satu macam ibadah yang tidak terdapat di luar kota Mekah yaitu tawaf di Baitullah.\n\nJika diperhatikan cara tawaf itu memang aneh sekali, sebab menurut hukum alam setiap benda yang mengelilingi benda lain, lama-lama akan bertambah jauh dari markasnya atau titik putarnya sesuai dengan daya sentrivical atau daya lompatan ke luar. Jika sebuah batu diikat dengan tali lalu diputarkan maka bila batu itu terlepas mesti terlempar jauh ke luar. Demikian pula dalam bidang kerohanian, seorang pedagang yang tadinya rajin salat berjamaah dan menghadiri pengajian pada ulama di kampungnya setelah sering bepergian ke luar daerah maka ia bertambah jauh dari masjid dan ulamanya.\n\nJika ia bepergian ke luar negeri tentu akan bertambah jauh lagi dari sumber agamanya. Tidak demikian keadaan orang yang sedang tawaf di Baitullah. Walaupun ia berkeliling sampai tujuh kali, tetapi ia tetap berada di samping Baitullah. Demikian pula hendaknya setiap pedagang yang telah menjadi hartawan atau jutawan tetap saja tekun melaksanakan ibadahnya kepada Allah secara terus-menerus (istikamah).\n\n(1-2) Dalam ayat-ayat berikut ini, Allah menerangkan profesi suku Quraisy sebagai kaum pedagang di negara yang tandus dan mempunyai dua jurusan perdagangan. Pada musim dingin ke arah Yaman untuk membeli rempah-rempah yang datang dari Timur Jauh melalui Teluk Persia dan yang kedua ke arah Syam pada musim panas untuk membeli hasil pertanian yang akan dibawa pulang ke negeri mereka yang tandus lagi kering itu.\n\nOrang-orang penghuni padang pasir (Badui) menghormati suku Quraisy karena mereka dipandang sebagai jiran (tetangga) Baitullah, penduduk tanah suci dan berkhidmat untuk memelihara Ka'bah, dan penjaga-penjaga Ka'bah. Oleh karena itu, suku Quraisy berada dalam aman dan sentosa, baik ketika mereka pergi maupun ketika mereka pulang walaupun banyak terjadi perampokan dalam perjalanan.\n\nKarena rasa hormat kepada Baitullah itu merupakan suatu kekuatan jiwa dan berwibawa untuk memelihara keselamatan mereka dalam misi-misi perdagangannya ke utara atau ke selatan; sehingga timbullah suatu kebiasaan dan kegemaran untuk berniaga yang menghasilkan banyak rezeki. Rasa hormat terhadap Baitullah yang memenuhi jiwa orang Arab itu adalah kehendak Allah semata, lebih-lebih lagi ketika mereka melihat bagaimana Allah menghancurkan tentara gajah yang ingin meruntuhkan Ka'bah, sebelum mereka sampai mendekatinya.\n\nSekiranya penghormatan terhadap Baitullah kurang mempengaruhi jiwa orang-orang Arab atau tidak ada sama sekali pengaruhnya niscaya orang-orang Quraisy tentu tidak mau mengadakan perjalanan-perjalanan perdagangan tersebut. Maka dengan demikian akan berkuranglah sumber-sumber rezeki mereka sebab negeri mereka bukanlah tanah yang subur.",
      "text_translation": "(yaitu) kebiasaan mereka bepergian pada musim dingin dan musim panas.",
      "text": "اٖلٰفِهِمْ رِحْلَةَ الشِّتَاۤءِ وَالصَّيْفِۚ",
      "text_translation_en": "secure in their winter and summer journeys,",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "In this verse, God instructs the Quraysh people to worship the Lord of the Kaaba who saved them from the attack of the Ethiopians who joined the elephant army. In essence, they worship only God and glorify Him.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan orang-orang Quraisy agar mereka menyembah Tuhan Pemilik Ka'bah yang telah menyelamatkan mereka dari serangan orang Ethiopia yang bergabung dalam tentara gajah. Seyogyanya mereka hanya menyembah Allah dan mengagungkan-Nya.",
      "text_translation": "Maka hendaklah mereka menyembah Tuhan (pemilik) rumah ini (Ka‘bah),",
      "text": "فَلْيَعْبُدُوْا رَبَّ هٰذَا الْبَيْتِۙ",
      "text_translation_en": "Let them, therefore, worship the Sustainer of this Temple;",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "Then God explained the nature of the Lord of the Kaaba who was asked to worship, namely, the Lord who opened the door of their great provision and made it easy for them to find that provision. If not, they would have been in pain and suffering. He secures the path they take in their quest for sustenance, and makes those whom they find happy on their journey. They don't find it difficult. If not, of course they are always in fear that leads to miserable life and daddy.",
      "text_tafsir": "Kemudian Allah menjelaskan sifat Tuhan Pemilik Ka'bah yang disuruh untuk disembah itu, yaitu Tuhan yang membuka pintu rezeki yang luas bagi mereka dan memudahkan jalan untuk mencari rezeki itu. Jika tidak demikian, tentu mereka berada dalam kesempitan dan kesengsaraan. Dia mengamankan jalan yang mereka tempuh dalam rangka mereka mencari rezeki, serta menjadikan orang-orang yang mereka jumpai dalam perjalanan senang dengan mereka. Mereka tidak menemui kesulitan. Kalau tidak, tentu mereka selalu berada dalam ketakutan yang mengakibatkan hidup sengsara dan papa.",
      "text_translation": "yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari rasa ketakutan.",
      "text": "الَّذِيْٓ اَطْعَمَهُمْ مِّنْ جُوْعٍ ەۙ وَّاٰمَنَهُمْ مِّنْ خَوْفٍ ࣖ",
      "text_translation_en": "who has given them food against hunger, and made them safe from danger.",
      "juz_number": 30
    }
  },
  "name": "قريش",
  "name_translation_en": "Quraysh",
  "name_translation": "Quraisy",
  "name_latin": "Quraisy"
}