{
  "number": 108,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 3,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, Allah explains that He has given the Prophet Muhammad many good and undeserved gifts and cannot be valued in great esteem, even though (disbelievers) despise and disregard the gift because of their lack of understanding and understanding. They are prophecies, true religions, straightforward guides and paths that lead to happiness in life here and in the hereafter. The monks of Mecca and the hypocrites in Medina derided and ridiculed the Prophet as follows: 1. The followers of Muhammad saw consisted of ordinary people with no position. If the religion he carried was true, it would have been his followers the virtuous people who had settled among them. This saying is not strange, for the people of Noah used to say this to Noah as the word of God said: \"The leaders of the disbelievers said,\" We do not see you, but only a (ordinary) people like us, and We do not look at those who follow you, but of those who are despised among us. We do not see that you have any advantage over us, but we consider you a liar. \" (Hud \/ 11: 27) The Sunnatullah who used among the servants of God said that those who were quick to accept the call of the apostles were ordinary or weak people because they were not afraid to lose their rank or position, because they had neither. So there was constant strife between the feelers and the apostles, but God always helped His apostles and supported them. Such was the attitude of the people of Mecca to the preaching of the Prophet Muhammad. The nobles and the people around him would not follow the Prophet out of hatred for him and for the common people who were his followers. 2. The people of Mecca when they saw the children of the Prophet Muhammad died, they said, \"The mention of Muhammad will perish and he will die.\" They thought that death was a defect and they mocked the Prophet and tried to keep humanity away from him. 3. The people of Mecca when they saw a tragedy or difficulty encountered the followers of the Prophet, rejoiced and rejoiced. They waited for the destruction of the followers of the Prophet, until they regained their position as the new religion shook it. In this chapter, God tells His apostles that the accusations put forth by the Muslims are a meaningless prejudice. But all this was to cleanse the souls who were still affected by these issues and to break the deception of the Muslims, to know that the Prophet's struggle would surely prevail and that his followers would increase. Al-Kautsar is interpreted as a river in heaven that Allah bestowed on the Prophet Muhammad, and some think that al-kautsar means much good.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa Dia telah memberi Nabi Muhammad nikmat dan anugerah yang tidak dapat dihitung banyaknya dan tidak dapat dinilai tinggi mutunya, walaupun (orang musyrik) memandang hina dan tidak menghargai pemberian itu disebabkan kekurangan akal dan pengertian mereka. Pemberian itu berupa kenabian, agama yang benar, petunjuk-petunjuk dan jalan yang lurus yang membawa kepada kebahagiaan hidup di dunia dan di akhirat.\n\nOrang-orang musyrik di Mekah dan orang-orang munafik di Medinah mencemoohkan dan mencaci-maki Nabi saw sebagai berikut:\n\n1.Pengikut-pengikut Muhammad saw terdiri dari orang-orang biasa yang tidak mempunyai kedudukan. Kalau agama yang dibawanya itu benar, tentu yang menjadi pengikut-pengikutnya orang-orang mulia yang berkedudukan di antara mereka. Ucapan ini bukanlah suatu keanehan, karena kaum Nuh juga dahulu kala telah menyatakan yang demikian kepada Nabi Nuh as sebagaimana firman Allah:\n\nMaka berkatalah para pemuka yang kafir dari kaumnya, \"Kami tidak melihat engkau, melainkan hanyalah seorang manusia (biasa) seperti kami, dan kami tidak melihat orang yang mengikuti engkau, melainkan orang yang hina dina di antara kami yang lekas percaya. Kami tidak melihat kamu memiliki suatu kelebihan apa pun atas kami, bahkan kami menganggap kamu adalah orang pendusta.\" (Hud\/11 : 27)\n\nSunnatullah yang berlaku di antara hamba-hamba Allah bahwa mereka yang cepat menerima panggilan para rasul adalah orang-orang biasa atau orang lemah karena mereka tidak takut kehilangan pangkat atau kedudukan, karena tidak mempunyai keduanya. Dari itu pertentangan terus-menerus terjadi antara yang merasa terpandang dengan para rasul, tetapi Allah senantiasa membantu para rasul-Nya dan menunjang dakwah mereka.\n\nBegitulah sikap penduduk Mekah terhadap dakwah Nabi Muhammad. Pembesar-pembesar dan orang-orang yang berkedudukan tidak mau mengikuti Nabi karena benci kepada beliau dan terhadap orang-orang biasa yang menjadi pengikut beliau.\n\n2.Orang-orang Mekah bila melihat anak-anak Nabi Muhammad meninggal dunia, mereka berkata, \"Sebutan Muhammad akan lenyap dan ia akan mati punah.\" Mereka mengira bahwa kematian itu suatu kekurangan lalu mereka mengejek Nabi dan berusaha menjauhkan manusia dari beliau.\n\n3.Orang-orang Mekah bila melihat suatu musibah atau kesulitan yang menimpa pengikut-pengikut Nabi, bergembira dan bersenang hati. Mereka menunggu kehancuran para pengikut Nabi, sehingga kedudukan mereka semula yang telah diguncangkan oleh agama baru itu kembali mereka peroleh.\n\nPada surah ini, Allah menyampaikan kepada rasul-Nya, bahwa tuduhan-tuduhan yang dilontarkan oleh orang-orang musyrik itu adalah suatu prasangka yang tidak ada artinya sama sekali. Namun semua itu adalah untuk membersihkan jiwa-jiwa yang masih dapat dipengaruhi oleh isu-isu tersebut dan untuk mematahkan tipu daya orang-orang musyrik, agar mereka mengetahui bahwa perjuangan Nabi saw pasti akan menang dan pengikut-pengikut beliau pasti akan bertambah banyak. \n\nAl-Kautsar diartikan sebagai sungai di surga yang dianugerahkan Allah kepada Nabi Muhammad, dan ada pula yang berpendapat bahwa al-kautsar bermakna kebaikan yang banyak.",
      "text_translation": "Sungguh, Kami telah memberimu (Muhammad) nikmat yang banyak.",
      "text": "اِنَّآ اَعْطَيْنٰكَ الْكَوْثَرَۗ",
      "text_translation_en": "BEHOLD, We have bestowed upon thee good in abundance:",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad to perform the prayers and to sacrifice animal sacrifices for Allah alone, for He alone taught and bestowed His bounty. In another verse, Allah says: Say: \"My prayer, my worship, my life and my death are for Allah, the Lord of the worlds, there is no ally in him; (Muslims). \" (al-An'am \/ 6: 162-163)",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad agar mengerjakan salat dan menyembelih hewan kurban karena Allah semata, karena Dia sajalah yang mendidiknya dan melimpahkan karunia-Nya. Dalam ayat lain, Allah berfirman:\n\nKatakanlah (Muhammad), \"Sesungguhnya salatku, ibadahku, hidupku dan matiku hanyalah untuk Allah, Tuhan seluruh alam, tidak ada sekutu bagi-Nya; dan demikianlah yang diperintahkan kepadaku dan aku adalah orang yang pertama-tama berserah diri (muslim).\" (al-An'am\/6: 162-163)",
      "text_translation": "Maka laksanakanlah salat karena Tuhanmu, dan berkurbanlah (sebagai ibadah dan mendekatkan diri kepada Allah).",
      "text": "فَصَلِّ لِرَبِّكَ وَانْحَرْۗ",
      "text_translation_en": "hence, pray unto thy Sustainer [alone], and sacrifice [unto Him alone].",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "After Allah had comforted and delighted the Prophet Muhammad and commanded him to be grateful for his gifts and for the fulfillment of his favor, Allah made the enemies of the Prophet despised and helpless. Whoever hates and insults the Prophet will lose his influence and there will be no happiness for him in this world and in the hereafter. The good and the results of the struggle will remain successful until the Day of Judgment. The disbelievers of Mecca scoffed at the Prophet Muhammad not because they disliked the Prophet's personality, but because he denounced their folly and mocked the idols they worshiped and urged them to abandon the idolatry. Allah has kept His promise by humiliating and degrading those who insulted the Prophet Muhammad, so that their names are only remembered when it comes to the wicked and their evil deeds. As for the position of the Prophet and the people who received his guidance and their glorious name, Allah exalted him above all time.",
      "text_tafsir": "Sesudah Allah menghibur dan menggembirakan Nabi Muhammad serta memerintahkan supaya mensyukuri anugerah-anugerah-Nya dan sebagai kesempurnaan nikmat-Nya, maka Allah menjadikan musuh-musuh Nabi itu jadi hina dan tidak berdaya. Siapa saja yang membenci dan mencaci Nabi akan hilang pengaruhnya dan tidak ada kebahagiaan baginya di dunia dan di akhirat. Sedang kebaikan dan hasil perjuangan akan tetap jaya sampai hari Kiamat.\n\nOrang-orang kafir Mekah mencaci Nabi Muhammad bukanlah karena mereka tidak senang kepada pribadi Nabi, tetapi karena beliau mencela kebodohan mereka dan mencaci berhala-berhala yang mereka sembah serta mengajak mereka untuk meninggalkan penyembahan berhala-berhala itu.\n\nSungguh Allah telah menepati janji-Nya dengan menghinakan dan menjatuhkan martabat orang-orang yang mencaci Nabi Muhammad, sehingga nama mereka hanya diingat ketika membicarakan orang-orang jahat dan kejahatannya. Adapun kedudukan Nabi saw dan orang-orang yang menerima petunjuk beliau serta nama harum mereka diangkat setinggi-tingginya oleh Allah sepanjang masa.",
      "text_translation": "Sungguh, orang-orang yang membencimu dialah yang terputus (dari rahmat Allah).",
      "text": "اِنَّ شَانِئَكَ هُوَ الْاَبْتَرُ ࣖ",
      "text_translation_en": "Verily, he that hates thee has indeed been cut off [from all that is good]!",
      "juz_number": 30
    }
  },
  "name": "الكوثر",
  "name_translation_en": "Abundance",
  "name_translation": "Pemberian Yang Banyak",
  "name_latin": "Al-Kausar"
}