{
  "number": 111,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 5,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse Allah explains that Abu Lahab is doomed and perish and these words are a curse from Allah for him. Both hands are destroyed because the hand is a tool for work and action. When one person's hands are gone, it is gone. It is said to be Abu Lahab, when his name was Abdul-'Uzza, because he had a handsome face. But the scholars argue that it was said by Abu Lahab that he must have been a fiery resident of hell. It is as if the communists chose the red herbs and the left because the left were ashabic. The beginning of this verse is a curse on the destruction of Abu Lahab and the closing is a testimony from Allah that the curse has been proven and that Abu Lahab must be lost in the world and in the hereafter. When the verse of the Tabernacle of Abi lahabin watabba came down, Umm Jamil al-'AurA (the woman with the blind eye) the harb came in and shouted. It carries a slap of stone, as they say. \"He denies (our religion), we reject. His religion we hate and his command we protest.\" It was then that the Prophet saw. sitting in the mosque with Abu Bakr. When Abu Bakr saw the woman, he said, O Messenger of Allah, that woman has come. I was worried that he would see you. \"Then the Messenger of Allah (may peace be upon him) said,\" He will not see me. \"Then the Prophet read a verse and covered it with the verse. He read\" And when you read the Qur'an, The unbeliever stood in front of Abu Bakr, but he could not see the Messenger of Allah (may peace be upon him). He said, \"O Abu Bakr, I heard that your friend had insulted me.\" Abu Bakr said, \"No. . For the sake of the Lord of the Kaaba. She did not scold you. \"Then the woman turned and said,\" The Quraysh know that I am the daughter of the king. \"",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa Abu Lahab akan rugi dan binasa dan kata-kata ini sebagai kutukan dari Allah baginya. Binasa pada kedua belah tangannya karena tangan adalah alat bekerja dan bertindak. Bila kedua belah tangan seseorang telah binasa, berarti ia telah binasa.\n\nDikatakan Abu Lahab, padahal namanya Abdul-'Uzza, karena ia berwajah tampan menawan. Namun para ulama berpendapat bahwa dikatakan Abu Lahab karena ia pasti menjadi penghuni neraka yang bergejolak apinya. Hal itu seperti orang komunis memilih syiar merah dan golongan kiri karena golongan kiri adalah ashabusy-syimal.\n\nPermulaan ayat ini adalah kutukan atas kebinasaan Abu Lahab dan penutupnya adalah sebagai keterangan dari Allah bahwa kutukan tersebut telah terbukti dan Abu Lahab pasti rugi di dunia dan di akhirat.\n\nKetika ayat tabbat yadA abi lahabin watabba turun, Ummu Jamil al-'AurA (wanita yang sebelah matanya buta) binti harb datang sambil berteriak-teriak. Ia membawa batu sekepalan tangan, seraya berkata. \"Dia mencela (agama kami), kami menolak. Agamanya kami benci dan perintahnya kami bantah.\" Ketika itu Nabi saw. duduk di dalam masjid bersama Abu Bakar. Ketika Abu Bakar melihat wanita itu, beliau berkata, Wahai Rasulullah, wanita itu telah datang. Saya khawatir dia melihatmu.\" Maka Rasulullah saw. berkata \"Dia tidak akan melihatku.\" Kemudian Nabi membaca sebuah ayat dan berlindung dengan menggunakan ayat itu. Beliau membaca \"Dan apabila kamu membaca Al-Qur'an, kami jadikan diantara kamu dan orang-orang yang tidak beriman itu penghalang yang tertutup.\" Wanita itu berdiri di depan Abu Bakar, namum ia tidak bisa melihat Rasulullah saw. Ia berkata, \"Hai Abu Bakar, aku mendapat kabar bahwa temanmu itu telah menghinaku.\" Abu Bakar berkata, \"Tidak. Demi Tuhan Pemilik Ka'bah. Dia tidak mencelamu.\" Lalu wanita itu berpaling sambil berkata, \"Kaum Quraisy telah tahu kalau aku adalah putri pembesarnya.\" (Riwayat al-hakim)",
      "text_translation": "Binasalah kedua tangan Abu Lahab dan benar-benar binasa dia!",
      "text": "تَبَّتْ يَدَآ اَبِيْ لَهَبٍ وَّتَبَّۗ",
      "text_translation_en": "DOOMED are the hands of him of the glowing countence: and doomed is he!",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In this verse, Allah explains that what Abu Lahab is proud of in life, that is, wealth and position, does not seem to be able to save him from the doom of Allah on the Day of Resurrection. Similarly, his efforts to defeat and defeat the Prophet Muhammad were not successful at all. Abu Lahab hated the Prophet (saws) most strongly and urged the people to oppose him and the most ruthless against him. Raba'ah bin 'Ubbad said: I saw the Prophet Muhammad at the time of Ignorance in the market of dzu al-Majaz saying, \"Say there is no God but God will make you happy!\" People gathered around him. Behind him was a man, white in color, with his eyes closed, with two strands of hair on his head, saying, \"He (Muhammad) is a religious man and a liar.\" He followed the Prophet wherever he went, and I asked, \"Who is that man?\" They replied, \"That is Abu Lahab's own uncle.\" (Ahmad's History) It is thus explained that Abu Lahab was always against the truth and kept people from following the truth. He claimed that the Prophet Muhammad was a liar. It also goes against him and undermines the religious values and values he brings.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa apa yang menjadi kebanggaan Abu Lahab dalam hidup, yaitu harta dan kedudukan, ternyata sama sekali tidak dapat menyelamatkannya dari azab Allah pada hari Kiamat. Begitu pula usahanya untuk memusuhi dan mengalahkan Nabi Muhammad tidak berhasil sama sekali.\n\nAbu Lahab sangat membenci Nabi saw dan paling gigih mengajak orang untuk menentangnya dan paling kasar menghadapinya. Raba'ah bin 'Ubbad berkata:\n\nSaya melihat Nabi Muhammad saw pada masa Jahiliah di pasar dzu al-Majaz bersabda, \"Ucapkanlah tiada Tuhan melainkan Allah niscaya kamu akan berbahagia!\" Orang-orang berkumpul di sekitar beliau. Di belakang beliau seorang laki-laki, putih warna mukanya, juling matanya, mempunyai dua untaian rambut di kepalanya, berkata, \"Dia (Muhammad) beragama sabi' dan pembohong.\" Ia mengikuti Nabi ke mana saja beliau pergi, lalu saya bertanya, \"Siapakah orang itu?\" Mereka menjawab, \"Itu adalah pamannya sendiri Abu Lahab.\" (Riwayat Ahmad)\n\nDengan ini dijelaskan bahwa Abu Lahab selalu menentang kebenaran dan menjauhkan orang dari mengikuti kebenaran. Ia menyatakan bahwa Nabi Muhammad saw adalah seorang pendusta. Ia juga menentang beliau dan merendahkan nilai agama serta petunjuk yang beliau bawa.",
      "text_translation": "Tidaklah berguna baginya hartanya dan apa yang dia usahakan.",
      "text": "مَآ اَغْنٰى عَنْهُ مَالُهٗ وَمَا كَسَبَۗ",
      "text_translation_en": "What will his wealth avail him, and all that he has gained?",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "In this verse, Allah emphasizes that Abu Lahab will enter a fiery hell and feel the heat of the torment of hell. The meaning of this statement is that if Abu Lahab were to suffer loss, his efforts would not succeed in opposing the religion of Allah. There is no use for wealth, effort, or effort for it, because it is Allah who upholds the word of His Messenger, and distributes his preaching. Abu Lahab will be punished on the Day of Judgment with a fiery hell and its fiery heat. It is Allah's provision for people like Abu Lahab among the disbelievers who oppose the Prophet, besides the punishment of the world for its failure. His wife as the main helper in the fight against the Prophet's Messenger (may peace be upon him) will be punished together. In addition, his wife spreads slander, spreads news, and ignites hostility.",
      "text_tafsir": "Dalam ayat ini, Allah menegaskan bahwa Abu Lahab akan masuk neraka yang bergejolak dan merasakan panasnya azab neraka. Maksud pernyataan ini adalah bahwa sesungguhnya Abu Lahab akan mengalami kerugian, usahanya tidak akan berhasil dalam menentang agama Allah. Tidak ada gunanya harta, usaha, dan daya upaya untuk itu, karena Allah yang meninggikan kalimah Rasul-Nya, dan menyebarluaskan dakwahnya. Abu Lahab akan diazab pada hari Kiamat dengan neraka yang menyemburkan bunga api dan suhunya yang sangat panas, Azab itu disediakan Allah untuk orang-orang seperti Abu Lahab dari kalangan orang-orang kafir yang menentang Nabi, selain azab di dunia dengan kegagalan usahanya. Istrinya sebagai pembantu utama dalam usaha menentang dan menyakiti Rasulullah saw akan diazab juga bersama-sama. Selain daripada itu, istrinya juga menyebar fitnah ke mana-mana, menyebar berita-berita bohong, dan menghidupkan api permusuhan.",
      "text_translation": "Kelak dia akan masuk ke dalam api yang bergejolak (neraka).",
      "text": "سَيَصْلٰى نَارًا ذَاتَ لَهَبٍۙ",
      "text_translation_en": "[In the life to come] he shall have to endure a fire fiercely glowing;",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "Allah insisted that Abu Lahab's wife be ordained as her husband. His wife was named Arwa bint Harb, sister of Abu Sufyan bin Harb. He was punished for his efforts to spread slander and put an end to Muhammad's preaching. Arabs say that people who try to spread and destroy human relations as if he were carrying firewood between men, as if he were burning up their friendship. Others say that Abu Lahab's wife put thorns, glass fragments, and dirt on the road that Muhammad used to inflict on her.",
      "text_tafsir": "Allah menegaskan bahwa istri Abu Lahab akan diazab sebagaimana suaminya. Istrinya bernama Arwa binti Harb, saudara perempuan Abu Sufyan bin Harb. Dia diazab karena usahanya menyebarkan fitnah dan memadamkan dakwah Nabi Muhammad. Orang Arab mengatakan bahwa orang yang berusaha menyebarkan dan merusak hubungan antara manusia seolah-olah ia membawa kayu api antara manusia, seakan-akan dia membakar silaturrahim antara mereka.\n\nAda pula yang mengatakan bahwa istri Abu Lahab menaruh duri, pecahan kaca, dan kotoran di jalan yang biasa dilalui Nabi Muhammad dengan maksud untuk menyakiti beliau.",
      "text_translation": "Dan (begitu pula) istrinya, pembawa kayu bakar (penyebar fitnah). ",
      "text": "وَّامْرَاَتُهٗ ۗحَمَّالَةَ الْحَطَبِۚ",
      "text_translation_en": "together with his wife, that carrier of evil tales,",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, God expresses the evils of Abu Lahab's wife, her humility and her deeds of charity. On his neck was always a strong rope, which he used to carry the thorns that he would place on the road that the Prophet would go through. This statement is an insult to her and her husband. Abu Lahab's wife tried so hard to ignite hostility between men, so God described her as a woman carrying a firewood hanging over her neck wherever she went. This is the worst kind of metaphor for a woman. It is reported from Sa'id bin Musayyab that Umm Jamil (called Abu Lahab's wife) had a very expensive necklace, and he said, \"Indeed I will use the price of this necklace to make fun of Muhammad.\" Then God replaced the necklace with a necklace from the fire of hell.",
      "text_tafsir": "Dalam ayat ini, Allah menyatakan keburukan perbuatan istri Abu Lahab, kerendahan budi dan kejelekan amal perbuatannya. Pada lehernya selalu ada seutas tali yang kuat, digunakannya untuk memikul duri-duri yang akan diletakkannya pada jalan yang dilalui Nabi. Pernyataan ini merupakan penghinaan bagi dirinya dan suaminya.\n\nUsaha istri Abu Lahab begitu keras untuk menyalakan permusuhan antara manusia, sehingga Allah mengisahkan dia sebagai seorang perempuan yang membawa kayu bakar yang digantungkan pada lehernya ke mana saja ia pergi. Ini adalah seburuk-buruknya perumpamaan bagi seorang perempuan.\n\nTelah diriwayatkan dari Sa'id bin Musayyab bahwa Ummu Jamil (panggilan istri Abu Lahab) mempunyai sebuah kalung yang sangat mahal, dan ia berkata, \"Sesungguhnya aku akan mempergunakan harga kalung ini untuk memusuhi Muhammad.\" Lalu Allah mengganti kalung tersebut dengan kalung dari api neraka.",
      "text_translation": "Di lehernya ada tali dari sabut yang dipintal.",
      "text": "فِيْ جِيْدِهَا حَبْلٌ مِّنْ مَّسَدٍ ࣖ",
      "text_translation_en": "[who bears] around her neck a rope of twisted strands!",
      "juz_number": 30
    }
  },
  "name": "اللهب",
  "name_translation_en": "The Palm Fibre",
  "name_translation": "Api Yang Bergejolak",
  "name_latin": "Al-Lahab"
}