{
  "number": 112,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 4,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, Allah asks the Prophet Muhammad to answer the questions of those who ask about the nature of his God, that He is the One, the unified and the unified, because the multiplicity of matter means that the group needs another part, while Allah really don't need anything. The Unity of God consists of three things: He is the One in His Body, the One in His nature and the One in His works. The Supreme Being in His substance means that His substance is not made up of some substance or part. The Supreme Being in His nature does not mean that there is a single Being that is equal to Him, and the One in His act means that He does all things according to His word: Surely He cares when He wants something He just says to him, \" Be it! \" Then be something. (Yasin \/ 36: 82)",
      "text_tafsir": "Pada ayat ini, Allah menyuruh Nabi Muhammad menjawab pertanyaan orang-orang yang menanyakan tentang sifat Tuhannya, bahwa Dia adalah Allah Yang Maha Esa, tidak tersusun dan tidak berbilang, karena berbilang dalam susunan zat berarti bahwa bagian kumpulan itu memerlukan bagian yang lain, sedang Allah sama sekali tidak memerlukan suatu apa pun. Keesaan Allah itu meliputi tiga hal: Dia Maha Esa pada Zat-Nya, Maha Esa pada sifat-Nya dan Maha Esa pada perbuatan-Nya.\n\nMaha Esa pada zat-Nya berarti zat-Nya tidak tersusun dari beberapa zat atau bagian. Maha Esa pada sifat-Nya berarti tidak ada satu sifat makhluk pun yang menyamai-Nya dan Maha Esa pada perbuatan-Nya berarti Dialah yang membuat semua perbuatan sesuai dengan firman-Nya:\n\nSesungguhnya urusan-Nya apabila Dia menghendaki sesuatu Dia hanya berkata kepadanya, \"Jadilah!\" Maka jadilah sesuatu itu. (Yasin\/36 : 82)",
      "text_translation": "Katakanlah (Muhammad), “Dialah Allah, Yang Maha Esa.",
      "text": "قُلْ هُوَ اللّٰهُ اَحَدٌۚ",
      "text_translation_en": "SAY: \"He is the One God:",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "God adds in this verse an explanation of the nature of the Supreme Being, that is, He is the God of request and supplication.",
      "text_tafsir": "Allah menambahkan dalam ayat ini penjelasan tentang sifat Tuhan Yang Maha Esa itu, yaitu Dia adalah Tuhan tempat meminta dan memohon.",
      "text_translation": "Allah tempat meminta segala sesuatu.",
      "text": "اَللّٰهُ الصَّمَدُۚ",
      "text_translation_en": "\"God the Eternal, the Uncaused Cause of All Being.",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "God then affirmed that He was holy from having children. This verse also goes against the claims of Arab rabbis who say that angels are daughters of God and that Christians claim that Jesus is the son of God. In another verse, Allah says: Then ask them (those who disbelieve in Mecca), \"Are the daughters for your Lord and for the sons?\" Or do We create angels as women when they see (them)? Remember, in fact, among their lies they say, \"God has a son.\" And really, they're really liars. (as-saffat \/ 37: 149-152) God is not begotten, nor is he begotten. Thus, He is not the same as being. He was preceded by none. Holy of Allah from what they say. Ibn 'Abbas said, \"She had no children as Mary gave birth to Jesus nor was she born. This is an objection to the Christians who say that Jesus was the son of God and a protest against the Jews who said that Uzair was the son of God.",
      "text_tafsir": "Allah lalu menegaskan bahwa Mahasuci Ia dari mempunyai anak. Ayat ini juga menentang dakwaan orang-orang musyrik Arab yang mengatakan bahwa malaikat-malaikat adalah anak perempuan Allah dan dakwaan orang Nasrani bahwa Isa anak laki-laki Allah. Dalam ayat lain, Allah berfirman:\n\nMaka tanyakanlah (Muhammad) kepada mereka (orang-orang kafir Mekah), \"Apakah anak-anak perempuan itu untuk Tuhanmu sedangkan untuk mereka anak-anak laki-laki?\" Atau apakah Kami menciptakan malaikat-malaikat berupa perempuan sedangkan mereka menyaksikan(nya)? Ingatlah, sesungguhnya di antara kebohongannya mereka benar-benar mengatakan, \"Allah mempunyai anak.\" Dan sungguh, mereka benar-benar pendusta. (as-saffat\/37: 149-152)\n\nAllah tidak beranak, dan tidak pula diperanakkan. Dengan demikian, Dia tidak sama dengan makhluk. Dia berada tidak didahului oleh tidak ada. Mahasuci Allah dari apa yang mereka sebutkan.\n\nIbnu 'Abbas berkata, \"Dia tidak beranak sebagaimana Maryam melahirkan Isa dan tidak pula diperanakkan. Ini adalah bantahan terhadap orang-orang Nasrani yang mengatakan Isa al-Masih adalah anak Allah dan bantahan terhadap orang-orang Yahudi yang mengatakan Uzair adalah anak Allah.",
      "text_translation": "(Allah) tidak beranak dan tidak pula diperanakkan.",
      "text": "لَمْ يَلِدْ وَلَمْ يُوْلَدْۙ",
      "text_translation_en": "\"He begets not, and neither is He begotten;",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "In this verse, Allah explains again that there is nothing equal and comparable to Him in His substance, nature, and deeds. This is a challenge to those who have the intention that there are equal and like God in their actions, as is the position of the polytheists who claim that the angels are allies of God.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan lagi bahwa tidak ada yang setara dan sebanding dengan Dia dalam zat, sifat, dan perbuatan-Nya. Ini adalah tantangan terhadap orang-orang yang beritikad bahwa ada yang setara dan menyerupai Allah dalam perbuatannya, sebagaimana pendirian orang-orang musyrik Arab yang menyatakan bahwa malaikat itu adalah sekutu Allah.",
      "text_translation": "Dan tidak ada sesuatu yang setara dengan Dia.”",
      "text": "وَلَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ ࣖ",
      "text_translation_en": "\"and there is nothing that could be compared with Him.",
      "juz_number": 30
    }
  },
  "name": "الاخلاص",
  "name_translation_en": "Sincerity",
  "name_translation": "Ikhlas",
  "name_latin": "Al-Ikhlas"
}