{
  "number": 113,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 5,
  "ayat": {
    "1": {
      "text_tafsir_en": "In the following verses, Allah commands the Prophet Muhammad and all Muslims to always seek refuge in the Creator God of all beings to be protected from all kinds of evil or the consequences of the evils He has created.",
      "text_tafsir": "Dalam ayat-ayat berikut ini, Allah memerintahkan kepada Nabi Muhammad dan seluruh kaum Muslimin supaya selalu berlindung kepada Tuhan Pencipta semua makhluk agar terpelihara dari segala macam kejahatan atau akibat kejahatan yang ditimbulkan oleh makhluk-makhluk yang telah diciptakan-Nya.",
      "text_translation": "Katakanlah, “Aku berlindung kepada Tuhan yang menguasai subuh (fajar),",
      "text": "قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِۙ",
      "text_translation_en": "SAY: \"I seek refuge with the Sustainer of the rising dawn,",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In the following verses, Allah commands the Prophet Muhammad and all Muslims to always seek refuge in the Creator God of all beings to be protected from all kinds of evil or the consequences of the evils He has created.",
      "text_tafsir": "Dalam ayat-ayat berikut ini, Allah memerintahkan kepada Nabi Muhammad dan seluruh kaum Muslimin supaya selalu berlindung kepada Tuhan Pencipta semua makhluk agar terpelihara dari segala macam kejahatan atau akibat kejahatan yang ditimbulkan oleh makhluk-makhluk yang telah diciptakan-Nya.",
      "text_translation": "dari kejahatan (makhluk yang) Dia ciptakan,",
      "text": "مِنْ شَرِّ مَا خَلَقَۙ",
      "text_translation_en": "\"from the evil of aught that He has created,",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "Then God explains that some of His creatures often cause evil at night when everything is covered by darkness. In the meanwhile, dark night terrors create fear and anxiety, as if something hidden in the darkness of the night will hurt humanity.",
      "text_tafsir": "Kemudian Allah menerangkan bahwa sebagian makhluk-Nya sering menimbulkan kejahatan pada waktu malam bila segala sesuatu telah diliputi oleh kegelapan. Sementara itu, keadaan malam yang gelap gulita menimbulkan rasa takut dan gelisah, seakan-akan ada sesuatu yang tersembunyi dalam kegelapan malam itu yang akan menyakiti manusia.",
      "text_translation": "dan dari kejahatan malam apabila telah gelap gulita,",
      "text": "وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ",
      "text_translation_en": "\"and from the evil of the black darkness whenever it descends,",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "In this verse, God commands that men protect him from the evil of wizards who blow their spells with the intention of breaking the bonds of love and breaking the bonds of brotherhood, such as marriage and others. The act of magic can turn the love between two close friends into hostility. The seducer brought the news that seemed right and hard to disput, just as the magician did in his attempt to separate the wife. Jumhur scholars based on authentic hadith explain that the Messenger of Allah (may peace be upon him) was bewitched by Labid al-A'sam. This does not affect the revelation that Allah has revealed to him, but only the physical and emotional aspects of the Shari'a. Sheikh Muhammad 'Abduh said, \"In view of the above statement, it is narrated from the hadith of the Prophet (may peace be upon him) that Labid bin al-A'sam was so impressed with the Prophet's personality, that it was as if he did something when he did not do it, Then Allah told him about the sorcerer, and then the magic came out of his heart, and the Prophet (peace be upon him) revived, and went down this surah. Therefore, the Muslims say, as the word of Allah says: You only follow a man who is enchanted. (al-Isra '\/ 17: 47) On the other hand, we must believe that the Qur'an is worrying and denying that the Prophet saw magic, because those who said it were Muslims, the Qur'an criticized their words. authentic hadiths, but belonging to the Sunday hadith were not sufficient to form the basis of the creed. While the faithfulness of the prophets is a faith that has been confidently held. Avoiding the Holy Prophet from magic does not mean turning off magic altogether. Maybe someone with magic is going crazy but it's impossible for the Prophet (saws) because Allah takes care and protects him. According to 'Atha', Al-hasan, and Jabir, this Surah al-Falaq is a Makkiyyah surah issued before the migration, while they claim that the Prophet saw magic in Medinah. Therefore, it is very weak to hold on to the hadith and to declare it as a valid hadith. Muslims should adhere to the Qur'an, not to adhere to the hadith.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan agar manusia berlindung kepada-Nya dari kejahatan tukang sihir yang meniupkan mantra-mantra dengan maksud memutuskan tali kasih sayang dan mengoyak-ngoyak ikatan persaudaraan, seperti ikatan nikah dan lain-lain.\n\nPerbuatan sihir itu dapat mengubah kasih sayang antara dua teman yang akrab menjadi permusuhan. Penghasut membawa berita yang tampaknya benar dan sulit dibantah, sebagaimana dilakukan oleh tukang sihir dalam usahanya memisahkan suami istri. Jumhur ulama berdasarkan hadis sahih yang menerangkan bahwa Rasulullah saw disihir oleh Labid al-A'sam. Hal ini tidak mempengaruhi wahyu yang diturunkan Allah kepadanya, namun hanya jasmani dan perasaan yang tidak berhubungan dengan syariat. \n\nSyekh Muhammad 'Abduh berkata, \"Berkenaan dengan keterangan tersebut di atas, telah diriwayatkan hadis tentang Nabi saw yang disihir oleh Labid bin al-A'sam, yang sangat mengesankan pada pribadi Nabi, sehingga seakan-akan beliau mengerjakan sesuatu padahal beliau tidak mengerjakannya, atau mengambil sesuatu padahal beliau tidak mengambilnya. Lalu Allah memberitahukan kepadanya tentang tukang sihir itu. Kemudian dikeluarkan sihir itu dalam hatinya, lalu Nabi saw menjadi sehat kembali, dan turunlah surah ini.\n\nNabi saw kena sihir sehingga menyentuh akal yang berhubungan langsung dengan jiwa beliau, karena itu orang-orang musyrik berkata, sebagaimana firman Allah:\n\nKamu hanyalah mengikuti seorang laki-laki yang kena sihir. (al-Isra'\/17: 47)\n\nDi sisi lain, yang wajib kita yakini bahwa Al-Qur'an adalah mutawatir dan menyangkal bahwa Nabi saw kena sihir, karena yang menyatakan demikian itu adalah orang-orang musyrik. Al-Qur'an mencela ucapan mereka itu.\n\nHadis tersebut seandainya termasuk di antara hadis-hadis sahih, tetapi tergolong hadis Ahad yang tidak cukup untuk dijadikan dasar dalam akidah. Sedangkan kemaksuman nabi-nabi adalah merupakan akidah yang telah dipegangi dengan yakin. Terhindarnya Nabi saw dari sihir bukanlah berarti mematikan sihir secara keseluruhan. Mungkin seseorang yang kena sihir menjadi gila akan tetapi mustahil terjadi pada Nabi saw karena Allah menjaga dan melindunginya.\n\nMenurut 'Atha', Al-hasan, dan Jabir, Surah al-Falaq ini adalah surah Makkiyyah yang diturunkan sebelum hijrah, sedangkan yang mereka tuduhkan bahwa Nabi saw kena sihir di Medinah. Oleh karena itu, sangat lemah untuk berpegang pada hadis tersebut dan untuk menyatakannya sebagai hadis sahih. Umat Islam harus berpegang pada nas Al-Qur'an, tidak perlu berpegang kepada hadis ahad tersebut.",
      "text_translation": "dan dari kejahatan (perempuan-perempuan) penyihir yang meniup pada buhul-buhul (talinya),",
      "text": "وَمِنْ شَرِّ النَّفّٰثٰتِ فِى الْعُقَدِۙ",
      "text_translation_en": "\"and from the evil of all human beings bent on occult endeavours,",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, Allah instructs the Muslims to protect him from the evils of those who are envious when he executes his acts with earnest effort and in various ways to dispel the favors of those who are the objects of his hatred and by setting traps to subdue those whom he envies. fall into harm's way. The deception he carried out was so cunning that it was difficult to know. There is no way to avoid it except to seek the help of Allah the Creator because He is the One who can reject His deception, avoid his evil, or thwart his efforts. Malice was illegal, and was the first sin when the devil envied Adam, and Qabil envied Habil.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan kaum Muslimin untuk berlindung kepada-Nya dari kejahatan orang-orang yang dengki bila ia melaksanakan kedengkiannya dengan usaha yang sungguh-sungguh dan berbagai cara untuk menghilangkan nikmat orang yang dijadikan objek kedengkiannya dan dengan mengadakan jebakan untuk menjerumuskan orang yang didengkinya jatuh ke dalam kemudaratan. Tipu muslihat yang dijalankannya itu sangat licik sehingga sulit diketahui. Tidak ada jalan untuk menghindarinya kecuali dengan memohon bantuan kepada Allah Maha Pencipta karena Dia-lah yang dapat menolak tipu dayanya, menghindari kejahatannya, atau menggagalkan usahanya. Hasad haram hukumnya, dan merupakan dosa yang pertama kali ketika iblis dengki kepada Nabi Adam, dan Qabil dengki kepada Habil.",
      "text_translation": "dan dari kejahatan orang yang dengki apabila dia dengki.”",
      "text": "وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ ࣖ",
      "text_translation_en": "\"and from the evil of the envious when he envies.\"",
      "juz_number": 30
    }
  },
  "name": "الفلق",
  "name_translation_en": "The Dawn",
  "name_translation": "Subuh",
  "name_latin": "Al-Falaq"
}