{
  "number": 114,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 6,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, Allah commands the Prophet Muhammad, including all of his people, to seek protection from God who creates, protects, grows, develops, and protects the survival of mankind with His favor and love and warns them of threats- Her.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad termasuk pula di dalamnya seluruh umatnya agar memohon perlindungan kepada Tuhan yang menciptakan, menjaga, menumbuhkan, mengembangkan, dan menjaga kelangsungan hidup manusia dengan nikmat dan kasih sayang-Nya serta memberi peringatan kepada mereka dengan ancaman-ancaman-Nya.",
      "text_translation": "Katakanlah, “Aku berlindung kepada Tuhannya manusia,",
      "text": "قُلْ اَعُوْذُ بِرَبِّ النَّاسِۙ",
      "text_translation_en": "SAY: \"I seek refuge with the Sustainer of men,",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "Allah explained that God who educates humans is the one who owns and regulates all the Shari'a, who makes laws, regulations, and religious laws. Whoever obeys it will be happy living in this world and the hereafter.",
      "text_tafsir": "Allah menjelaskan bahwa Tuhan yang mendidik manusia itu adalah yang memiliki dan yang mengatur semua syariat, yang membuat undang-undang, peraturan-peraturan, dan hukum-hukum agama. Barang siapa yang mematuhinya akan berbahagia hidup di dunia dan di akhirat.",
      "text_translation": "Raja manusia,",
      "text": "مَلِكِ النَّاسِۙ",
      "text_translation_en": "\"the Sovereign of men,",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "God adds that the God of human educators is the master of their souls by His greatness. They do not know the full power of God, but they submit to him wholeheartedly and do not know how that impulse comes to them, which can affect their whole soul. These verses precede the words of Rabb (educator) from the words Malik and Aylah because education is God's greatest and greatest gift to mankind. Then the second is followed by the word Malik (King) because men must submit to the kingdom of God after they have grown up and become wise. Then followed by the word Ilah (worship), because human beings after realizing that they should submit to Allah only and that he alone has the right to worship. God declares in these verses that He is the King of men. Owner of man and God of man, even He is God of all things. But on the other hand, they are the ones who make mistakes and misunderstand in imitating God until they are lost from the straight path. They make other gods whom they worship with the view that they are the gods that give pleasure and happiness and reject their dangers, which regulate their lives, and set boundaries that they may or may not do. They named the gods with their assistants and thought that they were the ones who controlled their movements. In another verse, God says: They make the pious (Jews), and their monks (Christians) gods other than God, and (also) Christ the son of Mary; whereas they were only called upon to worship the One True God; there is no god but Him. He is holy from what they associate with. (at-Taubah \/ 9:31) And it is not (probably) for you to make angels and prophets as God. Did (he) ask you to become infidels after you became a Muslim? (Ali 'Imran \/ 3: 80) In this sense, Allah warns the people that He is the One who taught them and they are the thinking people and He is their King and He is their Lord according to their thoughts. So it is not true that they invent to fool themselves when they are ordinary people.",
      "text_tafsir": "Allah menambah keterangan tentang Tuhan pendidik manusia ialah yang menguasai jiwa mereka dengan kebesaran-Nya. Mereka tidak mengetahui kekuasaan Allah itu secara keseluruhan, tetapi mereka tunduk kepada-Nya dengan sepenuh hati dan mereka tidak mengetahui bagaimana datangnya dorongan hati kepada mereka itu, sehingga dapat mempengaruhi seluruh jiwa raga mereka.\n\nAyat-ayat ini mendahulukan kata Rabb (pendidik) dari kata Malik dan Ilah karena pendidikan adalah nikmat Allah yang paling utama dan terbesar bagi manusia. Kemudian yang kedua diikuti dengan kata Malik (Raja) karena manusia harus tunduk kepada kerajaan Allah sesudah mereka dewasa dan berakal. Kemudian diikuti dengan kata Ilah (sembahan), karena manusia sesudah berakal menyadari bahwa hanya kepada Allah mereka harus tunduk dan hanya Dia saja yang berhak untuk disembah.\n\nAllah menyatakan dalam ayat-ayat ini bahwa Dia Raja manusia. Pemilik manusia dan Tuhan manusia, bahkan Dia adalah Tuhan segala sesuatu. Tetapi di lain pihak, manusialah yang membuat kesalahan dan kekeliruan dalam menyifati Allah sehingga mereka tersesat dari jalan lurus. Mereka menjadikan tuhan-tuhan lain yang mereka sembah dengan anggapan bahwa tuhan-tuhan itulah yang memberi nikmat dan bahagia serta menolak bahaya dari mereka, yang mengatur hidup mereka, menggariskan batas-batas yang boleh atau tidak boleh mereka lakukan. Mereka memberi nama tuhan-tuhan itu dengan pembantu-pembantunya dan menyangka bahwa tuhan-tuhan itulah yang mengatur segala gerak-gerik mereka. Dalam ayat lain, Allah berfirman:\n\nMereka menjadikan orang-orang alim (Yahudi), dan rahib-rahibnya (Nasrani) sebagai tuhan selain Allah, dan (juga) Al-Masih putra Maryam; padahal mereka hanya disuruh menyembah Tuhan Yang Maha Esa; tidak ada tuhan selain Dia. Mahasuci Dia dari apa yang mereka persekutukan. (at-Taubah\/9: 31)\n\nDan tidak (mungkin pula baginya) menyuruh kamu menjadikan para malaikat dan para nabi sebagai Tuhan. Apakah (patut) dia menyuruh kamu menjadi kafir setelah kamu menjadi Muslim? (Ali 'Imran\/3: 80)\n\nMaksudnya, dengan ini Allah memperingatkan manusia bahwa Dia-lah yang mendidik mereka sedang mereka adalah manusia-manusia yang suka berpikir dan Dia Raja mereka dan Dia pula Tuhan mereka menurut pikiran mereka. Maka tidak benarlah apa yang mereka ada-adakan untuk mendewa-dewakan diri mereka padahal mereka manusia biasa.",
      "text_translation": "sembahan manusia,",
      "text": "اِلٰهِ النَّاسِۙ",
      "text_translation_en": "\"the God of men,",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "In this verse, God instructs people to seek refuge in Allah Rabbul-'Alamin from the evil whisperings of demons that are always hidden in human hearts. The whispers and satire that come from the devil's temptations when confronted with a healthy mind must be defeated and the seducer reconsidered, for all the whisperings and slanders that will injure the man will become empty as the soul recovers to the command- religious orders. Similarly, when a person seduces another friend for a crime, but the friend holds strong to the religious precepts, he will stop teasing and be disappointed that his temptation has failed but he is waiting for another chance.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan manusia agar berlindung kepada Allah Rabbul-'Alamin dari kejahatan bisikan setan yang senantiasa bersembunyi di dalam hati manusia. Bisikan dan was-was yang berasal dari godaan setan itu bila dihadapkan kepada akal yang sehat mesti kalah dan orang yang tergoda menjadi sadar kembali, karena semua bisikan dan was-was setan yang akan menyakiti manusia itu akan menjadi hampa bila jiwa sadar kembali kepada perintah-perintah agama. Begitu pula bila seorang menggoda temannya yang lain untuk melakukan suatu kejahatan, tetapi temannya itu berpegang kuat dengan perintah-perintah agama niscaya akan berhenti menggoda dan merasa kecewa karena godaannya itu tidak berhasil namun ia tetap menunggu kesempatan yang lain.",
      "text_translation": "dari kejahatan (bisikan) setan yang bersembunyi,",
      "text": "مِنْ شَرِّ الْوَسْوَاسِ ەۙ الْخَنَّاسِۖ",
      "text_translation_en": "\"from the evil of the whispering, elusive tempter",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "God describes in this verse the temptation, that is, a whisper of a hidden demon that is blown into the human breast, which may come from the genie or the human being, as in another verse God says: And so for every prophet We make enemies of demons human and genie. (al-An'am \/ 6: 112) The demonic spirits often whisper a doubt in a very subtle way to humanity. Often he presents himself as a sincere advisor, but when you correct him he retreats and as he speaks he continues to exaggerate his temptations. This chapter begins with the words of the educator, therefore God as the educator of man, has the power to resist all the temptations of the devil and whisper it to man. Allah directs in this surah that men seek Allah's help only as He has given similar guidance in surah al-Fatihah, that the fundamental principle of religion is to devote themselves wholeheartedly to Allah in speech or other actions and to seek protection to him from all the temptations of the devil himself he could not resist.",
      "text_tafsir": "Allah menerangkan dalam ayat ini tentang godaan tersebut, yaitu bisikan setan yang tersembunyi yang ditiupkan ke dalam dada manusia, yang mungkin datangnya dari jin atau manusia, sebagaimana dalam ayat lain Allah berfirman:\n\nDan demikianlah untuk setiap nabi Kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin. (al-An'am\/6: 112)\n\nSetan-setan jin itu seringkali membisikkan suatu keraguan dengan cara yang sangat halus kepada manusia. Seringkali dia menampakkan dirinya sebagai penasihat yang ikhlas, tetapi bila engkau menghardiknya ia mundur dan bila diperhatikan bicaranya ia terus melanjutkan godaannya secara berlebih-lebihan. \n\nSurah ini dimulai dengan kata pendidik, karena itu Tuhan sebagai pendidik manusia, berkuasa untuk menolak semua godaan setan dan bisikannya dari manusia. Allah memberi petunjuk dalam surah ini agar manusia memohon pertolongan hanya kepada Allah sebagaimana Dia telah memberi petunjuk yang serupa dalam surah al-Fatihah, bahwa dasar yang terpenting dalam agama adalah menghadapkan diri dengan penuh keikhlasan kepada Allah baik dalam ucapan, maupun perbuatan lainnya dan memohon perlindungan kepada-Nya dari segala godaan setan yang ia sendiri tidak mampu menolaknya.",
      "text_translation": "yang membisikkan (kejahatan) ke dalam dada manusia,",
      "text": "الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِۙ",
      "text_translation_en": "\"who whispers in the hearts of men",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "God describes in this verse the temptation, that is, a whisper of a hidden demon that is blown into the human breast, which may come from the genie or the human being, as in another verse God says: And so for every prophet We make enemies of demons human and genie. (al-An'am \/ 6: 112) The demonic spirits often whisper a doubt in a very subtle way to humanity. Often he presents himself as a sincere advisor, but when you correct him he retreats and as he speaks he continues to exaggerate his temptations. This chapter begins with the words of the educator, therefore God as the educator of man, has the power to resist all the temptations of the devil and whisper it to man. Allah directs in this surah that men seek Allah's help only as He has given similar guidance in surah al-Fatihah, that the fundamental principle of religion is to devote themselves wholeheartedly to Allah in speech or other actions and to seek protection to him from all the temptations of the devil himself he could not resist.",
      "text_tafsir": "Allah menerangkan dalam ayat ini tentang godaan tersebut, yaitu bisikan setan yang tersembunyi yang ditiupkan ke dalam dada manusia, yang mungkin datangnya dari jin atau manusia, sebagaimana dalam ayat lain Allah berfirman:\n\nDan demikianlah untuk setiap nabi Kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin. (al-An'am\/6: 112)\n\nSetan-setan jin itu seringkali membisikkan suatu keraguan dengan cara yang sangat halus kepada manusia. Seringkali dia menampakkan dirinya sebagai penasihat yang ikhlas, tetapi bila engkau menghardiknya ia mundur dan bila diperhatikan bicaranya ia terus melanjutkan godaannya secara berlebih-lebihan. \n\nSurah ini dimulai dengan kata pendidik, karena itu Tuhan sebagai pendidik manusia, berkuasa untuk menolak semua godaan setan dan bisikannya dari manusia. Allah memberi petunjuk dalam surah ini agar manusia memohon pertolongan hanya kepada Allah sebagaimana Dia telah memberi petunjuk yang serupa dalam surah al-Fatihah, bahwa dasar yang terpenting dalam agama adalah menghadapkan diri dengan penuh keikhlasan kepada Allah baik dalam ucapan, maupun perbuatan lainnya dan memohon perlindungan kepada-Nya dari segala godaan setan yang ia sendiri tidak mampu menolaknya.",
      "text_translation": "dari (golongan) jin dan manusia.”",
      "text": "مِنَ الْجِنَّةِ وَالنَّاسِ ࣖ ",
      "text_translation_en": "\"from all [temptation to evil by] invisible forces as well as men,\"",
      "juz_number": 30
    }
  },
  "name": "الناس",
  "name_translation_en": "Mankind",
  "name_translation": "Manusia",
  "name_latin": "An-Nas"
}