{
  "number": 13,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 43,
  "ayat": {
    "1": {
      "text_tafsir_en": "The Qur'an is a holy book passed down to the Prophet Muhammad, and does not contain things that can confuse people to its truth. The truth of the Qur'an covers all aspects of it such as the law, Shari'ah, the nature of the shul fi kulli of eating times (suitable for all ages and in all places), the various parables, stories, and instructions that people must follow to achieve happiness in this world and the hereafter. The truth of the Quran has been proven in the early days of Islam. By adhering to the Qur'an, Muslims are able to build a nation of high culture and dignity. The Qur'an motivates people to rise up in the fight to uphold the truth, to destroy evil, to uphold justice, and to eradicate injustice. By following the Quran's guidance Muslims can become a credible nation. But when the Qur'an was abandoned, Muslims preferred the world over eternity, and as a result of the Muslims' disbelief in the promises of God contained in the Qur'an, the Muslims became a backward nation, plagued by poverty and ignorance. If Muslims today are unaware of their misunderstandings and do not try to correct them, by re-engaging in the Qur'anic messages, Muslims will continue to suffer in their foolishness. God will not change their fate if they do not change their own fate. Allah swt says: Allah will never change the condition of a people before they change their own condition. (ar-Rad \/ 13: 11)",
      "text_tafsir": "Al-Quran adalah kitab suci yang diturunkan kepada Nabi Muhammad, dan tidak mengandung hal-hal yang bisa meragukan orang terhadap kebenarannya.\n\nKebenaran Al-Quran meliputi seluruh aspek yang terkandung di dalamnya seperti hukum, syariat yang bersifat shalih fi kulli zaman wa makan (cocok untuk sepanjang zaman dan di semua tempat), bermacam-macam perumpamaan, kisah, dan petunjuknya yang harus diikuti oleh manusia untuk mencapai kebahagiaan di dunia dan akhirat.\n\nKebenaran Al-Quran telah terbukti pada masa-masa awal Islam. Dengan berpegang teguh pada Al-Quran, umat Islam mampu membangun bangsa yang berbudaya tinggi dan berakhlak mulia. Al-Quran memotivasi manusia untuk bangkit berjuang menegakkan kebenaran, menghancurkan kemungkaran, menegakkan keadilan, dan melenyapkan kezaliman. Dengan menjalankan petunjuk Al-Quran umat Islam mampu menjadi bangsa yang berwibawa. Tapi ketika Al-Quran ditinggalkan, umat Islam lebih memilih keduniaan daripada akhirat yang kekal, dan akibat ketidakyakinan umat Islam terhadap janji-janji Allah yang termaktub dalam Al-Quran, umat Islam berubah menjadi bangsa yang terbelakang, terbelit kemiskinan dan kebodohan. Jika umat Islam saat ini tidak menyadari kekeliruannya dan tidak berusaha memperbaikinya, dengan cara kembali menjalankan pesan-pesan Al-Quran, maka umat Islam akan tetap terpuruk dalam kebodohannya. Allah tidak akan mengubah nasib mereka jika mereka tidak mengubah nasib mereka sendiri. Firman Allah swt.:\n\nSesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri. (ar-Rad\/13: 11)",
      "text_translation": "Alif Lam Mim Ra. Ini adalah ayat-ayat Kitab (Al-Qur'an). Dan (Kitab) yang diturunkan kepadamu (Muhammad) dari Tuhanmu itu adalah benar; tetapi kebanyakan manusia tidak beriman (kepadanya).",
      "text": "الۤمّۤرٰۗ تِلْكَ اٰيٰتُ الْكِتٰبِۗ وَالَّذِيْٓ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ الْحَقُّ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يُؤْمِنُوْنَ ",
      "text_translation_en": "Alif. Lam. Mim. Ra. THESE ARE MESSAGES of revelation: and what has been bestowed upon thee from on high by thy Sustainer is the truth-yet most people will not believe [in it]?",
      "juz_number": 13
    },
    "2": {
      "text_tafsir_en": "This verse explains the proofs of the truth of the Koran by presenting signs or proofs of the existence of Allah who sent down the Koran. The existence of God is evidenced by various creations that can be seen and felt by humans in this universe. In detail, Allah explains the state of the heavens which are elevated without pillars, the course of the sun and moon, each circulating according to a predetermined time and place, the state of the earth which is full of mountains and valleys with rivers flowing in between, and the existence of various gardens that produce a variety of fruits. All that shows that only God can benefit and harm, who can turn on and off and the Almighty over everything. The signs of God's power in the sky are described in this verse: 1. Creating the sky above the earth without any pillars as seen by all creatures, and great distances between objects in the sky all of which circulate according to God's rules and regulations itself like objects seen floating in the sky. 2. Then Allah resides on His Throne and rules this universe. His wisdom has been spread at length in Surah al-Araf and Surah Yunus. 3. Allah Almighty has subjected the sun and moon to the benefit of all His creatures, each of them walking in its rotation according to the specified time. The course of the sun and moon has been explained in detail in Surah Yunus and Surah Hud. Allah Almighty arranges all events in His kingdom perfectly, He is the one who turns on and off, establishes and excludes, gives wealth and poverty, sends revelations to whomever He wants. All of that shows that it is God who has absolute power and broad grace, because it determines the creation of a creature with certain conditions and characteristics, cannot be carried out except by God Almighty and Almighty. He is the one who governs the material and spiritual realms and He is the one who controls the very large and very small things, all with wisdom. From a scientific point of view, the sky or the same in this verse can mean the blue sky or the atmosphere close to this earth. In a broader sense the same can also be interpreted by this vast space sky (space). The atmosphere is a veil of gas that covers a planet (including the earth). It forms air space. The atmosphere is divided into 6 (six) regions according to their height, one above the other. Sequentially from the lowest region, the atmosphere is divided into: (1) Troposphere (Troposphere altitude: 0-8 Km), (2) Tropopause, altitude: 8-12 Km (3) Stratosphere (Stratosphere, altitude: 12-80 Km ), (4) Mesosphere (Mesosphere, altitude: 80 Km) (5) Ionosphere (Ionosphere, altitude: 100 Km) and (6) Exosphere (Exosphere, altitude&gt; 100km). The occurrence of clouds, weather and so on are in the Troposphere region. Atmospheric composition (in the Troposphere), the majority consists of nitrogen gas (78%), also oxygen (20%). This atmosphere covers the earth and can be erect above the earth due to the earth's gravitational force. This is the meaning of raising the sky without the pillar. Of course this is a different interpretation of the sky with the seven layers of the sky which concerns galaxies and so forth. With regard to skies without poles, in terms of construction structures, structures without poles are only possible if the construction is spherical or spherical, surface of revolution, however experts have not agreed on its shape; some claim to be a ball, like a saddle, even as a trumpet. In this construction the walls and poles merge into the surface of the ball itself. So, the construction of the sky without a pole is only possible if the sky is spherical, in accordance with scientific findings which state that the universe is a large sphere that expands increasingly at the speed of light, with the speed of light 300 thousand kilometers per second (the expanding universe). The sky-space, indeed formed since the Big Bang (Big Bang) and continues to expand and expand. In Surah az-zariat \/ 51: 47 it says: And the heavens We build with (Our) power and We truly expand it. The same word in verse 47 of Surah az-zariat \/ 51 above is more accurately interpreted sky-space. The sky (space) is constantly expanding (space expansion). Research on the Galactic spectrum, showing that there is a regular shift in the red-band spectrum, this explains that the distance between galaxies is getting further away, and this is an indication that the sky-space is expanding. Of course this sky does not need a pole; because it was built with the awesome power of Allah in the form of the Big Bang. The Big Bang has broken the Superforce Force into Fundamental Forces such as: Gravitational Force, Strong Nuclear Force, Weak Nuclear Force, and Electromagnetic Force; all of which stabilize this sky-space. So on in these verses it says: \"He subjected the sun and moon; each circulates according to a predetermined time\". The word \"subjugate\" means that both the sun and the moon are subject to the sunatullah, or the natural laws of God. Regarding \"each one circulated according to a specified time\", see the description in Surah Yunus \/ 10: 5 above. Such is the explanation from a scientific point of view. All of this happens thanks to the perfection of Allah in His Substance, nature, knowledge, and power which cannot be imitated by anyone. Allah arranges the affairs of His creatures, explains the signs of His greatness with very neat and perfect rules, and arranges objects in the sky so that they walk according to a predetermined path, such as the shape of a link that connects together so that no collisions occur in space space that can cause havoc and disaster. All this continues until the Day of Judgment comes, where there will be chaos and irregularity in the work of heavenly bodies in the universe. The destruction of the universe begins with the cleavage of heaven, as explained in the word of God: When the heavens are split, and when the stars fall apart. (al-Infithar \/ 82: 1-2) Then Allah explained that the signs of the perfection of His power in the heavens and on earth were a means that could give rise to the conviction of humankind of an encounter with God the Creator on the Day of Judgment, where He would reward people who do good and punish those who do evil. If man believes this truth, surely he can turn from idolatry and idolatry to sincerity to worship only the Almighty God, believe in His promises and threats, believe in all His Apostles, follow all commands and avoid His prohibitions, so that they become happy people in this world and the hereafter.",
      "text_tafsir": "Ayat ini menjelaskan bukti-bukti kebenaran Al-Quran dengan memaparkan tanda-tanda atau bukti-bukti adanya Allah yang menurunkan Al-Quran. Keberadaan Allah ini dibuktikan dengan berbagai ciptaannya yang bisa dilihat dan dirasakan manusia di alam raya ini.\n\nSecara terperinci Allah menerangkan keadaan langit yang ditinggikan tanpa tiang, perjalanan matahari dan bulan yang masing-masing beredar menurut waktu dan tempat yang sudah ditentukan, keadaan bumi yang penuh dengan gunung dan lembah yang mengalir sungai di antaranya, dan adanya bermacam-macam kebun yang menghasilkan beraneka ragam buah-buahan. Semua itu menunjukkan bahwa hanya Allah yang dapat memberi manfaat dan mudarat, yang dapat menghidupkan dan mematikan dan Yang Mahakuasa atas segala sesuatu. \n\nTanda-tanda kekuasaan Allah di langit dipaparkan dalam ayat ini:\n\n1.Menciptakan langit di atas bumi tanpa adanya tiang sebagaimana yang biasa dilihat oleh seluruh makhluk, dan jarak yang sangat jauh di antara benda-benda di langit yang kesemuanya beredar menurut ketentuan dan peraturan Allah sendiri seperti benda-benda yang terlihat melayang di angkasa.\n\n2.Kemudian Allah bersemayam di atas Arasy-Nya dan mengatur alam semesta ini. Tentang kebijaksanaan-Nya telah dibentangkan secara panjang lebar di dalam Surah al-Araf dan Surah Yunus.\n\n3.Allah swt telah menundukkan matahari dan bulan untuk kemanfaatan sekalian makhluk-Nya, masing-masing berjalan pada rotasi\/lintasannya menurut waktu yang ditentukan. Tentang perjalanan matahari dan bulan telah dijelaskan dengan terperinci dalam Surah Yunus dan Surah Hud. Allah swt mengatur segala kejadian dalam kerajaan-Nya secara sempurna, Dialah yang menghidupkan dan mematikan, mengadakan dan meniadakan, memberi kekayaan dan kemiskinan, menurunkan wahyu kepada siapa yang dikehendaki-Nya. Semua itu menunjukkan bahwa Allahlah yang mempunyai kekuasaan yang mutlak dan rahmat yang luas, karena menentukan penciptaan suatu makhluk dengan keadaan sifat dan tabiat tertentu, tidak dapat dilaksanakan kecuali oleh Tuhan Yang Mahaagung dan Mahakuasa. Dialah yang mengatur alam kebendaan dan alam kerohanian dan Dialah yang mengatur benda-benda yang amat besar dan amat kecil, semuanya dengan penuh hikmah kebijaksanaan. \n\nDitinjau dari sudut saintifik, langit atau sama dalam ayat ini dapat berarti langit biru atau atmosfer yang dekat dengan bumi ini. Dalam pengertian yang lebih luas sama juga dapat diartikan dengan langit antariksa (space) yang sangat luas ini. \n\nAtmosfer adalah selubung gas yang meliputi suatu planet (termasuk bumi). Ia membentuk ruang udara. Atmosfer dibagi ke dalam 6 (enam) wilayah menurut ketinggiannya, yang satu berada di atas yang lainnya. Secara berurutan dari wilayah yang terendah, maka atmosfer dibagi menjadi: (1) Troposfer (Troposphere ketinggian: 0-8 Km), (2) Tropopause, ketinggian: 8-12 Km (3) Stratosfer (Stratosphere, ketinggian: 12-80 Km), (4) Mesosfer (Mesosphere, ketinggian: 80 Km) (5) Ionosfer (Ionosphere, ketinggian: 100 Km) dan (6) Eksosfer (Exosphere, ketinggian >100Km). Terjadinya awan, cuaca dan sebagainya berada di wilayah Troposfer. Komposisi atmosfer (di wilayah Troposfer), mayoritas terdiri dari gas nitrogen (78%), juga oksigen (20%). Atmosfer ini menyeliputi bumi dan dapat tegak di atas bumi karena adanya gaya gravitasi bumi. Inilah pengertian dari meninggikan langit tanpa tiang itu. Tentu saja ini adalah tafsir langit yang berbeda dengan tujuh lapis langit yang menyangkut galaksi dan lain sebagainya. \n\nBerkaitan dengan langit tanpa tiang, ditinjau dari struktur konstruksi maka struktur tanpa tiang hanya dimungkinkan kalau konstruksinya berbentuk bola atau mirip bola (spherical, surface of revolution), meskipun demikian para ahli belum sepakat tentang bentuknya; ada yang menyatakan sebagai bola, seperti sadel, bahkan sebagai terompet. Pada konstruksi ini dinding dan tiang menyatu menjadi permukaan bola itu sendiri. Jadi, konstruksi langit tanpa tiang hanya dimungkinkan bila langit itu berbentuk bola, sesuai dengan temuan ilmiah yang menyatakan bahwa alam semesta adalah bola besar yang mengembang makin membesar dengan kecepatan cahaya yaitu dengan kecepatan cahaya 300 ribu kilometer setiap detiknya (the expanding universe).\n\nLangit-antariksa, memang terbentuk sejak Dentuman Besar (Big Bang) dan terus mengembang dan meluas. Dalam Surah az-zariat\/51:47 disebutkan: Dan langit Kami bangun dengan kekuasaan (Kami) dan Kami benar-benar meluaskannya. Kata sama pada ayat 47 Surah az-zariat\/51 di atas lebih tepat diartikan langit-antariksa. Langit-antariksa (space) memang terus-menerus mengembang (space expansion). Penelitian spektrum Galaksi, menunjukkan adanya pergeseran spektrum pita-merah yang teratur, hal ini menjelaskan bahwa jarak antar Galaksi semakin menjauh, dan inilah yang merupakan indikasi langit-antariksa semakin mengembang. Tentu langit ini tidak memerlukan tiang; karena dibangun dengan kekuatan maha dahsyat dari Allah swt yang berupa Dentuman Besar. Dentuman Besar (Big Bang) ini telah memecah Gaya Superforce menjadi Gaya-gaya Fundamental seperti: Gaya Gravitasi, Gaya Nuklir Kuat, Gaya Nuklir Lemah, dan Gaya Elektromagnetik; yang kesemuanya ini menstabilkan langit-antariksa ini.\n\nSeterusnya dalam ayat-2 ini disebutkan: \"Dia menundukkan matahari dan bulan; masing-masing beredar menurut waktu yang telah ditentukan\". Kata \"menundukkan\" berarti bahwa baik matahari maupun bulan tunduk pada sunatullah, atau hukum-hukum alam dari Allah. Tentang \"masing-masing beredar menurut waktu yang ditentukan\", lihat keterangan pada Surah Yunus\/10: 5 di atas. Demikian penjelasan dari sudut pandang saintis.\n\nKesemuanya itu terjadi berkat kesempurnaan Allah dalam Zat, sifat, ilmu, dan kekuasaan-Nya yang tidak dapat ditiru oleh siapapun juga. Allah mengatur urusan makhluk-Nya, menjelaskan tanda-tanda kebesaran-Nya dengan peraturan yang sangat rapi dan sempurna, serta mengatur benda-benda di langit sehingga berjalan menurut lintasan yang telah ditentukan, seperti bentuk mata rantai yang sambung menyambung sehingga tidak terjadi tabrakan di ruang angkasa yang dapat menimbulkan malapetaka dan bencana. Semua ini berlangsung terus-menerus sampai datang hari kiamat, dimana akan terjadi kekacauan dan ketidakteraturan kerja benda-benda langit di alam angkasa. Kehancuran alam semesta dimulai dengan terbelahnya langit, seperti dijelaskan dalam firman Allah:\n\nApabila langit terbelah, dan apabila bintang-bintang jatuh berserakan. (al-Infithar\/82:1-2)\n\nKemudian Allah menerangkan bahwa tanda-tanda kesempurnaan kekuasaan-Nya di langit dan di bumi merupakan sarana yang bisa menimbulkan keyakinan bagi umat manusia akan adanya perjumpaan dengan Allah Sang Pencipta pada hari kiamat, dimana Dia akan memberikan ganjaran kepada orang-orang yang berbuat kebajikan dan menghukum orang-orang yang berbuat kejahatan. Jika manusia meyakini kebenaran ini, niscaya dia dapat berpaling dari penyembahan berhala dan patung kepada keikhlasan beribadah hanya kepada Allah Yang Maha Esa, percaya kepada janji dan ancaman-Nya, percaya kepada semua rasul-Nya, mengikuti segala perintah dan menjauhi larangan-Nya, sehingga mereka menjadi manusia yang bahagia di dunia dan di akhirat.",
      "text_translation": "Allah yang meninggikan langit tanpa tiang (sebagaimana) yang kamu lihat, kemudian Dia bersemayam di atas ‘Arsy. Dia menundukkan matahari dan bulan; masing-masing beredar menurut waktu yang telah ditentukan. Dia mengatur urusan (makhluk-Nya), dan menjelaskan tanda-tanda (kebesaran-Nya), agar kamu yakin akan pertemuan dengan Tuhanmu.",
      "text": "اَللّٰهُ الَّذِيْ رَفَعَ السَّمٰوٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَۗ  كُلٌّ يَّجْرِيْ لِاَجَلٍ مُّسَمًّىۗ يُدَبِّرُ الْاَمْرَ يُفَصِّلُ الْاٰيٰتِ لَعَلَّكُمْ بِلِقَاۤءِ رَبِّكُمْ تُوْقِنُوْنَ ",
      "text_translation_en": "It is God who has raised the heavens without any supports that you could see, and is established on the throne of His almightiness; and He [it is who] has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him]. He governs all that exists. Clearly does He spell out these messages, so that you might be certain in your innermost that you are destined to meet your Sustainer [on Judgment Day].",
      "juz_number": 13
    },
    "3": {
      "text_tafsir_en": "In this verse God explains the other side of His signs on the earth, namely: 1. It is God who sets the earth wide and wide to make it a dwelling place for His creatures. All animals can live on it in abundance. Humans can benefit from the produce of their home, their animals, and the metal objects hidden in their stomachs, and can roam the earth in search of sustenance and all its benefits. Because it is very large, the earth looks like a flat field, despite the fact that it is actually a ball shaped by scholars of scholars. 2.Allah has set up mountains on the surface of the earth as pillars and pegs that keep the earth stable and unstable. 3. Allah created the rivers of the earth for the benefit of man and beast. Humans can irrigate the river with their gardens and orchards, which eventually produce a wide variety of fruits and vegetables. 4. The fruit from the fruit tree is made by God in pairs where there are male and female elements. Science has determined that a tree will not bear fruit unless there is a marriage between the elements (pollen) and the female (flower bud) that is usually present in most species. Some trees have only male elements, while the female elements are in the other tree so they need to be married to bear fruit like palm trees. Some have male and female elements in one flower, like cottonwoods. 5.We cover the night during the day until the light of nature turns dark as if covering something with a black cloth. In the same way, God illuminates day and night until darkness disappears and nature shines brightly. All of them were created by God to enhance the benefits of mankind by giving them the opportunity to rest and sleep at night and work for their living during the day according to the word of God: Do they not notice that We have made the night for them to rest on it and to make the day light ? (an-Naml \/ 27: 86) In verse 3 above, it is explained that God covers the night with day. In another verse it is also stated that night closes day and day closes night. The words used in this Arabic are like those wearing turban, which is one cloth covering the other and coating the head. Thus the word covering the night into day, actually signifies that our planet is round; not as flat as the depictions of the ancient idiots. After Allah has explained the details of His power which are visible to the eyes every morning and evening, every time and circumstance, God explains that these signs are not observed except by those who are grateful and reflect on the signs of power. -Yes. Then his intellect can reach the truth and move from view of cause to cause. Indeed there are signs of God's greatness for those who wish to think that the creator of nature is the God of absolute will and power that covers everything, the Power to revive the dead among His creatures, and bring them back from the mortal realm. Therefore, it is not possible to worship except Him, not to submit and surrender except to His power. Worship cannot be attributed to statues, idols, rocks, trees, angels, prophets, etc. because they cannot withstand harm to themselves, according to the word of God: Verily all that you exclamation other than God cannot create a fly, even though they are united to create it. And if the fly snatches something from them, they won't be able to take it back. (al-hajj \/ 22: 73) And it is recounted in a hadith of the Prophet (peace be upon him). (Abu Nuaim's History of Ibn Abbas)",
      "text_tafsir": "Pada ayat ini Allah menerangkan sisi lain dari tanda-tanda kekuasaan-Nya yang ada di bumi, yaitu:\n\n1.Dialah Allah yang membentangkan bumi menjadi luas dan lebar supaya mudah dijadikan tempat kediaman makhluk-Nya. Semua binatang dapat hidup di atasnya dengan leluasa. Manusia dapat mengambil manfaat dari hasil buminya, hewan-hewannya, dan benda-benda logam yang terpendam di dalam perutnya, serta dapat berkeliaran di muka bumi untuk mencari rezeki dan segala kemanfaatannya. Karena sangat luas, bumi ini kelihatannya seperti lahan datar, meskipun keadaan yang sebenarnya berbentuk bola sebagaimana diyakini oleh para ulama ahli falak. \n\n2.Allah telah mengadakan gunung-gunung di atas permukaan bumi ini sebagai tonggak dan pasak yang menjaga kestabilan bumi supaya tidak bergerak dan tidak bergeser.\n\n3.Allah telah menciptakan sungai-sungai di bumi untuk kepentingan manusia dan binatang-binatang. Manusia dapat mengairi dengan air sungai itu kebun-kebun dan sawah ladangnya yang nantinya menghasil-kan bermacam-macam hasil bumi dan buah-buahan. \n\n4.Bunga dari pohon buah-buahan dijadikan Allah berpasang-pasangan dimana terdapat unsur jantan dan unsur betina. Ilmu pengetahuan telah menetapkan bahwa sebuah pohon itu tidak akan berbuah kecuali jika telah terjadi perkawinan antara unsur jantan (serbuk sari) dan betina (putik bunga) yang biasanya berada pada sebagian besar dari jenis pohon. Ada pohon yang hanya memiliki unsur jantan saja, sedangkan unsur betinanya ada pada pohon yang lain sehingga perlu dikawinkan supaya dapat berbuah seperti pohon kurma. Ada pula yang mempunyai unsur jantan dan betina dalam satu bunga seperti pohon kapas. \n\n5.Allah menutupkan malam kepada siang sehingga suasana alam yang terang berubah menjadi gelap gulita seperti menutup sesuatu dengan kain hitam. Demikian pula Allah menyinarkan siang kepada malam sehingga kegelapan hilang dan alam kelihatan terang benderang. Semuanya itu dijadikan Allah untuk menyempurnakan kemanfaatan bagi manusia dengan memberikan kesempatan istirahat dan tidur di malam hari dan bekerja mencari nafkah pada siang hari sesuai dengan firman Allah:\n\nApakah mereka tidak memperhatikan bahwa Kami telah menjadikan malam agar mereka beristirahat padanya dan (menjadikan) siang yang menerangi? (an-Naml\/27: 86)\n\nDalam ayat 3 di atas, dijelaskan bahwa Allah menutupkan malam kepada siang. Dalam ayat yang lainnya juga disebutkan bahwa malam menutup siang dan siang menutup malam. Kata-kata yang digunakan dalam bahasa Arab ini mirip seperti orang memakai sorban, yaitu kain yang satu menutup yang lain dan secara berlapis-lapis menutup kepala. Dengan demikian kata menutupkan malam kepada siang, sebetulnya mengisyaratkan bahwa planet bumi kita ini bulat; bukannya datar seperti gambaran orang-orang jahiliah kuno. \n\nSetelah Allah menerangkan dalil-dalil kekuasaan-Nya yang dapat dilihat oleh mata tiap pagi dan petang, tiap-tiap waktu dan keadaan, maka Allah menerangkan bahwa tanda-tanda itu tidak diperhatikan kecuali oleh orang-orang yang suka bersyukur dan merenungi tanda-tanda kekuasaan-Nya. Lalu dengan akal pikirannya dapat mencapai kebenaran dan beralih dari memandang sebab kepada yang menyebabkan. Sesungguhnya pada yang demikian itu ada tanda-tanda kebesaran Allah bagi kaum yang mau memikirkan bahwa pencipta alam itu adalah Tuhan yang mempunyai kehendak yang mutlak dan kekuasaan yang meliputi segala sesuatu, yang Kuasa untuk menghidupkan yang telah mati di antara makhluk-Nya, dan mengembalikan mereka dari alam fana. Oleh karena itu, tidak boleh beribadah kecuali kepada-Nya, tidak boleh tunduk dan berserah diri kecuali kepada kekuasaan-Nya. Beribadah tidak boleh ditujukan kepada patung-patung, berhala-berhala, batu-batu, pohon, malaikat, nabi-nabi, dan lain sebagainya karena benda-benda itu tidak dapat menolak kemudaratan dari dirinya sendiri, sesuai dengan firman Allah:\n\nSesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. (al-hajj\/22: 73)\n\nDan telah diriwayatkan pula dalam sebuah hadis Nabi saw\n\nPikirkanlah olehmu sekalian tentang makhluk Allah dan jangan memikirkan tentang Allah. (Riwayat Abu Nuaim dari Ibnu Abbas)",
      "text_translation": "Dan Dia yang menghamparkan bumi dan menjadikan gunung-gunung dan sungai-sungai di atasnya. Dan padanya Dia menjadikan semua buah-buahan berpasang-pasangan; Dia menutupkan malam kepada siang. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang berpikir.",
      "text": "وَهُوَ الَّذِيْ مَدَّ الْاَرْضَ وَجَعَلَ فِيْهَا رَوَاسِيَ وَاَنْهٰرًا ۗوَمِنْ كُلِّ الثَّمَرٰتِ جَعَلَ فِيْهَا زَوْجَيْنِ اثْنَيْنِ يُغْشِى الَّيْلَ النَّهَارَۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّتَفَكَّرُوْنَ ",
      "text_translation_en": "And it is He who has spread the earth wide and placed on it firm mountains and running waters, and created thereon two sexes of every [kind of] plant; [and it is He who] causes the night to cover the day. Verily, in all this there are messages indeed for people who think!",
      "juz_number": 13
    },
    "4": {
      "text_tafsir_en": "The expression of this verse is a continuation of the signs of God's power on earth, namely that on earth there are parts of land that are close together and side by side but with different fertility. There is very fertile land for planting any plant, there is also land that can only be planted with large trees, but it is not good for planting crops or vice versa, there is also soft soil and some hard ones that are difficult to be tempered. On earth there are vineyards, secondary crops, and branched and unbranched trees. Everything is doused with the same water but produces a variety of fruit flavors, such as sugar cane trees that taste sweet, citrus fruit that tastes sweet and sour, and bitter fruit that tastes bitter, and so forth. God exalts a part of plants over another part in terms of its shape, taste and smell. All of these signs show the power of God and become a proposition that can generate confidence for people who want to think. According to scientific studies, the difference in taste of fruits or plants, due to differences in chemical content in it. These substances or chemical molecules are known in the language of biochemistry as metabolites. These different types and quantities of metabolites provide different tastes from different plants or fruits. The seeds of all plants, almost all of them are the same shape or are known as having the same morphology, or almost the same, that is, the morphology is round or slightly oval. All of these seeds contain plant embryos (Encyclopedia Britannica, 1965, Vol. 20, Seed, 273-275). In plant embryos it contains genetic material (or what is often referred to as DNA, Desoxyribo Nucleic Acid, or Nucleic Desoxyribo Acid). In different plant seeds, the embryonic content is different, so is the content of DNA material also different. DNA is a material that will determine the process of formation of metabolites in all living things including plants. Then God Almighty, if the different seeds are planted and watered with the same water, the seeds will grow into various plants of different tastes, depending on the genetic material they contain; because this genetic material will determine (make) the metabolites in the plant that determine the taste of the fruit or plant ...",
      "text_tafsir": "Ungkapan ayat ini merupakan kelanjutan dari tanda-tanda kekuasaan Allah yang ada di bumi, yaitu bahwa di bumi terdapat bagian-bagian tanah yang berdekatan dan berdampingan tetapi berlainan kesuburannya. Ada tanah yang sangat subur untuk ditanami tanaman apa saja, ada pula tanah yang hanya dapat ditanami pohon-pohon besar saja, tetapi tidak baik untuk ditanami tanaman palawija atau sebaliknya, ada pula tanah yang lunak dan ada pula yang keras yang sulit untuk digemburkan. Di bumi terdapat kebun-kebun anggur, tanaman palawija, dan pohon yang bercabang dan tidak bercabang. Semuanya itu disiram dengan air yang sama tetapi menghasilkan buah yang beraneka ragam rasanya, seperti pohon tebu yang rasanya manis, buah jeruk yang rasanya manis dan masam, serta buah paria yang rasanya pahit, dan lain sebagainya. Allah melebihkan sebahagian tanaman-tanaman atas sebagian yang lain baik dari bentuknya, rasanya dan baunya. Semua tanda-tanda itu menunjukkan kekuasaan Allah dan menjadi dalil yang bisa menimbulkan keyakinan bagi orang-orang yang mau berpikir.\n\nMenurut kajian saintis, perbedaan rasa dari buah-buahan atau tanaman, disebabkan perbedaan kandungan kimiawi yang ada di dalamnya. Zat atau molekul kimiawi ini, dalam bahasa ilmu biokimia dikenal dengan sebutan metabolit. Perbedaan jenis maupun kuantitas metabolit inilah yang memberikan rasa yang berbeda-beda dari tanaman atau buah yang berbeda. Biji dari semua tanaman, hampir semuanya berbentuk sama atau dikenal sebagai mempunyai morfologi yang sama, atau hampir sama, yaitu morfologi-nya bulat atau sedikit lonjong. Semua biji ini, di dalamnya terkandung embrio tanaman (Encyclopedia Britannica, 1965,Vol.20, Seed, 273-275). Dalam embrio tanaman itu terkandung materi-materi genetik (atau yang sering disebut dengan DNA, Desoxyribo Nucleic Acid, atau Asam Desoksiribo Nukleat). \n\nDalam biji tanaman yang berbeda, kandungan embrioniknya berbeda, demikian pula kandungan materi DNA-nya juga berbeda. DNA suatu materi yang akan sangat menentukan proses pembentukan metabolit dalam semua makhluk hidup termasuk tanaman. Maka Mahabesar Allah, apabila biji-biji yang berbeda itu ditanam dan disiram dengan air yang sama, biji-biji itu akan tumbuh menjadi berbagai tanaman yang berbeda rasanya, tergantung materi genetik yang dikandungnya; karena materi genetik inilah yang akan menentukan (membuat) metabolit-metabolit di dalam tanaman itu yang menentukan rasa buah atau tanaman itu..",
      "text_translation": "Dan di bumi terdapat bagian-bagian yang berdampingan, kebun-kebun anggur, tanaman-tanaman, pohon kurma yang bercabang, dan yang tidak bercabang; disirami dengan air yang sama, tetapi Kami lebihkan tanaman yang satu dari yang lainnya dalam hal rasanya. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang mengerti.",
      "text": "وَفِى الْاَرْضِ قِطَعٌ مُّتَجٰوِرٰتٌ وَّجَنّٰتٌ مِّنْ اَعْنَابٍ وَّزَرْعٌ وَّنَخِيْلٌ صِنْوَانٌ وَّغَيْرُ صِنْوَانٍ يُّسْقٰى بِمَاۤءٍ وَّاحِدٍۙ وَّنُفَضِّلُ بَعْضَهَا عَلٰى بَعْضٍ فِى الْاُكُلِۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّعْقِلُوْنَ",
      "text_translation_en": "And there are on earth [many] tracts of land close by one another [and yet widely differing from one another]; and [there are on it] vinyards, and fields of grain, and date-palms growing in clusters from one root or standing alone, [all] watered with the same water: and yet, some of them have We favoured above others by way of the food [which they provide for man and beast]. Verily, in all this there are messages indeed for people who use their reason!",
      "juz_number": 13
    },
    "5": {
      "text_tafsir_en": "This verse explains the attitude of the disbelievers towards the oneness of Allah, in which Allah tells the Prophet Muhammad that if he were surprised at their worship of idols that were harmless and beneficial after being presented with the messages of Allah, then what was more surprising was their utterance. which denies the day of resurrection on the Day of Judgment. They said, \"When we become land will we really be converted into new creatures?\" They speak the words of disobedience but they do not deny the power of God in creating them since they were in their mother's womb. The questions that contain such disobedience are repeated in eleven places in the eight chapters of the Quran, namely Surah ar-Rad \/ 13: 5, al-Isra \/ 17: 49 and 98, al-Muminun \/ 23: 35 and 82, an-Nahl \/ 16: 38, as-Sajdah \/ 32: 10, ash-shaffat \/ 37: 16 and 53, al-Waqiah \/ 56: 47, and an Naziat \/ 79: 11. impressed that the day of resurrection was impossible. They don't think it's possible for people who have died and become bones to live again. Then Allah declares that those who disobey on the Day of Resurrection are also disobedient to their Lord. Denying the power of God is the same as betraying God himself. They will be shackled to the neck as a result of the world not believing the truth and following the instructions. Some even interpreted them as being on the Day of Judgment when they were judged and put some shackles around their necks like prisoners. The Word of God: When shackles and chains were placed around their necks, they were dragged, into the hot water, and they were burned in the fire. (al-Mumin \/ 40: 71-72) They are the dwellers of eternal hell and live in disgrace as a result of their disobedience and wickedness throughout life. Allah swt by His sovereignty, is able to create everything in this world, whether living and moving, or dying, even from nothing. Therefore, God will easily resurrect man after death. The Word of God: ... he said, \"Who can revive the broken bones? Say (Muhammad),\" The one who revives it is (Allah) who created it first ... (Yasin \/ 36: 78 -79) The Word of God: Do men think that We shall not gather their bones? (In fact), We are able to arrange (return) the fingers perfectly. (al-Qiyamah \/ 75: 3-4)",
      "text_tafsir": "Ayat ini menjelaskan sikap orang kafir terhadap keesaan Allah, dimana Allah mengatakan kepada Nabi Muhammad bahwa jika beliau heran terhadap penyembahan mereka kepada berhala-berhala yang tidak memberi mudarat dan membawa manfaat setelah dikemukakan dalil-dalil keesaan Allah, maka yang lebih patut mengherankan adalah ucapan mereka yang mendustakan hari kebangkitan pada hari kiamat. Mereka berkata, \"Apabila kami telah menjadi tanah apakah kami benar-benar akan dikembalikan lagi menjadi makhluk yang baru?\"\n\nMereka mengucapkan kata-kata pengingkaran itu padahal mereka tidak mengingkari kekuasaan Allah dalam menciptakan mereka sejak berada dalam kandungan ibunya. Pertanyaan yang mengandung keingkaran itu berulang-ulang disebut dalam sebelas tempat di delapan surah dalam Al-Quran, yaitu Surah ar-Rad\/13: 5, al-Isra\/17: 49 dan 98, al-Muminun\/23: 35 dan 82, an-Nahl\/16: 38, as-Sajdah\/32: 10, ash-shaffat\/37: 16 dan 53, al-Waqiah\/56: 47, dan an-Naziat\/79: 11. Semuanya mengandung keingkaran yang sangat keras sehingga mengesankan bahwa hari kebangkitan itu mustahil akan terjadi. Menurut mereka tidak mungkin orang yang sudah meninggal dunia dan menjadi tulang-belulang akan hidup kembali. Kemudian Allah menegaskan bahwa orang yang ingkar pada hari kebangkitan itulah yang juga ingkar terhadap Tuhannya. Mengingkari kekuasaan Allah sama halnya dengan mengingkari Allah itu sendiri. Mereka akan dipasangkan belenggu di lehernya sebagai akibat di dunia tidak meyakini kebenaran dan mengikuti petunjuk. Ada pula yang menafsirkan bahwa mereka itu pada hari kiamat ketika diadili dan dipasangkan beberapa belenggu di lehernya seperti seorang tawanan. Firman Allah:\n\nKetika belenggu dan rantai dipasang di leher mereka, seraya mereka diseret, ke dalam air yang sangat panas, kemudian mereka dibakar dalam api. (al-Mumin\/40: 71-72)\n\nMereka adalah penghuni neraka yang kekal di dalamnya dan hidup dalam kehinaan sebagai akibat dari keingkaran dan kejahatannya selama hidup di dunia.\n\nAllah swt dengan sifat kemahakuasaan-Nya, mampu menciptakan segala sesuatu yang ada di dunia ini, baik yang hidup dan bergerak, maupun yang mati, bahkan dari tidak ada menjadi ada. Oleh karena itu, Allah akan dengan mudah membangkitkan kembali manusia setelah mati. Firman Allah:\n\n... dia berkata, \"Siapakah yang dapat menghidupkan tulang-belulang yang telah hancur luluh? Katakanlah (Muhammad), \"Yang akan menghidupkan-nya ialah (Allah) yang menciptakannya pertama kali... (Yasin\/36: 78-79)\n\nFirman Allah:\n\nApakah manusia mengira, bahwa Kami tidak akan mengumpulkan (kembali) tulang-belulangnya? (Bahkan), Kami mampu menyusun (kembali) jari-jemarinya dengan sempurna. (al-Qiyamah\/75: 3-4)",
      "text_translation": "Dan jika engkau merasa heran, maka yang mengherankan adalah ucapan mereka, “Apabila kami telah menjadi tanah, apakah kami akan (dikembalikan) menjadi makhluk yang baru?” Mereka itulah yang ingkar kepada Tuhannya; dan mereka itulah (yang dilekatkan) belenggu di lehernya. Mereka adalah penghuni neraka, mereka kekal di dalamnya.",
      "text": "۞ وَاِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ ءَاِذَا كُنَّا تُرَابًا ءَاِنَّا لَفِيْ خَلْقٍ جَدِيْدٍ ەۗ اُولٰۤىِٕكَ الَّذِيْنَ كَفَرُوْا بِرَبِّهِمْۚ وَاُولٰۤىِٕكَ الْاَغْلٰلُ فِيْٓ اَعْنَاقِهِمْۚ وَاُولٰۤىِٕكَ اَصْحٰبُ النَّارِۚ هُمْ فِيْهَا خٰلِدُوْنَ",
      "text_translation_en": "BUT IF thou art amazed [at the marvels of God's creation], amazing, too, is their saying, \"What! After we have become dust, shall we indeed be [restored to life] in a new act of creation?\" It is they who [thus show that they] are bent on denying their Sustainer; and it is they who carry the shackles [of their own making] around their necks; and it is they who are destined for the fire, therein to abide.",
      "juz_number": 13
    },
    "6": {
      "text_tafsir_en": "After denying the Messenger and rejecting the doom of the Day of Judgment, they again denied the punishment in the world that the Messenger had threatened them. They asked him to torture what had been threatened to them. Of course, they seek the benefit and salvation from the downfall of the torment and expect the reward promised by the Messenger of the Hereafter. Though all kinds of torments were inflicted by Allah upon those who rejected the apostles before. Some of them have their appearance and their nature is like a monkey, some are destroyed by an earthquake, and so on. On the condition of those who would rather challenge the torment of the doom than ask for the good to be mentioned in the word of Allah: And (remember) when they (the disbelievers) say, \"O Allah, if (the Quran) is true (from you) , then rain down upon us with a stone from the sky, or bring us a grievous punishment. (al-Anfal \/ 8:32) Indeed, Allah has full forgiveness for the sins of his repentant servants and has covered his sins If it had not been Forbearing, God would have tormented man for his wrongdoing. 35: 45) Verily, Allah's torment is very painful to those who commit evil and continue to stumble in error and sin, with some of the torments hurried down to the world as a consequence not from various sins, such as the health of those who used to drink alcohol, the bankruptcy of those who gambled while they were rich, and a corrupt man who was removed from his position for corruption and manipulation. So often God's forgiveness is called alongside torture so that a servant of God is always in the middle of the serpent and the king (fear of Allah's punishment and the hope of receiving His forgiveness) as Allah says: Verily your Lord is quick to torment, and verily He is Forgiving, Most Merciful. (al-Araf \/ 7: 167)",
      "text_tafsir": "Setelah mendustakan Rasul dan mengingkari azab hari kiamat, mereka mengingkari pula azab di dunia yang telah diancamkan oleh Rasulullah kepada mereka. Mereka meminta kepadanya agar siksa yang telah diancamkan kepada mereka disegerakan datangnya. Semestinya mereka memohon kebaikan dan keselamatan dari turunnya azab dan mengharapkan pahala yang dijanjikan oleh Rasulullah di akhirat. Padahal bermacam-macam azab telah ditimpakan Allah kepada umat-umat yang mendustakan para rasul sebelumnya. Di antara mereka ada yang diubah rupa dan sifatnya menjadi seperti kera, ada pula yang dihancurkan dengan gempa bumi, dan sebagainya. Tentang keadaan mereka yang lebih suka menantang turunnya azab daripada meminta kebaikan disebutkan pula dalam firman Allah:\n\nDan (ingatlah), ketika mereka (orang-orang musyrik) berkata, \"Ya Allah, jika (Al-Quran) ini benar (wahyu) dari Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih. (al-Anfal\/8: 32)\n\nSesungguhnya Allah benar-benar mempunyai ampunan yang luas terhadap dosa-dosa hamba-Nya yang bertobat dan menutupi kesalahan-kesalahannya pada hari kiamat. Seandainya tidak bersifat Maha Penyantun, tentu Allah akan menyiksa manusia karena kezalimannya. Firman Allah:\n\nDan sekiranya Allah menghukum manusia disebabkan apa yang telah mereka perbuat, niscaya Dia tidak akan menyisakan satu pun makhluk bergerak yang bernyawa di bumi ini. (Fathir\/35: 45)\n\nSesungguhnya siksaan Allah sangat pedih terhadap orang yang mengerja-kan kejahatan dan terus bergelimang dalam kesesatan dan dosa. Ada sebagian azab yang disegerakan turunnya di dunia sebagai akibat dari berbagai dosa, seperti terganggunya kesehatan orang-orang yang biasa minum minuman keras, bangkrutnya orang-orang yang suka berjudi padahal sebelumnya kaya, dan seseorang koruptor yang dicopot dari kedudukannya yang tinggi karena terlibat soal korupsi dan manipulasi. Sering sekali ampunan dari Allah itu disebut berdampingan dengan siksaan agar seorang hamba Allah selalu berada di posisi tengah antara khauf dan raja (ketakutan terhadap azab Allah dan harapan memperoleh ampunan-Nya) seperti dalam firman Allah:\n\nSesungguhnya Tuhanmu sangat cepat siksa-Nya, dan sesungguhnya Dia Maha Pengampun, Maha Penyayang. (al-Araf\/7: 167)",
      "text_translation": "Dan mereka meminta kepadamu agar dipercepat (datangnya) siksaan, sebelum (mereka meminta) kebaikan, padahal telah terjadi bermacam-macam contoh siksaan sebelum mereka. Sungguh, Tuhanmu benar-benar memiliki ampunan bagi manusia atas kezaliman mereka, dan sungguh, Tuhanmu sangat keras siksaan-Nya.",
      "text": "وَيَسْتَعْجِلُوْنَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ وَقَدْ خَلَتْ مِنْ قَبْلِهِمُ الْمَثُلٰتُۗ وَاِنَّ رَبَّكَ لَذُوْ مَغْفِرَةٍ لِّلنَّاسِ عَلٰى ظُلْمِهِمْۚ وَاِنَّ رَبَّكَ لَشَدِيْدُ الْعِقَابِ ",
      "text_translation_en": "And [since, O Prophet, they are bent on denying the truth,] they challenge thee to hasten the coming upon them of evil instead of [hoping for] good although [they ought to know that] the exemplary punishments [which they now deride] have indeed come to pass before their time. Now, behold, thy Sustainer is full of forgiveness unto men despite all their evildoing: but, behold, thy Sustainer is [also] truly severe in retribution!",
      "juz_number": 13
    },
    "7": {
      "text_tafsir_en": "This verse explains how the disbelievers spoke to the Prophet Muhammad in a challenging tone why he was not given a sign of the greatness of his Lord like a stick as a miracle given to Moses and the camel to Saleh, and why Muhammad could not make the hill of Safa gold or turning these hills into valleys with flowing rivers. They claim this because they believe that the Quran is not a miracle. Allah swt rejects their claim with His word: And nothing prevents Us from sending (the Signs) to you, except that they were rejected by the former. (al-Isra \/ 17: 59) What happens is that if the signs of God's sovereignty have been asked, and once those signs have been revealed, yet those who demand it remain unfaithful, they will be destroyed by the punishment of Allah. Allah does not require that they do not send down the signs of miracles as they demand. Prophet Muhammad saw another miracle to show the truth of his brochure. The main task of the Prophet Muhammad was simply to deliver his brochure like the task of the prophets before him, rather than to fulfill the motions and demands of his people for guidance. The business of giving guidance to one's heart is only in the hands of Allah and not the authority of the Prophet Muhammad, as it is stated in the Word of Allah: It is not your duty to give them guidance, but it is Allah who guides whom He wills. (al-Baqarah \/ 2: 272) Indeed, Prophet Muhammad was only a warner. For every people there is a leader who guides the good. They are the prophets and if they are not there, then the scholars, scholars, and mujtahidines continue to carry out the prophetic task of digging and explaining in more detail the Shari'a that contains good moral elements and guidelines for humanity. The Word of God: And none of the people except a warner came there. (Fathir \/ 35: 24)",
      "text_tafsir": "Dalam ayat ini dijelaskan bagaimana orang-orang kafir berkata kepada Nabi Muhammad dengan nada menantang mengapa tidak diturunkan kepadanya tanda kebesaran dari Tuhannya seperti tongkat sebagai mukjizat yang diberikan kepada Nabi Musa dan unta kepada Nabi Saleh, serta mengapa Muhammad tidak bisa menjadikan bukit Safa menjadi emas atau mengubah bukit-bukit ini menjadi lembah dengan sungai yang mengalir. Mereka menuntut yang demikian itu karena menyangka bahwa Al-Quran bukan merupakan mukjizat. Allah swt telah menolak tuntutan mereka itu dengan firman-Nya:\n\nDan tidak ada yang menghalangi Kami untuk mengirimkan (kepadamu) tanda-tanda (kekuasaan Kami), melainkan karena (tanda-tanda) itu telah didustakan oleh orang terdahulu. (al-Isra\/17: 59)\n\nSunatullah yang berlaku adalah jika tanda-tanda kekuasaan Allah telah diminta, dan setelah tanda-tanda itu diturunkan, namun mereka yang menuntutnya tetap membangkang dan tidak percaya, pasti mereka akan dimusnahkan dengan azab Allah. Allah tidak menghendaki yang demikian itu sehingga tidak menurunkan tanda-tanda mukjizat seperti yang mereka tuntut. Nabi Muhammad saw telah diberi mukjizat yang lain untuk menunjukkan kebenaran risalahnya. Tugas pokok Nabi Muhammad saw hanya sekedar menyampaikan risalahnya seperti tugas nabi-nabi sebelum-nya, bukan memenuhi usul dan permintaan kaumnya agar mereka dapat petunjuk. Urusan memberi petunjuk ke dalam hati seseorang hanya di tangan Allah dan tidak menjadi wewenang Nabi Muhammad, seperti diterangkan dalam firman Allah:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allahlah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah\/2: 272)\n\nSesungguhnya Nabi Muhammad hanyalah seorang pemberi peringatan. Bagi tiap-tiap umat ada pemimpin yang memberi petunjuk kepada kebaikan. Mereka itu adalah para nabi dan jika mereka telah tiada, maka ahli hikmah, ulama, dan mujtahidin yang melanjutkan tugas nabi untuk menggali dan menjelaskan syariat secara lebih terperinci yang mengandung unsur-unsur akhlak yang baik dan pedoman hidup bagi umat manusia. Firman Allah:\n\nDan tidak ada satu pun umat melainkan di sana telah datang seorang pemberi peringatan. (Fathir\/35: 24)",
      "text_translation": "Dan orang-orang kafir berkata, “Mengapa tidak diturunkan kepadanya (Muhammad) suatu tanda (mukjizat) dari Tuhannya?” Sesungguhnya engkau hanyalah seorang pemberi peringatan; dan bagi setiap kaum ada orang yang memberi petunjuk.",
      "text": "وَيَقُوْلُ الَّذِيْنَ كَفَرُوْا لَوْلَآ اُنْزِلَ عَلَيْهِ اٰيَةٌ مِّنْ رَّبِّهٖۗ اِنَّمَآ اَنْتَ مُنْذِرٌ وَّلِكُلِّ قَوْمٍ هَادٍ ࣖ ",
      "text_translation_en": "However, they who are bent on denying the truth [refuse to believe and] say, \"Why has no miraculous sign ever been bestowed on him from on high by his Sustainer?\" [But] thou art only a warmer; and [in God] all people have a guide.",
      "juz_number": 13
    },
    "8": {
      "text_tafsir_en": "This verse explains that Allah knows what every woman in her womb contains, whether the contents of the womb are male or female, single or twin, and will be of long age or short, as stated in His Word: He knows about you, since He made you from the ground then when you were a fetus in your mother's stomach. (an-Najm \/ 53: 32) Allah knows the imperfect womb, where the baby has a bodily defect. God knows the contents of the uterus that are twins, three, four, or more, and that the period of uterus is nine months, less than that, or more. According to research in several hospitals in London, the fetus can not live in the mother's womb more than 305 days, while according to research hospitals in Berlin no more than 308 days. For each thing there has been a measure in the sight of Allah Almighty, there are no shortcomings or additions, as stated in His Word: Indeed, We create everything according to size. (al-Qamar \/ 54: 49) The above verse gives a statement about the embryological process that occurs in the womb. The full verse about changes that occur in the process of human embryology can be seen in Surah Al-Muminun \/ 23: 12-16 which fragments as follows: And truly, We have created man from the essence (derived) from the ground. Then We make it semen (which is kept) in a firm place (the womb). ¦ Two other verses that talk generally about the stages in human development. First is the following Surah Noah \/ 71: 13-14: Why are you not afraid of the greatness of Allah? And truly, He has created you on several levels (events). The second verse is Surah Fathir \/ 35: 11 which fragments as follows: And Allah created you from the ground then from semen, then He made you in pairs (male and female).",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah mengetahui apa yang dikandung oleh setiap perempuan dalam rahimnya, baik isi kandungan itu berjenis kelamin laki-laki ataupun perempuan, satu atau kembar, dan akan panjang usianya atau pendek, seperti tersebut dalam firman-Nya:\n\nDia mengetahui tentang kamu, sejak Dia menjadikan kamu dari tanah lalu ketika kamu masih janin dalam perut ibumu. (an-Najm\/53: 32)\n\nAllah mengetahui kandungan rahim yang kurang sempurna, dimana bayinya memiliki cacat tubuh. Allah mengetahui kandungan rahim yang kembar dua, tiga, empat, atau lebih, dan yang masa kandungannya sempurna sembilan bulan, kurang dari itu, ataupun lebih. Menurut penelitian beberapa rumah sakit di London, janin tidak dapat hidup dalam kandungan ibunya lebih dari 305 hari, sedangkan menurut penelitian rumah sakit di Berlin tidak lebih dari 308 hari. Bagi tiap-tiap sesuatu telah ada ukurannya di sisi Allah swt, tidak ada kekurangan atau tambahannya, seperti tersebut dalam firman-Nya:\n\nSungguh, Kami menciptakan segala sesuatu menurut ukuran. (al-Qamar\/54: 49)\n\nAyat di atas memberikan pernyataan mengenai proses embriologi yang terjadi dalam kandungan. Ayat selengkapnya mengenai perubahan yang terjadi dalam proses embriologi manusia dapat dilihat pada Surah Al-Muminun\/23: 12-16 yang penggalannya sebagai berikut: Dan sungguh, Kami telah menciptakan manusia dari saripati (berasal) dari tanah. Kemudian Kami menjadikannya air mani (yang disimpan) dalam tempat yang kokoh (rahim).¦\n\nDua ayat lain yang membicarakan secara umum mengenai tahapan-tahapan dalam perkembangan manusia. Pertama adalah Surah Nuh\/71: 13-14 berikut: Mengapa kamu tidak takut akan kebesaran Allah? Dan sungguh, Dia telah menciptakan kamu dalam beberapa tingkatan (kejadian). Ayat kedua adalah Surah Fathir\/35: 11 yang penggalannya sebagai berikut: Dan Allah menciptakan kamu dari tanah kemudian dari air mani, kemudian Dia menjadikan kamu berpasangan (laki-laki dan perempuan).",
      "text_translation": "Allah mengetahui apa yang dikandung oleh setiap perempuan, apa yang kurang sempurna dan apa yang bertambah dalam rahim. Dan segala sesuatu ada ukuran di sisi-Nya.",
      "text": "اَللّٰهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ اُنْثٰى وَمَا تَغِيْضُ الْاَرْحَامُ وَمَا تَزْدَادُ ۗوَكُلُّ شَيْءٍ عِنْدَهٗ بِمِقْدَارٍ ",
      "text_translation_en": "God knows what any female bears [in her womb], and by how much the wombs may fall short [in gestation], and by how much they may increase [the average period]: for with Him everything is [created] in accordance with its scope and purpose.",
      "juz_number": 13
    },
    "9": {
      "text_tafsir_en": "This verse explains that He is the One Who Knows the unseen, the visible, and the unseen human senses. Science has proven that there are creatures that cannot be seen with the naked eye, because they are so small. He can only be seen with a microscope and telescope, such as bacteria and viruses that can transmit various diseases that are very difficult to eradicate, or until now no cure has been found. Bacteria and viruses are included in the army of God, who can not be known how many but by God himself, as explained in his word:",
      "text_tafsir": "Ayat ini menjelaskan bahwa Dialah Tuhan Yang Mengetahui yang gaib, yang tampak, dan yang tidak bisa diketahui oleh pancaindra manusia. Ilmu pengetahuan telah membuktikan bahwa ada makhluk yang tidak dapat dilihat dengan mata telanjang, karena kecil sekali. Ia baru dapat dilihat dengan mikroskop dan teleskop, seperti bakteri dan virus yang dapat menularkan bermacam-macam penyakit yang sulit sekali untuk diberantas, atau sampai sekarang belum ditemukan obat pembasminya. Bakteri dan virus itu termasuk tentara Allah, yang tidak dapat diketahui berapa jumlahnya melainkan oleh Allah sendiri, seperti diterangkan dalam firman-Nya:",
      "text_translation": "(Allah) Yang mengetahui semua yang gaib dan yang nyata; Yang Mahabesar, Mahatinggi.",
      "text": "عٰلِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيْرُ الْمُتَعَالِ ",
      "text_translation_en": "He knows all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind -the Great One, the One far above anything that is or could ever be!",
      "juz_number": 13
    },
    "10": {
      "text_tafsir_en": "Furthermore, this verse explains the Omniscient nature of Allah towards someone who keeps his word secret and keeps it in his heart, or who frankly says it. All are equal before God. There is nothing vague or veiled for Him. like the Word of God: And if you harden your words, truly, He knows the secret and what is more hidden. (thaha \/ 20: 7) Likewise, God knows who hides at night and walks appearing during the day. All that remains within the scope of His knowledge because God is All-Knowing everything. The Word of God: And the keys of all that are in His unbelief; no one knows but Him. He knows what is on land and at sea. There is not a single fallen leaf that He does not know. There is not a single seed in the darkness of the earth and not something wet or dry, which is not written in the real book (Lauh Mahfudh). (al-Anam \/ 6: 59)",
      "text_tafsir": "Selanjutnya ayat ini menerangkan sifat Maha Mengetahui Allah terhadap seseorang yang merahasiakan ucapannya dan menyimpan dalam hatinya, atau yang berterus terang mengucapkannya. Semua itu sama di hadapan Allah. Tidak ada yang samar atau terselubung bagi-Nya. seperti Firman Allah:\n\nDan jika engkau mengeraskan ucapanmu, sungguh, Dia mengetahui rahasia dan yang lebih tersembunyi. (thaha\/20: 7)\n\nBegitu pula Allah mengetahui siapa yang bersembunyi di malam hari dan berjalan menampakkan diri di siang hari. Semua itu tetap berada dalam ruang lingkup pengetahuan-Nya karena Allah Maha Mengetahui segalanya. Firman Allah:\n\nDan kunci-kunci semua yang gaib ada pada-Nya; tidak ada yang mengetahui selain Dia. Dia mengetahui apa yang ada di darat dan di laut. Tidak ada sehelai daun pun yang gugur yang tidak diketahui-Nya. Tidak ada sebutir biji pun dalam kegelapan bumi dan tidak pula sesuatu yang basah atau yang kering, yang tidak tertulis dalam Kitab yang nyata (Lauh Mahfudh). (al-Anam\/6: 59)",
      "text_translation": "Sama saja (bagi Allah), siapa di antaramu yang merahasiakan ucapannya dan siapa yang berterus terang dengannya; dan siapa yang bersembunyi pada malam hari dan yang berjalan pada siang hari.",
      "text": "سَوَاۤءٌ مِّنْكُمْ مَّنْ اَسَرَّ الْقَوْلَ وَمَنْ جَهَرَ بِهٖ وَمَنْ هُوَ مُسْتَخْفٍۢ بِالَّيْلِ وَسَارِبٌۢ بِالنَّهَارِ ",
      "text_translation_en": "It is all alike [to Him] whether any of you conceals his thought or brings it into the open, and whether he seeks to hide [his evil deeds] under the cover of night or walks [boldly] in the light of day,",
      "juz_number": 13
    },
    "11": {
      "text_tafsir_en": "This verse explains that Allah swt assigns to some angels to always follow man in turn, in front and behind him. They kept it at the command of God. There are angels in charge of human beings at night, and some in the daytime, guarding against various dangers and harm. There are also angels who record all human deeds, good or bad, which are angels on the right and left. The angel on the right recorded all the good, and the left one wrote the charity, and the other two angels, one in the front and the other in the back. Each person has four angels during the day and four at night. They come in turns, as described in the authentic hadith: There are some angels who watch over you night and day. They met (at the time of submission) at dawn and Ashar, then ascended the angels guarding the night to Allah Taala. He asked, knowing that he would ask, \"What was the condition of my servants when you left them?\" The angel answered, \"We came to them in prayer and we left them, and they are praying.\" (History of al-Bukhari from Abu Hurairah) When a man knows that there are angels who record all deeds of deeds and watch over them, he must always guard himself from evil deeds because his activities will be seen by those angels. The angels' oversight of human actions can be believed to be true after science has created modern tools that can record all the events that occur to human beings. For example, the measurement of electricity and drinking water usage in each town and village has been set up in such a way that it is possible to know how much has been used and how much the user should pay. Similarly, devices are mounted on motor vehicles that can record speeds and measure how far they have traveled. The development of knowledge that can reveal a variety of supernatural things, as evidence that gives us confidence in the validity of the theory of religious provision. It is also a reason to convince people who are governed by material doctrine, that they acknowledge the existence of magical things that cannot be felt and known only by the senses. Therefore, it is correct to say that the position of religion and knowledge in Islam is like two inseparable twins, or like two friends who are always together and in disagreement. They guard men by the command of God and His permission. They do their job perfectly. Just as in the physical world there is a close connection between cause and effect, according to wisdom, just as there is a mask that can protect the eyes from things that may enter and destroy them, so in the spirit, God has assigned some angels to protect mankind from various harm and the temptation of lust and the devil. Allah swt has commissioned the angels to record human deeds even though we do not know how to record them. We know that God Himself is sufficient to know it, but why does He still assign angels to record it? It may contain wisdom to make people more submissive and cautious in their actions because the knowledge of Allah encompasses them. Their charity is recorded so accurately that no one will ever be harmed in the judgment of God. Ali bin Abi Talib says that no servant but an angel guarded him from the fall of the wall, fell into a well, devoured animals, drowned, or burned. However, when certainty comes from God or when death comes, they let humanity be plagued by disasters and so on. God will not change the state of a nation from the enjoyment and prosperity of its enjoyment to decay and misery, but they themselves will change it. It is caused by acts of violence and hostility to one another, as well as to the damage and sin of the earth. Hadith of the Messenger of Allah (may peace be upon him): If people see a wrongdoer and do not act upon it, then it is possible that Allah will bring down the punishment that is upon them all. (The History of Abu Dawud, at-Tirmidzi, and Ibn Majah of Abu Bakr ash-shiddiq) This statement is reinforced by the word of Allah: And protect yourself from torments that not only afflict the unjust among you. (al-Anfal \/ 8: 25) Muslims in the first phase of the spread of Islam followed the teachings of the Quran with conviction and awareness, so that they became the best people among mankind. They conquered many prosperous regions at that time, and conquered the empires of Rome and Persia by exercising wisdom in a just government, and witnessed by their enemies. The oppressed are defended in order to uphold justice. Therefore, Islam has been recognized as an absolute element in the character development of nation and nation building. As their generations passed and were replaced by generations to come, it turned out that many had rejected religious teachings about justice and truth, and their condition had turned into a despicable nation. In the past, they were a nation of honor, authority, honor, and respect from friends and foes. They became a people enslaved by the colonists, but before them they were rulers. They became a stubborn nation, but they were once a leading nation. Ibn Khaldun in his Muqaddimah has written a chapter titled: Violence Can Destroy Prosperity. He cites some examples in history before and after Islam, that tyranny overthrew the power of the Muslims and degraded its status, and thus became the crux of all nations. Muslims who had been poor for centuries under the rule and rule of the West. When God expects a people to suffer from sickness, poverty, or other kinds of trials as a result of the evil deeds they have committed, then no one can reject them and there is never a protector for them other than God.",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah swt menugaskan kepada beberapa malaikat untuk selalu mengikuti manusia secara bergiliran, di muka dan di belakangnya. Mereka menjaganya atas perintah Allah. Ada malaikat yang bertugas menjaga manusia di malam hari, dan ada yang di siang hari, menjaga dari pelbagai bahaya dan kemudaratan. Ada pula malaikat yang mencatat semua amal perbuatan manusia, yang baik atau yang buruk, yaitu malaikat yang berada di sebelah kanan dan kiri. Malaikat yang berada di sebelah kanan mencatat segala kebaikan, dan yang di sebelah kiri mencatat amal keburukan, dan dua malaikat lainnya, yang satu di depan dan satu lagi di belakang. Setiap orang memiliki empat malaikat empat pada siang hari dan empat pada malam hari. Mereka datang secara bergiliran, sebagaimana diterangkan dalam hadis yang sahih:\n\nAda beberapa malaikat yang menjaga kamu secara bergiliran di malam hari dan di siang hari. Mereka bertemu (untuk mengadakan serah terima) pada waktu salat Subuh dan salat Ashar, lalu naiklah malaikat-malaikat yang menjaga di malam hari kepada Allah Taala. Dia bertanya, sedangkan Ia sudah mengetahui apa yang akan ditanyakannya itu, \"Bagaimana keadaan hamba-hamba-Ku ketika kamu meninggalkan mereka (di dunia)?\" Malaikat menjawab, \"Kami datang kepada mereka ketika salat dan kami meninggalkan mereka, dan mereka pun sedang salat.\" (Riwayat al-Bukhari dari Abu Hurairah)\n\nApabila manusia mengetahui bahwa di sisinya ada malaikat-malaikat yang mencatat semua amal perbuatan dan mengawasinya, maka dia harus selalu menjaga diri dari perbuatan maksiat karena setiap aktivitasnya akan dilihat oleh malaikat-malaikat itu. Pengawasan malaikat terhadap perbuatan manusia dapat diyakini kebenarannya setelah ilmu pengetahuan menciptakan alat-alat modern yang dapat mencatat semua kejadian yang terjadi pada diri manusia. Sebagai contoh, alat pengukur pemakaian aliran listrik dan air minum di tiap-tiap kota dan desa telah diatur sedemikian rupa sehingga dapat diketahui berapa jumlah yang telah dipergunakan dan berapa yang harus dibayar oleh si pemakai. Demikian pula alat-alat yang dipasang di kendaraan bermotor yang dapat mencatat kecepatannya dan mengukur berapa jarak yang telah ditempuh. \n\nPerkembangan ilmu pengetahuan yang dapat mengungkapkan bermacam-macam perkara gaib, sebagai bukti yang dapat memberi keyakinan kepada kita tentang benarnya teori ketentuan agama. Hal itu juga menjadi sebab untuk meyakinkan orang-orang yang dikuasai oleh doktrin kebendaan, sehingga mereka mengakui adanya hal-hal gaib yang tidak dapat dirasakan dan diketahui hanya dengan panca indera. Oleh karena itu, sungguh tepat orang yang mengatakan bahwa kedudukan agama dan pengetahuan dalam Islam laksana dua anak kembar yang tidak dapat dipisahkan, atau seperti dua orang kawan yang selalu bersama seiring sejalan dan tidak saling berbantahan.\n\nMalaikat-malaikat itu menjaga manusia atas perintah Allah dan seizin-Nya. Mereka menjalankan tugas dengan sempurna. Sebagaimana dalam alam kebendaan ada hubungan erat antara sebab dan akibat, sesuai dengan hikmahnya, seperti adanya pelupuk mata yang dapat melindungi mata dari benda yang mungkin masuk dan bisa merusaknya, demikian pula dalam kerohanian, Allah telah menugaskan beberapa malaikat untuk menjaga manusia dari berbagai kemudaratan dan godaan hawa nafsu dan setan. \n\nAllah swt telah menugaskan para malaikat itu untuk mencatat amal perbuatan manusia meskipun kita tidak tahu bagaimana cara mereka mencatat. Kita mengetahui bahwa sesungguhnya Allah sendiri cukup untuk mengetahuinya, tetapi mengapa Dia masih menugaskan malaikat untuk mencatatnya? Mungkin di dalamnya terkandung hikmah agar manusia lebih tunduk dan berhati-hati dalam bertindak karena kemahatahuan Allah melingkupi mereka. Amal mereka terekam dengan akurat sehingga kelak tidak ada yang merasa dizalimi dalam pengadilan Allah.\n\nAli bin Abi Talib mengatakan bahwa tidak ada seorang hamba pun melainkan ada malaikat yang menjaganya dari kejatuhan tembok, jatuh ke dalam sumur, dimakan binatang buas, tenggelam, atau terbakar. Akan tetapi, bilamana datang kepastian dari Allah atau saat datangnya ajal, mereka membiarkan manusia ditimpa oleh bencana dan sebagainya. \n\nAllah tidak akan mengubah keadaan suatu bangsa dari kenikmatan dan kesejahteraan yang dinikmatinya menjadi binasa dan sengsara, melainkan mereka sendiri yang mengubahnya. Hal tersebut diakibatkan oleh perbuatan aniaya dan saling bermusuhan, serta berbuat kerusakan dan dosa di muka bumi. Hadis Rasulullah saw: \n\nJika manusia melihat seseorang yang zalim dan tidak bertindak terhadapnya, maka mungkin sekali Allah akan menurunkan azab yang mengenai mereka semuanya. (Riwayat Abu Dawud, at-Tirmidzi, dan Ibnu Majah dari Abu Bakar ash-shiddiq)\n\nPernyataan ini diperkuat dengan firman Allah:\n\nDan peliharalah dirimu dari siksaan yang tidak hanya menimpa orang-orang yang zalim saja di antara kamu. (al-Anfal\/8: 25)\n\nKaum muslimin pada fase pertama penyebaran Islam telah mengikuti ajaran-ajaran Al-Quran dengan penuh keyakinan dan kesadaran, sehingga mereka menjadi umat terbaik di antara manusia. Mereka menguasai berbagai kawasan yang makmur pada waktu itu, serta mengalahkan kerajaan Roma dan Persia dengan menjalankan kebijaksanaan dalam pemerintahan yang adil, dan disaksikan oleh musuh-musuhnya. Orang-orang yang teraniaya dibela dalam rangka menegakkan keadilan. Oleh karena itu, agama Islam telah diakui sebagai unsur mutlak dalam pembinaan karakter bangsa dan pembangunan negara.\n\nSetelah generasi mereka berlalu dan diganti dengan generasi yang datang kemudian, ternyata banyak yang melalaikan ajaran agama tentang keadilan dan kebenaran, sehingga keadaan mereka berubah menjadi bangsa yang hina. Padahal sebelum itu, mereka merupakan bangsa yang terhormat, berwibawa, mulia, dan disegani oleh kawan maupun lawan. Mereka menjadi bangsa yang diperbudak oleh kaum penjajah, padahal sebelumnya mereka sebagai penguasa. Mereka menjadi bangsa yang mengekor, padahal dahulunya mereka merupakan bangsa yang memimpin.\n\nIbnu Khaldun dalam Muqaddimah-nya telah mencantumkan sebuah bab dengan judul: Kezaliman dapat Menghancurkan Kemakmuran. Beliau mengemukakan beberapa contoh dalam sejarah sebelum dan sesudah Islam, bahwa kezaliman itu menghancurkan kekuasaan umat Islam dan merendahkan derajatnya, sehingga menjadi rongrongan dari semua bangsa. Umat Islam yang pernah jaya terpuruk beberapa abad lamanya di bawah kekuasaan dan penjajahan orang Barat.\n\nApabila Allah menghendaki keburukan bagi suatu kaum dengan penyakit, kemiskinan, atau bermacam-macam cobaan yang lain sebagai akibat dari perbuatan buruk yang mereka kerjakan, maka tak ada seorang pun yang dapat menolaknya dan sekali-kali tidak ada pelindung bagi mereka selain Allah.",
      "text_translation": "Baginya (manusia) ada malaikat-malaikat yang selalu menjaganya bergiliran, dari depan dan belakangnya. Mereka menjaganya atas perintah Allah. Sesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri. Dan apabila Allah menghendaki keburukan terhadap suatu kaum, maka tak ada yang dapat menolaknya dan tidak ada pelindung bagi mereka selain Dia.",
      "text": "لَهٗ مُعَقِّبٰتٌ مِّنْۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهٖ يَحْفَظُوْنَهٗ مِنْ اَمْرِ اللّٰهِ ۗاِنَّ اللّٰهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتّٰى يُغَيِّرُوْا مَا بِاَنْفُسِهِمْۗ وَاِذَآ اَرَادَ اللّٰهُ بِقَوْمٍ سُوْۤءًا فَلَا مَرَدَّ لَهٗ ۚوَمَا لَهُمْ مِّنْ دُوْنِهٖ مِنْ وَّالٍ ",
      "text_translation_en": "[thinking that] he has hosts of helpers-both such as can be perceived by him and such as are hidden from him -that could preserve him from whatever God may have willed. Verily, God does not change men's condition unless they change their inner selves; and when God wills people to suffer evil [in consequence of their own evil deeds], there is none who could avert it: for they have none who could protect them from Him.",
      "juz_number": 13
    },
    "12": {
      "text_tafsir_en": "He is the God who shows lightning, which causes fear of being struck by lightning for people who are in the wild or traveling. But sometimes lightning and thunder raises hope for others such as farmers who expect rain to irrigate their fields and fields. Likewise, everything in this world is sometimes seen as good because it is needed at certain times, and sometimes it is considered bad considering the harm it might cause. God also held a cloud containing rain water and because of its weight, the cloud poured down to the surface of the earth fell into rain. According to scientific studies, the formation of clouds clouds (thunder-clouds), lightning, thunder, and lightning, as expressed in the Qur'an, from the beginning believed by many scientists is a natural phenomenon that has a close relationship with the process of rain and or storm events which often occurs on the surface of the earth. This phenomenon is a sign of God's power and might. Indeed, not all types of clouds can bring rain. Clouds that can cause rainfall are clouds of cumulonimbus (cumulonimbus). According to scientists, the clouds formed will produce positive and negative charge separators (electricity). Positive charges generally gather at the top of the cloud, while negative charges gather at the bottom of the cloud. The charge will flow through various ways such as between the bag of charge in the cloud, from the cloud to the earth, released through the air as a stream of electrostatic charge, and jumping into the ionosphere. This giant sparks jump is known as lightning, lightning, or lightning. As a result, the air splits, the lightning which has speeds reaching 150,000 km \/ sec will cause thunderous sounds that we usually call quakes, thunder, thunder, thunder, and others. This thunderous sound shrinks the hearts of people who hear it and its effects can often be deadly to humans. This is what is meant by \"frightening lightning\". Benjamin Franklin (1752) succeeded in proving that lightning is a very large electric discharge. From the results of the study it was found out that the minimum electric field that allows lightning to trigger this is around 1,000,000 volts per meter. Under certain conditions, the earth which tends to be a static electricity reducer, can also interact. This is possible by the concentration of positively charged electricity due to differences in charge between the cloud base and the surface of the earth. What followed was a transfer of electric charge. So physically we will see a bolt of lightning with an electric charge that is so large, then it will immediately spread to the surface of the earth which then spreads into the ground and finally neutralized at depths containing groundwater. The place where this electric charge transfer occurs which often brings disaster and damage. This is commonly known as being struck by lightning or thunder. From other observations it is known that lightning has benefits for the earth and humans. Lightning is a natural process that produces the elements of nitrogen needed by plants and fills around 4\/5 of the earth's atmosphere, even lightning also functions in the global electrical circuit. Giant lightning flashes are believed to be able to help balance the global electrical circuits between earth and space and also concentrate on the formation of ozone. In addition, the sparkling lightning can produce fungus. According to research in Japan, Shiitake mushrooms can flourish if around the sown seeds are given an electric jump, which is the same as lightning effects. This is based on the experience that after yesterday's afternoon there was lightning, the next day around it grew a lot of fungus. In addition, the length (strength) of lightning can predict rainfall that will fall the next day. Such is the explanation from the scientific view.",
      "text_tafsir": "Dialah Tuhan yang memperlihatkan kilat, yang menimbulkan ketakutan disambar petir bagi orang-orang yang sedang berada di alam bebas atau bepergian. Tetapi kadangkala kilat dan petir itu menimbulkan harapan bagi orang lain seperti para petani yang mengharapkan turunnya hujan untuk mengairi sawah dan ladangnya. Demikian pula segala sesuatu di dunia ini, kadang-kadang dipandang baik karena dibutuhkan pada masa-masa tertentu, dan kadangkala dipandang buruk mengingat kemudaratan yang mungkin ditimbulkannya. Allah pula yang mengadakan awan mendung yang mengandung air hujan dan karena beratnya, maka awan tersebut tercurah ke permukaan bumi turun menjadi hujan.\n\nMenurut kajian saintis, terbentuknya awan-awan mendung (thunder-clouds), kilat, guruh, dan halilintar, sebagaimana diungkapkan dalam Al-Quran, sejak awal diyakini oleh banyak ilmuwan merupakan fenomena alam yang mempunyai hubungan yang erat dengan proses kejadian hujan dan atau badai yang sering terjadi di permukaan bumi. Fenomena ini adalah salah satu tanda kekuasaan dan keperkasaan Allah.\n\nMemang tidak semua jenis awan bisa mendatangkan hujan. Awan yang dapat menyebabkan turunnya hujan adalah awan dari jenis kumulonimbus (cumulonimbus). Menurut saintis, awan yang terbentuk akan menghasilkan pemisah muatan (listrik) positif dan negatif. Muatan positif umumnya berkumpul di bagian atas awan, sedangkan muatan negatif berkumpul di bagian bawah awan. Muatan tersebut akan mengalir melalui berbagai cara seperti antar kantong muatan di awan, dari awan ke bumi, lepas melalui udara sebagai aliran muatan elektrostatik, dan meloncat ke ionosfer. Lompatan bunga api raksasa ini dikenal sebagai petir, kilat, atau halilintar. Sebagai akibatnya udara terbelah, sambarannya yang memiliki kecepatan mencapai 150.000 km\/detik akan menimbulkan bunyi menggele-gar yang biasa kita sebut geluduk, geledek, guruh, guntur, dan lain-lain. Suara geledek ini menciutkan hati manusia yang mendengarnya dan dampaknya kerap bisa mematikan manusia. Inilah yang dimaksud dengan \"kilat yang menakutkan\".\n\nBenjamin Franklin (1752) berhasil membuktikan bahwa petir adalah suatu lompatan listrik (electric discharge) yang sangat besar. Dari hasil penelitian kemudian diketahui bahwa besar medan listrik minimal yang memungkinkan terpicunya petir ini adalah sekitar 1.000.000 volt per meter. \n\nDalam kondisi tertentu, bumi yang cenderung menjadi peredam listrik statis, bisa pula ikut berinteraksi. Hal ini dimungkinkan terjadi peng-konsentrasian listrik bermuatan positif karena adanya beda muatan antara dasar awan dengan permukaan bumi. Yang terjadi kemudian adalah perpindahan muatan listrik. Maka secara fisik kita akan melihat sambaran petir dengan muatan listrik yang begitu besar, selanjutnya akan segera menyebar ke bagian permukaan bumi yang kemudian menjalar ke dalam tanah dan akhirnya ternetralisasi pada kedalaman yang mengandung air tanah. Tempat terjadinya perpindahan muatan listrik ini yang sering kali mendatangkan musibah dan kerusakan. Ini yang biasa dikenal dengan istilah disambar petir atau geledek.\n\nDari sisi pengamatan lainnya diketahui bahwa petir mempunyai manfaat bagi bumi dan manusia. Petir merupakan proses alam yang menghasilkan unsur nitrogen yang dibutuhkan tumbuh-tumbuhan dan mengisi sekitar 4\/5 atmosfir bumi, bahkan petir juga berfungsi dalam sirkuit global listrik. Kilatan petir raksasa diyakini akan dapat membantu menyeimbangkan sirkuit global listrik antara bumi dan angkasa dan juga berkonsentrasi dalam pembentukan ozon. Selain itu maka kilat yang berkilauan itu bisa menghasilkan jamur. Menurut penelitian di Jepan, jamur shiitake bisa tumbuh subur bila di sekitar benih yang ditaburkan itu diberi loncatan listrik, yang sama dengan efek kilat. Hal ini berdasarkan pengalaman bahwa setelah kemarin sorenya ada kilat, besoknya di sekitarnya tumbuh banyak sekali jamur. Selain itu panjang (kekuatan) kilat bisa meramalkan curah hujan yang bakal turun keesokan harinya. Demikian penjelasan dari pandangan saintis.",
      "text_translation": "Dialah yang memperlihatkan kilat kepadamu, yang menimbulkan ketakutan dan harapan, dan Dia menjadikan mendung. ",
      "text": "هُوَ الَّذِيْ يُرِيْكُمُ الْبَرْقَ خَوْفًا وَّطَمَعًا وَّيُنْشِئُ السَّحَابَ الثِّقَالَۚ  ",
      "text_translation_en": "HE IT IS who displays before you the lightning, to give rise to [both] fear and hope, and calls heavy clouds into being;",
      "juz_number": 13
    },
    "13": {
      "text_tafsir_en": "The thunderous sound emitted by lightning due to a huge electrical leap according to the Quran is the reading of his beard in praise of God. It is a sign of his submission to God, purifying him of the fellowship and the disclosure of his weaknesses against the power of his Most High and Great Creator. Every thing that speaketh, it speaketh with a voice, and a voice is heard by men: he knoweth not the language; (al-Isra \/ 17: 44) When we hear the sound of thunder and lightning, it is used to recite the prayer, as the Prophet hadith narrated by al-Bukhari, Ahmad, at-Tirmidzi, an-Nasai of Ibn Umar, that the Prophet Muhammad when he heard the sound of thunder and lightning he read: O God, do not kill us in Your wrath, do not destroy us with Your torment, and give us health. Ibn Mardawaih narrated the hadith from Abu Hurairah as follows: That the Messenger of Allah (may peace be upon him) when there was a strong wind, or heard the sound of thunder, the color of his face changed, and he said to the thunder, \"The Holy of Holies, which thunders praise him.\" And to the wind he said, \"O Allah make the wind a mercy and not a punishment.\" In the same way, angels glorify God and praise Him. God sends lightning, then he knows whom He wills and destroys it. However, they still argue about the attributes of God described by His apostles, such as: His perfect knowledge, power, uniqueness, and determination to bring mankind back to the Day of Judgment to set them on the Day of Judgment and revenge. In this verse, Allah swt asks the Prophet to be patient with the ignorance of the Muslims who demanded him to bring miracles such as the stick of Moses, the miracle of Jesus, and others. In fact, the Quran itself is the greatest and eternal miracle of all time, no one can duplicate it. Allah made the Prophet patient because they had gone beyond the limits of Allah and His Exaltation, made allies for Him, declared that Allah had children, and denied the day of Resurrection and retribution. In this way, Allah swore the Prophet's heart not to succumb to sorrow in the face of all these challenges, and declared that He is the Almighty (as He is), as He says: And such is the punishment of your Lord when He torments (the people) countries that do wrong. Really, His torment is so painful, so heavy. (Hud \/ 11: 102)",
      "text_tafsir": "Suara menggelegar yang dikeluarkan oleh petir akibat terjadinya lompatan listrik yang sangat besar menurut Al-Quran adalah bacaan tasbihnya dalam memuji Allah. Ini merupakan tanda ketundukannya kepada Allah, menyucikan-Nya dari persekutuan dan pengungkapan kelemahan dirinya dibandingkan kekuasaan Penciptanya Yang Mahaluhur dan Maha Agung. Tiap-tiap benda yang bersuara maka suaranya itu berarti tasbih, hanya saja manusia tidak mengerti bahasanya:\n\nDan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. (al-Isra\/17: 44)\n\nApabila kita mendengar suara guntur dan halilintar, maka disunatkan untuk membaca doa, sebagaimana hadis Rasulullah yang diriwayatkan oleh al-Bukhari, Ahmad, at-Tirmidzi, an-Nasai dari Ibnu Umar, bahwa Nabi Muhammad saw bila mendengar suara guntur dan halilintar beliau membaca:\n\nYa Allah, janganlah Engkau membunuh kami dengan kemurkaan-Mu, janganlah Engkau membinasakan kami dengan azab-Mu, dan berilah kesehatan kepada kami sebelum itu.\n\nIbnu Mardawaih meriwayatkan hadis dari Abu Hurairah sebagai berikut:\n\nBahwa Rasulullah saw bila ada tiupan angin yang keras, atau mendengar suara guruh, warna mukanya berubah, lalu beliau berkata untuk guruh itu, \"Mahasuci Zat, yang guruh bertasbih kepada-Nya.\" Dan kepada angin beliau berkata, \"Ya Allah jadikanlah angin itu sebagai rahmat dan jangan jadikan sebagai azab.\"\n\nDemikian pula para malaikat bertasbih karena takut kepada Allah dan memuji kepada-Nya. Allah melepaskan halilintar, lalu mengenai siapa yang Dia kehendaki dan membinasakannya. Namun demikian, mereka tetap berbantah-bantahan tentang sifat-sifat Allah yang telah diterangkan oleh rasul-Nya, seperti: ilmu-Nya yang sempurna, kekuasaan, keesaan, dan ketentuan-Nya menghidupkan manusia kembali di hari kiamat untuk menghisab mereka pada hari pengadilan dan pembalasan. \n\nPada ayat ini, Allah swt menyuruh Nabi supaya bersikap sabar atas keingkaran orang-orang musyrik yang menuntutnya untuk mendatangkan mukjizat seperti tongkat Musa, mukjizat Isa, dan lain-lain. Padahal, Al-Quran sendiri adalah mukjizat terbesar dan kekal sepanjang masa, tidak dapat ditiru oleh siapapun juga. Allah menyuruh Nabi bersabar karena mereka itu sudah melampaui batas sampai mengingkari ketuhanan Allah dan Keesaan-Nya, mengadakan berbagai sekutu bagi-Nya, mengatakan bahwa Allah mempunyai anak, dan mengingkari adanya hari kebangkitan dan pembalasan. Dengan cara demikian, Allah swt menenteramkan hati Nabi supaya jangan larut dalam kesedihan dalam menghadapi semua tantangan itu, dan menyatakan bahwa Dialah Tuhan Yang Mahakeras (siksa-Nya), seperti tercantum dalam firman-Nya:\n\nDan begitulah siksa Tuhanmu apabila Dia menyiksa (penduduk) negeri-negeri yang berbuat zalim. Sungguh, siksa-Nya sangat pedih, sangat berat. (Hud\/11: 102)",
      "text_translation": "Dan guruh bertasbih memuji-Nya, (demikian pula) para malaikat karena takut kepada-Nya, dan Allah melepaskan halilintar, lalu menimpakannya kepada siapa yang Dia kehendaki, sementara mereka berbantah-bantahan tentang Allah, dan Dia Mahakeras siksaan-Nya.",
      "text": "وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهٖ وَالْمَلٰۤىِٕكَةُ مِنْ خِيْفَتِهٖۚ وَيُرْسِلُ الصَّوَاعِقَ فَيُصِيْبُ بِهَا مَنْ يَّشَاۤءُ وَهُمْ يُجَادِلُوْنَ فِى اللّٰهِ ۚوَهُوَ شَدِيْدُ الْمِحَالِۗ  ",
      "text_translation_en": "and the thunder extols His limitless glory and praises Him, and [so do] the angels, in awe of Him; and He [it is who] lets loose the thunderbolts and strikes with them whom He wills. And yet, they stubbornly argue about God, notwithstanding [all evidence] that He alone has the power to contrive whatever His unfathomable wisdom wills!",
      "juz_number": 13
    },
    "14": {
      "text_tafsir_en": "This verse explains that only God has the authority to grant true prayer. There are some who interpret it: it is only to God that the truth about the inanity, purity, and sincerity of the worship are offered to God. The idols worshiped by the Muslims could not grant their request. Asking for an idol is like a drinker, but just by dipping his palm into the water. He hoped that the water would go up into his own mouth. But the water would not have been possible to enter into his mouth without first having his hands covered. Likewise the idols they worship do not respond to the requests of their worshipers, but are asked not to respond. The prayers and worship of those who disbelieve in idols are in vain. When they pray to God, their prayers are not answered because they do not believe in His power. If they pray to the idols, they will not be able to hear anything else but grant their wish.",
      "text_tafsir": "Ayat ini menjelaskan bahwa hanya Allah yang memiliki wewenang untuk mengabulkan doa yang benar. Ada pula yang menafsirkan: hanya kepada Allah saja seruan yang benar tentang ketauhidan, kemurnian, dan keikhlasan dalam ibadah. Berhala-berhala yang disembah kaum musyrik tidak dapat mengabulkan permintaan mereka sedikit pun. Meminta sesuatu kepada berhala ibarat orang yang ingin minum, tetapi hanya dengan membuka kedua telapak tangannya ke dalam air. Ia berharap supaya air itu naik sendiri ke dalam mulutnya. Padahal air itu tentu tidak akan mungkin masuk dengan sendirinya ke dalam mulutnya tanpa ditampung dulu dengan kedua telapak tangan. Demikian pula berhala-berhala yang mereka sembah, jangankan memenuhi permintaan penyembahnya, ditanya saja mereka tidak dapat menjawab. Doa dan ibadah orang-orang kafir kepada berhala hanya sia-sia belaka. Bila mereka berdoa kepada Allah, doanya tidak dikabulkan karena mereka tidak meyakini kekuasaan-Nya. Jika mereka berdoa kepada berhala-berhala, sedikit pun mereka tidak bisa mendengar apalagi mengabulkan permintaannya.",
      "text_translation": "Hanya kepada Allah doa yang benar. Berhala-berhala yang mereka sembah selain Allah tidak dapat mengabulkan apa pun bagi mereka, tidak ubahnya seperti orang yang membukakan kedua telapak tangannya ke dalam air agar (air) sampai ke mulutnya. Padahal air itu tidak akan sampai ke mulutnya. Dan doa orang-orang kafir itu, hanyalah sia-sia belaka.",
      "text": "لَهٗ دَعْوَةُ الْحَقِّۗ وَالَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِهٖ لَا يَسْتَجِيْبُوْنَ لَهُمْ بِشَيْءٍ اِلَّا كَبَاسِطِ كَفَّيْهِ اِلَى الْمَاۤءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَالِغِهٖۗ وَمَا دُعَاۤءُ الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ ",
      "text_translation_en": "Unto Him [alone] is due all prayer aiming at the Ultimate Truth, since those [other beings or powers] whom men invoke instead of God cannot respond to them in any way - [so that he who invokes them is] but like one who stretches his open hands towards water, [hoping] that it will reach his mouth, the while it never reaches him. Hence, the prayer of those who deny the truth amounts to no more than losing oneself in grievous error.",
      "juz_number": 13
    },
    "15": {
      "text_tafsir_en": "This verse confirms that only to Allah are all angels, spirits, and human beings submissive, submissive, and submissive, whether open or narrow, who are in heaven and on earth, willing and sincere in their own free will. But the disbelievers are only submissive and obedient when in an emergency or in desperation, as the word of God says: And when you are in danger of the sea, you will lose all that you used to be, except Him. (al-Isra \/ 17: 67) So when they got on the ship, they prayed to Allah with all their devotion (sincerity) to Him, but when Allah saves them on land, they (again) associate (Allah). (al-Ankabut \/ 29: 65) Allah makes it clear that not only are their bodies submissive, submissive, and obedient to God, but they are also bowing their shadows in the morning and evening. Every thing that is in the sun especially in the morning and evening certainly shines short or long. All things and their shadows are subject to God, whether by their own will or forced. It shows the power of the Perfect God.",
      "text_tafsir": "Ayat ini menegaskan bahwa hanya kepada Allah semua malaikat, jin, dan manusia yang beriman tunduk, sujud, dan patuh, baik dalam keadaan lapang maupun sempit, yang berada di langit dan di bumi, rela dan ikhlas dengan kemauan sendiri. Sedangkan orang-orang kafir hanya tunduk dan patuh apabila dalam keadaan darurat atau terdesak, seperti dalam firman Allah:\n\nDan apabila kamu ditimpa bahaya di lautan, niscaya hilang semua yang (biasa) kamu seru, kecuali Dia. (al-Isra\/17: 67)\n\nMaka apabila mereka naik kapal, mereka berdoa kepada Allah dengan penuh rasa pengabdian (ikhlas) kepada-Nya, tetapi ketika Allah menyelamatkan mereka sampai ke darat, malah mereka (kembali) mempersekutukan (Allah). (al-Ankabut\/29: 65)\n\nAllah menjelaskan bahwa bukan hanya tubuh-tubuh mereka saja yang tunduk, sujud, dan patuh kepada Allah, tetapi sujud pula bayang-bayang mereka di waktu pagi dan petang. Setiap benda yang kena sinar matahari terutama di waktu pagi dan petang tentu kelihatan bayang-bayangnya memendek atau memanjang. Semua benda dan bayang-bayangnya tunduk kepada Allah, baik dengan kemauan sendiri maupun terpaksa. Hal ini menunjukkan kekuasaan Allah yang Mahasempurna.",
      "text_translation": "Dan semua sujud kepada Allah baik yang di langit maupun yang di bumi, baik dengan kemauan sendiri maupun terpaksa (dan sujud pula) bayang-bayang mereka, pada waktu pagi dan petang hari.",
      "text": "وَلِلّٰهِ يَسْجُدُ مَنْ فِى السَّمٰوٰتِ وَالْاَرْضِ طَوْعًا وَّكَرْهًا وَّظِلٰلُهُمْ بِالْغُدُوِّ وَالْاٰصَالِ ۩",
      "text_translation_en": "And before God prostrate themselves, willingly or unwillingly, all [things and beings] that are in the heavens and on earth, as do their shadows in the mornings and the evenings.",
      "juz_number": 13
    },
    "16": {
      "text_tafsir_en": "This verse explains that the Prophet was asked by Allah Almighty to ask those who associate with Allah, \"Who is the creator of the universe whose beauty is so wonderful to man?\" Then the Prophet himself was asked to answer that question and say to them, \"He is the God who created everything, organized, and maintained it in a perfect and orderly manner.\" Allah swt ordered the Prophet Muhammad to answer the question because the sound of the answer would be the same as what the Muslims said. They will not deny that their creator is God, as it says in his word: And if you ask them, \"Who created the heavens and the earth and subdued the sun and the moon?\" Surely they will answer, \"Allah.\" So why are they turned away? (al-Ankabut \/ 29: 61) If God is the creator of the universe, then should they take protectors other than Allah, while the idols they worship cannot benefit or resist harm. Why do they keep such dead things as protectors? Why aren't their minds being used to make the right choices? But they do not have the ability to even create a fly. The Word of God: Verily, all that you call besides Allah cannot create a fly, even if they are united to create it. And if the fly snatches something from them, they won't be able to take it back. (al-hajj \/ 22: 73) Then, in order to open the veil of their intellect, unable to compare the good and the bad, the Prophet was ordered to tell them whether the blind could never see with their eyes. healthy, able to see everything in front of him clearly and clearly? Of course the answer is not the same. If they were asked, is it just as dark as light candle? Of course the answer is not the same. Thus, it can be concluded that the One and Only God in all things cannot be equated with idols, dead things can never benefit and refuse harm. Similarly, a person's disbelief in God and His Messenger is not the same as the faith of a believer who radiates from his face and heart. The next question is, do the idols they worship create such beings as the creation of God, so that the two creations are similar in their view, and it is difficult to distinguish between the creation and the creation of God? If God can be equated with idols in creation then there is a reason for them to associate with Him. However, the truth is not so. The idols are dead, they cannot be equated with the creation of God, they exist only because they are carved by human hands. They could not answer the question and could not afford the slightest benefit to the worshiper. Sacrifices were presented to him if the flies had stolen them, they could not take them back. Even if his worshipers were on guard, a wolf could peck on his head. God is the Creator of all things, including the creator of idols, and He is the One, the Almighty. Why do you worship Him besides Him, who is of no benefit and harm?",
      "text_tafsir": "Ayat ini menjelaskan bahwa Nabi diminta oleh Allah swt untuk menanyakan kepada orang-orang yang menyekutukan Allah, \"Siapakah pencipta alam semesta yang keindahannya sangat mengagumkan manusia?\" Kemudian Nabi sendiri diminta untuk menjawab pertanyaan itu dan mengatakan kepada mereka, \"Dialah Allah yang menciptakan semuanya, mengatur, dan memeliharanya secara tertib dan sempurna.\" Allah swt memerintahkan Nabi Muhammad saw supaya menjawab pertanyaan itu karena bunyi jawaban itu akan sama dengan yang diucapkan oleh orang-orang musyrik sendiri. Mereka tidak akan mengingkari bahwa penciptanya adalah Allah sendiri, seperti tersebut dalam firman-Nya:\n\nDan jika engkau bertanya kepada mereka, \"Siapakah yang menciptakan langit dan bumi dan menundukkan matahari dan bulan?\" Pasti mereka akan menjawab, \"Allah.\" Maka mengapa mereka bisa dipalingkan (dari kebenaran). (al-Ankabut\/29: 61)\n\nJika memang Allah pencipta alam semesta, maka patutkah mereka mengambil pelindung-pelindung selain Allah, padahal berhala-berhala yang mereka sembah itu tidak dapat memberi kemanfaatan atau menolak kemudaratan. Mengapa mereka tetap menjadikan benda-benda mati itu menjadi pelindung? Mengapa akal pikiran mereka tidak digunakan untuk menentukan pilihan yang benar? Padahal benda-benda tersebut tidak mempunyai kemampuan apa-apa meskipun hanya menciptakan seekor lalat. Firman Allah:\n\nSesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. (al-hajj\/22: 73)\n\nKemudian dalam rangka membuka tabir kepicikan akal mereka, sehingga tidak dapat membandingkan antara yang baik dan yang buruk, Nabi saw diperintahkan untuk mengatakan kepada mereka adakah sama orang buta yang sama sekali tidak dapat melihat dengan orang yang matanya sehat, dapat melihat semua benda di hadapannya dengan terang dan jelas? Tentu saja jawabannya adalah tidak sama. Jika ditanyakan pula kepada mereka apakah sama gelap gulita dengan terang benderang? Tentu jawabannya juga tidak sama. Dengan demikian, akhirnya dapat disimpulkan bahwa Allah Yang Maha Esa dan Sempurna dalam segala-galanya tidak bisa disamakan dengan berhala, benda mati yang sama sekali tidak dapat memberi manfaat dan menolak kemudaratan. Demikian pula kekafiran seseorang kepada Allah dan rasul-Nya tidak sama dengan cahaya keimanan seorang mukmin yang memancar dari wajah dan hatinya. Pertanyaan selanjutnya, apakah berhala-berhala yang mereka sembah itu dapat menciptakan makhluk seperti ciptaan Allah, sehingga kedua ciptaan itu serupa menurut pandangan mereka, dan sukar dibedakan mana ciptaan berhala dan mana ciptaan Allah?\n\nJika Allah bisa disamakan dengan berhala dalam penciptaan maka ada alasan bagi mereka untuk menyekutukan-Nya. Akan tetapi, kenyataannya tidak demikian. Berhala-berhala itu adalah benda mati, jangankan dapat disamakan ciptaannya dengan ciptaan Allah, wujudnya saja ada karena diukir oleh tangan manusia. Mereka tidak dapat menjawab jika ditanya dan tidak dapat memberi kemanfaatan dan kemudaratan sedikit pun kepada penyembahnya. Sesajen yang dihidangkan di hadapannya jika dicuri oleh lalat, mereka sama sekali tidak dapat mengambilnya kembali. Bahkan jika penyembah-penyembahnya sedang lengah, seekor serigala pun dapat mengencingi kepalanya.\n\nAllah adalah Pencipta segala sesuatu, termasuk pula Pencipta berhala-berhala, dan Dialah Allah Yang Maha Esa lagi Mahaperkasa. Mengapa kamu menyembah kepada selain-Nya, yang sama sekali tidak memberi manfaat dan kemudaratan?",
      "text_translation": "Katakanlah (Muhammad), “Siapakah Tuhan langit dan bumi?” Katakanlah, “Allah.”  Katakanlah, “Pantaskah kamu mengambil pelindung-pelindung selain Allah, padahal mereka tidak kuasa mendatangkan manfaat maupun menolak mudarat bagi dirinya sendiri?”  Katakanlah, “Samakah orang yang buta dengan yang dapat melihat? Atau samakah yang gelap dengan yang terang? Apakah mereka menjadikan sekutu-sekutu bagi Allah yang dapat menciptakan seperti ciptaan-Nya sehingga kedua ciptaan itu serupa menurut pandangan mereka?” Katakanlah, “Allah adalah Pencipta segala sesuatu dan Dia Tuhan Yang Maha Esa, Mahaperkasa.”",
      "text": "قُلْ مَنْ رَّبُّ السَّمٰوٰتِ وَالْاَرْضِۗ قُلِ اللّٰهُ ۗقُلْ اَفَاتَّخَذْتُمْ مِّنْ دُوْنِهٖٓ اَوْلِيَاۤءَ لَا يَمْلِكُوْنَ لِاَنْفُسِهِمْ نَفْعًا وَّلَا ضَرًّاۗ قُلْ هَلْ يَسْتَوِى الْاَعْمٰى وَالْبَصِيْرُ ەۙ اَمْ هَلْ تَسْتَوِى الظُّلُمٰتُ وَالنُّوْرُ ەۚ اَمْ جَعَلُوْا لِلّٰهِ شُرَكَاۤءَ خَلَقُوْا كَخَلْقِهٖ فَتَشَابَهَ الْخَلْقُ عَلَيْهِمْۗ قُلِ اللّٰهُ خَالِقُ كُلِّ شَيْءٍ وَّهُوَ الْوَاحِدُ الْقَهَّارُ",
      "text_translation_en": "Say: \"Who is the Sustainer of the heavens and the earth?\" Say: \"[It is] God.\" Say: \"[Why,] then, do you take for your protectors, instead of Him, such as have it not within their power to bring benefit to, or avert harm from, themselves?\" Say: \"Can the blind and the seeing be deemed equal? -or can the depths of darkness and the light be deemed equal?\" Or do they [really] believe that there are, side by side with God, other divine powers that have created the like of what He creates, so that this act of creation appears to them to be similar [to His]? Say: \"God is the Creator of all things; and He is the One who holds absolute sway over all that exists.\"",
      "juz_number": 13
    },
    "17": {
      "text_tafsir_en": "God brought down the rain from the clouds that contained the clouds, and caused them to flow into the wide and narrow valleys according to their size. Scientific studies show that valleys are generally formed by water runoff. The water first drains the most delicate parts of the rock and then forms the stream. The flow of the river gradually grows to form the valleys of the river. The size of the river valleys is generally influenced by the size of the water flow which is also determined by the magnitude of rainfall, rock hardness and rock age. In geomorphology it is known that the density of the river is the sum of the length of the river in one area of area with km \/ km2. The magnitude of the river density generally reflects the magnitude of rainfall in the area. The stream of water will produce many bubbles on its surface which are bubbles that move with the flow of water, so that when a strong wind blows, the bubbles disappear immediately from sight. According to scientific research, bubbles are floating substances on water that contain a lot of air. Bubbles occur as part of the process of purification of water that occurs naturally in its flow (known as self purification). This purification occurs as a result of mixing with air which dissolves into water mainly oxygen. With oxidation, the impurities (usually organic compounds) that are dissolved in the water decompose and the lighter parts float above the water surface, while the heavy part will sink and settle. This is the first parable given by Allah swt concerning truth and falsehood and about faith and unbelief. Bubbles can also be formed in the process of purification of metals by heating. Metal ore in nature is commonly found in impure solid matter. During the smelting process, the ore melts, and the heavy metals are submerged while the less useful or destructive parts of the product are usually bubbles and will float to the surface with the air contained therein. The metal is made for household jewelry, agriculture, carpentry, and industrial jewelry. This is the second parable. Thus Allah creates the parable of the just and the unjust. The truth is that when mixed with it, like a stream of water mixed with bubbles, or like a metal being burned together, it also produces a foam in the form of rust that re-adheres to the metal, and then separates from the effect of the fire that burns it. Just as the bubbles on the water's surface will disappear after the wind blows, and the bubbles on the burning metal will disappear as well as the fire, so will the vanity disappear when the right and the truth come. The bubbles will disappear trapped along the edge of the valley and the trees or blown away. Similarly, dirt or rust that re-adheres to the metal will burn. The only living things that benefit the human race are water, drinkable, used to irrigate plants useful to humans and animals, gold used for jewelry, and other metals for household, agricultural, and so on. From these two parables can be taken the sense that Allah swt sent the Quran to the Prophet Muhammad and then conveyed it into the hearts of people who were not equally capable and prepared to receive it. Each has its limitations in its reading, meaning, memorization, and practice. The Qur'anic verses are as much an element of spiritual life and happiness as water is the source of life for all beings. Among the landslides were barren, unable to grow crops, only to store water, which could serve as a source of clear water storage. There are also fertile soils which, after being watered with rainwater, can produce a variety of soil products. That is the water that benefits both humans and animals. Among the metals melted into fire such as gold, silver, copper, bronze, and tin, some are made into household, carpentry, industrial and so on. Believers are defined as water and metals that are beneficial to humans and animals. The bubbles that once blended and vanished because of the blowing of the wind or were consumed by fire, were a metaphor for unbelief and perversion that eventually collapsed in the face of righteousness and truth, the word of God: And say, \"Truth has come and vanity has perished.\" Really, the vanity must have disappeared. (al-Isra \/ 17: 81) Thus God created a beautiful metaphor that could explain to mankind what they still believed about their religious issues, to make clear the difference between right and wrong, between faith and unbelief, so that they can take the path to happiness and avoid the path that Allah has envied and misled. By observing the proper and proper metaphors, it is hoped that Muslims will become the best people to be brought out on earth to be examples of others. Al-Bukhari and Muslim recite the hadith of Abu Musa Al-Asyari: Indeed, the metaphor of the guidance and knowledge which Allah has sent me, is like the raining water that floods the earth. Among them are some of the earth that receives the water, and grows grass and plants. There is also a barren land, which only holds water, and God provides the water to man. Then they drank it and used it to irrigate their gardens and their fields. Some of the soil is hard, unable to store and absorb water, so it does not grow anything. It is the parable of those who understand the religion of Allah and Allah benefits them in the teachings of the religion that God has sent me to convey to mankind, so that he knows and teaches it (to others), and that is the parable of those who have not given heed and have not received the guidance of Allah who sent me to relay it. (The History of al-Bukhari and Muslim) Narrated by Imam Ahmad of Abu Hurairah: My encounter with you was like a fire burning, as the fire lit around it, starting with butterflies and insects coming down into the fire, and the man was blocking, but defeated by the insects and then they enter the fire. That's how I met you. I block you from the fire, stay away from the fire, but you defeat me and barge into it. (History of Ahmad, al-Bukhari, and Muslims of Abu Hurairah)",
      "text_tafsir": "Allah menurunkan air hujan dari langit yang mengandung awan, lalu mengalirkan air hujan itu ke berbagai lembah yang lebar dan yang sempit sesuai dengan ukurannya. Kajian saintis menjelaskan bahwa lembah-lembah umumnya terbentuk oleh gerusan air. Air pertama-tama menggerus bagian-bagian batuan yang paling lunak dan kemudian membentuk aliran sungai. Alur aliran sungai ini lambat laun membesar membentuk lembah-lembah sungai. Ukuran lembah-lembah sungai umumnya selain dipengaruhi oleh besarnya aliran air yang juga ditentukan oleh besarnya curah hujan, kekerasan batuan dan umur batuan. Dalam bidang geomorfologi dikenal besaran kerapatan sungai, yaitu jumlah panjang sungai yang terdapat pada satu luasan daerah dengan satuan km\/km2. Besarnya kerapatan sungai umumnya menggambarkan besarnya curah hujan di daerah tersebut. \n\nArus air itu akan menimbulkan banyak buih di permukaannya yang merupakan gumpalan buih yang ikut bergerak dengan arus air, sehingga bila ada angin kencang yang bertiup, maka buih itu akan segera lenyap dari pandangan mata. Menurut kajian saintifik, buih adalah zat mengambang di atas air yang mengandung banyak udara. Terjadinya buih merupakan bagian dari proses pemurnian air yang terjadi secara alami dalam pengalirannya (dikenal dengan istilah self purification). Pemurnian ini terjadi karena adanya pencampuran dengan udara yang melarut ke dalam air terutama oksigen. Dengan adanya oksidasi, pengotor (umumya senyawa organik) yang terlarut di dalam air mengurai dan bagian yang ringan mengapung di atas permukaan air, sedangkan bagian yang berat akan tenggelam dan mengendap. Inilah perumpamaan yang pertama yang dikemukakan oleh Allah swt tentang kebenaran dan kebatilan serta tentang keimanan dan kekafiran.\n\nBuih juga bisa terbentuk dalam proses pemurnian logam dengan pemanasan. Bijih logam di alam umumnya ditemukan dalam bahan padat yang tidak murni. Pada proses peleburan, bijih mencair, dan logam-logam yang berat akan tenggelam sedangkan bagian yang kurang bermanfaat atau yang dapat merusak mutu hasil biasanya berupa buih dan akan mengapung ke permukaan bersama udara yang terkandung di dalamnya. Logam tersebut dibuat untuk perhiasan dan alat-alat keperluan rumah tangga, pertanian, pertukangan, dan perindustrian. Inilah perumpamaan yang kedua. \n\nDemikianlah Allah membuat perumpamaan bagi yang benar dan yang batil. Kebenaran dan kebatilan itu bila bercampur, seperti arus air yang bercampur dengan buih, atau seperti logam yang dibakar yang sama-sama juga mengeluarkan buih berupa kotoran karat yang semula melekat pada logam itu, kemudian terpisah karena pengaruh api yang membakarnya. Maka sebagaimana buih yang berada di atas arus air akan lenyap setelah ada tiupan angin, dan buih yang berada di atas logam yang sedang dibakar akan hilang pula karena api, demikian pula perkara yang batil akan hilang musnah bilamana datang hak dan kebenaran yang jelas. \n\nBuih itu akan hilang tersangkut di pinggir lembah dan pohon atau ditiup angin. Demikian pula kotoran atau karat yang semula melekat pada logam akan habis terbakar. Yang tinggal hanya yang memberi manfaat saja kepada manusia, yaitu air, yang dapat diminum, digunakan untuk mengairi tanaman yang bermanfaat bagi manusia dan binatang, emas yang digunakan untuk perhiasan, dan logam-logam lainnya untuk alat rumah tangga, pertanian, dan sebagainya.\n\nDari kedua perumpamaan itu dapat diambil pengertian bahwa Allah swt telah menurunkan Al-Quran kepada Nabi Muhammad saw kemudian disampaikan ke dalam hati manusia yang masing-masing tidak sama potensi dan persiapannya untuk menerima. Masing-masing mempunyai keterbatasan dalam hal bacaan, pengertian, hafalan, dan pengamalannya. Ayat Al-Quran menjadi unsur kehidupan kerohanian dan kebahagiaan hidup sebagaimana air menjadi sebab hidup semua makhluk.\n\nDi antara tanah yang ditimpa hujan itu ada yang tandus, tidak dapat menumbuhkan tanam-tanaman, hanya sekedar menyimpan air saja, yang dapat dijadikan sumber penampungan air jernih. Ada pula tanah yang subur yang setelah disiram dengan air hujan dapat menghasilkan bermacam-macam hasil bumi. Itulah air yang bermanfaat bagi manusia dan binatang-binatang. Di antara logam yang dilebur dalam api seperti emas, perak, tembaga, perunggu, dan timah, ada yang dijadikan alat rumah tangga, pertukangan, perindustrian dan sebagainya. Orang mukmin diumpamakan seperti air dan logam yang bermanfaat bagi manusia dan binatang. Buih yang semula bercampur kemudian lenyap karena tiupan angin atau habis dibakar oleh api, adalah perumpamaan bagi kekafiran dan kebatilan yang akhirnya hancur bila berhadapan dengan hak dan kebenaran, firman Allah:\n\nDan katakanlah, \"Kebenaran telah datang dan yang batil telah lenyap.\" Sungguh, yang batil itu pasti lenyap. (al-Isra\/17: 81)\n\nDemikianlah Allah membuat perumpamaan yang indah yang dapat menjelaskan kepada manusia apa yang masih dipandang sulit oleh mereka tentang masalah-masalah agamanya, agar jelas perbedaan antara yang hak dan yang batil, antara keimanan dan kekafiran, sehingga mereka dapat menempuh jalan petunjuk kepada kebahagiaan dan menghindari jalan yang dimurkai Allah dan menyesatkan.\n\nDengan memperhatikan perumpamaan-perumpamaan yang tepat dan baik itu niscaya umat Islam akan menjadi umat terbaik yang dikeluarkan di muka bumi untuk jadi teladan bagi umat yang lain. Al-Bukhari dan Muslim meriwayatkan hadis dari Abu Musa Al-Asyari:\n\nSesungguhnya perumpamaan petunjuk dan ilmu yang Allah mengutus diriku, adalah seperti air hujan yang menimpa bumi. Di antaranya ada sebagian bumi yang menerima air itu, lalu menumbuhkan rumput dan tanam-tanaman. Ada pula tanah yang tandus, hanya menyimpan air saja, lalu Allah memberikan manfaat air itu kepada manusia. Maka ada yang meminumnya dan mempergunakannya untuk mengairi kebun-kebun tanamannya dan ladang-ladangnya. Ada pula sebagian tanah yang keras, tidak dapat menyimpan dan menyerap air, sehingga tidak menumbuhkan tanaman apa-apa. Itulah perumpamaan orang yang memahami agama Allah dan Allah memberikan manfaat kepadanya dalam ajaran agama yang Allah mengutusku untuk menyampaikannya kepada manusia, sehingga ia mengetahui dan mengajarkannya (kepada orang lain), dan perumpamaan orang yang sama sekali tidak memperhatikan dan tidak menerima petunjuk Allah yang mengutusku untuk menyampaikannya. (Riwayat al-Bukhari dan Muslim)\n\nDiriwayatkan pula oleh Imam Ahmad dari Abu Hurairah: \n\nPerumpamaanku denganmu seperti orang menyalakan api, ketika api menerangi tempat sekelilingnya, mulailah kupu-kupu dan serangga yang mendatangi berjatuhan ke dalam api, dan orang itu menghalangi, namun dikalahkan oleh serangga-serangga lalu masuklah serangga-serangga itu ke dalam api. Itulah perumpamaanku denganmu. Aku menghalangimu dari api, jauhilah api itu, namun kamu mengalahkanku dan menerobos masuk ke dalamnya. (Riwayat Ahmad, al-Bukhari, dan Muslim dari Abu Hurairah)",
      "text_translation": "Allah telah menurunkan air (hujan) dari langit, maka mengalirlah ia (air) di lembah-lembah menurut ukurannya, maka arus itu membawa buih yang mengambang. Dan dari apa (logam) yang mereka lebur dalam api untuk membuat perhiasan atau alat-alat, ada (pula) buihnya seperti (buih arus) itu. Demikianlah Allah membuat perumpamaan tentang yang benar dan yang batil. Adapun buih, akan hilang sebagai sesuatu yang tidak ada gunanya; tetapi yang bermanfaat bagi manusia, akan tetap ada di bumi. Demikianlah Allah membuat perumpamaan.",
      "text": "اَنْزَلَ مِنَ السَّمَاۤءِ مَاۤءً فَسَالَتْ اَوْدِيَةٌ ۢ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَّابِيًا ۗوَمِمَّا يُوْقِدُوْنَ عَلَيْهِ فِى النَّارِ ابْتِغَاۤءَ حِلْيَةٍ اَوْ مَتَاعٍ زَبَدٌ مِّثْلُهٗ  ۗ كَذٰلِكَ يَضْرِبُ اللّٰهُ الْحَقَّ وَالْبَاطِلَ ەۗ فَاَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاۤءً ۚوَاَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِى الْاَرْضِۗ  كَذٰلِكَ يَضْرِبُ اللّٰهُ الْاَمْثَالَ ۗ",
      "text_translation_en": "[Whenever] He sends down water from the sky, and [once-dry] river-beds are running high according to their measure, the stream carries scum on its surface; and, likewise, from that [metal] which they smelt in the fire in order to make ornaments or utensils, [there rises] scum. In this way does God set forth the parable of truth and falsehood: for, as far as the scum is concerned, it passes away as [does all] dross; but that which is of benefit to man abides on earth. In this way does God set forth the parables",
      "juz_number": 13
    },
    "18": {
      "text_tafsir_en": "For those who obey God and His messenger, obeying all His commands, and justifying what God has sent to His apostles, there is a good reward, which is clean from all suffering and hardship and endures forever. In accordance with the word of Allah: For those who do good, there is a reward (best) and in addition (the pleasure of seeing Allah). (Jonah \/ 10:26) And he said: As one who believes and does good, he will receive the best (reward), and we will give him our easy command. (al-Kahf \/ 18: 88) For those who do not obey Allah, do not obey Him, do not obey His commands and do not refrain from His prohibition, there are various kinds of treatment and punishment, including: 1.When facing a very painful torment, they let go of all that wealth to redeem themselves from the torment of Allah. Because everyone loves him the most. When he is threatened, his wealth will be taken hostage or ransom, for his own safety. 2.They shall be examined in detail and examined in all their deeds to a minimum. It is said in a hadith: Whoever is punished in detail must be punished. 3. Their dwelling place is Hell, and that is the worst place to live and return.",
      "text_tafsir": "Bagi orang-orang yang taat kepada Allah dan rasul-Nya, mengikuti semua perintah-Nya, dan membenarkan apa yang diturunkan oleh Allah kepada rasul-Nya, disediakan pembalasan yang baik, yang bersih dari segala penderitaan dan kesusahan dan kekal selama-lamanya. Sesuai dengan firman Allah:\n\nBagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya (kenikmatan melihat Allah). (Yunus\/10: 26)\n\nDan firman-Nya:\n\nAdapun orang yang beriman dan mengerjakan kebajikan, maka dia mendapat (pahala) yang terbaik sebagai balasan, dan akan kami sampaikan kepadanya perintah kami yang mudah-mudah. (al-Kahf\/18: 88)\n\nBagi mereka yang tidak memenuhi seruan Allah, tidak menaati-Nya, tidak mengikuti perintah-Nya dan tidak mencegah diri dari larangan-Nya, ada bermacam-macam perlakuan dan azab, di antaranya:\n\n1.Ketika menghadapi azab yang sangat pedih, niscaya mereka melepaskan seluruh kekayaan itu untuk menebus dirinya dari azab Allah. Sebab yang paling dicintai oleh setiap orang adalah dirinya sendiri. Apabila dirinya terancam bahaya, maka seluruh kekayaannya akan dijadikan sandera atau tebusan, demi untuk keselamatan dirinya.\n\n2.Mereka akan diperiksa secara rinci dan diteliti semua amal perbuatannya sampai sekecil-kecilnya. Tersebut dalam sebuah hadis: Barang siapa yang dihisab secara rinci pasti kena azab.\n\n3.Tempat kediaman mereka ialah Jahanam, dan itulah seburuk-buruknya tempat kediaman dan tempat kembali.",
      "text_translation": "Bagi orang-orang yang memenuhi seruan Tuhan, mereka (disediakan) balasan yang baik. Dan orang-orang yang tidak memenuhi seruan-Nya, sekiranya mereka memiliki semua yang ada di bumi dan (ditambah) sebanyak itu lagi, niscaya mereka akan menebus dirinya dengan itu. Orang-orang itu mendapat hisab (perhitungan) yang buruk dan tempat kediaman mereka Jahanam, dan itulah seburuk-buruk tempat kediaman.",
      "text": "لِلَّذِيْنَ اسْتَجَابُوْا لِرَبِّهِمُ الْحُسْنٰىۗ وَالَّذِيْنَ لَمْ يَسْتَجِيْبُوْا لَهٗ لَوْ اَنَّ لَهُمْ مَّا فِى الْاَرْضِ جَمِيْعًا وَّمِثْلَهٗ مَعَهٗ لَافْتَدَوْا بِهٖ ۗ اُولٰۤىِٕكَ لَهُمْ سُوْۤءُ الْحِسَابِ ەۙ وَمَأْوٰىهُمْ جَهَنَّمُ ۗوَبِئْسَ الْمِهَادُ ࣖ",
      "text_translation_en": "of those who have responded to their Sustainer with a goodly response, and of those who did not respond to Him. [As for the latter,] if they possessed all that is on earth, and twice as much, they would surely offer it as ransom [on the Day of Judgment]: a most evil reckoning awaits them, and their goal is hell: and how evil a resting-place!",
      "juz_number": 13
    },
    "19": {
      "text_tafsir_en": "In this verse, Allah explains that not the same people who know that what is revealed to Muhammad is something that is actually true and comes from Allah compared to blind people who do not understand and believe it. The Word of God: And the words of your Lord (the Koran) have been perfected with truth and justice. (al-Anam \/ 6: 115) According to Ibn Abbas, this verse came down relating to two people, one who is a believer and the other is an infidel, namely Hamzah and Abu Jahal. Is it that (Hamzah) who believes and knows that what was revealed to the Prophet Muhammad is true, without doubt, the same as (Abu Jahl) who is blind in heart, and has absolutely no guidance on goodness? Certainly not the same. Only people who are mentally healthy can realize this, and can benefit from the parables put forward by Allah in His holy books.",
      "text_tafsir": "Pada ayat ini, Allah swt menjelaskan bahwa tidak sama orang yang mengetahui bahwa apa yang diturunkan kepada Muhammad adalah sesuatu yang nyata benarnya dan datang dari Allah dibandingkan dengan orang buta yang tidak memahami dan mempercayainya. Firman Allah:\n\nDan telah sempurna firman Tuhanmu (Al-Quran) dengan benar dan adil. (al-Anam\/6: 115)\n\nMenurut Ibnu Abbas, ayat ini turun berkaitan dengan dua orang, yang seorang mukmin dan yang lainnya kafir, yaitu Hamzah dan Abu Jahal. Apakah (Hamzah) yang percaya dan mengetahui bahwa apa yang diturunkan kepada Nabi Muhammad saw itu benar, tanpa keraguan lagi, sama dengan (Abu Jahal) yang buta hatinya, dan sama sekali tidak mendapat petunjuk kepada kebaikan? Tentu tidak sama. Hanya orang-orang yang sehat pikirannya saja yang dapat menyadari hal seperti ini, dan yang dapat mengambil manfaat dari perumpamaan-perumpamaan yang dikemukakan Allah swt dalam kitab suci-Nya.",
      "text_translation": "Maka apakah orang yang mengetahui bahwa apa yang diturunkan Tuhan kepadamu adalah kebenaran, sama dengan orang yang buta? Hanya orang berakal saja yang dapat mengambil pelajaran,",
      "text": "۞ اَفَمَنْ يَّعْلَمُ اَنَّمَآ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ الْحَقُّ كَمَنْ هُوَ اَعْمٰىۗ اِنَّمَا يَتَذَكَّرُ اُولُوا الْاَلْبَابِۙ  ",
      "text_translation_en": "CAN, THEN, he who knows that whatever has been bestowed from on high upon thee by thy Sustainer is the truth be deemed equal to one who is blind? Only they who are endowed with insight keep this in mind:",
      "juz_number": 13
    },
    "20": {
      "text_tafsir_en": "Allah swt albab albab among the believers, those who believe that what was revealed to the Prophet Muhammad is a valid truth, as follows: a. The first characteristic: that they are always keeping the promise of God, and will not break the covenant. The meaning of the \"promise of God\" here is the promises they have made to themselves, either in their relationship with God or in their relationships with others. Their sacred nature, and their pure hearts acknowledge the existence of the covenant and the revelation of God requires the covenant. They would not disobey or disobey the covenant they had entered into, for they were far from hypocrisy. As important as the fulfillment of this promise is, by the Qatadah it has been stated that in the Quran, Allah Almighty has mentioned it more than twenty times. b. Second nature: they keep all the commandments of God and do not violate it, either in the rights of God or the rights of His servants, including the maintenance of friendship. The relationship between human beings is that of mutual help, mutual love and affection, as mentioned in the hadith: From Abi Hurairah ra that he said, \"I heard the Messenger of Allah (may peace be upon him) say,\" He who is pleased to extend his sustenance and is always mentioned , then maintain the relationship of friendship. \"(Al-Bukhari and Muslim narratives). And the Prophet's hadith: From Ibn Abbas he said,\" The Messenger of Allah (may peace be upon him) said, \"The benefits and the connection between them are very light. bad willab on the Day of Judgment. \" Then Allah's Messenger (may peace be upon him) read this verse. \"(History of al-Khatib and Ibn Asakir) c. Third nature: They are truly God-fearing. The fear of Allah is a fear that is based on respect that motivates people to obey This is the property of the scholars, and is characteristic of the people of the \"muqarrabin\". In this connection Allah swt says: Among the servants of Allah who fear Him, only the scholars (Fathir \/ 35: 28) d Fourth nature: they are always afraid of hisab, which means that they will be harmed on the Day of Judgment, which is a bad result of their deeds on the Day of Judgment, because of the many crimes they committed while living in this world. They always practice the good deeds of the good and the bad, always strive for good deeds more than bad deeds, to balance their good deeds in the hereafter. heavier than the balance sheet. In this case, Allah has said: If a man weighs his scales, he is in a good (happy) life. And as for the light-weighted (good) people, the return home is Hawiyah hell. (al-Qariah \/ 101: 6 - 9) e. Fifth nature: they persevere in the face of trials and obstacles, hoping for God's will. Patience in this matter means refraining from anything that is not pleasing to him, either by exercising obedience and fulfilling all the obligations imposed by the religion or by avoiding the prohibitions of religion. It can also mean being willing to accept all the provisions of Allah in the form of disaster and so on. The patience required of every wise and believing person is patience that is purely for the sake of God's will and His reward, not the patience for which he wants to be praised and called. That is true patience, which is characteristic of those who are wise and believing. f. Sixth nature: they always offer prayers. The meaning of \"setting up prayer\" is to perform in the best way possible, by perfecting the precepts and conditions, accompanied by a sense of reverence and devotion to the face and heart of God alone, not accompanied by joy, and preserving the time set for him. This is only possible when in prayer, we feel standing before the Almighty, Creator and Ruler of the universe. Thus, there was nothing to think about at that time, except in the face of God. g. The seventh nature: they always give away some of the provision that God has bestowed upon them, either secretly or openly, whether compulsory as in the case of wives, children, and relatives or infants as in the poor. Reality can give us a sense of the secrets it holds. The Qur'an repeatedly urged the believers to devote some of their sustenance to those in need, and to support the common interest. If they want to do it, poverty and poverty can be eliminated from people's lives. h. Eighth nature: they always reject evil with good, because it can resist evil. The fact shows that when one is able to associate with others with kindness and love and to help those in need, he will not be abhorred or hated by his community. When he is in trouble, the one who has his help will immediately reach out to him. On the other hand, the person who likes to hurt others, or refuses to offer help and assistance is a selfish person who does not use his mind. His actions and actions only narrow the scope of his own life, and cause others to hate and hate him. Doing good in order to avoid evil, or at best responding to the evils of others by doing good or being silent is a sign of a person who is wise and wise. The Word of God: \"... and when the foolish say good-bye to them (in contemptuous words), they say,\" salutations. \"(Al-Furqan \/ 25: 63) From this it is understandable, how high the value of religious teaching Islam establishes good relations between fellow human beings to create harmony and prosperity of the people. At the end of this verse, Allah swt emphasizes that those who possess such qualities will surely find a good final residence, Jannatun Naim's paradise in the hereafter. as well as happiness, peace, and prosperity in this world.",
      "text_tafsir": "Allah swt menyifati ulul albab dari kalangan orang-orang yang beriman, yaitu orang-orang yang meyakini bahwa yang diturunkan kepada Nabi Muhammad adalah suatu kebenaran yang berlaku, sebagai berikut:\n\na. Sifat pertama: bahwa orang-orang tersebut senantiasa memenuhi janji Allah, dan tidak mau mengingkari perjanjian itu. Yang dimaksud dengan \"janji Allah\" di sini ialah janji-janji yang telah mereka ikrarkan atas diri mereka, baik mengenai hubungan mereka dengan Allah, maupun hubungan mereka dengan orang lain. Fitrah mereka yang suci, dan hati mereka yang murni mengakui adanya perjanjian itu dan wahyu Allah pun mengharuskan adanya perjanjian tersebut.\n\nMereka tidak mau mengingkari atau pun memungkiri perjanjian yang telah mereka kukuhkan, karena mereka sangat menjauhi sifat-sifat kemunafikan. \n\nBetapa pentingnya sifat memenuhi janji ini, oleh Qatadah telah disebutkan bahwa dalam Al-Quran, Allah swt telah menyebutnya sebanyak lebih dua puluh kali.\n\nb.Sifat kedua: mereka memelihara semua perintah Allah dan tidak melanggarnya, baik hak-hak Allah maupun hak-hak hamba-Nya, termasuk memelihara silaturrahim.\n\nHubungan antara sesama manusia ialah menjalin hubungan tolong-menolong, menjalin cinta dan kasih-sayang, sebagaimana disebutkan dalam hadis:\n\nDari Abi Hurairah r.a. bahwasanya ia berkata, \"Aku mendengar Rasulullah saw bersabda, \"Barang siapa senang dilapangkan rezekinya dan selalu disebut-sebut kebaikannya, maka hendaklah pelihara hubungan silaturrahim.\" (Riwayat al-Bukhari dan Muslim).\n\nDan hadis Nabi saw:\n\nDari Ibnu Abbas ia berkata, \"Bersabda Rasulullah saw, \"Sesungguh-nya kebajikan dan menghubungkan silaturrahim itu, kedua-duanya benar-benar meringankan hisab yang buruk di hari kiamat.\" Kemudian Rasulullah saw membaca ayat ini.\" (Riwayat al-Khatib dan Ibnu Asakir)\n\nc. Sifat ketiga: mereka benar-benar takut kepada Allah swt. Sifat takut kepada Allah adalah perasaan takut yang dilandasi dengan rasa hormat yang mendorong orang untuk taat kepada-Nya. Sifat ini dimiliki oleh para ulama, dan ciri dari orang-orang \"muqarrabin\". Dalam hubungan ini Allah swt telah berfirman:\n\nDi antara hamba-hamba Allah yang takut kepada-Nya, hanyalah para ulama. (Fathir\/35: 28)\n\nd. Sifat keempat: mereka senantiasa takut kepada hisab yang sifatnya merugikan mereka pada hari kiamat, yaitu hasil yang buruk dari amalan mereka di hari kiamat, karena banyaknya kejahatan yang dilakukannya selagi hidup di dunia ini. Oleh sebab itu, mereka senantiasa mawas diri, sebelum dihisab amalannya di akhirat kelak. Mereka selalu membandingkan antara amal-amal mereka yang baik dengan yang buruk, selalu berusaha agar amal yang baik lebih banyak dari perbuatan yang buruk, agar neraca kebajikan mereka di akhirat kelak lebih berat daripada neraca keburukan. Dalam hal ini, Allah telah berfirman:\n\nMaka adapun orang yang berat timbangan (kebaikan)-nya, maka dia berada dalam kehidupan yang memuaskan (senang). Dan adapun orang yang ringan timbangan (kebaikan)-nya maka tempat kembalinya adalah neraka Hawiyah. (al-Qariah\/101: 6 - 9)\n\ne.Sifat kelima: mereka senantiasa sabar dalam menghadapi segala cobaan dan rintangan, demi mengharapkan rida Allah. Sabar dalam hal ini berarti menahan diri terhadap segala hal yang tidak disenanginya, baik dengan cara melakukan ketaatan dan menunaikan segala kewajiban yang telah ditetapkan agama maupun dengan jalan menjauhi hal-hal yang dilarang agama. Bisa juga berarti bersikap rela menerima segala ketentuan Allah yang telah berlaku berupa musibah dan lain sebagainya.\n\nKesabaran yang diminta dari setiap orang yang berakal dan beriman ialah kesabaran yang dilakukan semata-mata karena mengharapkan keridaan Allah dan ganjaran-Nya, bukan kesabaran yang dibuat-buat karena ingin dipuji dan disebut-sebut. Itulah kesabaran yang sejati, yang menjadi sifat bagi orang-orang yang berakal dan beriman.\n\nf. Sifat keenam: mereka senantiasa mendirikan salat. Arti \"mendirikan salat\" ialah menunaikan dengan cara yang sebaik-baiknya, dengan menyempurnakan rukun dan syaratnya, disertai rasa khusyuk dan tawaduk menghadapkan wajah dan hati kepada Allah semata, tidak dibarengi dengan ria, serta memelihara waktu yang telah ditetapkan untuknya. Hal ini hanya dapat dilakukan bila pada saat-saat melakukan salat, kita merasa sedang berdiri sendiri di hadapan Allah swt, Pencipta dan Penguasa semesta alam. Dengan demikian, maka tak ada sesuatu pun yang dipikirkan pada saat itu, kecuali semata-mata bermunajah kepada Allah.\n\ng. Sifat ketujuh: mereka senantiasa menginfakkan sebagian dari rezeki yang telah dilimpahkan Allah kepada mereka, baik secara tersembunyi maupun terang-terangan, baik infak wajib seperti terhadap istri, anak, dan karib kerabat maupun infak sunah seperti terhadap fakir miskin. Kenyataan dapat memberikan pengertian kepada kita tentang rahasia yang tersimpan di dalamnya. Al-Quran berulang kali menganjurkan kepada orang-orang mukmin untuk menginfakkan sebagian dari rezeki yang telah diperolehnya kepada yang memerlukan pertolongan, dan untuk menyokong kepentingan umum. Jika mereka mau melakukannya, niscaya kemiskinan dan kemelaratan dapat dilenyapkan dari kehidupan masyarakat.\n\nh. Sifat kedelapan: mereka senantiasa menolak kejahatan dengan kebajikan, karena kebajikan itu dapat menolak kejahatan. Kenyataan menunjukkan bahwa apabila seseorang dapat bergaul dengan orang lain dengan akrab dan kasih sayang serta menolong orang-orang yang memerlukan pertolongan, ia tidak akan dimusuhi atau dibenci oleh masyarakatnya. Apabila ia mendapat musibah, maka orang yang pernah mendapat pertolongannya akan segera pula mengulurkan pertolongan kepadanya. Sebaliknya orang yang suka menyakiti orang lain, atau enggan memberikan bantuan dan pertolongan adalah orang yang egois dan tidak menggunakan akalnya. Sikap dan perbuatannya itu hanyalah mempersempit ruang lingkup kehidupannya sendiri, serta menimbulkan kebencian dan kedengkian orang lain terhadap dirinya.\n\nBerbuat kebaikan untuk menghindari kejahatan, atau sedapat mungkin membalas perbuatan jahat orang lain dengan berbuat kebajikan atau dengan diam adalah tanda orang yang mau menggunakan akalnya dan bijaksana. Firman Allah:\n\n\"... dan apabila orang-orang bodoh menyapa mereka (dengan kata-kata yang menghina), mereka mengucapkan, \"salam.\" (al-Furqan\/25: 63)\n\nDari sini dapat dipahami, betapa tingginya nilai ajaran agama Islam dalam membina hubungan baik antara sesama manusia guna menciptakan kerukunan dan kesejahteraan masyarakat.\n\nPada akhir ayat ini, Allah swt menegaskan bahwa orang-orang yang memiliki sifat-sifat tersebut pasti akan memperoleh tempat kediaman terakhir yang baik, yaitu surga Jannatun Naim di akhirat kelak di samping kebahagiaan, ketenangan, dan kesejahteraan di dunia ini.",
      "text_translation": "(yaitu) orang yang memenuhi janji Allah dan tidak melanggar perjanjian,",
      "text": "الَّذِيْنَ يُوْفُوْنَ بِعَهْدِ اللّٰهِ وَلَا يَنْقُضُوْنَ الْمِيْثَاقَۙ  ",
      "text_translation_en": "they who are true to their bond with God and never break their covenant;",
      "juz_number": 13
    },
    "21": {
      "text_tafsir_en": "Allah swt albab albab among the believers, those who believe that what was revealed to the Prophet Muhammad is a valid truth, as follows: a. The first characteristic: that they are always keeping the promise of God, and will not break the covenant. The meaning of the \"promise of God\" here is the promises they have made to themselves, either in their relationship with God or in their relationships with others. Their sacred nature, and their pure hearts acknowledge the existence of the covenant and the revelation of God requires the covenant. They would not disobey or disobey the covenant they had entered into, for they were far from hypocrisy. As important as the fulfillment of this promise is, by the Qatadah it has been stated that in the Quran, Allah Almighty has mentioned it more than twenty times. b. Second nature: they keep all the commandments of God and do not violate it, either in the rights of God or the rights of His servants, including the maintenance of friendship. The relationship between human beings is that of mutual help, mutual love and affection, as mentioned in the hadith: From Abi Hurairah ra that he said, \"I heard the Messenger of Allah (may peace be upon him) say,\" He who is pleased to extend his sustenance and is always mentioned , then maintain the relationship of friendship. \"(Al-Bukhari and Muslim narratives). And the Prophet's hadith: From Ibn Abbas he said,\" The Messenger of Allah (may peace be upon him) said, \"The benefits and the connection between them are very light. bad willab on the Day of Judgment. \" Then Allah's Messenger (may peace be upon him) read this verse. \"(History of al-Khatib and Ibn Asakir) c. Third nature: They are truly God-fearing. The fear of Allah is a fear that is based on respect that motivates people to obey This is the property of the scholars, and is characteristic of the people of the \"muqarrabin\". In this connection Allah swt says: Among the servants of Allah who fear Him, only the scholars (Fathir \/ 35: 28) d Fourth nature: they are always afraid of hisab, which means that they will be harmed on the Day of Judgment, which is a bad result of their deeds on the Day of Judgment, because of the many crimes they committed while living in this world. They always practice the good deeds of the good and the bad, always strive for good deeds more than bad deeds, to balance their good deeds in the hereafter. heavier than the balance sheet. In this case, Allah has said: If a man weighs his scales, he is in a good (happy) life. And as for the light-weighted (good) people, the return home is Hawiyah hell. (al-Qariah \/ 101: 6 - 9) e. Fifth nature: they persevere in the face of trials and obstacles, hoping for God's will. Patience in this matter means refraining from anything that is not pleasing to him, either by exercising obedience and fulfilling all the obligations imposed by the religion or by avoiding the prohibitions of religion. It can also mean being willing to accept all the provisions of Allah in the form of disaster and so on. The patience required of every wise and believing person is patience that is purely for the sake of God's will and His reward, not the patience for which he wants to be praised and called. That is true patience, which is characteristic of those who are wise and believing. f. Sixth nature: they always offer prayers. The meaning of \"setting up prayer\" is to perform in the best way possible, by perfecting the precepts and conditions, accompanied by a sense of reverence and devotion to the face and heart of God alone, not accompanied by joy, and preserving the time set for him. This is only possible when in prayer, we feel standing before the Almighty, Creator and Ruler of the universe. Thus, there was nothing to think about at that time, except in the face of God. g. The seventh nature: they always give away some of the provision that God has bestowed upon them, either secretly or openly, whether compulsory as in the case of wives, children, and relatives or infants as in the poor. Reality can give us a sense of the secrets it holds. The Qur'an repeatedly urged the believers to devote some of their sustenance to those in need, and to support the common interest. If they want to do it, poverty and poverty can be eliminated from people's lives. h. Eighth nature: they always reject evil with good, because it can resist evil. The fact shows that when one is able to associate with others with kindness and love and to help those in need, he will not be abhorred or hated by his community. When he is in trouble, the one who has his help will immediately reach out to him. On the other hand, the person who likes to hurt others, or refuses to offer help and assistance is a selfish person who does not use his mind. His actions and actions only narrow the scope of his own life, and cause others to hate and hate him. Doing good in order to avoid evil, or at best responding to the evils of others by doing good or being silent is a sign of a person who is wise and wise. The Word of God: \"... and when the foolish say good-bye to them (in contemptuous words), they say,\" salutations. \"(Al-Furqan \/ 25: 63) From this it is understandable, how high the value of religious teaching Islam establishes good relations between fellow human beings to create harmony and prosperity of the people. At the end of this verse, Allah swt emphasizes that those who possess such qualities will surely find a good final residence, Jannatun Naim's paradise in the hereafter. as well as happiness, peace, and prosperity in this world.",
      "text_tafsir": "Allah swt menyifati ulul albab dari kalangan orang-orang yang beriman, yaitu orang-orang yang meyakini bahwa yang diturunkan kepada Nabi Muhammad adalah suatu kebenaran yang berlaku, sebagai berikut:\n\na. Sifat pertama: bahwa orang-orang tersebut senantiasa memenuhi janji Allah, dan tidak mau mengingkari perjanjian itu. Yang dimaksud dengan \"janji Allah\" di sini ialah janji-janji yang telah mereka ikrarkan atas diri mereka, baik mengenai hubungan mereka dengan Allah, maupun hubungan mereka dengan orang lain. Fitrah mereka yang suci, dan hati mereka yang murni mengakui adanya perjanjian itu dan wahyu Allah pun mengharuskan adanya perjanjian tersebut.\n\nMereka tidak mau mengingkari atau pun memungkiri perjanjian yang telah mereka kukuhkan, karena mereka sangat menjauhi sifat-sifat kemunafikan. \n\nBetapa pentingnya sifat memenuhi janji ini, oleh Qatadah telah disebutkan bahwa dalam Al-Quran, Allah swt telah menyebutnya sebanyak lebih dua puluh kali.\n\nb.Sifat kedua: mereka memelihara semua perintah Allah dan tidak melanggarnya, baik hak-hak Allah maupun hak-hak hamba-Nya, termasuk memelihara silaturrahim.\n\nHubungan antara sesama manusia ialah menjalin hubungan tolong-menolong, menjalin cinta dan kasih-sayang, sebagaimana disebutkan dalam hadis:\n\nDari Abi Hurairah r.a. bahwasanya ia berkata, \"Aku mendengar Rasulullah saw bersabda, \"Barang siapa senang dilapangkan rezekinya dan selalu disebut-sebut kebaikannya, maka hendaklah pelihara hubungan silaturrahim.\" (Riwayat al-Bukhari dan Muslim).\n\nDan hadis Nabi saw:\n\nDari Ibnu Abbas ia berkata, \"Bersabda Rasulullah saw, \"Sesungguh-nya kebajikan dan menghubungkan silaturrahim itu, kedua-duanya benar-benar meringankan hisab yang buruk di hari kiamat.\" Kemudian Rasulullah saw membaca ayat ini.\" (Riwayat al-Khatib dan Ibnu Asakir)\n\nc. Sifat ketiga: mereka benar-benar takut kepada Allah swt. Sifat takut kepada Allah adalah perasaan takut yang dilandasi dengan rasa hormat yang mendorong orang untuk taat kepada-Nya. Sifat ini dimiliki oleh para ulama, dan ciri dari orang-orang \"muqarrabin\". Dalam hubungan ini Allah swt telah berfirman:\n\nDi antara hamba-hamba Allah yang takut kepada-Nya, hanyalah para ulama. (Fathir\/35: 28)\n\nd. Sifat keempat: mereka senantiasa takut kepada hisab yang sifatnya merugikan mereka pada hari kiamat, yaitu hasil yang buruk dari amalan mereka di hari kiamat, karena banyaknya kejahatan yang dilakukannya selagi hidup di dunia ini. Oleh sebab itu, mereka senantiasa mawas diri, sebelum dihisab amalannya di akhirat kelak. Mereka selalu membandingkan antara amal-amal mereka yang baik dengan yang buruk, selalu berusaha agar amal yang baik lebih banyak dari perbuatan yang buruk, agar neraca kebajikan mereka di akhirat kelak lebih berat daripada neraca keburukan. Dalam hal ini, Allah telah berfirman:\n\nMaka adapun orang yang berat timbangan (kebaikan)-nya, maka dia berada dalam kehidupan yang memuaskan (senang). Dan adapun orang yang ringan timbangan (kebaikan)-nya maka tempat kembalinya adalah neraka Hawiyah. (al-Qariah\/101: 6 - 9)\n\ne.Sifat kelima: mereka senantiasa sabar dalam menghadapi segala cobaan dan rintangan, demi mengharapkan rida Allah. Sabar dalam hal ini berarti menahan diri terhadap segala hal yang tidak disenanginya, baik dengan cara melakukan ketaatan dan menunaikan segala kewajiban yang telah ditetapkan agama maupun dengan jalan menjauhi hal-hal yang dilarang agama. Bisa juga berarti bersikap rela menerima segala ketentuan Allah yang telah berlaku berupa musibah dan lain sebagainya.\n\nKesabaran yang diminta dari setiap orang yang berakal dan beriman ialah kesabaran yang dilakukan semata-mata karena mengharapkan keridaan Allah dan ganjaran-Nya, bukan kesabaran yang dibuat-buat karena ingin dipuji dan disebut-sebut. Itulah kesabaran yang sejati, yang menjadi sifat bagi orang-orang yang berakal dan beriman.\n\nf. Sifat keenam: mereka senantiasa mendirikan salat. Arti \"mendirikan salat\" ialah menunaikan dengan cara yang sebaik-baiknya, dengan menyempurnakan rukun dan syaratnya, disertai rasa khusyuk dan tawaduk menghadapkan wajah dan hati kepada Allah semata, tidak dibarengi dengan ria, serta memelihara waktu yang telah ditetapkan untuknya. Hal ini hanya dapat dilakukan bila pada saat-saat melakukan salat, kita merasa sedang berdiri sendiri di hadapan Allah swt, Pencipta dan Penguasa semesta alam. Dengan demikian, maka tak ada sesuatu pun yang dipikirkan pada saat itu, kecuali semata-mata bermunajah kepada Allah.\n\ng. Sifat ketujuh: mereka senantiasa menginfakkan sebagian dari rezeki yang telah dilimpahkan Allah kepada mereka, baik secara tersembunyi maupun terang-terangan, baik infak wajib seperti terhadap istri, anak, dan karib kerabat maupun infak sunah seperti terhadap fakir miskin. Kenyataan dapat memberikan pengertian kepada kita tentang rahasia yang tersimpan di dalamnya. Al-Quran berulang kali menganjurkan kepada orang-orang mukmin untuk menginfakkan sebagian dari rezeki yang telah diperolehnya kepada yang memerlukan pertolongan, dan untuk menyokong kepentingan umum. Jika mereka mau melakukannya, niscaya kemiskinan dan kemelaratan dapat dilenyapkan dari kehidupan masyarakat.\n\nh. Sifat kedelapan: mereka senantiasa menolak kejahatan dengan kebajikan, karena kebajikan itu dapat menolak kejahatan. Kenyataan menunjukkan bahwa apabila seseorang dapat bergaul dengan orang lain dengan akrab dan kasih sayang serta menolong orang-orang yang memerlukan pertolongan, ia tidak akan dimusuhi atau dibenci oleh masyarakatnya. Apabila ia mendapat musibah, maka orang yang pernah mendapat pertolongannya akan segera pula mengulurkan pertolongan kepadanya. Sebaliknya orang yang suka menyakiti orang lain, atau enggan memberikan bantuan dan pertolongan adalah orang yang egois dan tidak menggunakan akalnya. Sikap dan perbuatannya itu hanyalah mempersempit ruang lingkup kehidupannya sendiri, serta menimbulkan kebencian dan kedengkian orang lain terhadap dirinya.\n\nBerbuat kebaikan untuk menghindari kejahatan, atau sedapat mungkin membalas perbuatan jahat orang lain dengan berbuat kebajikan atau dengan diam adalah tanda orang yang mau menggunakan akalnya dan bijaksana. Firman Allah:\n\n\"... dan apabila orang-orang bodoh menyapa mereka (dengan kata-kata yang menghina), mereka mengucapkan, \"salam.\" (al-Furqan\/25: 63)\n\nDari sini dapat dipahami, betapa tingginya nilai ajaran agama Islam dalam membina hubungan baik antara sesama manusia guna menciptakan kerukunan dan kesejahteraan masyarakat.\n\nPada akhir ayat ini, Allah swt menegaskan bahwa orang-orang yang memiliki sifat-sifat tersebut pasti akan memperoleh tempat kediaman terakhir yang baik, yaitu surga Jannatun Naim di akhirat kelak di samping kebahagiaan, ketenangan, dan kesejahteraan di dunia ini.",
      "text_translation": "dan orang-orang yang menghubungkan apa yang diperintahkan Allah agar dihubungkan, dan mereka takut kepada Tuhannya dan takut kepada hisab yang buruk.",
      "text": "وَالَّذِيْنَ يَصِلُوْنَ مَآ اَمَرَ اللّٰهُ بِهٖٓ اَنْ يُّوْصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُوْنَ سُوْۤءَ الْحِسَابِ ۗ   ",
      "text_translation_en": "and who keep together what God has bidden to be joined, and stand in awe of their Sustainer and fear the most evil reckoning [which awaits such as do not respond to Him];",
      "juz_number": 13
    },
    "22": {
      "text_tafsir_en": "Allah swt albab albab among the believers, those who believe that what was revealed to the Prophet Muhammad is a valid truth, as follows: a. The first characteristic: that they are always keeping the promise of God, and will not break the covenant. The meaning of the \"promise of God\" here is the promises they have made to themselves, either in their relationship with God or in their relationships with others. Their sacred nature, and their pure hearts acknowledge the existence of the covenant and the revelation of God requires the covenant. They would not disobey or disobey the covenant they had entered into, for they were far from hypocrisy. As important as the fulfillment of this promise is, by the Qatadah it has been stated that in the Quran, Allah Almighty has mentioned it more than twenty times. b. Second nature: they keep all the commandments of God and do not violate it, either in the rights of God or the rights of His servants, including the maintenance of friendship. The relationship between human beings is that of mutual help, mutual love and affection, as mentioned in the hadith: From Abi Hurairah ra that he said, \"I heard the Messenger of Allah (may peace be upon him) say,\" He who is pleased to extend his sustenance and is always mentioned , then maintain the relationship of friendship. \"(Al-Bukhari and Muslim narratives). And the Prophet's hadith: From Ibn Abbas he said,\" The Messenger of Allah (may peace be upon him) said, \"The benefits and the connection between them are very light. bad willab on the Day of Judgment. \" Then Allah's Messenger (may peace be upon him) read this verse. \"(History of al-Khatib and Ibn Asakir) c. Third nature: They are truly God-fearing. The fear of Allah is a fear that is based on respect that motivates people to obey This is the property of the scholars, and is characteristic of the people of the \"muqarrabin\". In this connection Allah swt says: Among the servants of Allah who fear Him, only the scholars (Fathir \/ 35: 28) d Fourth nature: they are always afraid of hisab, which means that they will be harmed on the Day of Judgment, which is a bad result of their deeds on the Day of Judgment, because of the many crimes they committed while living in this world. They always practice the good deeds of the good and the bad, always strive for good deeds more than bad deeds, to balance their good deeds in the hereafter. heavier than the balance sheet. In this case, Allah has said: If a man weighs his scales, he is in a good (happy) life. And as for the light-weighted (good) people, the return home is Hawiyah hell. (al-Qariah \/ 101: 6 - 9) e. Fifth nature: they persevere in the face of trials and obstacles, hoping for God's will. Patience in this matter means refraining from anything that is not pleasing to him, either by exercising obedience and fulfilling all the obligations imposed by the religion or by avoiding the prohibitions of religion. It can also mean being willing to accept all the provisions of Allah in the form of disaster and so on. The patience required of every wise and believing person is patience that is purely for the sake of God's will and His reward, not the patience for which he wants to be praised and called. That is true patience, which is characteristic of those who are wise and believing. f. Sixth nature: they always offer prayers. The meaning of \"setting up prayer\" is to perform in the best way possible, by perfecting the precepts and conditions, accompanied by a sense of reverence and devotion to the face and heart of God alone, not accompanied by joy, and preserving the time set for him. This is only possible when in prayer, we feel standing before the Almighty, Creator and Ruler of the universe. Thus, there was nothing to think about at that time, except in the face of God. g. The seventh nature: they always give away some of the provision that God has bestowed upon them, either secretly or openly, whether compulsory as in the case of wives, children, and relatives or infants as in the poor. Reality can give us a sense of the secrets it holds. The Qur'an repeatedly urged the believers to devote some of their sustenance to those in need, and to support the common interest. If they want to do it, poverty and poverty can be eliminated from people's lives. h. Eighth nature: they always reject evil with good, because it can resist evil. The fact shows that when one is able to associate with others with kindness and love and to help those in need, he will not be abhorred or hated by his community. When he is in trouble, the one who has his help will immediately reach out to him. On the other hand, the person who likes to hurt others, or refuses to offer help and assistance is a selfish person who does not use his mind. His actions and actions only narrow the scope of his own life, and cause others to hate and hate him. Doing good in order to avoid evil, or at best responding to the evils of others by doing good or being silent is a sign of a person who is wise and wise. The Word of God: \"... and when the foolish say good-bye to them (in contemptuous words), they say,\" salutations. \"(Al-Furqan \/ 25: 63) From this it is understandable, how high the value of religious teaching Islam establishes good relations between fellow human beings to create harmony and prosperity of the people. At the end of this verse, Allah swt emphasizes that those who possess such qualities will surely find a good final residence, Jannatun Naim's paradise in the hereafter. as well as happiness, peace, and prosperity in this world.",
      "text_tafsir": "Allah swt menyifati ulul albab dari kalangan orang-orang yang beriman, yaitu orang-orang yang meyakini bahwa yang diturunkan kepada Nabi Muhammad adalah suatu kebenaran yang berlaku, sebagai berikut:\n\na. Sifat pertama: bahwa orang-orang tersebut senantiasa memenuhi janji Allah, dan tidak mau mengingkari perjanjian itu. Yang dimaksud dengan \"janji Allah\" di sini ialah janji-janji yang telah mereka ikrarkan atas diri mereka, baik mengenai hubungan mereka dengan Allah, maupun hubungan mereka dengan orang lain. Fitrah mereka yang suci, dan hati mereka yang murni mengakui adanya perjanjian itu dan wahyu Allah pun mengharuskan adanya perjanjian tersebut.\n\nMereka tidak mau mengingkari atau pun memungkiri perjanjian yang telah mereka kukuhkan, karena mereka sangat menjauhi sifat-sifat kemunafikan. \n\nBetapa pentingnya sifat memenuhi janji ini, oleh Qatadah telah disebutkan bahwa dalam Al-Quran, Allah swt telah menyebutnya sebanyak lebih dua puluh kali.\n\nb.Sifat kedua: mereka memelihara semua perintah Allah dan tidak melanggarnya, baik hak-hak Allah maupun hak-hak hamba-Nya, termasuk memelihara silaturrahim.\n\nHubungan antara sesama manusia ialah menjalin hubungan tolong-menolong, menjalin cinta dan kasih-sayang, sebagaimana disebutkan dalam hadis:\n\nDari Abi Hurairah r.a. bahwasanya ia berkata, \"Aku mendengar Rasulullah saw bersabda, \"Barang siapa senang dilapangkan rezekinya dan selalu disebut-sebut kebaikannya, maka hendaklah pelihara hubungan silaturrahim.\" (Riwayat al-Bukhari dan Muslim).\n\nDan hadis Nabi saw:\n\nDari Ibnu Abbas ia berkata, \"Bersabda Rasulullah saw, \"Sesungguh-nya kebajikan dan menghubungkan silaturrahim itu, kedua-duanya benar-benar meringankan hisab yang buruk di hari kiamat.\" Kemudian Rasulullah saw membaca ayat ini.\" (Riwayat al-Khatib dan Ibnu Asakir)\n\nc. Sifat ketiga: mereka benar-benar takut kepada Allah swt. Sifat takut kepada Allah adalah perasaan takut yang dilandasi dengan rasa hormat yang mendorong orang untuk taat kepada-Nya. Sifat ini dimiliki oleh para ulama, dan ciri dari orang-orang \"muqarrabin\". Dalam hubungan ini Allah swt telah berfirman:\n\nDi antara hamba-hamba Allah yang takut kepada-Nya, hanyalah para ulama. (Fathir\/35: 28)\n\nd. Sifat keempat: mereka senantiasa takut kepada hisab yang sifatnya merugikan mereka pada hari kiamat, yaitu hasil yang buruk dari amalan mereka di hari kiamat, karena banyaknya kejahatan yang dilakukannya selagi hidup di dunia ini. Oleh sebab itu, mereka senantiasa mawas diri, sebelum dihisab amalannya di akhirat kelak. Mereka selalu membandingkan antara amal-amal mereka yang baik dengan yang buruk, selalu berusaha agar amal yang baik lebih banyak dari perbuatan yang buruk, agar neraca kebajikan mereka di akhirat kelak lebih berat daripada neraca keburukan. Dalam hal ini, Allah telah berfirman:\n\nMaka adapun orang yang berat timbangan (kebaikan)-nya, maka dia berada dalam kehidupan yang memuaskan (senang). Dan adapun orang yang ringan timbangan (kebaikan)-nya maka tempat kembalinya adalah neraka Hawiyah. (al-Qariah\/101: 6 - 9)\n\ne.Sifat kelima: mereka senantiasa sabar dalam menghadapi segala cobaan dan rintangan, demi mengharapkan rida Allah. Sabar dalam hal ini berarti menahan diri terhadap segala hal yang tidak disenanginya, baik dengan cara melakukan ketaatan dan menunaikan segala kewajiban yang telah ditetapkan agama maupun dengan jalan menjauhi hal-hal yang dilarang agama. Bisa juga berarti bersikap rela menerima segala ketentuan Allah yang telah berlaku berupa musibah dan lain sebagainya.\n\nKesabaran yang diminta dari setiap orang yang berakal dan beriman ialah kesabaran yang dilakukan semata-mata karena mengharapkan keridaan Allah dan ganjaran-Nya, bukan kesabaran yang dibuat-buat karena ingin dipuji dan disebut-sebut. Itulah kesabaran yang sejati, yang menjadi sifat bagi orang-orang yang berakal dan beriman.\n\nf. Sifat keenam: mereka senantiasa mendirikan salat. Arti \"mendirikan salat\" ialah menunaikan dengan cara yang sebaik-baiknya, dengan menyempurnakan rukun dan syaratnya, disertai rasa khusyuk dan tawaduk menghadapkan wajah dan hati kepada Allah semata, tidak dibarengi dengan ria, serta memelihara waktu yang telah ditetapkan untuknya. Hal ini hanya dapat dilakukan bila pada saat-saat melakukan salat, kita merasa sedang berdiri sendiri di hadapan Allah swt, Pencipta dan Penguasa semesta alam. Dengan demikian, maka tak ada sesuatu pun yang dipikirkan pada saat itu, kecuali semata-mata bermunajah kepada Allah.\n\ng. Sifat ketujuh: mereka senantiasa menginfakkan sebagian dari rezeki yang telah dilimpahkan Allah kepada mereka, baik secara tersembunyi maupun terang-terangan, baik infak wajib seperti terhadap istri, anak, dan karib kerabat maupun infak sunah seperti terhadap fakir miskin. Kenyataan dapat memberikan pengertian kepada kita tentang rahasia yang tersimpan di dalamnya. Al-Quran berulang kali menganjurkan kepada orang-orang mukmin untuk menginfakkan sebagian dari rezeki yang telah diperolehnya kepada yang memerlukan pertolongan, dan untuk menyokong kepentingan umum. Jika mereka mau melakukannya, niscaya kemiskinan dan kemelaratan dapat dilenyapkan dari kehidupan masyarakat.\n\nh. Sifat kedelapan: mereka senantiasa menolak kejahatan dengan kebajikan, karena kebajikan itu dapat menolak kejahatan. Kenyataan menunjukkan bahwa apabila seseorang dapat bergaul dengan orang lain dengan akrab dan kasih sayang serta menolong orang-orang yang memerlukan pertolongan, ia tidak akan dimusuhi atau dibenci oleh masyarakatnya. Apabila ia mendapat musibah, maka orang yang pernah mendapat pertolongannya akan segera pula mengulurkan pertolongan kepadanya. Sebaliknya orang yang suka menyakiti orang lain, atau enggan memberikan bantuan dan pertolongan adalah orang yang egois dan tidak menggunakan akalnya. Sikap dan perbuatannya itu hanyalah mempersempit ruang lingkup kehidupannya sendiri, serta menimbulkan kebencian dan kedengkian orang lain terhadap dirinya.\n\nBerbuat kebaikan untuk menghindari kejahatan, atau sedapat mungkin membalas perbuatan jahat orang lain dengan berbuat kebajikan atau dengan diam adalah tanda orang yang mau menggunakan akalnya dan bijaksana. Firman Allah:\n\n\"... dan apabila orang-orang bodoh menyapa mereka (dengan kata-kata yang menghina), mereka mengucapkan, \"salam.\" (al-Furqan\/25: 63)\n\nDari sini dapat dipahami, betapa tingginya nilai ajaran agama Islam dalam membina hubungan baik antara sesama manusia guna menciptakan kerukunan dan kesejahteraan masyarakat.\n\nPada akhir ayat ini, Allah swt menegaskan bahwa orang-orang yang memiliki sifat-sifat tersebut pasti akan memperoleh tempat kediaman terakhir yang baik, yaitu surga Jannatun Naim di akhirat kelak di samping kebahagiaan, ketenangan, dan kesejahteraan di dunia ini.",
      "text_translation": "Dan orang yang sabar karena mengharap keridaan Tuhannya, melaksanakan salat, dan menginfakkan sebagian rezeki yang Kami berikan kepada mereka, secara sembunyi atau terang-terangan serta menolak kejahatan dengan kebaikan; orang itulah yang men-dapat tempat kesudahan (yang baik),",
      "text": "وَالَّذِيْنَ صَبَرُوا ابْتِغَاۤءَ وَجْهِ رَبِّهِمْ وَاَقَامُوا الصَّلٰوةَ وَاَنْفَقُوْا مِمَّا رَزَقْنٰهُمْ سِرًّا وَّعَلَانِيَةً وَّيَدْرَءُوْنَ بِالْحَسَنَةِ السَّيِّئَةَ اُولٰۤىِٕكَ لَهُمْ عُقْبَى الدَّارِۙ  ",
      "text_translation_en": "and who are patient in adversity out of a longing for their Sustainer's countenance, and are constant in prayer, and spend on others, secretly and openly, out of what We provide for them as sustenance, and [who] repel evil with good. It is these that shall find their fulfilment in the hereafter:",
      "juz_number": 13
    },
    "23": {
      "text_tafsir_en": "In this verse, Allah swt explains that those who will find happiness in the world and in the hereafter will not only possess that trait, but also the virtuous among their mothers and fathers, as well as their wives and children. nearby. They will also enjoy that happiness and well-being, as long as they do not do things that cause them to lose their right to God's grace, for example because of disbelief and greed for God. This verse signals that on that day there will be no family relationship except for each other's righteous deeds. The Word of God: When the trumpet is blown, then there is no family relation between them on that day, nor will they ask each other. (al-Muminun \/ 23: 101) In this connection, the Messenger of Allah (may peace be upon him) said to his daughter Fatimah az-Zahra as follows: \"O Fatimah daughter of Muhammad! Ask me what you want because I will not be able to help you from the torment of Allah . \" (At-Tirmidzi History of Abu Hurairah) In the Qur'an, Allah has also emphasized the following: (that is) the day (when) wealth and children are useless, except for those who are facing Allah with a pure heart. (asy-Syuara \/ 26: 88-89) Those who use his mind as above will be placed by God in his heaven. There they sat face-to-face on the magnificent halls with their loved ones, their ancestors, their families, and their children, as well as those who should enter heaven from the righteous , to make their hearts happy and happy. It is the mercy and goodness of Allah to them. In addition, angels came to them from all over to congratulate them on the fortune they had received, which is heaven. They lived in prosperous homes, close to the prophets and apostles and those who recognized the truth of God's religion.",
      "text_tafsir": "Dalam ayat ini, Allah swt menerangkan bahwa yang akan memperoleh kebahagiaan di dunia dan di akhirat kelak bukan hanya semata-mata yang memiliki sifat tersebut, melainkan juga orang-orang saleh di antara ibu-ibu dan nenek moyang mereka, demikian pula istri dan keturunan mereka yang terdekat. Mereka ini pun akan turut pula merasakan kebahagiaan dan kesejahteraan itu, selama mereka tidak melakukan hal-hal yang menyebabkan mereka kehilangan hak untuk memperoleh rahmat Allah, misalnya karena kekafiran dan kemusyrikan kepada Allah. Ayat ini memberikan isyarat bahwa pada hari tersebut tidak berlaku hubungan kekeluargaan sedikit pun kecuali amal saleh masing-masing. Firman Allah:\n\nApabila sangkakala ditiup, maka tidak ada lagi pertalian keluarga di antara mereka pada hari itu (hari Kiamat), dan tidak (pula) mereka saling bertanya. (al-Muminun\/23: 101)\n\nDalam hubungan ini, Rasulullah saw pernah bersabda kepada putrinya Fatimah az-Zahra sebagai berikut:\n\n\"Wahai Fatimah putri Muhammad! Mintalah dari hartaku apa yang kau inginkan karena aku sedikit pun tidak akan dapat menolongmu dari azab Allah.\" (Riwayat at-Tirmidzi dari Abu Hurairah)\n\nDalam Al-Quran, Allah telah menegaskan pula sebagai berikut:\n\n(yaitu) pada hari (ketika) harta dan anak-anak tidak berguna, kecuali orang-orang yang menghadap Allah dengan hati yang bersih. (asy-Syuara\/26: 88-89)\n\nOrang-orang yang menggunakan akalnya seperti yang tersebut di atas akan ditempatkan Allah kelak dalam surga-Nya. Mereka di sana duduk berhadap-hadapan di atas balai-balai yang indah disertai orang-orang yang mereka cintai, yaitu nenek moyang, kaum keluarga, dan anak-anak mereka, serta orang-orang yang patut masuk surga dari kalangan orang-orang yang saleh, agar hati mereka menjadi senang dan bahagia.\n\nHal itu merupakan rahmat dan kebaikan Allah swt kepada mereka. Selain itu para malaikat datang kepada mereka dari segala penjuru untuk memberikan ucapan selamat atas keberuntungan yang telah mereka peroleh, yaitu masuk surga. Mereka tinggal dalam rumah yang diliputi kesejahteraan, berdekatan dengan para nabi dan rasul serta orang-orang yang mengakui kebenaran agama Allah.",
      "text_translation": "(yaitu) surga-surga ‘Adn, mereka masuk ke dalamnya bersama dengan orang yang saleh dari nenek moyangnya, pasangan-pasangannya, dan anak cucunya, sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu;",
      "text": "جَنّٰتُ عَدْنٍ يَّدْخُلُوْنَهَا وَمَنْ صَلَحَ مِنْ اٰبَاۤىِٕهِمْ وَاَزْوَاجِهِمْ وَذُرِّيّٰتِهِمْ وَالْمَلٰۤىِٕكَةُ يَدْخُلُوْنَ عَلَيْهِمْ مِّنْ كُلِّ بَابٍۚ ",
      "text_translation_en": "gardens of perpetual bliss, which they shall enter together with the righteous from among their parents, their spouses, and their offspring; and the angels will come unto them from every gate [and will say]:",
      "juz_number": 13
    },
    "24": {
      "text_tafsir_en": "In this verse, it is mentioned that angels come to the heavenly host while saying, \"May you be safe from all things that are undesirable and feared, which have damaged people besides you. This fortune you have received thanks to the patience and suffering that you experience while undergoing life in the world. \" Ibn Jarir ath-Tabari and Ibn Abi Hatim from Umamah narrated that the Prophet (PBUH) often came to the tombs of martyrs during his lifetime at the beginning of each year. There he read the verse. That kind of thing was also done by Abu Bakr, Umar, and Usman ra",
      "text_tafsir": "Dalam ayat ini, disebutkan bahwa para malaikat mendatangi penghuni surga sambil mengucapkan salam, \"Semoga kamu aman dari segala hal yang tidak diinginkan dan ditakuti, yang telah merusak orang-orang selain kamu. Keberuntungan ini kamu peroleh berkat kesabaran dan penderitaan yang kamu alami selama menjalani kehidupan di dunia.\"\n\nIbnu Jarir ath-thabari dan Ibnu Abi hatim dari Umamah meriwayatkan bahwa Nabi saw semasa hidupnya sering datang ke makam para syuhada pada setiap permulaan tahun. Di sana beliau membaca ayat tersebut. Hal semacam itu dilakukan pula oleh Abu Bakar, Umar, dan Usman r.a.",
      "text_translation": "(sambil mengucapkan), “Selamat sejahtera atasmu karena kesabaranmu.” Maka alangkah nikmatnya tempat kesudahan itu.",
      "text": "سَلٰمٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِۗ   ",
      "text_translation_en": "\"Peace be upon you, because you have persevered!\" How excellent, then, this fulfilment in the hereafter!",
      "juz_number": 13
    },
    "25": {
      "text_tafsir_en": "There are several covenants between God and man, among them are the ones who must acknowledge the omnipotence of God and His statutes and ordinances, believe in His prophets and His revealed revelations, and so on. Allah swt has given us clear evidence and arguments for it. However, in reality there are people who have broken the agreement, in the sense that: a. They ignore these promises, so they cannot fulfill the obligations that result from the agreement. For example, if they truly adhered to monotheism, they would not worship other than Allah. God gives us clear evidence of His power. However, they did not pay attention so they continued to oppose the monotheism. They have always embraced the shirk, trust and worship other than Allah. b. At first they pay attention to the promises they have made and the reasons given. They have acknowledged and believed the truth, but then they have denied it, and are no longer willing to practice it. People who love to deny and break promises that have been called \"hypocrites\". In this connection, the Messenger of Allah (may peace be upon him) said: Abi Hurairah narrated that the Prophet (peace be upon him) said, \"Signs of hypocrites are of three kinds: when he says, he is a liar, when he promises to be disloyal, and when he is believed to be treacherous.\" (History of Muslim, at-Tirmidzi and an-Nasai) In interpreting this verse 25, Abu al-Aliyah, a disbeliever, mentions that there are six types of hypocrites who they appear to be in a strong position in one society: 1. When they talk, they lie. 2. When they promise, they refuse. 3. When they are trusted, they betray. 4. Like to disobey the promise of Allah which they have declared before. 5. Like to break the bondage that God has commanded to be connected to and maintained as a relationship with His prophets who have come to bring the truth. They believed only in some of these prophets, and infidels in others. They also break the bond between fellow humans and the believers, but they maintain relationships and provide help to unbelievers. One example is that they hinder every effort that leads to a harmonious and loving life. They did not want to see the unity and unity among the believers, as the Prophet had suggested: Believers towards other believers should be like a building, one part reinforcing the other. (History of al-Bukhari, Muslim, and at-Tirmidzi from Abu Musa al-Asyari) And the Messenger of Allah (may peace be upon him) said: The believers are like one body, when one of their members is in pain, the other members are willing suffering from sleeplessness and having a fever because of it. (History of al-Bukhari and Muslims of An-Numan bin Basyir) Therefore, Muslims should be careful in maintaining unity and unity among them, not to incite to hypocrisy and the efforts of the hypocrites to break the unity. c. They love to do harm to the earth, whether it be the cruelty they inflict on themselves or the cruelty they inflict on the rights of others in an unlawful way, or by causing slander and catastrophe in the Muslim community, and spreading hostility and war against them. At the end of this verse, God sets the punishment that deserves to be inflicted upon the hypocrites because of their evil deeds and deeds. That punishment is the curse of God, which is to remove them from His mercy, so that they are cut off from the good of the world and the Hereafter. They will come to a very terrible end, the torment of Hell, in return for the evils and sins they have committed.",
      "text_tafsir": "Ada beberapa perjanjian antara Allah dan manusia, di antaranya adalah manusia wajib mengakui kemahaesaan Allah serta kodrat dan iradat-Nya, beriman kepada para nabi-Nya dan wahyu yang diturunkan-Nya, dan sebagainya. Allah swt telah memberikan bukti-bukti dan dalil-dalil yang nyata atas semua itu. Akan tetapi, pada kenyataannya ada di antara manusia yang telah merusak perjanjian tersebut, dalam arti:\n\na. Mereka tidak memperhatikan janji-janji tersebut, sehingga mereka tidak dapat melaksanakan kewajiban yang merupakan akibat yang timbul dari perjanjian itu. Misalnya, bila mereka benar-benar berpegang teguh kepada tauhid, mereka tentunya tidak akan beribadah kepada selain Allah. Allah memberikan bukti-bukti yang nyata tentang kemahaesaan-Nya. Akan tetapi, mereka tidak memperhatikan sehingga mereka tetap menentang landasan tauhid tersebut. Mereka senantiasa menganut kepercayaan syirik, mempercayai dan menyembah selain Allah.\n\nb. Pada mulanya mereka memperhatikan janji-janji yang telah mereka ikrarkan dan dalil-dalil yang telah diberikan. Mereka telah mengakui dan meyakini kebenarannya, tetapi kemudian mereka menyangkal kebenaran itu, dan tidak lagi bersedia mengamalkannya.\n\nOrang yang suka memungkiri dan menyalahi janji yang telah diikrarkan dinamakan \"munafik\". Dalam hubungan ini Rasulullah saw telah bersabda:\n\nAbi Hurairah r.a. meriwayatkan bahwa Nabi saw bersabda, \"Tanda-tanda orang munafik ada tiga macam: apabila ia berkata, ia selalu bohong, apabila ia berjanji selalu ingkar, dan apabila ia dipercayai berkhianat.\" (Riwayat Muslim, at-Tirmidzi dan an-Nasai)\n\nDalam menafsirkan ayat 25 ini, Abu al-Aliyah, seorang mufasir, me-nyebutkan bahwa ada enam macam sifat orang-orang munafik yang mereka tampakkan jika mereka merasa memiliki posisi yang kuat dalam satu masyarakat, yaitu:\n\n1. Apabila berbicara, mereka berbohong.\n\n2. Apabila berjanji, mereka ingkar.\n\n3. Apabila diberi kepercayaan, mereka berkhianat.\n\n4. Suka mengingkari janji Allah yang telah mereka ikrarkan sebelumnya.\n\n5. Suka memutuskan silaturrahim yang diperintahkan Allah untuk di-hubungkan dan dipelihara seperti hubungan dengan para Nabi-Nya yang telah datang membawa kebenaran. Mereka hanya beriman kepada sebagian dari para nabi tersebut, dan kafir terhadap sebagian yang lainnya.\n\nMereka juga memutuskan silaturrahim antara sesama manusia terutama dengan orang-orang mukmin, tetapi mereka tetap menjaga hubungan dan memberikan bantuan kepada orang-orang kafir. Di antara contohnya adalah mereka menghalang-halangi setiap usaha yang menuju kepada pembinaan kehidupan yang harmonis dan penuh kasih sayang. Mereka tidak sudi melihat terwujudnya persatuan dan kesatuan antara orang-orang mukmin, seperti yang dianjurkan Rasulullah:\n\nOrang mukmin terhadap orang mukmin yang lain haruslah seperti suatu bangunan, bagian yang satu menguatkan bagian yang lain. (Riwayat al-Bukhari, Muslim, dan at-Tirmidzi dari Abu Musa al-Asyari)\n\nDan Sabda Rasulullah saw:\n\nOrang-orang mukmin itu adalah seperti satu tubuh, apabila salah satu anggotanya menderita sakit, maka anggota-anggota yang lain pun rela pula menderita karena tidak tidur dan merasa demam karenanya. (Riwayat al-Bukhari dan Muslim dari an-Numan bin Basyir)\n\nOleh sebab itu, umat Islam haruslah hati-hati dalam menjaga kesatuan dan persatuan antara mereka, jangan dimasuki hasutan dan usaha-usaha kaum munafik untuk memecah belah persatuan itu.\n\nc. Mereka suka berbuat kerusakan di bumi, baik berupa kezaliman yang mereka lakukan terhadap diri sendiri maupun kezaliman yang mereka lakukan terhadap hak milik orang lain dengan jalan yang tidak sah, ataupun dengan menimbulkan fitnah dan bencana dalam masyarakat Muslimin, dan mengobarkan permusuhan dan peperangan terhadap mereka.\n\nPada akhir ayat ini, Allah menetapkan hukuman yang layak untuk ditimpakan kepada orang munafik mengingat jahatnya kelakuan dan perbuatan-perbuatan mereka. Hukuman tersebut ialah berupa laknat Allah, yaitu menjauhkan mereka dari rahmat-Nya, sehingga mereka tersingkir dari kebaikan dunia dan akhirat. Mereka akan menemui kesudahan yang sangat buruk, yaitu azab neraka Jahanam, sebagai balasan dari kejahatan dan dosa-dosa yang telah mereka perbuat.",
      "text_translation": "Dan orang-orang yang melanggar janji Allah setelah diikrarkannya, dan memutuskan apa yang diperintahkan Allah agar disambungkan dan berbuat kerusakan di bumi; mereka itu memperoleh kutukan dan tempat kediaman yang buruk (Jahanam).",
      "text": "وَالَّذِيْنَ يَنْقُضُوْنَ عَهْدَ اللّٰهِ مِنْ ۢ بَعْدِ مِيْثَاقِهٖ وَيَقْطَعُوْنَ مَآ اَمَرَ اللّٰهُ بِهٖٓ اَنْ يُّوْصَلَ وَيُفْسِدُوْنَ فِى الْاَرْضِۙ اُولٰۤىِٕكَ لَهُمُ اللَّعْنَةُ وَلَهُمْ سُوْۤءُ الدَّارِ ",
      "text_translation_en": "But as for those who break their bond with God after it has been established [in their nature], and cut asunder what God has bidden to be joined, and spread corruption on earth -their due is rejection [by God], and theirs is a most evil fate [in the life to come].",
      "juz_number": 13
    },
    "26": {
      "text_tafsir_en": "God makes and makes it easy for some of the servants He wants, so that they get sustenance that is more than their daily needs. They are people who are diligent and skilled in finding wealth, and doing various businesses. In addition, they are frugal and meticulous and are good at managing and using their property. On the contrary, Allah also limits the fortune for some of His servants, so that the fortune they get is no more than what is needed daily. They are usually lazy people and are not skilled in finding wealth, or are not good at managing and using the property. Allah broadens and narrows the fortune of His servants based on wisdom and His knowledge about each of them. These two things have nothing to do with the level of faith and disbelief of His servants. Therefore, there are times when God bestows abundant fortune on His pagan servants. On the contrary, sometimes Allah narrows the fortune for the faithful servants to add to the reward they will receive in the hereafter. Then wealth and poverty are two things that can happen to believers as well as unbelievers, the pious or the wicked. This verse goes on to say that the Meccan pagans who disobeyed Allah's promise, were very happy with the amount of property they owned, and abundant worldly life, and they thought that the treasure was the greatest blessing and luck. Therefore, at the end of this verse Allah points out their mistakes, and insists that the enjoyment of this earthly life is only a small, short-time, and easily and easily lost pleasure, compared to the enjoyment in the afterlife of great value and of all time. Thus, it is not appropriate if they are proud of the enjoyment in the world they feel. In this connection, the narration conveyed by Imam at-Tirmidhi from Ibn Masud mentions the following: Once the Messenger of Allah slept on a mat and then he woke up from his sleep, and the mat's appearance was visible on his stomach, then we said, \"Yes Rasulullah if we get it a bed for you? \" The Messenger of Allah said, \"What does this world mean to me. I live in this world like a rider who shelter for a moment under a tree, then he departs again and leaves the tree.\" (History of at-Tirmidhi from Ibn Masud)",
      "text_tafsir": "Allah melapangkan dan memudahkan rezeki bagi sebagian hamba yang dikehendaki-Nya, sehingga mereka memperoleh rezeki yang lebih dari keperluan sehari-hari. Mereka adalah orang-orang yang rajin dan terampil dalam mencari harta, dan melakukan bermacam-macam usaha. Selain itu, mereka hemat dan cermat serta pandai mengelola dan mempergunakan harta bendanya itu.\n\nSebaliknya, Allah juga membatasi rezeki bagi sebagian hamba-Nya, sehingga rezeki yang mereka peroleh tidak lebih dari apa yang diperlukan sehari-hari. Mereka biasanya adalah orang-orang pemalas dan tidak terampil dalam mencari harta, atau tidak pandai mengelola dan mempergunakan harta tersebut.\n\nAllah melapangkan dan menyempitkan rezeki hamba-Nya berdasarkan hikmah serta pengetahuan-Nya tentang masing-masing hamba itu. Kedua hal tersebut tidak ada hubungannya dengan kadar keimanan dan kekafiran hamba-Nya. Oleh karena itu, ada kalanya Allah menganugerahkan rezeki yang banyak kepada hamba-Nya yang kafir. Sebaliknya, kadang-kadang Allah menyempitkan rezeki bagi hamba yang beriman untuk menambah pahala yang kelak akan mereka peroleh di akhirat. Maka kekayaan dan kemiskinan adalah dua hal yang dapat terjadi pada orang-orang beriman maupun yang kafir, yang saleh ataupun yang fasik.\n\nAyat ini selanjutnya menceritakan bahwa kaum musyrik Mekah yang suka memungkiri janji Allah, sangat bergembira dengan banyaknya harta benda yang mereka miliki, dan kehidupan duniawi yang berlimpah-ruah, dan mereka mengira bahwa harta benda tersebut merupakan nikmat dan keberuntungan terbesar.\n\nOleh sebab itu, pada akhir ayat ini Allah menunjukkan kekeliruan mereka, dan menegaskan bahwa kenikmatan hidup duniawi ini hanyalah merupakan kenikmatan yang kecil, pendek waktunya, serta mudah dan cepat hilang, dibandingkan dengan kenikmatan di akhirat yang besar nilainya dan sepanjang masa. Dengan demikian, tidaklah pada tempatnya bila mereka bangga dengan kenikmatan di dunia yang mereka rasakan itu.\n\nDalam hubungan ini, riwayat yang disampaikan oleh Imam at-Tirmidzi dari Ibnu Masud menyebutkan sebagai berikut:\n\nPernah Rasulullah tidur di atas sehelai tikar kemudian beliau bangun dari tidurnya, dan kelihatan bekas tikar itu pada lambungnya, lalu kami berkata, \"Ya Rasulullah seandainya kami ambilkan tempat tidur untukmu?\" Rasulullah bersabda, \"Apalah artinya dunia ini bagiku. Aku hidup di dunia ini hanya laksana seorang pengendara yang berteduh sejenak di bawah pohon, kemudian ia berangkat lagi dan meninggalkan pohon itu.\" (Riwayat at-Tirmidzi dari Ibnu Masud)",
      "text_translation": "Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan membatasi (bagi siapa yang Dia kehendaki). Mereka bergembira dengan kehidupan dunia, padahal kehidupan dunia hanyalah kesenangan (yang sedikit) dibanding kehidupan akhirat.",
      "text": "اَللّٰهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ وَيَقْدِرُ ۗوَفَرِحُوْا بِالْحَيٰوةِ الدُّنْيَاۗ وَمَا الْحَيٰوةُ الدُّنْيَا فِى الْاٰخِرَةِ اِلَّا مَتَاعٌ  ࣖ  ",
      "text_translation_en": "GOD GRANTS abundant sustenance, or gives it in scant measure, unto whomever He wills; and they [who are given abundance] rejoice in the life of this world - even though, as compared with the life to come, the life of this world is nought but -a fleeting pleasure.",
      "juz_number": 13
    },
    "27": {
      "text_tafsir_en": "After explaining that the unbelievers were captivated by the mirage of worldly life and were happy with small pleasures, God spoke of the consequences of their misguided attitudes and views by proposing to Muhammad, to send down a verse from God that would prove Prophecy and its message. Among them were Abu Sufyan bin Harb (before converting to Islam), Abdullah bin Abi Umayyah, and his friends. They once said, \"Why not give Muhammad the evidence as it was passed down to the prophets and apostles, such as the falling of the heavens into pieces, turning the hill of shafa into gold, or moving mountains from around the city of Mecca, those vacant places can be turned into gardens. \" Their other utterances are mentioned in the Quran, among others in the following verses: Try to bring us a miracle as the apostles were sent. (al-Anbiya \/ 21: 5) By their utterance, it would seem that all the signs and proofs given to the Prophet Muhammad like the Quran and others are not the true proofs of his writings that could compel them to obedience and faith in God, or as an undeniable truth. Furthermore, Allah instructed the Prophet Muhammad to explain to the unbelievers that the decline of the evidence did not play a role in directing or leading astray. Everything is in the power of God alone. Only Allah Almighty has the power to mislead those He pleases, and guides the repentant to the way He pleases. Although the Prophet Muhammad had miracles that proved his apostasy, it would not be useful to make a believer. All one needs to believe is to be humble, obedient, and seek the guidance of Allah Almighty, to gain good fortune in the world and the Hereafter, and to avoid the delusions and temptations of the devil. For believers, the Qur'an is a miracle that proves the message of the Prophet Muhammad, so that no further proof is needed. On the contrary, the Muslims were submerged in error and disobedience, so that any evidence or miracle revealed by the Messenger would not make them believers.",
      "text_tafsir": "Setelah menjelaskan bahwa orang-orang musyrik terpukau oleh fatamorgana kehidupan duniawi dan gembira dengan kenikmatan yang kecil, lalu Allah menyebutkan akibat yang timbul dari sikap dan pandangan mereka yang keliru dengan mengajukan usul kepada Nabi Muhammad, agar kepada beliau diturunkan satu ayat dari Tuhan yang akan membuktikan kenabian dan kerasulannya. Di antara mereka adalah Abu Sufyan bin Harb (sebelum masuk Islam), Abdullah bin Abi Umayyah, dan kawan-kawannya. Mereka pernah mengatakan, \"Mengapa tidak diturunkan kepada Muhammad bukti-bukti sebagaimana yang telah diturunkan kepada para nabi dan rasul terdahulu, seperti jatuhnya langit berkeping-keping kepada mereka, mengubah Bukit shafa menjadi emas, atau menggeser gunung-gunung dari sekitar kota Mekah, sehingga tempat-tempat yang lowong itu dapat dijadikan kebun.\" Ucapan mereka yang lain disebut dalam Al-Quran, antara lain yang terdapat dalam ayat berikut :\n\nCobalah dia datangkan kepada kita suatu mukjizat sebagaimana rasul-rasul yang telah diutus. (al-Anbiya\/21: 5)\n\nDengan ucapan-ucapan mereka yang semacam itu, seolah-olah semua tanda dan bukti nyata yang diberikan kepada Nabi Muhammad saw seperti Al-Quran dan lain-lain, bukan bukti nyata kerasulannya yang mampu mendorong mereka untuk taat dan iman kepada Allah, atau sebagai suatu kebenaran yang tak dapat diragukan lagi.\n\nSelanjutnya, Allah memerintahkan kepada Nabi Muhammad saw untuk menjelaskan kepada orang-orang musyrik tersebut bahwa turunnya bukti-bukti tersebut, tidak berperan menjadikan seseorang mendapat petunjuk atau menjadi sesat. Seluruhnya berada dalam kekuasaan Allah semata. Hanya Allah swt yang kuasa menyesatkan orang yang dikehendaki-Nya, dan menuntun orang yang suka bertobat ke jalan yang diridai-Nya.\n\nWalaupun Nabi Muhammad memiliki mukjizat yang membuktikan kerasulannya, namun hal itu tidak akan bermanfaat untuk menjadikan seseorang beriman. Yang harus ditempuh seseorang untuk beriman hanyalah bersikap rendah hati, taat, dan memohon hidayah kepada Allah swt, untuk memperoleh keberuntungan di dunia dan di akhirat, serta terhindar dari tipu daya dan godaan setan.\n\nBagi orang yang beriman, Al-Quran adalah mukjizat yang membuktikan kerasulan Nabi Muhammad saw, sehingga tidak diperlukan bukti-bukti lain. Sebaliknya, orang-orang musyrik tenggelam dalam kesesatan dan keingkaran, sehingga bukti-bukti atau mukjizat apapun yang diperlihatkan oleh Rasulullah tidak akan menjadikan mereka orang-orang yang beriman.",
      "text_translation": "Dan orang-orang kafir berkata, “Mengapa tidak diturunkan kepadanya (Muhammad) tanda (mukjizat) dari Tuhannya?” Katakanlah (Muhammad), “Sesungguhnya Allah menyesatkan siapa yang Dia kehendaki dan memberi petunjuk orang yang bertobat kepada-Nya,”",
      "text": "وَيَقُوْلُ الَّذِيْنَ كَفَرُوْا لَوْلَآ اُنْزِلَ عَلَيْهِ اٰيَةٌ مِّنْ رَّبِّهٖۗ  قُلْ اِنَّ اللّٰهَ يُضِلُّ مَنْ يَّشَاۤءُ وَيَهْدِيْٓ اِلَيْهِ مَنْ اَنَابَۖ  ",
      "text_translation_en": "NOW THOSE who are bent on denying the truth [of the Prophet's message] say, \"Why has no miraculous sign ever been bestowed upon him from on high by his Sustainer?\" Say: \"Behold, God lets go astray him who wills [to go astray], just as He guides unto Himself all who turn unto Him-",
      "juz_number": 13
    },
    "28": {
      "text_tafsir_en": "In this verse, Allah describes the people who are given His guidance, namely the believers and their hearts are at peace because they always remember Allah. By remembering Allah, the heart is at peace and the soul is calm, not feeling restless, afraid, or worried. They do good things, and feel happy with the virtues they do.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan orang-orang yang mendapat tuntunan-Nya, yaitu orang-orang beriman dan hatinya menjadi tenteram karena selalu mengingat Allah. Dengan mengingat Allah, hati menjadi tenteram dan jiwa menjadi tenang, tidak merasa gelisah, takut, ataupun khawatir. Mereka melakukan hal-hal yang baik, dan merasa bahagia dengan kebajikan yang dilakukannya.",
      "text_translation": "(yaitu) orang-orang yang beriman dan hati mereka menjadi tenteram dengan mengingat Allah. Ingatlah, hanya dengan mengingat Allah hati menjadi tenteram.",
      "text": "الَّذِيْنَ اٰمَنُوْا وَتَطْمَىِٕنُّ قُلُوْبُهُمْ بِذِكْرِ اللّٰهِ ۗ اَلَا بِذِكْرِ اللّٰهِ تَطْمَىِٕنُّ الْقُلُوْبُ ۗ   ",
      "text_translation_en": "those who believe, and whose hearts find their rest in the remembrance of God - for, verily, in the remembrance of God [men's] hearts do find their rest-:",
      "juz_number": 13
    },
    "29": {
      "text_tafsir_en": "In this verse it is explained that those who believe and do righteous deeds will undoubtedly get happiness and a good place to return to Allah next day.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa orang yang beriman dan melakukan amal saleh, niscaya akan memperoleh kebahagiaan dan tempat kembali yang baik di sisi Allah pada hari kemudian.",
      "text_translation": "Orang-orang yang beriman dan mengerjakan kebajikan, mereka mendapat kebahagiaan dan tempat kembali yang baik.",
      "text": "اَلَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ طُوْبٰى لَهُمْ وَحُسْنُ مَاٰبٍ ",
      "text_translation_en": "[and so it is that] they who attain to faith and do righteous deeds are destined for happiness [in this world] and the most beauteous of all goals [in the life to come]!\"",
      "juz_number": 13
    },
    "30": {
      "text_tafsir_en": "This verse explains that Allah sent Prophet Muhammad to people who had never received the coming of the Messenger of God. Although there have been other Gentiles who have been visited by His Apostles, they still deny the Divine Mercy of Allah swt explaining that the mission of the Prophet Muhammad was to recite to his people the Qur'an revealed to him. Allah commanded Prophet Muhammad (peace be upon him) to tell his people, that Allah is the Lord of the universe, there is no God but Allah, and only to Him is He dependent and repentant. Therefore, let his people believe in him. The Prophet Muhammad was also told to convey to his people that he trusted and repented to Allah Almighty, even though he was a prophet and apostle of God who had never sinned. If an apostle were to do so, let alone sinners, they would be more worthy to repent and repent to God for all the sins they had committed.",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah telah mengutus Nabi Muhammad kepada umat yang belum pernah menerima kedatangan rasul Allah. Walaupun sebelumnya telah ada umat-umat lainnya yang pernah didatangi oleh para rasul-Nya, tetapi mereka tetap mengingkari adanya Tuhan yang Maha Rahmat\n\nAllah swt menjelaskan bahwa tugas Nabi Muhammad adalah untuk membacakan kepada umatnya Al-Quran yang telah diwahyukan kepada beliau. Allah memerintahkan kepada Nabi Muhammad saw agar ia mengatakan kepada umatnya, bahwa Allah adalah Tuhan semesta alam, tidak ada Tuhan selain Allah, dan hanya kepada-Nya ia bertawakal dan bertobat. Oleh karena itu, hendaklah umatnya beriman kepada-Nya.\n\nNabi Muhammad juga diperintahkan untuk menyampaikan kepada umatnya bahwa ia bertawakal dan bertobat kepada Allah swt, walaupun ia adalah seorang nabi dan rasul Allah yang tidak pernah berbuat dosa. Jika seorang rasul masih berbuat demikian, apalagi orang-orang yang berdosa, tentu mereka lebih layak untuk bertawakal dan bertobat kepada Allah dari segala dosa yang telah mereka lakukan.",
      "text_translation": "Demikianlah, Kami telah mengutus engkau (Muhammad) kepada suatu umat yang sungguh sebelumnya telah berlalu beberapa umat, agar engkau bacakan kepada mereka (Al-Qur'an) yang Kami wahyukan kepadamu, padahal mereka ingkar kepada Tuhan Yang Maha Pengasih. Katakanlah, “Dia Tuhanku, tidak ada tuhan selain Dia; hanya kepada-Nya aku bertawakal dan hanya kepada-Nya aku bertobat.”",
      "text": "كَذٰلِكَ اَرْسَلْنٰكَ فِيْٓ اُمَّةٍ قَدْ خَلَتْ مِنْ قَبْلِهَآ اُمَمٌ لِّتَتْلُوَا۟ عَلَيْهِمُ الَّذِيْٓ اَوْحَيْنَآ اِلَيْكَ وَهُمْ يَكْفُرُوْنَ بِالرَّحْمٰنِۗ قُلْ هُوَ رَبِّيْ لَآ اِلٰهَ اِلَّا هُوَۚ عَلَيْهِ تَوَكَّلْتُ وَاِلَيْهِ مَتَابِ ",
      "text_translation_en": "Thus have We raised thee [O Muhammad] as Our Apostle amidst a community [of unbelievers] before whose time [similar] communities have come and gone, so that thou might propound to them what We have revealed unto thee: for [in their ignorance] they deny the Most Gracious! Say: \"He is my Sustainer. There is no deity save Him. In Him have I placed my trust, and unto Him is my recourse!\"",
      "juz_number": 13
    },
    "31": {
      "text_tafsir_en": "In this verse, Allah explains the greatness of the Quran as a miracle of the Prophet Muhammad. But before that, this verse explains that although there is one reading or Bible that can cause the mountains to move, the earth can split, or the dead can come back to life and talk, there will still be unbelievers. The meaning of the above statement is that God had given Moses a miracle, just as the mountain could travel, and the rock could bring forth springs after it had been struck with a stick. God also performed miracles in Jesus, so that he could bring the dead back to life. To Muhammad, Allah has bestowed the greatest miracle of the Quran, the miracle that is immortal and can be seen to this day. The Quran contains evidence showing the greatness of God's power and the beauty of His creation. In addition, the Quran brings the wisdom, laws, and regulations that people need to organize life in all areas of economic, political, social, and so on, guaranteeing a happy life here and hereafter if they wish. understand and practice it. Thus, they will appear as the best nation and people on this earth. According to ath-thabrani of Ibn Abbas that a group of Mecca Muslims, including Abu Jahal and Abdullah bin Abi Umayyah, held a meeting behind the Kabah, and sent someone to call the Messenger of Allah. He then came to their place, and Abdullah bin Abi Umayyah told him that they would be willing to follow him if he could prove the miracle of the Quran to move the mountains around Mecca, so that the place would be empty and could be used as farmland. If this was possible for the Prophet, then they would believe that he was a prophet and an apostle. They also asked the Messenger to take control of the wind and make it a vehicle for the return journey from Mecca to Sham. According to them, this would prove that Muhammad was truly a prophet and apostle of God like Prophet Solomon who could use the wind as a vehicle. In addition, they also asked Muhammad to revive his deceased ancestors, such as Qushai bin Kilab or whoever they wanted among their dead ancestors. They will ask the person who is alive whether the preaching that Muhammad saw is true or not. According to them, this is to prove that the Prophet Muhammad was truly the prophet and apostle of God just as the Prophet Jesus, who miraculously was able to resurrect the dead. Allah swt sent down the verse above to emphasize that if Allah granted what they asked for as part of the miracle of the Quran, that would have been possible, since it was all under His control. However, if these things were truly fulfilled, they would still not believe in Allah, the Prophet Muhammad, and the Quran as his miracle. The Prophet Muhammad wanted them to believe, but they did not believe, but even made various requests. Therefore in this verse, Allah swt gives him comfort by asserting that he and the believers must fully understand that if Allah wants all believers, surely Allah will guide them all. In addition, believers must also believe that the unbelievers will always face the disaster and wrath of God because of their unbelief and evil deeds. The disaster could have happened near their place of residence, so in the end came what God had promised, their own destruction. At the end of this verse, God emphasizes that God's promise to help the Muslims and destroy the unbelievers is bound to happen, because God will not break His promise.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan kebesaran Al-Quran sebagai mukjizat Nabi Muhammad saw. Namun sebelumnya, ayat ini menjelaskan bahwa walaupun ada satu bacaan atau Kitab Suci yang dapat menyebabkan gunung-gunung dapat berjalan, bumi dapat terbelah, atau orang-orang yang telah mati dapat hidup kembali dan berbicara, tetap akan ada orang-orang yang tidak beriman.\n\nMaksud pernyataan di atas adalah bahwa Allah telah memberikan mukjizat kepada Nabi Musa, seperti gunung Tur dapat berjalan, dan batu dapat mengeluarkan mata air setelah dipukul dengan tongkatnya. Allah swt juga telah memberikan mukjizat kepada Nabi Isa, sehingga ia dapat menghidupkan kembali orang-orang yang telah mati. Kepada Nabi Muhammad, Allah telah memberikan mukjizat terbesar yaitu Al-Quran, mukjizat yang bersifat abadi dan tetap dapat dilihat sampai sekarang. Al-Quran mengandung bukti-bukti yang menunjukkan kebesaran kekuasaan Allah dan keindahan ciptaan-Nya. Selain itu, Al-Quran membawa hikmah-hikmah, hukum-hukum, dan peraturan-peraturan yang diperlukan manusia untuk mengatur kehidupan dalam berbagai bidang baik ekonomi, politik, sosial, dan sebagainya, yang menjamin kehidupan yang bahagia di dunia dan akhirat jika mereka mau memahami dan mengamalkannya. Dengan demikian, mereka akan tampil menjadi bangsa dan umat yang terbaik di bumi ini. \n\nMenurut ath-thabrani dari Ibnu Abbas bahwa ada sekelompok kaum musyrikin Mekah, antara lain Abu Jahal dan Abdullah bin Abi Umayyah, mengadakan pertemuan di belakang Kabah, dan mengutus seseorang untuk memanggil Rasulullah saw. Beliau lalu datang ke tempat mereka, dan Abdullah bin Abi Umayyah mengatakan kepadanya bahwa mereka akan bersedia menjadi pengikutnya apabila beliau dapat membuktikan ke-mukjizatan Al-Quran untuk memindahkan gunung-gunung yang berada di sekitar Mekah, sehingga tempat tersebut menjadi lapang dan bisa dijadikan sebagai lahan pertanian. Jika hal tersebut dapat dilakukan Rasulullah, barulah mereka percaya bahwa ia benar-benar nabi dan rasul. Mereka juga meminta kepada Rasulullah agar dapat menguasai angin dan menjadikannya sebagai kendaraan pulang pergi dari Mekah ke negeri Syam. Menurut mereka, ini akan membuktikan bahwa Muhammad betul-betul nabi dan rasul Allah seperti Nabi Sulaiman yang mampu menggunakan angin sebagai kendaraan. Selain itu, mereka juga meminta agar Muhammad saw menghidupkan kembali nenek moyangnya yang telah lama meninggal dunia, seperti Qushai bin Kilab atau siapa saja yang mereka inginkan di antara nenek moyang mereka yang sudah mati. Mereka akan menanyakan kepada orang yang dihidupkan itu apakah dakwah yang disampaikan Muhammad saw benar atau tidak. Menurut mereka, hal ini adalah untuk membuktikan bahwa Nabi Muhammad saw benar-benar nabi dan rasul Allah sebagaimana halnya Nabi Isa as yang dengan mukjizatnya dapat menghidupkan kembali orang-orang yang telah mati.\n\nAllah swt lalu menurunkan ayat di atas untuk menegaskan bahwa seandainya Allah mengabulkan apa-apa yang mereka minta itu menjadi bagian dari kemukjizatan Al-Quran, pasti hal itu dapat terjadi, karena semuanya berada di bawah kekuasaan-Nya. Akan tetapi, seandainya hal tersebut benar-benar dikabulkan, mereka tetap tidak akan beriman kepada Allah, Nabi Muhammad, dan Al-Quran yang merupakan mukjizatnya.\n\nNabi Muhammad sangat ingin agar mereka itu beriman, namun mereka itu tidak juga beriman, bahkan mengajukan permintaan yang beraneka ragam. Oleh karena itu dalam ayat ini, Allah swt memberikan hiburan kepadanya dengan menegaskan bahwa ia dan orang-orang mukmin harus betul-betul memahami bahwa jika Allah menghendaki semua manusia beriman, pastilah Allah memberi petunjuk kepada mereka semuanya. Selain itu, orang-orang mukmin harus meyakini pula bahwa orang-orang kafir itu senantiasa akan ditimpa bencana dan kemurkaan Allah karena kekafiran dan perbuatan buruk mereka. Bencana itu bisa terjadi di dekat tempat kediaman mereka, sehingga akhirnya datanglah apa yang dijanjikan Allah, yaitu kehancuran mereka sendiri.\n\nPada akhir ayat ini, Allah menegaskan bahwa janji Allah untuk menolong kaum Muslimin dan membinasakan orang-orang kafir pasti akan terjadi, karena Allah tidak akan menyalahi janji-Nya.",
      "text_translation": "Dan sekiranya ada suatu bacaan (Kitab Suci) yang dengan itu gunung-gunung dapat digoncangkan, atau bumi jadi terbelah, atau orang yang sudah mati dapat berbicara, (itulah Al-Qur'an). Sebenarnya segala urusan itu milik Allah. Maka tidakkah orang-orang yang beriman mengetahui bahwa sekiranya Allah menghendaki (semua manusia beriman), tentu Allah memberi petunjuk kepada manusia semuanya. Dan orang-orang kafir senantiasa ditimpa bencana disebabkan perbuatan mereka sendiri atau bencana itu terjadi dekat tempat kediaman mereka, sampai datang janji Allah (penaklukkan Mekah). Sungguh, Allah tidak menyalahi janji.",
      "text": "وَلَوْ اَنَّ قُرْاٰنًا سُيِّرَتْ بِهِ الْجِبَالُ اَوْ قُطِّعَتْ بِهِ الْاَرْضُ اَوْ كُلِّمَ بِهِ الْمَوْتٰىۗ بَلْ لِّلّٰهِ الْاَمْرُ جَمِيْعًاۗ اَفَلَمْ يَا۟يْـَٔسِ الَّذِيْنَ اٰمَنُوْٓا اَنْ لَّوْ يَشَاۤءُ اللّٰهُ لَهَدَى النَّاسَ جَمِيْعًاۗ وَلَا يَزَالُ الَّذِيْنَ كَفَرُوْا تُصِيْبُهُمْ بِمَا صَنَعُوْا قَارِعَةٌ اَوْ تَحُلُّ قَرِيْبًا مِّنْ دَارِهِمْ حَتّٰى يَأْتِيَ وَعْدُ اللّٰهِ ۗاِنَّ اللّٰهَ لَا يُخْلِفُ الْمِيْعَادَ ࣖ ",
      "text_translation_en": "Yet even if [they should listen to] a [divine] discourse by which mountains could be moved, or the earth cleft asunder, or the dead made to speak - [they who are bent on denying the truth would still refuse to believe in it]! Nay, but God alone has the power to decide what shall be. Have, then, they who have attained to faith not yet come to know that, had God so willed; He would indeed have guided all mankind aright? But as for those who are bent on denying the truth-in result of their [evil] deeds, sudden calamities will always befall them or will alight close to their homes; [and this will continue] until God's promise [of resurrection] is fulfilled: verily, God never fails to fulfil His promise!",
      "juz_number": 13
    },
    "32": {
      "text_tafsir_en": "This verse contains amusement to the Messenger of Allah and the Muslims that they should not be discouraged by the attitude and disobedience of the infidels and the Meccans. Here, Allah swt explains that not only the Prophet Muhammad had been ridiculed by unbelievers and unbelievers, the apostles whom Allah had sent before them had experienced this. Only, Allah gave time and delayed the coming of those who disbelieved. In the end, God must have destroyed them with a terrible punishment.",
      "text_tafsir": "Ayat ini berisi hiburan kepada Rasulullah dan umat Islam agar mereka tidak berkecil hati terhadap sikap dan keingkaran orang-orang kafir dan musyrikin Mekah. Di sini, Allah swt menerangkan bahwa bukan hanya Nabi Muhammad yang pernah diperolok-olok oleh kaum kafir dan musyrik, rasul-rasul yang telah diutus Allah kepada mereka sebelumnya pun mengalami keadaan yang demikian. Hanya saja, Allah memberi tenggang waktu dan menangguhkan datangnya azab dan malapetaka kepada orang-orang kafir tersebut. Pada akhirnya, Allah pasti membinasakan mereka dengan azab yang sangat dahsyat.",
      "text_translation": "Dan sesungguhnya beberapa rasul sebelum engkau (Muhammad) telah diperolok-olokkan, maka Aku beri tenggang waktu kepada orang-orang kafir itu, kemudian Aku binasakan mereka. Maka alangkah hebatnya siksaan-Ku itu! ",
      "text": "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّنْ قَبْلِكَ فَاَمْلَيْتُ لِلَّذِيْنَ كَفَرُوْا ثُمَّ اَخَذْتُهُمْ فَكَيْفَ كَانَ عِقَابِ ",
      "text_translation_en": "And, indeed, [even] before thy time have [God's] apostles been derided, and for a while I gave rein to those who were [thus] bent on denying the truth: but then I took them to task - and how awesome was My retribution!",
      "juz_number": 13
    },
    "33": {
      "text_tafsir_en": "In this verse, Allah swt condemns the infidels and unbelievers who worship other than Allah, that which they consider to be their God, who can neither profit nor harm, nor know what men do, nor does can monitor and reward or torment people based on their deeds and deeds. Allah says, \"Is Allah watching over their actions like that which is maintained by those who do not possess such qualities?\" Because the Muslims made some allies to Allah Almighty, then Allah commanded His Messenger to say to them, \"Mention the qualities that you have in the form of what you consider to be God's match or ally!\" Everything does not have the attributes of perfection that Allah swt has. Therefore, it is not appropriate to be His ally. Their remarks and claims to the Prophet Muhammad as well as the above also give them the impression that Allah does not seem to know what is happening on this earth. Therefore, in this verse Allah swt asks them, do they speak those words with the intention of telling Allah swt about the events that occur on earth that they think God does not know? But Allah knows what is happening in this world. Because the Muslims associate God with others, in this verse Allah swt asks the Prophet Muhammad to ask them, do they call Allah's \"allies\" for mere utterance, and have no truth at all? If so, then their words are nonsense that has no truth at all. But Allah has no allies. He is the Most High and the Perfect. At the end of this verse, Allah swt opens the secret veil of the disbelievers and unbelievers, that is, they have been enticed by various temptations which depict them that their deception is a virtue and a commendable act. Because they obeyed the devil's appeal, they were hindered and perverted from the way of God. Whoever strays from the path of Allah, then no one can guide them because they have obeyed the will of the devil.",
      "text_tafsir": "Dalam ayat ini, Allah swt mencela kebodohan orang-orang kafir dan musyrik yang menyembah selain Allah, yaitu benda-benda yang mereka anggap sebagai Tuhan mereka, yang tidak dapat memberikan manfaat dan mudarat, tidak mengetahui apa-apa yang dikerjakan manusia, dan tidak pula dapat mengawasi serta memberikan pahala ataupun siksa kepada manusia berdasarkan amal dan perbuatannya. Allah mengatakan, \"Apakah Allah yang mengawasi perbuatan mereka sama dengan apa-apa yang dipertuhankan mereka yang tidak mempunyai sifat-sifat seperti itu?\"\n\nKarena kaum musyrikin menjadikan beberapa sekutu bagi Allah swt, maka Allah memerintahkan rasul-Nya untuk mengatakan kepada mereka, \"Sebutkanlah sifat-sifat yang dimiliki oleh apa yang kamu anggap sebagai tandingan atau sekutu Allah!\" Semuanya sama sekali tidak mempunyai sifat-sifat kesempurnaan seperti yang dimiliki Allah swt. Oleh sebab itu, tidaklah pantas untuk menjadi sekutu-Nya.\n\nUcapan dan tuntutan mereka kepada Nabi Muhammad seperti tersebut di atas juga memberikan kesan adanya anggapan mereka bahwa Allah seakan-akan tidak mengetahui apa yang terjadi di bumi ini. Oleh sebab itu, dalam ayat ini Allah swt mempertanyakan kepada mereka, apakah mereka mengucapkan kata-kata tersebut dengan maksud untuk memberitahukan kepada Allah swt tentang peristiwa-peristiwa yang terjadi di bumi yang mereka anggap tidak diketahui Allah? Padahal Allah mengetahui apa saja yang terjadi di alam ini.\n\nKarena kaum musyrikin itu mempersekutukan Allah dengan yang lain, maka dalam ayat ini Allah swt memerintahkan kepada Nabi Muhammad untuk menanyakan kepada mereka, apakah mereka menyebut-nyebut \"sekutu-sekutu\" Allah hanya sekedar ucapan lahiriyah saja, dan tidak mempunyai hakikat kebenaran sama sekali? Kalau demikian halnya, maka ucapan mereka adalah omong kosong yang tidak mempunyai hakikat kebenaran sama sekali. Padahal Allah sama sekali tidak mempunyai sekutu. Dia Mahatinggi dan Maha Sempurna.\n\nPada akhir ayat ini, Allah swt membuka tabir rahasia dari kesesatan orang-orang kafir dan musyrik, yaitu mereka telah terpukau oleh berbagai godaan setan yang menggambarkan kepada mereka bahwa tipu daya yang mereka lakukan itu adalah suatu kebaikan dan perbuatan yang terpuji. Oleh karena mereka telah menuruti rayuan setan tersebut, maka mereka telah dihalangi dan diselewengkan dari jalan Allah. Siapa yang telah menyimpang dari jalan Allah, maka tidak ada yang dapat memberikan petunjuk kepada orang-orang itu karena mereka telah menuruti kemauan setan.",
      "text_translation": "Maka apakah Tuhan yang menjaga setiap jiwa terhadap apa yang diperbuatnya (sama dengan yang lain)? Mereka menjadikan sekutu-sekutu bagi Allah. Katakanlah, “Sebutkanlah sifat-sifat mereka itu.” Atau apakah kamu hendak memberitahukan kepada Allah apa yang tidak diketahui-Nya di bumi, atau (mengatakan tentang hal itu) sekedar perkataan pada lahirnya saja. Sebenarnya bagi orang kafir, tipu daya mereka itu dijadikan terasa indah, dan mereka dihalangi dari jalan (yang benar). Dan barangsiapa disesatkan Allah, maka tidak ada seorang pun yang memberi petunjuk baginya.",
      "text": "اَفَمَنْ هُوَ قَاۤىِٕمٌ عَلٰى كُلِّ نَفْسٍۢ بِمَا كَسَبَتْۚ وَجَعَلُوْا لِلّٰهِ شُرَكَاۤءَ ۗ قُلْ سَمُّوْهُمْۗ اَمْ تُنَبِّـُٔوْنَهٗ بِمَا لَا يَعْلَمُ فِى الْاَرْضِ اَمْ بِظَاهِرٍ مِّنَ الْقَوْلِ ۗبَلْ زُيِّنَ لِلَّذِيْنَ كَفَرُوْا مَكْرُهُمْ وَصُدُّوْا عَنِ السَّبِيْلِ ۗوَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ ",
      "text_translation_en": "IS, THEN, HE who has every living being in His almighty care, [dealing with each] according to what it deserves -[is, then, He like anything else that exists]? And yet, they ascribe to other beings a share in God's divinity! Say: \"Give them any name [you please]: but do you [really think that you could] inform Him of anything on earth that He does not know-or [do you] but play with words?, Nay, goodly seems their false imagery to those who are bent on denying the truth, and so they are turned away from the [right] path: and he whom God lets go astray can never find any guide.",
      "juz_number": 13
    },
    "34": {
      "text_tafsir_en": "This verse explains how miserable the misfortunes of those who are lost are, and how much they suffer, namely: the misery of life in this world, while in the hereafter they will be punished even more. They did not get any protector from Allah's punishment.",
      "text_tafsir": "Ayat ini menjelaskan betapa malangnya nasib orang-orang yang sesat itu, dan bagaimana besarnya kerugian yang mereka derita, yaitu: kesengsaraan hidup di dunia ini, sedangkan di akhirat akan diazab lebih berat lagi. Mereka tidak mendapatkan seorang pelindung pun dari azab Allah.",
      "text_translation": "Mereka mendapat siksaan dalam kehidupan dunia, dan azab akhirat pasti lebih keras. Tidak ada seorang pun yang melindungi mereka dari (azab) Allah.",
      "text": "لَهُمْ عَذَابٌ فِى الْحَيٰوةِ الدُّنْيَا وَلَعَذَابُ الْاٰخِرَةِ اَشَقُّۚ وَمَا لَهُمْ مِّنَ اللّٰهِ مِنْ وَّاقٍ ",
      "text_translation_en": "For such, there is suffering in the life of this world; but, truly, [their] suffering in the life to come will be harder still, and they will have none to shield them from God.",
      "juz_number": 13
    },
    "35": {
      "text_tafsir_en": "One of the customs of the Koran is that after mentioning things relating to hell, it is usually accompanied by mentioning things concerning heaven which are full of pleasures that will be obtained by those who believe, have faith, and do good deeds. In this verse, the paradise promised by Allah to the righteous is likened to a beautiful and fertile garden because of the flowing rivers. The trees are described as fruiting incessantly and providing shelter to those who shelter underneath. This paradise is the last and forever home for the righteous. On the contrary, hell is a place of misery for infidels. By illustrating the comparison between the two places, the people who live in this world are welcome to choose the path to heaven by believing, doing charity and piety, or the road to hell with disbelief, polytheism, and evil deeds.",
      "text_tafsir": "Salah satu kebiasaan Al-Quran adalah setelah menyebutkan hal-hal yang berkenaan dengan neraka, biasanya diiringi dengan menyebutkan hal-hal yang berkenaan dengan surga yang penuh dengan kenikmatan yang akan diperoleh orang-orang yang beriman, bertakwa, dan beramal saleh. \n\nDalam ayat ini, surga yang dijanjikan Allah kepada orang-orang yang bertakwa diumpamakan sebuah kebun yang indah dan subur karena dialiri sungai-sungai. Pohon-pohonnya dilukiskan berbuah tidak henti-hentinya dan memberikan naungan kepada orang yang berteduh di bawahnya. Surga tersebut merupakan tempat tinggal terakhir dan selamanya bagi orang-orang yang bertakwa.\n\nSebaliknya, neraka merupakan tempat kediaman yang penuh kesengsara-an bagi orang-orang kafir.\n\nDengan digambarkannya perbandingan antara kedua tempat tersebut, maka manusia yang hidup di dunia ini dipersilakan untuk memilih jalan ke surga dengan beriman, beramal, dan bertakwa, atau jalan ke neraka dengan kekafiran, kemusyrikan, dan perbuatan-perbuatan jahat.",
      "text_translation": "Perumpamaan surga yang dijanjikan kepada orang yang bertakwa (ialah seperti taman), mengalir di bawahnya sungai-sungai; senantiasa berbuah dan teduh. Itulah tempat kesudahan bagi orang yang bertakwa; sedang tempat kesudahan bagi orang yang ingkar kepada Tuhan ialah neraka.",
      "text": "۞ مَثَلُ الْجَنَّةِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَۗ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُۗ  اُكُلُهَا دَاۤىِٕمٌ وَّظِلُّهَاۗ تِلْكَ عُقْبَى الَّذِيْنَ اتَّقَوْا ۖوَّعُقْبَى الْكٰفِرِيْنَ النَّارُ ",
      "text_translation_en": "THE PARABLE of the paradise promised to those who are conscious of God [is that of a garden] through which running waters flow: [but, unlike an earthly garden,] its fruits will be everlasting, and [so will be] its shade. Such will be the destiny of those who remain conscious of God-just as the destiny of those who deny the truth will be the fire.",
      "juz_number": 13
    },
    "36": {
      "text_tafsir_en": "This verse explains the attitude of the people of the Bible (Jews and Christians) to the Quran after they converted to Islam, such as Abdullah bin Salam of the Jews. They were very happy with the coming down of the Quran and accepting all its teachings and laws. However, there were also groups of Jews and Christians who misunderstood some of the Qur'an, especially the teachings of the oneness of Allah. Allah ordered the Prophet Muhammad to convey to the people the stability of his faith in Allah swt, saying, \"Indeed I am only commanded to worship Allah alone and I will not associate anything with Him. I call people to believe only in Him and I believe that only to him will I return. \" The Apostle's words explicitly reject the belief of shirk, which is to associate something with God as held by the Muslims. That belief is in stark contrast to the Qur'an's teaching of the absolute unity of God, which is the essence of Islam.",
      "text_tafsir": "Ayat ini menjelaskan sikap orang-orang Ahli Kitab (Yahudi dan Nasrani) terhadap Al-Quran setelah mereka memeluk agama Islam, seperti Abdullah bin Salam dari kalangan Yahudi. Mereka ini sangat gembira dengan turunnya Al-Quran dan menerima baik segala ajaran dan hukum-hukumnya. Akan tetapi, di samping itu ada pula segolongan orang-orang Yahudi dan Nasrani yang mengingkari sebagian dari Al-Quran, terutama mengenai ajaran tentang keesaan Allah swt.\n\nAllah memerintahkan kepada Nabi Muhammad untuk menyampaikan kepada golongan tersebut kemantapan imannya kepada Allah swt, dengan mengatakan, \"Sesungguhnya aku hanya diperintahkan untuk menyembah Allah semata dan aku tidak akan mempersekutukan sesuatupun dengan-Nya. Aku seru manusia untuk beriman hanya kepada-Nya dan aku yakin bahwa hanya kepada-Nya aku akan kembali.\"\n\nUcapan Rasul ini dengan tegas menolak kepercayaan syirik, yaitu mempersekutukan sesuatu dengan Allah seperti yang dianut oleh kaum musyrikin. Kepercayaan itu sangat bertentangan dengan ajaran Al-Quran tentang keesaan Allah secara mutlak, yang merupakan inti agama Islam.",
      "text_translation": "Dan orang yang telah Kami berikan kitab kepada mereka bergembira dengan apa (kitab) yang diturunkan kepadamu (Muhammad), dan ada di antara golongan (Yahudi dan Nasrani), yang mengingkari sebagiannya. Katakanlah, “Aku hanya diperintah untuk menyembah Allah dan tidak mempersekutukan-Nya. Hanya kepada-Nya aku seru (manusia) dan hanya kepada-Nya aku kembali.”",
      "text": "وَالَّذِيْنَ اٰتَيْنٰهُمُ الْكِتٰبَ يَفْرَحُوْنَ بِمَآ اُنْزِلَ اِلَيْكَ وَمِنَ الْاَحْزَابِ مَنْ يُّنْكِرُ بَعْضَهٗ ۗ قُلْ اِنَّمَآ اُمِرْتُ اَنْ اَعْبُدَ اللّٰهَ وَلَآ اُشْرِكَ بِهٖ ۗاِلَيْهِ اَدْعُوْا وَاِلَيْهِ مَاٰبِ ",
      "text_translation_en": "Hence, they unto whom We have vouchsafed this revelation rejoice at all that has been bestowed upon thee [O Prophet] from on high; but among the followers of other creeds there are such as deny the validity of some of it. Say [unto them, O Prophet]: \"I have only been bidden to worship God, and not to ascribe divine. powers to aught beside Him: unto Him do I call [all mankind], and He is my goal!\"",
      "juz_number": 13
    },
    "37": {
      "text_tafsir_en": "In this verse, Allah explains some of the key features of the Quran revealed to the Prophet Muhammad, that is, the Quran contains the right rules, which people must follow to achieve happiness and prosperity in the world and the hereafter. In addition, the Quran is revealed in Arabic, which is a language that has some privileges that other languages do not. Among the specialties of the Arabic language is that it was a growing language, long before the advent of Islam and its vocabulary was very rich. Arabic also has a method of word formation (morphology) that allows it to easily accommodate new concepts for new words formation. Thus, it is possible to understand the ability of the Arabic language to express the concepts of revelation. Because the Quran is Arabic, the Quran has preserved the Arabic language so that it is not lost like Suryani, Coptic, and so on. Since the Quran was translated into Arabic and became a miracle of the Prophet Muhammad as a scripture, then the translation of the Quran in foreign languages is not considered scripture either. As it is known, among the honors that the Quran has in its reading is considered worship, and cannot be touched except by the holy ones, those who are not in the big or small. Many verses mention the characteristics of the Qur'an, among other things, the saying of Allah swt: (The) will not be met by falsehood, either from the front or the back (from the past and the future), passed down from the All-wise, Thank you. (Fushshilat \/ 41: 42) Furthermore, Allah swt warned the Prophet Muhammad and the Muslims in general, not to comply with the desires and desires of those who disobey the Quran, in part or in part, because Allah has given true knowledge to them. they are the Quran of al-Karim. If the Prophet Muhammad and the Muslims were tempted and followed the wishes of those who disobeyed the Quran, then the punishment of Allah would be upon them and no one could be a protector against the punishment of Almighty Allah.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan beberapa ciri utama Al-Quran yang diwahyukan kepada Nabi Muhammad saw, yaitu Al-Quran berisi peraturan-peraturan yang benar, yang harus ditaati manusia untuk mencapai kebahagiaan dan keberuntungan di dunia dan akhirat kelak. Di samping itu, Al-Quran diturunkan dalam bahasa Arab, yaitu bahasa yang memiliki beberapa keistimewaan yang tidak dimiliki oleh bahasa lain.\n\nDi antara keistimewaan bahasa Arab ialah bahasa ini merupakan bahasa yang sudah berkembang, jauh sebelum datangnya Islam sehingga kosakatanya sangat kaya. Bahasa Arab juga memiliki kaedah pembentukan kata (morfologi) yang memungkinkannya bisa dengan mudah menampung konsep-konsep baru untuk pembentukan kata baru. Dengan demikian, dapat dipahami kemampuan bahasa Arab mengungkapkan konsep-konsep wahyu. Karena Al-Quran berbahasa Arab, maka Al-Quran telah melestarikan bahasa Arab sehingga tidak hilang seperti bahasa Suryani, Koptic, dan sebagainya.\n\nKarena Al-Quran diturunkan dalam bahasa Arab dan menjadi mukjizat Nabi Muhammad sebagai kitab suci, maka terjemahan Al-Quran dalam bahasa asing tidak dianggap sebagai kitab suci juga. Sebagaimana diketahui, di antara kehormatan yang dimiliki Al-Quran ialah membacanya dianggap sebagai ibadah, dan tidak boleh disentuh kecuali oleh orang-orang yang suci, yaitu orang-orang yang tidak berhadas besar maupun kecil.\n\nBanyak ayat yang menyebutkan ciri-ciri Al-Quran, antara lain firman Allah swt:\n\n(Yang) tidak akan didatangi oleh kebatilan, baik dari depan maupun dari belakang (pada masa lalu dan yang akan datang), yang diturunkan dari Tuhan Yang Maha Bijaksana, Maha Terpuji. (Fushshilat\/41: 42)\n\nSelanjutnya Allah swt memperingatkan Nabi Muhammad saw dan kaum Muslimin umumnya, agar jangan menuruti kehendak hawa nafsu dan keinginan orang-orang yang mengingkari Al-Quran, baik sebagian maupun keseluruhannya, karena Allah swt telah memberikan ilmu yang benar kepada mereka, yaitu Al-Quran al-Karim. Jika Nabi Muhammad dan kaum Muslimin sampai tergoda dan mengikuti kehendak orang-orang yang mengingkari Al-Quran itu, maka siksa Allah pasti akan menimpa mereka dan tidak seorangpun dapat menjadi pelindung terhadap siksa Allah swt Yang Mahakuasa.",
      "text_translation": "Dan demikianlah Kami telah menurunkannya (Al-Qur'an) sebagai peraturan (yang benar) dalam bahasa Arab. Sekiranya engkau mengikuti keinginan mereka setelah datang pengetahuan kepadamu, maka tidak ada yang melindungi dan yang menolong engkau dari (siksaan) Allah.",
      "text": "وَكَذٰلِكَ اَنْزَلْنٰهُ حُكْمًا عَرَبِيًّاۗ وَلَىِٕنِ اتَّبَعْتَ اَهْوَاۤءَهُمْ بَعْدَمَا جَاۤءَكَ مِنَ الْعِلْمِۙ مَا لَكَ مِنَ اللّٰهِ مِنْ وَّلِيٍّ وَّلَا وَاقٍ ࣖ ",
      "text_translation_en": "Thus, then, have We bestowed from on high this [divine writ] as an ordinance in the Arabic tongue. And, indeed, if thou shouldst defer to men's likes and dislikes after all the [divine] knowledge that has come unto thee, thou wouldst have none to protect thee from God, and none to shield thee [from Him].",
      "juz_number": 13
    },
    "38": {
      "text_tafsir_en": "In this verse Allah swt explains that He sent the apostles before the Prophet Muhammad and they were married and descended. This shows that family life and posterity is a natural thing and a prayer for His creatures living on this earth. This same rule applies to His prophets and apostles. Family life should not be considered a hindrance to the struggle, for the sake of personal, community, or national development. Even marriage according to Islamic teachings, in addition to aiming for posterity, also serves to provide peace, tranquility, and stability of life. Marriage also promotes peace between the families concerned and can serve as a means of Islamic preaching, as did the Messenger of Allah (may peace be upon him). Because family life is a normal thing and it is a circumcision, then man cannot resist it. Therefore, it is a mistake that some religious leaders feel that they should stay away from family life, so as not to interfere in religious practice. Singularity or tabattul life is something that is not known in Islam, and even strongly opposed. Marriage and children are the favor and grace of God to His servant. Therefore, marriages and families need to be properly maintained and maintained. In one history it is said that the Jews criticized the Prophet Muhammad because he had several wives. They say that if Muhammad were really a prophet and an apostle, he would be busy with his prophetic duties alone and would not care about women. They also demanded various proofs of his prophecy, besides the Quran as his miracle. Allah swt opposed them by asserting that Muhammad was not the first Messenger of God, but before that Allah sent some apostles and all were ordinary people in need of food, drink, family and posterity, and performed deeds performed by people, other people, walking in the market, and so on. In this regard, Allah swt ordered the Prophet Muhammad to affirm: Verily I am only a man like you, who has received revelation. (al-Kahf \/ 18: 110) Then, in this verse, the doctrine and ability of the apostles are to family and posterity. God affirmed that He gave them wives and offspring. In a hadith narrated by Imam al-Bukhari and Muslim Imam of Anas bin Malik it is said that the Prophet Muhammad saw: As for me, I fast and break, I pray at night, also sleep, I also eat meat and marry women; then whoever dislikes my sunah (my way of life) is not my people. (The History of al-Bukhari and Muslim) Even the verses or proofs of the prophecies and letters that the disbelievers demanded of the Prophet Muhammad are repeated repeatedly in the Quran, that the issue is God's authority alone. The apostles only showed their miracles by the permission of God. The greatest miracle of the Prophet Muhammad was the Quran that brought the teachings, laws, and regulations that lead mankind to the happiness of the world and the hereafter. The Qur'an is always preserved in its purity and not any creature can match it, either in its content or in the editorial of its power. The verses or the proofs and miracles do not appear simply, but should be in accordance with the wisdom of God and in accordance with the times. Each time it has its own characteristics that God has set. Every event that takes place in this world follows His conditions or destiny, whether in time, place, manner, or cause. Miracles will not appear before God's appointed time. The loss of one's life, sustenance, and events in the world and in the hereafter are in accordance with God's will. Man cannot ask for his end to come sooner or later than what God has decreed in his destiny.",
      "text_tafsir": "Dalam ayat ini Allah swt menjelaskan bahwa Dia telah mengutus rasul-rasul sebelum Nabi Muhammad saw dan mereka beristri dan berketurunan.\n\nHal ini menunjukkan bahwa kehidupan berkeluarga dan berketurunan adalah hal yang wajar dan merupakan sunatullah bagi makhluk-Nya yang hidup di muka bumi ini. Sunatullah ini juga berlaku bagi para nabi dan rasul-Nya. Hidup berkeluarga tidak boleh dianggap sebagai penghalang dalam perjuangan, baik demi kemajuan pribadi, masyarakat, maupun bangsa. Bahkan pernikahan menurut ajaran Islam, selain bertujuan untuk melanjut-kan keturunan, juga berfungsi memberikan ketenangan, ketenteraman, dan kestabilan hidup. Pernikahan juga mempererat silaturrahim antara keluarga-keluarga yang bersangkutan dan dapat menjadi sarana dakwah Islamiyah, sebagaimana yang dilakukan oleh Rasulullah saw.\n\nKarena hidup berkeluarga adalah suatu yang wajar dan merupakan sunatullah, maka manusia tidak boleh menentangnya. Oleh sebab itu, adalah keliru apabila ada pemimpin agama yang mempunyai anggapan bahwa mereka harus menjauhi hidup berkeluarga, agar tidak mengganggu dalam menjalankan agama. Sikap hidup membujang atau tabattul adalah hal-hal yang tidak dikenal dalam agama Islam, bahkan sangat ditentang. Perkawinan dan anak merupakan nikmat dan rahmat Allah kepada hamba-Nya. Oleh karena itu, perkawinan dan keluarga perlu dipelihara dan dilestarikan sebaik-baiknya.\n\nDalam satu riwayat disebutkan bahwa orang-orang Yahudi mencela Nabi Muhammad saw karena beliau mempunyai beberapa orang istri. Mereka mengatakan kalau benar-benar Muhammad adalah nabi dan rasul, tentu ia akan menyibukkan diri dengan tugas-tugas kenabiannya saja dan tidak akan mempedulikan perempuan. Mereka juga meminta bermacam-macam bukti tentang kenabiannya, selain Al-Quran yang menjadi mukjizatnya. Allah swt telah membantah mereka dengan menegaskan bahwa Nabi Muhammad bukanlah rasul Allah yang pertama, melainkan sebelum itu Allah swt telah mengutus beberapa rasul dan semuanya adalah manusia biasa yang membutuhkan makan, minum, berkeluarga dan berketurunan, serta melakukan perbuatan-perbuatan yang dilakukan oleh orang-orang lainnya, berjalan di pasar, dan sebagainya. Dalam hal ini, Allah swt memerintahkan kepada Nabi Muhammad saw untuk menegaskan:\n\nSesungguhnya aku ini hanya seorang manusia seperti kamu, yang telah menerima wahyu. (al-Kahf\/18: 110)\n\nKemudian, dalam ayat ini ditegaskan tentang kewajaran dan kebolehan para rasul itu hidup berkeluarga dan berketurunan. Allah menegaskan bahwa Dia mengaruniai mereka istri dan keturunan.\n\nDalam suatu hadis yang diriwayatkan oleh Imam al-Bukhari dan Imam Muslim dari Anas bin Malik disebutkan bahwa Nabi Muhammad saw bersabda:\n\nAdapun aku, aku berpuasa dan berbuka, aku salat di waktu malam, juga tidur, aku juga makan daging dan juga menikahi wanita; maka siapa yang tidak suka kepada sunahku (jalan kehidupanku) tiadalah ia termasuk umatku. (Riwayat al-Bukhari dan Muslim)\n\nAdapun ayat-ayat atau bukti-bukti kenabian dan kerasulan yang dituntut orang-orang kafir kepada Nabi Muhammad saw dijawab berulang kali dalam Al-Quran, bahwa masalah tersebut adalah wewenang Allah semata. Para rasul hanya memperlihatkan mukjizatnya dengan seizin Allah.\n\nMukjizat terbesar Nabi Muhammad saw adalah Al-Quran yang membawa ajaran-ajaran, hukum-hukum, dan peraturan-peraturan yang berperan menuntun manusia kepada kebahagiaan dunia dan akhirat. Al-Quran senantiasa terpelihara kemurniannya dan tidak satupun makhluk yang dapat menandinginya, baik dari sisi kandungannya maupun redaksi kebahasaannya.\n\nAyat-ayat atau bukti-bukti dan mukjizat tidak muncul begitu saja, melainkan harus sesuai dengan hikmah Allah dan selaras dengan masanya. Masing-masing masa tersebut mempunyai ciri tersendiri yang telah ditetapkan Allah. Setiap peristiwa yang terjadi di alam ini mengikuti ketentuan atau takdir-Nya, baik mengenai waktu, tempat, cara, maupun sebab-sebab terjadinya. Mukjizat tidak akan muncul sebelum waktu yang telah ditetapkan Allah. Ajal seseorang, rezeki, dan peristiwa-peristiwa yang dialami di dunia dan di akhirat terjadi sesuai dengan ketentuan Allah. Manusia tidak dapat meminta agar ajalnya datang lebih cepat ataupun lebih lambat dari apa yang telah ditetapkan Allah dalam takdir-Nya.",
      "text_translation": "Dan sungguh, Kami telah mengutus beberapa rasul sebelum engkau (Muhammad) dan Kami berikan kepada mereka istri-istri dan keturunan. Tidak ada hak bagi seorang rasul mendatangkan sesuatu bukti (mukjizat) melainkan dengan izin Allah. Untuk setiap masa ada Kitab (tertentu).",
      "text": "وَلَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِكَ وَجَعَلْنَا لَهُمْ اَزْوَاجًا وَّذُرِّيَّةً ۗوَمَا كَانَ لِرَسُوْلٍ اَنْ يَّأْتِيَ بِاٰيَةٍ اِلَّا بِاِذْنِ اللّٰهِ ۗلِكُلِّ اَجَلٍ كِتَابٌ ",
      "text_translation_en": "And, truly, We sent forth apostles before thee, and We appointed for them wives and offspring; and it was not given to any apostle to produce a miracle save at God's behest. Every age has had its revelation:",
      "juz_number": 13
    },
    "39": {
      "text_tafsir_en": "In this verse, Allah swt describes one side of His power, that is, to abolish or set whatever He pleases, whether it be His law or the fate of man. The signs of the removal and setting of God are the day and night that come with change, the dark and the light, the living and the dead, the strong and the weak, the healthy and the sick, the happy and the miserable, the rich and the poor, and so on. At the end of this verse, Allah swt explains that on His side or Far Mahfudh there is the Book of Ummul. All events and events occurring in this world are written in the Far Mahfudh which will not result in any change and replacement. According to this understanding, this verse is also a protest against the claims of unbelievers and unbelievers who ask the Prophet Muhammad to bring forth the verses or proofs of his prophecies and letters, besides the Quran. This will never happen, unless it is within the stipulations of Allah or is in the Far Mahfudh.",
      "text_tafsir": "Pada ayat ini, Allah swt menerangkan satu sisi dari kekuasaan-Nya, yaitu menghapuskan atau menetapkan apa-apa yang dikehendaki-Nya, baik mengenai syariat-Nya atau nasib manusia.\n\nTanda-tanda adanya penghapusan dan penetapan Allah, ialah adanya siang dan malam yang datang silih berganti, adanya gelap dan terang, hidup dan mati, kuat dan lemah, sehat dan sakit, bahagia dan sengsara, kaya dan miskin, dan sebagainya.\n\nPada akhir ayat ini, Allah swt menjelaskan bahwa di sisi-Nya atau Lauh Mahfudh terdapat Ummul Kitab. Semua peristiwa dan kejadian yang terjadi di alam ini tertulis di Lauh Mahfudh yang tidak akan mengalami perubahan dan penggantian apapun.\n\nBerdasarkan pengertian tersebut maka ayat ini juga merupakan bantahan terhadap tuntutan kaum kafir dan musyrik yang meminta kepada Nabi Muhammad saw untuk mendatangkan ayat-ayat atau bukti-bukti kenabian dan kerasulannya, selain Al-Quran. Hal tersebut tidak akan pernah terjadi, kecuali jika hal itu termasuk dalam ketentuan yang ditetapkan Allah atau telah ada dalam Lauh Mahfudh.",
      "text_translation": "Allah menghapus dan menetapkan apa yang Dia kehendaki. Dan di sisi-Nya terdapat Ummul-Kitab (Lauh Mahfuzh).",
      "text": "يَمْحُوا اللّٰهُ مَا يَشَاۤءُ وَيُثْبِتُ ۚوَعِنْدَهٗٓ اُمُّ الْكِتٰبِ ",
      "text_translation_en": "God annuls or confirms whatever He wills [of His earlier messages] -for with Him is the source of all revelation.",
      "juz_number": 13
    },
    "40": {
      "text_tafsir_en": "In this verse it is explained that it is possible for Allah to grant a long life to the Messenger of Allah, so that he could see the coming of the torment promised to the disbelievers. It is possible that Allah gave him a short life span so that the Prophet did not have the opportunity to witness the punishment he brought down. His Messenger's only task was to proclaim Islam to mankind. The question of whether they will accept or reject it is Allah's business. For those who refuse, the punishment of Allah will surely come, whether it be hastened or delayed, is God's authority.",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa ada kemungkinan Allah memberikan umur yang panjang kepada Rasulullah, sehingga beliau sempat melihat kedatangan azab yang telah dijanjikan kepada kaum kafir. Bisa juga Allah memberikan usia yang pendek sehingga Rasulullah tidak mendapat kesempatan untuk menyaksikan azab yang diturunkan-Nya itu. Tugas Rasul-Nya hanya mendakwahkan agama Islam kepada manusia. Adapun persoalan mereka mau menerima atau menolaknya adalah urusan Allah. Bagi yang menolak, azab Allah pasti akan datang, apakah disegerakan atau ditunda, adalah wewenang Allah.",
      "text_translation": "Dan sungguh jika Kami perlihatkan kepadamu (Muhammad) sebagian (siksaan) yang Kami ancamkan kepada mereka atau Kami wafatkan engkau, maka sesungguhnya tugasmu hanya menyampaikan saja, dan Kamilah yang memperhitungkan (amal mereka).",
      "text": "وَاِنْ مَّا نُرِيَنَّكَ بَعْضَ الَّذِيْ نَعِدُهُمْ اَوْ نَتَوَفَّيَنَّكَ فَاِنَّمَا عَلَيْكَ الْبَلٰغُ وَعَلَيْنَا الْحِسَابُ ",
      "text_translation_en": "BUT WHETHER We let thee see [in thy lifetime, O Prophet, the fulfilment of] some of what We have promised them, or whether We cause thee to die [before its fulfilment] - thy duty is no more than to deliver the message; and the reckoning is Ours.",
      "juz_number": 13
    },
    "41": {
      "text_tafsir_en": "In this verse, Allah swt shows another side of His power in inflicting punishment on the unbelievers, by reducing their area of land to a small extent. The reduction of their territory was probably due to the natural disaster that God sent to them, so that some of their territory became defective and uninhabitable; or because of war, so that their territories are dominated by other nations and they become desperate or expelled from their land. Further, in this verse the power of God is explained in deciding the law according to His wisdom and will, and the law which He has set will never be rejected or denied by anyone. At the end of this verse, it is pointed out that Allah is quick to count on the acts of His servants, so that those who believe and do good will receive good rewards, while those who disobey Him and do evil will surely receive His punishment and wrath. All the acts of His servants will not be spared from the calculation of God.",
      "text_tafsir": "Dalam ayat ini, Allah swt memperlihatkan pula sisi lain dari kekuasaan-Nya dalam menimpakan hukuman terhadap orang-orang kafir, yaitu dengan cara mengurangi luas daerah negeri mereka sedikit demi sedikit. Pengurangan daerah mereka itu, mungkin disebabkan bencana alam yang diturunkan Allah kepada mereka, sehingga sebagian dari daerah mereka menjadi rusak dan tidak dapat didiami lagi; atau karena terjadi peperangan, sehingga wilayah kekuasaannya dikuasai bangsa lain dan mereka menjadi terdesak atau diusir dari negeri mereka.\n\nSelanjutnya, dalam ayat ini dijelaskan kekuasaan Allah dalam hal menetapkan hukum menurut hikmah dan kehendak-Nya, dan hukum yang telah ditetapkan-Nya tidak akan dapat ditolak atau dibantah oleh siapapun juga.\n\nPada akhir ayat ini, ditegaskan bahwa Allah cepat sekali mengadakan perhitungan terhadap perbuatan hamba-Nya, sehingga mereka yang beriman dan berbuat kebajikan akan memperoleh ganjaran kebaikan, sedang mereka yang ingkar kepada-Nya dan berbuat kezaliman pasti mendapat siksa dan kemurkaan-Nya. Segala perbuatan hamba-Nya tidak akan luput dari perhitungan Allah.",
      "text_translation": "Dan apakah mereka tidak melihat bahwa Kami mendatangi daerah-daerah (orang yang ingkar kepada Allah), lalu Kami kurangi (daerah-daerah) itu (sedikit demi sedikit) dari tepi-tepinya? Dan Allah menetapkan hukum (menurut kehendak-Nya), tidak ada yang dapat menolak ketetapan-Nya; Dia Mahacepat perhitungan-Nya.",
      "text": "اَوَلَمْ يَرَوْا اَنَّا نَأْتِى الْاَرْضَ نَنْقُصُهَا مِنْ اَطْرَافِهَاۗ وَاللّٰهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهٖۗ وَهُوَ سَرِيْعُ الْحِسَابِ ",
      "text_translation_en": "Have, then, they [who deny the truth] never yet seen how We visit the earth [with Our punishment], gradually depriving it of all that is best thereon? For, [when] God judges, there is no power that could repel His judgment: and swift in reckoning is He!",
      "juz_number": 13
    },
    "42": {
      "text_tafsir_en": "God again explained the other side of His power, in the face of the deception committed by the unbelievers of Mecca against the Prophet and the Muslims. Allah explains that the infidels before the time of the Prophet had also deceived his apostles. But all their deceit is under the control of God and will not destroy his religion and his apostles. God always knows firsthand what each of His creatures does. From this it can be understood that if the deception of the unbelievers towards the apostles of Allah was under the rule of Allah, then the deception of the Meccans towards Muhammad and the Muslims were also under the control of Allah. Thus, the deception would not have succeeded in destroying the Prophet and the Muslims, and would not have prevented the spread of Islam. At the end of this verse, Allah asserts that unbelievers will surely know that those who are entitled to the last and eternal abodes of happiness are only those who believe and do good deeds.",
      "text_tafsir": "Allah kembali menjelaskan sisi lain dari kekuasaan-Nya, yaitu dalam menghadapi tipu daya yang dilakukan oleh kaum kafir Mekah terhadap Rasulullah dan kaum Muslimin. Allah menjelaskan bahwa orang-orang kafir sebelum masa Rasulullah juga telah melakukan tipu daya terhadap para rasul-Nya. Tetapi semua tipu daya mereka itu berada di bawah kekuasaan Allah sehingga tidak akan membinasakan agama dan rasul-Nya. Allah senantiasa mengetahui lebih dulu apa saja yang diperbuat oleh setiap makhluk-Nya.\n\nDari sini dapat dipahami bahwa jika tipu daya orang-orang kafir terhadap para rasul Allah sebelumnya berada di bawah kekuasaan Allah, tentulah tipu daya kaum kafir Mekah terhadap Nabi Muhammad dan kaum Muslimin juga berada di bawah kekuasaan Allah. Dengan demikian, tipu daya tersebut tidak akan berhasil membinasakan Rasulullah dan kaum Muslimin, dan tidak akan mampu menghalangi penyebaran agama Islam.\n\nPada akhir ayat ini, Allah menegaskan bahwa orang kafir pasti akan mengetahui kelak bahwa yang berhak untuk memperoleh tempat tinggal terakhir dan abadi yang penuh kenikmatan hanyalah mereka yang beriman dan beramal saleh.",
      "text_translation": "Dan sungguh, orang sebelum mereka (kafir Mekah) telah mengadakan tipu daya, tetapi semua tipu daya itu dalam kekuasaan Allah. Dia mengetahui apa yang diusahakan oleh setiap orang, dan orang yang ingkar kepada Tuhan akan mengetahui untuk siapa tempat kesudahan (yang baik).",
      "text": "وَقَدْ مَكَرَ الَّذِيْنَ مِنْ قَبْلِهِمْ فَلِلّٰهِ الْمَكْرُ جَمِيْعًا ۗيَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍۗ وَسَيَعْلَمُ الْكُفّٰرُ لِمَنْ عُقْبَى الدَّارِ ",
      "text_translation_en": "Now those who lived before these [sinners] did, too, devise many a blasphemy -but the most subtle devising is that of God, who knows what each human being deserves: and the deniers of the truth will [in time] come to know to whom the future belongs.",
      "juz_number": 13
    },
    "43": {
      "text_tafsir_en": "This verse shows the dialogue between the disbelievers of Mecca and the Messenger of Allah, in which they defied his letter by saying, \"You are not a messenger.\" In response to this disobedience, Allah ordered the Prophet Muhammad to respond by saying, \"Enough is Allah to witness the disputes that occur between us around my head. the truth of my heart. \" In line with Allah's assertion in the previous verse that the main task of Prophet Muhammad was to convey Islam to mankind. He did not have to worry about the disbelief of the unbelievers, for it was Allah who appointed and sent him to be an apostle. The scholars of the Bible chose to embrace Islam because they knew that in the Bible and the Torah that God revealed to Jesus and Moses there was a clear explanation of the coming of the last prophet and apostle, Muhammad. Therefore, they never denied his letter.",
      "text_tafsir": "Ayat ini menunjukkan dialog antara orang-orang kafir Mekah dan Rasulullah, di mana mereka mengingkari kerasulannya dengan mengatakan, \"Engkau bukanlah seorang yang dijadikan rasul.\" Untuk menghadapi pengingkaran mereka ini, Allah memerintahkan kepada Nabi Muhammad untuk menjawabnya dengan mengatakan, \"Cukuplah Allah menjadi saksi dalam pertikaian yang terjadi antara kita seputar kerasulanku. Orang-orang yang mempunyai ilmu tentang Al-Kitab dari kalanganmu yang telah masuk Islam dapat menjadi saksi tentang kebenaran kerasulanku.\"\n\nSesuai dengan penegasan Allah dalam ayat yang lalu bahwa tugas pokok Nabi Muhammad adalah menyampaikan agama Islam kepada manusia. Beliau tidak perlu gelisah menghadapi sikap ingkar dari kaum kafir tersebut, sebab Allahlah yang mengangkat dan mengutusnya menjadi rasul.\n\nPara ulama ahlul kitab memilih menganut agama Islam karena telah mengetahui bahwa dalam kitab Injil dan Taurat yang diwahyukan Allah kepada Nabi Isa dan Nabi Musa telah ada keterangan yang jelas tentang kedatangan nabi dan rasul terakhir, yaitu Muhammad saw. Oleh karena itu, mereka sama sekali tidak mengingkari kerasulan beliau.",
      "text_translation": " Dan orang-orang kafir berkata, “Engkau (Muhammad) bukanlah seorang Rasul.” Katakanlah, “Cukuplah Allah dan orang yang menguasai ilmu Al-Kitab menjadi saksi antara aku dan kamu.” ",
      "text": "وَيَقُوْلُ الَّذِيْنَ كَفَرُوْا لَسْتَ مُرْسَلًا ۗ قُلْ كَفٰى بِاللّٰهِ شَهِيْدًاۢ بَيْنِيْ وَبَيْنَكُمْۙ وَمَنْ عِنْدَهٗ عِلْمُ الْكِتٰبِ ࣖ ",
      "text_translation_en": "And [if] they who are bent on denying the truth say [unto thee, O Prophet], \"Thou hast not been sent [by God]\", say thou: \"None can bear witness between me and you as God does; and [none can bear witness as does] he who truly understands this divine writ.",
      "juz_number": 13
    }
  },
  "name": "الرّعد",
  "name_translation_en": "The Thunder",
  "name_translation": "Guruh",
  "name_latin": "Ar-Ra'd"
}