{
  "number": 19,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 98,
  "ayat": {
    "1": {
      "text_tafsir_en": "It has been explained in the beginning of Surah al-Baqarah that the beginning of Surahs beginning with hijaiyah letters such as Alif Lam Mim, Kaf Ha Ya 'Ain shad and so on include the verse \"Mutasyabihat\" which means that Allah only knows its purpose to serve as a reminder and increased attention to the Qur'an which contains a great deal of wisdom and secrets.",
      "text_tafsir": "Telah diterangkan dalam tafsir permulaan Surah al-Baqarah bahwa permulaan Surah-surah yang dimulai dengan huruf-huruf hijaiyah seperti Alif Lam Mim, Kaf Ha Ya 'Ain shad dan sebagainya termasuk ayat \"Mutasyabihat\" yang arti sesungguhnya hanya diketahui oleh Allah tujuannya agar jadi peringatan dan menambah perhatian tentang Al-Qur'an yang banyak mengandung hikmah dan rahasia yang mendalam.",
      "text_translation": "Kaf  Ha Ya ‘Ain Shad.",
      "text": "كۤهٰيٰعۤصۤ ۚ ",
      "text_translation_en": "Kaf. Ha. Ya. `Ayn. Sad.",
      "juz_number": 16
    },
    "2": {
      "text_tafsir_en": "This reading is an explanation of the grace of your Lord bestowed upon an old servant, the prophet Zechariah as he prayed for a righteous son. Zechariah came from the descendants of the Children of Israel who became prophets after Jonah led his people.",
      "text_tafsir": "Yang dibaca ini adalah penjelasan tentang rahmat Tuhanmu yang dilimpahkan kepada seorang hamba-Nya yang sudah tua, yaitu Nabi Zakaria a.s. ketika beliau berdoa supaya diberi seorang anak yang saleh. Nabi Zakaria berasal dari keturunan Bani Israil yang menjadi nabi setelah Nabi Yunus untuk memimpin kaumnya.",
      "text_translation": "Yang dibacakan ini adalah) penjelasan tentang rahmat Tuhanmu kepada hamba-Nya, Zakaria,",
      "text": "ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهٗ زَكَرِيَّا ۚ",
      "text_translation_en": "AN ACCOUNT of the grace which thy Sustainer bestowed upon His servant Zachariah:",
      "juz_number": 16
    },
    "3": {
      "text_tafsir_en": "That is when he prayed in a gentle voice again in his mihrab, to be given a posterity that would carry on the apostolic task. The prayer is deliberately spoken in a gentle and quiet voice, to feel more sincere and fulfilled. Then the Qur'an mentions how the prayer sounded. Pray that God commands all of us to pray with humility, with humility and with a gentle voice, not to shout, as it is said in the Word of God: Pray to your Lord with a humble and gentle voice. Really, He doesn't like people who cross the line. (al-A'raf \/ 7: 55)",
      "text_tafsir": "Yaitu tatkala beliau berdoa dengan suara lembut lagi menyendiri dalam mihrabnya, supaya diberi keturunan yang akan melanjutkan tugas kerasulan. Doanya itu sengaja diucapkan dengan suara yang lembut dan dalam keadaan sunyi, supaya terasa lebih ikhlas dan terkabul. Kemudian Al-Qur'an menyebutkan bagaimana bunyi doanya itu. Berdoa memang diperintahkan Allah kepada kita semua dengan tawadhu, yaitu rendah hati serta dengan suara yang lembut, tidak menjerit-jerit, seperti disebutkan dalam firman Allah:\n\nBerdoalah kepada Tuhanmu dengan rendah hati dan suara yang lembut. Sungguh, Dia tidak menyukai orang-orang yang melampaui batas. (al-A'raf\/7: 55)",
      "text_translation": " (yaitu) ketika dia berdoa kepada Tuhannya dengan suara yang lembut.",
      "text": "اِذْ نَادٰى رَبَّهٗ نِدَاۤءً خَفِيًّا ",
      "text_translation_en": "When he called out to his Sustainer in the secrecy of his heart,",
      "juz_number": 16
    },
    "4": {
      "text_tafsir_en": "The prophet Zacharias in his prayer interceded, \"My Lord, I do pray for this, for some reason I believe will open up your grace. First of all, I've reached a very old age of almost ninety years, my bones have weakened, and the weakness of the skeletal body has resulted in complete weakness throughout my body, and an old man like me is very deserving of love and pity. Second, my head is full of gray, so that anyone looking at me must have given me compassion and moved her heart to meet my request. Third, I have never been disappointed in praying to You, O Lord, ever since I was young, especially now that my weakness has been fully realized. \" Zechariah himself knew that if his prayer was answered, it would bring many improvements in the field of religion and society. Therefore he continued his prayer as mentioned in the following verse.",
      "text_tafsir": "Nabi Zakaria dalam doanya antara lain mengemukakan, \"Ya Tuhanku, sesungguhnya aku memohon terkabulnya doaku ini, karena beberapa sebab yang aku yakini akan membuka rahmat karunia-Mu. Pertama, aku telah mencapai usia yang sangat tua yaitu hampir sembilan puluh tahun, di mana aku sudah merasa tulang-tulangku sudah lemah, dan kelemahan kerangka badan itu mengakibatkan pula kelemahan yang menyeluruh dalam seluruh tubuhku, dan seorang yang sudah tua seperti aku ini, sangat pantas untuk disayangi dan dikasihani. Kedua, di kepalaku sudah penuh dengan uban, sehingga siapapun yang memandang kepadaku pasti menaruh belas kasihan dan tergerak hatinya untuk memenuhi permohonanku. Ketiga, aku selama ini belum pernah dikecewakan dalam berdoa kepada Engkau, Ya Tuhan, sejak aku masih muda, apalagi sekarang di mana kelemahanku telah nampak secara keseluruhan.\" \n\nNabi Zakaria sendiri mengetahui bahwa jika doanya dikabulkan, akan membawa banyak perbaikan dalam bidang agama dan kemasyarakatan. Karena itu beliau melanjutkan doanya seperti disebutkan pada ayat berikut ini.",
      "text_translation": "Dia (Zakaria) berkata, “Ya Tuhanku, sungguh tulangku telah lemah dan kepalaku telah dipenuhi uban, dan aku belum pernah kecewa dalam berdoa kepada-Mu, ya Tuhanku.",
      "text": "قَالَ رَبِّ اِنِّيْ وَهَنَ الْعَظْمُ مِنِّيْ وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَّلَمْ اَكُنْۢ بِدُعَاۤىِٕكَ رَبِّ شَقِيًّا ",
      "text_translation_en": "he prayed: \"O my Sustainer! Feeble have become my bones, and my head glistens with grey hair. But never yet, O my Lord, has my prayer unto Thee remained unanswered.",
      "juz_number": 16
    },
    "5": {
      "text_tafsir_en": "And indeed I am concerned about those who will govern and lead my people, because no one among them is trustworthy, therefore I ask for a son. Although my wife was barren and I was very old, this did not cause me to give up, believing in the wisdom and power of the Most High God. Despair is indeed forbidden by God, as in some of His words: \"And do not despair of the grace of God. Indeed, those who despair of the Mercy of Allah are but unbelievers.\" (Joseph \/ 12: 87) And the Word of God says: \"He (Abraham) said,\" There is no despair of the mercy of his Lord except the lost. \"(Al-hijr \/ 15: 56)",
      "text_tafsir": "Dan sesungguhnya aku khawatir terhadap orang-orang yang akan mengendalikan dan memimpin umatku, karena tidak ada seorang pun yang dapat dipercaya di antara mereka itu, oleh sebab itu aku mohon dianugerahi seorang anak. Walaupun istriku mandul dan aku sendiri telah sangat tua, tetapi hal ini tidak menyebabkan aku berputus asa, karena percaya atas kebijaksanaan dan kekuasaan Allah Yang Mahaagung. Berputus asa memang dilarang oleh Allah, seperti pada beberapa firman-Nya, yaitu:\n\n\"¦dan jangan kamu berputus asa dari rahmat Allah. Sesungguhnya yang berputus asa dari rahmat Allah, hanyalah orang-orang yang kafir.\" (Yusuf\/12: 87)\n\nDan firman Allah: \n\n\"Dia (Ibrahim) berkata, \"Tidak ada yang berputus asa dari rahmat Tuhan-nya, kecuali orang yang sesat.\" (al-hijr\/15: 56)",
      "text_translation": "Dan sungguh, aku khawatir terhadap kerabatku sepeninggalku, padahal istriku seorang yang mandul, maka anugerahilah aku seorang anak dari sisi-Mu,",
      "text": "وَاِنِّيْ خِفْتُ الْمَوَالِيَ مِنْ وَّرَاۤءِيْ وَكَانَتِ امْرَاَتِيْ عَاقِرًا فَهَبْ لِيْ مِنْ لَّدُنْكَ وَلِيًّا ۙ",
      "text_translation_en": "\"Now, behold, I am afraid of [what] my kinsfolk [will do] after I am gone, for my wife has always been barren. Bestow, then, upon me, out of Thy grace, the gift of a successor",
      "juz_number": 16
    },
    "6": {
      "text_tafsir_en": "This verse mentions the prayer of the Prophet Zechariah, O Lord, give me a descendant who will inherit me and inherit a family of Jacob and make him a worthy and obedient man, for having a noble and noble character, can be a god model by all its followers. Praying for the righteous and future generations to be leaders of those who fear God, as He says: And those who say, \"Our Lord, give us our spouse and our offspring as (our) consolation, and make us leaders of those who fear. \" (al-Furqan \/ 25: 74)",
      "text_tafsir": "Ayat ini menyebutkan isi doa Nabi Zakariya, Ya Tuhan, berikanlah kepadaku keturunan yang akan mewarisi aku dan mewarisi sebahagian keluarga Yakub dan jadikanlah ia seorang yang patut lagi taat dan diridai oleh-Mu, karena mempunyai akhlak dan budi yang luhur lagi mulia, dapat dijadikan suri tauladan oleh sekalian pengikutnya.\n\nDoa memohon keturunan yang saleh dan kelak menjadi pemimpin bagi orang yang bertakwa memang diperintahkan Allah, seperti pada firman-Nya:\n\nDan orang-orang yang berkata, \"Ya Tuhan kami, anugerahkanlah kepada kami pasangan kami dan keturunan kami sebagai penyenang hati (kami), dan jadikanlah kami pemimpin bagi orang-orang yang bertakwa.\" (al-Furqan\/25 :74)",
      "text_translation": "yang akan mewarisi aku dan mewarisi dari keluarga Yakub; dan jadikanlah dia, ya Tuhanku, seorang yang diridai.”",
      "text": "يَّرِثُنِيْ وَيَرِثُ مِنْ اٰلِ يَعْقُوْبَ وَاجْعَلْهُ رَبِّ رَضِيًّا ",
      "text_translation_en": "who will be my heir as well as an heir [to the dignity] of the House of Jacob; and make him, O my Sustainer, well-pleasing to Thee!\"",
      "juz_number": 16
    },
    "7": {
      "text_tafsir_en": "In this verse God tells us about his prayer of Zechariah and the naming of his son directly from God himself. God told Zacharias that Allah had indeed told him that his request for a son would be fulfilled, and that it had been prepared for his son if he was born to be called John and that name had never been given to anyone before him.",
      "text_tafsir": "Dalam ayat ini Allah memberitahukan tentang dikabulkannya doa Zakaria a.s. dan pemberian nama putranya langsung dari Allah sendiri. Allah berfirman kepada Zakaria, bahwa sesungguhnya Allah memberi kabar gembira kepadanya, bahwa permohonannya untuk dianugerahi seorang putra akan terkabul, dan telah disiapkan pula supaya anaknya itu jika lahir diberi nama Yahya dan nama itu belum pernah diberikan kepada seorang pun sebelum dia.",
      "text_translation": "(Allah berfirman), “Wahai Zakaria! Kami memberi kabar gembira kepadamu dengan seorang anak laki-laki namanya Yahya, yang Kami belum pernah memberikan nama seperti itu sebelumnya.”",
      "text": "يٰزَكَرِيَّآ اِنَّا نُبَشِّرُكَ بِغُلٰمِ ِۨاسْمُهٗ يَحْيٰىۙ لَمْ نَجْعَلْ لَّهٗ مِنْ قَبْلُ سَمِيًّا ",
      "text_translation_en": "[Thereupon the angels called out unto him: \"O Zachariah! We bring thee the glad tiding of [the birth of] a son whose name shall be John. [And God says,] `Never have We given this name to anyone before him.\"",
      "juz_number": 16
    },
    "8": {
      "text_tafsir_en": "Zechariah was told that he would have a son to ask God. The question arises not out of doubt about the power of God, but rather in explaining how, because he feels he is no longer able to have a son, and his wife is barren. Will he be treated like a young man with enough physical strength, or will his wife be restored to a young woman who can give birth to a child, or will he marry another barren woman? Because Zechariah was so pleased with the news of having a child, and so full of amazement at his methods, that he could not stand to ask his God. It is answered by the word of God in the following verse:",
      "text_tafsir": "Nabi Zakaria a.s. setelah diberitahu akan mempunyai seorang putra bertanya kepada Allah. Pertanyaan itu timbul bukan karena keragu-raguan tentang kekuasaan Allah, akan tetapi untuk mendapat penjelasan tentang caranya, karena beliau merasa sudah tidak mampu lagi untuk memiliki putra, dan istrinya mandul. Apakah beliau akan dijadikan seperti seorang pemuda lagi dengan kekuatan fisik yang cukup, atau istrinya akan dikembalikan menjadi seorang perempuan muda yang dapat melahirkan seorang anak, ataukah beliau harus kawin lagi dengan seorang perempuan lain yang tidak mandul? Karena Zakaria sangat gembira dengan berita akan mendapat seorang anak itu, dan beliau penuh dengan rasa keheranan tentang cara-cara pelaksanaannya, maka beliau tidak dapat menahan diri untuk menanyakan hal itu kepada Tuhannya. Maka dijawab dengan firman Allah pada ayat berikut ini:",
      "text_translation": "Dia (Zakaria) berkata, “Ya Tuhanku, bagaimana aku akan mempunyai anak, padahal istriku seorang yang mandul dan aku (sendiri) sesungguhnya sudah mencapai usia yang sangat tua?”",
      "text": "قَالَ رَبِّ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ وَّكَانَتِ امْرَاَتِيْ عَاقِرًا وَّقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا ",
      "text_translation_en": "[Zachariah] exclaimed: \"O my Sustainer! How can I have a son when my wife has always been barren and I have become utterly infirm through old age?\"",
      "juz_number": 16
    },
    "9": {
      "text_tafsir_en": "The verse explains that Zakariya will be awarded a son, even though he is very old and his wife is barren. That is easy for God. If God was able to create Adam from nothing at all and then came into existence, then creating a child from that which is Zakaria and his wife is easier for God. Some of the following words of God show that there is not the slightest difficulty for God to create everything he wants, including: Don't you know that God knows what is in heaven and on earth? Indeed, such is already contained in a Book (Lawh Mahfudz). Truly this is very easy for Allah. (al-hajj \/ 22: 70) And the word of God: And do they not pay attention to how Allah began the creation (the creature), then He repeated it (again). Indeed, such is easy for God. (al-'Ankabut \/ 29: 19)",
      "text_tafsir": "Ayat menjelaskan bahwa Zakariya akan dianugerahi seorang putra, walaupun ia sudah sangat tua dan istrinya mandul. Hal itu adalah mudah bagi Tuhan. Kalau Allah mampu menciptakan Adam dari yang tidak ada sama sekali kemudian menjadi ada, maka menciptakan seorang anak dari yang ada, yaitu Zakaria dan istrinya adalah lebih mudah bagi Allah. Beberapa firman Allah berikut ini menunjukkan bahwa tidak ada kesulitan sedikitpun bagi Allah untuk menciptakan segala yang dikehendaki-Nya antara lain yaitu :\n\nTidakkah engkau tahu bahwa Allah mengetahui apa yang di langit dan di bumi? Sungguh, yang demikian itu sudah terdapat dalam sebuah Kitab (Lauh Mahfudz). Sesungguhnya yang demikian itu sangat mudah bagi Allah. (al-hajj\/22: 70)\n\nDan firman Allah :\n\nDan apakah mereka tidak memperhatikan bagaimana Allah memulai penciptaan (makhluk), kemudian Dia mengulanginya (kembali). Sungguh, yang demikian itu mudah bagi Allah. (al-'Ankabut\/29: 19)",
      "text_translation": "(Allah) berfirman, “Demikianlah.” Tuhanmu berfirman, “Hal itu mudah bagi-Ku; sungguh, engkau telah Aku ciptakan sebelum itu, padahal (pada waktu itu) engkau belum berwujud sama sekali.”",
      "text": "قَالَ كَذٰلِكَۗ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٌ وَّقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْـًٔا ",
      "text_translation_en": "Answered [the angel]: \"Thus. it is; [but] thy 'Sustainer says, `This is easy for Me -even as I have created thee aforetime out of nothing.",
      "juz_number": 16
    },
    "10": {
      "text_tafsir_en": "Then Zechariah asked God again for a sign that his son would soon be born, so that his heart would grow calm and his gratitude deepened. He said, \"My Lord, give me a sign that will increase my peace of mind about the fulfillment of your promise.\" The same thing happened to Abraham as he was asked, \"Do you not believe that God has the power to raise the dead?\" He answered, \"I do believe, but I ask for more peace of mind.\" So it is in the word of God: And (remember) when Abraham said, \"My Lord, show me how thou hast raised the dead.\" Allah says, \"Do you not believe?\" He (Abraham) said, \"I do believe, but let my heart be at rest.\" He (Allah) said, \"Then take four birds, and chop them, and put them on each hill, and call them, that they may come to you immediately.\" Know that Allah is Mighty, Mighty. (al-Baqarah \/ 2: 260)",
      "text_tafsir": "Kemudian Nabi Zakaria memohon kembali kepada Allah supaya diberi tanda-tanda bahwa anaknya itu segera akan dilahirkan, agar hatinya tambah tenteram dan rasa syukurnya bertambah dalam. Beliau berkata, \"Ya Tuhanku, berilah aku suatu tanda yang dapat menambah ketenteraman hatiku tentang terlaksananya janji engkau itu.\" Hal seperti ini pernah terjadi pula pada Nabi Ibrahim a.s. ketika ditanya, \"Apakah engkau belum percaya bahwa Allah kuasa menghidupkan yang telah mati?\" Beliau menjawab, \"Sungguh aku percaya, akan tetapi aku bertanya supaya bertambah tenteram hatiku.\" Sebagaimana tersebut dalam firman Allah:\n\nDan (ingatlah) ketika Ibrahim berkata, \"Ya Tuhanku, perlihatkanlah kepadaku bagaimana Engkau menghidupkan orang mati.\" Allah berfirman, \"Belum percayakah engkau?\" Dia (Ibrahim) menjawab, \"Aku percaya, tetapi agar hatiku tenang (mantap).\" Dia (Allah) berfirman, \"Kalau begitu ambillah empat ekor burung, lalu cincanglah olehmu kemudian letakkan di atas masing-masing bukit satu bagian, kemudian panggillah mereka, niscaya mereka datang kepadamu dengan segera.\" Ketahuilah bahwa Allah Mahaperkasa, Mahabijaksana. (al-Baqarah\/2: 260)",
      "text_translation": "Dia (Zakaria) berkata, “Ya Tuhanku, berilah aku suatu tanda.” (Allah) berfirman, “Tandamu ialah engkau tidak dapat bercakap-cakap dengan manusia selama tiga malam, padahal engkau sehat.”",
      "text": "قَالَ رَبِّ اجْعَلْ لِّيْٓ اٰيَةً ۗقَالَ اٰيَتُكَ اَلَّا تُكَلِّمَ النَّاسَ ثَلٰثَ لَيَالٍ سَوِيًّا ",
      "text_translation_en": "[Zachariah] prayed: \"O my Sustainer! Appoint a sign for me!\" Said [the angel]: \"Thy sign shall be that for full three nights [and days] thou wilt not speak unto men.",
      "juz_number": 16
    },
    "11": {
      "text_tafsir_en": "Zechariah came out of the mihrab towards his people, who had been waiting for their customary prayers together at his place of worship in the morning and evening. They asked, \"What was the cause of his delay in opening the door of his mihrab?\" Then he warned them to glorify God out of ignorance and the accusation of having children and of every trait that was unworthy of God. They were told to pay their respects in the morning and evening.",
      "text_tafsir": "Nabi Zakaria a.s. keluar dari mihrab menuju kaumnya, yang sudah lama menunggu karena kebiasaan mereka ikut salat berjamaah bersama di tempat beribadatnya pada pagi dan petang hari. Mereka bertanya, \"Gerangan apa yang menyebabkan beliau terlambat membuka pintu mihrabnya.\" Lalu beliau memberi isyarat kepada mereka, supaya bertasbih mensucikan Allah dari kemusyrikan dan dari tuduhan mempunyai anak dan dari setiap sifat yang tidak layak bagi Allah. Mereka diperintahkan supaya banyak bertasbih di waktu pagi dan petang.",
      "text_translation": "Maka dia keluar dari mihrab menuju kaumnya, lalu dia memberi isyarat kepada mereka; bertasbihlah kamu pada waktu pagi dan petang.",
      "text": "فَخَرَجَ عَلٰى قَوْمِهٖ مِنَ الْمِحْرَابِ فَاَوْحٰٓى اِلَيْهِمْ اَنْ سَبِّحُوْا بُكْرَةً وَّعَشِيًّا ",
      "text_translation_en": "Thereupon he came out of the sanctuary unto his people and signified to them [by gestures]: \"Extol His limitless glory by day and by night!\"",
      "juz_number": 16
    },
    "12": {
      "text_tafsir_en": "God commanded John to take the Book of the Torah which was the greatest gift of God to the children of Israel with great care and earnestness and to practice it faithfully. Then God revealed the most admirable qualities of the Prophet John that all his followers should imitate. Among them, God had given him a profound wisdom and understanding of religion and a passion to practice all good deeds even when John was very young. It is reported that he was once surrounded by children and invited to play together, and he replied, \"We are created by God not to play around. Come join me in prayer.\"",
      "text_tafsir": "Allah memerintahkan kepada Yahya supaya mengambil kitab Taurat yang merupakan nikmat terbesar dari Allah kepada Bani Israil dengan penuh perhatian dan sungguh-sungguh dan mengamalkan isinya dengan tulus ikhlas. Kemudian Allah mengungkapkan sifat-sifat Nabi Yahya yang sangat terpuji yang patut ditiru oleh sekalian pengikutnya. Di antaranya, Allah telah memberikan kepadanya hikmah dan pengertian yang sangat mendalam tentang agama dan kegairahan untuk mengamalkan segala amal kebaikan walaupun ketika itu Yahya masih sangat muda. Diriwayatkan bahwa beliau pernah dikerumuni oleh anak-anak sebayanya dan diajak supaya main bersama-sama, lalu beliau menjawab, \"Kita ini diciptakan Tuhan bukan untuk bermain-main. Marilah ikut bersama saya salat.\"",
      "text_translation": " ”Wahai Yahya! Ambillah (pelajarilah) Kitab (Taurat) itu dengan sungguh-sungguh.” Dan Kami berikan hikmah kepadanya (Yahya) selagi dia masih kanak-kanak,",
      "text": "يٰيَحْيٰى خُذِ الْكِتٰبَ بِقُوَّةٍ ۗوَاٰتَيْنٰهُ الْحُكْمَ صَبِيًّاۙ ",
      "text_translation_en": "[And when the son was born and grew up, he was told,] \"O John! Hold fast unto the divine writ with [all thy] strength!\" - for We granted him wisdom \"while he was yet a little boy,",
      "juz_number": 16
    },
    "13": {
      "text_tafsir_en": "Allah made the Prophet John a compassionate fellow man especially the poor man as Allah made the Prophet Muhammad have the same feeling, as stated in the word of Allah: By the grace of Allah you (Muhammad) have been gentle towards them. (Ali 'Imran \/ 3: 159) And the saying of Allah: Indeed, there came to you an apostle of your own people, who was greatly afflicted by the sufferings which you suffered, (he) longing for you, faith and salvation, believers. . He was always in charge of carrying out the commands of Allah and avoiding his ban.",
      "text_tafsir": "Allah menjadikan Nabi Yahya itu seorang yang memiliki rasa belas kasihan kepada sesama manusia terutama fakir miskin sebagaimana Allah menjadikan Nabi Muhammad saw memiliki perasaan yang sama, seperti tercantum dalam firman Allah:\n\nMaka berkat rahmat Allah engkau (Muhammad) berlaku lemah lembut terhadap mereka. (Ali 'Imran\/3: 159)\n\nDan firman Allah:\n\nSungguh, telah datang kepadamu seorang rasul dari kaummu sendiri, berat terasa olehnya penderitaan yang kamu alami, (dia) sangat menginginkan (keimanan dan keselamatan) bagimu, penyantun dan penyayang terhadap orang-orang yang beriman. (at-Taubah\/9: 128)\n\nSifat Nabi Yahya juga bersih dari syirik dan selalu menjauhkan diri dari setiap perbuatan yang menyebabkan kemurkaan Allah. Beliau selalu bertakwa melaksanakan perintah Allah dan menjauhi larangannya.",
      "text_translation": "dan (Kami jadikan) rasa kasih sayang (kepada sesama) dari Kami dan bersih (dari dosa). Dan dia pun seorang yang bertakwa, ",
      "text": "وَّحَنَانًا مِّنْ لَّدُنَّا وَزَكٰوةً ۗوَكَانَ تَقِيًّا ۙ",
      "text_translation_en": "as well as, by Our grace, [the gift of] compassion and purity; and he was [always] conscious of Us",
      "juz_number": 16
    },
    "14": {
      "text_tafsir_en": "This verse explains the nature of the Prophet John who always served his parents, because they served him as a charity after worshiping God, according to his word: And your Lord commanded that ye should not worship except him, and that ye should do good to the fathers. (al-Isra \/ 17: 23) Among other things of the Prophet John was not arrogant towards other people, always humble, as he was commanded by the Prophet Muhammad in the word of Allah: And lower yourself against those who believe follow you. (asy-Syu'ara \/ 26: 215) And the word of Allah: If you are hard-hearted and harsh-hearted, they will certainly stay away from you. (Ali 'Imran \/ 3: 159) Because this arrogance is so bad that it causes Satan to be condemned for being arrogant, he does not want to bow down to Adam. The last of the praiseworthy qualities of the Prophet John was never against God's command.",
      "text_tafsir": "Ayat ini menjelaskan sifat Nabi Yahya yang selalu berbakti kepada kedua orang tuanya, karena berbakti kepada mereka itu dijadikan amal kebajikan setelah beribadah kepada Allah, sesuai dengan firman-Nya:\n\nDan Tuhanmu telah memerintahkan agar kamu jangan menyembah selain Dia dan hendaklah berbuat baik kepada ibu bapak.(al-Isra\/17: 23)\n\nDi antara sifat Nabi Yahya lainnya ialah tidak sombong terhadap manusia yang lain, selalu rendah hati, seperti sifat yang diperintahkan kepada Nabi Muhammad saw dalam firman Allah:\n\nDan rendahkanlah dirimu terhadap orang-orang yang beriman yang mengikutimu. (asy-Syu'ara\/26: 215)\n\nDan firman Allah:\n\nSekiranya engkau bersikap keras dan berhati kasar, tentulah mereka menjauhkan diri dari sekitarmu. (Ali 'Imran\/3: 159)\n\nOleh karena sifat sombong ini sangat buruk, sehingga menyebabkan Iblis dikutuk karena ia berlaku sombong, tidak mau sujud menghormati kepada Nabi Adam as, atas perintah Allah. Sifat yang terakhir di antara sifat Nabi Yahya yang terpuji adalah tidak pernah menentang perintah Allah.",
      "text_translation": " dan sangat berbakti kepada kedua orang tuanya, dan dia bukan orang yang sombong (bukan pula) orang yang durhaka.",
      "text": "وَّبَرًّاۢ بِوَالِدَيْهِ وَلَمْ يَكُنْ جَبَّارًا عَصِيًّا ",
      "text_translation_en": "and full of piety towards his parents; and never was he haughty or rebellious.",
      "juz_number": 16
    },
    "15": {
      "text_tafsir_en": "Allah explained the merit of the Prophet Yahya because of his obedience and piety, salvation, welfare for himself on the day he was born into the world, and on the day he died leaving this mortal world and on the day he was resurrected to live again on the Day of Resurrection. He mentioned these three events, because every human being in those three periods really needed God's grace and gift.",
      "text_tafsir": "Allah menerangkan pahala kebajikan Nabi Yahya itu karena ketaatan dan kesalehannya, keselamatan, kesejahteraan atas dirinya pada hari ia dilahirkan ke dunia, dan pada hari ia wafat meninggalkan dunia yang fana ini serta pada hari ia dibangkitkan hidup lagi pada hari Kiamat. Disebutkannya tiga peristiwa ini, karena setiap manusia pada ketiga masa itu sangat membutuhkan rahmat dan karunia Tuhan.",
      "text_translation": "Dan kesejahteraan bagi dirinya pada hari lahirnya, pada hari wafatnya, dan pada hari dia dibangkitkan hidup kembali.",
      "text": "وَسَلٰمٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوْتُ وَيَوْمَ يُبْعَثُ حَيًّا ࣖ",
      "text_translation_en": "Hence, [God's] peace was upon him on the day when he was born, and on the day of his death, and. will be [upon him] on the day when he shall be raised to life [again].",
      "juz_number": 16
    },
    "16": {
      "text_tafsir_en": "God instructed the Prophet Muhammad to tell the story of Mary described in the Qur'an when Mary the mother of Jesus moved her family away to a place east of Jerusalem to find solace in worshiping God. Mary wants to break free from the routine of daily living. In connection with this verse, Ibn Abbas said, \"Of all the people I know best why the Christians made their Qiblah in the East; it was according to the word of Allah that Mary comforted and distanced herself from her family somewhere in the East, and they make the birthplace of Jesus as a Qiblah. \"",
      "text_tafsir": "Allah memerintahkan Nabi Muhammad supaya menceritakan kisah Maryam yang diterangkan dalam Al-Qur'an ketika Maryam ibunda Nabi Isa menjauhkan diri dari keluarganya ke suatu tempat yang berada di sebelah timur Baitul Makdis untuk mendapatkan ketenangan dalam beribadat kepada Allah. Maryam ingin melepaskan diri dari rutinitas kegiatan hidup sehari-hari.\n\nSehubungan dengan ayat ini, Ibnu Abbas berkata, \"Di antara semua orang aku paling mengetahui tentang apa sebab kaum Nasrani menjadikan kiblat mereka ke arah Timur; yaitu sesuai dengan firman Allah bahwa Maryam menenangkan dan menjauhkan diri dari keluarganya ke suatu tempat di sebelah Timur, lalu mereka menjadikan tempat kelahiran Nabi Isa a.s. itu sebagai kiblat.\"",
      "text_translation": "Dan ceritakanlah (Muhammad) kisah Maryam di dalam Kitab (Al-Qur'an), (yaitu) ketika dia mengasingkan diri dari keluarganya ke suatu tempat di sebelah timur (Baitulmaqdis),",
      "text": "وَاذْكُرْ فِى الْكِتٰبِ مَرْيَمَۘ اِذِ انْتَبَذَتْ مِنْ اَهْلِهَا مَكَانًا شَرْقِيًّا ۙ",
      "text_translation_en": "AND CALL to mind, through this divine writ, Mary. Lo! She withdrew from her family to an eastern place",
      "juz_number": 16
    },
    "17": {
      "text_tafsir_en": "So Mary created a veil (wall) that protected her from the eyes of her family and other human beings. Then God sent the angel Gabriel to her as a handsome and handsome man to inform Mary that she would give birth to a fatherless son. And the wisdom of Gabriel came in human form so as not to cause fear in Mary.",
      "text_tafsir": "Maka Maryam membuat tabir (dinding) yang melindunginya dari pandangan keluarganya dan manusia lainnya. Kemudian Allah mengutus malaikat Jibril kepadanya dalam bentuk seorang laki-laki yang gagah dan rupawan untuk memberitahukan kepada Maryam bahwa ia akan melahirkan seorang putra tanpa ayah. Adapun hikmatnya kedatangan Jibril dalam bentuk manusia itu agar supaya tidak menimbulkan ketakutan pada diri Maryam.",
      "text_translation": "lalu dia memasang tabir (yang melindunginya) dari mereka; lalu Kami mengutus roh Kami (Jibril) kepadanya, maka dia menampakkan diri di hadapannya dalam bentuk manusia yang sempurna.",
      "text": "فَاتَّخَذَتْ مِنْ دُوْنِهِمْ حِجَابًاۗ فَاَرْسَلْنَآ اِلَيْهَا رُوْحَنَا فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا ",
      "text_translation_en": "and kept herself in seclusion from them, whereupon We sent unto her Our angel of revelation, who appeared to her in the shape of a well-made human being.",
      "juz_number": 16
    },
    "18": {
      "text_tafsir_en": "When Mary saw that there was a man in her estranged place, she sought refuge in Allah Ta'ala from evil that might arise and said, \"Verily I take refuge in you in the Merciful God; do not disturb me if you fear to him, for every one that is righteous shall always be far from evil.",
      "text_tafsir": "Tatkala Maryam melihat ada seorang laki-laki di tempatnya yang terasing itu, beliau berlindung kepada Allah Ta'ala dari kejahatan yang mungkin timbul seraya berkata, \"Sesungguhnya aku berlindung daripadamu kepada Tuhan Yang Maha Pemurah; jangan sekali-kali kamu mengganggu aku jika kamu bertakwa kepada-Nya, sebab setiap orang yang bertakwa itu selalu menjauhkan diri dari perbuatan maksiat.\"",
      "text_translation": "Dia (Maryam) berkata, “Sungguh, aku berlindung kepada Tuhan Yang Maha Pengasih terhadapmu, jika engkau orang yang bertakwa.”",
      "text": "قَالَتْ اِنِّيْٓ اَعُوْذُ بِالرَّحْمٰنِ مِنْكَ اِنْ كُنْتَ تَقِيًّا ",
      "text_translation_en": "She exclaimed: \"Verily, 'I seek refuge from thee with the Most Gracious! [Approach me not] if thou art conscious of Him!\"",
      "juz_number": 16
    },
    "19": {
      "text_tafsir_en": "To reassure Maryam and dispel her suspicion, Angel Gabriel said, \"I am only a messenger from your Lord to deliver news to you that a pure boy will be born from all kinds of taints.\" Angel Gabriel said that he himself would deliver the news about the boy, because he was instructed by Allah Ta'ala to blow the spirit into Mary's body.",
      "text_tafsir": "Untuk menenteramkan hati Maryam dan menghilangkan ke-curigaannya Malaikat Jibril berkata, \"Sesungguhnya aku ini hanyalah utusan dari Tuhanmu untuk menyampaikan berita kepadamu akan lahir seorang anak laki-laki yang suci dari segala macam noda.\" Malaikat Jibril menyebutkan bahwa dia sendiri yang akan menyampaikan berita tentang anak laki-laki itu, karena ia diperintahkan oleh Allah Ta'ala untuk meniupkan roh ke dalam tubuh Maryam.",
      "text_translation": "Dia (Jibril) berkata, “Sesungguhnya aku hanyalah utusan Tuhanmu, untuk menyampaikan anugerah kepadamu seorang anak laki-laki yang suci.”",
      "text": "قَالَ اِنَّمَآ اَنَا۠ رَسُوْلُ رَبِّكِۖ لِاَهَبَ لَكِ غُلٰمًا زَكِيًّا ",
      "text_translation_en": "[The angel] answered: \"I' am but a messenger of thy Sustainer, [who says,] `I shall bestow upon thee the gift of a son endowed with purity.'\"",
      "juz_number": 16
    },
    "20": {
      "text_tafsir_en": "Maryam was very surprised to hear the news and in a tone of astonishment she said, \"How will I get a boy when there has never been a man who touched me; and I am not an adulterer either.\"",
      "text_tafsir": "Maryam merasa sangat terkejut mendengar berita itu dan dengan nada keheranan ia berkata, \"Bagaimana aku akan mendapat seorang anak laki-laki padahal belum pernah ada seorang laki-laki pun yang menyentuhku; dan aku bukan pula seorang pezina.\"",
      "text_translation": "Dia (Maryam) berkata, “Bagaimana mungkin aku mempunyai anak laki-laki, padahal tidak pernah ada orang (laki-laki) yang menyentuhku dan aku bukan seorang pezina!”",
      "text": "قَالَتْ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ وَّلَمْ يَمْسَسْنِيْ بَشَرٌ وَّلَمْ اَكُ بَغِيًّا ",
      "text_translation_en": "Said she: \"How can I have a son when no man has ever touched me? - for, never have I been a loose woman!\"",
      "juz_number": 16
    },
    "21": {
      "text_tafsir_en": "Gabriel answered Mary's question by saying that Mary would have a son even if he was not married or had no relations with men; for it is the will of the Almighty, that it is easy for him. God made a son of Mary to be a proof to mankind of His power. The giving of a son to Mary is a mercy from God because in the future the boy will be a Prophet who calls to the way of happiness in this world and the hereafter. And that is the decision of God that cannot be changed. \"",
      "text_tafsir": "Jibril menjawab pertanyaan Maryam dengan mengatakan bahwa Maryam akan mendapat seorang anak laki-laki walaupun tidak bersuami ataupun tidak mengadakan hubungan dengan laki-laki; karena yang demikian itu adalah kehendak Allah Yang Mahakuasa dan yang demikian itu mudah bagi-Nya. Allah menjadikan seorang putra dari Maryam itu agar menjadi bukti bagi manusia atas kekuasaan-Nya. Pemberian putra kepada Maryam sebagai rahmat dari Allah karena kelak anak laki-laki itu akan menjadi seorang Nabi yang menyeru kepada jalan kebahagiaan dunia dan akhirat. Dan itu adalah keputusan Allah yang tidak dapat dirubah lagi.\"",
      "text_translation": "Dia (Jibril) berkata, “Demikianlah.” Tuhanmu berfirman, “Hal itu mudah bagi-Ku, dan agar Kami menjadikannya suatu tanda (kebesaran Allah) bagi manusia dan sebagai rahmat dari Kami; dan hal itu adalah suatu urusan yang (sudah) diputuskan.”",
      "text": "قَالَ كَذٰلِكِۚ قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٌۚ وَلِنَجْعَلَهٗٓ اٰيَةً لِّلنَّاسِ وَرَحْمَةً مِّنَّاۚ وَكَانَ اَمْرًا مَّقْضِيًّا ",
      "text_translation_en": "[The angel] answered: \"Thus it is; [but] thy Sustainer says, `This is easy for Me; and [thou shalt have a son,] so that We might make him a symbol unto mankind and an act of grace from US. And it was a thing decreed [by God]:",
      "juz_number": 16
    },
    "22": {
      "text_tafsir_en": "When Gabriel explained the meaning of his coming, Mary answered, \"I surrender to the decrees of God.\" Gabriel then poured the spirit of Jesus into Mary, causing Mary to become pregnant; and he withdrew himself into a place that was far from the crowd to avoid the accusation and reproach of the Children of Israel.",
      "text_tafsir": "Setelah Jibril menerangkan maksud kedatangannya itu, maka Maryam menjawab, \"Aku berserah diri kepada ketetapan Allah.\" Lalu Jibril meniupkan roh Nabi Isa ke Maryam sehingga mengakibatkan Maryam mengandung; lalu ia mengasingkan diri dengan kandungannya ke suatu tempat yang jauh dari orang banyak untuk menghindari tuduhan dan cemoohan dari Bani Israil.",
      "text_translation": " Maka dia (Maryam) mengandung, lalu dia mengasingkan diri dengan kandungannya itu ke tempat yang jauh.",
      "text": "۞ فَحَمَلَتْهُ فَانْتَبَذَتْ بِهٖ مَكَانًا قَصِيًّا ",
      "text_translation_en": "and in time she conceived him, and then she withdrew with him to a far-off place.",
      "juz_number": 16
    },
    "23": {
      "text_tafsir_en": "When Mary felt sick about giving birth to her child, she was forced to lean on the base of the date palm tree to facilitate the birth; with sadness he said, \"Oh dear, it would be nice if I had just died before this, and I became something that is not meaningful anymore forgotten.\" He hopes that if he dies before giving birth because he feels the weight of suffering due to giving birth to a child without a father that results in accusations and ridicule from his people who do not know the truth; or he hopes to be something meaningless in human sight, to be forgotten rather than suffer tremendous feelings of depression and shame.",
      "text_tafsir": "Ketika Maryam merasa sakit karena akan melahirkan anaknya, maka ia terpaksa bersandar pada pangkal pohon kurma untuk memudahkan kelahiran; dengan penuh kesedihan ia berkata, \"Aduhai, alangkah baiknya jika aku mati saja sebelum ini, dan aku menjadi sesuatu yang tidak berarti lagi dilupakan.\" Ia mengharapkan seandainya mati saja sebelum melahirkan karena merasa beratnya penderitaan akibat melahirkan seorang anak tanpa seorang ayah yang berakibat timbulnya tuduhan dan cemoohan dari kaumnya yang tidak mengetahui kejadian yang sebenarnya; atau beliau mengharapkan menjadi sesuatu benda yang tidak berarti dalam pandangan manusia, lagi dilupakan daripada menderita perasaan tertekan dan malu yang luar biasa.",
      "text_translation": "Kemudian rasa sakit akan melahirkan memaksanya (bersandar) pada pangkal pohon kurma, dia (Maryam) berkata, “Wahai, betapa (baiknya) aku mati sebelum ini, dan aku menjadi seorang yang tidak diperhatikan dan dilupakan.”",
      "text": "فَاَجَاۤءَهَا الْمَخَاضُ اِلٰى جِذْعِ النَّخْلَةِۚ قَالَتْ يٰلَيْتَنِيْ مِتُّ قَبْلَ هٰذَا وَكُنْتُ نَسْيًا مَّنْسِيًّا ",
      "text_translation_en": "And [when] the throes of childbirth drove her to the trunk of a palm-tree, she exclaimed: \"Oh, would that I had died ere this, and had become a thing forgotten, utterly forgotten!\"",
      "juz_number": 16
    },
    "24": {
      "text_tafsir_en": "Then Gabriel came and called out from a low place, \"Do not be grieved, for your Lord has indeed raised a brook under you.\" This was a blessing to Mary because at first it was dry without running water, but then there was a clean stream.",
      "text_tafsir": "Maka datanglah Jibril dan berseru dari suatu tempat yang rendah, \"Janganlah kamu bersedih hati, karena sesungguhnya Tuhanmu telah mengalirkan sebuah anak sungai di bawahmu.\" Ini merupakan suatu rahmat bagi Maryam karena di tempat itu pada mulanya kering tidak ada air yang mengalir, tetapi kemudian terdapat aliran air yang bersih.",
      "text_translation": "Maka dia (Jibril) berseru kepadanya dari tempat yang rendah, “Janganlah engkau bersedih hati, sesungguhnya Tuhanmu telah menjadikan anak sungai di bawahmu.",
      "text": "فَنَادٰىهَا مِنْ تَحْتِهَآ اَلَّا تَحْزَنِيْ قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا ",
      "text_translation_en": "Thereupon [a voice] called out to her from beneath that [palm-tree]: \"Grieve not! Thy Sustainer has provided a rivulet [running] beneath thee;",
      "juz_number": 16
    },
    "25": {
      "text_tafsir_en": "Gabriel then told Mary to shake the palm tree and later the tree would drop the fruit that had been cooked on it. And this is another grace for Mary because at first the palm tree dried up, with God's will being green and fertile and bearing fruit as a sustenance for Mary.",
      "text_tafsir": "Jibril kemudian menyuruh Maryam untuk menggoyang pohon kurma dan nanti pohon itu akan menjatuhkan buah kurma yang telah masak kepadanya. Dan ini adalah rahmat yang lain untuk Maryam karena pada mulanya pohon kurma itu telah kering, dengan kehendak Allah menjadi hijau dan subur kembali serta berbuah sebagai rezeki untuk Maryam.",
      "text_translation": "Dan goyanglah pangkal pohon kurma itu ke arahmu, niscaya (pohon) itu akan menggugurkan buah kurma yang masak kepadamu.",
      "text": "وَهُزِّيْٓ اِلَيْكِ بِجِذْعِ النَّخْلَةِ تُسٰقِطْ عَلَيْكِ رُطَبًا جَنِيًّا ۖ",
      "text_translation_en": "and shake the trunk of the palm-tree towards thee: it will drop fresh, ripe dates upon thee.",
      "juz_number": 16
    },
    "26": {
      "text_tafsir_en": "Then Gabriel told Mary to eat, drink and be happy for her sustenance and to remove her sadness because God had the power to cleanse her from all unreasonable accusations, so Mary was considered a pure woman who was never tempted. If you see a man who asks his own question and his son's question, then signify to him, \"Verily I have sworn upon myself to fast for the Beneficent God, and I will not speak to any man this day, for My words may be rejected and not trusted.",
      "text_tafsir": "Maka Jibril menyuruh Maryam supaya makan, minum dan ber-senang hati karena mendapat rezeki itu dan menghilangkan kesedihan hatinya karena Allah berkuasa untuk membersihkannya dari segala tuduhan yang tidak pantas, sehingga Maryam tetap dianggap sebagai wanita yang suci tidak pernah ternoda. Jika kamu melihat seorang manusia yang bertanya tentang persoalannya dan persoalan anaknya, maka isyaratkanlah kepadanya, \"Sesungguhnya aku telah bernazar atas diriku untuk berpuasa semata-mata untuk Tuhan Yang Maha Pemurah, dan aku tidak akan berbicara langsung dengan seorang manusia pun pada hari ini, karena ucapanku itu mungkin ditolak dan tidak dipercayai.",
      "text_translation": "Maka makan, minum dan bersenanghatilah engkau. Jika engkau melihat seseorang, maka katakanlah, “Sesungguhnya aku telah bernazar berpuasa untuk Tuhan Yang Maha Pengasih, maka aku tidak akan berbicara dengan siapa pun pada hari ini.”",
      "text": "فَكُلِيْ وَاشْرَبِيْ وَقَرِّيْ عَيْنًا ۚفَاِمَّا تَرَيِنَّ مِنَ الْبَشَرِ اَحَدًاۙ فَقُوْلِيْٓ اِنِّيْ نَذَرْتُ لِلرَّحْمٰنِ صَوْمًا فَلَنْ اُكَلِّمَ الْيَوْمَ اِنْسِيًّا ۚ",
      "text_translation_en": "Eat, then, and drink, and let thine eye be gladdened! And if thou shouldst see any human being, convey this unto him: `Behold, abstinence from speech have I vowed unto the Most Gracious; hence, I may not speak today to any mortal.",
      "juz_number": 16
    },
    "27": {
      "text_tafsir_en": "After Mary was commanded to fast on the day of her son's birth and did not speak to anyone and after the assurance of God that her honor should be preserved; Mary gave her whole fortune to the rule of God, and Mary carried her son and brought her to her people, causing her people to despise her and say, \"Mary, you have done a very evil thing.\"",
      "text_tafsir": "Setelah Maryam diperintahkan untuk berpuasa pada hari melahirkan putranya dan tidak berbicara dengan seorang pun dan setelah ada jaminan dari Allah bahwa kehormatannya tetap terpelihara; maka Maryam menyerahkan seluruh nasibnya pada ketetapan Allah, Maryam menggendong anaknya dan membawanya kepada kaumnya, hal itu menyebabkan kaumnya mencela perbuatannya seraya berkata, \"Hai Maryam, sesungguhnya kamu telah melakukan sesuatu perbuatan yang amat mungkar.\"",
      "text_translation": "Kemudian dia (Maryam) membawa dia (bayi itu) kepada kaumnya dengan menggendongnya. Mereka (kaumnya) berkata, “Wahai Maryam! Sungguh, engkau telah membawa sesuatu yang sangat mungkar.",
      "text": "فَاَتَتْ بِهٖ قَوْمَهَا تَحْمِلُهٗ ۗقَالُوْا يٰمَرْيَمُ لَقَدْ جِئْتِ شَيْـًٔا فَرِيًّا ",
      "text_translation_en": "And in time she returned to her people, carrying the child with her. They said: \"O Mary! Thou hast indeed done an amazing thing!",
      "juz_number": 16
    },
    "28": {
      "text_tafsir_en": "Then they added ridicule and ridicule and accusations to Mary, saying, \"Aaron's sister, your father was never a bad man and your mother was never a bad woman. How did you get this child?\" Mary was called \"Aaron's sister\", since it was customary for the Children of Israel to mention the names of the prophets and the pious before them. Al-Mugirah bin Shu'ah sent by the Messenger of Allah (may peace be upon him) to Najran in Yemen where there were Christians and they asked him, \"Why are you reading in the Qur'an,\" Aaron's sister, \"when Aaron and Moses lived long before the birth of Jesus the son of Mary?\" al-Mugirah was unable to provide an answer and when he returned to Medinah and confronted the Messenger of Allah he asked the question. The Messenger of Allah (may peace be upon him) replied: \"Why do you not tell them that it is their custom to call out the names of the prophets and the righteous before them?\" (Ahmad's History",
      "text_tafsir": "Kemudian mereka menambah celaan dan cemoohan serta tuduhan kepada Maryam seraya berkata, \"Hai saudara perempuan Harun, ayahmu sekali-kali bukanlah seorang yang jahat dan ibumu sekali-kali bukanlah seorang wanita tuna susila. Bagaimana kamu sampai mendapatkan anak ini.\" Maryam dipanggil dengan sebutan \"Saudara perempuan Harun\", oleh karena telah menjadi kebiasaan Bani Israil untuk menyebutkan nama-nama para nabi dan orang-orang saleh sebelumnya.\n\nDiriwayatkan oleh al-Mugirah bin Syu'bah yang diutus oleh Rasulullah saw, ke Najran di negeri Yaman di mana terdapat orang-orang Nasrani dan mereka bertanya kepadanya, \"Mengapa kamu membaca di dalam Al-Qur'an, \"hai saudara perempuan Harun,\" padahal Harun dan Musa itu hidupnya lama sekali sebelum lahirnya Isa putra Maryam?\" al-Mugirah tidak sempat memberikan jawaban dan ketika beliau pulang ke Medinah dan menghadap Rasulullah beliau mengemukakan pertanyaan itu. Oleh Rasulullah saw dijawab: \n\n\"Mengapa kamu tidak memberitahu mereka, bahwa kebiasaan mereka (Bani Israil) itu suka menyebut-nyebut nama para nabi dan orang-orang saleh sebelum mereka.\" (Riwayat Ahmad)",
      "text_translation": "Wahai saudara perempuan Harun (Maryam)! Ayahmu bukan seorang yang buruk perangai dan ibumu bukan seorang perempuan pezina.”",
      "text": "يٰٓاُخْتَ هٰرُوْنَ مَا كَانَ اَبُوْكِ امْرَاَ سَوْءٍ وَّمَا كَانَتْ اُمُّكِ بَغِيًّا ۖ",
      "text_translation_en": "O sister of Aaron! Thy father was not a wicked man, nor was thy mother a loose woman!\"",
      "juz_number": 16
    },
    "29": {
      "text_tafsir_en": "Maryam pointed to her son to talk and explain about his situation, because Mary had vowed not to talk to anyone and was sure that his son understood the sign. The Jews asked in amazement, \"How are we going to talk to a baby who is still in a sling?\" They suspect that Mary made fun of them.",
      "text_tafsir": "Maryam menunjuk kepada putranya supaya berbicara dan menjelaskan tentang keadaannya, karena Maryam sudah bernazar untuk tidak berbicara dengan siapa pun dan sudah merasa yakin bahwa anaknya mengerti isyarat itu. Orang-orang Yahudi bertanya dengan keheranan, \"Bagaimana kami akan berbicara dengan seorang bayi yang masih di dalam gendongan?\" Mereka menduga bahwa Maryam memperolok-olok mereka.",
      "text_translation": "Maka dia (Maryam) menunjuk kepada (anak)nya. Mereka berkata, “Bagaimana kami akan berbicara dengan anak kecil yang masih dalam ayunan?” ",
      "text": "فَاَشَارَتْ اِلَيْهِۗ قَالُوْا كَيْفَ نُكَلِّمُ مَنْ كَانَ فِى الْمَهْدِ صَبِيًّا ",
      "text_translation_en": "Thereupon she pointed to him. They exclaimed: \"How can we talk to one who [as yet] is a little boy in the cradle?\"",
      "juz_number": 16
    },
    "30": {
      "text_tafsir_en": "'Isa (as) who was still in his mother's arms then said, \"Verily, I am a servant of Allah, He will give me the Gospel and he will make me a Prophet.\" This saying contains an explanation that his mother was a holy woman because a Prophet must be of the offspring of a pious and holy person.",
      "text_tafsir": "Isa a.s. yang masih dalam gendongan ibunya kemudian berkata, \"Sesungguhnya aku ini hamba Allah, Dia yang akan memberikan aku kitab suci Injil dan Dia yang akan menjadikan aku seorang Nabi.\" Ucapan ini mengandung penjelasan bahwa ibunya adalah seorang wanita yang suci karena seorang Nabi harus dari keturunan orang yang saleh dan suci.",
      "text_translation": "Dia (Isa) berkata, “Sesungguhnya aku hamba Allah, Dia memberiku Kitab (Injil) dan Dia menjadikan aku seorang Nabi.",
      "text": "قَالَ اِنِّيْ عَبْدُ اللّٰهِ ۗاٰتٰنِيَ الْكِتٰبَ وَجَعَلَنِيْ نَبِيًّا ۙ",
      "text_translation_en": "[But] he said: \"Behold, I am a servant of God. He has vouchsafed unto me revelation and made me a prophet,",
      "juz_number": 16
    },
    "31": {
      "text_tafsir_en": "Furthermore, little Isa said, God will make me a blessed person wherever I am, because I benefit people and guide them to the path of happiness; Allah has commanded me to establish prayers because in establishing prayers it contains the act of cleansing myself from various kinds of physical and mental sins, Allah also commands me to pay zakat while I live in the world. Zakat aims to cleanse property, lives and provide assistance to the poor.",
      "text_tafsir": "Selanjutnya Isa kecil mengatakan, Allah akan menjadikan aku seorang yang diberkati di mana saja aku berada, karena aku memberi manfaat kepada manusia dan memberi petunjuk kepada mereka ke jalan kebahagiaan; Allah telah memerintahkan aku untuk mendirikan salat karena dalam mendirikan salat itu terkandung perbuatan membersihkan diri dari berbagai macam dosa lahir dan batin, Allah juga memerintahkan aku untuk menunaikan zakat selama aku hidup di dunia. Zakat bertujuan untuk membersihkan harta, jiwa dan memberi bantuan kepada fakir miskin.",
      "text_translation": "Dan Dia menjadikan aku seorang yang diberkahi di mana saja aku berada, dan Dia memerintahkan kepadaku (melaksanakan) salat dan (menunaikan) zakat selama aku hidup;",
      "text": "وَّجَعَلَنِيْ مُبٰرَكًا اَيْنَ مَا كُنْتُۖ وَاَوْصٰنِيْ بِالصَّلٰوةِ وَالزَّكٰوةِ مَا دُمْتُ حَيًّا ۖ",
      "text_translation_en": "and made me blessed wherever I may be; and He has enjoined upon me prayer and charity as long as I live,",
      "juz_number": 16
    },
    "32": {
      "text_tafsir_en": "The baby Jesus explained further that God commanded him to serve his mother, to be submissive and to always do good to her. These words also indicate Mary's purity, because otherwise Jesus would not have been commanded to serve her mother. Next statement Jesus says, \"God does not make me proud because I obey God and do not make me miserable because I always do good to my mother.\"",
      "text_tafsir": "Isa yang masih bayi menjelaskan lebih lanjut, bahwa Allah memerintahkan kepadanya supaya berbakti kepada ibunya, tunduk dan selalu berbuat kebaikan kepadanya. Ucapan ini menunjukkan pula kesucian Maryam, karena apabila tidak demikian maka Nabi Isa tidak akan diperintah untuk berbakti kepada ibunya. Keterangan selanjutnya Isa mengatakan, \"Allah tidak menjadikan aku seorang yang sombong karena aku selalu taat menyembah Allah dan tidak pula menjadikan aku seorang yang celaka karena aku selalu berbuat baik kepada ibuku.\"",
      "text_translation": "dan berbakti kepada ibuku, dan Dia tidak menjadikan aku seorang yang sombong lagi celaka.",
      "text": "وَّبَرًّاۢ بِوَالِدَتِيْ وَلَمْ يَجْعَلْنِيْ جَبَّارًا شَقِيًّا ",
      "text_translation_en": "and [has endowed me with] piety towards my mother; and He has not made me haughty or bereft of grace.",
      "juz_number": 16
    },
    "33": {
      "text_tafsir_en": "Jesus next prayed, May peace and safety be given him in three events: the day he was born, the day he died and the day he was raised to life on the Day of Resurrection. So no one can harm him in these three events which are the most difficult and critical events of every servant of God living in the world. Jews and Christians have denied that Jesus ever spoke when he was a baby and was still in his arms. They point out that if this really happened, the news would be widely circulated among the public, because it is a very strange and very interesting event. They have searched everywhere and have not found the evidence in their books. For Muslims this event remains a conviction because it is in the Qur'an which is certainly true in the case of Jesus as he did not speak his childhood and purge his mother of all the dirty accusations that the Jews would inflict upon Maryam, most likely that those who witnessed the baby's speech were only a few in number so that they were not widely dispersed.",
      "text_tafsir": "Selanjutnya Isa berdoa, Semoga kesejahteraan dan keselamatan dilimpahkan kepadanya pada tiga peristiwa yaitu pada hari ia dilahirkan, pada hari ia wafat dan pada hari ia dibangkitkan hidup kembali pada hari Kiamat. Maka tidak ada seorang pun yang dapat memberi mudarat kepadanya dalam tiga peristiwa ini yang merupakan peristiwa-peristiwa paling sulit dan kritis bagi setiap hamba Allah yang hidup di dunia. \n\nOrang-orang Yahudi dan Nasrani mengingkari bahwa Isa a.s. pernah berbicara ketika masih bayi dan masih dalam gendongan. Mereka mengemukakan bahwa seandainya hal ini betul-betul terjadi tentu beritanya tersebar luas di kalangan masyarakat ramai, karena peristiwa itu merupakan hal yang sangat aneh dan sangat menarik perhatian. Mereka telah mengadakan penyelidikan ke mana-mana dan tidak menjumpai keterangan itu dalam kitab-kitabnya. \n\nBagi kaum Muslimin peristiwa ini tetap menjadi suatu keyakinan karena tersebut di dalam Al-Qur'an yang pasti kebenarannya karena seandainya Isa a.s., tidak berbicara waktu kecilnya dan membersihkan ibunya dari segala tuduhan yang kotor tentu orang Yahudi akan melaksanakan hukuman rajam kepada Maryam, besar kemungkinan bahwa yang menyaksikan ucapan bayi itu beberapa orang saja yang jumlahnya terbatas sehingga tidak sampai tersebar luas di kalangan mereka.",
      "text_translation": " Dan kesejahteraan semoga dilimpahkan kepadaku, pada hari kelahiranku, pada hari wafatku, dan pada hari aku dibangkitkan hidup kembali.”",
      "text": "وَالسَّلٰمُ عَلَيَّ يَوْمَ وُلِدْتُّ وَيَوْمَ اَمُوْتُ وَيَوْمَ اُبْعَثُ حَيًّا ",
      "text_translation_en": "\"Hence, peace was upon me on the day when I was born, and [will be upon me] on the day of my death, and on the day when I shall be raised to life [again]!\"",
      "juz_number": 16
    },
    "34": {
      "text_tafsir_en": "In this verse God emphasizes that Jesus is a servant of God who will become a prophet and will be revealed to him the Bible, whose virtues and virtues are not what his people claim, not adultery and not the children of God as spoken and believed by his people in the future. What he said when he was a baby in the drum was the truth and could not be doubted, though his people still doubted those words and accused him of being a witch. He is not a sorcerer as the Jews say, not a son of God as declared by the Christians nor God as the other groups say. He is a servant of God who will be appointed prophet and apostle.",
      "text_tafsir": "Pada ayat ini Allah menegaskan bahwa Isa adalah seorang hamba Allah yang akan menjadi nabi dan akan diturunkan kepadanya Al-Kitab, yang mempunyai sifat-sifat dan akhlak yang mulia bukan sebagaimana yang dituduhkan oleh kaumnya, bukan anak zina dan bukan pula anak Allah sebagaimana yang diucapkan dan dipercayai oleh kaumnya di belakang hari. Apa yang diucapkannya sewaktu ia masih bayi dalam gendongan itulah ucapan yang benar dan tak dapat diragukan lagi meskipun kaumnya masih meragukan ucapan-ucapan itu dan menuduhnya sebagai tukang sihir. Dia bukan tukang sihir sebagaimana dikatakan orang Yahudi, bukan putra Allah sebagaimana didakwahkan oleh kaum Nasrani dan bukan pula Tuhan sebagaimana dikatakan golongan yang lain. Dia adalah hamba Allah yang akan diangkat menjadi nabi dan rasul.",
      "text_translation": "Itulah Isa putra Maryam, (yang mengatakan) perkataan yang benar, yang mereka ragukan kebenarannya.",
      "text": "ذٰلِكَ عِيْسَى ابْنُ مَرْيَمَ ۚقَوْلَ الْحَقِّ الَّذِيْ فِيْهِ يَمْتَرُوْنَ ",
      "text_translation_en": "SUCH WAS, in the words of truth, Jesus the son of Mary, about whose nature they so deeply disagree.",
      "juz_number": 16
    },
    "35": {
      "text_tafsir_en": "In this verse Allah reaffirms that Jesus is not a child of God. It is not natural and impossible for God to have children because God does not need offspring like humans who in their old age desperately needed help and care and needed someone who would continue and maintain the results of his efforts or make his name worthy after he died. God does not need all that because He is almighty, always standing alone does not need the help of others as stated in His word: God, there is no god but Him. The Almighty, Who continuously takes care of (His creatures). (Ali 'Imran \/ 3: 2) Glory to Allah from all qualities of inadequacy and from all the accusations made by the infidels. If He wants to create something, it is sufficient that He says \"Kun\" (be) then he creates. For him it is not difficult to create a child without a father or create a human being without a mother and father like creating Adam and Allah said: Surely the parable (creation) of Jesus is for God, like Adam's (creation). He created it from the ground, then He said to him, \"Be!\" Then be something. (Ali 'Imran \/ 3: 59) Allah is infallible and so great is his power that it is impossible to need a child because it shows weaknesses and deficiencies.",
      "text_tafsir": "Pada ayat ini Allah menegaskan kembali bahwa Isa itu bukan anak Allah. Tidak wajar dan tidak mungkin Allah mempunyai anak karena Allah tidak memerlukan keturunan seperti manusia yang di masa tuanya sangat membutuhkan pertolongan dan perawatan dan membutuhkan orang yang akan melanjutkan dan memelihara hasil usahanya atau mengharumkan namanya sesudah ia meninggal. Allah tidak memerlukan semua itu karena Dia Mahakuasa, senantiasa berdiri sendiri tidak membutuhkan bantuan orang lain sebagaimana tersebut dalam firman-Nya:\n\nAllah, tidak ada tuhan selain Dia. Yang Mahahidup, Yang terus menerus mengurus (makhluk-Nya). (Ali 'Imran\/3: 2)\n\nMahasuci Allah dari segala sifat kekurangan dan dari segala tuduhan yang diucapkan oleh kaum kafir. Apabila Dia hendak menciptakan sesuatu, cukuplah Dia menfirmankan \"Kun\" (jadilah) maka terciptalah dia. Baginya tidak sulit untuk menciptakan seorang anak tanpa bapak atau menciptakan manusia tanpa ibu dan bapak seperti menciptakan Adam dan Allah berfirman:\n\nSesungguhnya perumpamaan (penciptaan) Isa bagi Allah, seperti (penciptaan) Adam. Dia menciptakannya dari tanah, kemudian Dia berkata kepadanya, \"Jadilah!\" Maka jadilah sesuatu itu. (Ali 'Imran\/3: 59)\n\nAllah Yang Maha Sempurna dan demikian besar kekuasaan-Nya tidaklah mungkin membutuhkan seorang anak karena yang demikian itu menunjukkan kepada kelemahan dan sifat-sifat kekurangan.",
      "text_translation": "Tidak patut bagi Allah mempunyai anak, Mahasuci Dia. Apabila Dia hendak menetapkan sesuatu, maka Dia hanya berkata kepadanya, “Jadilah!” Maka jadilah sesuatu itu.",
      "text": "مَا كَانَ لِلّٰهِ اَنْ يَّتَّخِذَ مِنْ وَّلَدٍ سُبْحٰنَهٗ ۗاِذَا قَضٰٓى اَمْرًا فَاِنَّمَا يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ ۗ",
      "text_translation_en": "It is not conceivable that God should have taken unto Himself a son: limitless is He in His glory! When He wills a thing to be, He but says unto it \"Be\" -and it is!",
      "juz_number": 16
    },
    "36": {
      "text_tafsir_en": "In this verse God recounts Jesus' words when he was a baby in the cradle as well as his words in verses 30-33 of this Surah: \"Verily God is my Lord and your God, therefore worship him.\" Jesus emphasized to his people that he was only a servant of God just like them even though he was born in an extraordinary way without a father. This does not indicate that he is a son of God, or that he is a God to be worshiped. He is just a human being created by God. Therefore he invites his people to worship the One who created them and created all beings. All they have to do is worship God, the Creator of all things. Jesus then explained to them that men should worship God rather than worship demons and idols. This is the straight path that will bring them happiness in this world and the hereafter. This is the path that the prophets showed before him. Whoever walks on that road will be happy and whoever walks on that path will be lost and miserable.",
      "text_tafsir": "Pada ayat ini Allah menerangkan lagi ucapan Isa di waktu dia masih bayi dalam buaian di samping ucapan-ucapannya pada ayat 30-33 Surah ini yaitu, \"Bahwa sesungguhnya Allah adalah Tuhanku dan Tuhanmu, maka hendaklah kamu menyembah-Nya.\" Isa menegaskan kepada kaumnya bahwa dia hanya hamba Allah seperti mereka juga meskipun dia dilahirkan dengan cara yang luar biasa tanpa bapak. Hal ini tidak menunjukkan bahwa dia adalah putra Allah, atau dia adalah Tuhan yang patut disembah. Dia hanya manusia biasa diciptakan Allah. Oleh sebab itu dia mengajak kaumnya supaya menyembah Allah Yang menciptakannya dan menciptakan semua makhluk. Yang patut mereka sembah hanyalah Allah Pencipta segala sesuatu. \n\nSelanjutnya Isa menerangkan kepada mereka, bahwa manusia sepatutnya menyembah Allah bukan menyembah setan dan berhala. Inilah jalan yang lurus yang akan membawa mereka pada kebahagiaan di dunia dan akhirat. Ini pula jalan yang ditunjukkan oleh nabi-nabi sebelum dia. Barangsiapa yang menempuh jalan itu ia akan berbahagia dan barangsiapa yang menempuh jalan selain itu akan sesat dan celaka.",
      "text_translation": "(Isa berkata), “Dan sesungguhnya Allah itu Tuhanku dan Tuhanmu, maka sembahlah Dia. Ini adalah jalan yang lurus.”",
      "text": "وَاِنَّ اللّٰهَ رَبِّيْ وَرَبُّكُمْ فَاعْبُدُوْهُ ۗهٰذَا صِرَاطٌ مُّسْتَقِيْمٌ ",
      "text_translation_en": "And [thus it was that Jesus always said]: \"Verily, God is my Sustainer as well as your Sustainer; so worship [none but] Him: this (alone] is a straight way.\"",
      "juz_number": 16
    },
    "37": {
      "text_tafsir_en": "Later in this verse God explains that the people of Jesus did not heed the instructions given to them. They have fallen into a valley of great error and strife. They were divided into groups; The \"Jacob\" group were those who followed the teachings of a priest named Jacob, who said that Jesus was a god who was brought down to earth but then ascended to heaven. The \"Nasturiah\" group followed the teaching of a priest named Nastur who claimed that Jesus was the son of God who was brought down to earth and then raised up to heaven. This group says that Jesus is one of the three oknum: Father, son and Holy Ghost. Others say that Jesus was one of the three Gods: God, His Son Jesus, and Mary the mother of Jesus. In addition to the heresy, there are also those who are true and faithful according to the teachings and guidance of Jesus who believe that Jesus is the servant of God and His Messenger, this group is called \"Malacca\". Against those who had gone astray God threatened them that they would witness for themselves how terrible the Day of Judgment would be and how painful it would be for them to suffer. All their members will be witnesses of their disbelief and disobedience. Allah withheld the torment of them till the Day of Judgment and did not hasten their torment merely because of His mercy and love as it is said in the Prophet's Word: Verily Allah suspends the torture of the wicked so that if He torments them he will not be able to escape them. . (History of al-Bukhari and Muslim from Abu Musa) About the attitude of the people of this Prophet Muhammad (peace be upon him) said: No one can withstand, hear painful words except Allah. They say that God has children while God still gives them sustenance and health. (History of al-Bukhari from Abdullah bin Qais)",
      "text_tafsir": "Kemudian pada ayat ini Allah menerangkan bahwa kaum Nabi Isa tidak mengindahkan petunjuk-petunjuk yang diberikan kepada mereka. Mereka telah jatuh ke dalam lembah kesesatan dan perselisihan yang hebat. Mereka terpecah-pecah menjadi beberapa golongan; Golongan \"Yakubiyah\" yaitu golongan yang mengikuti ajaran seorang pendeta bernama Yakub, yang mengatakan bahwa Isa adalah tuhan yang diturunkan ke bumi tetapi kemudian naik lagi ke langit. Golongan \"Nasturiah\" yang mengikuti ajaran seorang pendeta bernama Nastur yang mengatakan bahwa Isa adalah putra Tuhan yang diturunkan ke bumi kemudian diangkat-Nya kembali ke langit. Golongan ini mengatakan bahwa Isa adalah salah satu dari oknum yang tiga yaitu: Bapak, putra dan Ruhulkudus. Golongan lain mengatakan bahwa Isa adalah salah satu dari Tuhan yang tiga, yaitu: Allah, Isa anak-Nya dan Maryam ibu Isa. Di samping golongan-golongan yang sesat itu, ada pula golongan yang benar dan beriman sesuai dengan ajaran dan petunjuk Isa yang beriman bahwa Isa adalah hamba Allah dan Rasul-Nya, golongan ini bernama \"Malakania\". \n\nTerhadap golongan-golongan yang sesat itu Allah mengancam mereka bahwa mereka akan menyaksikan sendiri bagamana dahsyatnya hari kiamat nanti dan bagaimana pedihnya siksaan yang disediakan untuk mereka. Semua anggota badan mereka akan menjadi saksi atas kekufuran dan keingkaran mereka. Allah menangguhkan siksaan terhadap mereka sampai hari Kiamat dan tidak menyegerakan siksaan mereka semata-mata karena rahmat dan kasih sayang-Nya sebagaimana tersebut dalam sabda Nabi saw:\n\nSesungguhnya Allah menangguhkan penyiksaan bagi orang zalim sehingga apabila Dia menyiksanya, dia tidak akan dapat lepas dari siksaan itu. (Riwayat al-Bukhari dan Muslim dari Abu Musa)\n\nMengenai sikap kaum Nabi Isa ini Nabi Muhammad saw bersabda:\n\nTak ada seorang pun yang tahan, mendengar kata-kata yang menyakitkan kecuali Allah. Mereka mengatakan bahwa Allah mempunyai anak sedang Allah tetap memberi mereka rezeki dan kesehatan. (Riwayat al-Bukhari dari Abdullah bin Qais)",
      "text_translation": "Maka berselisihlah golongan-golongan (yang ada) di antara mereka (Yahudi dan Nasrani). Maka celakalah orang-orang kafir pada waktu menyaksikan hari yang agung!",
      "text": "فَاخْتَلَفَ الْاَحْزَابُ مِنْۢ بَيْنِهِمْۚ فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا مِنْ مَّشْهَدِ يَوْمٍ عَظِيْمٍ ",
      "text_translation_en": "And yet, the sects [that follow the Bible] are at variance among themselves [about the nature of Jesus Woe, then, unto all who deny the truth when that awesome Day will appear!",
      "juz_number": 16
    },
    "38": {
      "text_tafsir_en": "On the Day of Judgment the disbelievers will think of their unfortunate fate as their ears become very sensitive and their eyesight is very sharp on what happens immediately to their attention. Then Allah said, \"How fortunate were their ears and how sharp their eyes were when they came to Us, though they could not hear the guidance of the Prophet, and they could not see the truth and the miracles they are given to the apostles. They do not see or feel the power of God that is manifest in the universe. \" If they were in the world using hearing and seeing as they are in the hereafter they would not remain in disbelief, they would believe in God and His Messenger. But there was no use for the attentive ears and the sharp eyes at that time, for their fate had been determined and they must have gone to hell. They at that time felt very sorry and anxious that they might be returned to the world to correct their mistakes and misdeeds, but what to say was rice became porridge. Such empty fantasies will not be relieved because they will be bound, chained, and cast into hell as it is in the word of God: Then cast him into the flaming fire of hell. And he fastened it with a chain that was seventy cubits long. Indeed, he is the one who does not believe in the Almighty. (al-haqqah \/ 69: 30-33) Such is their fate in the hereafter because they are the ones who have strayed from the straight path.",
      "text_tafsir": "Pada hari kiamat nanti orang-orang kafir itu karena memikirkan nasib mereka yang malang telinganya menjadi sangat peka dan peng-lihatannya sangat tajam apa saja yang terjadi segera menjadi perhatian mereka. Maka Allah lalu berfirman, \"Alangkah pekanya telinga mereka dan alangkah tajamnya penglihatan mereka di kala mereka menghadap Kami. Padahal mereka di dunia seakan-akan tuli tidak dapat mendengarkan petunjuk yang di bawa Nabi, dan seakan-akan buta tidak dapat melihat kebenaran dan mukjizat yang diberikan kepada para rasul. Mereka tidak melihat atau merasakan kekuasaan Allah yang tampak dengan nyata di alam semesta.\"\n\nSeandainya mereka semasa di dunia mempergunakan pendengaran dan penglihatan seperti keadaan mereka di akhirat itu tentulah mereka tidak akan tetap dalam kekafiran, mereka akan beriman kepada Allah dan Rasul-Nya. Tetapi tidak ada gunanya lagi telinga yang peka dan mata yang tajam pada waktu itu, karena nasib mereka sudah ditentukan dan pastilah mereka masuk neraka. Mereka pada waktu itu merasa sangat menyesal dan berangan-angan agar mereka dapat dikembalikan ke dunia untuk memperbaiki kesalahan dan kedurhakaan mereka, tetapi apa hendak dikata nasi telah menjadi bubur. Angan-angan kosong itu tidak akan terkabul karena mereka akan dibelenggu, dirantai, dan dimasukkan ke neraka sebagaimana tersebut dalam firman Allah:\n\n(Allah berfirman), \"Tangkaplah dia lalu belenggulah tangannya ke lehernya.\" Kemudian masukkanlah dia ke dalam api neraka yang menyala-nyala. Kemudian belitlah dia dengan rantai yang panjangnya tujuh puluh hasta. Sesungguhnya dialah orang yang tidak beriman kepada Allah Yang Mahabesar. (al-haqqah\/69: 30-33)\n\nDemikianlah nasib mereka di akhirat nanti karena mereka adalah orang-orang yang benar-benar telah sesat dari jalan yang lurus.",
      "text_translation": "Alangkah tajam pendengaran mereka dan alangkah terang penglihatan mereka pada hari mereka datang kepada Kami. Tetapi orang-orang yang zalim pada hari ini (di dunia) berada dalam kesesatan yang nyata.",
      "text": "اَسْمِعْ بِهِمْ وَاَبْصِرْۙ يَوْمَ يَأْتُوْنَنَا لٰكِنِ الظّٰلِمُوْنَ الْيَوْمَ فِيْ ضَلٰلٍ مُّبِيْنٍ ",
      "text_translation_en": "How well will they hear and see [the truth] on the Day when they come before Us! Today, however, these evildoers are obviously lost in error:",
      "juz_number": 16
    },
    "39": {
      "text_tafsir_en": "In this verse Allah commands the Prophet Muhammad to warn people especially the Meccans of the Day of Judgment that they will die in disbelief, unbelievers will regret themselves for not believing and always trying to uphold the falsehood while living in the world . The believers were taken to heaven and the unbelievers were dragged to hell. Both groups are told that each of them will never go out of the place provided for them, and that they will never die. Narrated in a hadith from Abu Sa'id, the Messenger of Allah (may peace be upon him) said, \"At that moment\" death \"took the form of a good-looking sheep, and a shout came, O inhabitants of heaven! , \"Do you know what this is?\" They answered, \"Yes, it is\" Death. \"They all saw it. Then the other callers shouted. O inhabitant of hell! Do you know what this is? They answered, yes! It was\" death. \" Then they cried out, \"Sheol\" was slaughtered between heaven and hell, and the caller said, \"O inhabitant of heaven, dwell in heaven and never die. \"O people of hell, you will remain in hell and never experience death again.\" Then the Messenger of Allah (may peace be upon him) recited this verse. on the day of resurrection, why they would not think of the promptings and the directions to the right path, but the remorse is useless.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad saw agar dia memberi peringatan kepada manusia khususnya kaum musyrik Mekah tentang hari Kiamat mereka mati dalam keadaan kafir, orang-orang kafir akan menyesali diri mereka karena tidak mau beriman dan selalu berusaha menegakkan yang batil semasa hidup di dunia.\n\nPara mukmin dibawa ke surga dan orang-orang kafir digiring ke neraka. Kepada kedua golongan ini diberitahukan bahwa masing-masing mereka tidak akan keluar selama-lamanya dari tempat yang telah disediakan bagi mereka, dan mereka tidak akan mengalami kematian selama-lamanya. Diriwayatkan dalam sebuah hadis dari Abu Sa'id, Rasulullah saw bersabda, \"Pada waktu itu dibawalah \"kematian\" berbentuk seekor biri-biri yang bagus rupanya, lalu datang orang yang menyerukan, Hai penghuni surga! Lalu mereka tertegun memperhatikan. Maka penyeru itu bertanya, \"Tahukah kamu apa ini?\" Mereka menjawab, Ya, itu adalah \"Kematian.\" Semua mereka melihatnya. Kemudian penyeru yang lain berseru pula. Hai penghuni neraka! Tahukah kamu apakah ini? Mereka menjawab, ya! Itu adalah \"kematian.\" Mereka melihatnya pula. Maka \"kematian\" yang berbentuk biri-biri itu disembelihkan di antara surga dan neraka, lalu penyeru itu berkata, \"Hai penghuni surga kamu kekal di dalam surga dan kamu tidak akan mengalami kematian lagi. Hai penghuni neraka, kamu kekal di dalam neraka dan tidak akan mengalami kematian lagi.\" Kemudian Rasulullah membacakan ayat ini. (Riwayat al-Bukhari dan Muslim)\n\nKetika itu sadarlah orang-orang kafir akan keteledoran mereka dan mereka menyesal mengapa mereka di dunia dahulu mengingkari hari ke-bangkitan, mengapa mereka tidak mau memikirkan ajakan dan petunjuk ke jalan yang benar, tetapi sesalan itu tidak berguna lagi.",
      "text_translation": " Dan berilah mereka peringatan (Muhammad) tentang hari penyesalan, (yaitu) ketika segala perkara telah diputus, sedang mereka dalam kelalaian dan mereka tidak beriman.",
      "text": "وَاَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُۘ وَهُمْ فِيْ غَفْلَةٍ وَّهُمْ لَا يُؤْمِنُوْنَ ",
      "text_translation_en": "hence, warn them of [the coming of] the Day of Regrets, when everything will have been decided-for as yet they are heedless, and they do not believe [in it].",
      "juz_number": 16
    },
    "40": {
      "text_tafsir_en": "In this verse Allah comforted the Prophet Muhammad, asking the Prophet not to grieve because the unbelievers did not believe and always denied it. Because they will return to Allah and will be rewarded with their disbelief with a just recompense because we are the Almighty. We are the heirs of the earth and all its contents on the Day of Judgment.",
      "text_tafsir": "Pada ayat ini Allah menghibur Nabi Muhammad, meminta Nabi untuk tidak bersedih hati karena kaum musyrik tidak mau beriman dan selalu mendustakannya. Karena mereka kelak akan kembali kepada Allah dan akan dibalas kekafiran mereka dengan balasan yang setimpal karena Kamilah Yang Mahakuasa. Kamilah yang mewarisi bumi dan segala isinya pada hari Kiamat nanti.",
      "text_translation": "Sesungguhnya Kamilah yang mewarisi bumi dan semua yang ada di atasnya, dan hanya kepada Kami mereka dikembalikan.",
      "text": "اِنَّا نَحْنُ نَرِثُ الْاَرْضَ وَمَنْ عَلَيْهَا وَاِلَيْنَا يُرْجَعُوْنَ ࣖ",
      "text_translation_en": "Behold, We alone shall remain after the earth and all who live on it have passed away, and (when] unto Us all will have been brought back.",
      "juz_number": 16
    },
    "41": {
      "text_tafsir_en": "In these verses Allah instructs the Messenger of Allah to explain to the Mecca Muslims the story of Abraham whom they consider to be the father of the Arabs. They themselves consider themselves their grandchildren and declare that they are followers of their religion. Whereas Abraham was a believer a lover of God and a worshiper of the Supreme God not a pagan idol worshiper. Allah ordered Muhammad to tell them when Abraham forbade his people to worship idols and said to his father as follows, \"Why do you worship idols that cannot hear the praise of their worshipers, do not see how you worship them, can not help the one who worships and benefits the least and cannot resist the danger if the worshiper asks for his help. \" With gentle and acceptable words Abraham called his father to the monotheist and left the idolatry of the helpless dead. While only humans who can hear and see and help, should not be worshiped, let alone the dead thing we do ourselves, if we want to destroy it or destroy it it has no power to defend itself. Such things as would not be possible for human benefit or assistance should not be human worship. This is in accordance with the parable that God explained in his word: \"O man! A parable has been made. Listen! Indeed all that you desire besides God cannot create a fly, though they unite to create it. they will not be able to take it back from the flies. (al-hajj \/ 22: 73)",
      "text_tafsir": "Pada ayat-ayat ini Allah memerintahkan kepada Rasulullah agar ia menerangkan kepada kaum musyrik Mekah kisah Nabi Ibrahim yang mereka anggap sebagai bapak bangsa Arab. Mereka sendiri menganggap diri mereka anak cucunya dan mendakwahkan bahwa mereka adalah pengikutpengikut agamanya. Padahal Nabi Ibrahim adalah seorang mukmin seorang kekasih Allah dan seorang Nabi penyembah Tuhan Yang Maha Esa bukan seorang musyrik penyembah berhala. Allah memerintahkan kepada Muhammad agar dia menceritakan kepada mereka ketika Nabi Ibrahim melarang kaumnya menyembah berhala dan mengatakan kepada bapaknya sebagai berikut, \"Mengapa engkau menyembah berhala-berhala yang tidak dapat mendengar pujian penyembahnya ketika disembah, tidak dapat melihat bagaimana khusyuknya engkau menyembahnya, tidak dapat menolong orang yang menyembahnya dan memberikan manfaat barang sedikit pun dan tidak dapat menolak bahaya bila si penyembah itu meminta tolong kepadanya.\" \n\nDengan kata-kata yang lemah lembut dan dapat diterima akal Nabi Ibrahim menyeru bapaknya kepada tauhid dan meninggalkan penyembahan berhala benda mati yang tidak berdaya. Sedangkan manusia saja yang dapat mendengar dan melihat serta dapat memberikan pertolongan, tidaklah patut disembah, apalagi benda mati yang kita buat sendiri, bila kita hendak merusaknya atau menghancurkannya dia tidak berdaya apa-apa untuk mempertahankan dirinya. Benda yang demikian halnya yang tidak mungkin memberikan manfaat atau pertolongan kepada manusia, tidaklah patut menjadi sembahan manusia. Hal ini sesuai dengan perumpamaan yang dijelaskan Allah dalam firman-Nya:\n\n\"Wahai manusia! Telah dibuat suatu perumpamaan. Maka dengarkanlah! Sesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. Sama lemahnya yang menyembah dan yang disembah.\" (al-hajj\/22: 73)",
      "text_translation": "Dan ceritakanlah (Muhammad) kisah Ibrahim di dalam Kitab (Al-Qur'an), sesungguhnya dia adalah seorang yang sangat membenarkan, seorang Nabi. ",
      "text": "وَاذْكُرْ فِى الْكِتٰبِ اِبْرٰهِيْمَ ەۗ اِنَّهٗ كَانَ صِدِّيْقًا نَّبِيًّا",
      "text_translation_en": "AND CALL to mind, through this divine writ, Abraham. Behold, he was a man of truth, [already] a prophet",
      "juz_number": 16
    },
    "42": {
      "text_tafsir_en": "In these verses Allah instructs the Messenger of Allah to explain to the Mecca Muslims the story of Abraham whom they consider to be the father of the Arabs. They themselves consider themselves their grandchildren and declare that they are followers of their religion. Whereas Abraham was a believer a lover of God and a worshiper of the Supreme God not a pagan idol worshiper. Allah ordered Muhammad to tell them when Abraham forbade his people to worship idols and said to his father as follows, \"Why do you worship idols that cannot hear the praise of their worshipers, do not see how you worship them, can not help the one who worships and benefits the least and cannot resist the danger if the worshiper asks for his help. \" With gentle and acceptable words Abraham called his father to the monotheist and left the idolatry of the helpless dead. While only humans who can hear and see and help, should not be worshiped, let alone the dead thing we do ourselves, if we want to destroy it or destroy it it has no power to defend itself. Such things as would not be possible for human benefit or assistance should not be human worship. This is in accordance with the parable that God explained in his word: \"O man! A parable has been made. Listen! Indeed all that you desire besides God cannot create a fly, though they unite to create it. they will not be able to take it back from the flies. (al-hajj \/ 22: 73)",
      "text_tafsir": "Pada ayat-ayat ini Allah memerintahkan kepada Rasulullah agar ia menerangkan kepada kaum musyrik Mekah kisah Nabi Ibrahim yang mereka anggap sebagai bapak bangsa Arab. Mereka sendiri menganggap diri mereka anak cucunya dan mendakwahkan bahwa mereka adalah pengikutpengikut agamanya. Padahal Nabi Ibrahim adalah seorang mukmin seorang kekasih Allah dan seorang Nabi penyembah Tuhan Yang Maha Esa bukan seorang musyrik penyembah berhala. Allah memerintahkan kepada Muhammad agar dia menceritakan kepada mereka ketika Nabi Ibrahim melarang kaumnya menyembah berhala dan mengatakan kepada bapaknya sebagai berikut, \"Mengapa engkau menyembah berhala-berhala yang tidak dapat mendengar pujian penyembahnya ketika disembah, tidak dapat melihat bagaimana khusyuknya engkau menyembahnya, tidak dapat menolong orang yang menyembahnya dan memberikan manfaat barang sedikit pun dan tidak dapat menolak bahaya bila si penyembah itu meminta tolong kepadanya.\" \n\nDengan kata-kata yang lemah lembut dan dapat diterima akal Nabi Ibrahim menyeru bapaknya kepada tauhid dan meninggalkan penyembahan berhala benda mati yang tidak berdaya. Sedangkan manusia saja yang dapat mendengar dan melihat serta dapat memberikan pertolongan, tidaklah patut disembah, apalagi benda mati yang kita buat sendiri, bila kita hendak merusaknya atau menghancurkannya dia tidak berdaya apa-apa untuk mempertahankan dirinya. Benda yang demikian halnya yang tidak mungkin memberikan manfaat atau pertolongan kepada manusia, tidaklah patut menjadi sembahan manusia. Hal ini sesuai dengan perumpamaan yang dijelaskan Allah dalam firman-Nya:\n\n\"Wahai manusia! Telah dibuat suatu perumpamaan. Maka dengarkanlah! Sesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. Sama lemahnya yang menyembah dan yang disembah.\" (al-hajj\/22: 73)",
      "text_translation": "(Ingatlah) ketika dia (Ibrahim) berkata kepada ayahnya, “Wahai ayahku! Mengapa engkau menyembah sesuatu yang tidak mendengar, tidak melihat, dan tidak dapat menolongmu sedikit pun?",
      "text": "اِذْ قَالَ لِاَبِيْهِ يٰٓاَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِيْ عَنْكَ شَيْـًٔا ",
      "text_translation_en": "when he spoke [thus] unto his father: \"O my father! Why dost thou worship something that neither hears nor sees and can be of no avail whatever to thee?",
      "juz_number": 16
    },
    "43": {
      "text_tafsir_en": "Then Abraham said to his father that he had been given knowledge by God that his father had never known. With that knowledge, Abraham was able to lead mankind to a straight path and free them from acts of humiliation that led them to worldly happiness and the Hereafter. Although he was his son and much younger, God sent his mercy to Abraham by giving him that knowledge. Abraham wanted his father to follow him, so he could lead his father on a straight path.",
      "text_tafsir": "Selanjutnya Nabi Ibrahim a.s. mengatakan kepada bapaknya bahwa dia telah diberi ilmu oleh Allah yang belum diketahui oleh bapaknya. Dengan ilmu itu Ibrahim dapat memimpin manusia kepada jalan yang lurus dan membebaskannya dari perbuatan yang merendahkan derajatnya seraya membawanya kepada kebahagiaan dunia dan akhirat. Meskipun ia adalah anaknya dan jauh lebih muda tetapi Allah telah menurunkan rahmat-Nya kepada Ibrahim dengan memberikan ilmu itu. Ibrahim sangat ingin agar bapaknya mengikutinya, dengan demikian ia dapat membawa ayahnya ke jalan yang lurus.",
      "text_translation": "Wahai ayahku! Sungguh, telah sampai kepadaku sebagian ilmu yang tidak diberikan kepadamu, maka ikutilah aku, niscaya aku akan menunjukkan kepadamu jalan yang lurus.",
      "text": "يٰٓاَبَتِ اِنِّي قَدْ جَاۤءَنِيْ مِنَ الْعِلْمِ مَا لَمْ يَأْتِكَ فَاتَّبِعْنِيْٓ اَهْدِكَ صِرَاطًا سَوِيًّا ",
      "text_translation_en": "\"O my father! Behold, there has indeed come to me [a ray] of knowledge such as has never yet come unto thee: follow me, then; I shall guide thee onto a perfect way.",
      "juz_number": 16
    },
    "44": {
      "text_tafsir_en": "O my father, do not follow the teachings of the devil who leads you to worship idols, for they are always deceiving people so that they are led astray from the right path. Indeed, the devil is a wicked person to his Lord, a very arrogant and arrogant creature, and so Allah curses him and removes it from His mercy. Because the devil was enraged by God he was determined to always try to mislead people. Do not include any group of people who are exposed to the devil and fall into their trap. I am worried that if you continue to follow his teachings, you will be exposed to the wrath of God as much as the wrath of the devil and of course you will belong to him.",
      "text_tafsir": "Wahai bapakku, janganlah engkau mengikuti ajaran setan yang membawamu kepada menyembah berhala, karena setan itu selalu memperdayakan manusia agar ia tersesat dari jalan yang benar. Sesungguhnya setan itu adalah makhluk yang durhaka kepada Tuhannya makhluk yang sangat sombong dan takabur, karena itu Allah melaknatinya dan menjauhkannya dari rahmat-Nya. Karena setan itu telah dimurkai oleh Allah dia bertekad akan selalu berusaha menyesatkan manusia. Janganlah bapak termasuk golongan orang-orang yang terkena tipu daya setan dan masuk ke dalam perangkapnya. Aku khawatir sekiranya bapak tetap mengikuti ajarannya bapak akan ditimpa kemurkaan Allah seperti kemurkaan yang telah menimpa setan itu dan tentulah bapak akan termasuk golongannya.",
      "text_translation": "Wahai ayahku! Janganlah engkau menyembah setan. Sungguh, setan itu durhaka kepada Tuhan Yang Maha Pengasih.",
      "text": "يٰٓاَبَتِ لَا تَعْبُدِ الشَّيْطٰنَۗ اِنَّ الشَّيْطٰنَ كَانَ لِلرَّحْمٰنِ عَصِيًّا ",
      "text_translation_en": "\"O my father! Do not worship Satan-for, verily, Satan is a rebel against the Most Gracious!",
      "juz_number": 16
    },
    "45": {
      "text_tafsir_en": "O my father, do not follow the teachings of the devil who leads you to worship idols, for they are always deceiving people so that they are led astray from the right path. Indeed, the devil is a wicked person to his Lord, a very arrogant and arrogant creature, and so Allah curses him and removes it from His mercy. Because the devil was enraged by God he was determined to always try to mislead people. Do not include any group of people who are exposed to the devil and fall into their trap. I am worried that if you continue to follow his teachings, you will be exposed to the wrath of God as much as the wrath of the devil and of course you will belong to him.",
      "text_tafsir": "Wahai bapakku, janganlah engkau mengikuti ajaran setan yang membawamu kepada menyembah berhala, karena setan itu selalu memperdayakan manusia agar ia tersesat dari jalan yang benar. Sesungguhnya setan itu adalah makhluk yang durhaka kepada Tuhannya makhluk yang sangat sombong dan takabur, karena itu Allah melaknatinya dan menjauhkannya dari rahmat-Nya. Karena setan itu telah dimurkai oleh Allah dia bertekad akan selalu berusaha menyesatkan manusia. Janganlah bapak termasuk golongan orang-orang yang terkena tipu daya setan dan masuk ke dalam perangkapnya. Aku khawatir sekiranya bapak tetap mengikuti ajarannya bapak akan ditimpa kemurkaan Allah seperti kemurkaan yang telah menimpa setan itu dan tentulah bapak akan termasuk golongannya.",
      "text_translation": "Wahai ayahku! Aku sungguh khawatir engkau akan ditimpa azab dari Tuhan Yang Maha Pengasih, sehingga engkau menjadi teman bagi setan.”",
      "text": "يٰٓاَبَتِ اِنِّيْٓ اَخَافُ اَنْ يَّمَسَّكَ عَذَابٌ مِّنَ الرَّحْمٰنِ فَتَكُوْنَ لِلشَّيْطٰنِ وَلِيًّا ",
      "text_translation_en": "O my father! I dread lest a chastisement from the Most Gracious befall thee, and then thou wilt become [aware of having been] close unto Satan!\"",
      "juz_number": 16
    },
    "46": {
      "text_tafsir_en": "Abraham's father rejected the request of his son, who spoke in a gentle tone, with harsh and sharp words expressing extreme disgust and anger. His father said, \"Do you despise the idols which I worship, which I adore and which I exalt to Abraham? Is it your ancestor worship in the past? Have you been mad or have you entered into your preaching that you have gained the true knowledge of God? If you do not stop the cry, I will stone you to death, or go away from me even from this land. and never come back again. \" Hearing the outrageous arguments and answers Abraham was heartbroken because he was very affectionate and polite to his father and longed for him to be free of the error of worshiping idols and accepting the right path, and to believe in the One True God. He wanted to believe that his father would receive the grace and mercy of his Lord. But what he was going to do and say, as his father passed away and drove him from his home and hometown didn't even want him back as if he were no longer his son.",
      "text_tafsir": "Bapak Nabi Ibrahim menolak ajakan anaknya yang diucapkan dengan nada lemah lembut itu dengan kata-kata yang keras dan tajam yang menampakkan keingkaran dan kemarahan yang amat sangat. Bapaknya berkata, \"Apakah engkau membenci berhala-berhala yang aku sembah, yang aku muliakan dan yang aku agungkan hai Ibrahim? Apakah engkau tidak menyadari kesalahan pengertianmu? Bukankah berhala-berhala yang aku sembah itu sembahan semua kaummu? Bukankah tuhan-tuhan yang aku muliakan itu sembahan nenek moyangmu sejak dahulu kala? Apakah engkau telah gila atau kemasukan setan dengan dakwahmu bahwa engkau telah mendapat ilmu dari Tuhan sesungguhnya? Jika engkau tidak menghentikan seruanmu itu, aku akan melemparimu dengan batu sampai mati, atau pergilah engkau dari sisiku bahkan dari negeri ini dan tidak usah kembali lagi.\" Mendengar bantahan dan jawaban yang amat keras itu hancur luluhlah hati Ibrahim karena dia sangat sayang dan santun kepada bapaknya dan sangat menginginkan agar dia bebas dari kesesatan menyembah berhala dan menerima petunjuk ke jalan yang benar, serta mau beriman kepada Allah Yang Maha Esa dan Mahakuasa. Dia ingin agar dengan beriman itu bapaknya akan mendapat karunia dan rahmat dari Tuhannya. Tetapi apa yang akan dilakukan dan dikatakannya, sedang bapaknya sudah kalap dan mengusirnya dari rumah dan kampung halamannya bahkan tidak menginginkan kembalinya seakan-akan dia bukan anaknya lagi.",
      "text_translation": "Dia (ayahnya) berkata, “Bencikah engkau kepada tuhan-tuhanku, wahai Ibrahim? Jika engkau tidak berhenti, pasti engkau akan kurajam, maka tinggalkanlah aku untuk waktu yang lama.” ",
      "text": "قَالَ اَرَاغِبٌ اَنْتَ عَنْ اٰلِهَتِيْ يٰٓاِبْرٰهِيْمُ ۚ لَىِٕنْ لَّمْ تَنْتَهِ لَاَرْجُمَنَّكَ وَاهْجُرْنِيْ مَلِيًّا ",
      "text_translation_en": "He answered: \"Dost thou dislike my gods, O Abraham? Indeed, if thou desist not, I shall most certainly cause thee to be stoned to death! Now begone from me for good!\"",
      "juz_number": 16
    },
    "47": {
      "text_tafsir_en": "There was no response from Abraham to his father's cruel behavior except to say, \"Peace be to you.\" I pray that you will always be in good health and prayer. I will not reply to such harsh words as you are my beloved father. I will not do anything to harm or harm you, let me leave this country, leave my home, leave my home and home. I ask the Lord to forgive him and always be in the mercy of his grace, for guidance in the straight path that leads to goodness and happiness. Indeed, Abraham prayed for it in the word of Allah: \"And forgive my father, for he is a pervert,\" (Ash-Shu'ara \/ 26: 86). his prayers are always answered. Abraham prayed for his father because he had promised him such a faith in the word of God: As for Abraham's forgiveness (to Allah) for his father, it was nothing more than a promise he had made to his father. So when it became clear to Abraham that his father was an enemy of God, Abraham withdrew from him. Indeed, Abraham was a very gentle man and a supportive man. (at-9\/9: 114)",
      "text_tafsir": "Tak ada jawaban dari Ibrahim terhadap bentakan-bentakan bapaknya yang kasar itu kecuali mengucapkan, \"selamat sejahtera atasmu.\" Aku berdoa agar bapak selalu berada dalam sehat dan afiat. Aku tidak akan membalas kata-kata yang kasar itu dengan kasar pula karena engkau adalah bapakku yang kucintai. Aku tidak akan melakukan sesuatu pun yang merugikan atau mencelakakan bapak, biarlah aku pergi dari negeri ini meninggalkan bapak, meninggalkan rumah dan kampung halaman. Aku meminta kepada Tuhan agar bapak diampuni-Nya dan selalu berada dalam naungan rahmat-Nya, mendapat petunjuk kepada jalan yang lurus yang membawa kepada kebaikan dan kebahagiaan. Memang Nabi Ibrahim a.s. telah mendoakannya sebagaimana tersebut dalam firman Allah:\n\n\"Dan ampunilah ayahku, sesungguhnya dia termasuk orang yang sesat,\" (Asy-Syu'ara\/26: 86)\n\nNabi Ibrahim a.s. yakin bahwa Tuhan akan mengabulkan doanya karena biasanya di masa lalu doanya selalu dikabulkannya. Nabi Ibrahim berdoa untuk bapaknya karena dia telah menjanjikan kepadanya akan beriman sebagaimana tersebut dalam firman Allah:\n\nAdapun permohonan ampunan Ibrahim (kepada Allah) untuk bapaknya, tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya. Maka ketika jelas bagi Ibrahim bahwa bapaknya adalah musuh Allah, maka Ibrahim berlepas diri darinya. Sungguh, Ibrahim itu seorang yang sangat lembut hatinya lagi penyantun. (at-Taubah\/9: 114)",
      "text_translation": "Dia (Ibrahim) berkata, “Semoga keselamatan dilimpahkan kepadamu, aku akan memohonkan ampunan bagimu kepada Tuhanku. Sesungguhnya Dia sangat baik kepadaku.",
      "text": "قَالَ سَلٰمٌ عَلَيْكَۚ سَاَسْتَغْفِرُ لَكَ رَبِّيْۗ اِنَّهٗ كَانَ بِيْ حَفِيًّا ",
      "text_translation_en": "[Abraham] replied: \"Peace be upon thee! I shall ask my Sustainer to forgive thee: for, behold, He has always been kind unto me.",
      "juz_number": 16
    },
    "48": {
      "text_tafsir_en": "Then Abraham said to his father, \"I will leave you, leave your people, forsake the idols that you worship. I will leave here to worship my Lord who will help me and deliver me from the danger that has come to me, for all my guidance and counsel.\" you refuse the raw and even threaten me with horrible threats. According to history, Ibrahim emigrated to Syam and there he married Siti Sarah. He hoped that by praying and worshiping God, he would not be as disappointed as his father who always worshiped and prayed to idols, but it turned out that the idols could do nothing but do what was asked of them.",
      "text_tafsir": "Selanjutnya Ibrahim berkata kepada bapaknya, \"Aku akan pergi meninggalkanmu, meninggalkan kaummu, meninggalkan berhala-berhala yang kamu sembah. Aku akan pergi dari sini agar aku bebas beribadat kepada Tuhanku yang akan menolongku dan melepaskan aku dari bahaya yang menimpaku, karena semua petunjuk dan nasehatku kamu tolak mentah- mentah bahkan mengancamku dengan ancaman yang mengerikan. Aku akan menyembah dan berdoa hanya kepada Tuhanku saja dan sekali-kali aku tidak akan menyembah selain Dia.\"\n\nMenurut riwayat, Ibrahim hijrah ke negeri Syam dan di sana dia menikah dengan Siti Sarah. Ia berharap dengan berdoa dan menyembah Tuhan, ia tidak akan menjadi orang yang kecewa seperti ayahnya yang selalu menyembah dan berdoa kepada berhala-berhala itu, tetapi ternyata berhala-berhala itu tidak dapat berbuat sesuatu apapun apalagi akan melaksanakan apa yang diminta kepadanya.",
      "text_translation": " Dan aku akan menjauhkan diri darimu dan dari apa yang engkau sembah selain Allah, dan aku akan berdoa kepada Tuhanku, mudah-mudahan aku tidak akan kecewa dengan berdoa kepada Tuhanku.”",
      "text": "وَاَعْتَزِلُكُمْ وَمَا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ وَاَدْعُوْ رَبِّيْۖ عَسٰٓى اَلَّآ اَكُوْنَ بِدُعَاۤءِ رَبِّيْ شَقِيًّا ",
      "text_translation_en": "But I shall withdraw from you all and from whatever you invoke instead of God, and shall invoke my Sustainer [alone]: it may well be that my prayer [for thee] will not remain unanswered by my Sustainer.\"",
      "juz_number": 16
    },
    "49": {
      "text_tafsir_en": "After Abraham left his homeland Ur Kildan (Iraq) and settled in Sham, God blessed him with a prosperous and happy life. God gave him children and grandchildren, some of whom he had appointed as prophets among the Children of Israel. God gave him Isaac, and he also had a son named Jacob who succeeded him as Prophet. As for his first son Ismail whom he left around the Ka'bah, he was appointed Prophet who raised and promoted the religious teachings there. This was the Lord's response to Abraham who was willing to leave his father, his people and his homeland for the sake of the safety of his faith and to spread the religion that God had commanded him. God did not neglect and do not despair but instead replaced the sadness of leaving his family and homeland with new and happy family life and accepting his teachings and guidance and giving him good grandchildren who were part of the religion of God and many who were prophets. .",
      "text_tafsir": "Setelah Nabi Ibrahim a.s. meninggalkan negerinya Ur Kildan (Irak) dan menetap di negeri Syam, dikaruniai Tuhan kehidupan yang sejahtera dan bahagia. Allah mengaruniakan kepadanya anak-anak dan cucu-cucu yang sebahagian dari mereka diangkat Allah menjadi nabi di kalangan Bani Israil. Allah mengaruniakan kepadanya Ishak, dan Ishak ini pun mendapat anak bernama Yakub yang menggantikan kedudukannya sebagai Nabi. Adapun anak pertamanya Ismail yang ditinggalkannya di sekitar Ka'bah diangkat pula menjadi Nabi yang telah meninggikan dan menyemarakkan syiar agama di sana.\n\nDemikianlah balasan Tuhan kepada Nabi Ibrahim yang bersedia meninggalkan bapaknya, kaumnya dan tanah airnya demi untuk keselamatan akidahnya dan menyebarkan agama tauhid yang diperintahkan Allah kepadanya. Allah tidak mengabaikan dan tidak menyia-nyiakan bahkan mengganti kesedihan meninggalkan keluarga dan tanah airnya dengan kebahagiaan keluarga dan bertanah air yang baru dan menerima ajaran dan petunjuknya serta memberikan kepadanya anak cucu yang baik-baik yang sebahagiannya menjadi penegak agama Allah bahkan banyak pula yang menjadi nabi.",
      "text_translation": " Maka ketika dia (Ibrahim) sudah menjauhkan diri dari mereka dan dari apa yang mereka sembah selain Allah, Kami anugerahkan kepadanya Ishak dan Yakub. Dan masing-masing Kami angkat menjadi nabi.",
      "text": "فَلَمَّا اعْتَزَلَهُمْ وَمَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ ۙوَهَبْنَا لَهٗٓ اِسْحٰقَ وَيَعْقُوْبَۗ وَكُلًّا جَعَلْنَا نَبِيًّا ",
      "text_translation_en": "And after he had withdrawn from them and from all that they were worshipping instead of God, We bestowed upon him Isaac and Jacob, and made each of them a prophet;",
      "juz_number": 16
    },
    "50": {
      "text_tafsir_en": "In this verse God explains that almost all of Abraham's children and grandchildren were raised as prophets and bestowed on them His grace and grace and blessed their lives with happiness and happiness both in this world and in the hereafter. They all left a good name and praised and exalted the name of Abraham to be recognized and honored by all parties, both from the Jews and the Muslims themselves. This is a fact of the fulfillment of Abraham's prayer as stated in the verse: And make me a good word for those who come. (asy-Syu'ara '\/ 26: 84) It is fair to say that Allah exalted his name and called him \"Khalilullah\" (His love) as stated in the verse: And Allah has chosen Abraham as His beloved. (an-Nisa '\/ 4: 125) And made the soles of his feet in the building of the Ka'bah a blessed place, and pronounced it there as in the verse: \"And (remember), when We made the house (Kabah) a gathering and a place of safety for mankind, and make it a place of prayer for Abraham. \" (al-Baqarah \/ 2: 125)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa hampir semua anak-anak Nabi Ibrahim dan cucu-cucunya diangkat-Nya menjadi nabi dan dilimpahkan kepada mereka rahmat dan karunia-Nya serta memberkahi hidup mereka dengan kesenangan dan kebahagiaan baik di dunia maupun di akhirat nanti. Mereka semuanya meninggalkan nama yang baik dan mengharumkan serta meninggikan nama Nabi Ibrahim sehingga diakui kemuliaan dan ketinggiannya oleh semua pihak baik dari kalangan umat Yahudi umat Nasrani maupun kaum musyrik sendiri. Ini adalah fakta yang nyata bagi terkabulnya doa Nabi Ibrahim seperti tersebut pada ayat:\n\nDan jadikanlah aku buah tutur yang baik bagi orang-orang (yang datang) kemudian. (asy-Syu'ara'\/26: 84)\n\nWajarlah bila Allah mengangkat derajat dan menamakan dia \"Khalilullah\" (kesayangan-Nya) seperti tersebut dalam ayat:\n\nDan Allah telah memilih Ibrahim menjadi kesayangan(-Nya). (an-Nisa'\/4: 125)\n\nDan menjadikan bekas telapak kakinya di waktu membangun Ka'bah tempat yang diberkahi, dan disunatkan salat di sana seperti tersebut dalam ayat:\n\n\"Dan (ingatlah), ketika Kami menjadikan rumah (Kabah) tempat berkumpul dan tempat yang aman bagi manusia. Dan jadikanlah maqam Ibrahim itu tempat salat.\" (al-Baqarah\/2: 125)",
      "text_translation": "Dan Kami anugerahkan kepada mereka sebagian dari rahmat Kami dan Kami jadikan mereka buah tutur yang baik dan mulia.",
      "text": "وَوَهَبْنَا لَهُمْ مِّنْ رَّحْمَتِنَا وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيًّا ࣖ",
      "text_translation_en": "and We bestowed upon them [manifold] gifts out of Our grace, and granted them a lofty power to convey the truth [unto others].",
      "juz_number": 16
    },
    "51": {
      "text_tafsir_en": "In this verse Allah instructs the Prophet Muhammad to explain to the Muslims the story of Moses and the importance of his attributes so that the Prophet himself and his people can know how Allah values and honors him. The privileges of Moses as such are those whom God has chosen and ordained to purely convey the message of monotheism such as his preaching to Pharaoh and his people, as stated in this verse: (Allah) says, \"O Moses! I have chosen (surpassed) you from other men (in your time) to bring forth my leaflets and my word; therefore abide in the things which I have given you; (al-A'raf \/ 7: 144) God appointed him as an apostle besides being a prophet. The difference between the apostle and the prophet is that the apostle has a message that should be given to mankind and revealed to him a book containing beliefs, laws and so on. has a brochure that must be delivered to man and not passed down to him. Among the Children of Israel there were many prophets whose job was simply to preserve and recite the Shari'a that Moses had mentioned in the Torah, such as Yusa ', Ilyas and others.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad saw agar menerangkan kepada kaum musyrik kisah mengenai Nabi Musa a.s. dan keutamaan sifat-sifatnya agar Nabi sendiri beserta kaumnya dapat mengetahui bagaimana Allah menghargai dan memuliakannya. Keistimewaan-keistimewaan Nabi Musa a.s. itu di antaranya adalah dia orang yang dipilih Allah dan diikhlaskan-Nya untuk semata-mata menyampaikan dakwah agama tauhid seperti dakwahnya kepada Firaun beserta kaumnya, sebagaimana tersebut pada ayat ini:\n\n(Allah) berfirman, \"Wahai Musa! Sesungguhnya Aku memilih (melebihkan) engkau dari manusia yang lain (pada masamu) untuk membawa risalah-Ku dan firman-Ku, sebab itu berpegangteguhlah kepada apa yang Aku berikan kepadamu dan hendaklah engkau termasuk orang-orang yang bersyukur.\" (al-A'raf\/7: 144)\n\nAllah mengangkatnya sebagai rasul di samping menjadi nabi. Perbedaan antara rasul dan nabi ialah rasul yang mempunyai risalah yang harus disampaikan kepada manusia dan diturunkan kepadanya kitab yang mengandung akidah, hukum-hukum dan sebagainya, sedang nabi adalah orang yang mendapat wahyu dari Allah tentang agama yang benar dan memberitahukan hal itu kepada manusia tetapi tidak mempunyai risalah yang harus disampaikan kepada manusia dan tidak pula diturunkan kitab kepadanya. Di kalangan Bani Israil banyak nabi yang tugas mereka hanya memelihara dan menyampaikan syariat yang dibawa Nabi Musa yang tersebut dalam kitab Taurat, seperti Yusa', Ilyas dan lainnya.",
      "text_translation": "Dan ceritakanlah (Muhammad), kisah Musa di dalam Kitab (Al-Qur'an). Dia benar-benar orang yang terpilih, seorang rasul dan nabi.",
      "text": "وَاذْكُرْ فِى الْكِتٰبِ مُوْسٰٓىۖ اِنَّهٗ كَانَ مُخْلَصًا وَّكَانَ رَسُوْلًا نَّبِيًّا ",
      "text_translation_en": "AND CALL to mind, through this divine writ, Moses. Behold, he was a chosen one, and was an apostle [of God], a prophet.",
      "juz_number": 16
    },
    "52": {
      "text_tafsir_en": "This verse explains how God called Moses and spoke directly to him on the right side of the hill of Tur, a hill located on the Sinai peninsula. Moses was on his way to Egypt from Midian to deliver his message to Pharaoh. It was at the hill of Tursina that Moses was informed by God that he had been appointed an apostle and promised him that he would triumph in the face of the cruel Pharaoh who proclaimed himself God. God also promised him that he would show mercy to the house of the children of Israel by sending down the book of the law. God also explained that He had approached Moses at that time in the manner of glorifying him and had chosen him as His Messenger as if at that time Moses was as close to God as a king was when speaking to his ministers. We cannot know how God spoke to Moses directly. Did Moses really hear the voice or did Moses just feel that he was in the high spiritual realm as if he were listening to Divine revelation. We cannot know what the real events are, but we must surrender them to Almighty God. Our obligation as believers is only to believe it, as it is stated in the Qur'an.",
      "text_tafsir": "Dalam ayat ini dijelaskan bagaimana Allah memanggil Musa a.s. dan berbicara langsung dengannya di sebelah kanan bukit Tur, yaitu sebuah bukit yang terletak di semenanjung Sinai. Ketika itu Musa sedang menuju ke Mesir dari Madyan untuk menyampaikan dakwahnya kepada Firaun. Di bukit Tursina itulah Musa diberitahukan oleh Allah bahwa dia telah diangkat menjadi rasul dan menjanjikan kepadanya bahwa dia akan menang dalam menghadapi Firaun yang zalim yang mendakwahkan dirinya sebagai Tuhan. Tuhan juga menjanjikan kepadanya akan menurunkan rahmat kepada keluarga Bani Israil dengan menurunkan kitab Taurat. \n\nAllah menerangkan pula bahwa Dia telah mendekatkan Musa kepada-Nya di waktu berbicara itu dengan arti memuliakannya dan memilihnya sebagai Rasul-Nya seakan-akan Musa di waktu itu dekat kepada Tuhan sebagaimana dekatnya seorang raja di waktu berbicara dengan menterinya. Kita tidak dapat mengetahui bagaimana caranya Tuhan berbicara langsung dengan Musa. Apakah Musa benar-benar mendengar suara ataukah Musa hanya merasa bahwa dia telah berada di alam rohani yang tinggi seakan-akan mendengar wahyu Ilahi. Kita tidak dapat mengetahui bagaimana kejadian yang sebenarnya, semua itu harus kita serahkan kepada Allah Yang Mahakuasa. Kewajiban kita sebagai orang mukmin hanya mempercayainya, karena hal itu dikisahkan di dalam Al-Qur'an.",
      "text_translation": "Dan Kami telah memanggilnya dari sebelah kanan gunung (Sinai) dan Kami dekatkan dia untuk bercakap-cakap.",
      "text": "وَنَادَيْنٰهُ مِنْ جَانِبِ الطُّوْرِ الْاَيْمَنِ وَقَرَّبْنٰهُ نَجِيًّا ",
      "text_translation_en": "And [remember how] We called upon him from the right-hand slope of Mount Sinai and drew him near [unto Us] in mystic communion,",
      "juz_number": 16
    },
    "53": {
      "text_tafsir_en": "Among the mercy of God to Moses was that God granted his request that a thousand brother Aaron be appointed a prophet to assist him in delivering the message of his Lord as mentioned in the verse: And make me a helper of my family, (that is) Aaron my brother, strengthen my strength with (his) ), and make him my partner. (thaha \/ 20: 29-30-31-32) And in the verse: And my brother Aaron is a lighter of tongue than mine, and send him with me to help me. Indeed, I am afraid that they will reject me. \"(al-Qashash \/ 28: 34) As the grace and grace of Allah to Moses Allah approved of Moses' request as stated in the verse: He (Allah) said,\" Indeed, your request was granted. , O Moses! (thaha \/ 20: 36) Concerning Moses' request for Aaron some of the scholars (former) among them Ibn Jarir ath-thabari said, \"No one can intercede for anyone other than the intercession given to Aaron by the hand of Moses. \" According to Ibn Abbas' history, Aaron at that time was older than Moses about 4 years old.",
      "text_tafsir": "Di antara rahmat Allah kepada Musa ialah Allah telah mengabulkan permintaannya agar Harun saudara seibu diangkat pula menjadi nabi untuk membantunya dalam menyampaikan risalah Tuhannya sebagai tersebut dalam ayat:\n\nDan jadikanlah untukku seorang pembantu dari keluargaku, (yaitu) Harun, saudaraku, teguhkanlah kekuatanku dengan (adanya) dia, dan jadikanlah dia teman dalam urusanku. (thaha\/20: 29-30-31-32)\n\nDan dalam ayat:\n\nDan saudaraku Harun, dia lebih fasih lidahnya daripada aku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan (perkataan)ku; sungguh, aku takut mereka akan mendustakanku.\" (al-Qashash\/28: 34)\n\nSebagai karunia dan rahmat dari Allah kepada Musa Allah mem-perkenankan permintaan Musa itu seperti tersebut dalam ayat:\n\nDia (Allah) berfirman, \"Sungguh, telah diperkenankan permintaanmu, wahai Musa! (thaha\/20: 36)\n\nMengenai permohonan Nabi Musa a.s. untuk Nabi Harun ini sebagian Ulama salaf (terdahulu) di antaranya Ibnu Jarir ath-thabari mengatakan, \"Tidak ada seorang pun yang dapat memberikan syafaat kepada orang lain lebih besar dari syafaat yang diberikan kepada Harun dengan perantaraan Nabi Musa.\" Menurut riwayat Ibnu Abbas, Harun di waktu itu lebih tua dari Musa sekitar 4 tahun.",
      "text_translation": " Dan Kami telah menganugerahkan sebagian rahmat Kami kepadanya, yaitu (bahwa) saudaranya, Harun, menjadi seorang nabi.",
      "text": "وَوَهَبْنَا لَهٗ مِنْ رَّحْمَتِنَآ اَخَاهُ هٰرُوْنَ نَبِيًّا ",
      "text_translation_en": "and [how], out of Our grace, We granted unto him his brother Aaron, to be a prophet [by his side].",
      "juz_number": 16
    },
    "54": {
      "text_tafsir_en": "In this verse Allah instructs the Prophet Muhammad to recount the Ishmael of the Arabs whom God had appointed as prophets and apostles to set an example for them in his attributes, faithfulness and honesty and his patience in carrying out his commands and obedience and obedience. . One of the most prominent traits is keeping the promise. Keeping the promise is a trait that every prophet and prophet has, but this quality in Ishmael is so prominent that God made it a special privilege for Ishmael. Among the promises he made despite the promise to endanger his soul was his willingness to sacrifice as a sacrifice to carry out the command of God to his father Ibrahim who received the mediation of the ar-ruyah ash-shadiqah (a true dream) worth the revelation. When Abraham discussed with Ishmael the order of Allah to slaughter him, Ishmael emphatically stated that he was willing to be slaughtered in order to obey Allah's command and that he would persevere and endure death no matter how painful and painful it might be. It is stated in the verse: Then when the child was (at the age of) able to work with him, (Abraham) said, \"O my son! Indeed I dream that I slaughter you. Then think what you think!\" He (Ismail) said, \"O my father! Do what He has commanded you; (ash-shaffat \/ 37: 102) That was Ishmael's promise to his father Abraham. The promise was completely fulfilled by Ismail and he handed himself over to his father who had prepared with a sharp knife to slaughter him. Even though Abraham was feeling very pity and pity for Ismail to facilitate slaughter and the knife was aimed at his neck. At that time God called Abraham and replaced Ishmael with a large and fat sheep. This is what Allah says in His word: Then when they had surrendered and he (Abraham) laid down his son on his cheek, (to fulfill Allah's command). Then We called him, \"O Abraham! Surely you have granted the dream.\" Truly, We reward those who do good. This is a real test indeed. And We redeem the boy with a great slaughter. (ash-shaffat \/ 37: 103-107) In addition to this distinguishing feature, Ishmael was appointed by God to be the prophet and apostle to the family of Jurhum who lived in Mecca with his mother. As an apostle, Ishmael was commissioned by God to deliver the pamphlet, a brochure that his father, Abraham, had delivered to the Jurhum tribe. It was before the Prophet Muhammad was sent as an apostle among the Arabs who embraced the monotheism and most likely the monotheism they held was the knowledge that Ishmael carried and conveyed to his people.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad saw supaya menceritakan tentang Ismail nenek moyang bangsa Arab yang diangkat Allah menjadi nabi dan rasul agar dapat menjadi contoh teladan bagi mereka pada sifat-sifatnya, kesetiaan dan kejujurannya ketabahan dan kesabarannya dalam menjalankan perintah Tuhannya dan ketaatan serta kepatuhannya. Salah satu di antara sifat yang sangat menonjol ialah menepati janji. Menepati janji adalah sifat yang dipunyai oleh setiap rasul dan nabi, tetapi sifat ini pada diri Ismail sangat menonjol sehingga Allah menjadikan sifat ini sebagai keistimewaan Ismail. \n\nDi antara janji-janji yang ditepatinya walaupun janji itu membahayakan jiwanya ialah kesediaannya disembelih sebagai kurban untuk melaksanakan perintah Allah kepada ayahnya Ibrahim yang diterimanya dengan perantaraan ar-ruyah ash-shadiqah (mimpi yang benar) yang senilai dengan wahyu. Tatkala Ibrahim membicarakan dengan Ismail tentang perintah Allah untuk menyembelihnya, Ismail dengan tegas menyatakan bahwa dia bersedia disembelih demi untuk mentaati perintah Allah dan dia akan tabah dan sabar menghadapi maut bagaimana pun pedih dan sakitnya. Hal ini tersebut dalam ayat:\n\nMaka ketika anak itu sampai (pada umur) sanggup berusaha bersamanya, (Ibrahim) berkata, \"Wahai anakku! Sesungguhnya aku bermimpi bahwa aku menyembelihmu. Maka pikirkanlah bagaimana pendapatmu!\" Dia (Ismail) menjawab, \"Wahai ayahku! Lakukanlah apa yang diperintahkan (Allah) kepadamu; insya Allah engkau akan mendapatiku termasuk orang yang sabar.\" (ash-shaffat\/37: 102)\n\nItulah janji Ismail kepada bapaknya Ibrahim. Janji itu benar-benar ditepati oleh Ismail dan dia menyerahkan dirinya kepada bapaknya yang telah siap dengan pisau yang tajam untuk menyembelihnya. Ibrahim pun walau dengan perasaan sangat iba dan kasihan merebahkan Ismail untuk memudahkan penyembelihan dan pisau pun telah ditujukan ke lehernya. Ketika itu Allah memanggil Ibrahim dan mengganti Ismail dengan seekor biri-biri yang besar dan gemuk. Hal ini diceritakan Allah dalam firman-Nya:\n\nMaka ketika keduanya telah berserah diri dan dia (Ibrahim) membaringkan anaknya atas pipi(nya), (untuk melaksanakan perintah Allah). Lalu Kami panggil dia, \"Wahai Ibrahim! Sungguh, engkau telah membenarkan mimpi itu.\" Sungguh, demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya ini benar-benar suatu ujian yang nyata. Dan Kami tebus anak itu dengan seekor sembelihan yang besar. (ash-shaffat\/37: 103-107)\n\nDi samping sifat yang menonjol itu Ismail diangkat Allah menjadi nabi dan rasul kepada kabilah Jurhum yang menetap di Mekah bersama ibunya. Sebagai rasul, Ismail ditugaskan Allah menyampaikan risalah yaitu risalah yang pernah disampaikan oleh ayahnya Nabi Ibrahim kepada kabilah Jurhum itu. Memang sebelum Nabi Muhammad diutus sebagai rasul terdapat di kalangan bangsa Arab orang-orang yang menganut paham tauhid dan besar kemungkinan paham tauhid yang dianut mereka adalah paham yang dibawa dan disampaikan oleh Ismail kepada kaumnya.",
      "text_translation": "Dan ceritakanlah (Muhammad), kisah Ismail di dalam Kitab (Al-Qur'an). Dia benar-benar seorang yang benar janjinya, seorang rasul dan nabi.",
      "text": "وَاذْكُرْ فِى الْكِتٰبِ اِسْمٰعِيْلَ ۖاِنَّهٗ كَانَ صَادِقَ الْوَعْدِ وَكَانَ رَسُوْلًا نَّبِيًّا ۚ",
      "text_translation_en": "AND CALL to mind, through this divine writ, Ishmael. Behold, he was always true to his promise, and was an apostle [of God], a prophet,",
      "juz_number": 16
    },
    "55": {
      "text_tafsir_en": "In this verse God explains that Ishmael always asked his family to perform the prayers and perform the alms, because the prayers and alms had been performed since Abraham. The pamphlet presented by Ismail was a brochure carried by his father Ibrahim. Although described here only in relation to his family, the order covers all his people because the apostle was sent not for his family alone but for all his people. The Prophet himself was first told to pass on the teachings of Islam to his family and then he was just ordered to invite all people to follow the teachings he had brought. This is in the word of Allah: And give warning to your relatives (Muhammad), (as-Syu'ara '\/ 26: 214) And to his word: And command your family to perform prayers and to be patient in doing so. (thaha \/ 20: 132) Then Allah made it clear that Ishmael was a man whom God approved because he had never been obedient to his commands, and always performed his duty well.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Ismail selalu menyuruh keluarganya tetap mengerjakan salat dan menunaikan zakat, karena salat dan zakat itu telah disyariatkan semenjak Nabi Ibrahim. Risalah yang disampaikan oleh Nabi Ismail adalah risalah yang dibawa oleh bapaknya Ibrahim. Meskipun yang diterangkan di sini hanya mengenai keluarganya tetapi perintah itu mencakup seluruh kaumnya karena rasul itu diutus bukan untuk keluarga semata tetapi diutus untuk semua umatnya. Nabi Muhammad sendiri pada mulanya hanya disuruh menyampaikan ajaran Islam kepada keluarganya dan kemudian baru diperintahkan mengajak seluruh manusia mengikuti ajaran yang dibawanya. Hal ini terdapat dalam firman Allah:\n\nDan berilah peringatan kepada kerabat-kerabatmu (Muhammad) yang terdekat,(asy- Syu'ara'\/26: 214)\n\nDan firman-Nya:\n\nDan perintahkanlah keluargamu melaksanakan salat dan sabar dalam mengerjakannya. (thaha\/20: 132)\n\nKemudian Allah menerangkan bahwa Ismail itu adalah orang yang diridai Allah karena dia tidak pernah lalai menaati perintah Tuhannya, dan selalu melaksanakan tugasnya dengan sebaik-baiknya.",
      "text_translation": "Dan dia menyuruh keluarganya untuk (melaksanakan) salat dan (menunaikan) zakat, dan dia seorang yang diridai di sisi Tuhannya.",
      "text": "وَكَانَ يَأْمُرُ اَهْلَهٗ بِالصَّلٰوةِ وَالزَّكٰوةِۖ وَكَانَ عِنْدَ رَبِّهٖ مَرْضِيًّا ",
      "text_translation_en": "who used to enjoin upon his people prayer and charity, and found favour in his Sustainer's sight.",
      "juz_number": 16
    },
    "56": {
      "text_tafsir_en": "In these two verses the Prophet Muhammad was instructed to explain a little about the Prophet Idris. According to the historical record, the prophet Idris was the great-grandmother of Noah. He was the first to investigate astrology and astrology, as one of the miracles that God had bestowed upon him. He was the first apostle whom God sent after Adam, and revealed to him a book containing thirty pieces. He is considered the first person to create scales and scales, pens for writing, stitches in place of animal skins and weapons for war. Allah describes in this verse a high position for Prophet Idris because he was a believer who justified the power and uniqueness of God and appointed him a prophet and raised his degrees to the highest level, both in the world and in the hereafter. In the world is the acceptance of a leaflet carried by his people and the fragrance of his name among mankind. It is the same as Allah's gift to the Prophet Muhammad as it says in the word of Allah: \"And We exalt Your name (name) to you.\" (asy-Syarh \/ 94: 4) In the hereafter he will be placed in heaven on the highest and the highest, where the prophets and the shiddiqins are mentioned in the verse: And whoever obeys Allah and the Messenger (Muhammad), then they will together with those whom Allah has bestowed, (that is) prophets, lovers of righteousness, martyrs and godly men. They are the best of friends. (Nisa '\/ 4: 69).",
      "text_tafsir": "Pada kedua ayat ini Nabi Muhammad diperintahkan supaya menerangkan pula sekelumit berita tentang Nabi Idris. Menurut sementara riwayat mengatakan bahwa Nabi Idris adalah nenek Nabi Nuh a.s. Menurut riwayat yang termasyhur ia adalah nenek bapak Nabi Nuh. Ia adalah orang yang pertama menyelidiki ilmu bintang-bintang dan ilmu hisab, sebagai salah satu mukjizat yang diberikan Allah kepadanya. Ia adalah rasul pertama yang diutus Allah sesudah Adam a.s., dan diturunkan kepadanya kitab yang terdiri atas tiga puluh lembar. Ia dianggap pula sebagai orang yang mula-mula menciptakan timbangan dan takaran, pena untuk menulis, pakaian berjahit sebagai ganti pakaian kulit binatang dan senjata untuk berperang. Allah menerangkan pada ayat ini posisi yang tinggi bagi Nabi Idris karena ia adalah seorang yang beriman membenarkan kekuasaan dan keesaan Allah dan diangkat-Nya menjadi nabi dan meninggikan derajatnya ke tingkat yang paling tinggi, baik di dunia maupun di akhirat. Adapun di dunia ialah dengan diterimanya risalah yang dibawanya oleh kaumnya dan keharuman namanya di kalangan umat manusia. Hal ini sama dengan karunia Allah kepada Nabi Muhammad seperti tersebut dalam firman Allah:\n\n\"Dan Kami tinggikan sebutan (nama)mu bagimu.\" (asy-Syarh\/94: 4)\n\nDi akhirat nanti ia ditempatkan di surga pada tempat yang paling tinggi dan mulia, tempat para nabi dan para shiddiqin seperti tersebut dalam ayat:\n\nDan barang siapa menaati Allah dan Rasul (Muhammad), maka mereka itu akan bersama-sama dengan orang yang diberikan nikmat oleh Allah, (yaitu) para nabi, para pecinta kebenaran, orang-orang yang mati syahid dan orang-orang saleh. Mereka itulah teman yang sebaik-baiknya. (an-Nisa'\/4: 69).",
      "text_translation": "Dan ceritakanlah (Muhammad) kisah Idris di dalam Kitab (Al-Qur'an). Sesungguhnya dia seorang yang sangat mencintai kebenaran dan seorang nabi,",
      "text": "وَاذْكُرْ فِى الْكِتٰبِ اِدْرِيْسَۖ اِنَّهٗ كَانَ صِدِّيْقًا نَّبِيًّا ۙ",
      "text_translation_en": "AND CALL to mind, through this divine writ, Idris. Behold, he was a man of truth, a prophet,",
      "juz_number": 16
    },
    "57": {
      "text_tafsir_en": "In these two verses the Prophet Muhammad was instructed to explain a little about the Prophet Idris. According to the historical record, the prophet Idris was the great-grandmother of Noah. He was the first to investigate astrology and astrology, as one of the miracles that God had bestowed upon him. He was the first apostle whom God sent after Adam, and revealed to him a book containing thirty pieces. He is considered the first person to create scales and scales, pens for writing, stitches in place of animal skins and weapons for war. Allah describes in this verse a high position for Prophet Idris because he was a believer who justified the power and uniqueness of God and appointed him a prophet and raised his degrees to the highest level, both in the world and in the hereafter. In the world is the acceptance of a leaflet carried by his people and the fragrance of his name among mankind. It is the same as Allah's gift to the Prophet Muhammad as it says in the word of Allah: \"And We exalt Your name (name) to you.\" (asy-Syarh \/ 94: 4) In the hereafter he will be placed in heaven on the highest and the highest, where the prophets and the shiddiqins are mentioned in the verse: And whoever obeys Allah and the Messenger (Muhammad), then they will together with those whom Allah has bestowed, (that is) prophets, lovers of righteousness, martyrs and godly men. They are the best of friends. (Nisa '\/ 4: 69).",
      "text_tafsir": "Pada kedua ayat ini Nabi Muhammad diperintahkan supaya menerangkan pula sekelumit berita tentang Nabi Idris. Menurut sementara riwayat mengatakan bahwa Nabi Idris adalah nenek Nabi Nuh a.s. Menurut riwayat yang termasyhur ia adalah nenek bapak Nabi Nuh. Ia adalah orang yang pertama menyelidiki ilmu bintang-bintang dan ilmu hisab, sebagai salah satu mukjizat yang diberikan Allah kepadanya. Ia adalah rasul pertama yang diutus Allah sesudah Adam a.s., dan diturunkan kepadanya kitab yang terdiri atas tiga puluh lembar. Ia dianggap pula sebagai orang yang mula-mula menciptakan timbangan dan takaran, pena untuk menulis, pakaian berjahit sebagai ganti pakaian kulit binatang dan senjata untuk berperang. Allah menerangkan pada ayat ini posisi yang tinggi bagi Nabi Idris karena ia adalah seorang yang beriman membenarkan kekuasaan dan keesaan Allah dan diangkat-Nya menjadi nabi dan meninggikan derajatnya ke tingkat yang paling tinggi, baik di dunia maupun di akhirat. Adapun di dunia ialah dengan diterimanya risalah yang dibawanya oleh kaumnya dan keharuman namanya di kalangan umat manusia. Hal ini sama dengan karunia Allah kepada Nabi Muhammad seperti tersebut dalam firman Allah:\n\n\"Dan Kami tinggikan sebutan (nama)mu bagimu.\" (asy-Syarh\/94: 4)\n\nDi akhirat nanti ia ditempatkan di surga pada tempat yang paling tinggi dan mulia, tempat para nabi dan para shiddiqin seperti tersebut dalam ayat:\n\nDan barang siapa menaati Allah dan Rasul (Muhammad), maka mereka itu akan bersama-sama dengan orang yang diberikan nikmat oleh Allah, (yaitu) para nabi, para pecinta kebenaran, orang-orang yang mati syahid dan orang-orang saleh. Mereka itulah teman yang sebaik-baiknya. (an-Nisa'\/4: 69).",
      "text_translation": "dan Kami telah mengangkatnya ke martabat yang tinggi.",
      "text": "وَّرَفَعْنٰهُ مَكَانًا عَلِيًّا ",
      "text_translation_en": "whom We exalted onto a lofty station.",
      "juz_number": 16
    },
    "58": {
      "text_tafsir_en": "In this verse God explains that the prophets and apostles whose names are mentioned in the previous verses are those who have been given grace and favor by God by elevating their degrees and making their name known among mankind. Generally all prophets and apostles receive such gifts from the first Adam to the second Noah, to Abraham and his grandchildren including Isaac, Jacob, Ishmael, Moses, Aaron, Zechariah, Jesus and all His chosen ones. , they all have a rare trait that when read to them the verses of Allah they immediately fall down (to fall) to prostrate and weep and humble themselves in remembrance of Allah's greatness. They are a man of piety, very sharp of hearing and of feeling when they hear the name of God and tremble at their readings His words do not have the words they would say to draw what is in their heart to shed tears on their cheeks and they bow down to the presence of the Almighty, the Almighty, the Merciful and the Merciful. Such is the nature of those prophets and apostles and it is only right that Allah give them great gifts and favors. It is also mentioned in the word of Allah: Those who believe are those who are called by the name of Allah, whose hearts are shaken, and when their verses are read to them, their faith becomes stronger and their Lord alone. (an-Anfal \/ 8: 2) The Messenger of Allah (may peace be upon him) said: Read the Qur'an and cry, if you cannot cry, try to cry. (History of Ibn Majah)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa para nabi dan rasul yang telah disebutkan namanya pada ayat-ayat yang lalu mereka itulah orang-orang yang telah diberi karunia dan nikmat oleh Allah dengan meninggikan derajat mereka dan mengharumkan nama mereka di kalangan umat manusia. Pada umumnya semua nabi dan rasul mendapat karunia seperti itu semenjak dari Nabi Adam bapak pertama sampai kepada Nabi Nuh bapak kedua, sampai kepada Nabi Ibrahim dan anak cucunya termasuk Ishak, Yakub, Ismail, Musa, Harun, Zakaria, Isa dan semua orang pilihan-Nya, semuanya mempunyai sifat yang jarang dimiliki oleh orang lain yaitu apabila dibacakan kepadanya ayat-ayat Allah mereka segera menjatuhkan diri (tersungkur) untuk sujud dan menangis serta merendahkan diri karena mengingat kebesaran Allah. Mereka adalah manusia yang penuh takwa, sangat tajam pendengaran dan perasaan mereka bila mendengar nama Allah dan bergetar hati mereka bila dibacakan ayat-ayat-Nya tidak memiliki kata-kata yang akan mereka ucapkan untuk melukiskan apa yang terasa dalam hati sehingga meneteskan air mata di pipi mereka dan tersungkur bersujud kehadirat Allah Yang Mahabesar, Mahakuasa, Maha Pengasih dan Maha Penyayang. Demikianlah sifat yang dimiliki oleh para nabi dan rasul itu dan wajarlah bila Allah memberikan kepada mereka karunia dan nikmat yang besar. Hal ini disebutkan pula dalam firman Allah:\n\nSesungguhnya orang-orang yang beriman adalah mereka yang apabila disebut nama Allah gemetar hatinya, dan apabila dibacakan ayat-ayat-Nya kepada mereka, bertambah (kuat) imannya dan hanya kepada Tuhan mereka bertawakal. (an-Anfal\/8: 2)\n\nRasulullah saw, bersabda:\n\nBacalah Al-Qur'an dan menangislah, jika kamu tidak bisa menangis, berusahalah menangis. (Riwayat Ibnu Majah)",
      "text_translation": "Mereka itulah orang yang telah diberi nikmat oleh Allah, yaitu dari (golongan) para nabi dari keturunan Adam, dan dari orang yang Kami bawa (dalam kapal) bersama Nuh, dan dari keturunan Ibrahim dan Israil (Yakub) dan dari orang yang telah Kami beri petunjuk dan telah Kami pilih. Apabila dibacakan ayat-ayat Allah Yang Maha Pengasih kepada mereka, maka mereka tunduk sujud dan menangis.",
      "text": "اُولٰۤىِٕكَ الَّذِيْنَ اَنْعَمَ اللّٰهُ عَلَيْهِمْ مِّنَ النَّبِيّٖنَ مِنْ ذُرِّيَّةِ اٰدَمَ وَمِمَّنْ حَمَلْنَا مَعَ نُوْحٍۖ وَّمِنْ ذُرِّيَّةِ اِبْرٰهِيْمَ وَاِسْرَاۤءِيْلَ ۖوَمِمَّنْ هَدَيْنَا وَاجْتَبَيْنَاۗ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُ الرَّحْمٰنِ خَرُّوْا سُجَّدًا وَّبُكِيًّا ۩",
      "text_translation_en": "THESE WERE some of the prophets upon whom God bestowed His blessings - [prophets] of the seed of Adam and of those whom We caused to be borne [in the ark] with Noah, and of the seed of Abraham and Israel and [all of them were] among those whom We had guided and elected; [and] whenever the messages of the Most Gracious were conveyed unto them, they would fall down [before Him], prostrating themselves and weeping.",
      "juz_number": 16
    },
    "59": {
      "text_tafsir_en": "In this verse God explains that many of the people came later after the death of the prophets and apostles mentioned in previous verses, deviating from the straight path, abandoning the precepts that the apostles had taken before so that they would no longer perform the prayers and always to obey the lust and openly violate God's prohibitions such as drinking alcohol, gambling, adultery, and bearing false witness. These men were threatened by God with great threat, to them danger and loss both in the world and in the hereafter. In connection with this verse, Abu Sa'id al-Khudri recounts that the Messenger of Allah (may peace be upon him) said: \"There will come a generation after sixty years, they will pray and obey their desires, and these people will find misfortune and loss. generations, they read the Qur'an but only in the throat (mouth) (not in the heart) and all read the Qur'an, the believers, the hypocrites and the wicked and the wicked (it is indistinguishable) true believers and those who pretend to believe). \" (History of Ahmad, Ibn hibban and al-judge) Then the Messenger of Allah (may peace be upon him) recited this verse (as mentioned above). 'Uqbah bin' Amir recounted that I heard the Messenger of Allah say: \"Destroy some of my people,\" Ahlul Book \"and\" Ahlullaban. \"I asked,\" Who is \"Ahlul Kitab\", O Messenger of Allah? \" who study the Qur'an to argue with the believers. \"\" Then who is the \"Ahlullaban\"? \"The Messenger of Allah (may peace be upon him) replied,\" They are the ones who follow their desires and leave the prayers. \" al-judge of 'Uqbah bin' Amir al-Juhhani) Thus the fate of those who neglect their prayers and follow their passions and waste them, they will surely suffer even if they suffer unseen and will surely receive a fair reward in Here it is clear here that the prayer that has been a Shari'a since the time of Abraham is very important and should not be wasted or abandoned. It is reported that the Prophet Muhammad said: is a pillar of religion. Whoever founded it he upheld the religion, and whoever left it he destroyed religion. \"(History of al-Baihaqi of Umar ra)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa banyak di antara orang-orang datang kemudian sesudah meninggalnya para nabi dan rasul yang disebutkan pada ayat-ayat yang lalu, menyimpang dari jalan yang lurus, meninggalkan ajaran yang dibawa para rasul sebelumnya sehingga mereka tidak lagi mengerjakan salat dan selalu memperturutkan kehendak hawa nafsu dan dengan terang-terangan melanggar larangan Allah seperti meminum minuman keras, berjudi, berzina, dan mengadakan persaksian palsu. Mereka ini diancam oleh Allah dengan ancaman yang keras, kepada mereka akan ditimpakan kecelakaan dan kerugian baik di dunia maupun di akhirat. Sehubungan dengan ayat ini Abu Sa'id al-Khudri meriwayatkan bahwa Rasulullah saw bersabda: \n\n\"Akan datang suatu generasi sesudah enam puluh tahun, mereka melalaikan salat dan memperturutkan hawa nafsu, maka orang-orang ini akan menemui kecelakaan dan kerugian. Kemudian datang lagi suatu generasi, mereka membaca Al-Qur'an tetapi hanya di kerongkongan (mulut) saja (tidak masuk ke hati) dan semua membaca Al-Qur'an, orang mukmin, orang munafik dan orang-orang jahat dan fasik (tidak dapat lagi dibedakan mana orang mukmin sejati dan mana orang yang berpura-pura beriman).\" (Riwayat Ahmad, Ibnu hibban dan al-hakim)\n\nKemudian Rasulullah membaca ayat ini (sebagaimana tersebut di atas).\n\n'Uqbah bin 'Amir meriwayatkan pula bahwa aku mendengar Rasulullah bersabda: \n\n\"Akan rusak binasalah sebahagian dari umatku yaitu \"Ahlul Kitab\" dan \"Ahlullaban\". Aku bertanya, \"Siapakah \"Ahlul Kitab\" wahai Rasulullah?\" Beliau menjawab, \"Mereka ialah orang-orang yang mempelajari Al-Qur'an untuk berdebat dengan orang-orang mukmin.\" \"Lalu siapa pula \"Ahlullaban\" itu?\" Rasulullah menjawab, \"Mereka ialah orang-orang yang memperturutkan hawa nafsu dan meninggalkan salat.\" (Riwayat Ahmad dan al-hakim dari 'Uqbah bin 'Amir al-Juhhani)\n\nDemikian nasib orang-orang yang melalaikan salat dan memperturutkan hawa nafsu dan menyia-nyiakannya, mereka pasti merugi meskipun yang mereka derita tidak dapat dilihat dengan mata dan pasti akan menerima balasan yang setimpal di akhirat kelak. Di sini tampak dengan jelas bahwa salat yang telah menjadi syariat semenjak Nabi Ibrahim adalah amat penting sekali dan tidak boleh disia-siakan apalagi ditinggalkan. Diriwayatkan bahwa Nabi Muhammad saw bersabda:\n\n\"Salat itu adalah tiang agama. Barangsiapa yang mendirikannya maka ia telah menegakkan agama, dan barangsiapa yang meninggalkannya maka ia telah meruntuhkan agama.\" (Riwayat al-Baihaqi dari Umar r.a.)",
      "text_translation": "Kemudian datanglah setelah mereka pengganti yang mengabaikan salat dan mengikuti keinginannya, maka mereka kelak akan tersesat,",
      "text": "۞ فَخَلَفَ مِنْۢ بَعْدِهِمْ خَلْفٌ اَضَاعُوا الصَّلٰوةَ وَاتَّبَعُوا الشَّهَوٰتِ فَسَوْفَ يَلْقَوْنَ غَيًّا ۙ",
      "text_translation_en": "Yet they were succeeded by generations [of people] who lost all [thought of] prayer and followed [but] their own lusts; and these will, in time, meet with utter disillusion.",
      "juz_number": 16
    },
    "60": {
      "text_tafsir_en": "In this verse God explains that the person in verse 59 when they repent and do good deeds then God will forgive their sins and will be admitted into heaven and they will not be harmed. Such is the decree of the All-Mighty, the Merciful and the Merciful. Even though one has been dragged down into the abyss of deception by being deceived and deceived by mortal worldly delusions, but when they repent and return to the right path and repent to Allah, truly Allah will accept their repentance with the terms and conditions. described in other verses.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa orang tersebut pada ayat 59 bila mereka bertobat dan kembali mengerjakan amal yang saleh maka Allah akan mengampuni dosa mereka dan akan dimasukkan ke dalam surga dan mereka tidak akan dirugikan sedikitpun. Demikianlah ketetapan Allah Yang Mahaadil, Maha Pemurah dan Maha Penyayang. Meskipun seseorang telah berlarut-larut terjerumus ke dalam jurang kemaksiatan karena tertipu dan teperdaya dengan kelezatan duniawi yang fana, tetapi bila mereka insaf dan kembali ke jalan yang benar dan bertobat kepada Allah sebenar-benar tobat Allah akan menerima tobat mereka dengan ketentuan dan syarat-syarat yang diterangkan pada ayat-ayat lain.",
      "text_translation": "Kecuali orang yang bertobat, beriman dan mengerjakan kebajikan, maka mereka itu akan masuk surga dan tidak dizalimi (dirugikan) sedikit pun,",
      "text": "اِلَّا مَنْ تَابَ وَاٰمَنَ وَعَمِلَ صَالِحًا فَاُولٰۤىِٕكَ يَدْخُلُوْنَ الْجَنَّةَ وَلَا يُظْلَمُوْنَ شَيْـًٔا ۙ",
      "text_translation_en": "Excepted, however, shall be those who repent and attain to faith and do righteous deeds: for it is they who will enter paradise and will not be wronged in any way:",
      "juz_number": 16
    },
    "61": {
      "text_tafsir_en": "This verse explains that the paradise promised by God will be a residence for those who repent and are pious, is heaven 'Adn. Although the promised paradise cannot be seen by humans in this world, because it is still supernatural and when humans will definitely enter it can not be known with certainty because all that is only known by God. But for those who believe and believe in the day of resurrection and reckoning, that is not in the slightest doubt because it is the promise of Allah the Most Perfect, the Just and the Wise. Surely He will fulfill that promise and He will deliver it.",
      "text_tafsir": "Ayat ini menerangkan bahwa surga yang dijanjikan Allah akan menjadi tempat kediaman bagi orang yang bertobat dan bertakwa itu, ialah surga 'Adn. Meskipun surga yang dijanjikan tidak dapat dilihat oleh manusia di dunia ini, karena masih bersifat gaib dan kapan manusia itu pasti masuk ke dalamnya tidak pula dapat diketahui dengan pasti karena semua itu hanya diketahui oleh Allah. Tetapi bagi orang yang beriman dan yakin akan terjadinya hari kebangkitan dan hisab, hal itu tidak diragukan sedikit pun karena itu adalah janji Allah Yang Mahasempurna, Mahaadil dan Maha Bijaksana. Pastilah janji itu akan dipenuhi-Nya dan akan dilaksanakan-Nya.",
      "text_translation": "yaitu surga ‘Adn yang telah dijanjikan oleh Tuhan Yang Maha Pengasih kepada hamba-hamba-Nya, sekalipun (surga itu) tidak tampak. Sungguh, (janji Allah) itu pasti ditepati.",
      "text": "جَنّٰتِ عَدْنِ ِۨالَّتِيْ وَعَدَ الرَّحْمٰنُ عِبَادَهٗ بِالْغَيْبِۗ اِنَّهٗ كَانَ وَعْدُهٗ مَأْتِيًّا ",
      "text_translation_en": "[theirs will be the] gardens of perpetual bliss which the Most Gracious has promised unto His servants, in a realm which is beyond the reach of human perception: [and,] verily, His promise is ever sure of fulfilment!",
      "juz_number": 16
    },
    "62": {
      "text_tafsir_en": "God also explains that in heaven there will be no quarrels, no words will be heard in vain in a world where man is for his own sake or for the sake of his family and his group is always at odds, quarrels, accusations and accusations, blaming it indefinitely, causing them to lose their peace and prosperity. They are even covered with anxiety and anxiety. Other than heaven because humans have entered another world, all desires can be fulfilled and fulfilled, there is no enmity or strife between them to accomplish something, so that only heard greetings (well-being), whether it comes from angels or from one another. They all feel safe and secure because every morning and evening they are provided by their God, an indescribable provision in one's mind of how delicious and delicious it tastes. Allah enumerates the blessings provided for the inhabitants of heaven, as stated in the Hadith of Qudsi: I provide for my virtuous servants the unseen delights of the eyes, which have never been heard by the ear and which cannot be imagined in the trajectory of the heart human. (History of al-Bukhari and Muslim from Abu Hurairah)",
      "text_tafsir": "Allah menerangkan pula bahwa di dalam surga tidak akan terjadi pertengkaran, tidak akan terdengar kata-kata yang tidak berguna seperti yang terjadi di dunia di mana manusia untuk kepentingan dirinya sendiri atau untuk kepentingan keluarga dan kelompoknya selalu berselisih, bertengkar, dakwa- mendakwa dan tuduh-menuduh yang tiada akhirnya, mengakibatkan mereka kehilangan ketenteraman dan kesejahteraan. Bahkan mereka diliputi kecemasan dan kekhawatiran. Lain halnya dengan surga karena manusia telah memasuki dunia yang lain, semua keinginan dapat dicapai dan dinikmati, tidak ada lagi permusuhan atau adu kekuatan antara sesama mereka untuk mencapai sesuatu, maka yang terdengar hanya ucapan salam (selamat sejahtera), baik ucapan itu datang dari malaikat atau dari sesama mereka. Semuanya merasa aman dan tenteram karena pada setiap pagi dan petang mereka diberi rezeki oleh Tuhan mereka, rezeki yang tidak dapat dibayangkan dalam pikiran seseorang bagaimana nikmat dan lezat cita rasanya. Allah melukiskan nikmat yang disediakan bagi penghuni surga, sebagaimana disebut dalam Hadis Qudsi:\n\nAku sediakan untuk hamba-hamba-Ku yang saleh nikmat-nikmat yang belum pernah di lihat oleh mata, yang belum pernah di dengar oleh telinga dan tidak dapat dibayangkan dalam lintasan hati manusia. (Riwayat al-Bukhari dan Muslim dari Abu Hurairah)",
      "text_translation": "Di dalamnya mereka tidak mendengar perkataan yang tidak berguna, kecuali (ucapan) salam. Dan di dalamnya bagi mereka ada rezeki pagi dan petang.",
      "text": "لَا يَسْمَعُوْنَ فِيْهَا لَغْوًا اِلَّا سَلٰمًاۗ وَلَهُمْ رِزْقُهُمْ فِيْهَا بُكْرَةً وَّعَشِيًّا ",
      "text_translation_en": "No empty talk will they hear there-nothing but [tidings of] inner soundness and peace; and there will they have their sustenance by day and by night:",
      "juz_number": 16
    },
    "63": {
      "text_tafsir_en": "Such is the atmosphere in a safe and peaceful heaven, a happy and peaceful atmosphere. The people are satisfied and satisfied with the favor and grace that God has bestowed upon them, and God is pleased with them because they are always obedient and obedient to Him, patiently facing His trials as they say in His Word: \"God says,\" This is when the righteous benefit from their righteousness, they find a paradise flowing under the rivers, they remain in it forever. God is with them and they seek him. That is a great victory. \" (al-Ma'idah \/ 5: 119) Such is the condition and nature of heaven that he will pass on to his faithful servant and will always fear him as it is said in his Word: Best friends on that day hostile to each other, except those who fear. \"O my servants! There is no fear for you in that day, nor do you grieve. (Those) who believe in Our Signs and they surrender. be happy. \" To them were given plates and cups of gold, and in heaven there was what the heart and all that pleased (eyes) desired. And you stay in it. And that is the heaven that is bestowed upon you by the deeds of your deeds. In that paradise there are many fruits for you that you partially eat. (az-Zukhruf \/ 43: 63-73)",
      "text_tafsir": "Demikianlah suasana di dalam surga aman dan tenteram, suasana bahagia dan sejahtera. Penghuninya merasa lega dan puas dengan nikmat dan karunia yang dilimpahkan Tuhan kepada mereka, dan Allah pun rida terhadap mereka karena mereka di dunia selalu patuh dan taat kepada-Nya, sabar dalam menghadapi cobaan-Nya sebagaimana tersebut dalam firman-Nya:\n\nAllah berfirman, \"Inilah saat orang yang benar memperoleh manfaat dari kebenarannya. Mereka memperoleh surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya selama-lamanya. Allah rida kepada mereka dan mereka pun rida kepada-Nya. Itulah kemenangan yang agung.\" (al-Ma'idah\/5: 119)\n\nDemikian keadaan dan sifat surga yang akan diwariskan-Nya kepada hamba-Nya yang benar-benar beriman dan selalu bertakwa kepada-Nya sebagaimana tersebut dalam firman-Nya:\n\nTeman-teman karib pada hari itu saling bermusuhan satu sama lain, kecuali mereka yang bertakwa. \"Wahai hamba-hamba-Ku! Tidak ada ketakutan bagimu pada hari itu dan tidak pula kamu bersedih hati. (Yaitu) orang-orang yang beriman kepada ayat-ayat Kami dan mereka berserah diri. Masuklah kamu ke dalam surga, kamu dan pasanganmu akan digembirakan.\" Kepada mereka diedarkan piring-piring dan gelas-gelas dari emas, dan di dalam surga itu terdapat apa yang diingini oleh hati dan segala yang sedap (dipandang) mata. Dan kamu kekal di dalamnya. Dan itulah surga yang diwariskan kepada kamu disebabkan amal perbuatan yang telah kamu kerjakan. Di dalam surga itu terdapat banyak buah-buahan untukmu yang sebagiannya kamu makan. (az-Zukhruf\/43: 63-73)",
      "text_translation": "Itulah surga yang akan Kami wariskan kepada hamba-hamba Kami yang selalu bertakwa.",
      "text": "تِلْكَ الْجَنَّةُ الَّتِيْ نُوْرِثُ مِنْ عِبَادِنَا مَنْ كَانَ تَقِيًّا ",
      "text_translation_en": "this is the paradise which We grant as a heritage unto such of Our servants as are conscious of Us.",
      "juz_number": 16
    },
    "64": {
      "text_tafsir_en": "In this verse Gabriel emphasizes to the Prophet Muhammad that angels would not be able to come down to bring revelation to the apostles unless they had received orders from Allah according to His will and wisdom, in the interests of His servants, both in regard to worldly affairs and the afterlife. It is He who has all that is before us and behind us, and who is between them; Therefore He knows more about what is good and what is bad for His creatures. He determines when the angels will come down to his apostles to bring revelation, and for how long he will let the angels not descend upon them according to his knowledge and wisdom. So if the angel was late sending the revelation to the Apostle, it was not because God had left the Messenger, was angry or He had forgotten it. It is impossible for Allah to forget and forget.",
      "text_tafsir": "Pada ayat ini Jibril menegaskan kepada Nabi Muhammad bahwa para malaikat tidak akan dapat turun membawa wahyu kepada rasul-rasul kecuali bila mereka telah mendapat perintah dari Allah sesuai dengan kehendak dan kebijaksanaan-Nya, sesuai dengan kepentingan hamba-Nya, baik mengenai urusan duniawi maupun mengenai urusan akhirat. Dialah yang memiliki semua yang ada di hadapan dan di belakang kita dan yang ada di antara keduanya, Dialah yang mengurus dan mengaturnya. Karena itu Dia pulalah yang lebih mengetahui tentang yang baik dan yang tidak baik bagi makhluk-Nya. Dialah yang menetapkan kapan para malaikat akan turun kepada rasul-Nya untuk membawa wahyu, dan untuk berapa lama Dia membiarkan malaikat tidak turun kepada mereka sesuai dengan ilmu dan kebijaksanaan-Nya. Jadi kalau malaikat terlambat menurunkan wahyu kepada Rasul, bukanlah itu karena Allah telah meninggalkan Rasul, murka atau Dia telah lupa kepadanya. Mustahil Allah bersifat lalai dan lupa.",
      "text_translation": " Dan tidaklah kami (Jibril) turun, kecuali atas perintah Tuhanmu. Milik-Nya segala yang ada di hadapan kita, yang ada di belakang kita, dan segala yang ada di antara keduanya, dan Tuhanmu tidak lupa.",
      "text": "وَمَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَۚ  لَهٗ مَا بَيْنَ اَيْدِيْنَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذٰلِكَ وَمَا كَانَ رَبُّكَ نَسِيًّا ۚ",
      "text_translation_en": "AND [the angels say]: \"We do not descend [with revelation], again and again, other than by thy Sustainer's command: unto Him belongs all that lies open before us and all that is hidden-from us and all that is in-between. And never does thy Sustainer forget [anything] –",
      "juz_number": 16
    },
    "65": {
      "text_tafsir_en": "How can God be so forgetful and forgetful that He is the One who has control and control over everything in heaven and on earth and all that is between them. Almighty Allah will never forget or forget to take care of all His creatures. Therefore do not let the Apostle think that Allah has been angry with him by the late revelation. All of this happened in accordance with His will and wisdom. The apostle was ordered to wait patiently and continue to worship him in spite of the blasphemy uttered by the monks. Verily, God is the One and Only God, there is nothing that can equal Him, so He has to submit, obey and obey His commands.",
      "text_tafsir": "Bagaimana mungkin Tuhan akan bersifat lalai dan lupa padahal Dialah yang memiliki dan mengurus serta mengendalikan semua yang ada di langit dan di bumi dan semua yang ada di antara keduanya. Allah Yang Mahakuasa dan Mahabijaksana sekali-kali tidak akan lalai atau lupa mengurus dan mengatur semua makhluk-Nya. Oleh sebab itu jangan sampai Rasul menyangka bahwa Allah telah murka kepadanya dengan terlambatnya wahyu. Semua itu berlaku sesuai dengan kehendak dan kebijaksanaan-Nya. Rasul diperintahkan untuk menunggu dengan sabar dan terus beribadah kepada-Nya walau apapun ocehan yang diucapkan oleh kaum musyrik itu. Sesungguhnya Allah adalah Tuhan Yang Maha Esa tidak ada sesuatu yang dapat menyamai-Nya karena itu kepada-Nyalah manusia harus berserah diri, patuh dan taat mengerjakan perintah-Nya.",
      "text_translation": "(Dialah) Tuhan (yang menguasai) langit dan bumi dan segala yang ada di antara keduanya, maka sembahlah Dia dan berteguhhatilah dalam beribadah kepada-Nya. Apakah engkau mengetahui ada sesuatu yang sama dengan-Nya?",
      "text": "رَبُّ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهٖۗ هَلْ تَعْلَمُ لَهٗ سَمِيًّا ࣖ",
      "text_translation_en": "the Sustainer of the heavens and the earth and all that is between them! Worship, then, Him alone, and remain steadfast in His worship! Dost thou know any whose name is worthy to be mentioned side by side with His?\"",
      "juz_number": 16
    },
    "66": {
      "text_tafsir_en": "Al-Wahidi narrates that this verse was revealed in the case of Ubay bin Khalaf. He took a piece of bone that had nearly crushed and crushed it with his hands like flour, and scattered it into a strong wind, and scattered it. Then he said, \"Some say that we will be resurrected after we die and we will become like this bone.\" Is it possible that when I die I will be resurrected and resurrected? The same question is found in the other verses: And they say, \"When we are dead, shall we become earth and bones, shall we indeed be raised again?\" (al-Waqi'ah \/ 56: 47) And His word: And they say, \"When we are made a new bone and a crushed thing, shall we indeed be raised again as a new creature?\" . bright truth. Therefore Allah rejected their questions. Do people who think that way never know that God created it from nothing. Whether one can create something out of nothing, it can also create something from something that exists in the form of bones or broken objects. This is a strange thought that will not arise except from those whose hearts have been surrounded by disobedience and who do not intend to ponder the question carefully and in depth. In another verse God says: And it is He Who initiates creation, then repeats it, and it is easier for Him. He has the highest nature in heaven and on earth. And He is the Mighty, the Wise. (ar-Romans \/ 30: 27) And his word: And he maketh for us a parable, And forgetteth the origin of his creation; he said, \"Who can revive the bones, which have perished?\" Say (Muhammad), \"It is He who created him first, and He is the All-Knowing of all beings.\" (Yasin \/ 36: 78-79) In a Qur'anic Hadith Allah says: \"The Son of Adam has denied me he has no right to lie to me. The son of Adam has hurt me while he has no right to bear with me. The lie about me was that he said I would not revive it as I had created it for the first time. Creating it first isn't easier for me than creating it later (meaning just as easy). What hurts me is the utterance: \"Indeed I have children, and I am the only true God, who hangs on me, who is childless and childless, and no one is equal to me.\" Bukhari of Abu Hurairah)",
      "text_tafsir": "Al-Wahidi meriwayatkan bahwa ayat ini diturunkan dalam kasus Ubay bin Khalaf. Dia mengambil sepotong tulang yang telah hampir remuk dan dihancurkannya dengan tangan seperti tepung, kemudian ditebarkannya ke angin kencang, maka bertebaranlah tulang itu. Kemudian dia berkata, \"Ada orang mengatakan bahwa kita akan dibangkitkan sesudah kita mati dan sesudah kita menjadi seperti tulang ini.\" Apakah mungkin apabila saya telah mati akan dibangkitkan dan dihidupkan kembali? Pertanyaan seperti itu terdapat pula pada ayat-ayat yang lain:\n\nDan mereka berkata, \"Apabila kami sudah mati, menjadi tanah dan tulang-belulang, apakah kami benar-benar akan dibangkitkan kembali?\"\n\n(al-Waqi'ah\/56: 47)\n\nDan firman-Nya:\n\nDan mereka berkata, \"Apabila kami telah menjadi tulang-belulang dan benda-benda yang hancur, apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk yang baru?\" (al-Isra'\/17: 49)\n\nDemikian pertanyaan-pertanyaan yang dikemukakan oleh orang yang dangkal pikirannya dan tidak mau memikirkan secara mendalam kekuasaan Allah, karena mata hati mereka telah ditutupi oleh kesesatan dan kesenangan hidup dunia, sehingga tidak tampak lagi bagi mereka cahaya kebenaran yang terang benderang. Oleh sebab itu Allah menolak pertanyaan-pertanyaan mereka. Apakah manusia yang berpikiran seperti itu tidak pernah tahu bahwa Allah telah menciptakannya dari tiada. Apakah ada yang dapat menciptakan sesuatu dari tiada, dapat pula menciptakannya dari sesuatu yang ada walaupun berupa tulang belulang atau benda-benda yang hancur. Ini adalah suatu pemikiran yang aneh yang tidak akan timbul kecuali dari orang-orang yang hatinya telah diselubungi oleh keingkaran dan tidak mau memikirkan persoalan dengan teliti dan mendalam. Pada ayat lain Allah berfirman:\n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. Dia memiliki sifat yang Mahatinggi di langit dan di bumi. Dan Dialah Yang Mahaperkasa, Mahabijaksana. (ar-Rum\/30: 27)\n\nDan firman-Nya:\n\nDan dia membuat perumpamaan bagi Kami dan melupakan asal kejadiannya; dia berkata, \"Siapakah yang dapat menghidupkan tulang-belulang, yang telah hancur luluh?\" Katakanlah (Muhammad), \"Yang akan menghidupkannya ialah (Allah) yang menciptakannya pertama kali. Dan Dia Maha Mengetahui tentang segala makhluk. (Yasin\/36: 78-79)\n\nDalam sebuah hadis Qudsi Allah berfirman: \n\n\"Anak Adam telah mendustakan-Ku sedang dia tidak berhak mendusta-kan-Ku. Anak Adam telah menyakiti-Ku sedang dia tidak berhak menya-kiti-Ku. Adapun pendustaannya terhadap-Ku ialah ucapannya bahwa Aku tidak akan menghidupkannya kembali sebagaimana Aku telah menciptakannya pertama kali. Menciptakannya pertama kali tidaklah lebih mudah bagi-Ku dari menciptakan kemudian (maksudnya sama mudah). Adapun yang menyakiti-Ku ialah ucapannya: Sesungguhnya Aku mempunyai anak, sedang Aku adalah Tuhan Yang Maha Esa Yang tergantung kepada-Ku segala sesuatu, yang tidak beranak dan tidak pula dilahirkan dan tidak ada seorang pun yang setara dengan Aku.\" (Riwayat al-Bukhari dari Abu Hurairah)",
      "text_translation": " Dan orang (kafir) berkata, “Betulkah apabila aku telah mati, kelak aku sungguh-sungguh akan dibangkitkan hidup kembali?”",
      "text": "وَيَقُوْلُ الْاِنْسَانُ ءَاِذَا مَا مِتُّ لَسَوْفَ اُخْرَجُ حَيًّا ",
      "text_translation_en": "WITH ALL THIS, man [often] says, \"What! Once I am dead, shall I again be brought forth alive?\"",
      "juz_number": 16
    },
    "67": {
      "text_tafsir_en": "Al-Wahidi narrates that this verse was revealed in the case of Ubay bin Khalaf. He took a piece of bone that had nearly crushed and crushed it with his hands like flour, and scattered it into a strong wind, and scattered it. Then he said, \"Some say that we will be resurrected after we die and we will become like this bone.\" Is it possible that when I die I will be resurrected and resurrected? The same question is found in the other verses: And they say, \"When we are dead, shall we become earth and bones, shall we indeed be raised again?\" (al-Waqi'ah \/ 56: 47) And His word: And they say, \"When we are made a new bone and a crushed thing, shall we indeed be raised again as a new creature?\" . bright truth. Therefore Allah rejected their questions. Do people who think that way never know that God created it from nothing. Whether one can create something out of nothing, it can also create something from something that exists in the form of bones or broken objects. This is a strange thought that will not arise except from those whose hearts have been surrounded by disobedience and who do not intend to ponder the question carefully and in depth. In another verse God says: And it is He Who initiates creation, then repeats it, and it is easier for Him. He has the highest nature in heaven and on earth. And He is the Mighty, the Wise. (ar-Romans \/ 30: 27) And his word: And he maketh for us a parable, And forgetteth the origin of his creation; he said, \"Who can revive the bones, which have perished?\" Say (Muhammad), \"It is He who created him first, and He is the All-Knowing of all beings.\" (Yasin \/ 36: 78-79) In a Qur'anic Hadith Allah says: \"The Son of Adam has denied me he has no right to lie to me. The son of Adam has hurt me while he has no right to bear with me. The lie about me was that he said I would not revive it as I had created it for the first time. Creating it first isn't easier for me than creating it later (meaning just as easy). What hurts me is the utterance: \"Indeed I have children, and I am the only true God, who hangs on me, who is childless and childless, and no one is equal to me.\" Bukhari of Abu Hurairah)",
      "text_tafsir": "Al-Wahidi meriwayatkan bahwa ayat ini diturunkan dalam kasus Ubay bin Khalaf. Dia mengambil sepotong tulang yang telah hampir remuk dan dihancurkannya dengan tangan seperti tepung, kemudian ditebarkannya ke angin kencang, maka bertebaranlah tulang itu. Kemudian dia berkata, \"Ada orang mengatakan bahwa kita akan dibangkitkan sesudah kita mati dan sesudah kita menjadi seperti tulang ini.\" Apakah mungkin apabila saya telah mati akan dibangkitkan dan dihidupkan kembali? Pertanyaan seperti itu terdapat pula pada ayat-ayat yang lain:\n\nDan mereka berkata, \"Apabila kami sudah mati, menjadi tanah dan tulang-belulang, apakah kami benar-benar akan dibangkitkan kembali?\"\n\n(al-Waqi'ah\/56: 47)\n\nDan firman-Nya:\n\nDan mereka berkata, \"Apabila kami telah menjadi tulang-belulang dan benda-benda yang hancur, apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk yang baru?\" (al-Isra'\/17: 49)\n\nDemikian pertanyaan-pertanyaan yang dikemukakan oleh orang yang dangkal pikirannya dan tidak mau memikirkan secara mendalam kekuasaan Allah, karena mata hati mereka telah ditutupi oleh kesesatan dan kesenangan hidup dunia, sehingga tidak tampak lagi bagi mereka cahaya kebenaran yang terang benderang. Oleh sebab itu Allah menolak pertanyaan-pertanyaan mereka. Apakah manusia yang berpikiran seperti itu tidak pernah tahu bahwa Allah telah menciptakannya dari tiada. Apakah ada yang dapat menciptakan sesuatu dari tiada, dapat pula menciptakannya dari sesuatu yang ada walaupun berupa tulang belulang atau benda-benda yang hancur. Ini adalah suatu pemikiran yang aneh yang tidak akan timbul kecuali dari orang-orang yang hatinya telah diselubungi oleh keingkaran dan tidak mau memikirkan persoalan dengan teliti dan mendalam. Pada ayat lain Allah berfirman:\n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. Dia memiliki sifat yang Mahatinggi di langit dan di bumi. Dan Dialah Yang Mahaperkasa, Mahabijaksana. (ar-Rum\/30: 27)\n\nDan firman-Nya:\n\nDan dia membuat perumpamaan bagi Kami dan melupakan asal kejadiannya; dia berkata, \"Siapakah yang dapat menghidupkan tulang-belulang, yang telah hancur luluh?\" Katakanlah (Muhammad), \"Yang akan menghidupkannya ialah (Allah) yang menciptakannya pertama kali. Dan Dia Maha Mengetahui tentang segala makhluk. (Yasin\/36: 78-79)\n\nDalam sebuah hadis Qudsi Allah berfirman: \n\n\"Anak Adam telah mendustakan-Ku sedang dia tidak berhak mendusta-kan-Ku. Anak Adam telah menyakiti-Ku sedang dia tidak berhak menya-kiti-Ku. Adapun pendustaannya terhadap-Ku ialah ucapannya bahwa Aku tidak akan menghidupkannya kembali sebagaimana Aku telah menciptakannya pertama kali. Menciptakannya pertama kali tidaklah lebih mudah bagi-Ku dari menciptakan kemudian (maksudnya sama mudah). Adapun yang menyakiti-Ku ialah ucapannya: Sesungguhnya Aku mempunyai anak, sedang Aku adalah Tuhan Yang Maha Esa Yang tergantung kepada-Ku segala sesuatu, yang tidak beranak dan tidak pula dilahirkan dan tidak ada seorang pun yang setara dengan Aku.\" (Riwayat al-Bukhari dari Abu Hurairah)",
      "text_translation": "Dan tidakkah manusia itu memikirkan bahwa sesungguhnya Kami telah menciptakannya dahulu, padahal (sebelumnya) dia belum berwujud sama sekali?",
      "text": "اَوَلَا يَذْكُرُ الْاِنْسَانُ اَنَّا خَلَقْنٰهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْـًٔا ",
      "text_translation_en": "But does man not bear in mind that We have created him aforetime out of nothing?",
      "juz_number": 16
    },
    "68": {
      "text_tafsir_en": "So God threatens such people by swearing that He will gather them in the wilderness together with the demons that they consider to be their leaders. They will see and experience the greatness and the greatness of the atmosphere, so that no one cares except for the safety of himself as mentioned in the word of God: In that day shall a man flee from his brother, and from his mother and from his wife, and from his wife and children; . Every single one of them that day had an affair. ('Abasa \/ 80: 34-37) In such a desperate and critical environment they are brought to hell in a kneeling and humble state, unable to stand up again because of the bitter experience and the unbearable suffering.",
      "text_tafsir": "Karena itu Allah mengancam manusia semacam itu dengan bersumpah bahwa Dia akan mengumpulkan mereka di padang mahsyar bersama-sama dengan setan yang mereka anggap sebagai pemimpin mereka. Mereka akan melihat dan mengalami bagaimana dahsyat dan hebatnya suasana ketika itu, sehingga tidak ada yang dipikirkan oleh seseorang kecuali keselamatan dirinya sebagaimana tersebut dalam firman Allah:\n\nPada hari itu manusia lari dari saudaranya, dan dari ibu dan bapaknya, dan dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. ('Abasa\/80: 34-37)\n\nDalam suasana yang amat gawat dan kritis itulah mereka digiring ke neraka dalam keadaan berlutut dan hina tidak dapat berdiri lagi karena pengalaman yang amat pahit dan penderitaan yang tak terperikan.",
      "text_translation": "Maka demi Tuhanmu, sungguh, pasti akan Kami kumpulkan mereka bersama setan, kemudian pasti akan Kami datangkan mereka ke sekeliling Jahanam dengan berlutut.",
      "text": "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيٰطِيْنَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا ",
      "text_translation_en": "And so, by thy Sustainer, [on Judgment Day] We shall most certainly bring them forth together with the satanic forces [which impelled them in life] and then We shall most certainly gather them, on their knees, around hell;",
      "juz_number": 16
    },
    "69": {
      "text_tafsir_en": "So God threatens such people by swearing that He will gather them in the wilderness together with the demons that they consider to be their leaders. They will see and experience the greatness and the greatness of the atmosphere, so that no one cares except for the safety of himself as mentioned in the word of God: In that day shall a man flee from his brother, and from his mother and from his wife, and from his wife and children; . Every single one of them that day had an affair. ('Abasa \/ 80: 34-37) In such a desperate and critical environment they are brought to hell in a kneeling and humble state, unable to stand up again because of the bitter experience and the unbearable suffering.",
      "text_tafsir": "Karena itu Allah mengancam manusia semacam itu dengan bersumpah bahwa Dia akan mengumpulkan mereka di padang mahsyar bersama-sama dengan setan yang mereka anggap sebagai pemimpin mereka. Mereka akan melihat dan mengalami bagaimana dahsyat dan hebatnya suasana ketika itu, sehingga tidak ada yang dipikirkan oleh seseorang kecuali keselamatan dirinya sebagaimana tersebut dalam firman Allah:\n\nPada hari itu manusia lari dari saudaranya, dan dari ibu dan bapaknya, dan dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. ('Abasa\/80: 34-37)\n\nDalam suasana yang amat gawat dan kritis itulah mereka digiring ke neraka dalam keadaan berlutut dan hina tidak dapat berdiri lagi karena pengalaman yang amat pahit dan penderitaan yang tak terperikan.",
      "text_translation": "Kemudian pasti akan Kami tarik dari setiap golongan siapa di antara mereka yang sangat durhaka kepada Tuhan Yang Maha Pengasih.",
      "text": "ثُمَّ لَنَنْزِعَنَّ مِنْ كُلِّ شِيْعَةٍ اَيُّهُمْ اَشَدُّ عَلَى الرَّحْمٰنِ عِتِيًّا ۚ",
      "text_translation_en": "and thereupon We shall, indeed, draw forth from every group [of sinners] the ones that had been most determined in their disdainful rebellion against the Most Gracious:",
      "juz_number": 16
    },
    "70": {
      "text_tafsir_en": "The disbelievers were grouped in groups according to their level of disobedience, and God set aside the most disobedient, most arrogant and wicked and most misleading people on earth from each group to be cast first into hell. For the All-Knowing God of His Knowledge it is not difficult to determine such people because all the deeds of their deeds in the world are recorded in their books, as it is in His word: On that day you will be presented (to your Lord), not some of you are hidden (for Allah). (al-haqqah \/ 69: 18) They will be bound, cast into hell, and in hell they will be chained as in His word: (Allah says), \"Catch him, and put his hand on his neck.\" Then cast him into the flaming fire of hell. And he fastened it with a chain that was seventy cubits long. (al-haqqah \/ 69: 30-32) Then it was another turn to be cast into hell according to the level of his disbelief and disobedience.",
      "text_tafsir": "Orang-orang kafir itu dikumpulkan secara berkelompok-kelompok sesuai dengan tingkat kedurhakaan mereka, lalu Allah menyisihkan yang paling ingkar, paling sombong dan durhaka dan paling banyak menyesatkan manusia di muka bumi dari masing-masing kelompok itu untuk dilemparkan lebih dahulu ke dalam neraka. Bagi Allah Yang Mahatahu Mahaluas Ilmu-Nya tidaklah sulit menentukan orang-orang yang seperti itu karena semua amal perbuatannya di dunia telah tercatat di dalam buku masing-masing, seperti tersebut dalam firman-Nya:\n\nPada hari itu kamu dihadapkan (kepada Tuhanmu), tidak ada sesuatupun dari kamu yang tersembunyi (bagi Allah). (al-haqqah\/69: 18)\n\nMereka akan dibelenggu, dilemparkan ke neraka dan dalam neraka pun mereka akan dirantai seperti tersebut dalam firman-Nya:\n\n(Allah berfirman), \"Tangkaplah dia lalu belenggulah tangannya ke lehernya.\" Kemudian masukkanlah dia ke dalam api neraka yang menyala-nyala. Kemudian belitlah dia dengan rantai yang panjangnya tujuh puluh hasta. (al-haqqah\/69: 30-32) \n\nSesudah itu barulah tiba giliran yang lain untuk dilemparkan pula ke neraka sesuai dengan tingkat kekufuran dan kedurhakaannya.",
      "text_translation": "Selanjutnya Kami sungguh lebih mengetahui orang yang seharusnya (dimasukkan) ke dalam neraka.",
      "text": "ثُمَّ لَنَحْنُ اَعْلَمُ بِالَّذِيْنَ هُمْ اَوْ لٰى بِهَا صِلِيًّا ",
      "text_translation_en": "for, indeed, We know best as to which of them is most deserving of the fires of hell.",
      "juz_number": 16
    },
    "71": {
      "text_tafsir_en": "Then God sent his word to the whole human race and explained that all people would be taken to the place where the hell was. They were drawn to that hell and stood around it. This is His unchangeable decree and must be fulfilled. In the Muslim Hadith of Abu Sa'id al-Khudriy is described (¦ then a bridge over Jahanam, and intercession is allowed, they say yes Allah save us \"save us, the Prophet asked, what is the bridge?) there are tools and spades, and thorns (such as) in Najd, which has a small thorn called As-Sa'dan. on the ride, there were survivors, trapped and escaped, some were thrown into hell. \")",
      "text_tafsir": "Kemudian Allah mengarahkan firman-Nya kepada manusia seluruhnya dan menerangkan bahwa semua orang akan dibawa ke tempat di mana neraka berada. Mereka didekatkan ke neraka itu dan berdiri di sekelilingnya. Hal ini sudah menjadi ketetapan-Nya yang tidak dapat diubah lagi dan harus terlaksana. \n\nDalam hadis Muslim dari Abu Sa'id al-Khudriy diterangkan (¦ kemudian dipancangkan jembatan di atas Jahanam, dan syafaat diperbolehkan, mereka berkata ya Allah selamatkan kami “ selamatkan kami, Rasulullah ditanya, apakah jembatan itu? Rasulullah menjawab, \"tempat berpijak yang licin ada alat penyambar dan pecantol, dan duri (seperti) yang ada di Najd, yang memiliki duri kecil yang diberi nama as-Sa'dan. Ada orang mukmin yang berjalan sekejap mata seperti kilat, angin, burung yang terbang, kuda pacuan dan seperti orang yang berkendaraan, maka ada yang selamat, tertangkap dan lolos, ada pula yang terlempar ke dalam neraka jahannam.\")",
      "text_translation": "Dan tidak ada seorang pun di antara kamu yang tidak mendatanginya (neraka). Hal itu bagi Tuhanmu adalah suatu ketentuan yang sudah ditetapkan.",
      "text": "وَاِنْ مِّنْكُمْ اِلَّا وَارِدُهَا ۚ كَانَ عَلٰى رَبِّكَ حَتْمًا مَّقْضِيًّا ۚ",
      "text_translation_en": "And every one of you will come within sight of it: this is, with thy Sustainer, a decree that must be fulfilled.",
      "juz_number": 16
    },
    "72": {
      "text_tafsir_en": "This verse confirms that Allah at that time freed those who feared the torment of hell and let the disbelievers fall on it in their knees. Allah explains that those who have been released from the torment of hell are those who believe not just believers, because those who believe are not necessarily those who believe, because many of those who believe are breaking the commandments. God and work on his prohibition. If the sin is greater than his good deeds then he will be tortured first in hell according to his sin, then he will be released from hell after receiving the torture that corresponds to his sin, and taken to heaven. As for those who do good deeds more than their sins, they are admitted into heaven after their sins are forgiven by God with His mercy and love. It is said in the word of Allah: If a man weighs his scales, he is in a good (happy) life. And as for those who are light in their scales, their return is the hell of Hawiyah. And do you know what the hell is Hawiyah? (That is) a very hot fire. (al-Qari'ah \/ 101: 6-11)",
      "text_tafsir": "Ayat ini menegaskan bahwa Allah dikala itu melepaskan orang-orang yang bertakwa dari siksaan neraka dan membiarkan orang-orang kafir jatuh ke dalamnya dalam keadaan berlutut. Allah menerangkan bahwa yang dilepaskan dari siksaan neraka itu ialah orang-orang yang bertakwa bukan orang-orang yang beriman saja, karena orang-orang yang beriman saja belum tentu termasuk orang-orang yang bertakwa, karena banyak di antara orang-orang yang beriman melanggar perintah Allah dan mengerjakan larangannya. Apabila dosanya lebih banyak dari amal kebaikannya maka ia akan disiksa lebih dahulu dalam neraka sesuai dengan dosa yang diperbuatnya kemudian barulah dikeluarkan dari neraka setelah menerima siksaan yang sepadan dengan dosanya, lalu dimasukan ke surga. Adapun orang-orang yang amal kebaikannya lebih banyak dari dosanya, maka dia dimasukkan ke dalam surga setelah dosa-dosanya itu diampuni oleh Allah dengan rahmat dan kasih sayang-Nya. Hal yang demikian tersebut dalam firman Allah:\n\nMaka adapun orang yang berat timbangan (kebaikan)nya, maka dia berada dalam kehidupan yang memuaskan (senang). Dan adapun orang yang ringan timbangan (kebaikan)nya, maka tempat kembalinya adalah neraka Hawiyah. Dan tahukah kamu apakah neraka Hawiyah itu? (Yaitu) api yang sangat panas. (al-Qari'ah\/101: 6-11)",
      "text_translation": " Kemudian Kami akan menyelamatkan orang-orang yang bertakwa dan membiarkan orang-orang yang zalim di dalam (neraka) dalam keadaan berlutut.",
      "text": "ثُمَّ نُنَجِّى الَّذِيْنَ اتَّقَوْا وَّنَذَرُ الظّٰلِمِيْنَ فِيْهَا جِثِيًّا ",
      "text_translation_en": "And once again: We shall save [from hell] those who have been conscious of Us; but We shall leave in it the evildoers, on their knees.",
      "juz_number": 16
    },
    "73": {
      "text_tafsir_en": "In this verse Allah describes the attitude of the unbelievers when the Qur'anic verses are read to them with clear and unmistakable truth, the words that come out of their mouths against the truth of those verses are ridicule and ridicule. jokes. They tell the believers who among us is the happiest of their lives, the quietest of their minds, the best of their houses, the highest rank and the highest number. How can we, who are higher and more noble than all of you, be in error and go astray? This is something that is impossible. So we consider you the ones who are in the wrong because your group is weak, miserable and a small number, you can only secretly gather around in isolated and isolated places like Darul Arqam and so on. It is not possible that the religion you profess is the true religion and it is not possible that the Qur'anic verses are good and useful. Because of this, of course we are the first to believe and believe in it. That is the only reason and explanation that unbelievers can convey to believers and their explanation is the same in another verse: And those who disbelieve say to the believers, \"If the Qur'an is something well, of course they do not deserve to be ahead of us. \" But because they had no clue with him they would say, \"This is an old lie.\" (al-Ahqaf \/ 46: 11)",
      "text_tafsir": "Pada ayat ini Allah menerangkan sikap orang-orang kafir itu bila dibacakan kepada mereka ayat-ayat Al-Qur'an yang nyata kebenarannya dan tidak dapat disangkal lagi, ucapan yang keluar dari mulut mereka untuk menentang kebenaran ayat-ayat itu adalah cemoohan dan olok-olok. Mereka mengatakan kepada orang mukmin siapa di antara kita yang paling senang hidupnya, paling tenang pikirannya, paling bagus rumahnya, paling tinggi kedudukannya dan paling banyak jumlahnya. Bagaimana kami yang jauh lebih tinggi dan lebih mulia dari kamu semua, akan berada dalam kebatilan dan menempuh jalan yang sesat. Hal ini adalah sesuatu yang mustahil. Maka kami menganggap kamulah yang berada dalam kesesatan karena golongan kamu selain lemah, sengsara dan sedikit jumlahnya, kamu hanya dapat berkumpul dengan sembunyi-sembunyi membicarakan hal ihwalnya di tempat-tempat yang tersisih dan sepi seperti Darul Arqam dan sebagainya. Tidak mungkin agama yang kamu anut itu agama yang benar dan tidak mungkin ayat-ayat Al-Qur'an itu baik dan berguna. Karena kalau demikian halnya tentu kamilah yang lebih dahulu beriman dan mempercayainya. Hanya itulah alasan dan keterangan yang dapat dikemukakan oleh orang kafir kepada orang mukmin dan keterangan mereka seperti ini terdapat pula pada ayat yang lain:\n\nDan orang-orang yang kafir berkata kepada orang-orang yang beriman, \"Sekiranya Al-Qur'an itu sesuatu yang baik, tentu mereka tidak pantas mendahului kami (beriman) kepadanya.\" Tetapi karena mereka tidak mendapat petunjuk dengannya maka mereka akan berkata, \"Ini adalah dusta yang lama.\" (al-Ahqaf\/46: 11)",
      "text_translation": " Dan apabila dibacakan kepada mereka ayat-ayat Kami yang jelas (maksudnya), orang-orang yang kafir berkata kepada orang-orang yang beriman, “Manakah di antara kedua golongan yang lebih baik tempat tinggalnya dan lebih indah tempat pertemuan(nya)?”",
      "text": "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ قَالَ الَّذِيْنَ كَفَرُوْا لِلَّذِيْنَ اٰمَنُوْٓاۙ اَيُّ الْفَرِيْقَيْنِ خَيْرٌ مَّقَامًا وَّاَحْسَنُ نَدِيًّا ",
      "text_translation_en": "AS IT IS, whenever Our messages are conveyed to them in all their clarity, those who are bent on denying the truth are wont to say unto those who have attained to faith: \"Which of the two kinds of man is in a stronger position and superior as a community?\"",
      "juz_number": 16
    },
    "74": {
      "text_tafsir_en": "Allah rejects the disbelief of the disbelievers by explaining that He in the past destroyed many people because of their iniquity, such as the 'Ad and samud even though they were richer and more luxurious than the Meccan infidels and their land was a land that was fertile, and has a beautiful panorama. So the wealth, luxury of citizens and the beauty of a country is not a reference to judge a people that it is on the right side and is God's favorite. The measure is faith in God and obedience and obedience in carrying out His commands and leaving His prohibitions. If it is true that wealth and luxury are measured, surely they will not be destroyed by God. In fact this verse is a threat from Allah against the Meccan polytheists, if they are not also aware and converted and continue to rebel it is not impossible they will be destroyed as well as the previous people.",
      "text_tafsir": "Allah menolak cemoohan orang-orang kafir itu dengan menjelaskan bahwa Dia di masa yang lalu telah banyak membinasakan beberapa kaum karena kedurhakaan mereka, seperti kaum 'Ad dan samud padahal mereka itu lebih kaya dan lebih mewah dari kaum kafir Mekah dan negeri mereka pun adalah negeri yang subur, dan mempunyai panorama yang indah. Jadi kekayaan, kemewahan panduduk dan keindahan suatu negeri bukanlah acuan untuk menilai suatu kaum bahwa ia adalah di pihak yang benar dan menjadi kesayangan Allah. Yang menjadi ukuran ialah keimanan kepada Allah serta ketaatan dan kepatuhan melaksanakan perintah-Nya dan meninggalkan larangan-Nya. Kalau benar kekayaan dan kemewahan itu yang menjadi ukuran, tentulah mereka tidak dibinasakan Allah. Sebenarnya ayat ini adalah suatu ancaman dari Allah terhadap kaum musyrik Mekah, kalau mereka tidak juga sadar dan insaf dan tetap membangkang tidak mustahil mereka akan dihancurkan pula seperti umat-umat terdahulu.",
      "text_translation": " Dan berapa banyak umat (yang ingkar) yang telah Kami binasakan sebelum mereka, padahal mereka lebih bagus perkakas rumah tangganya dan (lebih sedap) dipandang mata.",
      "text": "وَكَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ هُمْ اَحْسَنُ اَثَاثًا وَّرِءْيًا ",
      "text_translation_en": "And yet, how many a generation have We destroyed before their time-[people] who surpassed them in material power and in outward show!",
      "juz_number": 16
    },
    "75": {
      "text_tafsir_en": "In this verse Allah instructs the Prophet Muhammad to answer the mockery and mockery of the polytheists who boast of his wealth by saying that those who are heretical from his people will not be destroyed by God at this time, because of their mercy and affection and because among them Prophet Muhammad as well as believers. This is in His words: But Allah will not punish them, as long as you (Muhammad) are among them. And not (also) Allah will punish them, while they (still) ask forgiveness. (al-Anfal \/ 8: 33) Allah will allow them and suspend and give them the opportunity to drag on in disbelief and iniquity until the time comes when they will see for themselves God's torment in the world with their total defeat (such as the Battle of Badr and the expulsion of the Meccan polytheists) and in the hereafter they will see who is actually more noble, has the mercy and grace of God and who will receive humiliating torment that is so despicable and so lowly their position.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad supaya menjawab cemoohan dan olok-olok kaum musyrik yang membanggakan kekayaannya itu dengan mengatakan bahwa orang-orang yang sesat dari kaumnya tidak akan dibinasakan oleh Allah saat ini, karena rahmat dan kasih sayangnya dan karena di kalangan mereka berada Nabi Muhammad serta orang-orang yang beriman. Hal ini tersebut pada firman-Nya: \n\nTetapi Allah tidak akan menghukum mereka, selama engkau (Muhammad) berada di antara mereka. Dan tidaklah (pula) Allah akan menghukum mereka, sedang mereka (masih) memohon ampunan. (al-Anfal\/8: 33)\n\nAllah akan membiarkan mereka dan menangguhkan serta memberi kesempatan kepada mereka untuk berlarut-larut dalam kekafiran dan kedurhakaan sampai tiba saatnya mereka akan melihat sendiri siksaan Allah di dunia dengan kekalahan total yang dialami mereka (seperti Perang Badar dan terusirnya kaum musyrik Mekah) dan di akhirat mereka akan melihat siapa sebenarnya yang lebih mulia, mendapat rahmat dan karunia Allah dan siapa yang akan mendapat siksaan yang menghinakan sehingga begitu hina dan begitu rendahlah kedudukan mereka.",
      "text_translation": "Katakanlah (Muhammad), “Barangsiapa berada dalam kesesatan, maka biarlah Tuhan Yang Maha Pengasih memperpanjang (waktu) baginya; sehingga apabila mereka telah melihat apa yang diancamkan kepada mereka, baik azab maupun Kiamat, maka mereka akan mengetahui siapa yang lebih jelek kedudukannya dan lebih lemah bala tentaranya.”",
      "text": "قُلْ مَنْ كَانَ فِى الضَّلٰلَةِ فَلْيَمْدُدْ لَهُ الرَّحْمٰنُ مَدًّا ەۚ حَتّٰىٓ اِذَا رَاَوْا مَا يُوْعَدُوْنَ اِمَّا الْعَذَابَ وَاِمَّا السَّاعَةَ ۗفَسَيَعْلَمُوْنَ مَنْ هُوَ شَرٌّ مَّكَانًا وَّاَضْعَفُ جُنْدًا",
      "text_translation_en": "Say: \"As for him who lives in error, may the Most Gracious lengthen the span of his life! [And let them say whatever they say until the time when they behold that [doom] of which they were forewarned-whether it be suffering [in this world] or [at the coming of] the Last Hour -: for then they will understand which [of the two kinds of man] was worse in station and weaker in resources!",
      "juz_number": 16
    },
    "76": {
      "text_tafsir_en": "It was an amusement for the humiliated and ridiculed Muslims, because they were powerless to answer the challenges of the Muslims who brag about their wealth. God promises to give them additional guidance in addition to the guidance they have received. With these instructions they will be more fearful and happier. Let the unbelievers take pride in their wealth and position and always be proud and arrogant. Let them hang around in misunderstandings and misgivings. God will one day inflict a severe punishment upon them. At that time they will realize that they have made a big mistake and regret it very much, but that regret will not help them at all, as rice is already porridge, regretting the regretful income is useless. In dealing with the arrogance of the Muslims, Muslims should be patient and persistent, always practicing Allah's instructions, obeying and obeying His commandments. Thus their hearts will be free, their minds will be at ease, their good will will increase. They will always be in the protection of His mercy and love. Allah will provide for them a double reward.",
      "text_tafsir": "Sebagai hiburan bagi kaum Muslimin yang dihina dan dicemoohkan itu, karena memang mereka tidak berdaya menjawab tantangan kaum musyrik yang menyombongkan kekayaannya. Allah menjanjikan akan memberi mereka tambahan petunjuk di samping petunjuk-petunjuk yang telah mereka terima. Dengan petunjuk-petunjuk itu mereka akan lebih bertakwa dan lebih bahagia. Biarkanlah orang-orang kafir itu berbangga-bangga dengan kekayaan dan kedudukan dan selalu berada dalam keangkuhan dan kesombongan. Biarkanlah mereka berlarut-larut dalam kesesatan dan kedurhakaan. Pada suatu saat Allah akan menimpakan siksa-Nya yang keras kepada mereka. Di waktu itulah nanti mereka akan sadar bahwa mereka telah melakukan kesalahan yang besar dan menyesal dengan amat sangat, tetapi penyesalan itu tidak akan menolong mereka sedikit pun, karena ibarat nasi sudah menjadi bubur, sesal dahulu pendapatan sesal kemudian tidak berguna. Dalam menghadapi kesombongan kaum musyrik itu hendaklah kaum Muslimin sabar dan tabah, selalu mengamalkan petunjuk-petunjuk Allah, taat dan patuh kepada perintah-Nya. Dengan demikian hati mereka akan lapang, pikiran mereka akan tenang, amal baik mereka akan bertambah. Mereka senantiasa akan berada dalam lindungan rahmat dan kasih sayang-Nya. Allah akan menyediakan bagi mereka pahala yang berlipat ganda.",
      "text_translation": "Dan Allah akan menambah petunjuk kepada mereka yang telah mendapat petunjuk. Dan amal kebajikan yang kekal itu lebih baik pahalanya di sisi Tuhanmu dan lebih baik kesudahannya.",
      "text": "وَيَزِيْدُ اللّٰهُ الَّذِيْنَ اهْتَدَوْا هُدًىۗ وَالْبٰقِيٰتُ الصّٰلِحٰتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَّخَيْرٌ مَّرَدًّا ",
      "text_translation_en": "And God endows those who avail themselves of [His] guidance with an ever-deeper consciousness of the right way; and good deeds, the fruit whereof endures forever, are, in thy Sustainer's sight, of far greater merit [than any worldly goods], and yield far better returns.",
      "juz_number": 16
    },
    "77": {
      "text_tafsir_en": "In this verse Allah commands the Prophet Muhammad to observe how arrogant and arrogant the unbelievers are to say that in the Hereafter they will be given great wealth and children. Although the words seem to indicate that they believe in the day of resurrection but they do not believe in the day of resurrection at all. Such remarks are merely a mockery and mockery of the faith of the believers in the sense that if Khabab bin Arat really believed in the day of resurrection then his debt would be paid on the day of resurrection. Now he refuses to pay it because Khabbab believes in Muhammad. The joke was further added by saying that he would be rich and have many children in the hereafter. How dare he invent something he does not know, while he himself refuses supernatural things.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad saw supaya memperhatikan bagaimana sombong dan angkuhnya orang kafir itu yang berani mengatakan bahwa di akhirat nanti mereka akan dianugerahi harta dan anak yang banyak. Meskipun ucapan itu seakan-akan menunjukkan bahwa mereka mempercayai hari kebangkitan tetapi sebenarnya mereka tidak percaya sama sekali akan adanya hari kebangkitan. Ucapan seperti itu hanya sebagai cemoohan dan olok-olok terhadap kepercayaan orang mukmin dengan pengertian bahwa jika benar-benar Khabab bin Arat percaya akan hari kebangkitan biarlah utangnya itu dibayar pada hari kebangkitan. Sekarang dia tidak mau membayarnya karena Khabbab beriman dengan Muhammad. Cemoohan itu ditambah lagi dengan mengatakan bahwa dia akan kaya dan banyak anak nanti di akhirat. Alangkah beraninya dia mengada-adakan sesuau yang tidak diketahuinya sama sekali, sedang dia sendiri mengingkari hal-hal yang gaib.",
      "text_translation": "Lalu apakah engkau telah melihat orang yang mengingkari ayat-ayat Kami dan dia mengatakan, “Pasti aku akan diberi harta dan anak.”",
      "text": "اَفَرَاَيْتَ الَّذِيْ كَفَرَ بِاٰيٰتِنَا وَقَالَ لَاُوْتَيَنَّ مَالًا وَّوَلَدًا ۗ",
      "text_translation_en": "And hast thou ever considered [the kind of man] who is bent on denying the truth of Our messages and says, \"I will surely be given wealth and children\"?",
      "juz_number": 16
    },
    "78": {
      "text_tafsir_en": "Therefore in this verse God denounces it by saying, \"Does he know the magical things or does he promise God that He will give him abundant sustenance and children?\" These two possibilities are very far-fetched, because no one can know the supernatural or anything else related to the hereafter. And it is impossible for him to promise God that he will be richly nourished in the hereafter while he himself has rejected that day and is associated with God in idolatry. The place of such a person is hell and the torment that will be inflicted upon him is certainly heavy.",
      "text_tafsir": "Oleh sebab itu maka pada ayat ini Allah mengecamnya dengan mengatakan, \"Apakah dia mengetahui hal-hal yang gaib ataukah dia telah berjanji dengan Allah bahwa Dia akan memberinya rezeki dan anak yang banyak?\" Kedua kemungkinan itu amat jauh sekali, karena tidak ada seorang pun yang dapat mengetahui yang gaib apalagi yang berhubungan dengan hari akhirat. Dan tidak mungkin pula dia berjanji dengan Tuhan bahwa dia akan diberi rezeki yang banyak di akhirat sedangkan dia sendiri mengingkari hari itu dan mempersekutukan Allah dengan berhala-berhala. Tempat orang seperti ini adalah neraka dan siksaan yang akan ditimpakan kepadanya tentu berat sekali.",
      "text_translation": "Adakah dia melihat yang gaib atau dia telah membuat perjanjian di sisi Tuhan Yang Maha Pengasih?",
      "text": "اَطَّلَعَ الْغَيْبَ اَمِ اتَّخَذَ عِنْدَ الرَّحْمٰنِ عَهْدًا ۙ",
      "text_translation_en": "Has he, perchance, attained to a realm which is beyond the reach of a created being's perception? or has he concluded a covenant with the Most Gracious?",
      "juz_number": 16
    },
    "79": {
      "text_tafsir_en": "In this verse, God threatens them with harsh threats because his ignorance presents something to God without knowledge and without a basis for which he can be held accountable. Allah will take all their possessions in return for their disobedience and wickedness and torment them with endless torment. God will take away all his possessions and children that he left behind when he dies and in the hereafter he will come to God by himself, and no one will defend him. Indeed, on that day nothing can help a human being except his faith and his deeds in accordance with the word of God: (that is) the day (when) wealth and children are of no use, except for those who look to God with a pure heart. (asy-Syu'ara \/ 26: 88-89) And they shall be brought before your Lord in battle. (Allah says), \"Surely you have come to us, just as We created you in the first place; even though you consider that We will not appoint you a time. (al-Kahf \/ 18: 48)",
      "text_tafsir": "Pada ayat ini Allah mengancam mereka dengan ancaman yang keras karena kelancangannya menisbahkan sesuatu terhadap Allah tanpa ilmu dan tanpa dasar yang dapat dipertanggungjawabkan secara rasional. Allah akan mengambil semua harta mereka sebagai balasan yang setimpal dengan keingkaran dan kedurhakaannya dan menyiksanya dengan siksaan yang tiada putus-putusnya. Allah akan mengambil semua harta dan anak-anaknya yang ditinggalkannya ketika dia mati sehingga di akhirat nanti dia datang menghadap Allah sendirian, tidak ada yang akan membela dan menolongnya. Memang pada hari itu tak ada sesuatu pun yang dapat menolong manusia kecuali iman dan amal perbuatannya sesuai dengan firman Allah:\n\n(yaitu) pada hari (ketika) harta dan anak-anak tidak berguna, kecuali orang-orang yang menghadap Allah dengan hati yang bersih. (asy- Syu'ara\/26: 88-89)\n\nDan mereka akan dibawa ke hadapan Tuhanmu dengan berbaris. (Allah berfirman), \"Sesungguhnya kamu datang kepada Kami, sebagaimana Kami menciptakan kamu pada pertama kali; bahkan kamu menganggap bahwa Kami tidak akan menetapkan bagi kamu waktu (berbangkit untuk memenuhi) perjanjian.\" (al-Kahf\/18: 48)",
      "text_translation": "Sama sekali tidak! Kami akan menulis apa yang dia katakan, dan Kami akan memperpanjang azab untuknya secara sempurna,",
      "text": "كَلَّاۗ سَنَكْتُبُ مَا يَقُوْلُ وَنَمُدُّ لَهٗ مِنَ الْعَذَابِ مَدًّا ۙ",
      "text_translation_en": "Nay! We shall record what he says, and We shall lengthen the length of his suffering [in the hereafter],",
      "juz_number": 16
    },
    "80": {
      "text_tafsir_en": "In this verse, God threatens them with harsh threats because his ignorance presents something to God without knowledge and without a basis for which he can be held accountable. Allah will take all their possessions in return for their disobedience and wickedness and torment them with endless torment. God will take away all his possessions and children that he left behind when he dies and in the hereafter he will come to God by himself, and no one will defend him. Indeed, on that day nothing can help a human being except his faith and his deeds in accordance with the word of God: (that is) the day (when) wealth and children are of no use, except for those who look to God with a pure heart. (asy-Syu'ara \/ 26: 88-89) And they shall be brought before your Lord in battle. (Allah says), \"Surely you have come to us, just as We created you in the first place; even though you consider that We will not appoint you a time. (al-Kahf \/ 18: 48)",
      "text_tafsir": "Pada ayat ini Allah mengancam mereka dengan ancaman yang keras karena kelancangannya menisbahkan sesuatu terhadap Allah tanpa ilmu dan tanpa dasar yang dapat dipertanggungjawabkan secara rasional. Allah akan mengambil semua harta mereka sebagai balasan yang setimpal dengan keingkaran dan kedurhakaannya dan menyiksanya dengan siksaan yang tiada putus-putusnya. Allah akan mengambil semua harta dan anak-anaknya yang ditinggalkannya ketika dia mati sehingga di akhirat nanti dia datang menghadap Allah sendirian, tidak ada yang akan membela dan menolongnya. Memang pada hari itu tak ada sesuatu pun yang dapat menolong manusia kecuali iman dan amal perbuatannya sesuai dengan firman Allah:\n\n(yaitu) pada hari (ketika) harta dan anak-anak tidak berguna, kecuali orang-orang yang menghadap Allah dengan hati yang bersih. (asy- Syu'ara\/26: 88-89)\n\nDan mereka akan dibawa ke hadapan Tuhanmu dengan berbaris. (Allah berfirman), \"Sesungguhnya kamu datang kepada Kami, sebagaimana Kami menciptakan kamu pada pertama kali; bahkan kamu menganggap bahwa Kami tidak akan menetapkan bagi kamu waktu (berbangkit untuk memenuhi) perjanjian.\" (al-Kahf\/18: 48)",
      "text_translation": "dan Kami akan mewarisi apa yang dia katakan itu, dan dia akan datang kepada Kami seorang diri.",
      "text": "وَّنَرِثُهٗ مَا يَقُوْلُ وَيَأْتِيْنَا فَرْدًا ",
      "text_translation_en": "and divest him of all that he is [now] speaking of: for [on Judgment Day] he will appear before Us in a lonely state.",
      "juz_number": 16
    },
    "81": {
      "text_tafsir_en": "In this verse Allah explains to the Prophet Muhammad that the purpose and purpose of the idolaters was to worship idols and other idolatrous objects, that they might help them both in the world and in the hereafter. They offer all kinds of goods and money to the idols in the hope that they will grant their wish, be blessed and blessed in life, effort and work, and that they will continue to be honorable and honorable. Among them it seems that the most powerful, the right to bestow grace and favor, has the right to suffer torment and misery. Later on (as they understand) the idols will be able to ask for their intercession and will help them when they are in trouble or suffering.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan kepada Nabi Muhammad saw bahwa maksud dan tujuan dari orang-orang musyrik menyembah berhala dan sembahan-sembahan lainnya, ialah agar berhala-berhala dan sembahansembahan itu dapat menolong mereka, baik di dunia maupun di akhirat kelak. Mereka mempersembahkan berbagai macam barang dan uang kepada berhala-berhala itu dengan harapan agar berhala-berhala itu dapat mengabulkan permintaan mereka, diberi restu dan diberkahi dalam kehidupan, usaha dan pekerjaan, dan agar mereka tetap berbahagia mulia dan terhormat. Di kalangan mereka seakan-akan berhala itulah yang paling berkuasa, berhak melimpahkan rahmat dan nikmat, berhak menimpakan siksa dan kesengsaraan. Di akhirat nanti (menurut paham mereka) berhala-berhala itu akan dapat memintakan syafaat bagi mereka dan akan menolong mereka bila mereka menghadapi kesulitan atau mengalami penderitaan.",
      "text_translation": "Dan mereka telah memilih tuhan-tuhan selain Allah, agar tuhan-tuhan itu menjadi pelindung bagi mereka.",
      "text": "وَاتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اٰلِهَةً لِّيَكُوْنُوْا لَهُمْ عِزًّا ۙ",
      "text_translation_en": "For [such as] these have taken to worshipping deities other than God, hoping that they would be a [source of] strength for them.",
      "juz_number": 16
    },
    "82": {
      "text_tafsir_en": "This verse rejects the misunderstanding, especially regarding the ability of the idol to provide help in the hereafter. Idolatry and idolatry will never help them, but they will deny before Allah that they are worshiped by the Muslims as it is said in the word of Allah: And when those who associate (Allah) see their allies they said, \"Our Lord, these are our allies, whom we have worshiped before you.\" Then their allies told them, \"You are a liar.\" (an-Nahl \/ 16: 86) And his word: (That is) when those who follow take away the hands of those who follow, and they see the torment, and (when) all the relations between them are cut off. And those who followed said, \"If we had the opportunity (to return to the world), we would have lost their hands, just as they had taken our hands.\" Thus Allah shows them the deeds of their deeds which they regret. And they will not come out of the fire. (al-Baqarah \/ 2: 166-167)",
      "text_tafsir": "Ayat ini menolak paham yang salah itu terutama mengenai kemampuan berhala itu memberi pertolongan di akhirat. Berhala-berhala dan sembahan-sembahan itu sekali-kali tidak akan dapat menolong mereka bahkan mereka akan mengingkari di hadapan Allah bahwa mereka disembah oleh orang-orang musyrik itu sebagaimana disebutkan dalam firman Allah:\n\nDan apabila orang yang mempersekutukan (Allah) melihat sekutu-sekutu mereka, mereka berkata, \"Ya Tuhan kami, mereka inilah sekutu-sekutu kami yang dahulu kami sembah selain Engkau.\" Lalu sekutu mereka menyatakan kepada mereka, \"Kamu benar-benar pendusta.\" (an-Nahl\/16: 86)\n\nDan firman-Nya:\n\n(Yaitu) ketika orang-orang yang diikuti berlepas tangan dari orang-orang yang mengikuti, dan mereka melihat azab, dan (ketika) segala hubungan antara mereka terputus. Dan orang-orang yang mengikuti berkata, \"Sekiranya kami mendapat kesempatan (kembali ke dunia), tentu kami akan berlepas tangan dari mereka, sebagaimana mereka berlepas tangan dari kami.\" Demikianlah Allah memperlihatkan kepada mereka amal perbuatan mereka yang menjadi penyesalan mereka. Dan mereka tidak akan keluar dari api neraka. (al-Baqarah\/2: 166-167)",
      "text_translation": "Sama sekali tidak! Kelak mereka (sesembahan) itu akan mengingkari penyembahan mereka terhadapnya, dan akan menjadi musuh bagi mereka.",
      "text": "كَلَّا ۗسَيَكْفُرُوْنَ بِعِبَادَتِهِمْ وَيَكُوْنُوْنَ عَلَيْهِمْ ضِدًّا ࣖ",
      "text_translation_en": "But nay! [On Judgment Day] these [very objects of adoration] will disavow the worship that was paid to them, and will turn against those [who had worshipped them]!",
      "juz_number": 16
    },
    "83": {
      "text_tafsir_en": "In this verse Allah warns Muhammad that He has released the devil and given him the opportunity to deceive, persuade and deceive the people who are under the influence of the devil including the unbelievers of Mecca so that they will remain in error and will not return to the right path anyways. Muhammad called and called on them. This is described by Allah as the heartbroken Prophet Muhammad because he was earnest and wholeheartedly gave them guidance and warning, but they also refused and refused to believe.",
      "text_tafsir": "Pada ayat ini Allah memperingatkan Nabi Muhammad bahwa Dia telah melepaskan setan dan memberi kesempatan kepadanya untuk menipu, membujuk serta memperdayakan manusia yang terkena bujuk rayu setan itu termasuk orang-orang kafir Mekah sehingga Mereka akan tetap dalam kesesatan dan tidak akan kembali ke jalan yang benar bagaimanapun Muhammad mengajak dan menyeru mereka. Hal ini dijelaskan Allah sebagai penawar hati Nabi Muhammad yang berduka karena dia telah bersungguh-sungguh dan dengan sepenuh hati memberikan petunjuk dan peringatan kepada mereka, tetapi mereka tetap juga ingkar dan tidak mau beriman.",
      "text_translation": "Tidakkah engkau melihat, bahwa sesungguhnya Kami telah mengutus setan-setan itu kepada orang-orang kafir untuk mendorong mereka (berbuat maksiat) dengan sungguh-sungguh?",
      "text": "اَلَمْ تَرَ اَنَّآ اَرْسَلْنَا الشَّيٰطِيْنَ عَلَى الْكٰفِرِيْنَ تَؤُزُّهُمْ اَزًّا ۙ",
      "text_translation_en": "ART THOU NOT aware that We have let loose all [manner of] satanic forces upon those who deny the truth - [forces] that impel them [towards sin] with strong impulsion?",
      "juz_number": 16
    },
    "84": {
      "text_tafsir_en": "In this verse Allah forbade the Prophet Muhammad to feel sad and angry with the disbelievers and asked that the punishment be rushed to them because the time to impose the punishment was imminent, only counting the days. In the world they will receive retribution with their defeat in the Battle of Badr and in the hereafter even though our minds are still far away but for God that day is near. Because one day in the hereafter in the calculation of Allah is not 24 hours as our calculation, maybe a thousand years or maybe more, as stated in His word: And they ask you (Muhammad) that the punishment be hastened, whereas Allah will not violate His promises. And verily a day beside your Lord is like a thousand years according to your calculations. (Al-hajj \/ 22: 47)",
      "text_tafsir": "Pada ayat ini Allah melarang Nabi Muhammad merasa sedih dan marah kepada orang kafir dan meminta supaya azab kepada mereka disegerakan karena saat untuk menimpakan azab itu sudah dekat, hanya tinggal menghitung-hitung harinya saja. Di dunia mereka akan menerima balasan dengan kekalahan mereka dalam Perang Badar dan di akhirat walaupun dalam pikiran kita masih jauh tetapi bagi Allah hari itu adalah dekat. Karena satu hari di akhirat dalam perhitungan Allah bukanlah 24 jam seperti perhitungan kita, mungkin seribu tahun atau mungkin lebih, sebagai tersebut dalam firman-Nya:\n\nDan mereka meminta kepadamu (Muhammad) agar azab itu disegerakan, padahal Allah tidak akan menyalahi janji-Nya. Dan sesungguhnya sehari di sisi Tuhanmu adalah seperti seribu tahun menurut perhitunganmu.(al-hajj\/22: 47)",
      "text_translation": "Maka janganlah engkau (Muhammad) tergesa-gesa (memintakan azab) terhadap mereka, karena Kami menghitung dengan hitungan teliti (datangnya hari siksaan) untuk mereka.",
      "text": "فَلَا تَعْجَلْ عَلَيْهِمْۗ اِنَّمَا نَعُدُّ لَهُمْ عَدًّا ۗ",
      "text_translation_en": "Hence, be not in haste [to call down God's punishment] upon them: for We but number the number of their days.",
      "juz_number": 16
    },
    "85": {
      "text_tafsir_en": "On that day Allah gathered the righteous to face His presence as a group that was glorified for their faith and charity in the world. They were taken in nice and beautiful vehicles as respected guests. Ali ibn Abi Talib said that the group was not an ordinary group that walked or was escorted but was brought in a vehicle that had never been seen by its beauty by humans, on top of it was a seat of gold and the ropes were lined with emerald gems so that they arrived at the gates of heaven.",
      "text_tafsir": "Pada hari itu Allah mengumpulkan orang-orang yang bertakwa untuk menghadap kehadirat-Nya sebagai rombongan yang dimuliakan karena iman dan amal mereka di dunia. Mereka dibawa dengan kendaraan yang bagus dan indah sebagai tamu yang dihormati. Ali bin Abi thalib mengatakan bahwa rombongan itu bukanlah rombongan biasa yang berjalan kaki atau digiring tetapi dibawa dengan kendaraan yang belum pernah dilihat keindahannya oleh manusia, di atasnya ada tempat duduk dari emas dan tali lesnya bertahtakan permata zamrud sehingga sampailah mereka di muka pintu surga.",
      "text_translation": "(Ingatlah) pada hari (ketika) Kami mengumpulkan orang-orang yang bertakwa kepada (Allah) Yang Maha Pengasih, bagaikan kafilah yang terhormat,",
      "text": "يَوْمَ نَحْشُرُ الْمُتَّقِيْنَ اِلَى الرَّحْمٰنِ وَفْدًا ",
      "text_translation_en": "On the Day when We shall gather the Godconscious unto [Us,] the Most Gracious, as honoured guests,",
      "juz_number": 16
    },
    "86": {
      "text_tafsir_en": "Instead, the wicked keep on disobeying and the unbelievers are led to hell. On their way to hell they suffered all kinds of untold suffering such as thirst and hunger due to the heat of the air of the field. They are driven like helpless animals today not to the shade or to the clear springs to release thirst and thirst but to a fiery hell.",
      "text_tafsir": "Sebaliknya orang durhaka yang tetap ingkar dan kafir digiring ke neraka. Dalam perjalanan ke neraka itu mereka menderita berbagai macam penderitaan yang tidak terperikan seperti haus dan lapar karena panasnya udara padang mahsyar. Mereka digiring seperti hewan-hewan yang hina dina yang tidak berdaya bukan ke tempat yang teduh atau ke mata air yang jernih untuk melepaskan haus dan dahaga tetapi ke neraka yang amat panas.",
      "text_translation": "dan Kami akan menggiring orang yang durhaka ke neraka Jahanam dalam keadaan dahaga.",
      "text": "وَنَسُوْقُ الْمُجْرِمِيْنَ اِلٰى جَهَنَّمَ وِرْدًا ۘ",
      "text_translation_en": "and drive those who were lost in sin unto hell as a thirsty herd is driven to a well –",
      "juz_number": 16
    },
    "87": {
      "text_tafsir_en": "The disbelievers will not obtain intercession from anyone to help them or alleviate the suffering they are experiencing. For those who are entitled to receive intercession on that day only those whom God has promised will receive the intercession, the believers who during their lifetime have prepared themselves for intercession with their charity and their struggle to uphold the word of God. The intercession of that day was only owned by the prophets, scholars and martyrs according to their respective charities and devotions. Among the acts of worship that make a person worthy of intercession is to perform the best five-hour prayer. The Messenger of Allah (may peace be upon him) said: \"Whoever comes on the Day of Judgment brings his perfect fivefold prayer, and keeps his time, his bow and his bow, he never leaves anything, and Allah promises not to torment. the promise of Allah. It is up to the Lord whether He will bestow mercy on him or punish him. \"(narrated by ath-thabrani in\" al-Ausath \"from Abu Hurairah)",
      "text_tafsir": "Orang kafir tidak akan memperoleh syafaat dari siapa pun untuk menolong mereka atau meringankan penderitaan yang mereka alami. Karena yang berhak menerima syafaat pada hari itu hanyalah orang-orang yang telah dijanjikan Allah akan mendapat syafaat yaitu orang-orang mukmin yang di masa hidupnya di dunia telah mempersiapkan diri untuk mendapat syafaat dengan amal ibadahnya dan perjuangannya menegakkan kalimah Allah. Syafaat pada hari itu hanya dimiliki oleh para nabi, ulama dan para syuhada sesuai dengan amal dan bakti mereka masing-masing. Di antara amal ibadat yang menjadikan seseorang berhak memperoleh syafaat itu ialah memelihara salat lima waktu dengan sebaik-baiknya. \n\nRasulullah bersabda, \"Barangsiapa yang datang pada hari kiamat membawa salatnya yang lima waktu dengan sempurna yaitu disempurnakan wudunya dipeliharanya waktunya, ruku' dan sujudnya, tidak pernah ditinggalkannya barang sekalipun maka Allah berjanji tidak akan menyiksanya. Tetapi orang yang pernah meninggalkan salatnya, tidak akan memperoleh janji Allah itu. Terserahlah kepada Tuhan apakah Dia akan memberinya rahmat atau menimpakan azab kepadanya.\"(Diriwayatkan oleh ath-thabrani dalam kitab \"al-Ausath\" dari Abu Hurairah)",
      "text_translation": " Mereka tidak berhak mendapat syafaat, (pertolongan) kecuali orang yang telah mengadakan perjanjian di sisi (Allah) Yang Maha Pengasih.",
      "text": "لَا يَمْلِكُوْنَ الشَّفَاعَةَ اِلَّا مَنِ اتَّخَذَ عِنْدَ الرَّحْمٰنِ عَهْدًا ۘ",
      "text_translation_en": "[on that Day] none will have [the benefit of] intercession unless he has [in his lifetime] entered into a bond with the Most Gracious.",
      "juz_number": 16
    },
    "88": {
      "text_tafsir_en": "In this verse Allah asserts that those who say that Allah has their good children from the Meccans, Jews, Christians and other religious people, are the ones who have gone astray because they have spoken very unpleasant and have made - There is a great lie to God. The word is very unreasonable, unacceptable and very contrary to the attributes of the One God, the Creator, the Almighty and the Almighty. God is very angry with them because their mouths are humiliated to the Most High as if they were equated with humans and His creatures who need offspring who will continue their future existence and who will help them when they become weak. powerless. Though He is the Eternal One, He is always in need of help or assistance from Him, as it is in His word: God, there is no god but Him. The Living One, The One who keeps on managing (His creatures). (Ali 'Imran \/ 3: 2) Allah rebuked them severely and said that with such words he had said something very wrong, a word that should not have come out of the mouth of His own created being, of his gifted creatures. -He makes sense and thinks that he can distinguish between right and wrong.",
      "text_tafsir": "Pada ayat ini Allah menegaskan bahwa orang-orang yang mengatakan bahwa Allah mempunyai anak baik mereka itu dari kaum musyrik Mekah, orang Yahudi, orang Nasrani maupun penganut agama lain, adalah orang-orang yang sesat karena telah mengucapkan ucapan yang sangat tidak menyenangkan dan telah mengada-adakan kebohongan yang besar terhadap Allah. Perkataan itu sangat mungkar, tidak dapat diterima oleh akal dan sangat bertentangan dengan sifat-sifat Allah Yang Maha Esa, Maha Pencipta, Mahakuasa dan Mahaperkasa. Allah sangat murka terhadap mereka karena kelancangan mulut mereka merendahkan martabat Yang Mahatinggi seakan-akan Allah disamakan dengan manusia dan makhluk-makhluk-Nya yang lain yang membutuhkan keturunan yang akan melanjutkan kelangsungan eksistensinya di kemudian hari dan yang akan menolong membantunya di kala ia telah menjadi lemah tak berdaya. Padahal Dia-lah Yang Hidup Kekal, senantiasa berdiri sendiri tidak memerlukan pertolongan atau bantuan dari selain-Nya, sebagaimana tersebut dalam firman-Nya:\n\nAllah, tidak ada tuhan selain Dia. Yang Mahahidup, Yang terus menerus-mengurus (makhluk-Nya). (Ali 'Imran\/3: 2)\n\nAllah mencela mereka dengan keras dan mengatakan bahwa mereka dengan ucapan seperti itu telah mengatakan sesuatu yang sangat mungkar sekali, ucapan yang tidak sepatutnya keluar dari mulut makhluk-Nya yang diciptakan-Nya sendiri, makhluknya yang telah dianugerahi-Nya akal dan pikiran agar dia dapat membedakan mana yang hak dan mana yang batil.",
      "text_translation": "Dan mereka berkata, “(Allah) Yang Maha Pengasih mempunyai anak.”",
      "text": "وَقَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا ۗ",
      "text_translation_en": "As it is, some assert, \"The Most Gracious has taken unto Himself a son„!",
      "juz_number": 16
    },
    "89": {
      "text_tafsir_en": "In this verse Allah asserts that those who say that Allah has their good children from the Meccans, Jews, Christians and other religious people, are the ones who have gone astray because they have spoken very unpleasant and have made - There is a great lie to God. The word is very unreasonable, unacceptable and very contrary to the attributes of the One God, the Creator, the Almighty and the Almighty. God is very angry with them because their mouths are humiliated to the Most High as if they were equated with humans and His creatures who need offspring who will continue their future existence and who will help them when they become weak. powerless. Though He is the Eternal One, He is always in need of help or assistance from Him, as it is in His word: God, there is no god but Him. The Living One, The One who keeps on managing (His creatures). (Ali 'Imran \/ 3: 2) Allah rebuked them severely and said that with such words he had said something very wrong, a word that should not have come out of the mouth of His own created being, of his gifted creatures. -He makes sense and thinks that he can distinguish between right and wrong.",
      "text_tafsir": "Pada ayat ini Allah menegaskan bahwa orang-orang yang mengatakan bahwa Allah mempunyai anak baik mereka itu dari kaum musyrik Mekah, orang Yahudi, orang Nasrani maupun penganut agama lain, adalah orang-orang yang sesat karena telah mengucapkan ucapan yang sangat tidak menyenangkan dan telah mengada-adakan kebohongan yang besar terhadap Allah. Perkataan itu sangat mungkar, tidak dapat diterima oleh akal dan sangat bertentangan dengan sifat-sifat Allah Yang Maha Esa, Maha Pencipta, Mahakuasa dan Mahaperkasa. Allah sangat murka terhadap mereka karena kelancangan mulut mereka merendahkan martabat Yang Mahatinggi seakan-akan Allah disamakan dengan manusia dan makhluk-makhluk-Nya yang lain yang membutuhkan keturunan yang akan melanjutkan kelangsungan eksistensinya di kemudian hari dan yang akan menolong membantunya di kala ia telah menjadi lemah tak berdaya. Padahal Dia-lah Yang Hidup Kekal, senantiasa berdiri sendiri tidak memerlukan pertolongan atau bantuan dari selain-Nya, sebagaimana tersebut dalam firman-Nya:\n\nAllah, tidak ada tuhan selain Dia. Yang Mahahidup, Yang terus menerus-mengurus (makhluk-Nya). (Ali 'Imran\/3: 2)\n\nAllah mencela mereka dengan keras dan mengatakan bahwa mereka dengan ucapan seperti itu telah mengatakan sesuatu yang sangat mungkar sekali, ucapan yang tidak sepatutnya keluar dari mulut makhluk-Nya yang diciptakan-Nya sendiri, makhluknya yang telah dianugerahi-Nya akal dan pikiran agar dia dapat membedakan mana yang hak dan mana yang batil.",
      "text_translation": "Sungguh, kamu telah membawa sesuatu yang sangat mungkar,",
      "text": "لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا ۙ",
      "text_translation_en": "Indeed, [by this assertion] you have brought forth something monstrous,",
      "juz_number": 16
    },
    "90": {
      "text_tafsir_en": "If the earth, the sky and the mountains could hear and understand the words of the disbelievers, even though he was not given reason and thought by God, then the heavens, the earth and the great mountains would be shaken violently with shock and might become destroyed, because it can not accept words that are very heavy responsibility, and very insulting and demeaning the Creator. Fortunately, the earth, the heavens and the mountains, could not hear or understand the utterly wrong words of the infidels.",
      "text_tafsir": "Bila bumi, langit dan gunung-gunung dapat mendengar dan memahami ucapan orang-orang kafir itu, meskipun ia tidak diberi akal dan pikiran oleh Allah, maka langit, bumi dan gunung-gunung yang besar itu akan terguncang dengan dahsyatnya karena terkejut dan mungkin akan menjadi hancur lebur, karena tidak dapat menerima ucapan yang sangat berat tanggung jawabnya, dan sangat menghina serta merendahkan martabat Penciptanya. Untunglah bumi langit dan gunung-gunung itu tidak dapat mendengar apalagi memahami ucapan orang-orang kafir yang sangat keliru itu.",
      "text_translation": "hampir saja langit pecah, dan bumi terbelah, dan gunung-gunung runtuh, (karena ucapan itu),",
      "text": "تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الْاَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا ۙ",
      "text_translation_en": "whereat the heavens might well-nigh be rent into fragments, and the earth be split asunder, and the mountains fall down in ruins!",
      "juz_number": 16
    },
    "91": {
      "text_tafsir_en": "If the earth, the sky and the mountains could hear and understand the words of the disbelievers, even though he was not given reason and thought by God, then the heavens, the earth and the great mountains would be shaken violently with shock and might become destroyed, because it can not accept words that are very heavy responsibility, and very insulting and demeaning the Creator. Fortunately, the earth, the heavens and the mountains, could not hear or understand the utterly wrong words of the infidels.",
      "text_tafsir": "Bila bumi, langit dan gunung-gunung dapat mendengar dan memahami ucapan orang-orang kafir itu, meskipun ia tidak diberi akal dan pikiran oleh Allah, maka langit, bumi dan gunung-gunung yang besar itu akan terguncang dengan dahsyatnya karena terkejut dan mungkin akan menjadi hancur lebur, karena tidak dapat menerima ucapan yang sangat berat tanggung jawabnya, dan sangat menghina serta merendahkan martabat Penciptanya. Untunglah bumi langit dan gunung-gunung itu tidak dapat mendengar apalagi memahami ucapan orang-orang kafir yang sangat keliru itu.",
      "text_translation": "karena mereka menganggap (Allah) Yang Maha Pengasih mempunyai anak.",
      "text": "اَنْ دَعَوْا لِلرَّحْمٰنِ وَلَدًا ۚ",
      "text_translation_en": "That men. should ascribe a son to the Most Gracious,",
      "juz_number": 16
    },
    "92": {
      "text_tafsir_en": "God in this verse argues in his words, \"It is not fit for the Beneficent to raise children.\" Such is the response of the Most Merciful and Merciful in the words of His most beloved servant. He did not scold them and punish them directly, but answered them with words that they should think deeply to return to the truth and purify their Lord of all nature contrary to His uniqueness and greatness.",
      "text_tafsir": "Allah dalam ayat ini membantah dengan firman-Nya, \"Tidak layak bagi Tuhan Yang Maha Pemurah memungut anak.\" Demikianlah jawaban Allah Yang Maha Pengasih lagi Penyayang terhadap ucapan hamba-Nya yang sangat dimurkai-Nya itu. Dia tidak membentak dan menghukum mereka secara langsung, tetapi menjawabnya dengan kata-kata yang seharusnya dipikirkan dalam-dalam agar mereka kembali kepada kebenaran dan mensucikan Tuhannya dari segala sifat yang bertentangan dengan keesaan dan keagungan-Nya.",
      "text_translation": "Dan tidak mungkin bagi (Allah) Yang Maha Pengasih mempunyai anak.",
      "text": "وَمَا يَنْۢبَغِيْ لِلرَّحْمٰنِ اَنْ يَّتَّخِذَ وَلَدًا ۗ",
      "text_translation_en": "although it is inconceivable that the Most Gracious should take unto Himself a son!",
      "juz_number": 16
    },
    "93": {
      "text_tafsir_en": "In this verse God also emphasizes that all who are in heaven and on earth, angels, spirits, and men, will all come to the presence of Allah (their Lord) on the Day of Judgment as a servant, obedient and subject to all the decisions and punishments He has decreed for each of His creatures. No one can deny his decision at that time because it was a just decision. Some are entitled to punishment and torture in accordance with the crimes and crimes committed, while others are entitled to rewards and rewards in accordance with the righteous deeds and deeds done.",
      "text_tafsir": "Pada ayat ini Allah menegaskan pula bahwa semua yang ada di langit dan di bumi baik malaikat, jin, maupun manusia, semuanya akan datang menghadap kehadirat Allah (Tuhannya) pada hari kiamat sebagai hamba, patuh dan tunduk kepada semua putusan dan hukuman yang diputuskan-Nya bagi masing-masing makhluk-Nya. Tiada seorang pun yang dapat menyangkal putusan-Nya pada waktu itu karena putusan itu adalah putusan yang adil. Ada yang berhak menerima azab dan siksaan sesuai dengan kedurhakaan dan kejahatan yang dilakukan, ada pula yang berhak menerima ganjaran dan pahala sesuai dengan ketakwaan dan amal kebaikan yang diusahakan.",
      "text_translation": "Tidak ada seorang pun di langit dan di bumi, melainkan akan datang kepada (Allah) Yang Maha Pengasih sebagai seorang hamba.",
      "text": "اِنْ كُلُّ مَنْ فِى السَّمٰوٰتِ وَالْاَرْضِ اِلَّآ اٰتِى الرَّحْمٰنِ عَبْدًا ۗ",
      "text_translation_en": "Not one of all [the beings] that are in the heavens or on earth appears before the Most Gracious other than as a servant:",
      "juz_number": 16
    },
    "94": {
      "text_tafsir_en": "Then Allah explained that all their deeds and piety had been recorded in a very thorough and detailed book. No one was spared in that record, all their deeds were small or large. All their real and hidden words have been carefully written and calculated and they are all waiting for what they will receive in return.",
      "text_tafsir": "Kemudian Allah menjelaskan bahwa semua amal dan takwa mereka itu telah tercatat dalam kitab yang amat teliti dan terperinci tidak seorang pun terluput dalam catatan itu, semua amal perbuatan mereka baik yang kecil maupun yang besar. Semua ucapan mereka yang nyata dan tersembunyi telah ditulis dan diperhitungkan secermat-cermatnya dan mereka semua menunggu balasan apa yang akan diterimanya.",
      "text_translation": "Dia (Allah) benar-benar telah menentukan jumlah mereka dan menghitung mereka dengan hitungan yang teliti.",
      "text": "لَقَدْ اَحْصٰىهُمْ وَعَدَّهُمْ عَدًّا ۗ",
      "text_translation_en": "indeed, He has full cognizance of them, and has numbered them with [unfailing] numbering;",
      "juz_number": 16
    },
    "95": {
      "text_tafsir_en": "On the Day of Judgment the unbelievers come to the presence of God to receive their calculations and decisions about their actions alone without being accompanied by even those closest to them such as their children or their wives. Such was the decree that God had set for each of His servants that day, no one could escape His judgment, every man must face such a great and terrible event with a feeling of hope, whether he would be included among the people. wretched ones who will be dragged to hell in a day of humiliation or include a group of happy people who will be welcomed into heaven with honor and dignity.",
      "text_tafsir": "Pada hari Kiamat orang kafir datang menghadap kehadirat Allah untuk menerima perhitungan dan putusan mengenai perbuatan mereka masing-masing seorang diri tidak ditemani oleh orang yang paling dekat sekalipun seperti anak atau istrinya. \n\nDemikianlah ketentuan yang telah ditetapkan Allah bagi setiap hamba-Nya pada hari itu, tiada seorang pun yang dapat lolos dari pengadilan-Nya, setiap orang pasti menghadapi peristiwa yang hebat dan dahsyat itu dengan perasaan harap-harap cemas, apakah ia akan termasuk dalam golongan orang-orang yang celaka yang akan digiring ke neraka dalam keadaan hina dina atau termasuk golongan orang yang berbahagia yang akan dipersilakan masuk ke dalam surga dengan terhormat dan mulia.",
      "text_translation": "Dan setiap orang dari mereka akan datang kepada Allah sendiri-sendiri pada hari Kiamat.",
      "text": "وَكُلُّهُمْ اٰتِيْهِ يَوْمَ الْقِيٰمَةِ فَرْدًا ",
      "text_translation_en": "and every one of them will appear before Him on Resurrection Day in a lonely state.",
      "juz_number": 16
    },
    "96": {
      "text_tafsir_en": "This verse explains that God will instill love in the hearts of His servants who believe, fear and continue to do good deeds. This means that everyone who is a true believer and always does good deeds will have a good place in the heart of every Muslim. Although the believer has never tried to impress others, he must have been attracted to him, because the cultivation of sympathy and love for the believer is not only a sweet mouth and a good word but because God himself instills that love into the bosom of His servants. In a hadith narrated by Abu Hurairah, the Messenger of Allah (may peace be upon him) said: Verily Allah loves his servant. He called the angel Gabriel and he said to him, \"Truly I love the moon, and you must love him also.\" Then it was called down to the heavens, and the love of the earth descended upon it. (History of al-Bukhari, Muslim and at-Tirmidzi) In this verse Ibn Mardawaih and ad-Dailami narrate from al-Bara 'that he said that the Messenger of Allah (may peace be upon him) said to Ali Karramallahu: be saved in the hereafter) and bury them in the hearts of those who believe in me. \" Then come down to this verse. (History of Ibn Mardawaih and ad-Dialami) It is true that when we look at human life in society it is evident that this verse is true. Every true believer, truly sincere in his good deeds, genuinely working for the benefit of his people does not expect money, rank or position, and simply hopes for divine providence, he must be loved by his people even if he does not try to in that direction. If anyone hates or is angry with them, then the angry person is a bad person, unkind and tempted by the devil and the devil.",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah akan menanamkan rasa kasih sayang dalam hati sesama hamba-hamba-Nya yang mukmin, bertakwa dan tetap mengerjakan amal saleh. Ini berarti bahwa setiap orang yang benar-benar beriman dan selalu mengerjakan perbuatan yang baik pasti akan mendapat tempat yang baik dalam hati setiap muslim. Walaupun orang yang beriman itu tidak pernah berusaha menarik hati orang lain namun orang itu pasti tertarik kepadanya, karena tertanamnya rasa simpati dan kasih sayang kepada orang mukmin itu bukan hanya berupa mulut manis dan tutur kata yang baik tetapi karena Allah sendiri yang menanamkan rasa kasih sayang itu ke dalam dada hamba-hamba-Nya. Dalam sebuah hadis yang diriwayatkan oleh Abu Hurairah, Rasulullah bersabda:\n\nSesungguhnya Allah bila mengasihi seorang hamba-Nya. Dia panggil Malaikat Jibril lalu Dia berkata kepadanya, \"Sesungguhnya Aku mengasihi si fulan maka hendaknya engkau mengasihi dia pula.\" Maka diserukanlah (hal itu) di langit kemudian turunlah kepadanya kasih sayang di bumi. (Riwayat al-Bukhari, Muslim dan at-Tirmidzi)\n\nMengenai ayat ini Ibnu Mardawaih dan ad-Dailami meriwayatkan dari al-Bara' ia berkata bahwa Rasulullah saw bersabda kepada Ali Karramallahu wajhah:\n\nKatakanlah, \"Ya Allah berikanlah kepadaku janji Engkau (agar aku diselamatkan di akhirat nanti) dan tanamkanlah dalam hati orang-orang yang beriman rasa cinta kepadaku.\" Maka turunlah ayat ini. (Riwayat Ibnu Mardawaih dan ad-Dailami)\n\nMemang apabila kita perhatikan kehidupan manusia dalam masyarakat akan terbukti kebenaran ayat ini. Setiap orang yang benar-benar beriman, benar-benar ikhlas dalam amal baiknya, benar-benar bekerja untuk kepentingan masyarakatnya tidak mengharapkan uang, pangkat atau kedudukan, dan semata-mata mengharapkan keridaan Ilahi, pastilah orang itu dicintai masyarakatnya walaupun dia sendiri tidak berusaha ke arah itu. Bila ada orang yang benci atau marah kepadanya pastilah orang yang marah itu orang yang tidak baik niatnya, tidak berakhlak mulia dan tergoda oleh tipu daya setan dan Iblis.",
      "text_translation": "Sungguh, orang-orang yang beriman dan mengerjakan kebajikan, kelak (Allah) Yang Maha Pengasih akan menanamkan rasa kasih sayang (dalam hati mereka).",
      "text": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَيَجْعَلُ لَهُمُ الرَّحْمٰنُ وُدًّا ",
      "text_translation_en": "VERILY, those who attain to faith and do righteous deeds will the Most Gracious endow with love:",
      "juz_number": 16
    },
    "97": {
      "text_tafsir_en": "Allah explained that the Qur'an was revealed in Arabic, the language used by the Prophet Muhammad and his people is to make it easy for the Prophet to convey the content and meaning and also to be understood by his people, for it was the first time that the Islamic call was given then new to human beings of all kinds and languages. The Qur'an, which contains warnings and glad tidings, commandments and prohibitions, seeks to give man guidance to fear Allah by believing in him without associating with anything and obeying His commands, stopping His prohibition and always seeking happiness, Her. Such people will be blessed by God happiness in this world and in the hereafter. As for those who disobey Him and reject His Messenger, they will receive a fair reward for their disobedience and their wickedness both in the world and in the Hereafter. The disobedience of the ancient peoples of this world by destroying and destroying them with all kinds of torments, some in the form of terrible earthquakes, hurricanes, loud noises and so forth, as was done to 'Ad, sea and people Noah. Whereas for the Muhammadans the torture of this world is not to destroy and destroy but to bring down trials and calamities, in the hope that they will realize and repent and return to the truth. The vengeance of the Hereafter is to bestow His grace upon the faithful believers by entering them into the paradise of Jannat Na'im, full of grace and joy, and receiving His love and devotion. For those who disobey and disbelieve there is a painful torment of hell. As proof of the truth of his threat. God has explained that many of the ancient nations were destroyed and their former remnants are still to be seen and witnessed to this day and there are no former ones. But it is clear that the people have been destroyed so that no one is left until now with only the news that people have passed down through the ages. The news about them is clearly stated in the Qur'an, so we must believe it because its source is the revelation of God.",
      "text_tafsir": "Allah menerangkan bahwa Al-Qur'an diturunkan dalam bahasa Arab, bahasa yang dipakai oleh Nabi Muhammad dan kaumnya gunanya adalah agar mudah bagi Nabi untuk menyampaikan isi dan maksudnya dan mudah pula dipahami oleh kaumnya, karena kepada merekalah pertama kali seruan Islam disampaikan kemudian baru kepada manusia seluruhnya dari berbagai jenis suku dan bahasanya. Al-Qur'an yang berisi peringatan dan kabar gembira, perintah dan larangan, bertujuan memberi hidayah kepada manusia agar bertakwa kepada Allah yaitu beriman kepada-Nya tanpa mempersekutukan-Nya dengan suatu apapun dan menaati perintahNya, menghentikan larangan-Nya dan selalu mencari keridaan-Nya. Orang-orang yang demikian sifatnya akan dikaruniai Allah kebahagiaan di dunia dan di akhirat. \n\nAdapun orang-orang yang ingkar kepada-Nya dan mendustakan Rasul-Nya, mereka akan menerima balasan yang setimpal atas keingkaran dan kedurhakaannya itu baik di dunia maupun di akhirat kelak. Keingkaran umat-umat yang dahulu mendapat balasan di dunia ini dengan menghancurkan dan membinasakan mereka dengan berbagai macam siksa, ada yang berupa gempa yang dahsyat, angin topan, suara keras yang mengguntur dan lain sebagainya, seperti yang ditimpakan kepada kaum 'Ad, samud dan kaum Nabi Nuh. Sedangkan bagi umat Muhammad siksaan di dunia ini tidaklah berupa penghancuran dan pembinasaan tetapi dengan menurunkan cobaan dan malapetaka, dengan harapan mereka akan sadar dan insaf lalu kembali kepada kebenaran. Pembalasan di akhirat ialah dengan melimpahkan karunia-Nya kepada orang-orang mukmin yang bertakwa dengan memasukkan mereka ke dalam surga Jannatun Na'im yang penuh nikmat dan kesenangan serta mendapat kasih sayang dan keridaan-Nya. \n\nBagi orang-orang yang ingkar dan kafir disediakan azab yang pedih yaitu neraka. Sebagai bukti kebenaran ancaman-Nya. Allah menerangkan bahwa telah banyak umat-umat dahulu yang durhaka yang dimusnahkan dan bekas-bekas peninggalan mereka ada yang masih dapat dilihat dan disaksikan sampai sekarang dan ada pula yang tidak ada bekasnya sama sekali. Tetapi yang jelas umat-umat itu telah hancur binasa tiada seorang pun yang tersisa sampai masa kini yang ada hanya beritanya yang dihikayatkan orang secara turun temurun. Berita tentang mereka diceritakan dalam Al-Qur'an dengan jelas, maka kita wajib meyakininya karena sumbernya adalah wahyu Allah.",
      "text_translation": "Maka sungguh, telah Kami mudahkan (Al-Qur'an) itu dengan bahasamu (Muhammad), agar dengan itu engkau dapat memberi kabar gembira kepada orang-orang yang bertakwa, dan agar engkau dapat memberi peringatan kepada kaum yang membangkang.",
      "text": "فَاِنَّمَا يَسَّرْنٰهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ الْمُتَّقِيْنَ وَتُنْذِرَ بِهٖ قَوْمًا لُّدًّا ",
      "text_translation_en": "and only to this end have We made this [divine writ] easy to understand, in thine own tongue, [O Prophet,] so that thou might convey thereby a glad tiding to the God-conscious, and warn thereby those who are given to [futile] contention:",
      "juz_number": 16
    },
    "98": {
      "text_tafsir_en": "Allah explained that the Qur'an was revealed in Arabic, the language used by the Prophet Muhammad and his people is to make it easy for the Prophet to convey the content and meaning and also to be understood by his people, for it was the first time that the Islamic call was given then new to human beings of all kinds and languages. The Qur'an, which contains warnings and glad tidings, commandments and prohibitions, seeks to give man guidance to fear Allah by believing in him without associating with anything and obeying His commands, stopping His prohibition and always seeking happiness, Her. Such people will be blessed by God happiness in this world and in the hereafter. As for those who disobey Him and reject His Messenger, they will receive a fair reward for their disobedience and their wickedness both in the world and in the Hereafter. The disobedience of the ancient peoples of this world by destroying and destroying them with all kinds of torments, some in the form of terrible earthquakes, hurricanes, loud noises and so forth, as was done to 'Ad, sea and people Noah. Whereas for the Muhammadans the torture of this world is not to destroy and destroy but to bring down trials and calamities, in the hope that they will realize and repent and return to the truth. The vengeance of the Hereafter is to bestow His grace upon the faithful believers by entering them into the paradise of Jannat Na'im, full of grace and joy, and receiving His love and devotion. For those who disobey and disbelieve there is a painful torment of hell. As proof of the truth of his threat. God has explained that many of the ancient nations were destroyed and their former remnants are still to be seen and witnessed to this day and there are no former ones. But it is clear that the people have been destroyed so that no one is left until now with only the news that people have passed down through the ages. The news about them is clearly stated in the Qur'an, so we must believe it because its source is the revelation of God.",
      "text_tafsir": "Allah menerangkan bahwa Al-Qur'an diturunkan dalam bahasa Arab, bahasa yang dipakai oleh Nabi Muhammad dan kaumnya gunanya adalah agar mudah bagi Nabi untuk menyampaikan isi dan maksudnya dan mudah pula dipahami oleh kaumnya, karena kepada merekalah pertama kali seruan Islam disampaikan kemudian baru kepada manusia seluruhnya dari berbagai jenis suku dan bahasanya. Al-Qur'an yang berisi peringatan dan kabar gembira, perintah dan larangan, bertujuan memberi hidayah kepada manusia agar bertakwa kepada Allah yaitu beriman kepada-Nya tanpa mempersekutukan-Nya dengan suatu apapun dan menaati perintahNya, menghentikan larangan-Nya dan selalu mencari keridaan-Nya. Orang-orang yang demikian sifatnya akan dikaruniai Allah kebahagiaan di dunia dan di akhirat. \n\nAdapun orang-orang yang ingkar kepada-Nya dan mendustakan Rasul-Nya, mereka akan menerima balasan yang setimpal atas keingkaran dan kedurhakaannya itu baik di dunia maupun di akhirat kelak. Keingkaran umat-umat yang dahulu mendapat balasan di dunia ini dengan menghancurkan dan membinasakan mereka dengan berbagai macam siksa, ada yang berupa gempa yang dahsyat, angin topan, suara keras yang mengguntur dan lain sebagainya, seperti yang ditimpakan kepada kaum 'Ad, samud dan kaum Nabi Nuh. Sedangkan bagi umat Muhammad siksaan di dunia ini tidaklah berupa penghancuran dan pembinasaan tetapi dengan menurunkan cobaan dan malapetaka, dengan harapan mereka akan sadar dan insaf lalu kembali kepada kebenaran. Pembalasan di akhirat ialah dengan melimpahkan karunia-Nya kepada orang-orang mukmin yang bertakwa dengan memasukkan mereka ke dalam surga Jannatun Na'im yang penuh nikmat dan kesenangan serta mendapat kasih sayang dan keridaan-Nya. \n\nBagi orang-orang yang ingkar dan kafir disediakan azab yang pedih yaitu neraka. Sebagai bukti kebenaran ancaman-Nya. Allah menerangkan bahwa telah banyak umat-umat dahulu yang durhaka yang dimusnahkan dan bekas-bekas peninggalan mereka ada yang masih dapat dilihat dan disaksikan sampai sekarang dan ada pula yang tidak ada bekasnya sama sekali. Tetapi yang jelas umat-umat itu telah hancur binasa tiada seorang pun yang tersisa sampai masa kini yang ada hanya beritanya yang dihikayatkan orang secara turun temurun. Berita tentang mereka diceritakan dalam Al-Qur'an dengan jelas, maka kita wajib meyakininya karena sumbernya adalah wahyu Allah.",
      "text_translation": "Dan berapa banyak umat yang telah Kami binasakan sebelum mereka. Adakah engkau (Muhammad) melihat salah seorang dari mereka atau engkau mendengar bisikan mereka?",
      "text": "وَكَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍۗ هَلْ تُحِسُّ مِنْهُمْ مِّنْ اَحَدٍ اَوْ تَسْمَعُ لَهُمْ رِكْزًا ࣖ",
      "text_translation_en": "for, how many a generation have We destroyed before their time - [and] canst thou perceive any one of them [now], or hear any whisper of them?",
      "juz_number": 16
    }
  },
  "name": "مريم",
  "name_translation_en": "Mary",
  "name_translation": "Maryam",
  "name_latin": "Maryam"
}