{
  "number": 23,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 118,
  "ayat": {
    "1": {
      "text_tafsir_en": "Believe in God and the pillar of the six faiths. In this verse God explains that the believers are very happy and fortunate, and in turn lose the unbelievers, because even though they are counting on doing good deeds, they are all in vain. in the hereafter, for not believing in him.",
      "text_tafsir": "Beriman kepada Allah dan rukun iman yang enam. Dalam ayat ini Allah menjelaskan bahwa sungguh berbahagia dan beruntung orang-orang yang beriman, dan sebaliknya sangat merugi orang-orang kafir yang tidak beriman, karena walaupun mereka menurut perhitungan banyak mengerja-kan amal kebajikan, akan tetapi semua amalnya itu akan sia-sia saja di akhirat nanti, karena tidak berlandaskan iman kepada-Nya.",
      "text_translation": "Sungguh beruntung orang-orang yang beriman,",
      "text": " قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ ۙ",
      "text_translation_en": "TRULY, to a happy state shall attain the believers:",
      "juz_number": 18
    },
    "2": {
      "text_tafsir_en": "Special in prayer. In this verse God explains the second nature, that of a lucky believer, if prayer is truly devoted to his prayer, his mind always remembers God, and concentrates all his mind and senses on his prayer. He realized and felt that the devout man was really in the presence of his Lord, and therefore his whole body and soul were filled with indignation, service and sincerity, fearful and intertwined with hope in his Lord. In order to fulfill the requirements of the prayer in the prayer, one must observe three things, namely: a) Understand what is read, so that what the tongue says is understood and understood, according to the verse: Do they not understand the Qur'an or their heart already locked? (Muhammad \/ 47: 24) b) Remember Allah, according to His word: And perform a prayer in remembrance of Me. (thaha \/ 20: 14) c) Salat means to honor God, the mind and heart of the prayerful person must always remember and not be neglected or neglected. Scholars argue that non-consensual prayers are the same as inanimate bodies. However, the absence of devotion in prayer does not invalidate the prayer, and is not required to be repeated.",
      "text_tafsir": "Khusyuk dalam salat. Dalam ayat ini Allah menjelaskan sifat yang kedua, yaitu seorang mukmin yang beruntung, jika salat benar-benar khusyuk dalam salatnya, pikirannya selalu mengingat Allah, dan memusatkan semua pikiran dan panca inderanya untuk bermunajat kepada-Nya. Dia menyadari dan merasakan bahwa orang yang salat itu benar-benar sedang berhadapan dengan Tuhannya, oleh karena itu seluruh anggota tubuh dan jiwanya dipenuhi kekhusyukan, kekhidmatan dan keikhlasan, diselingi dengan rasa takut dan diselubungi dengan penuh harapan kepada Tuhannya. Untuk dapat memenuhi syarat kekhusyukan dalam salat, harus memperhati-kan tiga perkara, yaitu:\n\na) Paham apa yang dibaca, supaya apa yang diucapkan lidahnya dapat dipahami dan dimengerti, sesuai dengan ayat:\n\nMaka tidakkah mereka menghayati Al-Qur'an ataukah hati mereka sudah terkunci? (Muhammad\/47: 24)\n\nb) Ingat kepada Allah, sesuai dengan firman-Nya:\n\nDan laksanakanlah salat untuk mengingat Aku. (thaha\/20: 14)\n\nc) Salat berarti munajat kepada Allah, pikiran dan perasaan orang yang salat harus selalu mengingat dan jangan lengah atau lalai. Para ulama berpendapat bahwa salat yang tidak khusyuk sama dengan tubuh tidak bernyawa. Akan tetapi ketiadaan khusyuk dalam salat tidak membatalkan salat, dan tidak wajib diulang kembali.",
      "text_translation": "(yaitu) orang yang khusyuk dalam salatnya,",
      "text": " الَّذِيْنَ هُمْ فِيْ صَلٰو تِهِمْ خَاشِعُوْنَ",
      "text_translation_en": "those who humble themselves in their prayer,",
      "juz_number": 18
    },
    "3": {
      "text_tafsir_en": "Stay away from any useless acts or words. In this verse God explains the third characteristic, namely that a happy believer is the one who keeps his time and age to be in vain. Just as he is devoted to his prayers, he turns away from everything except the creator of God, so he turns away from every word that is useless to himself or others.",
      "text_tafsir": "Menjauhkan diri dari setiap perbuatan atau perkataan yang tidak berguna. Dalam ayat ini Allah menjelaskan sifat yang ketiga, yaitu bahwa seorang mukmin yang bahagia itu ialah yang selalu menjaga waktu dan umurnya supaya jangan sia-sia. Sebagaimana ia khusyuk dalam salatnya, berpaling dari segala sesuatu kecuali dari Tuhan penciptanya, demikian pula ia berpaling dari segala perkataan yang tidak berguna bagi dirinya atau orang lain.",
      "text_translation": "dan orang yang menjauhkan diri dari (perbuatan dan perkataan) yang tidak berguna,",
      "text": "وَالَّذِيْنَ هُمْ عَنِ اللَّغْوِ مُعْرِضُوْنَ ۙ",
      "text_translation_en": "and who turn away from all that is frivolous,",
      "juz_number": 18
    },
    "4": {
      "text_tafsir_en": "Make a compulsory charity and organized donations. In this verse God explains that the fourth characteristic of the blessed believers is to give alms and to give donations, which they view as an attempt to purge their wealth from selfishness, greed, selfishness (selfishness) , and also to alleviate the suffering of the servants of God, in accordance with His word: Blessed are those who sanctify (the soul). (as- Syams 91: 9)",
      "text_tafsir": "Menunaikan zakat wajib dan derma yang dianjurkan. Dalam ayat ini Allah menerangkan bahwa sifat keempat dari orang mukmin yang beruntung itu, ialah suka mengeluarkan zakat dan memberi derma yang dianjurkan, yang oleh mereka dipandang sebagai usaha untuk membersihkan harta dan dirinya dari sifat kikir, tamak serakah, hanya mengutamakan diri sendiri (egois), dan juga untuk meringankan penderitaan hamba-hamba Allah yang kekurangan, sesuai dengan firman-Nya:\n\nSungguh beruntung orang yang menyucikannya (jiwa itu). (asy- Syams\/91: 9)",
      "text_translation": "dan orang yang menunaikan zakat,",
      "text": "وَالَّذِيْنَ هُمْ لِلزَّكٰوةِ فَاعِلُوْنَ ۙ",
      "text_translation_en": "and who are intent on inner purity;",
      "juz_number": 18
    },
    "5": {
      "text_tafsir_en": "Protecting your sexually immoral behavior. In this verse God describes the fifth nature of happy believers, namely, guarding their sexuality from every act of immorality such as adultery, performing the acts of the Lut (homosexuals), hostility, and so on. Mutual is allowed by religion only by the wife who is legally married or by her jima (girl) obtained from jihad fisabilillah, because in this case they are not defamed. However, whoever does it outside of it, they are the ones who go beyond the limits. In this verse and the preceding God explains that the happiness of a servant of God depends on the protection of his genitals from various abuses to exclude the despised and transcendent. Resist the urge to lust, much less to bear than the consequences of adultery. Allah has commanded His prophet to pass this commandment to his people, that they should hold back his chastity and keep his word with the words: Speak to men of faith, that they may keep their eyes, and preserve their shame; that is, more holy to them. Indeed, Allah knows best what they do. (an-Nur \/ 24: 30)",
      "text_tafsir": "Menjaga kemaluan dari perbuatan keji. Dalam ayat ini Allah menerangkan sifat kelima dari orang mukmin yang berbahagia, yaitu suka menjaga kemaluannya dari setiap perbuatan keji seperti berzina, mengerjakan perbuatan kaum Lut (homoseksual), onani, dan sebagainya. Bersanggama yang diperbolehkan oleh agama hanya dengan istri yang telah dinikahi dengan sah atau dengan jariahnya (budak perempuan) yang di-peroleh dari jihad fisabilillah, karena dalam hal ini mereka tidak tercela.\n\nAkan tetapi, barangsiapa yang berbuat di luar yang tersebut itu, mereka itulah orang-orang yang melampaui batas. Dalam ayat ini dan yang sebelumnya Allah menjelaskan bahwa kebahagiaan seorang hamba Allah itu tergantung kepada pemeliharaan kemaluannya dari berbagai penyalahgunaan supaya tidak termasuk orang yang tercela dan melampaui batas.\n\nMenahan ajakan hawa nafsu, jauh lebih ringan daripada menanggung akibat dari perbuatan zina itu. Allah telah memerintahkan Nabi-Nya supaya menyampaikan perintah itu kepada umatnya, agar mereka menahan pan-dangannya dan memelihara kemaluannya dengan firman:\n\nKatakanlah kepada laki-laki yang beriman, agar mereka menjaga pandangannya, dan memelihara kemaluannya; yang demikian itu, lebih suci bagi mereka. Sungguh, Allah Maha Mengetahui apa yang mereka perbuat. (an-Nur\/24: 30)",
      "text_translation": "dan orang yang memelihara kemaluannya,",
      "text": " وَالَّذِيْنَ هُمْ لِفُرُوْجِهِمْ حٰفِظُوْنَ ۙ",
      "text_translation_en": "and who are mindful of their chastity,",
      "juz_number": 18
    },
    "6": {
      "text_tafsir_en": "Protecting your sexually immoral behavior. In this verse God describes the fifth nature of happy believers, namely, guarding their sexuality from every act of immorality such as adultery, performing the acts of the Lut (homosexuals), hostility, and so on. Mutual is allowed by religion only by the wife who is legally married or by her jima (girl) obtained from jihad fisabilillah, because in this case they are not defamed. However, whoever does it outside of it, they are the ones who go beyond the limits. In this verse and the preceding God explains that the happiness of a servant of God depends on the protection of his genitals from various abuses to exclude the despised and transcendent. Resist the urge to lust, much less to bear than the consequences of adultery. Allah has commanded His prophet to pass this commandment to his people, that they should hold back his chastity and keep his word with the words: Speak to men of faith, that they may keep their eyes, and preserve their shame; that is, more holy to them. Indeed, Allah knows best what they do. (an-Nur \/ 24: 30)",
      "text_tafsir": "Menjaga kemaluan dari perbuatan keji. Dalam ayat ini Allah menerangkan sifat kelima dari orang mukmin yang berbahagia, yaitu suka menjaga kemaluannya dari setiap perbuatan keji seperti berzina, mengerjakan perbuatan kaum Lut (homoseksual), onani, dan sebagainya. Bersanggama yang diperbolehkan oleh agama hanya dengan istri yang telah dinikahi dengan sah atau dengan jariahnya (budak perempuan) yang di-peroleh dari jihad fisabilillah, karena dalam hal ini mereka tidak tercela.\n\nAkan tetapi, barangsiapa yang berbuat di luar yang tersebut itu, mereka itulah orang-orang yang melampaui batas. Dalam ayat ini dan yang sebelumnya Allah menjelaskan bahwa kebahagiaan seorang hamba Allah itu tergantung kepada pemeliharaan kemaluannya dari berbagai penyalahgunaan supaya tidak termasuk orang yang tercela dan melampaui batas.\n\nMenahan ajakan hawa nafsu, jauh lebih ringan daripada menanggung akibat dari perbuatan zina itu. Allah telah memerintahkan Nabi-Nya supaya menyampaikan perintah itu kepada umatnya, agar mereka menahan pan-dangannya dan memelihara kemaluannya dengan firman:\n\nKatakanlah kepada laki-laki yang beriman, agar mereka menjaga pandangannya, dan memelihara kemaluannya; yang demikian itu, lebih suci bagi mereka. Sungguh, Allah Maha Mengetahui apa yang mereka perbuat. (an-Nur\/24: 30)",
      "text_translation": "kecuali terhadap istri-istri mereka atau hamba sahaya yang mereka miliki; maka sesungguhnya mereka tidak tercela.",
      "text": "اِلَّا عَلٰٓى اَزْوَاجِهِمْ اَوْ مَا مَلَكَتْ اَيْمَانُهُمْ فَاِنَّهُمْ غَيْرُ مَلُوْمِيْنَۚ",
      "text_translation_en": "[not giving way to their desires] with any but their spouses - that is, those whom they rightfully possess [through wedlock]: for then, behold, they are free of all blame,",
      "juz_number": 18
    },
    "7": {
      "text_tafsir_en": "Protecting your sexually immoral behavior. In this verse God describes the fifth nature of happy believers, namely, guarding their sexuality from every act of immorality such as adultery, performing the acts of the Lut (homosexuals), hostility, and so on. Mutual is allowed by religion only by the wife who is legally married or by her jima (girl) obtained from jihad fisabilillah, because in this case they are not defamed. However, whoever does it outside of it, they are the ones who go beyond the limits. In this verse and the preceding God explains that the happiness of a servant of God depends on the protection of his genitals from various abuses to exclude the despised and transcendent. Resist the urge to lust, much less to bear than the consequences of adultery. Allah has commanded His prophet to pass this commandment to his people, that they should hold back his chastity and keep his word with the words: Speak to men of faith, that they may keep their eyes, and preserve their shame; that is, more holy to them. Indeed, Allah knows best what they do. (an-Nur \/ 24: 30)",
      "text_tafsir": "Menjaga kemaluan dari perbuatan keji. Dalam ayat ini Allah menerangkan sifat kelima dari orang mukmin yang berbahagia, yaitu suka menjaga kemaluannya dari setiap perbuatan keji seperti berzina, mengerjakan perbuatan kaum Lut (homoseksual), onani, dan sebagainya. Bersanggama yang diperbolehkan oleh agama hanya dengan istri yang telah dinikahi dengan sah atau dengan jariahnya (budak perempuan) yang di-peroleh dari jihad fisabilillah, karena dalam hal ini mereka tidak tercela.\n\nAkan tetapi, barangsiapa yang berbuat di luar yang tersebut itu, mereka itulah orang-orang yang melampaui batas. Dalam ayat ini dan yang sebelumnya Allah menjelaskan bahwa kebahagiaan seorang hamba Allah itu tergantung kepada pemeliharaan kemaluannya dari berbagai penyalahgunaan supaya tidak termasuk orang yang tercela dan melampaui batas.\n\nMenahan ajakan hawa nafsu, jauh lebih ringan daripada menanggung akibat dari perbuatan zina itu. Allah telah memerintahkan Nabi-Nya supaya menyampaikan perintah itu kepada umatnya, agar mereka menahan pan-dangannya dan memelihara kemaluannya dengan firman:\n\nKatakanlah kepada laki-laki yang beriman, agar mereka menjaga pandangannya, dan memelihara kemaluannya; yang demikian itu, lebih suci bagi mereka. Sungguh, Allah Maha Mengetahui apa yang mereka perbuat. (an-Nur\/24: 30)",
      "text_translation": "Tetapi barang siapa mencari di balik itu (zina, dan sebagainya), maka mereka itulah orang-orang yang melampaui batas.",
      "text": "فَمَنِ ابْتَغٰى وَرَاۤءَ ذٰلِكَ فَاُولٰۤىِٕكَ هُمُ الْعٰدُوْنَ ۚ",
      "text_translation_en": "whereas such as seek to go beyond that [limit] are truly transgressors;",
      "juz_number": 18
    },
    "8": {
      "text_tafsir_en": "Keep the mandates he holds and keep his promises. In this verse, Allah describes the sixth nature of the blessed believers, namely, preserving their trustworthiness, either from Allah or from their fellow men, that is, when they are given something or money as a trust to be given to another person, then they really deliver on the mandate as it should, and do nothing treacherous. Likewise, when they make a covenant, they fulfill it perfectly. They refrain from such hypocrisy in a well-known hadith, which states that the signs of the hypocrite are three, that is, to speak a lie, if they promise something that is false and if they are given a betrayal.",
      "text_tafsir": "Memelihara amanat-amanat yang dipikulnya dan menepati janjinya. Dalam ayat ini Allah menerangkan sifat keenam dari orang mukmin yang beruntung itu, ialah suka memelihara amanat-amanat yang dipikulnya, baik dari Allah ataupun dari sesama manusia, yaitu bilamana kepada mereka dititipkan barang atau uang sebagai amanat yang harus disampaikan kepada orang lain, maka mereka benar-benar menyampaikan amanat itu sebagaimana mestinya, dan tidak berbuat khianat. Demikian pula bila mereka mengadakan perjanjian, mereka memenuhinya dengan sempurna. Mereka menjauhkan diri dari sifat kemunafikan seperti tersebut dalam sebuah hadis yang masyhur, yang menyatakan bahwa tanda-tanda orang munafik itu ada tiga, yaitu kalau berbicara suka berdusta, jika menjanjikan sesuatu suka menyalahi janji dan jika diberi amanat suka berkhianat.",
      "text_translation": "Dan (sungguh beruntung) orang yang memelihara amanat-amanat dan janjinya,",
      "text": "وَالَّذِيْنَ هُمْ لِاَمٰنٰتِهِمْ وَعَهْدِهِمْ رَاعُوْنَ ۙ",
      "text_translation_en": "and who are faithful to their trusts and to their pledges,",
      "juz_number": 18
    },
    "9": {
      "text_tafsir_en": "Maintain a five-hour prayer. In this verse God describes the seventh attribute, namely that the happy believer always keeps and observes the fivefold prayer perfectly, on time, and meets the requirements and rules. This verse is not the same as the second verse above, because it is mentioned that they are devoted to their prayers, while here it is said, that they always keep the prayers in order and order. This group of verses begins with recitation of the prayer and concludes with the recitation of the prayers, giving a reminder of the importance of the prayer that has been made the pillar of religion. The Messenger of Allah once said, \"Whoever performs the prayer is he who founded the religion and the one who abandons the prayer, he indeed demolishes the religion.\" Here is the Hadith's explanation of the importance of prayer: From Abdullah bin Mas'ud said, I asked the Prophet, what is the most beloved of Allah, the Prophet said, salat in time, then what? The Prophet replied, birrul walidain (good to both parents). Then what else? The Prophet said, jihad in the way of Allah. (History of the Prophet) As it is mentioned in a hadith of the Prophet (peace be upon him): From the family, the Prophet said, \"Be quiet and do not count. (History of Ahmad, al-judge and al-Baihaqi)",
      "text_tafsir": "Memelihara salat yang lima waktu. Dalam ayat ini Allah menerangkan sifat yang ketujuh, yaitu orang mukmin yang berbahagia itu selalu memelihara dan memperhatikan salat lima waktu secara sempurna, tepat waktu, dan memenuhi persyaratan dan rukun-rukun. Ayat ini tidak sama dengan ayat kedua di atas, sebab di sana disebutkan bahwa mereka khusyuk dalam salatnya, sedangkan di sini disebutkan, bahwa mereka selalu memelihara salat dengan tertib dan teratur. Kelompok ayat-ayat ini dimulai dengan menyebutkan salat dan disudahi pula dengan menyebut salat, hal ini memberi peringatan betapa pentingnya salat yang telah dijadikan tiang agama. Rasulullah pernah bersabda, \"Barang siapa yang mendirikan salat sungguh ia telah mendirikan agama dan barang siapa yang meninggalkan salat, sungguh ia telah merobohkan agama.\" Berikut penjelasan hadis mengenai keutamaan salat:\n\nDari Abdullah bin Mas'ud berkata, saya bertanya kepada Rasulullah, amalan apa yang paling dicintai Allah, Nabi menjawab, salat pada waktunya, kemudian apa? Nabi menjawab, birrul walidain (berbuat baik kepada kedua orang tua). Kemudian apa lagi? Nabi bersabda, jihad di jalan Allah. (Riwayat asy-Syaikhan)\n\nTersebut pula dalam sebuah hadis Nabi saw:\n\nDari sauban, Nabi bersabda, \"Istiqamahlah kamu dan jangan menghitung-hitung. Ketahuilah bahwa perbuatanmu yang paling baik ialah salat, dan tidak ada orang yang menjaga salat melainkan orang yang beriman. (Riwayat Ahmad, al-hakim dan al-Baihaqi)",
      "text_translation": "serta orang yang memelihara salatnya.",
      "text": "وَالَّذِيْنَ هُمْ عَلٰى صَلَوٰتِهِمْ يُحَافِظُوْنَ ۘ",
      "text_translation_en": "and who guard their prayers [from all worldly intent].",
      "juz_number": 18
    },
    "10": {
      "text_tafsir_en": "Maintain a five-hour prayer. In this verse God describes the seventh attribute, namely that the happy believer always keeps and observes the fivefold prayer perfectly, on time, and meets the requirements and rules. This verse is not the same as the second verse above, because it is mentioned that they are devoted to their prayers, while here it is said, that they always keep the prayers in order and order. This group of verses begins with recitation of the prayer and concludes with the recitation of the prayers, giving a reminder of the importance of the prayer that has been made the pillar of religion. The Messenger of Allah once said, \"Whoever performs the prayer is he who founded the religion and the one who abandons the prayer, he indeed demolishes the religion.\" Here is the Hadith's explanation of the importance of prayer: From Abdullah bin Mas'ud said, I asked the Prophet, what is the most beloved of Allah, the Prophet said, salat in time, then what? The Prophet replied, birrul walidain (good to both parents). Then what else? The Prophet said, jihad in the way of Allah. (History of the Prophet) As it is mentioned in a hadith of the Prophet (peace be upon him): From the family, the Prophet said, \"Be quiet and do not count. (History of Ahmad, al-judge and al-Baihaqi)",
      "text_tafsir": "Memelihara salat yang lima waktu. Dalam ayat ini Allah menerangkan sifat yang ketujuh, yaitu orang mukmin yang berbahagia itu selalu memelihara dan memperhatikan salat lima waktu secara sempurna, tepat waktu, dan memenuhi persyaratan dan rukun-rukun. Ayat ini tidak sama dengan ayat kedua di atas, sebab di sana disebutkan bahwa mereka khusyuk dalam salatnya, sedangkan di sini disebutkan, bahwa mereka selalu memelihara salat dengan tertib dan teratur. Kelompok ayat-ayat ini dimulai dengan menyebutkan salat dan disudahi pula dengan menyebut salat, hal ini memberi peringatan betapa pentingnya salat yang telah dijadikan tiang agama. Rasulullah pernah bersabda, \"Barang siapa yang mendirikan salat sungguh ia telah mendirikan agama dan barang siapa yang meninggalkan salat, sungguh ia telah merobohkan agama.\" Berikut penjelasan hadis mengenai keutamaan salat:\n\nDari Abdullah bin Mas'ud berkata, saya bertanya kepada Rasulullah, amalan apa yang paling dicintai Allah, Nabi menjawab, salat pada waktunya, kemudian apa? Nabi menjawab, birrul walidain (berbuat baik kepada kedua orang tua). Kemudian apa lagi? Nabi bersabda, jihad di jalan Allah. (Riwayat asy-Syaikhan)\n\nTersebut pula dalam sebuah hadis Nabi saw:\n\nDari sauban, Nabi bersabda, \"Istiqamahlah kamu dan jangan menghitung-hitung. Ketahuilah bahwa perbuatanmu yang paling baik ialah salat, dan tidak ada orang yang menjaga salat melainkan orang yang beriman. (Riwayat Ahmad, al-hakim dan al-Baihaqi)",
      "text_translation": "Mereka itulah orang yang akan mewarisi,",
      "text": "اُولٰۤىِٕكَ هُمُ الْوَارِثُوْنَ ۙ",
      "text_translation_en": "It is they, they who shall be the inheritors",
      "juz_number": 18
    },
    "11": {
      "text_tafsir_en": "Those who possess these seven virtues will inherit heaven, because of their charity during their lifetime in the world, the highest Paradise of Paradise, above which is the 'Mercy of the Beneficent God, and they dwell therein. Umar recounts a hadith, in which the Messenger of Allah (may peace be upon him) says: From Umar bin al-Khattab, the Messenger of Allah (may peace be upon him) said: \"It was revealed to me ten verses: Whoever enforces this will enter heaven, and he recites these ten verses from the beginning of Surah al-Mu'minun. (History at Tirmidzi)",
      "text_tafsir": "Mereka yang memiliki tujuh sifat mulia itu akan mewarisi surga, disebabkan amal kebajikan mereka selama hidup di dunia, yaitu surga Firdaus yang paling tinggi, yang di atasnya berada 'Arsy Allah Yang Maha Pemurah, dan mereka kekal di dalamnya. Umar meriwayatkan sebuah hadis, dimana Rasulullah saw bersabda:\n\nDari Umar bin al-Khattab, Rasulullah bersabda, \"Telah diturunkan kepadaku sepuluh ayat: Barang siapa yang menegakkannya akan masuk surga, lalu ia membaca sepuluh ayat ini dari permulaan Surah al-Mu'minun. (Riwayat at-Tirmidzi)",
      "text_translation": "(yakni) yang akan mewarisi (surga) Firdaus. Mereka kekal di dalamnya.",
      "text": "الَّذِيْنَ يَرِثُوْنَ الْفِرْدَوْسَۗ هُمْ فِيْهَا خٰلِدُوْنَ ",
      "text_translation_en": "that will inherit the paradise; [and] therein shall they abide.",
      "juz_number": 18
    },
    "12": {
      "text_tafsir_en": "Indeed, We (Allah) created man from a essence (derived) from the ground. There is a group of commentators stating, that what is meant by humans here is the descendants of Adam, including all of us, who come from semen. From the results of scientific research, actually the semen comes from the ground after going through several developmental processes. Food which is a product of the earth, which is eaten by humans, and their digestive organs turn into a liquid mixed with blood which supplies living materials and vitamins needed by the human body to all parts of its members. If a human dies and is put into a tomb in the ground, his body will be destroyed and return to earth again, according to the word of God: From it (the ground) that We created you and to whom We will restore you, and from there We will eject you at another time. (thaha \/ 20: 55)",
      "text_tafsir": "Sesungguhnya Kami (Allah) telah menciptakan manusia dari suatu saripati (berasal) dari tanah. Ada segolongan ahli tafsir menyatakan, bahwa yang dimaksud dengan manusia di sini ialah keturunan Adam termasuk kita sekalian, yang berasal dari air mani. Dari hasil penelitian ilmiah, sebenarnya air mani itu pun berasal dari tanah setelah melalui beberapa proses perkembangan. Makanan yang merupakan hasil bumi, yang dimakan oleh manusia, dan alat pencernaannya berubah menjadi cairan yang bercampur dengan darah yang menyalurkan bahan-bahan hidup dan vitamin yang dibutuhkan oleh tubuh manusia ke seluruh bagian anggotanya. Jika manusia itu meninggal dunia dan dimasukkan ke dalam kubur di dalam tanah, maka badannya akan hancur lebur dan kembali menjadi tanah lagi, sesuai dengan firman Allah:\n\nDarinya (tanah) itulah Kami menciptakan kamu dan kepadanyalah Kami akan mengembalikan kamu, dan dari sanalah Kami akan mengeluarkan kamu pada waktu yang lain. (thaha\/20: 55)",
      "text_translation": "Dan sungguh, Kami telah menciptakan manusia dari saripati (berasal) dari tanah.",
      "text": "وَلَقَدْ خَلَقْنَا الْاِنْسَانَ مِنْ سُلٰلَةٍ مِّنْ طِيْنٍ ۚ",
      "text_translation_en": "NOW, INDEED, We create man out of the essence of clay,",
      "juz_number": 18
    },
    "13": {
      "text_tafsir_en": "Then We (Allah) place the essence of semen in the ribs of the husband who in copulation with his wife is poured into his womb, a storage place that is firm for the fetus until the time of his birth.",
      "text_tafsir": "Kemudian Kami (Allah) tempatkan saripati air mani itu dalam tulang rusuk sang suami yang dalam persetubuhan dengan istrinya ditumpahkan ke dalam rahimnya, suatu tempat penyimpanan yang kukuh bagi janin sampai saat kelahirannya.",
      "text_translation": "Kemudian Kami menjadikannya air mani (yang disimpan) dalam tempat yang kokoh (rahim).",
      "text": "ثُمَّ جَعَلْنٰهُ نُطْفَةً فِيْ قَرَارٍ مَّكِيْنٍ ۖ",
      "text_translation_en": "and then We cause him to remain as a drop of sperm in [the wombs] firm keeping,",
      "juz_number": 18
    },
    "14": {
      "text_tafsir_en": "Then the semen We (Allah) developed in a few weeks so that it becomes al-'alaq (which attaches to the uterine wall), from al-'alaq it becomes a lump of meat, and a lump of meat is made into bones, and there is a part that is made flesh, then The bones are wrapped in flesh, like clothes covering the body, then made into another creature (shaped), after the Spirit has blown into it, so that it becomes a perfect human being, able to speak, see, hear, think, which were only inanimate objects. Then Glory be to Allah, the Most Good Creator. According to scientists, the stages in human embryology are as follows: • Nutfah, or in Arabic the word 'nutfa', means 'a little water, or' a drop of water. This clearly describes the little water emitted by men during copulation. This little water contains sperm. Sperm or spermatozoa are found in disgusting water and in the form of long-tailed fish (this is one of the meanings of the word sulalah. In surah As-Sajdah \/ 32 verse 8, semen is referred to as \"..... He made his descendants from water quintessence underestimated ... \"Surah al-Insan \/ 76 verse 2 and as-Sajdh \/ 32 verse 8 relate to the content of semen. Modern science has found that semen consists of four different kinds of mucus produced by four different glands different, namely the testicular glands, seminal duct glands, prostate glands, and urinary glands. Sperm is formed in the testicles.The testicles themselves are formed, as proven by science, by cells under the kidneys, in parts back of the embryo, this group of cells then drops below the rib cage, just a few weeks before the baby's birth. It is estimated that the number of sperm in one ejaculation is 500 \"600 million. From this amount, only one can do fertilization. After fertilization, there is a rapid change of the ovaries. It immediately produces a membrane that prevents other sperm from fertilizing. After the egg is fertilized, and attach itself to the uterine wall and get food from the mother, it will grow fast. In the next two to three weeks, when seen with the naked eye, it will change from the formation of 'leeches or' alaqah to the formation of 'mudhgah' or 'meat that has been chewed. The latter pattern is actually formed by the bumps and grooves, which in time will become internal organs (heart, intestine) and outside (feet, hands). Surah al-Hajj \/ 22: 5 adds one note from the embryo. In this verse, mudghah are described with the addition of \"the perfect event and the imperfect event ...\" This describes what happens at the stage of 'differentiation, where many organs begin to develop at different times. Resulting in a situation between being finished in another part but not yet perfect in other parts. The last two stages mentioned in surah al-Muminun \/ 23: 14 tell about the 'formation of bones after the easy stage. In the end, the story ends by giving him \"clothes\", consisting of flesh and muscle. If we follow the growth of the embryo, then around the age of four weeks a process of 'differentiation starts. In this process the cell groups in the embryo will change shape and begin to form large organs. One that developed the first time was the skull bones. This process will be followed later by the formation of candidate muscles, ears, eyes, kidneys, heart and more. Imam Ahmad narrated a hadith from Abdullah bin Masud, that the Messenger of Allah said: \"Verily, one of you created his creature in the stomach of his mother forty days, then became 'alaqah like that, then became mudhgah (lump of flesh) like that. Then the angel was sent to him Then he blew his soul to him, and he was instructed in four sentences, his blessings, his death, his deeds, and whether he was a wretch or happy.For the sake of no other god besides Him, surely someone among you is doing the deeds of the inhabitants of heaven, so between him and heaven there is only one cubit, but he has been recorded as a dweller of hell, so he ends his deeds with the deeds of the inhabitants of hell, so he goes to hell.And surely one of you does good deeds of the inhabitants of hell, so that between him and hell only live just one cubit, but he was registered as a resident of heaven, so he ended his charity with ama lan the inhabitants of heaven, so he entered heaven. \" (Narrated by Ahmad) Anas bin Malik related that Umar bin Khattab said: My desire is in accordance with the will of Allah on four matters. First: I propose to the Messenger of Allah that behind the Maqam Ibrahim is made a place of prayer then the word of God comes down: And make the station of Abraham a place of prayer. (al-Baqarah \/ 2: 125) Second: I propose to the Messenger of Allah that his wives put up a veil (hijab) when the arrival of male guests, who are sometimes not pious all, then the word of God comes down: When you ask for something ( necessity) to them (the wives of the Prophet), then ask from behind the veil. (al-Ahzab \/ 33: 53) Third: I say to the wives of the Prophet to stop causing trouble to him, because maybe Allah will replace those with better wives, then the word of Allah comes down: If he (the Prophet) divorces you, maybe God will replace him with wives who are better than you. (at-Tahrim \/ 66: 5) Fourth: After descending verses 12, 13 and 14 of Surah al-Mu'minun, then I say fatabarakallahu aá¸ ¥ sanul Khaliqin, and the Messenger of Allah said, \"Thus it is according to what He revealed . \"",
      "text_tafsir": "Kemudian air mani itu Kami (Allah) kembangkan dalam beberapa minggu sehingga menjadi al-'alaq (yang menempel di dinding rahim), dari al-'alaq dijadikan segumpal daging, dan segumpal daging dijadikan tulang belulang, dan ada bagian yang dijadikan daging, kemudian tulang belulang itu dibungkus dengan daging, laksana pakaian penutup tubuh, kemudian dijadikan makhluk yang (berbentuk) lain, setelah ditiupkan Roh ke dalamnya, sehingga menjadi manusia yang sempurna, dapat berbicara, melihat, mendengar, berpikir yang tadinya hanya merupakan benda mati. Maka Mahasuci Allah, Pencipta Yang Paling Baik.\n\nMenurut para saintis, Tahapan-tahapan dalam embriologi manusia sebagai berikut: \n\n¢Nutfah, atau dalam bahasa Arabnya 'nutfa, mempunyai arti 'sedikit air, atau 'setetes air. Hal ini jelas mendeskripsikan air yang sedikit yang dipancarkan lelaki saat bersanggama. Air yang sedikit ini mengandung sperma. Sperma atau spermatozoa terdapat di dalam air yang menjijikan dan berbentuk ikan yang berekor panjang (ini adalah salah satu arti kata sulalah. Dalam surah As-Sajdah\/32 ayat 8, air mani disebut sebagai \"..... Dia menjadikan keturunannya dari saripati air yang diremehkan....\" Surah al-Insan\/76 ayat 2 dan as-Sajdh\/32 ayat 8 berkaitan dengan kandungan dari air mani. Ilmu pengetahuan modern menemukan bahwa air mani terdiri atas empat macam lendir yang berbeda yang dihasilkan oleh empat kelenjar yang berbeda, yaitu kelenjar biji pelir, kelenjar saluran seminal, kelenjar prostat, dan kelenjar saluran kencing. \n\n¢Sperma dibentuk di dalam buah pelir. Buah pelir sendiri dibentuk, sebagaimana dibuktikan ilmu pengetahuan, oleh sel-sel yang ada di bawah bakal ginjal, di bagian punggung embrio. Kelompok sel ini kemudian turun sampai di bawah tulang rusuk, pada saat beberapa minggu sebelum kelahiran bayi. Diperkirakan jumlah sperma dalam satu kali ejakulasi adalah 500 “ 600 juta ekor. Akan tetapi dari jumlah tersebut, hanya satu yang dapat melakukan pembuahan. Setelah terjadi pembuahan, maka terjadi perubahan cepat dari indung telur. Ia segera menghasilkan membran yang mencegah sperma lain untuk ikut membuahi.\n\n¢Setelah sel telur dibuahi, dan menempelkan diri di dinding uterus dan memperoleh makanan dari ibunya, maka ia akan tumbuh cepat. Pada waktu dua sampai tiga minggu kemudian, apabila dilihat dengan mata telanjang, ia akan berubah dari bentukan 'lintah atau 'alaqah ke bentukan 'mudhgah atau 'daging yang telah dikunyah. Pola yang terakhir ini sebetulnya dibentuk oleh adanya tonjolan dan lekukan, yang pada waktunya nanti akan menjadi organ-organ dalam (jantung, usus) dan luar (kaki, tangan). Surah al-hajj\/22: 5 menambahkan satu catatan dari embrio. Dalam ayat ini, mudghah dideskripsikan dengan tambahan \"yang sempurna kejadiannya dan yang tidak sempurna kejadiannya .....\" Ini menggambarkan hal yang terjadi pada tahap 'diferensiasi, dimana banyak organ mulai berkembang dalam waktu yang tidak bersamaan. Sehingga menimbulkan situasi antara selesai di bagian lain namun belum sempurna di bagian lainnya.\n\n¢Dua tahapan terakhir yang disebutkan pada surah al-Muminun\/23: 14 bercerita tentang 'pembentukan tulang belulang setelah tahap mudgah. Pada akhirnya, ceritera diakhiri dengan memberinya \"baju\", yang terdiri atas daging dan otot. Apabila kita mengikuti pertumbuhan embrio, maka kira-kira pada umur empat minggu suatu proses 'diferensiasi mulai berjalan. Dalam proses ini kelompok-kelompok sel pada embrio akan berubah bentuk dan mulai membentuk organ-organ berukuran besar. Salah satu yang berkembang pertama kali adalah tulang tengkorak. Proses ini akan disusul kemudian oleh pembentukan calon otot, telinga, mata, ginjal, jantung dan banyak lagi.\n\nImam Ahmad meriwayatkan sebuah hadis dari Abdullah bin Masud, bahwa Rasulullah mengatakan:\n\n\"Sesungguhnya seseorang di antara kamu dikumpulkan penciptaannya di perut ibunya empat puluh hari, kemudian menjadi 'alaqah seperti itu, kemudian menjadi mudhgah (gumpalan daging) seperti itu. Kemudian malaikat diutus kepadanya, lalu ia meniupkan ruh padanya. Dan ia diperintahkan kepada empat kalimat, rizqinya, ajalnya, amalnya, dan apakah ia seorang yang celaka atau bahagia. Demi Zat yang tidak ada tuhan selain-Nya, sesungguhnya seseorang di antara kamu beramal amalan penghuni surga, sehingga antara dia dan surga hanya tinggal satu hasta saja. Namun dia sudah tercatat sebagai penghuni neraka, maka ia mengakhiri amalnya dengan amalan penghuni neraka, sehingga ia masuk neraka. Dan sesungguhnya seseorang di antara kamu beramal amalan penghuni neraka, sehingga antara dia dengan neraka hanya tinggal satu hasta saja. Namun ia sudah tercatat sebagai penghuni surga, maka ia mengakhiri amalnya dengan amalan penghuni surga, sehingga ia masuk surga.\" (Riwayat Ahmad) \n\nAnas bin Malik meriwayatkan bahwa Umar bin Khattab berkata: Keinginanku bersesuaian dengan kehendak Allah pada empat perkara.\n\nPertama: Saya usulkan pada Rasulullah saw supaya di belakang Maqam Ibrahim dijadikan tempat salat maka turunlah firman Allah:\n\nDan jadikanlah maqam Ibrahim itu tempat salat. (al-Baqarah\/2: 125)\n\nKedua: Saya usulkan kepada Rasulullah saw supaya istri-istrinya memasang tabir (hijab) bila kedatangan tamu laki-laki, yang kadang-kadang tidak saleh semuanya, maka turunlah firman Allah:\n\nApabila kamu meminta sesuatu (keperluan) kepada mereka (istri-istri Nabi), maka mintalah dari belakang tabir. (al-Ahzab\/33: 53)\n\nKetiga: Saya berkata kepada istri-istri Nabi supaya berhenti menimbulkan kesulitan kepada beliau, karena mungkin Allah akan memberi ganti dengan istri-istri yang lebih baik, maka turunlah firman Allah:\n\nJika dia (Nabi) menceraikan kamu, boleh jadi Tuhan akan memberi ganti kepadanya dengan istri-istri yang lebih baik dari kamu. (at-Tahrim\/66: 5)\n\nKeempat: Setelah turun ayat 12, 13 dan 14 Surah al-Mu'minun, maka saya ucapkan fatabarakallahu aá¸¥sanul Khaliqin, dan Rasululah saw bersabda, \"Demikian itu sesuai dengan yang diturunkan-Nya.\"",
      "text_translation": "Kemudian, air mani itu Kami jadikan sesuatu yang melekat, lalu sesuatu yang melekat itu Kami jadikan segumpal daging, dan segumpal daging itu Kami jadikan tulang belulang, lalu tulang belulang itu Kami bungkus dengan daging. Kemudian, Kami menjadikannya makhluk yang (berbentuk) lain. Mahasuci Allah, Pencipta yang paling baik.",
      "text": "ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظٰمًا فَكَسَوْنَا الْعِظٰمَ لَحْمًا ثُمَّ اَنْشَأْنٰهُ خَلْقًا اٰخَرَۗ فَتَبَارَكَ اللّٰهُ اَحْسَنُ الْخَالِقِيْنَۗ ",
      "text_translation_en": "and then We create out of the drop of sperm a germ-cell, and then We create out of the germ-cell an embryonic lump, and then We create within the embryonic lump bones, and then We clothe the bones with flesh - and then We bring [all] this into being as a new creation: hallowed, therefore, is God, the best of artisans!",
      "juz_number": 18
    },
    "15": {
      "text_tafsir_en": "Then after your first creation, you will surely meet your destiny. Allah says: Every living thing will taste death. We will test you with the pros and cons of the trial. And you will be returned only to Us. (al-Anbiya '\/ 21: 35)",
      "text_tafsir": "Kemudian sesudah penciptaanmu yang pertama itu, kamu sekalian pasti akan menemui ajalmu yang telah ditentukan. Allah berfirman:\n\nSetiap yang bernyawa akan merasakan mati. Kami akan menguji kamu dengan keburukan dan kebaikan sebagai cobaan. Dan kamu akan dikembalikan hanya kepada Kami. (al-Anbiya'\/21: 35)",
      "text_translation": "Kemudian setelah itu, sesungguhnya kamu pasti mati.",
      "text": " ثُمَّ اِنَّكُمْ بَعْدَ ذٰلِكَ لَمَيِّتُوْنَ ۗ",
      "text_translation_en": "And then, behold! after all this, you are destined to die;",
      "juz_number": 18
    },
    "16": {
      "text_tafsir_en": "Then, indeed, you will all be raised from the grave on the Day of Judgment.",
      "text_tafsir": "Kemudian sesungguhnya kamu sekalian akan dibangkitkan dari kuburmu pada hari Kiamat, untuk dihisab segala amal perbuatanmu selama berada di dunia ini, yang baik akan diberi pahala, yang buruk akan diberi siksa.",
      "text_translation": "Kemudian, sesungguhnya kamu akan dibangkitkan (dari kuburmu) pada hari Kiamat.",
      "text": "ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ تُبْعَثُوْنَ",
      "text_translation_en": "and then, behold! you shall be raised from the dead on Resurrection Day.",
      "juz_number": 18
    },
    "17": {
      "text_tafsir_en": "This verse explains that Allah has created on top of the seven layers of heaven mankind, some above the others which are the places for the circulation of stars, which have been known by people since time immemorial, and several other stars have been discovered by astronomical scholars today. God is never unaware of all creation, both to the circulation and to others, because the circulation of all the planets in outer space follows certain rules. If God was unmindful of him, there would have been clashes between the planets with each other, which resulted in a catastrophe that could not have predicted its severity. Indeed that will happen, but the time will be on the Day of Judgment, where everything has been planned in the Lawh Mahfuz.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah menciptakan di atas manusia tujuh lapis langit, sebagian berada di atas sebagian lain yang menjadi tempat peredaran bintang-bintang, yang telah dikenal orang sejak dahulu kala, dan telah ditemukan lagi beberapa bintang lainnya oleh ulama falak pada masa kini. Allah sekali-kali tidaklah lengah terhadap semua ciptaan itu, baik terhadap peredaran-peredaran maupun terhadap yang lainnya, karena peredaran semua planet di angkasa luar itu mengikuti peraturan tertentu. Seandainya Allah lengah terhadapnya, niscaya akan terjadi benturan-benturan planet itu satu sama lain, yang mengakibatkan timbulnya bencana yang tidak dapat diperkirakan kedahsyatannya. Memang itu pun akan terjadi, akan tetapi waktunya nanti pada hari Kiamat, di mana segala sesuatunya telah direncanakan di Lauh Mahfuz.",
      "text_translation": "Dan sungguh, Kami telah menciptakan tujuh (lapis) langit di atas kamu, dan Kami tidaklah lengah terhadap ciptaan (Kami).",
      "text": "وَلَقَدْ خَلَقْنَا فَوْقَكُمْ سَبْعَ طَرَاۤىِٕقَۖ وَمَا كُنَّا عَنِ الْخَلْقِ غٰفِلِيْنَ",
      "text_translation_en": "And, indeed, We have created above you seven [celestial] orbits: and never are We unmindful of [any aspect of Our] creation.",
      "juz_number": 18
    },
    "18": {
      "text_tafsir_en": "Then Allah sent down from the sky the rainwater to the required level, not too dense so that it caused floods and not too little so that it was enough to irrigate the gardens that needed it. There are also lands that require a lot of water, but cannot bear receiving heavy rain, so the water needed is imported from other countries through large rivers such as the Nile in Egypt which source in the middle of the African continent. In addition to carrying water that is needed, it also carries mud which is very useful for increasing fertility. Water can be stored either as rivers, lakes and even partially stored in the earth as shallow ground water or deep ground water or often referred to as groundwater. Some of the water was made by God to settle in the earth to fill wells and gullies that function in the field of irrigation, and because the water in the earth is also in contact with layers of metals and other chemicals, the water contains chemical elements that are increase soil fertility, and when passing on the slopes of volcanoes can also be sources of hot water containing sulfur, and can be used as a hot spring which is very useful for curing skin diseases and so on. All sources of water use, if used with gratitude to the presence of God, will surely be enjoyed, but if humans are greedy and damage it, then surely Allah has the power to eliminate it, especially if these places are used for immoral acts.",
      "text_tafsir": "Lalu Allah menurunkan dari langit air hujan dengan kadar yang diperlukan, tidak terlalu lebat sehingga menimbulkan bencana banjir dan tidak terlalu sedikit sehingga cukup untuk mengairi kebun-kebun yang memerlukannya. Ada pula tanah-tanah yang memerlukan banyak air, akan tetapi tidak tahan menerima hujan yang lebat, maka air yang diperlukan itu didatangkan dari negeri lain melalui sungai-sungai yang besar seperti sungai Nil di Mesir yang bersumber di tengah-tengah benua Afrika. Di samping membawa air yang diperlukan, juga membawa lumpur yang sangat bermanfaat untuk menambah kesuburan. Air dapat tersimpan baik sebagai sungai-sungai, danau-danau dan bahkan sebagian tersimpan dalam bumi sebagai air tanah dangkal maupun air tanah dalam atau sering disebut sebagai groundwater. \n\nSebagian dari air itu dijadikan Allah menetap dalam bumi untuk mengisi sumur-sumur dan parit-parit yang berfungsi dalam bidang irigasi, dan karena air dalam bumi itu bersentuhan pula dengan lapisan-lapisan logam dan zat kimia lainnya, air itu mengandung unsur-unsur kimiawi yang menambah kesuburan tanah, dan bila lewat di lereng gunung-gunung berapi dapat pula menjadi sumber-sumber air panas yang mengandung belerang, dan dapat dijadikan tempat pemandian air panas yang sangat berguna untuk menyembuhkan penyakit kulit dan sebagainya. \n\nSemua sumber penggunaan air itu, jika dimanfaatkan dengan rasa syukur kehadirat Allah, niscaya akan dapat dinikmati, akan tetapi jika manusia serakah dan merusaknya, maka sesungguhnya Allah berkuasa pula untuk menghilangkannya, terutama bila tempat-tempat itu dipakai untuk perbuatan maksiat.",
      "text_translation": "Dan Kami turunkan air dari langit dengan suatu ukuran; lalu Kami jadikan air itu menetap di bumi, dan pasti Kami berkuasa melenyapkannya. ",
      "text": "وَاَنْزَلْنَا مِنَ السَّمَاۤءِ مَاۤءًۢ بِقَدَرٍ فَاَسْكَنّٰهُ فِى الْاَرْضِۖ وَاِنَّا عَلٰى ذَهَابٍۢ بِهٖ لَقٰدِرُوْنَ ۚ",
      "text_translation_en": "And We send down water from the skies in accordance with a measure [set by Us], and then We cause it to lodge in the earth: but, behold, We are most certainly able to withdraw this [blessing]!",
      "juz_number": 18
    },
    "19": {
      "text_tafsir_en": "Then with the cause of the rain God grows for humans the gardens of dates and grapes and other colorful fruits that can be eaten. There are also those plants which are a source of livelihood, such as the results of pepper, nutmeg, clove and so on. Also made for humans a kind of wood tree that comes out of Mount Sinai which is a lot of olive trees that grow around the mountain, which produces a lot of oil and is often used for delicacies and lately it can also be used as cosmetic ingredients and medicines because of oil Olive does not contain cholesterol which is harmful to the body.",
      "text_tafsir": "Lalu dengan sebab air hujan itu Allah menumbuhkan untuk manusia kebun-kebun kurma dan anggur dan buah-buahan lain yang beraneka warna yang dapat di makan. Ada pula dari tanam-tanaman itu yang menjadi sumber penghidupan, seperti dari hasil pohon lada, pala, cengkeh dan sebagainya.\n\nDijadikan pula untuk manusia sejenis pohon kayu yang keluar dari gunung Sinai yaitu pohon zaitun yang banyak tumbuh di sekitar gunung itu, yang banyak menghasilkan minyak dan sering digunakan untuk melezatkan hidangan dan pada akhir-akhir ini dapat pula dijadikan bahan kosmetik dan obat-obatan karena minyak zaitun tidak mengandung kolesterol yang berbahaya bagi tubuh.",
      "text_translation": "Lalu dengan (air) itu, Kami tumbuhkan untukmu kebun-kebun kurma dan anggur; di sana kamu memperoleh buah-buahan yang banyak dan sebagian dari (buah-buahan) itu kamu makan, ",
      "text": "فَاَنْشَأْنَا لَكُمْ بِهٖ جَنّٰتٍ مِّنْ نَّخِيْلٍ وَّاَعْنَابٍۘ لَكُمْ فِيْهَا فَوَاكِهُ كَثِيْرَةٌ وَّمِنْهَا تَأْكُلُوْنَ ۙ",
      "text_translation_en": "And by means of this [water] We bring forth for you gardens of date-palms and vines, wherein you have fruit abundant and whereof you eat,",
      "juz_number": 18
    },
    "20": {
      "text_tafsir_en": "Then with the cause of the rain God grows for humans the gardens of dates and grapes and other colorful fruits that can be eaten. There are also those plants which are a source of livelihood, such as the results of pepper, nutmeg, clove and so on. Also made for humans a kind of wood tree that comes out of Mount Sinai which is a lot of olive trees that grow around the mountain, which produces a lot of oil and is often used for delicacies and lately it can also be used as cosmetic ingredients and medicines because of oil Olive does not contain cholesterol which is harmful to the body.",
      "text_tafsir": "Lalu dengan sebab air hujan itu Allah menumbuhkan untuk manusia kebun-kebun kurma dan anggur dan buah-buahan lain yang beraneka warna yang dapat di makan. Ada pula dari tanam-tanaman itu yang menjadi sumber penghidupan, seperti dari hasil pohon lada, pala, cengkeh dan sebagainya.\n\nDijadikan pula untuk manusia sejenis pohon kayu yang keluar dari gunung Sinai yaitu pohon zaitun yang banyak tumbuh di sekitar gunung itu, yang banyak menghasilkan minyak dan sering digunakan untuk melezatkan hidangan dan pada akhir-akhir ini dapat pula dijadikan bahan kosmetik dan obat-obatan karena minyak zaitun tidak mengandung kolesterol yang berbahaya bagi tubuh.",
      "text_translation": "dan (Kami tumbuhkan) pohon (zaitun) yang tumbuh dari gunung Sinai, yang menghasilkan minyak, dan bahan pembangkit selera bagi orang-orang yang makan. ",
      "text": "وَشَجَرَةً تَخْرُجُ مِنْ طُوْرِ سَيْنَاۤءَ تَنْۢبُتُ بِالدُّهْنِ وَصِبْغٍ لِّلْاٰكِلِيْنَ ",
      "text_translation_en": "as well as a tree that issues from [the lands adjoining] Mount Sinai, yielding oil and relish for all to eat.",
      "juz_number": 18
    },
    "21": {
      "text_tafsir_en": "Indeed, in the creation of livestock there really is a very important lesson for humans in addition to the great benefits as a favor from God. Farm animals can be a source of learning and research material, for example how cows whose main food, after being chewed and entered their stomachs, extracts and then mixed with blood can produce milk which is very beneficial for the body. From his stomach then, God has the power to separate the milk from the mixing of the two dirty things, namely the blood and cow dung in the stomach, as stated in the Word of God: And truly, in cattle there is really a lesson for you. We give you drink from what is in his stomach (in the form of) pure milk between manure and blood, which is easily swallowed by those who drink it (an-Nahl \/ 16: 66) Then Allah describes in another verse the happiness felt by the owner of the cow when releasing the cow- the cow to the meadow in the morning. The same happiness was felt when the animals returned to their stable in the afternoon. The Word of God: And you gain beauty in it, when you bring it back to the stable and when you release it (to the shepherding place). (an-Nahl \/ 16: 6) If detailed, there are many benefits obtained by humans from livestock: 1. Milk is very delicious to drink and contains various elements that the body needs to stay healthy, can also be used as butter, cheese, and others. 2. Fur or hair can be used as clothing and blankets which are very useful especially in winter. 3. The meat can be eaten immediately or preserved in cans. 4. It is made into a vehicle, especially to go to faraway places that are difficult to reach with other vehicles as mentioned in paragraph 21. And he transports your burdens to a country that you are unable to reach, except with difficulty. (an-Nahl \/ 16: 7)",
      "text_tafsir": "Sesungguhnya pada penciptaan binatang ternak itu benar-benar terdapat pelajaran yang sangat penting bagi manusia di samping manfaatnya yang besar sebagai nikmat pemberian Allah. Binatang ternak bisa menjadi sumber pembelajaran dan bahan riset, misalnya bagaimana sapi yang makanan utamanya, setelah dikunyah dan masuk dalam perutnya, saripatinya kemudian bercampur dengan darah bisa menghasilkan susu yang sangat bermanfaat bagi tubuh. Dari perutnya kemudian, Allah berkuasa untuk me-misahkan air susu dari percampuran dua benda yang kotor itu, yaitu darah dan kotoran sapi yang ada diperutnya, sebagaimana tersebut dalam firman Allah:\n\nDan sungguh, pada hewan ternak itu benar-benar terdapat pelajaran bagi kamu. Kami memberimu minum dari apa yang ada dalam perutnya (berupa) susu murni antara kotoran dan darah, yang mudah ditelan bagi orang yang meminumnya (an-Nahl\/16: 66)\n\nKemudian Allah menggambarkan dalam ayat lain kebahagiaan yang dirasakan pemilik sapi ketika melepaskan sapi-sapinya ke padang rumput di pagi hari. Kebahagiaan yang sama juga dirasakannya ketika ternak-ternak itu kembali ke kandangnya pada sore hari. Firman Allah:\n\nDan kamu memperoleh keindahan padanya, ketika kamu membawanya kembali ke kandang dan ketika kamu melepaskannya (ke tempat penggembalaan). (an-Nahl\/16: 6)\n\nJika diperinci, terdapat banyak manfaat yang diperoleh manusia dari binatang ternak itu:\n\n1. Air susu yang sangat lezat untuk diminum dan mengandung berbagai unsur yang dibutuhkan tubuh agar tetap sehat, juga dapat dijadikan mentega, keju, dan lain-lain.\n\n2. Bulu atau rambutnya dapat dijadikan bahan pakaian dan selimut yang sangat berguna terutama di musim dingin.\n\n3. Dagingnya dapat dimakan segera atau diawetkan dalam kaleng.\n\n4. Dijadikan kendaraan, terutama untuk pergi ke tempat yang jauh yang sulit dicapai dengan kendaraan lain seperti tersebut dalam ayat 21.\n\nDan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. (an-Nahl\/16: 7)",
      "text_translation": "Dan sesungguhnya pada hewan-hewan ternak terdapat suatu pelajaran bagimu. Kami memberi minum kamu dari (air susu) yang ada dalam perutnya, dan padanya juga terdapat banyak manfaat untukmu, dan sebagian darinya kamu makan,",
      "text": "وَاِنَّ لَكُمْ فِى الْاَنْعَامِ لَعِبْرَةًۗ  نُسْقِيْكُمْ مِّمَّا فِيْ بُطُوْنِهَا وَلَكُمْ فِيْهَا مَنَافِعُ كَثِيْرَةٌ وَّمِنْهَا تَأْكُلُوْنَ ۙ ",
      "text_translation_en": "And, behold, in the cattle [too] there is indeed a lesson for you: We give you to drink of that [milk] which is within their bellies; and you derive many [other] uses from them: for, you eat of their flesh,",
      "juz_number": 18
    },
    "22": {
      "text_tafsir_en": "On the backs of livestock, especially camels, can be used as a means to transport humans or goods to a place very far through the desert that is difficult for other vehicles to pass, in addition to being able to use ships as vehicles in the sea. And (He has created) horses, mules, and donkeys, for you to ride and (become) jewels. God created what you don't know. (an-Nahl \/ 16: 8)",
      "text_tafsir": "Di atas punggung binatang ternak itu, terutama unta, dapat dijadikan sarana untuk mengangkut manusia atau barang ke tempat yang sangat jauh melalui padang pasir yang sulit untuk dilalui oleh kendaraan lain, di samping dapat mempergunakan kapal-kapal sebagai kendaraan di laut.\n\nDan (Dia telah menciptakan) kuda, bagal, dan keledai, untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui. (an-Nahl\/16: 8)",
      "text_translation": "di atasnya (hewan-hewan ternak) dan di atas kapal-kapal kamu diangkut.",
      "text": "وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُوْنَ ࣖ",
      "text_translation_en": "and by them - as by the ships [over the sea] - you are borne [overland].",
      "juz_number": 18
    },
    "23": {
      "text_tafsir_en": "This verse explains that God sent Noah to his people to warn them of the torment of Allah, when they despised him and rejected His Messenger, and gently said to them, \"O my people, worship the One True God, Do not fear Him, for there is no God but you.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah mengutus Nuh kepada kaumnya untuk memberi peringatan kepada mereka tentang azab Allah, bila mereka membuat kemusyrikan kepada-Nya dan mendustakan Rasul-Nya, seraya berkata dengan lemah lembut kepada mereka, \"Hai kaumku, sembahlah olehmu Allah Yang Esa, jangan sekali-kali mempersekutukan-Nya, karena tidak ada Tuhan bagimu selain Dia. Maka mengapa kamu tidak merasa takut akan azab-Nya, dan menjauhkan diri dari menyekutukan-Nya?\"",
      "text_translation": "Dan sungguh, Kami telah mengutus Nuh kepada kaumnya, lalu dia berkata, “Wahai kaumku! Sembahlah Allah, (karena) tidak ada tuhan (yang berhak disembah) bagimu selain Dia. Maka mengapa kamu tidak bertakwa (kepada-Nya)?”",
      "text": "وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗۗ اَفَلَا تَتَّقُوْنَ ",
      "text_translation_en": "AND, INDEED, We sent forth Noah unto his people and he said: “O my people! Worship God alone]: you have no deity other than Him. Will you not, then, become conscious of Him?”",
      "juz_number": 18
    },
    "24": {
      "text_tafsir_en": "This gentle call of Noah was answered by the ridicule of his people, that Noah was nothing more than an ordinary man like them, that he had no advantage, either physically or mentally so that he deserved to be the messenger of God and receive revelation. Noah is accused of just wanting to be the one who is above them, and wanting more power. In order to achieve that goal, he claimed to be the messenger of God, but in fact he was unworthy. Then they mentioned two things that were the reason for not recognizing Noah as God's messenger. First, if God had sent an apostle who commanded worship only to God, He would have sent some angels, and not an ordinary man. Second, they had never heard from their own ancestors what Noah had said, about worshiping only God, the One God. The call to the atheist was not in the tradition of their ancestors, so they strongly opposed the preaching of Noah. This shows that they have been dragged into blind and misguided takers.",
      "text_tafsir": "Seruan Nabi Nuh yang lemah lembut ini dijawab dengan cemoohan kaumnya, bahwa Nuh tidak lain hanya seorang manusia biasa seperti mereka, tidak mempunyai kelebihan apa-apa, baik fisik maupun mental sehingga ia pantas untuk menjadi utusan Allah dan menerima wahyu. Nuh dituduh hanya ingin menjadi orang yang kedudukannya lebih dari mereka, dan ingin lebih berkuasa. Untuk mencapai tujuannya itu, ia mengaku menjadi utusan Allah, padahal sebenarnya ia tidak pantas. Lalu mereka menyebutkan dua hal yang menjadi alasan untuk tidak mengakui Nuh sebagai utusan Allah.\n\nPertama, seandainya Allah menghendaki mengutus seorang rasul yang memerintahkan beribadah hanya kepada Allah saja, tentu Dia mengutus beberapa malaikat, dan bukan mengutus seorang manusia biasa.\n\nKedua, mereka belum pernah mendengar dari nenek moyang mereka sendiri apa yang dikemukakan oleh Nuh, tentang penyembahan hanya kepada Allah, Tuhan Yang Esa. Seruan kepada ketauhidan itu tidak ada dalam tradisi nenek moyang mereka, maka mereka menentang keras dakwah Nabi Nuh. Hal demikian menunjukkan bahwa mereka telah terseret dalam taklid buta dan kesesatan.",
      "text_translation": "Maka berkatalah para pemuka orang kafir dari kaumnya, “Orang ini tidak lain hanyalah manusia seperti kamu, yang ingin menjadi orang yang lebih mulia daripada kamu. Dan seandainya Allah menghendaki, tentu Dia mengutus malaikat. Belum pernah kami mendengar (seruan yang seperti) ini pada (masa) nenek moyang kami dahulu.",
      "text": "فَقَالَ الْمَلَؤُا الَّذِيْنَ كَفَرُوْا مِنْ قَوْمِهٖ مَا هٰذَآ اِلَّا بَشَرٌ مِّثْلُكُمْۙ يُرِيْدُ اَنْ يَّتَفَضَّلَ عَلَيْكُمْۗ وَلَوْ شَاۤءَ اللّٰهُ لَاَنْزَلَ مَلٰۤىِٕكَةً  ۖمَّا سَمِعْنَا بِهٰذَا فِيْٓ اٰبَاۤىِٕنَا الْاَوَّلِيْنَ ۚ",
      "text_translation_en": "But the great ones among his people, who refused to acknowledge the truth, replied: “This [man] is nothing but a mortal like yourselves who wants to make himself superior to you! For, if God had willed [to convey a message unto us], He would surely have sent down angels; [moreover,] we have never heard [any­thing like] this from our forebears of old!",
      "juz_number": 18
    },
    "25": {
      "text_tafsir_en": "This verse describes the attitude of the unbelievers from their view of underestimating Noah as an apostle. They say that Noah was nothing more than a man who tended to speak, and what he said was unreasonable, so it was unnecessary. Therefore, they asked his people to wait until Noah came to his senses and returned to his normal state and re-embraced the religion of their ancestors. Their words indicate that they did not know that Noah was the wisest of them. Recalling the words of the people of Noah, who rejected his position as an apostle, it could be said that every apostle should have the advantage of his people in terms of morals and miracles. An apostle should be higher in rank and thus all his instructions will be followed. In addition, an apostle must be responsible, in order that he may lead his people to the right path, and that the apostle is the protector of all sins, including vanity. They say that the call to the invention has never been received from their ancestors. But their words are not enough to justify rejecting Noah's treatise. Their accusations that Noah suffered from memory disorders, contrary to the reality they saw and experienced themselves.",
      "text_tafsir": "Ayat ini menerangkan sikap orang-orang kafir akibat pandangan mereka yang meremehkan posisi Nuh sebagai rasul. Mereka mengatakan bahwa Nuh tidak lain hanyalah seorang laki-laki yang miring otaknya, yang berbicara seenaknya, dan apa yang diucapkannya tidak beralasan sama sekali, sehingga tidak perlu dilayani. Oleh karena itu, mereka meminta kepada kaumnya untuk sabar sampai Nuh pada suatu waktu sadar dan kembali ke keadaannya yang normal dan kembali memeluk agama nenek moyang mereka. Ucapan mereka itu menunjukkan keingkarannya, padahal mereka mengetahui, bahwa Nuh orang yang paling cerdas pikirannya di antara mereka. \n\nMenyimak perkataan kaum Nabi Nuh, yang menolak kedudukannya sebagai rasul, bisa dikatakan bahwa setiap rasul seharusnya memiliki kelebihan dari umatnya dari segi akhlak dan mukjizat. Seorang rasul kedudukannya harus lebih tinggi karena dengan demikian semua petunjuknya akan diikuti. Di samping itu seorang rasul harus berwibawa, supaya dengan wibawanya ia dapat memimpin umatnya ke jalan yang benar, dan rasul itu maksum, yakni terpelihara dari segala dosa termasuk kesombongan. Ucapan mereka bahwa seruan kepada ketauhidan itu belum pernah mereka terima dari nenek moyang mereka dahulu. Padahal ucapan mereka itu tidak cukup untuk dijadikan alasan menolak risalah Nuh. Tuduhan mereka bahwa Nabi Nuh menderita sakit ingatan, bertentangan dengan kenyataan yang mereka lihat dan alami sendiri.",
      "text_translation": "Dia hanyalah seorang laki-laki yang gila, maka tunggulah (sabarlah) terhadapnya sampai waktu yang ditentukan.”",
      "text": "اِنْ هُوَ اِلَّا رَجُلٌۢ بِهٖ جِنَّةٌ فَتَرَبَّصُوْا بِهٖ حَتّٰى حِيْنٍ",
      "text_translation_en": "He is nothing but a madman: so bear with him for a while.”",
      "juz_number": 18
    },
    "26": {
      "text_tafsir_en": "After Noah saw the disobedience of his people who would not be aware of their misdeeds, but when Noah had done enough to fulfill his mission, God revealed to him that his people would never believe. His followers are believers who will never increase in number. Noah prayed to God for help, and prayed, \"My Lord, help me, for they have rejected me.\" The prayer of Noah is mentioned in the word of God: Then he (Noah) complained to his Lord, \"Verily I have been overcome, then help (me).\" (al-Qamar \/ 54: 10) And as he says: And Noah said, \"My Lord, do not let any of the heathen dwell on the earth.\" (Noah \/ 71: 26)",
      "text_tafsir": "Setelah Nuh melihat keingkaran kaumnya yang tidak mau menyadari kesesatan mereka, padahal Nuh cukup lama melaksanakan kewajiban dakwahnya, maka Allah mewahyukan kepadanya bahwa kaumnya tidak akan pernah beriman. Pengikutnya yaitu orang-orang yang sudah beriman tidak akan bertambah lagi jumlahnya. Nuh kemudian berdoa kepada Tuhan supaya diberi pertolongan, seraya berdoa, \"Ya Tuhanku, tolonglah aku, karena mereka mendustakan aku.\" Doa Nuh itu disebutkan dalam firman Allah:\n\nMaka dia (Nuh) mengadu kepada Tuhannya, \"Sesungguhnya aku telah dikalahkan, maka tolonglah (aku).\" (al-Qamar\/54: 10)\n\nDan seperti dalam firman-Nya:\n\nDan Nuh berkata, \"Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi. (Nuh\/71: 26)",
      "text_translation": "Dia (Nuh) berdoa, “Ya Tuhanku, tolonglah aku karena mereka mendustakan aku.”",
      "text": "قَالَ رَبِّ انْصُرْنِيْ بِمَا كَذَّبُوْنِ ",
      "text_translation_en": "Said [Noah]: “O my Sustainer! Succour me against their accusation of lying!”",
      "juz_number": 18
    },
    "27": {
      "text_tafsir_en": "After Noah's prayer was approved, God revealed to him that he would begin to build the ark under the supervision and guidance of his revelation, so that it was strong and not easily damaged and that Noah might know his technique, for the building of a great and mighty boat of course requires expertise. When the command of God had come to destroy his people with a great typhoon, and the signs had been seen, that the basins of the bakery had begun to pour forth water, then God had Noah enter into the ark a pair of male and female every kind of animal. In the boat it is made in stages. The lowest level for wildlife such as lions, tigers, and so on. On the second level of livestock such as: cow, goat, and so on. On the third level are all pairs of birds and the highest level of Noah and his surviving family, including three of his sons: Sam, Ham and Japhis. As for his son Kanan, he was drowned, because he did not want to go with his father. With the inclusion of every type of animal available at that time, Noah's boat was a complete zoo. All the animals that did not get into the ark and the disbelievers who did not obey Noah's command were drowned in the great storm, according to God's threat that they would be punished. God forbade Noah from telling the plan of God and the purpose of building the boat to the wicked, for they would all be drowned.",
      "text_tafsir": "Setelah doa Nuh diperkenankan, maka Allah mewahyukan kepada-nya, agar ia mulai membuat perahu di bawah pengawasan dan petunjuk wahyu-Nya, supaya perahu itu kokoh dan tidak mudah mengalami kerusakan dan supaya Nuh mengetahui teknik pembuatannya, sebab pembuatan sebuah perahu yang besar dan kukuh tentu saja memerlukan keahlian. Apabila perintah Allah sudah datang untuk membinasakan kaumnya dengan topan yang besar, dan tanda-tandanya sudah tampak, yaitu tannur tempat membakar roti di bawah tanah sudah mulai memancarkan air, maka Allah menyuruh Nabi Nuh memasukkan ke dalam perahu itu sepasang jantan dan betina dari tiap-tiap jenis binatang. Dalam perahu dibuat bertingkat-tingkat. Tingkat yang paling bawah untuk binatang buas seperti singa, harimau, dan sebagainya. Di tingkat kedua binatang ternak seperti: sapi, kambing, dan sebagainya. Di tingkat ketiga semua jenis burung sepasang-pasang dan di tingkat yang paling atas sekali Nabi Nuh dengan sekalian keluarganya yang selamat, di antaranya tiga orang putranya: Sam, Ham dan Yafis. Adapun putra beliau yang bernama Kanan termasuk orang yang tenggelam, karena ia tidak mau ikut bersama ayahnya.\n\nDengan dimasukkannya setiap jenis binatang yang ada pada waktu itu, maka perahu Nuh merupakan kebun binatang yang lengkap. Semua binatang yang tidak masuk ke dalam perahu dan orang kafir yang tidak mengikuti ajakan Nabi Nuh ditenggelamkan dalam topan besar itu, sesuai dengan ancaman Allah bahwa mereka akan ditimpa azab. Allah sebelumnya melarang Nuh supaya jangan memberitahukan rencana Allah dan maksud pembuatan perahu kepada orang-orang yang zalim itu, karena mereka semuanya akan ditenggelamkan.",
      "text_translation": "Lalu Kami wahyukan kepadanya, “Buatlah kapal di bawah pengawasan dan petunjuk Kami, maka apabila perintah Kami datang dan tanur (dapur) telah memancarkan air, maka masukkanlah ke dalam (kapal) itu sepasang-sepasang dari setiap jenis, juga keluargamu, kecuali orang yang lebih dahulu ditetapkan (akan ditimpa siksaan) di antara mereka. Dan janganlah engkau bicarakan dengan-Ku tentang orang-orang yang zalim, sesungguhnya mereka itu akan ditenggelamkan.",
      "text": "فَاَوْحَيْنَآ اِلَيْهِ اَنِ اصْنَعِ الْفُلْكَ بِاَعْيُنِنَا وَوَحْيِنَا فَاِذَا جَاۤءَ اَمْرُنَا وَفَارَ التَّنُّوْرُۙ فَاسْلُكْ فِيْهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَاَهْلَكَ اِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ مِنْهُمْۚ وَلَا تُخَاطِبْنِيْ فِى الَّذِيْنَ ظَلَمُوْاۚ اِنَّهُمْ مُّغْرَقُوْنَ",
      "text_translation_en": "Thereupon We inspired him thus: “Build, un­der Our eyes and according to Our inspiration, the ark [that shall save thee and those who follow thee]. And when Our judgment comes to pass, and waters gush forth in torrents over the face of the earth, place on board of this [ark] one pair of each [kind of animal] of either sex, as well as thy family - excepting those on whom sentence has already been passed; and do not appeal to Me [any more] in behalf of those who are bent on evildoing - for, behold, they are destined to be drowned!",
      "juz_number": 18
    },
    "28": {
      "text_tafsir_en": "God told Noah that if he was with the believers on the boat, then he should thank God for the gratitude of their safety all who were in the ark, \"All praise to God who has saved us from the the wrongdoers. \" This verse tells us that we should not be happy with the downfall of torment to other people or groups, except when it contains salvation for the believers, avoiding them from the danger of destruction, and purifying the world of all forms of idolatry and apostasy. According to Ibn 'Abbas ra's evidence that in the ark of Noah there were 80 human beings, including Noah and his three sons and his wives and 72 faithful believers to Noah.",
      "text_tafsir": "Allah memerintahkan kepada Nuh, jika ia bersama orang-orang yang beriman telah berada di atas perahu, maka ia harus mengucapkan pujian kepada Allah sebagai rasa syukur atas keselamatan mereka semuanya yang berada dalam perahu itu, \"Segala puji bagi Allah yang telah menyelamatkan kami dari orang-orang yang zalim.\" Ayat ini memberi petunjuk bahwa kita tidak boleh merasa gembira dengan turunnya azab kepada orang atau golongan lain, kecuali bila di dalamnya mengandung keselamatan bagi kaum mukminin, terhindarnya mereka dari bahaya kemusnahan, dan tersapu bersihnya dunia dari segala bentuk kemusyrikan dan kemaksiatan.\n\nMenurut keterangan Ibnu 'Abbas ra bahwa yang berada dalam perahu Nuh itu selain semua jenis binatang itu ada 80 orang manusia, yaitu Nuh beserta tiga orang putranya beserta istri-istrinya dan 72 orang mukmin umat Nuh yang setia kepadanya.",
      "text_translation": "Dan apabila engkau dan orang-orang yang bersamamu telah berada di atas kapal, maka ucapkanlah, “Segala puji bagi Allah yang telah menyelamatkan kami dari orang-orang yang zalim.”",
      "text": "فَاِذَا اسْتَوَيْتَ اَنْتَ وَمَنْ مَّعَكَ عَلَى الْفُلْكِ فَقُلِ الْحَمْدُ لِلّٰهِ الَّذِيْ نَجّٰىنَا مِنَ الْقَوْمِ الظّٰلِمِيْنَ",
      "text_translation_en": "“And as soon as thou and those who are with thee are settled in the ark, say: ‘All praise is due to God, who has saved us from those evildoing folk!’",
      "juz_number": 18
    },
    "29": {
      "text_tafsir_en": "Noah was also asked to pray, \"My Lord, bring me down, when the storm is over, to a blessed place, and only You can give us the best place, knowing the places that are right for us.\" The Qatadah says that God taught us to read this prayer on board the ship: And he said, \"Get you all into it (the name of Allah) at the time of sailing and sailing.\" (Hud \/ 11: 41) on the vehicle read: The Holy One (Allah) has subdued all this for us when we were unable to overcome it, and indeed we will return to our Lord. \" (az-Zukhruf \/ 43: 13-14)",
      "text_tafsir": "Nuh disuruh berdoa pula, \"Ya Tuhanku, turunkanlah aku, bila topan sudah berakhir, pada tempat yang diberkati dan hanya Engkaulah yang dapat memberi tempat yang sebaik-baiknya, yang mengetahui tempat-tempat yang cocok lagi selaras bagi kami.\" Qatadah berkata, Allah mengajarkan kepada kita supaya membaca doa ini ketika naik kapal:\n\nDan dia berkata, \"Naiklah kamu semua ke dalamnya (kapal) dengan (menyebut) nama Allah pada waktu berlayar dan berlabuhnya. (Hud\/11: 41)\n\nDan ketika berada di atas kendaraan membaca:\n\nMahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami.\" (az-Zukhruf\/43: 13-14)",
      "text_translation": "Dan berdoalah, “Ya Tuhanku, tempatkanlah aku pada tempat yang diberkahi, dan Engkau adalah sebaik-baik pemberi tempat.”",
      "text": "وَقُلْ رَّبِّ اَنْزِلْنِيْ مُنْزَلًا مُّبٰرَكًا وَّاَنْتَ خَيْرُ الْمُنْزِلِيْنَ",
      "text_translation_en": "“And say: ‘O my Sustainer! Cause me to reach a destination blessed [by Thee] for Thou art the best to show man how to reach his [true] destination!’”",
      "juz_number": 18
    },
    "30": {
      "text_tafsir_en": "Indeed, in the event of a great hurricane that destroyed the people of Noah who rejected His Messenger, by disobeying Allah and worshiping idols, there was a lesson for the Quraysh people who rejected Muhammad's message, that the events that happened to the people of Noah could also befall the brave Quraysh denying the Messenger of Allah and opposing him. In that event there were some great punishments for the people of Noah, so that those who came later would learn from him, according to the word of God: And indeed, We have made the ark a sign. Then is anyone willing to take a lesson? (al-Qamar \/ 54: 15)",
      "text_tafsir": "Sesungguhnya dalam peristiwa topan besar yang membinasakan kaum Nuh yang mendustakan Rasul-Nya, dengan mengingkari keesaan Allah dan menyembah berhala-berhala, terdapat pelajaran bagi kaum Quraisy yang mendustakan kerasulan Muhammad saw, bahwa peristiwa yang menimpa kaum Nuh itu dapat pula menimpa kaum Quraisy yang berani mendustakan Rasulullah dan memusuhinya. Pada kejadian itu benar-benar terdapat beberapa azab yang sangat besar kepada kaum Nuh itu, supaya orang-orang yang datang kemudian mengambil pelajaran daripadanya, sesuai dengan firman Allah:\n\nDan sungguh, kapal itu telah Kami jadikan sebagai tanda (pelajaran). Maka adakah orang yang mau mengambil pelajaran? (al-Qamar\/54: 15)",
      "text_translation": "Sungguh, pada (kejadian) itu benar-benar terdapat tanda-tanda (kebesaran Allah); dan sesungguhnya Kami benar-benar menimpakan siksaan (kepada kaum Nuh itu).",
      "text": "اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ وَّاِنْ كُنَّا لَمُبْتَلِيْنَ",
      "text_translation_en": "In this [story], behold, there are messages indeed [for those who think]: for, verily, We always put [man] to a test.",
      "juz_number": 18
    },
    "31": {
      "text_tafsir_en": "This verse explains that God created other people after the people of Noah, namely the 'Ad' people of Hud, his relatives of the Prophet Saleh, and the Mighty people who were the Prophet Shuaib. Of these three tribes the strongest opinions are in line with this verse of the 'Ad because in the prophetic history after Noah was later sent to be Hud. So, what is meant by qarnan akharin is' Ad, samud and Mjan.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menciptakan umat yang lain setelah kaum Nuh, yaitu Kaum 'Ad kaumnya Nabi Hud, kaum samud kaumnya Nabi Saleh, dan kaum Madyan yaitu kaumnya Nabi Syuaib. Dari tiga kaum ini pendapat yang paling kuat yang sesuai dengan ayat ini kaum 'Ad karena dalam sejarah kenabian setelah Nabi Nuh yang diutus kemudian adalah Nabi Hud. Jadi, yang dimaksud dengan qarnan akharin adalah kaum 'Ad, samud dan Madyan.",
      "text_translation": "Kemudian setelah mereka, Kami ciptakan umat yang lain (kaum ‘Ad).",
      "text": "ثُمَّ اَنْشَأْنَا مِنْۢ بَعْدِهِمْ قَرْنًا اٰخَرِيْنَ ۚ",
      "text_translation_en": "AND AFTER those [people of old] We gave rise to new generations;",
      "juz_number": 18
    },
    "32": {
      "text_tafsir_en": "This verse explains that Allah sent the 'Ad people a messenger from among themselves, the prophet Hud who carried out their preaching and shouted, \"O my people, worship Allah and leave all your idols, for there is no God He is worthy of true worship except Him. Why do you not fear Him? \"",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah mengutus kepada kaum 'Ad itu seorang rasul dari kalangan mereka sendiri, yaitu Nabi Hud yang melaksanakan dakwah kepada mereka seraya menyerukan, \"Hai kaumku, sembahlah Allah dan tinggalkanlah semua berhala-berhalamu, karena sekali-kali tidak ada Tuhan yang berhak disembah dengan sebenarnya melainkan Dia. Mengapa kamu tidak bertakwa kepada-Nya?\"",
      "text_translation": "Lalu Kami utus kepada mereka, seorang rasul dari kalangan mereka sendiri (yang berkata), “Sembahlah Allah! Tidak ada tuhan (yang berhak disembah) bagimu selain Dia. Maka mengapa kamu tidak bertakwa (kepada-Nya)?”",
      "text": "فَاَرْسَلْنَا فِيْهِمْ رَسُوْلًا مِّنْهُمْ اَنِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗۗ اَفَلَا تَتَّقُوْنَ ࣖ ",
      "text_translation_en": "and [every time] We sent unto them an apostle from among themselves, [he told them:] “Worship God [alone]: you have no deity other than Him. Will you not, then, become conscious of Him?”",
      "juz_number": 18
    },
    "33": {
      "text_tafsir_en": "The leaders of the unbelieving people turned their backs on Allah, and the resurrection and hisab on the Day of Judgment because of their love for the luxury of living in the world. They responded to the call of the Hud saying, \"This man (Hud) is nothing but an ordinary man like you, with no advantages, he eats ordinary drinks like us. Therefore his cry should never be ignored.",
      "text_tafsir": "Pemuka-pemuka kaumnya yang kafir mengingkari ketauhidan kepada Allah, dan adanya kebangkitan dan hisab pada hari Kiamat karena terlalu cinta pada kemewahan hidup di dunia. Mereka menjawab seruan Nabi Hud dengan berkata, \"Orang ini (Hud) tidak lain hanyalah seorang manusia biasa seperti kamu, tidak mempunyai kelebihan, makan minum biasa seperti kita. Karena itu seruannya tak usah dihiraukan sama sekali.\"",
      "text_translation": "Dan berkatalah para pemuka orang kafir dari kaumnya dan yang mendustakan pertemuan hari akhirat serta mereka yang telah Kami beri kemewahan dan kesenangan dalam kehidupan di dunia, “(Orang) ini tidak lain hanyalah manusia seperti kamu, dia makan apa yang kamu makan, dan dia minum apa yang kamu minum.”",
      "text": "وَقَالَ الْمَلَاُ مِنْ قَوْمِهِ الَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِلِقَاۤءِ الْاٰخِرَةِ وَاَتْرَفْنٰهُمْ فِى الْحَيٰوةِ الدُّنْيَاۙ مَا هٰذَآ اِلَّا بَشَرٌ مِّثْلُكُمْۙ يَأْكُلُ مِمَّا تَأْكُلُوْنَ مِنْهُ وَيَشْرَبُ مِمَّا تَشْرَبُوْنَ ",
      "text_translation_en": "And [every time] the great ones among his people, who refused to acknowledge the truth and gave the lie to the announcement of a life to come - [simply] because We had granted them ease and plenty in [their] worldly life, and they had become corrupted by it [every time] they would say: “This [man] is nothing hut a mortal like yourselves, eating of what you eat, and drinking of what you drink:",
      "juz_number": 18
    },
    "34": {
      "text_tafsir_en": "The infidel leader continued his words, \"If you obey all ordinary people like you, and just follow the call of Hud without prior research, surely you will become a loser and deceived human.\" They do not want if the apostles were just ordinary people They want the apostle from an angel so that it looks great and extraordinary. But if the apostle was an angel they would not be able to follow it, because the character of angels is not the same as human characters. Humans can not possibly follow the way of worship and the way of life of angels who do not have lust so that his life is always and only for worship. While humans are weak, have lust and are easily tempted by demons and demons.",
      "text_tafsir": "Pemuka orang kafir itu melanjutkan ucapannya, \"Jika kamu sekalian menaati manusia biasa seperti kamu, dan mengikuti saja seruan Hud tanpa penelitian lebih dahulu, niscaya kamu akan menjadi manusia yang merugi dan tertipu.\" Mereka tidak mau jika rasul itu hanya manusia biasa. Mereka ingin rasul itu dari malaikat sehingga tampak hebat dan luar biasa. Padahal jika rasul itu malaikat mereka pasti tidak mampu mengikutinya, karena karakter malaikat tidak sama dengan karakter manusia. Manusia tidak mungkin dapat mengikuti cara beribadah dan cara hidup malaikat yang tidak memiliki nafsu sehingga hidupnya selalu dan hanya untuk beribadah. Sedangkan manusia lemah, memiliki nafsu dan mudah tergoda oleh iblis dan setan.",
      "text_translation": "Dan sungguh, jika kamu menaati manusia seperti kamu, niscaya kamu pasti rugi.",
      "text": "وَلَىِٕنْ اَطَعْتُمْ بَشَرًا مِّثْلَكُمْ اِنَّكُمْ اِذًا لَّخٰسِرُوْنَ ۙ",
      "text_translation_en": "and, indeed, if you pay heed to a mortal like your­selves, you will surely be the losers!",
      "juz_number": 18
    },
    "35": {
      "text_tafsir_en": "Then they added the reason for their disobedience to the Messenger of Allah, the Prophet Hud by saying how it was possible for the Prophet to promise his followers that if a man died, and that his body had been destroyed in the grave and only remained alive, it would be resurrected in its entirety. from his tomb to be set on the Day of Resurrection. They do not believe it because they follow their superficial reasoning, whereas in Surah Yasin Allah says: Say (Muhammad), \"He who gives life to him first created it, and He is the All-Knowing of all beings\" (Yasin \/ 36: 79 )",
      "text_tafsir": "Kemudian mereka menambah alasan keingkaran mereka kepada rasul yang diutus Allah, yaitu Nabi Hud dengan mengatakan bagaimana mungkin Nabi Hud menjanjikan kepada pengikutnya bahwa jika manusia sudah mati, dan badannya telah hancur dalam kubur dan hanya tinggal tulang-belulang saja, akan dibangkitkan lagi dalam keadaan utuh dari kuburannya itu untuk dihisab pada hari Kiamat. Mereka tidak mempercayainya karena hanya mengikuti pemikirannya yang dangkal, padahal dalam Surah Yasin Allah telah berfirman:\n\nKatakanlah (Muhammad), \"Yang akan menghidupkannya ialah (Allah) yang menciptakannya pertama kali. Dan Dia Maha Mengetahui tentang segala makhluk. (Yasin\/36: 79)",
      "text_translation": "Adakah dia menjanjikan kepada kamu, bahwa apabila kamu telah mati dan menjadi tanah dan tulang belulang, sesungguhnya kamu akan dikeluarkan (dari kuburmu)?",
      "text": "اَيَعِدُكُمْ اَنَّكُمْ اِذَا مِتُّمْ وَكُنْتُمْ تُرَابًا وَّعِظَامًا اَنَّكُمْ مُّخْرَجُوْنَ ۖ ",
      "text_translation_en": "Does he promise you that, after you have died and become [mere] dust and bones, you shall be brought forth [to a new life]?",
      "juz_number": 18
    },
    "36": {
      "text_tafsir_en": "This verse explains that what the Prophet Hud said about the resurrection, according to them is impossible. They do not want to move from their simple minds to see the fact that there is a power of God outside of human power. God created the universe and all humanity.",
      "text_tafsir": "Ayat ini menjelaskan bahwa apa yang dikatakan Nabi Hud tentang kebangkitan, menurut mereka mustahil terjadi. Mereka tidak mau beranjak dari pikirannya yang sederhana untuk melihat kenyataan bahwa ada kekuasaan Allah di luar kekuasaan manusia. Allah yang telah menciptakan alam semesta dan seluruh manusia.",
      "text_translation": "Jauh! Jauh sekali (dari kebenaran) apa yang diancamkan kepada kamu, ",
      "text": "۞ هَيْهَاتَ هَيْهَاتَ لِمَا تُوْعَدُوْنَ ۖ ",
      "text_translation_en": "Far-fetched, far-fetched indeed is what you are promised!",
      "juz_number": 18
    },
    "37": {
      "text_tafsir_en": "Then they affirm their disobedience by saying, \"The real life is just the life of this world. Some of us live and die, and others follow one another, generation after generation, not like plants, and there are plants. and there is a harvest, and we shall not rise again after we die. \" The unbelievers only look upon human life as plants and animals that have only undergone generations, and no development of mind and culture, and no responsibility for their daily activities.",
      "text_tafsir": "Kemudian mereka mempertegas keingkaran mereka dengan ucapan, \"Kehidupan yang sebenarnya hanya kehidupan dunia ini saja. Sebagian kita ada yang hidup kemudian mati, disusul pula oleh yang lain secara silih berganti, generasi demi generasi, tak beda seperti tanaman, di sana ada yang bercocok tanam dan di situ ada yang panen. Kita sekalian tidak akan dibangkitkan lagi setelah mati.\"\n\nOrang-orang kafir hanya memandang kehidupan manusia seperti tumbuh-tumbuhan dan binatang yang dari waktu ke waktu hanya mengalami pergantian generasi, dan tidak ada perkembangan pikiran dan kebudayaan, serta tidak ada tanggung jawab dalam perbuatannya sehari-hari.",
      "text_translation": "(kehidupan itu) tidak lain hanyalah kehidupan kita di dunia ini, (di sanalah) kita mati dan hidup dan tidak akan dibangkitkan (lagi),",
      "text": "اِنْ هِيَ اِلَّا حَيَاتُنَا الدُّنْيَا نَمُوْتُ وَنَحْيَا وَمَا نَحْنُ بِمَبْعُوْثِيْنَ ۖ ",
      "text_translation_en": "There is no life beyond our life in this world: we die and we live [but once], and we shall never be raised from the dead!",
      "juz_number": 18
    },
    "38": {
      "text_tafsir_en": "They not only denied the resurrection after death, but also threw accusations at Hud that he had lied to God. They said, \"That man is lying to God and we will never believe in him.\"",
      "text_tafsir": "Mereka tidak saja mengingkari kebangkitan setelah mati, tetapi juga melemparkan tuduhan kepada Hud bahwa ia berbuat dusta kepada Allah. Mereka berkata, \"Orang itu memang mengadakan kedustaan terhadap Allah dan kami sekali-kali tidak akan beriman kepadanya.\"",
      "text_translation": "Dia tidak lain hanyalah seorang laki-laki yang mengada-adakan kebohongan terhadap Allah, dan kita tidak akan mempercayainya.",
      "text": "اِنْ هُوَ اِلَّا رَجُلُ ِۨافْتَرٰى عَلَى اللّٰهِ كَذِبًا وَّمَا نَحْنُ لَهٗ بِمُؤْمِنِيْنَ",
      "text_translation_en": "He is nothing but a man who attributes his own lying in­ventions to God, and we are not going to believe him!”",
      "juz_number": 18
    },
    "39": {
      "text_tafsir_en": "When Hud heard the words of his people, that they would not believe him at all, he prayed to Allah, \"My Lord, help me because they have rejected me, though I have tried my best to guide them, but they have closed all the gates of guidance, so that I felt despair of their faith. \"",
      "text_tafsir": "Ketika Hud mendengar ucapan kaumnya, bahwa mereka sama sekali tidak akan beriman kepadanya, maka beliau berdoa kepada Allah, \"Ya Tuhanku, tolonglah aku karena mereka mendustakan aku, walaupun aku telah menjalankan segala daya upaya untuk memberi petunjuk kepada mereka, tetapi mereka telah menutup semua pintu-pintu hidayah, sehingga aku merasa berputus asa dari keimanan mereka itu.\"",
      "text_translation": "Dia (Hud) berdoa, “Ya Tuhanku, tolonglah aku karena mereka mendustakan aku.”",
      "text": "قَالَ رَبِّ انْصُرْنِيْ بِمَا كَذَّبُوْنِ",
      "text_translation_en": "[Whereupon the prophet] would say: “O my Sustainer! Succour me against their accusation of lying!”",
      "juz_number": 18
    },
    "40": {
      "text_tafsir_en": "God said, \"Wait, those who reject you will soon be the ones who will be sorry.",
      "text_tafsir": "Allah berfirman, \"Tunggulah, tidak lama lagi orang-orang yang mendustakanmu itu semuanya akan menjadi orang-orang yang menyesal. Azab-Ku akan menimpa mereka dan pada waktu itu semua penyesalan tidak akan berguna lagi.\"",
      "text_translation": "Dia (Allah) berfirman, “Tidak lama lagi mereka pasti akan menyesal.”",
      "text": "قَالَ عَمَّا قَلِيْلٍ لَّيُصْبِحُنَّ نٰدِمِيْنَ ۚ ",
      "text_translation_en": "[And God] would say: “After a little while they will surely be smitten with remorse!”",
      "juz_number": 18
    },
    "41": {
      "text_tafsir_en": "So they were destroyed by an unspeakable torment, which was swept away by the waters, and the voice of a mighty shout. They were turned into a great flood of unproductive garbage, and the wicked perished.",
      "text_tafsir": "Maka mereka dimusnahkan dengan azab yang tidak ada bandingannya, yaitu dihancurkan oleh air dan suara yang mengguntur dengan dahsyat. Mereka dijadikan sebagai sampah banjir besar yang tidak berfaedah sama sekali, maka orang-orang yang zalim itu menjadi binasa.",
      "text_translation": "Lalu mereka benar-benar dimusnahkan oleh suara yang mengguntur, dan Kami jadikan mereka (seperti) sampah yang dibawa banjir. Maka binasalah bagi orang-orang yang zalim. ",
      "text": "فَاَخَذَتْهُمُ الصَّيْحَةُ بِالْحَقِّ فَجَعَلْنٰهُمْ غُثَاۤءًۚ فَبُعْدًا لِّلْقَوْمِ الظّٰلِمِيْنَ",
      "text_translation_en": "And then the blast [of Our punishment] over­took them, justly and unavoidably, and We caused them to become as the flotsam of dead leaves and the scum borne on the surface of a torrent: and so - away with those evildoing folk!",
      "juz_number": 18
    },
    "42": {
      "text_tafsir_en": "After the destruction of the 'Ad people, this verse describes the Gentiles, the people of Madiah and the Aihorites, and the land of Sodom. To the Samaritans God sent Prophet Saleh, but the people rejected him, even killing the Saleh camel which was his miracle. As for the people of Mahay and Aikah, Allah sent Prophet Shuaib. They were also wicked and rejected the Prophet, and they liked to reduce the scales. The people of Sodom also rejected the Prophet Lot and many of them were homosexual.",
      "text_tafsir": "Setelah kehancuran kaum 'Ad, pada ayat ini diterangkan tentang kaum samud, kaum negeri Madyan dan negeri Aikah, serta negeri Sodom. Kepada kaum samud Allah mengutus Nabi Saleh, tetapi kaum samud menolaknya, bahkan sampai membunuh unta Nabi Saleh yang merupakan mukjizatnya. \n\nSedangkan kepada penduduk Madyan dan Aikah, Allah mengutus Nabi Syuaib. Mereka juga durhaka dan menolak Nabi Syuaib, serta mereka suka mengurangi timbangan. Penduduk Sodom juga mengingkari Nabi Lut dan banyak yang melakukan homoseksual.",
      "text_translation": "Kemudian setelah mereka Kami ciptakan umat-umat yang lain.",
      "text": "ثُمَّ اَنْشَأْنَا مِنْۢ بَعْدِهِمْ قُرُوْنًا اٰخَرِيْنَ ۗ",
      "text_translation_en": "AND AFTER them We gave rise to new genera­tions:",
      "juz_number": 18
    },
    "43": {
      "text_tafsir_en": "In this verse, God emphasizes that no single nation can hasten their death or destruction, nor can it delay it. All of this is in accordance with the order of Almighty God, who governs the world with all its contents in order, order and order. Therefore, the extinct peoples could not precede their destiny nor could they withdraw it or postpone it, since every nation had a precedent in the Far Mahfuz, how long they would live in the world.",
      "text_tafsir": "Pada ayat ini Allah menegaskan bahwa tidak ada satu umat pun yang dapat mempercepat ajal atau kehancuran mereka, dan tidak pula dapat menundanya. Semua itu berlaku sesuai dengan ketentuan Allah Yang Mahakuasa, yang mengatur alam ini dengan segala isinya dengan tertib, teratur dan lancar. Oleh karena itu, umat-umat yang telah binasa itu tidak dapat mendahului ajalnya yang telah ditentukan dan tidak pula mereka dapat mengundurkannya atau menundanya, sebab setiap umat telah ada ketetapan lebih dahulu di Lauh Mahfuz, berapa lama mereka akan mengalami hidup di dunia.",
      "text_translation": "Tidak ada satu umat pun yang dapat menyegerakan ajalnya, dan tidak (pula) menangguhkannya.",
      "text": "مَا تَسْبِقُ مِنْ اُمَّةٍ اَجَلَهَا وَمَا يَسْتَأْخِرُوْنَ ۗ",
      "text_translation_en": "[for,] no community can ever forestall [the end of] its term - and neither can they delay [its coming].",
      "juz_number": 18
    },
    "44": {
      "text_tafsir_en": "Then God sent His people His prophets in succession at different times. At every period there is a messenger of God who serves to convey His message. Thus they came and changed to the closing prophet, Muhammad, every messenger sent to his people, the people denied it. Because each of these people rejected His Messenger, God destroyed them in a row and God made their story a human word that came later. Their stories are often told, both in their daily conversations and in the lessons of history of the people who once denied His prophets.",
      "text_tafsir": "Kemudian Allah mengutus kepada umat-umat itu para rasul-Nya secara berturut-turut dalam beberapa masa yang berbeda. Pada setiap periode ada rasul Allah yang berfungsi menyampaikan risalah-Nya. Demikianlah mereka datang silih berganti sampai kepada nabi penutup yaitu Nabi Muhammad, setiap diutus rasul kepada umatnya, umat itu mendustakannya. Oleh karena masing-masing umat itu mendustakan rasul-Nya, maka Allah membinasakan mereka berturut-turut dan Allah menjadikan kisah mereka buah tutur manusia yang datang kemudian. Kisah mereka sering disebut, baik dalam percakapannya sehari-hari maupun dalam pelajaran sejarah umat-umat yang pernah mendustakan nabi-nabi-Nya.",
      "text_translation": "Kemudian, Kami utus rasul-rasul Kami berturut-turut. Setiap kali seorang rasul datang kepada suatu umat, mereka mendustakannya, maka Kami silihgantikan sebagian mereka dengan sebagian yang lain (dalam kebinasaan). Dan Kami jadikan mereka bahan cerita (bagi manusia). Maka kebinasaanlah bagi kaum yang tidak beriman.",
      "text": "ثُمَّ اَرْسَلْنَا رُسُلَنَا تَتْرَاۗ  كُلَّمَا جَاۤءَ اُمَّةً رَّسُوْلُهَا كَذَّبُوْهُ فَاَتْبَعْنَا بَعْضَهُمْ بَعْضًا وَّجَعَلْنٰهُمْ اَحَادِيْثَۚ فَبُعْدًا لِّقَوْمٍ لَّا يُؤْمِنُوْنَ ",
      "text_translation_en": "And We sent forth Our apostles, one after another: [and] every time their apostle came to a community, they gave him the lie: and so We caused them to follow one another [into the grave], and let them become [mere] tales: and so - away with the folk who would not believe!",
      "juz_number": 18
    },
    "45": {
      "text_tafsir_en": "Allah sent Moses and his brother Aaron (as his assistants) to Pharaoh and his people with the nine miracles as mentioned in Surah al-A'raf and the clear justification of his letter, so that they would only worship Allah and leave the idol to him, and to prevent them from oppressing the children of Israel who were in Egypt, and allowing them to be brought back by Moses and Aaron back to the land of the Prophet Jacob in Palestine. Moses and Aaron came to Pharaoh with a gentle cries as in his word: So speak to him (Pharaoh) with gentle words, so that he may be conscious or afraid. (thaha \/ 20: 44)",
      "text_tafsir": "Allah mengutus Musa dan saudaranya Harun (sebagai pembantu-nya) kepada Fir'aun dan kaumnya dengan membawa sembilan macam mukjizat seperti yang telah tersebut dalam Surah al-A'raf dan hujjah yang nyata atas kerasulannya, agar mereka hanya menyembah kepada Allah dan meninggalkan kemusyrikan kepada-Nya, dan agar mereka jangan menyiksa Bani Israil yang berada di Mesir, dan membolehkan mereka dibawa kembali oleh Musa dan Harun kembali ke negeri asal Nabi Yakub di Palestina. Musa dan Harun datang kepada Fir'aun dengan seruan yang lemah lembut sebagaimana dalam firman-Nya:\n\nMaka berbicaralah kamu berdua kepadanya (Fir'aun) dengan kata-kata yang lemah lembut, mudah-mudahan dia sadar atau takut. (thaha\/20: 44)",
      "text_translation": "Kemudian Kami utus Musa dan saudaranya Harun dengan membawa tanda-tanda (kebesaran) Kami, dan bukti yang nyata,",
      "text": "ثُمَّ اَرْسَلْنَا مُوْسٰى وَاَخَاهُ هٰرُوْنَ ەۙ بِاٰيٰتِنَا وَسُلْطٰنٍ مُّبِيْنٍۙ",
      "text_translation_en": "AND THEN We sent forth Moses and his brother Aaron with Our messages and a manifest authority [from Us]",
      "juz_number": 18
    },
    "46": {
      "text_tafsir_en": "Moses and Aaron came to Pharaoh and the dignitaries of his people accompanied by reason and strong evidence, but they did not realize, even they were arrogant as their custom.",
      "text_tafsir": "Musa dan Harun datang kepada Fir'aun dan pembesar-pembesar kaumnya disertai dengan alasan dan hujjah yang kuat, namun mereka tidak juga menyadari, bahkan mereka bersikap sombong sebagaimana kebiasaan mereka.",
      "text_translation": "kepada Fir‘aun dan para pemuka kaumnya, tetapi mereka angkuh dan mereka memang kaum yang sombong.",
      "text": "اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖ فَاسْتَكْبَرُوْا وَكَانُوْا قَوْمًا عَالِيْنَ ۚ",
      "text_translation_en": "unto Pharaoh and his great ones; but these behaved with arrogance, for they were people wont to glorify [only] themselves.",
      "juz_number": 18
    },
    "47": {
      "text_tafsir_en": "They said, \"Should we believe in two men as we do? Should we submit to both of them, though they are slaves and servants who submit to us as their masters and masters?\" They equate the mission of delivering the work of a leaflet from God based on sincerity, trust and honesty, such as a worldly department that emanates from death and wealth. Their views were also held by the infidels of the Quraysh, as explained in this verse: And they (also) said, \"Why is it not revealed to the great (rich and influential) of one of these two states (Mecca and Taif)? \" (az-Zukhruf \/ 43: 31) They rejected Muhammad's visions and prophecies, for in their minds the man appointed to be an apostle was rich and influential. They do not know that God's choice of letters is not based on wealth or superiority, but rather on the gift of God, which already exists in the realm of nature, and its relation to the dignity, purity and honesty and affection of his people. The prophets for their inner purity were not influenced by the material world. They receive revelation with the help of angels, and serve the interests of their people. They keep in touch with their God. When unbelievers feel strange and ask why God sends His messenger from among their own people, it is even more strange and miraculous, when asked why they make wood and stone, made and engraved by their own hands as God. It is exactly what the verse says: It is not the eyes that are blind but the blind in the heart. (al-hajj \/ 22: 46)",
      "text_tafsir": "Mereka berkata, \"Apakah kita pantas percaya kepada dua orang manusia seperti kita juga? Apakah patut kita tunduk pada keduanya, padahal mereka itu adalah golongan hamba-hamba dan pembantu-pembantu yang tunduk kepada kita sebagai majikan dan tuannya?\" Mereka menyamakan misi menyampaikan tugas risalah dari Allah yang berdasarkan keikhlasan, kepercayaan dan kejujuran, seperti jabatan keduniaan yang bersumber kepada kepangkatan dan kekayaan. Pandangan mereka itu juga dipegang oleh orang kafir Quraisy, sebagaimana dijelaskan dalam ayat ini:\n\nDan mereka (juga) berkata, \"Mengapa Al-Qur'an ini tidak diturunkan kepada orang besar (kaya dan berpengaruh) dari salah satu dua negeri ini (Mekah dan Taif)?\" (az-Zukhruf\/43: 31)\n\nMereka mengingkari wahyu dan kenabian Muhammad saw, karena menurut jalan pikiran mereka, orang yang diangkat menjadi rasul itu hendaklah orang yang kaya dan berpengaruh. Mereka tidak mengetahui bahwa pilihan Allah untuk kerasulan itu tidak didasarkan kepada kekayaan atau kepangkatan, akan tetapi semata-mata kepada karunia Allah, yang sudah ada ketetapannya di alam azali, dan hubungannya dengan keluhuran budi pekerti, kesucian dan kejujuran serta kesayangan kepada umatnya. \n\nPara nabi karena kesucian batin mereka tidak terpengaruh oleh alam kebendaan. Mereka menerima wahyu dengan perantaraan malaikat, dan melayani segala kepentingan umatnya. Mereka tetap berhubungan dengan Tuhan mereka. Apabila orang-orang kafir merasa aneh dan mempertanyakan mengapa Allah mengutus utusan-Nya dari kalangan manusia sendiri, maka lebih aneh dan ajaib lagi, jika dipertanyakan mengapa mereka menjadikan kayu dan batu, yang dibuat dan diukir oleh tangan mereka sendiri sebagai Tuhan. Sungguh tepat apa yang difirmankan dalam ayat:\n\nSebenarnya bukan mata itu yang buta, tetapi yang buta ialah hati yang di dalam dada. (al-hajj\/22: 46)",
      "text_translation": "Maka mereka berkata, “Apakah (pantas) kita percaya kepada dua orang manusia seperti kita, padahal kaum mereka (Bani Israil) adalah orang-orang yang menghambakan diri kepada kita?”",
      "text": "فَقَالُوْٓا اَنُؤْمِنُ لِبَشَرَيْنِ مِثْلِنَا وَقَوْمُهُمَا لَنَا عٰبِدُوْنَ ۚ",
      "text_translation_en": "And so they said: “Shall we believe [them] two mortals like ourselves - although their people are our slaves?”",
      "juz_number": 18
    },
    "48": {
      "text_tafsir_en": "Pharaoh and his leaders still rejected Moses and Aaron. Thus, they are among those who were destroyed by drowning in the Red Sea.",
      "text_tafsir": "Fir'aun dan para pembesar kaumnya tetap mendustakan Musa dan Harun. Dengan demikian, mereka termasuk orang-orang yang dibinasakan dengan cara ditenggelamkan di Laut Merah.",
      "text_translation": "Maka mereka mendustakan keduanya, sebab itu mereka termasuk orang yang dibinasakan.",
      "text": "فَكَذَّبُوْهُمَا فَكَانُوْا مِنَ الْمُهْلَكِيْنَ ",
      "text_translation_en": "Thus, they gave the lie to those two, and earned (thereby) their place among the doomed:",
      "juz_number": 18
    },
    "49": {
      "text_tafsir_en": "Then after the enemies of Moses and Aaron were submerged (destroyed), God revealed His bounty to His messengers, that He had handed down the Book (the Torah) to Moses, which contained the laws of the Shari'ah, some commandments and prohibition, in the hope that the Children of Israel will be guided in the path that leads to worldly happiness and the afterlife.",
      "text_tafsir": "Kemudian setelah musuh-musuh Musa dan Harun ditenggelamkan (dibinasakan), Allah menerangkan karunia-Nya yang dilimpahkan kepada para utusan-Nya, bahwa Dia telah menurunkan Al-Kitab (Taurat) kepada Musa, yang di dalamnya berisi hukum-hukum syariat, beberapa perintah dan larangan, dengan harapan agar Bani Israil mendapat petunjuk ke jalan yang membawa kepada kebahagiaan dunia dan akhirat.",
      "text_translation": "Dan sungguh, telah Kami anugerahi kepada Musa Kitab (Taurat), agar mereka (Bani Israil) mendapat petunjuk.",
      "text": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ لَعَلَّهُمْ يَهْتَدُوْنَ ",
      "text_translation_en": "for, indeed, We had vouchsafed revelation unto Moses in order that they might find the right way.",
      "juz_number": 18
    },
    "50": {
      "text_tafsir_en": "This verse explains that God has made Jesus the son of Mary a sign of the power of God that can create a human being only from a mother without a father, and give the ability of a baby to speak in time, and to perform miracles, to heal the blind from birth, to bring life to life dead people from their graves, flying birds from flying clay, and so on. Jesus' birth of a mother, Mary, is evidence of God's power, being pregnant without human touch. Mary and her sons were a sign of God's power for all men as in His word: And keep her honor, and We breathe out of her into her (her) body; We make him and his son a sign (the greatness of God) for the whole world. (al- Anbiya '\/ 21: 91) God explained that Jesus and his mother were given a place of refuge and protected on a high plateau in the region of Palestine which had grasslands and flowing streams of clear water. Jesus and Mary throughout his life never came out of Palestine or Sham. Some say that Jesus went to Rabbah near Lahore in Pakistan and died there, but this opinion has no basis whatsoever.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah menjadikan Isa putra Maryam sebagai tanda kekuasaan Allah yang dapat menciptakan seorang manusia hanya dari seorang ibu saja tanpa ayah, dan memberi kemampuan kepada seorang bayi berbicara sebelum waktunya, dan memberi mukjizat kepadanya, dapat menyembuhkan orang buta sejak lahir, menghidupkan orang yang sudah mati dari kuburannya, membuat burung dari tanah liat yang bisa terbang, dan sebagainya. Kelahiran Isa dari seorang ibu yaitu Maryam dijadikan bukti kekuasaan Allah, karena hamil tanpa disentuh manusia. Maryam dan putranya menjadi tanda kekuasaan Allah bagi seluruh manusia sebagaimana dalam firman-Nya:\n\nDan (ingatlah kisah Maryam) yang memelihara kehormatannya, lalu Kami tiupkan (roh) dari Kami ke dalam (tubuh)nya; Kami jadikan dia dan anaknya sebagai tanda (kebesaran Allah) bagi seluruh alam. (al- Anbiya'\/21: 91)\n\nAllah menjelaskan bahwa Isa dan ibunya diberi tempat kediaman dan dilindungi di suatu dataran yang tinggi di daerah Palestina yang mempunyai padang rumput dan sumber air jernih yang mengalir. Nabi Isa dan Maryam selama hidupnya tidak pernah keluar dari Palestina atau Syam. Ada yang mengatakan bahwa Nabi Isa pergi ke Rabwah dekat Lahore di Pakistan dan meninggal dunia di sana, tetapi pendapat ini tidak mempunyai dasar sama sekali.",
      "text_translation": "Dan telah Kami jadikan (Isa) putra Maryam bersama ibunya sebagai suatu bukti yang nyata bagi (kebesaran Kami), dan Kami melindungi mereka di sebuah dataran tinggi, (tempat yang tenang, rindang dan banyak buah-buahan) dengan mata air yang mengalir.",
      "text": "وَجَعَلْنَا ابْنَ مَرْيَمَ وَاُمَّهٗٓ اٰيَةً وَّاٰوَيْنٰهُمَآ اِلٰى رَبْوَةٍ ذَاتِ قَرَارٍ وَّمَعِيْنٍ ࣖ",
      "text_translation_en": "And [as We exalted Moses, so, too,] We made the son of Mary and his mother a symbol [of Our grace], and provided for both an abode in a lofty place of lasting restfulness and unsullied springs.",
      "juz_number": 18
    },
    "51": {
      "text_tafsir_en": "God commands the prophets to eat the lawful and good sustenance that God has given them and never to eat unlawful things, to do good deeds, and to abstain from evil and evil deeds. The prophets were the first to obey God's command, as they would serve as an example for the people to whom they were sent to deliver the message of God. This command, though it is only shown to the prophets, but it also applies to their people without exception, because it is a role model for their people except in some cases specifically for the prophets, because it is not appropriate if it is required of their people. Abu Hurairah narrated that the Messenger of Allah (may peace be upon him) said: O mankind, verily Allah Ta'ala is good, He does not accept but good. Verily, Allah Ta'ala commands the believers what He commands His Apostles. So the Messenger of Allah (may peace be upon him) recited this verse (ya ayyuhar-rusulu kulu minath-thayyibati wa'malu sal'nni bima ta'malu 'alim, \"O Messenger! Eat of good (food), and do good. Know what you are doing.) Then the Messenger of Allah (may peace be upon him) recited the verses of ayyuhalladzina amanu kulu min thayyibati ma razaqnakum¦ Later the Prophet described the condition of a person who had traveled long (long), his hair was irregular and dusty, and his food from illegal, and he drank from the wine, and strewed his hands in the air, \"My Lord! Oh my god! How can such a prayer be answered? \"(Muslim history and at-Tirmidzi) In this verse, Allah gives the command to eat halal and good food and practice good deeds, which means that good deeds will not be accepted by Allah unless those who do so According to the accepted record of the Messenger of Allah, he said: \"Allah does not accept the worship of those who have in their stomachs an illegal food. And it is legally reported that the Prophet saw said,\" Every flesh which grows out of illegal food and the hell is more than entitled to burn it. \" When he was about to break the fast, the milk was rejected by the Messenger and he ordered a milkman he came back and asked her where the milk came from. Ummi Abdillah replied, \"It's my own goat's milk.\" Then the milk was rejected again and the commissioner Ummi Abdillah was again asked where the goat was. Ummi Abdillah replied, 'I bought the goat with my own money. \"Then the Prophet received the milk. The next day Ummi Abdillah came to the Messenger and asked,\" O Messenger of Allah, why do you always reject the milk? \" to eat nothing but that which is good and to do nothing but that which is good. \"(History of Ibn Abi hatim and Ibn Mardawaih) Such is the command of Allah to His Apostles that mankind should obey because Allah is well-acquainted with human deeds. There is nothing hidden from him that will render to him good, and double to evil.",
      "text_tafsir": "Allah memerintahkan kepada para nabi supaya memakan rezeki yang halal dan baik yang dikaruniakan Allah kepadanya dan sekali-kali tidak dibolehkan memakan harta yang haram, selalu mengerjakan perbuatan yang baik, dan menjauhi perbuatan yang keji dan mungkar. Para nabi itulah orang yang pertama yang harus mematuhi perintah Allah, karena mereka akan menjadi teladan bagi umat di mana mereka diutus untuk menyampaikan risalah Tuhannya. Perintah ini walaupun hanya ditunjukkan kepada para nabi, tetapi ia berlaku pula terhadap umat mereka tanpa terkecuali, karena para nabi itu menjadi panutan bagi umatnya kecuali dalam beberapa hal yang dikhususkan untuk para nabi saja, karena tidak sesuai jika diwajibkan pula kepada umatnya. Abu Hurairah meriwayatkan bahwa Rasulullah saw bersabda:\n\nHai manusia, sesungguhnya Allah Ta'ala adalah baik, Dia tidak menerima kecuali yang baik. Sesungguhnya Allah Ta'ala memerintahkan kepada orang-orang yang beriman apa yang diperintahkan-Nya kepada Rasul-rasul-Nya. Maka Rasulullah saw membaca ayat ini (ya ayyuhar-rusulu kulu minath-thayyibati wa'malu saliha inni bima ta'malu 'alim, \"Wahai para rasul! Makanlah dari (makanan) yang baik-baik, dan kerjakanlah kebajikan. Sungguh, Aku Maha Mengetahui apa yang kamu kerjakan.). Kemudian Rasulullah saw membaca lagi ayat ya ayyuhalladzina amanu kulu min thayyibati ma razaqnakum¦Kemudian Nabi menerangkan keadaan seseorang yang telah melakukan perjalanan panjang (lama), rambutnya tidak teratur dan penuh debu, dan makanannya dari yang haram, minumannya dari yang haram dan pakaiannya dari yang haram pula. Orang itu berkata sambil menadahkan tangan ke langit, \"Ya Tuhanku! Ya Tuhanku! Bagaimana mungkin doanya itu akan terkabul?\" (Riwayat Muslim dan at-Tirmidzi)\n\nPada ayat ini Allah mendahulukan perintah memakan makanan yang halal dan baik baru beramal saleh. Hal ini berarti amal yang saleh itu tidak akan diterima oleh Allah kecuali bila orang yang mengerjakannya memakan harta yang halal dan baik dan menjauhi harta yang haram. Menurut riwayat yang diterima dari Rasulullah, beliau pernah bersabda:\n\nSesungguhnya Allah tidak menerima ibadah orang yang dalam perutnya terdapat sesuap makanan yang haram. Dan diriwayatkan dengan sahih pula bahwa Nabi saw bersabda, \"Setiap daging yang tumbuh dari makanan yang haram maka neraka lebih berhak membakarnya.\" (Riwayat Muslim dan at-Tirmizi)\n\nDi dalam sebuah hadis yang diriwayatkan oleh Ibnu Abi hatim dan Ibnu Mardawaih dari Ummi Abdillah saudara perempuan Syaddad bin Aus ra: \n\nBahwa Ummi Abdillah mengirimkan seteko susu kepada Rasulullah ketika beliau akan berbuka puasa. Susu itu ditolak oleh Rasulullah dan beliau menyuruh pembawa susu itu kembali dan menanyakan kepadanya dari mana susu itu didapatnya. Ummi Abdillah menjawab, \"Itu susu dari kambingku sendiri.\" Kemudian susu itu ditolak lagi dan pesuruh Ummi Abdillah disuruh lagi menanyakan dari mana kambing itu didapat. Ummi Abdillah menjawab, ' saya beli kambing itu dengan uangku sendiri.\" Kemudian barulah Rasulullah menerima susu itu. Keesokan harinya Ummi Abdillah datang menemui Rasulullah dan bertanya, \"Wahai Rasulullah, mengapa engkau selalu menolak susu itu?\" Rasulullah menjawab, \"Para rasul diperintahkan supaya jangan memakan kecuali yang baik-baik dan jangan berbuat sesuatu kecuali yang baik-baik pula.\" (Riwayat Ibnu Abi hatim dan Ibnu Mardawaih)\n\nDemikianlah perintah Allah kepada para Rasul-Nya yang harus dipatuhi oleh umat manusia karena Allah Maha Mengetahui amal perbuatan manusia, tak ada satu pun yang tersembunyi bagi-Nya. Dia akan membalas perbuatan yang baik dengan berlipat ganda dan perbuatan jahat dengan balasan yang setimpal.",
      "text_translation": "Allah berfirman, “Wahai para rasul! Makanlah dari (makanan) yang baik-baik, dan kerjakanlah kebajikan. Sungguh, Aku Maha Mengetahui apa yang kamu kerjakan.",
      "text": "يٰٓاَيُّهَا الرُّسُلُ كُلُوْا مِنَ الطَّيِّبٰتِ وَاعْمَلُوْا صَالِحًاۗ اِنِّيْ بِمَا تَعْمَلُوْنَ عَلِيْمٌ ۗ",
      "text_translation_en": "O YOU APOSTLES! Partake of the good things of life, and do righteous deeds: verily, I have full knowledge of all that you do.",
      "juz_number": 18
    },
    "52": {
      "text_tafsir_en": "In this verse God describes the religion of the apostles as the one religion that is the monotheistic religion that worships the one and only ally. There is no apostle who deviates from this principle. If in a religion there is little deviation from this principle then it is not a religion carried by an apostle, that religion has been altered by its followers and is no longer original. It is impossible for the Almighty to choose and elevate an apostle by leading a religion contrary to his righteousness and purity. Although the rules and regulations brought by the prophets and apostles vary according to the time and place where they were sent, but on the basis of monotheism there is little difference between them. Therefore God emphasizes again in this verse that He is the Lord of the Universe, that all men should worship and fear Him only and never associate Him with anyone and anything. The Messenger of Allah (may peace be upon him) said, \"We the prophets are (like) brothers and sisters, our religion is one.\" (History of al-Bukhari, Muslim and Dawud)",
      "text_tafsir": "Pada ayat ini Allah menerangkan agama para rasul itu adalah agama yang satu yaitu agama tauhid yang menyembah Allah yang Esa dan tidak ada sekutu bagi-Nya. Tidak ada seorang rasul pun yang menyimpang dari prinsip ini. Kalau dalam suatu agama terdapat sedikit saja penyimpang-an dari prinsip ini maka agama itu bukanlah agama yang dibawa oleh seorang rasul, berarti agama itu telah diubah-ubah oleh pengikutnya dan tidak orisinil lagi. Mustahil Allah Yang Maha Esa memilih dan mengangkat seorang rasul dengan membawa agama yang bertentangan dengan kebenaran dan kemurnian keesaan-Nya. Meskipun syariat dan peraturan-peraturan yang dibawa para nabi dan rasul berbeda-beda sesuai dengan masa dan tempat di mana mereka diutus, tetapi mengenai dasar tauhid tidak ada sedikit pun perbedaan antara mereka. Oleh sebab itu Allah menegaskan lagi dalam ayat ini bahwa Dia adalah Tuhan Semesta Alam, hendaknya semua manusia menyembah dan bertakwa hanya kepada-Nya dan sekali-kali jangan menyekutukan-Nya dengan siapa pun dan sesuatu apapun.\n\nRasulullah saw bersabda, \"Kami para nabi adalah (ibarat) saudara-saudara seayah, agama kami adalah satu.\" (Riwayat al-Bukhari, Muslim dan Dawud)",
      "text_translation": "Dan sungguh, (agama tauhid) inilah agama kamu, agama yang satu dan Aku adalah Tuhanmu, maka bertakwalah kepada-Ku.”",
      "text": "وَاِنَّ هٰذِهٖٓ اُمَّتُكُمْ اُمَّةً وَّاحِدَةً وَّاَنَا۠ رَبُّكُمْ فَاتَّقُوْنِ",
      "text_translation_en": "And, verily, this community of yours is one single community, since I am the Sustainer of you all: remain, then, conscious of Me!",
      "juz_number": 18
    },
    "53": {
      "text_tafsir_en": "In this verse God explains that the apostles had deviated from the teachings of their apostles and were divided into groups. Each group thinks that their group is right, while the other group is wrong. Such is the history of the other religions that prophets and apostles carry. At first the religions were pure and pure, not in the least by the basics, but by the gradual gradualness of pure monotheism in the form of shirk or deviation from the monotheistic base. . As a result, humans fell into the abyss, even among those who worshiped humans, animals, and objects such as statues and idols. However, we can know the purity and purity of a religion if we still hold to the understanding of monotheism. If in the religion there is no deviation from the basis of monotheism, then it must be pure and pure religion. But if there is a misunderstanding in it, then that religion is no longer pure and has entered into heresy. This is a misunderstanding of what the Meccans of Mecca have embraced even though they claim to be followers of Abraham. They have strayed far from the teachings of Abraham, but they still boast that their religion is true, even though what they worship is dead things that are of little use and that they cannot resist harm. They strongly opposed the teachings of monotheism brought by the Prophet Muhammad and threatened to act decisively against anyone who opposed them.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa umat para rasul itu telah menyimpang dari ajaran rasul-rasul mereka sehingga terpecah belah menjadi beberapa golongan. Masing-masing golongan menganggap bahwa golongannyalah yang benar, sedang golongan yang lain adalah salah. Demikianlah sejarah agama-agama samawi yang dibawa para nabi dan rasul. Pada mulanya agama-agama itu tetap suci dan murni, tak sedikit pun dimasuki oleh dasar-dasar kesyirikan, tetapi dengan berangsur-angsur sedikit demi sedikit paham tauhid yang murni itu dimasuki oleh paham-paham lain yang berbau syirik atau menyimpang sama sekali dari dasar tauhid. Akibatnya, manusia terjatuh ke jurang kesesatan, bahkan ada di antara mereka yang menyembah manusia, binatang, dan benda-benda seperti patung dan berhala. Namun demikian, kita dapat mengetahui suci dan murninya suatu agama jika masih berpegang teguh kepada paham tauhid. Bila dalam agama itu tidak terdapat sedikit pun penyimpangan dari dasar tauhid, maka agama itu pastilah agama yang asli dan murni. Tetapi bila terdapat di dalamnya paham yang menyimpang dari dasar itu, maka agama itu tidak murni lagi dan telah kemasukan paham-paham yang sesat. Paham-paham yang sesat inilah yang telah dianut oleh kaum musyrikin Mekah sekalipun mereka mendakwahkan bahwa mereka adalah pengikut Nabi Ibrahim. Mereka telah jauh tersesat dari ajaran Nabi Ibrahim, tetapi mereka tetap membanggakan bahwa agama merekalah yang benar, walaupun yang mereka sembah adalah benda-benda mati yang tidak bermanfaat sedikit pun dan tidak pula berdaya menolak kemudaratan. Mereka menentang dengan keras ajaran tauhid yang dibawa Nabi Muhammad saw dan mengancam akan bertindak tegas terhadap siapa saja yang menentang mereka.",
      "text_translation": "Kemudian mereka terpecah belah dalam urusan (agama)nya menjadi beberapa golongan. Setiap golongan (merasa) bangga dengan apa yang ada pada mereka (masing-masing).",
      "text": "فَتَقَطَّعُوْٓا اَمْرَهُمْ بَيْنَهُمْ زُبُرًاۗ  كُلُّ حِزْبٍۢ بِمَا لَدَيْهِمْ فَرِحُوْنَ ",
      "text_translation_en": "But they (who claim to follow you) have torn their unity wide asunder, piece by piece, each group delighting in [but] what they themselves possess [by way of tenets].",
      "juz_number": 18
    },
    "54": {
      "text_tafsir_en": "In this verse Allah instructs the Prophet Muhammad to allow the stubborn people who do not accept the truth until the time comes when Allah will torture them both in the world and in the hereafter, where they will see for themselves how great and terrible the torture provided for them. The torment in the world was the catastrophe that struck them in the time of the Badr War where they suffered great defeat and devastation. The same command is found in other verses, as the word of God says: Therefore put an end to those disbelievers. Give them a chance for a while. (ath-thariq \/ 86: 17) And His word is: Let them (in this world) eat and enjoy and be entertained by their (empty) imagination, and they will know (the consequences of their actions). (al-hijr \/ 15: 3)",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad agar membiarkan orang-orang yang keras kepala yang tidak mau menerima kebenaran itu sampai tiba saatnya Allah akan menyiksa mereka baik di dunia maupun di akhirat nanti, di mana mereka akan menyaksikan sendiri bagaimana hebat dan dahsyatnya siksaan yang disediakan untuk mereka. Adapun siksaan di dunia ialah malapetaka yang menimpa mereka pada waktu Perang Badar dimana mereka mengalami kekalahan besar dan kehancuran. Perintah seperti ini terdapat pula pada ayat lain, seperti firman Allah:\n\nKarena itu berilah penangguhan kepada orang-orang kafir itu. Berilah mereka itu kesempatan untuk sementara waktu. (ath-thariq\/86: 17)\n\nDan firman-Nya:\n\nBiarkanlah mereka (di dunia ini) makan dan bersenang-senang dan dilalaikan oleh angan-angan (kosong) mereka, kelak mereka akan mengetahui (akibat perbuatannya). (al-hijr\/15: 3)",
      "text_translation": "Maka biarkanlah mereka dalam kesesatannya sampai waktu yang ditentukan.",
      "text": "فَذَرْهُمْ فِيْ غَمْرَتِهِمْ حَتّٰى حِيْنٍ ",
      "text_translation_en": "But leave them alone, lost in their ignorance, until a [future] time.",
      "juz_number": 18
    },
    "55": {
      "text_tafsir_en": "In this verse God explains that the unbelievers were deceived and deceived by their wealth and their children whereas wealth and children were not a sign that God was trusting them. They boast of their wealth and wealth to the then-poor Muslims, as in the word of Allah: And they say, \"We have more wealth and children (than you) and we will not be punished. \" (Saba \/ 34: 35) In fact, Allah gives sustenance to the unbelievers only to bring them into the valley of perversion and rebellion because of their very proud and arrogant attitude towards the teachings of the Prophet Muhammad. With such wealth and children they will forget the land as if they were true and powerful. What they do is their right even if by doing so they are trampling on the rights of others and mistreating the weak. But one day Allah will surely torment them, for it is a sunnatullah that such cruelty and persecution will not end, but will be ruined and destroyed. This is what God says in his words: Let not their children and their children be amazed at you. Allah's purpose is to torment them in the life of the world and to die in a state of disbelief. (at-Taubah \/ 9: 55) And his word: And let not the unbelievers think that the time We have given them is better for them. Indeed, the time limit We have given them is only for their sin to increase; and they will have a humiliating punishment. (Ali 'Imran \/ 3: 178) Qatadah, an infidelity has given his commentary on this verse as follows: \"Allah has deceived the disbelievers with their property and their children. his wealth and his children, but honor him for his faith and righteousness. \" Ibn Mas'ud, may Allah be pleased with him, reported: The Messenger of Allah (may peace be upon him) said: Verily Allah has distributed among you as He has distributed among you. Verily, Allah bestows upon the world those whom He loves and those whom He does not favor. And He does not give religious strength except to those He pleases. And whomever Allah gives him religious strength, Allah wills. For the sake of the god Muhammad's soul is in his hands, no Muslim is a slave except when he is Muslim and his tongue, he does not believe unless his neighbors feel secure in his crimes. The companions asked, \"What is the crime, O Messenger of Allah?\" The Messenger of Allah (may peace be upon him) replied, \"His deception and his cruelty.\" (Ahmad's History",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa orang-orang kafir itu telah ditipu dan diperdayakan oleh harta dan anak-anak mereka padahal harta kekayaan dan anak-anak yang banyak itu bukanlah tanda bahwa Allah meridai mereka. Mereka membangga-banggakan harta dan kekayaan mereka terhadap kaum Muslimin yang di kala itu dalam keadaan serba kekurangan, seperti tersebut dalam firman Allah:\n\nDan mereka berkata, \"Kami memiliki lebih banyak harta dan anak-anak (daripada kamu) dan kami tidak akan diazab.\" (Saba\/34: 35)\n\nSebenarnya Allah memberikan kelapangan rezeki kepada orang kafir hanya semata-mata untuk menjerumuskan mereka ke lembah kemaksiatan dan kedurhakaan karena sikap mereka yang sangat congkak dan sombong terhadap ajaran yang dibawa Nabi Muhammad saw. Dengan harta dan anak-anak yang banyak itu mereka akan menjadi lupa daratan seakan-akan merekalah yang benar dan berkuasa. Apa saja yang mereka lakukan adalah hak mereka walaupun dengan perbuatan itu mereka menginjak-injak hak orang lain dan menganiaya kaum yang lemah. Tetapi pada suatu saat Allah pasti akan menyiksa mereka, karena menjadi sunnatullah bahwa kezaliman dan penganiayaan itu tidak akan kekal, bahkan akan hancur dan musnah. Hal ini ditegaskan Allah dalam firman-Nya:\n\nMaka janganlah harta dan anak-anak mereka membuatmu kagum. Sesungguhnya maksud Allah dengan itu adalah untuk menyiksa mereka dalam kehidupan dunia dan kelak akan mati dalam keadaan kafir. (at-Taubah\/9: 55)\n\nDan firman-Nya:\n\nDan jangan sekali-kali orang-orang kafir itu mengira bahwa tenggang waktu yang Kami berikan kepada mereka lebih baik baginya. Sesungguhnya tenggang waktu yang Kami berikan kepada mereka hanyalah agar dosa mereka semakin bertambah; dan mereka akan mendapat azab yang menghinakan. (Ali 'Imran\/3: 178)\n\nQatadah, seorang mufassir telah memberikan ulasannya mengenai ayat ini sebagai berikut, \"Allah telah memperdayakan orang-orang kafir itu dengan harta dan anak-anak mereka. Hai anak Adam, janganlah kamu menganggap seseorang terhormat karena harta kekayaan dan anak-anaknya, tetapi hormatilah dia karena iman dan amal saleh.\" Diriwayatkan dari Ibnu Mas'ud bahwa Rasulullah saw bersabda:\n\nSesungguhnya Allah telah membagi-bagi akhlak di antara kamu sebagai-mana Dia telah membagi-bagikan rezeki di antara kamu. Sesungguhnya Allah memberikan nikmat dunia kepada orang yang diridai-Nya dan kepada orang yang tidak diridai-Nya. Dan Dia tidak memberikan keteguhan beragama melainkan kepada yang Ia rida. Dan barangsiapa yang Allah berikan kepadanya keteguhan beragama, berarti Allah meridainya. Demi Tuhan yang jiwa Muhammad berada di tangan-Nya, tidak Islam seorang hamba kecuali bila telah Islam pula batin dan lidahnya, tidak beriman dia kecuali tetangganya merasa aman terhadap kejahatannya. Para sahabat bertanya, \"Apakah kejahatannya itu, ya Rasulullah?\" Rasulullah menjawab, \"Penipuan dan kezalimannya.\" (Riwayat Ahmad)",
      "text_translation": "Apakah mereka mengira bahwa Kami memberikan harta dan anak-anak kepada mereka itu (berarti bahwa),",
      "text": "اَيَحْسَبُوْنَ اَنَّمَا نُمِدُّهُمْ بِهٖ مِنْ مَّالٍ وَّبَنِيْنَ ۙ",
      "text_translation_en": "Do they think that by all the wealth and offspring with which We provide them",
      "juz_number": 18
    },
    "56": {
      "text_tafsir_en": "In this verse God explains that the unbelievers were deceived and deceived by their wealth and their children whereas wealth and children were not a sign that God was trusting them. They boast of their wealth and wealth to the then-poor Muslims, as in the word of Allah: And they say, \"We have more wealth and children (than you) and we will not be punished. \" (Saba \/ 34: 35) In fact, Allah gives sustenance to the unbelievers only to bring them into the valley of perversion and rebellion because of their very proud and arrogant attitude towards the teachings of the Prophet Muhammad. With such wealth and children they will forget the land as if they were true and powerful. What they do is their right even if by doing so they are trampling on the rights of others and mistreating the weak. But one day Allah will surely torment them, for it is a sunnatullah that such cruelty and persecution will not end, but will be ruined and destroyed. This is what God says in his words: Let not their children and their children be amazed at you. Allah's purpose is to torment them in the life of the world and to die in a state of disbelief. (at-Taubah \/ 9: 55) And his word: And let not the unbelievers think that the time We have given them is better for them. Indeed, the time limit We have given them is only for their sin to increase; and they will have a humiliating punishment. (Ali 'Imran \/ 3: 178) Qatadah, an infidelity has given his commentary on this verse as follows: \"Allah has deceived the disbelievers with their property and their children. his wealth and his children, but honor him for his faith and righteousness. \" Ibn Mas'ud, may Allah be pleased with him, reported: The Messenger of Allah (may peace be upon him) said: Verily Allah has distributed among you as He has distributed among you. Verily, Allah bestows upon the world those whom He loves and those whom He does not favor. And He does not give religious strength except to those He pleases. And whomever Allah gives him religious strength, Allah wills. For the sake of the god Muhammad's soul is in his hands, no Muslim is a slave except when he is Muslim and his tongue, he does not believe unless his neighbors feel secure in his crimes. The companions asked, \"What is the crime, O Messenger of Allah?\" The Messenger of Allah (may peace be upon him) replied, \"His deception and his cruelty.\" (Ahmad's History",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa orang-orang kafir itu telah ditipu dan diperdayakan oleh harta dan anak-anak mereka padahal harta kekayaan dan anak-anak yang banyak itu bukanlah tanda bahwa Allah meridai mereka. Mereka membangga-banggakan harta dan kekayaan mereka terhadap kaum Muslimin yang di kala itu dalam keadaan serba kekurangan, seperti tersebut dalam firman Allah:\n\nDan mereka berkata, \"Kami memiliki lebih banyak harta dan anak-anak (daripada kamu) dan kami tidak akan diazab.\" (Saba\/34: 35)\n\nSebenarnya Allah memberikan kelapangan rezeki kepada orang kafir hanya semata-mata untuk menjerumuskan mereka ke lembah kemaksiatan dan kedurhakaan karena sikap mereka yang sangat congkak dan sombong terhadap ajaran yang dibawa Nabi Muhammad saw. Dengan harta dan anak-anak yang banyak itu mereka akan menjadi lupa daratan seakan-akan merekalah yang benar dan berkuasa. Apa saja yang mereka lakukan adalah hak mereka walaupun dengan perbuatan itu mereka menginjak-injak hak orang lain dan menganiaya kaum yang lemah. Tetapi pada suatu saat Allah pasti akan menyiksa mereka, karena menjadi sunnatullah bahwa kezaliman dan penganiayaan itu tidak akan kekal, bahkan akan hancur dan musnah. Hal ini ditegaskan Allah dalam firman-Nya:\n\nMaka janganlah harta dan anak-anak mereka membuatmu kagum. Sesungguhnya maksud Allah dengan itu adalah untuk menyiksa mereka dalam kehidupan dunia dan kelak akan mati dalam keadaan kafir. (at-Taubah\/9: 55)\n\nDan firman-Nya:\n\nDan jangan sekali-kali orang-orang kafir itu mengira bahwa tenggang waktu yang Kami berikan kepada mereka lebih baik baginya. Sesungguhnya tenggang waktu yang Kami berikan kepada mereka hanyalah agar dosa mereka semakin bertambah; dan mereka akan mendapat azab yang menghinakan. (Ali 'Imran\/3: 178)\n\nQatadah, seorang mufassir telah memberikan ulasannya mengenai ayat ini sebagai berikut, \"Allah telah memperdayakan orang-orang kafir itu dengan harta dan anak-anak mereka. Hai anak Adam, janganlah kamu menganggap seseorang terhormat karena harta kekayaan dan anak-anaknya, tetapi hormatilah dia karena iman dan amal saleh.\" Diriwayatkan dari Ibnu Mas'ud bahwa Rasulullah saw bersabda:\n\nSesungguhnya Allah telah membagi-bagi akhlak di antara kamu sebagai-mana Dia telah membagi-bagikan rezeki di antara kamu. Sesungguhnya Allah memberikan nikmat dunia kepada orang yang diridai-Nya dan kepada orang yang tidak diridai-Nya. Dan Dia tidak memberikan keteguhan beragama melainkan kepada yang Ia rida. Dan barangsiapa yang Allah berikan kepadanya keteguhan beragama, berarti Allah meridainya. Demi Tuhan yang jiwa Muhammad berada di tangan-Nya, tidak Islam seorang hamba kecuali bila telah Islam pula batin dan lidahnya, tidak beriman dia kecuali tetangganya merasa aman terhadap kejahatannya. Para sahabat bertanya, \"Apakah kejahatannya itu, ya Rasulullah?\" Rasulullah menjawab, \"Penipuan dan kezalimannya.\" (Riwayat Ahmad)",
      "text_translation": "Kami segera memberikan kebaikan-kebaikan kepada mereka? (Tidak), tetapi mereka tidak menyadarinya.",
      "text": "نُسَارِعُ لَهُمْ فِى الْخَيْرٰتِۗ بَلْ لَّا يَشْعُرُوْنَ",
      "text_translation_en": "We [but want to] make them vie with one another in doing [what they consider] good works? Nay, but they do not perceive [their error]!",
      "juz_number": 18
    },
    "57": {
      "text_tafsir_en": "One of the first characteristics of a true believer is fear of God. Therefore they seek His will with all diligence, and keep His commandments. At the heart of their lives is the teaching of religion because it is their principle. Anything contrary to those principles is still being rejected no matter the consequences. Their faith cannot be shaken by any persuasion or threat.",
      "text_tafsir": "Salah satu di antara sifat-sifat orang yang benar-benar beriman itu pertama ialah takut kepada Tuhan. Karena itu mereka selalu mencari keridaan-Nya dengan bersungguh-sungguh mengerjakan segala perintah-Nya dan menjauhi segala larangan-Nya. Yang menjadi pedoman bagi hidup mereka ialah ajaran agama karena ajaran itulah prinsip mereka. Apa saja yang bertentangan dengan prinsip-prinsip itu tetap mereka tolak bagaimana pun akibatnya. Iman mereka tidak dapat digoyahkan oleh bujuk rayu atau ancaman apa pun.",
      "text_translation": "Sungguh, orang-orang yang karena takut (azab) Tuhannya, mereka sangat berhati-hati,",
      "text": "اِنَّ الَّذِيْنَ هُمْ مِّنْ خَشْيَةِ رَبِّهِمْ مُّشْفِقُوْنَ ۙ",
      "text_translation_en": "Verily, [only] they who stand in reverent awe of their Sustainer,",
      "juz_number": 18
    },
    "58": {
      "text_tafsir_en": "The second characteristic is to fully believe in the evidence of the Oneness and power of God that are so widely disseminated in the universe as God says: Verily in the creation of the heavens and the earth, and the change of night and day, there are signs (the greatness of God) for the wise, (that is) those who remember Allah as they stand, sit or lie down, and think of the creation of the heavens and the earth (they say), \"Our Lord, Thou hast not created all this in vain: Thy Holiness, protect us from Hell's torment. (Ali 'Imran \/ 3: 190-191) They also fully believe in all the verses revealed to His Messenger, and what they say is absolute truth that can never be denied.",
      "text_tafsir": "Sifat yang kedua ialah percaya sepenuhnya kepada bukti-bukti Keesaan dan kekuasaan Allah yang terbentang luas dalam alam semesta sebagaimana difirmankan oleh Allah:\n\nSesungguhnya dalam penciptaan langit dan bumi, dan pergantian malam dan siang terdapat tanda-tanda (kebesaran Allah) bagi orang yang berakal, (yaitu) orang-orang yang mengingat Allah sambil berdiri, duduk atau dalam keadaan berbaring, dan mereka memikirkan penciptaan langit dan bumi (seraya berkata), \"Ya Tuhan kami, tidaklah Engkau menciptakan semua ini sia-sia; Mahasuci Engkau, lindungilah kami dari azab neraka. (Ali 'Imran\/3: 190-191)\n\nMereka percaya pula sepenuhnya kepada semua ayat yang diturunkan kepada Rasul-Nya. Apa yang tersebut dalam ayat-ayat itu adalah kebenaran mutlak yang tak dapat ditawar-tawar lagi.",
      "text_translation": "dan mereka yang beriman dengan tanda-tanda (kekuasaan) Tuhannya,",
      "text": "وَالَّذِيْنَ هُمْ بِاٰيٰتِ رَبِّهِمْ يُؤْمِنُوْنَ ۙ",
      "text_translation_en": "and who believe in their Sus­tainer’s messages,",
      "juz_number": 18
    },
    "59": {
      "text_tafsir_en": "The third characteristic is to maintain the purity of the monotheism by truly worshiping God without associating it with any other worship. Believers will not worship idols or plead with them, even if they are regarded by the Muslims as a means of drawing closer to God, as it is said in his Word: Though they are commanded to worship God only in obedience to Him purely for (running) religion, and also for performing prayers and performing charity; and that is what religion is. (al-Bayyinah \/ 98: 5) They would not ask for help in the tombs because they were fully convinced that the act was the same as asking for the idols and that it was a very envious act of Allah. They will not ask the spirits of spirits, spirits, and demons, for that would include shirk as well. Thus all the acts which lead to the fellowship of their God abstain from afar, so that their faith is purely pure, not obscured by any shameless matter.",
      "text_tafsir": "Sifat yang ketiga ialah memelihara kemurnian tauhid dengan benar-benar menyembah Allah semata tanpa mempersekutukan-Nya dengan sembahan-sembahan lain. Orang yang beriman tidak akan mau menyembah berhala-berhala atau minta tolong kepadanya, walaupun berhala-berhala itu dianggap oleh kaum musyrik sebagai alat untuk mendekatkan diri kepada Allah, sebagaimana tersebut dalam firman-Nya:\n\nPadahal mereka hanya diperintah menyembah Allah dengan ikhlas menaati-Nya semata-mata karena (menjalankan) agama, dan juga agar melaksanakan salat dan menunaikan zakat; dan yang demikian itulah agama yang lurus (benar). (al-Bayyinah\/98: 5)\n\nMereka tidak akan meminta tolong kepada kuburan-kuburan karena mereka yakin sepenuhnya bahwa perbuatan itu sama saja dengan meminta tolong kepada berhala-berhala dan itu termasuk perbuatan syirik yang sangat dimurkai Allah. Mereka tidak pula akan meminta tolong kepada arwah-arwah, jin dan setan, karena yang demikian pun termasuk syirik pula. Demikianlah semua perbuatan yang membawa kepada mempersekutukan Allah mereka hindari sejauh-jauhnya, sehingga kepercayaan mereka benar-benar murni, tidak dikotori sedikit pun oleh hal-hal yang berbau syirik.",
      "text_translation": "dan mereka yang tidak mempersekutukan Tuhannya,",
      "text": "وَالَّذِيْنَ هُمْ بِرَبِّهِمْ لَا يُشْرِكُوْنَ ۙ",
      "text_translation_en": "and who do not ascribe divinity to aught but their Sustainer,",
      "juz_number": 18
    },
    "60": {
      "text_tafsir_en": "The fourth attribute is the fear of God, for they are confident that they will return to Him on the Day of Atonement in which all human deeds will be accounted for. Although they have kept all the commandments of God and abstained from all His prohibitions and placed their wealth in the way of Allah, they fear that their good deeds will not be accepted, for there may be some element of riya 'or something else which causes them to be rejected. . Therefore, they are always motivated to do good because if the previous charity is not accepted, it may be that the charity becomes a rewarding charity with a double reward. In the hadith narrated by Ibn Abi atim from 'A'ishah he asked the Prophet: Siti A'isha asked the Messenger of Allah about this verse (alladzina yu'tuna ma ataw waqulubuhum wajilah), what this verse means to commit adultery and drink the room or steal, and therefore he feared God and tormented him? This question was answered by the Messenger of Allah, \"This is not the meaning, daughter of Abu Bakr as-shiddiq. The meaning of this verse is that those who perform their prayers, fast and bless their wealth, but are afraid that their deeds include deeds that are not accepted (mardud). (History of Ahmad and at-Tirmidzi)",
      "text_tafsir": "Sifat yang keempat ialah takut kepada Allah, karena mereka yakin akan kembali kepada-Nya pada hari berhisab di mana akan diperhitungkan segala amal perbuatan manusia. Meskipun mereka telah mengerjakan segala perintah Tuhan dan menjauhi segala larangan-Nya dan menafkahkan hartanya di jalan Allah, namun mereka merasa takut kalau-kalau amal baik mereka tidak diterima, karena mungkin ada di dalamnya unsur-unsur riya' atau lainnya yang menyebabkan ditolaknya amal itu. Oleh sebab itu mereka selalu terdorong untuk selanjutnya berbuat baik karena kalau amal yang sebelumnya tidak diterima, mungkin amal yang sesudah itu menjadi amal yang makbul yang diberi ganjaran yang berlipat ganda.\n\nDalam hadis yang diriwayatkan Ibnu Abi hatim dari 'Aisyah pernah bertanya kepada Nabi:\n\nSiti Aisyah pernah bertanya kepada Rasulullah mengenai ayat ini (alladzina yu'tuna ma ataw waqulubuhum wajilah), apakah yang dimaksud dengan ayat ini ialah orang berzina dan meminum khamar atau mencuri, dan karena itu ia takut kepada Tuhan dan siksa-Nya? Pertanyaan ini dijawab oleh Rasulullah, \"Bukan demikian maksudnya, hai puteri Abu Bakar as-shiddiq. Yang dimaksud dalam ayat ini ialah orang-orang yang mengerjakan salat, berpuasa dan menafkahkan hartanya, namun dia merasa takut kalau-kalau amalnya itu termasuk amal yang tidak diterima (mardud). (Riwayat Ahmad dan at-Tirmidzi)",
      "text_translation": "dan mereka yang memberikan apa yang mereka berikan (sedekah) dengan hati penuh rasa takut (karena mereka tahu) bahwa sesungguhnya mereka akan kembali kepada Tuhannya,",
      "text": "وَالَّذِيْنَ يُؤْتُوْنَ مَآ اٰتَوْا وَّقُلُوْبُهُمْ وَجِلَةٌ اَنَّهُمْ اِلٰى رَبِّهِمْ رٰجِعُوْنَ ۙ",
      "text_translation_en": "and who give whatever they [have to] give with their hearts trembling at the thought that unto their Sustainer they must return:",
      "juz_number": 18
    },
    "61": {
      "text_tafsir_en": "This verse emphasizes that those who possess these qualities, always rush to do good when there is opportunity for them, and always strive for good deeds constantly. He just finished doing good deeds he wants to do another charity soon and so on. Such a person will be rewarded by Allah for good deeds in this world and in the Hereafter as was given to Abraham in His Word: And We gave him good in this world, and indeed in the Hereafter he is a righteous man. (an-Nahl \/ 16: 122) And he says: Allah gives them a reward in the world and a good reward in the hereafter. And Allah loves those who do good. (Ali 'Imran \/ 3: 148)",
      "text_tafsir": "Ayat ini menegaskan bahwa orang-orang yang mempunyai sifat-sifat tersebut, selalu bersegera berbuat kebaikan bila ada kesempatan untuk itu dan selalu berupaya agar amal baiknya selalu bertambah. Baru saja ia selesai melaksanakan amal yang baik ia ingin agar dapat segera berbuat amal yang lain dan demikianlah seterusnya. Orang yang demikian sifatnya akan diberi pahala oleh Allah amalnya yang baik di dunia maupun di akhirat seperti yang pernah diberikan kepada Nabi Ibrahim yang tersebut dalam firman-Nya:\n\nDan Kami berikan kepadanya kebaikan di dunia, dan sesungguhnya di akhirat dia termasuk orang yang saleh. (an-Nahl\/16: 122)\n\nDan firman-Nya:\n\nMaka Allah memberi mereka pahala di dunia dan pahala yang baik di akhirat. Dan Allah mencintai orang-orang yang berbuat kebaikan. (Ali 'Imran\/3: 148)",
      "text_translation": "mereka itu bersegera dalam kebaikan-kebaikan, dan merekalah orang-orang yang lebih dahulu memperolehnya.",
      "text": "اُولٰۤىِٕكَ يُسَارِعُوْنَ فِى الْخَيْرٰتِ وَهُمْ لَهَا سٰبِقُوْنَ",
      "text_translation_en": "it is they who vie with one another in doing good works, and it is they who outrun [all others] in attaining to them!",
      "juz_number": 18
    },
    "62": {
      "text_tafsir_en": "With this verse God explains that it is already his sunnah and his decree, He will not burden anyone with an obligation or command unless it is possible to fulfill it and within the limits of his ability. There is no compulsory requirement of His servant to be carried out by His servant and beyond the limits of his ability, only a man who looks at him for his unwillingness or is distracted by the affairs of his world or duty prevents him from carrying out his will. While the command, like the prayer for example, is very light and easy for people who are used to it, even the prayer can ease the burden and pressure of life that it must suffer when it is truly diligent and earnest. Muqatil said, \"Whoever is not able to perform the prayer by standing he can do it in a sitting position, and even if he is not able to sit it alone with enough gestures.\" Therefore there is no reason for a believer to free himself from the obligation of prayer, nor any other obligation, for all such obligations are within his limits of ability. It is only his human desires and desires that make these duties burdensome to him. Such a person has done wrong to himself and will receive a just reward from God for his disobedience and refusal. Every violation of God's command will be recorded in his book of deeds, as well as good deeds, small and great, are all recorded in the book as it says in his Word: (God says) \"This is the Book (of note) which we speak to you with truly. We have sent you what you did. \" (al-Jatsiyah \/ 45: 29) And his word is: And the book is written, and you will see the sinner in fear of what is written therein, and they will say, \"Woe to us! what is this, nothing is left, small and great but all written down, \"and they find (all) what they have done (in writing). And your Lord does not harm anyone. (al-Kahf \/ 18: 49) They will be rewarded according to their deeds in the book of record and they will not be harmed in the least.",
      "text_tafsir": "Dengan ayat ini Allah menjelaskan bahwa sudah menjadi sunnah dan ketetapan-Nya, Dia tidak akan membebani seseorang dengan suatu kewajiban atau perintah kecuali perintah itu sanggup dilaksanakannya dan dalam batas-batas kemampuannya. Tidak ada syariat yang diwajibkan-Nya yang berat dilaksanakan oleh hamba-Nya dan di luar batas kemampuannya, hanya manusialah yang memandangnya berat karena keengganannya atau ia disibukkan oleh urusan dunianya atau tugas tersebut menghalanginya dari melaksanakan keinginannya.\n\nPadahal perintah itu, seperti salat umpamanya amat ringan dan mudah bagi orang yang telah biasa mengerjakannya, bahkan salat itu pun dapat meringankan beban dan tekanan hidup yang dideritanya bila ia benar-benar mengerjakannya dengan tekun dan khusyuk. Muqatil berkata, \"Barang siapa tidak sanggup mengerjakan salat dengan berdiri ia boleh mengerjakannya dalam keadaan duduk, dan kalaupun tidak sanggup duduk maka dengan isyarat saja pun sudah cukup.\" Karena itu tidak ada alasan sama sekali bagi orang mukmin untuk membebaskan diri dari kewajiban salat, demikian pula kewajiban-kewajiban lainnya, karena semua kewajiban itu adalah dalam batas-batas kemampuannya. Hanya nafsu dan keinginan manusialah yang menjadikan kewajiban-kewajiban itu berat baginya. Maka orang yang seperti ini telah berbuat zalim terhadap dirinya sendiri dan akan mendapat balasan yang setimpal dari Tuhan atas keingkaran dan keengganannya. Setiap pelanggaran terhadap perintah Allah akan dicatat dalam buku catatan amalnya, demikian pula amal perbuatan yang baik, kecil maupun besar semuanya tercatat dalam buku itu sebagaimana tersebut dalam firman-Nya:\n\n(Allah berfirman), \"Inilah Kitab (catatan) Kami yang menuturkan kepadamu dengan sebenar-benarnya. Sesungguhnya Kami telah menyuruh mencatat apa yang telah kamu kerjakan.\" (al-Jatsiyah\/45: 29)\n\nDan firman-Nya:\n\nDan diletakkanlah kitab (catatan amal), lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata, \"Betapa celaka kami, kitab apakah ini, tidak ada yang tertinggal, yang kecil dan yang besar melainkan tercatat semuanya,\" dan mereka dapati (semua) apa yang telah mereka kerjakan (tertulis). Dan Tuhanmu tidak menzalimi seorang jua pun. (al-Kahf\/18: 49)\n\nMereka akan diberi balasan sesuai dengan perbuatannya yang tertera dalam buku catatan itu dan mereka tidak akan dirugikan sedikit pun.",
      "text_translation": "Dan Kami tidak membebani seseorang melainkan menurut kesanggupannya, dan pada Kami ada suatu catatan yang menuturkan dengan sebenarnya, dan mereka tidak dizalimi (dirugikan). ",
      "text": "وَلَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَاۖ وَلَدَيْنَا كِتٰبٌ يَّنْطِقُ بِالْحَقِّ وَهُمْ لَا يُظْلَمُوْنَ ",
      "text_translation_en": "And [withal.] We do not burden any human being with more than he is well able to bear: for with Us is a record that speaks the truth [about what men do and can do]; and none shall be wronged.",
      "juz_number": 18
    },
    "63": {
      "text_tafsir_en": "In this verse Allah explains that the hearts of the Muslims have turned away and neglected to heed the instructions of the Qur'an. They don't want to take advantage of it. But these are the principles that can lead them to the happiness of life in this world and the hereafter. If they were to read and pay attention to the Qur'an then their hearts would be opened and they would see that the teachings of the Qur'an were very useful and all that they contained was true. They will acknowledge that all human acts will be held accountable before God without exception. It was their first fault that dragged them to other wrongdoings and caused them to disregard the virtues of good morals, to do their will without regard for the rights of others. Whatever they want them to wrestle even by plundering and oppressing the weak. Therefore they were immersed in ignorance and their blind eyes could no longer distinguish between right and wrong, their ears were deaf, they could no longer hear the teachings of religion. The hadith narrated by Ibn Masud, the Prophet (saws), said: ... For the substance of the deity there is no god except him, surely there is one among you who practices the practice of the dwellers of heaven, so that between him and heaven only one hour will pass. However, he was already registered as a resident of hell, so he ended his practice with the practice of living in hell, and he entered hell. And verily, one of you is practicing the practice of living in hell, and between him and hell only last one hour. But he was recorded as a resident of heaven, so he ended his practice with the practice of the inhabitants of heaven, and he entered heaven. \"(History of Ahmad) They considered that what they inherited from their ancestors was true. an ancient folk tale brought by a madman or just a composition of a poet or a teaching that Muhammad received from the books of the Bible. If they were given clear evidence of the truth of the Qur'an that they could not say, we could not accepting it because it contradicts what our ancestors held and believed, as in the verse: They even say, \"We have found our fathers in a religion, and we are guided in their footsteps.\" (az-Zukhruf \/ 43: 22 )",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa hati kaum musyrikin telah berpaling dan lalai dari memperhatikan petunjuk-petunjuk yang dibawa Al-Qur'an. Mereka tidak mau mengambil manfaat daripadanya. Padahal petunjuk-petunjuk itulah yang dapat membawa mereka kepada kebahagiaan hidup di dunia dan akhirat. Seandainya mereka mau membaca dan memperhatikan Al-Qur'an tentulah hati mereka akan terbuka dan melihat bahwa ajaran Al-Qur'an itu memang amat berguna dan semua yang terkandung di dalamnya adalah benar. Mereka akan mengakui bahwa semua perbuatan manusia akan dipertanggungjawabkan di hadapan Allah tanpa kecuali. Inilah kesalahan mereka yang pertama yang menyeret mereka kepada kesalahan-kesalahan lain dan menyebabkan mereka tidak mempedulikan lagi norma-norma akhlak yang mulia, berbuat sekehendak hati tanpa memperhatikan hak-hak orang-orang lain. Apa saja yang mereka inginkan mereka rebut walaupun dengan merampas dan menganiaya kaum lemah. Karena itu pula mereka telah tenggelam dalam kemusyrikan dan mata hati mereka telah buta tidak dapat lagi membedakan mana yang benar dan mana yang sesat, telinga mereka telah tuli, tidak dapat lagi mendengar ajaran agama. Hadis yang diriwayatkan Ibnu Masud, Nabi saw, bersabda:\n\n....Demi Zat yang tidak ada tuhan selain-Nya, sesungguhnya seseorang di antara kamu beramal amalan penghuni surga, sehingga antara dia dan surga hanya tinggal satu hasta saja. Namun dia sudah tercatat sebagai penghuni neraka, maka ia mengakhiri amalnya dengan dengan amalan penghuni neraka, sehingga ia masuk neraka. Dan sesungguhnya seseorang di antara kamu beramal amalan penghuni neraka, sehingga antara dia dengan neraka hanya tinggal satu hasta saja. Namun ia sudah tercatat sebagai penghuni surga, maka ia mengakhiri amalnya dengan amalan penghuni surga, sehingga ia masuk surga.\" (Riwayat Ahmad)\n\nMereka menganggap apa yang mereka warisi dari nenek moyang mereka sajalah yang benar. Menurut mereka Al-Qur'an itu hanya dongengan orang-orang dahulu yang dibawa oleh orang yang gila atau hanya gubahan seorang penyair atau ajaran yang diterima Muhammad dari ahli kitab. Apabila diberikan kepada mereka keterangan yang nyata tentang kebenaran Al-Qur'an yang tidak dapat dibantah sehingga mereka mengatakan, kami tak dapat menerimanya karena bertentangan dengan apa yang dianut dan dipercayai moyang kami, seperti tersebut dalam ayat:\n\nBahkan mereka berkata, \"Sesungguhnya kami mendapati nenek moyang kami menganut suatu agama, dan kami mendapat petunjuk untuk mengikuti jejak mereka.\" (az-Zukhruf\/43: 22)",
      "text_translation": "Tetapi, hati mereka (orang-orang kafir) itu dalam kesesatan dari (memahami Al-Qur'an) ini, dan mereka mempunyai (kebiasaan banyak mengerjakan) perbuatan-perbuatan lain (buruk) yang terus mereka kerjakan.",
      "text": "بَلْ قُلُوْبُهُمْ فِيْ غَمْرَةٍ مِّنْ هٰذَا وَلَهُمْ اَعْمَالٌ مِّنْ دُوْنِ ذٰلِكَ هُمْ لَهَا عَامِلُوْنَ",
      "text_translation_en": "NAY, [as for those who have torn asunder the unity of faith] - their hearts are lost in ignorance of all this! But apart from that [breach of unity] they have [on their conscience even worse] deeds; and they will [continue to] commit them",
      "juz_number": 18
    },
    "64": {
      "text_tafsir_en": "In this verse God explains that the unbelievers and all the disobedient and wicked will be tormented with painful torture. When they were surrounded by a terrible and terrible punishment in return for their disobedience and wickedness, they shouted for help and deeply regretted their bad fate, especially the leaders and rich people who had lived in the world with fun and enjoyable. But no one could help them at that time, because all their affairs and decisions were in the hands of God. Their regrets are useless because of the saying \"rice has become porridge,\" their guilt and guilt can never be forgiven. The Word of God: How many of the people before whom We had perished, they asked for help when (that time) was not the time to run away. (shad 38: 3)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa kaum musyrikin dan semua orang yang ingkar dan durhaka akan disiksa dengan siksaan yang pedih. Pada saat mereka telah dikepung oleh azab yang dahsyat dan mengerikan sebagai balasan atas keingkaran dan kedurhakaan mereka, mereka berteriak-teriak meminta tolong dan sangat menyesali nasib mereka yang buruk itu, terutama pemimpin-pemimpin dan orang-orang kaya mereka yang pernah hidup di dunia dengan senang dan penuh kenikmatan. Tetapi tidak ada yang dapat menolong mereka pada waktu itu, karena semua urusan dan keputusan berada di tangan Allah. Penyesalan mereka tiada berguna lagi karena ibarat pepatah \"nasi sudah menjadi bubur,\" kesalahan dan kedurhakaan mereka tak dapat diampuni lagi. Firman Allah:\n\nBetapa banyak umat sebelum mereka yang telah Kami binasakan, lalu mereka meminta tolong padahal (waktu itu) bukanlah saat untuk lari melepaskan diri. (shad\/38:3)",
      "text_translation": "Sehingga apabila Kami timpakan siksaan kepada orang-orang yang hidup bermewah-mewah di antara mereka, seketika itu mereka berteriak-teriak meminta tolong.",
      "text": "حَتّٰٓى اِذَآ اَخَذْنَا مُتْرَفِيْهِمْ بِالْعَذَابِ اِذَا هُمْ يَجْـَٔرُوْنَ ۗ",
      "text_translation_en": "until - after We shall have taken to task, through suffering, those from among them who [now] are lost in the pursuit of pleasures - they cry out in [belated] supplication.",
      "juz_number": 18
    },
    "65": {
      "text_tafsir_en": "Allah told them not to shout for help that day, for no good. It was a day of retribution for what they had done in the past. This is a definite decree from Allah that they must accept, that no one can help or liberate them from punishment and that they cannot escape it.",
      "text_tafsir": "Allah berfirman kepada mereka untuk tidak berteriak-teriak meminta tolong pada hari itu, karena tak ada gunanya. Hari itu adalah hari pembalasan terhadap apa yang mereka kerjakan di dunia dahulu. Inilah ketetapan yang sudah pasti dari Allah yang harus mereka terima, tak ada yang dapat menolong atau membebaskan mereka dari azab dan mereka tak dapat menghindarkan diri daripadanya.",
      "text_translation": "Janganlah kamu berteriak-teriak meminta tolong pada hari ini! Sungguh, kamu tidak akan mendapat pertolongan dari Kami.",
      "text": "لَا تَجْـَٔرُوا الْيَوْمَۖ اِنَّكُمْ مِّنَّا لَا تُنْصَرُوْنَ ",
      "text_translation_en": "[But they will be told:] “Cry not in supplication today: for, behold, you shall not he succoured by Us!",
      "juz_number": 18
    },
    "66": {
      "text_tafsir_en": "The next verse explains that when the world was read to them the verses of Allah by an apostle sent to them, but they rejected it, mocked and insulted it out of arrogance and arrogance, but the instructions and teachings it brought were true and very helpful for them to pay attention and listen. The Word of God: That is because you are disobedient when called upon to worship God alone. And if Allah be united, you believe. So the decision (for now) is on the Most High God, the Great. (al-Mumin \/ 40: 12)",
      "text_tafsir": "Ayat selanjutnya menjelaskan bahwa tatkala di dunia telah dibaca-kan kepada mereka ayat-ayat Allah oleh seorang rasul yang diutus kepada mereka, tetapi mereka mendustakannya, memperolok-olokkan dan menghinanya karena kesombongan dan kecongkakan, padahal petunjuk dan ajaran yang dibawanya adalah benar dan sangat bermanfaat bagi mereka kalau mereka mau memperhatikan dan mendengarkannya. Firman Allah:\n\nYang demikian itu karena sesungguhnya kamu mengingkari apabila diseru untuk menyembah Allah saja. Dan jika Allah dipersekutukan, kamu percaya. Maka keputusan (sekarang ini) adalah pada Allah Yang Mahatinggi, Mahabesar. (al-Mumin\/40: 12)",
      "text_translation": "Sesungguhnya ayat-ayat-Ku (Al-Qur'an) selalu dibacakan kepada kamu, tetapi kamu selalu berpaling ke belakang,",
      "text": "قَدْ كَانَتْ اٰيٰتِيْ تُتْلٰى عَلَيْكُمْ فَكُنْتُمْ عَلٰٓى اَعْقَابِكُمْ تَنْكِصُوْنَ ۙ",
      "text_translation_en": "Time and again were My messages conveyed unto you, but [every time] you would turn about on your heels",
      "juz_number": 18
    },
    "67": {
      "text_tafsir_en": "This verse explains that they rejected all the teachings of the Prophet Muhammad and considered themselves more noble than they were because they were the rulers, defenders, and guardians of the House. There is no one in this world who is more noble than them. They insulted and criticized the Prophet (saws) all the time during the night-time. They accused the Prophet of being a magician, a poet, a magician, and so forth. Their actions were not correct, because Muhammad was an apostle and Allah would remove the disbelievers from the land of evil for their crimes to the Messenger of Allah.",
      "text_tafsir": "Ayat ini menjelaskan bahwa mereka menolak semua ajaran yang dibawa Nabi Muhammad dan menganggap diri mereka lebih mulia daripada-nya karena mereka penguasa, pembela, dan penjaga Baitullah. Tidak ada seorang pun di dunia ini yang lebih mulia dari mereka. Mereka menggunjingkan dan mencela Nabi saw habis-habisan di waktu bersantai di malam hari. Mereka menuduh Nabi sebagai tukang sihir, penyair, tukang tenung, dan lain sebagainya. Tindakan mereka itu tidak benar, karena Muhammad seorang rasul dan Allah akan mengeluarkan orang kafir dari tanah haram karena kejahatan mereka kepada Rasulullah.",
      "text_translation": "dengan menyombongkan diri dan mengucapkan perkataan-perkataan keji terhadapnya (Al-Qur'an) pada waktu kamu bercakap-cakap pada malam hari.",
      "text": "مُسْتَكْبِرِيْنَۙ بِهٖ سٰمِرًا تَهْجُرُوْنَ ",
      "text_translation_en": "[and,] impelled by your arrogance, you would talk senselessly far into the night.”",
      "juz_number": 18
    },
    "68": {
      "text_tafsir_en": "In this verse God blasphemes the acts and words of those who are rude and unreasonable. Do they not pay attention to the verses of the Qur'an how beautiful and high the order of his words, when they have a great opportunity to observe it. There is nothing in the Qur'an that is weak, contradictory or something that undermines its literary value or degrades its meaning. Even the Qur'an contains real arguments and truths that cannot be denied, both in relation to the principles of good morals, and by the rules and regulations that can bring them to the highest degree when they wish to practice them. and obey it. Or do they consider the coming of Muhammad as an apostle something that has never happened to the people of the past, when they know the existence of the former apostles and how the fate of the people has rejected them, even though they themselves see the former ruins that the wicked people left behind.",
      "text_tafsir": "Pada ayat ini Allah mencerca perbuatan dan ucapan mereka yang tak sopan dan tak masuk akal itu. Apakah mereka tidak memperhatikan ayat-ayat Al-Qur'an bagaimana indah dan tinggi susunan kata-katanya, padahal mereka mempunyai kesempatan yang luas untuk memperhatikannya. Tidak terdapat di dalam Al-Qur'an itu kelemahan, pertentangan atau sesuatu yang mengurangi nilai sastranya atau merendahkan pengertian yang terdapat di dalamnya. Bahkan Al-Qur'an berisi dalil-dalil dan hujjah-hujjah yang nyata yang tidak dapat dibantah, baik yang terkait dengan dasar-dasar akhlak yang mulia, maupun dengan syariat dan peraturan yang dapat membawa mereka ke derajat yang paling tinggi bila mereka mau mengamalkan dan mematuhinya. Ataukah mereka menganggap kedatangan Muhammad sebagai rasul suatu hal yang mustahil yang belum pernah terjadi pada umat-umat yang terdahulu, padahal mereka mengetahui adanya rasul-rasul yang terdahulu itu dan bagaimana nasib umat-umat yang mengingkari mereka, bahkan mereka melihat sendiri bekas-bekas kehancuran yang ditinggalkan umat-umat yang durhaka itu.",
      "text_translation": "Maka tidakkah mereka menghayati firman (Allah), atau adakah telah datang kepada mereka apa yang tidak pernah datang kepada nenek moyang mereka terdahulu?",
      "text": "اَفَلَمْ يَدَّبَّرُوا الْقَوْلَ اَمْ جَاۤءَهُمْ مَّا لَمْ يَأْتِ اٰبَاۤءَهُمُ الْاَوَّلِيْنَ ۖ",
      "text_translation_en": "Have they, then, never tried to understand this word [of God]? Or has there [now] come to them something that never came to their forefathers of old?",
      "juz_number": 18
    },
    "69": {
      "text_tafsir_en": "This verse asks if they do not know who Muhammad is, their apostle and they deny it. In fact, they have known Muhammad since childhood, as a good man, most trusted among them, and a descendant of the Bani Hashim whom they respect and cherish, so that they themselves have nicknamed him al-Amin (the most trusted). Abu Sufyan as their head of emissaries to the Roman Emperor, when asked how Muhammad's attributes were, he replied that Muhammad was of noble lineage, known for his truthfulness and trust.",
      "text_tafsir": "Ayat ini mempertanyakan apakah mereka tidak mengenal siapa Muhammad, rasul mereka sehingga mereka mengingkarinya. Padahal, mereka mengenal Muhammad sejak kecil, sebagai orang yang baik budi pekerti, paling terpercaya di kalangan mereka, dan keturunan dari Bani Hasyim yang mereka hormati dan segani, sehingga mereka sendiri memberikan julukan terhadapnya dengan al-Amin (seorang yang paling dipercaya). Abu Sufyan sebagai kepala perutusan mereka kepada Kaisar Romawi, ketika ditanya bagaimana sifat-sifat Muhammad, dia menjawab Muhammad berasal dari keturunan keluarga yang mulia, terkenal dengan kebenaran ucapannya dan amanahnya.",
      "text_translation": "Ataukah mereka tidak mengenal Rasul mereka (Muhammad), karena itu mereka mengingkarinya?",
      "text": "اَمْ لَمْ يَعْرِفُوْا رَسُوْلَهُمْ فَهُمْ لَهٗ مُنْكِرُوْنَ ۖ",
      "text_translation_en": "Or is it, perchance, that they have not recog­nized their Apostle, and so they disavow him?",
      "juz_number": 18
    },
    "70": {
      "text_tafsir_en": "Further explanation says that they considered Muhammad saw as a lunatic who was unaware of all his words. In fact, they know for sure that Muhammad is not crazy, and admit that he is the smartest among them, a wise scholar. They had previously appointed him a judge who decided the matter between them, when they were arguing over who would put aswad in their place after the Kabah building was renovated and repaired. In this verse Allah emphasizes that Muhammad is the bearer of the truth of his God, not as they claimed. He urged them to abandon their worship and idolatry and return to the pure religion of their ancestor Abraham. He is a religious bearer with laws and rules for human happiness here and hereafter. But most of them hate the truth that he proclaims, because their hearts are covered with shirk, sin, and rebellion. Therefore, they turn from the right way, always go astray, and can no longer understand the truth, even when they hate it. Indeed, some of those who are aware of it and believe in it, admit in their hearts that the religion that Muhammad brought was a true and good religion, but for fear of being ridiculed by their disbelievers they would not believe as did the Prophet's uncle Abu Talib. He once said, \"If it were not for fear of being ridiculed by our leaders, we would have been truly his followers in everything.\"",
      "text_tafsir": "Penjelasan selanjutnya mengatakan bahwa mereka menganggap Muhammad saw sebagai orang gila yang tidak menyadari semua ucapannya. Sebetulnya, mereka tahu benar bahwa Muhammad tidak gila, dan mengakui bahwa dia adalah seorang yang paling cerdas di antara mereka, seorang cendekiawan yang bijaksana. Mereka sendiri pernah mengangkatnya sebagai hakim yang memutuskan perkara di antara mereka, ketika berselisih tentang siapa yang akan meletakkan hajar aswad di tempatnya semula setelah bangunan Kabah dirombak dan diperbaiki.\n\nPada ayat ini Allah menegaskan bahwa Muhammad adalah pembawa kebenaran dari Tuhannya, bukan seperti yang mereka tuduhkan. Dia mengajak mereka supaya meninggalkan berbagai sembahan dan berhala serta kembali kepada agama tauhid yang murni, agama nenek moyang mereka Nabi Ibrahim. Dia adalah pembawa agama yang mempunyai syariat dan peraturan untuk kebahagiaan manusia di dunia dan di akhirat. Tetapi kebanyakan mereka benci kepada kebenaran yang dia serukan, karena hati mereka telah tertutup oleh syirik, dosa, dan kedurhakaan. Oleh sebab itu, mereka berpaling dari jalan yang benar, selalu menempuh jalan yang sesat, dan tak dapat lagi memahami kebenaran, bahkan mereka membencinya. Memang ada di antara mereka yang sadar dan insaf, mengakui dalam hatinya bahwa agama yang dibawa Muhammad itu adalah agama yang benar dan baik, tetapi karena takut dicemooh kaumnya yang kafir mereka tidak mau beriman seperti halnya paman Nabi sendiri yaitu Abu Talib. Ia pernah mengatakan, \"Kalau tidak karena takut akan dicerca oleh pemimpin-pemimpin kabilah kami, tentulah kami benar-benar telah menjadi pengikutnya dalam segala hal.\"",
      "text_translation": "Atau mereka berkata, “Orang itu (Muhammad) gila.” Padahal, dia telah datang membawa kebenaran kepada mereka, tetapi kebanyakan mereka membenci kebenaran. ",
      "text": "اَمْ يَقُوْلُوْنَ بِهٖ جِنَّةٌ ۗ بَلْ جَاۤءَهُمْ بِالْحَقِّ وَاَكْثَرُهُمْ لِلْحَقِّ كٰرِهُوْنَ ",
      "text_translation_en": "Or do they say. “There is madness in him”? Nay, he has brought them the truth - and the truth do most of them detest!",
      "juz_number": 18
    },
    "71": {
      "text_tafsir_en": "God then explained that if the Qur'an followed the will of those who rejected Allah and His Messenger, who despised Allah and said that He had a son, and justified all sin and rebellion, then the world would perish as it had it says in His Word: If there were both (in heaven and on earth) gods other than Allah, they would have perished. The holiness of Allah having 'the Fire, of what they attribute.' If the Qur'an allows for the violation of rights, the confiscation of property so that the weak become a soft meal for the strong, then the world will never be safe and secure. This has been proven in themselves. Almost all Arabs in the time of ignorance were destroyed, for they had no moral standards, no rules and regulations they obeyed. They only brag about their wealth and strength so as to fight it they fall into the abyss of strife and endless war. Allah again explained that He had given them something that they should be proud of, the Qur'an. Why do they turn their backs on him, reject, despise, and ridicule him? If they were aware and wished they would not have done so. It is evident later that the Qur'an made them a noble nation and they were proud that the Qur'an first came down to them and used their language, according to the word of Allah: And indeed, the Qur'an is true, it is a warning for you and your people, and you will be asked for some responsibility. (az-Zukhruf \/ 43: 44)",
      "text_tafsir": "Kemudian Allah menjelaskan bahwa kalau Al-Qur'an mengikuti kemauan orang-orang yang mendustakan Allah dan Rasul-Nya, yang menye-kutukan Allah dan mengatakan bahwa Dia mempunyai anak, serta membenarkan segala perbuatan dosa dan munkar, tentulah dunia ini akan rusak binasa sebagaimana tersebut dalam firman-Nya:\n\nSeandainya pada keduanya (di langit dan di bumi) ada tuhan-tuhan selain Allah, tentu keduanya telah binasa. Mahasuci Allah yang memiliki 'Arsy, dari apa yang mereka sifatkan.(al-Anbiya'\/21: 22)\n\nKalau Al-Qur'an membolehkan perbuatan zalim, aniaya, dan mening-galkan keadilan tentu akan terjadi kekacauan dan keguncangan hebat dalam masyarakat. Kalau Al-Qur'an membolehkan pelanggaran hak, perampasan harta sehingga si lemah menjadi santapan yang empuk bagi si kuat, tentulah dunia ini tidak akan aman dan tenteram selama-lamanya. Hal ini telah terbukti pada diri mereka sendiri. Hampir saja masyarakat Arab pada masa Jahiliah rusak binasa, karena tidak mempunyai norma-norma akhlak yang mulia, tidak ada syariat dan peraturan yang mereka patuhi. Mereka hanya membangga-banggakan kekayaan dan kekuatan sehingga untuk memperebutkannya mereka jatuh dalam jurang perselisihan dan peperangan yang tidak habis-habisnya. \n\nAllah kembali menerangkan bahwa Dia telah mengaruniakan kepada mereka sesuatu yang seharusnya menjadi kebanggaan bagi mereka yaitu Al-Qur'an. Mengapa mereka berpaling daripadanya, menolak, menganggap hina, dan memperolok-olokkannya. Kalau mereka sadar dan insaf tentulah mereka tidak akan berbuat seperti itu. Padahal terbukti kemudian bahwa Al-Qur'an itu menjadikan mereka bangsa yang mulia dan mereka bangga karena Al-Qur'an turun pertama kali kepada mereka dan menggunakan bahasa mereka, sesuai dengan firman Allah:\n\nDan sungguh, Al-Qur'an itu benar-benar suatu peringatan bagimu dan bagi kaummu, dan kelak kamu akan diminta pertanggungjawaban. (az-Zukhruf\/43: 44)",
      "text_translation": "Dan seandainya kebenaran itu menuruti keinginan mereka, pasti binasalah langit dan bumi, dan semua yang ada di dalamnya. Bahkan Kami telah memberikan peringatan kepada mereka, tetapi mereka berpaling dari peringatan itu.",
      "text": "وَلَوِ اتَّبَعَ الْحَقُّ اَهْوَاۤءَهُمْ لَفَسَدَتِ السَّمٰوٰتُ وَالْاَرْضُ وَمَنْ فِيْهِنَّۗ بَلْ اَتَيْنٰهُمْ بِذِكْرِهِمْ فَهُمْ عَنْ ذِكْرِهِمْ مُّعْرِضُوْنَ ۗ",
      "text_translation_en": "But if the truth were in accord with their own likes and dislikes, the heavens and the earth would surely have fallen into ruin, and all that lives in them [would long ago have perished]! Nay, [in this divine writ] We have conveyed unto them all that they ought to bear in mind: and from this their reminder they [heedlessly] turn away!",
      "juz_number": 18
    },
    "72": {
      "text_tafsir_en": "In this verse Allah asks why they do not accept the teachings of the Qur'an when the Prophet Muhammad never asked them for service in delivering the teachings of the Qur'an. The Prophet Muhammad realized that the delivery of the brochure was an obligation that should be best served by his Lord. If there is any hope for it then it is none other than the will of God which by his will he will be happy and by the will of God he will receive a reward that will never be broken as it is in his word: Say (Muhammad), \" Whatever reward I ask you, it will be for you. My answer is only from God, and He knows all things. \" (Saba '\/ 34: 47)",
      "text_tafsir": "Pada ayat ini Allah mempertanyakan mengapa mereka tidak mau menerima ajaran-ajaran Al-Qur'an padahal Nabi Muhammad tidak pernah meminta kepada mereka imbalan jasa atas penyampaian ajaran Al-Qur'an. Nabi Muhammad menyadari bahwa penyampaian risalah itu adalah kewajiban yang harus dilaksanakan sebaik-baiknya atas perintah Tuhannya. Kalau ada sesuatu yang diharapkannya maka harapan itu tiada lain hanyalah keridaan Allah yang dengan keridaan-Nya ia akan berbahagia dan dengan keridaan Allah itu ia akan mendapat balasan karunia yang tidak akan putus-putusnya sebagaimana tersebut dalam firman-Nya:\n\nKatakanlah (Muhammad), \"Imbalan apa pun yang aku minta kepadamu, maka itu untuk kamu. Imbalanku hanyalah dari Allah, dan Dia Maha Mengetahui segala sesuatu.\" (Saba'\/34: 47)",
      "text_translation": "Atau engkau (Muhammad) meminta imbalan kepada mereka? Sedangkan imbalan dari Tuhanmu lebih baik, karena Dia pemberi rezeki yang terbaik.",
      "text": "اَمْ تَسْـَٔلُهُمْ خَرْجًا فَخَرَاجُ رَبِّكَ خَيْرٌ ۖوَّهُوَ خَيْرُ الرّٰزِقِيْنَ",
      "text_translation_en": "Or dost thou [O Muhammad] ask of them any worldly recompense? But [they ought to know that] recompense from thy Sustainer is best, since He is the best of providers!",
      "juz_number": 18
    },
    "73": {
      "text_tafsir_en": "Then in this verse Allah assures the Prophet Muhammad that he was indeed an apostle who called upon his people in a straight path that led them to the happiness of the world and the Hereafter. Allah urged Muhammad not to be influenced by the words of those disbelievers who insulted him. All their words were mere lies that came out of their mouths out of envy and hurt.",
      "text_tafsir": "Kemudian pada ayat ini Allah meyakinkan Nabi Muhammad saw bahwa dia benar-benar seorang rasul yang menyeru kaumnya kepada jalan yang lurus yang membawa mereka kepada kebahagiaan dunia dan akhirat. Allah menghimbau Muhammad agar tidak terpengaruh dengan kata-kata orang-orang kafir itu yang menghina dan mencemoohkannya. Semua ucapan-ucapan mereka itu adalah bohong belaka yang keluar dari mulut mereka karena dengki dan sakit hati.",
      "text_translation": "Dan sesungguhnya engkau pasti telah menyeru mereka kepada jalan yang lurus.",
      "text": "وَاِنَّكَ لَتَدْعُوْهُمْ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ ",
      "text_translation_en": "And, verily, thou callest them onto a straight way –",
      "juz_number": 18
    },
    "74": {
      "text_tafsir_en": "God emphasizes in this verse that those who do not believe and do not believe in the Hereafter, have indeed deviated from the right path. To them has been given a variety of reasons and explanations. If they would listen and think about it, they would realize and return to the truth. But their hearts and minds were covered with the pride, arrogance and sinfulness of their sins. They have no right to the mercy and love of God because all good works are of no use to such persons.",
      "text_tafsir": "Allah menegaskan dalam ayat ini bahwa orang-orang yang tidak mau beriman itu dan tidak percaya kepada hari akhirat, benar-benar telah menyimpang dari jalan yang benar. Kepada mereka telah diberikan berbagai alasan dan perumpamaan yang jelas. Seandainya mereka mau mendengarkan dan memikirkannya tentulah mereka akan sadar dan kembali kepada kebenaran. Tetapi hati dan pikiran mereka telah ditutupi oleh kesombongan, kedurhakaan dan perbuatan dosa yang selalu mereka lakukan. Mereka tidak berhak sama sekali atas rahmat dan kasih sayang Allah karena semua perbuatan baik tidak ada gunanya sama sekali buat orang-orang yang bersifat demikian.",
      "text_translation": "Dan sesungguhnya orang-orang yang tidak beriman kepada akhirat benar-benar telah menyimpang jauh dari jalan (yang lurus).",
      "text": "وَاِنَّ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ عَنِ الصِّرَاطِ لَنَاكِبُوْنَ ",
      "text_translation_en": "but, behold, those who will not believe in the life to come are bound to deviate from that way.",
      "juz_number": 18
    },
    "75": {
      "text_tafsir_en": "This verse says that even if God had mercy on them and removed the threatening danger, they would not have been grateful for it, but they would have been wicked and would have committed iniquity and iniquity. There is not one good thing that can be expected from them. In fact, as the Qur'an explains, in the hereafter after seeing the terrible torment that will be inflicted on them, then their request to return to the world is granted to correct their wrongdoing, but they will continue to commit evil and will remain human. disobedient and wicked. Allah says in another verse: And if you (Muhammad) saw them when they were brought to hell, they would say, \"If we had been returned (to the world) we would not have rejected our Lord's revelations, and would have been believers.\" But (in fact) they had already discovered the evil they had hidden before. If they were returned to the world, they would have to repeat what they were forbidden to do. They are really liars. (al-An'am \/ 6: 27-28)",
      "text_tafsir": "Ayat ini mengatakan bahwa walaupun Allah memberi rahmat kepada mereka dan menyingkirkan bahaya yang mengancam, mereka tetap tidak akan mensyukuri rahmat itu, bahkan mereka akan bertambah durhaka dan tetap akan melakukan maksiat dan kezaliman. Tidak ada satu kebaikan pun yang dapat diharapkan dari mereka. Bahkan, sebagaimana dijelaskan Al-Qur'an, di akhirat nanti setelah melihat dahsyatnya siksaan yang akan ditimpakan kepada diri mereka, kemudian permintaan mereka untuk dikembalikan ke dunia dikabulkan guna memperbaiki kesalahan mereka, namun mereka akan tetap juga melakukan maksiat dan akan tetap juga menjadi orang-orang yang ingkar dan durhaka. Allah berfirman pada ayat lain:\n\nDan seandainya engkau (Muhammad) melihat ketika mereka dihadapkan ke neraka, mereka berkata, \"Seandainya kami dikembalikan (ke dunia) tentu kami tidak akan mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman.\" Tetapi (sebenarnya) bagi mereka telah nyata kejahatan yang mereka sembunyikan dahulu. Seandainya mereka dikembalikan ke dunia, tentu mereka akan mengulang kembali apa yang telah dilarang mengerjakannya. Mereka itu sungguh pendusta. (al-An'am\/6: 27-28)",
      "text_translation": "Dan seandainya mereka Kami kasihani, dan Kami lenyapkan malapetaka yang menimpa mereka, pasti mereka akan terus-menerus terombang-ambing dalam kesesatan mereka.",
      "text": "۞ وَلَوْ رَحِمْنٰهُمْ وَكَشَفْنَا مَا بِهِمْ مِّنْ ضُرٍّ لَّلَجُّوْا فِيْ طُغْيَانِهِمْ يَعْمَهُوْنَ",
      "text_translation_en": "And even were We to show them mercy and remove whatever distress might befall them [in this life], they would still persist in their overweening arrogance, blindly stumbling to and fro.",
      "juz_number": 18
    },
    "76": {
      "text_tafsir_en": "God inflicted punishment on them in the Battle of Badr until many of their leaders and leaders were killed but they did not obey God and did not obey his teachings. They did not want to humble themselves to him, but they were arrogant and arrogant and never stopped doing wrong and doing wrong. They became more and more vicious in the fight against the religion of Allah until they prepared more and more powerful armies and weapons to fight the Prophet. Allah says: But why do they not plead (with Allah) with humility when our torment comes to them? Even their hearts are hardened and the devil makes them feel good about what they always do. (al-Anam \/ 6: 43)",
      "text_tafsir": "Allah telah menimpakan azab kepada mereka pada Perang Badar sehingga banyak pemimpin dan pembesar mereka yang mati terbunuh tetapi mereka tak pernah tunduk kepada Allah dan tak pernah patuh mengikuti ajaran dan perintah-Nya. Mereka tidak pernah mau berendah hati kepada-Nya, bahkan tetap sombong dan takabur dan tidak pernah berhenti melakukan kezaliman dan perbuatan dosa. Mereka bertambah sesat dan bertambah giat memerangi agama Allah sehingga mereka menyiapkan tentara dan alat-alat perang yang lebih banyak dan lebih besar lagi untuk memerangi Rasulullah. Allah berfirman:\n\nTetapi mengapa mereka tidak memohon (kepada Allah) dengan kerendahan hati ketika siksaan Kami datang menimpa mereka? Bahkan hati mereka telah menjadi keras dan setan pun menjadikan terasa indah bagi mereka apa yang selalu mereka kerjakan. (al-Anam\/6:43)",
      "text_translation": "Dan sungguh Kami telah menimpakan siksaan kepada mereka, tetapi mereka tidak mau tunduk kepada Tuhannya, dan (juga) tidak merendahkan diri.",
      "text": "وَلَقَدْ اَخَذْنٰهُمْ بِالْعَذَابِ فَمَا اسْتَكَانُوْا لِرَبِّهِمْ وَمَا يَتَضَرَّعُوْنَ",
      "text_translation_en": "And, indeed, We tested them through suffer­ing, but they did not abase themselves before their Sustainer; and they will never humble them­selves",
      "juz_number": 18
    },
    "77": {
      "text_tafsir_en": "In fact, those who have strayed so far from the right path will not realize and understand unless the Day of Judgment arrives, and they will be opened to them a grievous door. It was then that they regretted and hoped for forgiveness from God, but that was not the time to repent. Their regrets are pointless and their remorse will not be accepted. They must be cast into hell in retribution for their disobedience and wickedness in the world as it says in the word of God: This is because you delight in the earth (without) knowing the truth and because you always rejoice (in transgression). (It is said to them), \"Enter ye into the gates of hell, and abide therein, and it is the worst of the proud.\" (al-Mu'min \/ 40: 75-76)",
      "text_tafsir": "Sebenarnya mereka yang telah jauh tersesat dari jalan yang benar itu tidak akan sadar dan insaf kecuali bila datang hari Kiamat, dan dibukakan untuk mereka pintu siksaan yang berat. Pada waktu itulah baru mereka menyesal dan mengharapkan ampunan dari Allah, tetapi saat itu bukanlah saat untuk bertobat. Penyesalan mereka tak ada gunanya lagi dan tobat mereka pun tidak akan diterima. Mereka pasti dijerumuskan ke dalam neraka sebagai balasan atas keingkaran dan kedurhakaan mereka di dunia sebagaimana tersebut dalam firman Allah:\n\nYang demikian itu disebabkan karena kamu bersuka ria di bumi (tanpa) mengindahkan kebenaran dan karena kamu selalu bersuka ria (dalam kemaksiatan). (Dikatakan kepada mereka), \"Masuklah kamu ke pintu-pintu neraka Jahanam, dan kamu kekal di dalamnya. Maka itulah seburuk-buruk tempat bagi orang-orang yang sombong.\" (al-Mu'min\/40: 75-76)",
      "text_translation": "Sehingga apabila Kami bukakan untuk mereka pintu azab yang sangat keras, seketika itu mereka menjadi putus asa.",
      "text": "حَتّٰٓى اِذَا فَتَحْنَا عَلَيْهِمْ بَابًا ذَا عَذَابٍ شَدِيْدٍ اِذَا هُمْ فِيْهِ مُبْلِسُوْنَ ࣖ ",
      "text_translation_en": "until We open before them a gate of [truly] severe suffering [in the life to come]: and then, lo! they will be broken in spirit.",
      "juz_number": 18
    },
    "78": {
      "text_tafsir_en": "This verse explains that God has given people hearing, vision and conscience. If a man were to observe and contemplate the gift of God, he would have to acknowledge the greatness of the marvelous gift of God, how meticulous and refined his creation was. The seemingly simple ear can capture a wide variety of sounds. The sounds of animals, birds, the sounds of the environment such as the sound of the wind, the sound of thunder and the variety of sounds produced by human civilization such as the sound of vehicles and machines, the sound of flowing music, and the melodious sound. The ear can distinguish the sound one by one so that the person can determine what he or she is listening to. The eye can capture the light and shape of things, can distinguish many colors, see the beauty of nature, can investigate what is useful and what is dangerous. Then the heart can sense and appreciate all kinds of feelings, examine each incident, and draw conclusions from it to determine its attitude. If human beings actually used the three favors they would have benefited greatly and they would have come to the conclusion that the giver and gift is the Infinite of His knowledge. Powerful in all things, He is to be praised and praised for His gifts. But it turns out that very few people reach that degree. As Allah has said: And verily, We have established their position (with prosperity and strength) which We have never given you, and We have given them hearing, sight and heart; but their hearing, their eyes and their hearts were of no use to them, for they (always) disobeyed Allah's revelations and (the threat) of their past scorn had besieged them. (al-Ahqaf \/ 46: 26) Allah explained to the Prophet Muhammad the attitude of most people who do not want to thank him, as it says in his Word: And most people will not believe even when you want it so much. (Joseph \/ 12: 103)",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah telah mengaruniakan kepada manusia pendengaran, pengelihatan dan hati nurani. Sekiranya manusia mau memperhatikan dan memikirkan karunia Allah tersebut, niscaya dia akan mengakui betapa besarnya nikmat Allah yang amat ajaib itu, betapa teliti dan halusnya ciptaan-Nya. Telinga yang tampak amat sederhana bentuknya dapat menangkap berbagai macam suara yang berbeda-beda. Suara binatang, burung-burung, suara yang terjadi pada alam sekitar seperti suara angin yang menderu, suara petir yang mengguntur dan beraneka ragam suara yang ditimbulkan oleh peradaban manusia seperti suara kendaraan dan mesin-mesin, suara musik yang mengalun, dan suara yang merdu. Telinga dapat membedakan suara itu satu per satu sehingga manusia dapat menentukan sikap terhadap apa yang didengarnya. Mata dapat menangkap cahaya dan bentuk sesuatu, dapat membedakan berbagai macam warna, dapat melihat keindahan alam, dapat menyelidiki mana yang bermanfaat dan mana yang berbahaya. Kemudian hati yang dapat merasakan dan menghayati berbagai macam perasaan, meneliti setiap kejadian, dan mengambil kesimpulan darinya untuk menentukan sikap terhadapnya. Kalau manusia benar-benar mempergunakan ketiga nikmat itu sebaik-baiknya tentulah dia akan mendapat manfaat yang banyak sekali dan akhirnya mereka sampai kepada kesimpulan bahwa pemberi nikmat dan karunia itu adalah Mahaluas ilmu-Nya. Mahakuasa atas segala sesuatu, Dia patut dipuji dan disyukuri atas segala anugerah-Nya itu. Tetapi ternyata sedikit sekali manusia yang sampai kepada derajat itu. Seperti yang difirmankan Allah:\n\nDan sungguh, Kami telah meneguhkan kedudukan mereka (dengan kemakmuran dan kekuatan) yang belum pernah Kami berikan kepada kamu dan Kami telah memberikan kepada mereka pendengaran, penglihatan dan hati; tetapi pendengaran, penglihatan dan hati mereka itu tidak berguna sedikit pun bagi mereka, karena mereka (selalu) mengingkari ayat-ayat Allah dan (ancaman) azab yang dahulu mereka perolok-olokkan telah mengepung mereka. (al-Ahqaf\/46: 26)\n\nAllah menjelaskan kepada Nabi Muhammad sikap kebanyakan manusia yang tidak mau bersyukur kepada-Nya, seperti tersebut dalam firman-Nya:\n\nDan kebanyakan manusia tidak akan beriman walaupun engkau sangat menginginkannya. (Yusuf\/12:103)",
      "text_translation": "Dan Dialah yang telah menciptakan bagimu pendengaran, penglihatan dan hati nurani, tetapi sedikit sekali kamu bersyukur.",
      "text": "وَهُوَ الَّذِيْٓ اَنْشَاَ لَكُمُ السَّمْعَ وَالْاَبْصَارَ وَالْاَفْـِٕدَةَۗ قَلِيْلًا مَّا تَشْكُرُوْنَ",
      "text_translation_en": "[O MEN! Pay heed to God’s messages,] for it is He who has endowed you with hearing, and sight, and minds: [yet] how seldom are you grateful!",
      "juz_number": 18
    },
    "79": {
      "text_tafsir_en": "Among the gifts of God to man is the creation of man perfectly, equipped with hearing, vision and eyes and other potentials so that he can take advantage of all that God has created on earth and in heaven that God has created for man as mentioned in his word: It is He who created everything on earth for you. (al-Baqarah \/ 2:29) And He says: Do you not see that God has subdued what is in heaven and what is in the earth for (your) interests and perfected His favor for you to be born and inward? (Luqman \/ 31: 20) He created man with his senses, his potential and his will and his conscience so that he could truly become a caliph on earth. There is no creature on earth that is more perfect in its creation than man in his word: Indeed, We have created man in the best possible way, (at-Tin \/ 95: 4) With that privilege man should be grateful to his Creator make good use of his gift, practice and work for the benefit of the world and the hereafter. Because later God will gather all mankind in the field of Mahsyar to receive the calculation of his deeds for the rest of his life.",
      "text_tafsir": "Di antara karunia Allah kepada manusia ialah menciptakan manusia dengan sempurna, dibekali dengan pendengaran, penglihatan dan mata hati dan potensi lainnya sehingga dia dapat memanfaatkan semua yang diciptakan Allah di bumi dan di langit yang memang diciptakan oleh Allah untuk manusia sebagai tersebut dalam firman-Nya:\n\nDialah (Allah) yang menciptakan segala apa yang ada di bumi untukmu. (al- Baqarah\/2: 29)\n\nDan firman-Nya:\n\nTidakkah kamu memperhatikan bahwa Allah telah menundukkan apa yang ada di langit dan apa yang ada di bumi untuk (kepentingan)mu dan menyempurnakan nikmat-Nya untukmu lahir dan batin. (Luqman\/31: 20)\n\nDia menciptakan manusia lengkap dengan indera, potensi dan kecenderungan serta hati nurani agar dia benar-benar bisa menjadi khalifah di bumi. Tak ada makhluk di bumi ini yang lebih sempurna penciptaannya daripada manusia seperti tersebut dalam firman-Nya:\n\nSungguh, Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya, (at-Tin\/95: 4)\n\nDengan keistimewaan itu manusia harus bersyukur kepada Penciptanya dengan memanfaatkan karunianya itu dengan sebaik-baiknya, beramal dan bekerja untuk kemaslahatan dunia dan akhiratnya. Karena nanti Allah akan mengumpulkan manusia seluruhnya di padang Mahsyar untuk menerima perhitungan amal perbuatannya selama hidup di dunia.",
      "text_translation": "Dan Dialah yang menciptakan dan mengembangbiakkan kamu di bumi dan kepada-Nyalah kamu akan dikumpulkan.",
      "text": "وَهُوَ الَّذِيْ ذَرَاَكُمْ فِى الْاَرْضِ وَاِلَيْهِ تُحْشَرُوْنَ",
      "text_translation_en": "And He it is who has caused you to multiply on earth; and unto Him you shall be gathered.",
      "juz_number": 18
    },
    "80": {
      "text_tafsir_en": "Among God's gifts is life and death, humans will not be able to enjoy the life of the world if God does not grant the spirit to him. With the spirit in his body, then humans can strive, endeavor and think to achieve what they want and aspire to. No one knows the secret of this life and death except Allah. For centuries and even thousands of years humans have tried to find out the secret of this spirit so that he can live forever, but until now no scientist has been able to reveal that secret. Because the matter of the spirit is a mysterious secret that is not known except by Allah as mentioned in His word: And they ask you (Muhammad) about the spirit. Say, \"That spirit belongs to my Lord, whereas you are given little knowledge.\" (al-Isra '\/ 17: 85) Then it was He who made the alternation between night and day. Night is used as a time for rest and afternoon is used as time to try and work. It can be imagined how this world would become if there were only daytime, and vice versa. Maybe this world and all the creatures that are on it will burn to death because it is always overwritten by a very hot sun or maybe this world will die with all its contents if there is only night all the time, because no sun is the source of energy and is the cause living things in this world. God rebukes human attitudes and actions that do not want to remember how great His gifts are to them. Why don't they think and pay attention to it, so that they are grateful and thank Him for all His favors and gifts?",
      "text_tafsir": "Di antara karunia Allah ialah menghidupkan dan mematikan, manusia tidak akan dapat menikmati kehidupan dunia kalau Allah tidak mengaruniakan roh kepadanya. Dengan adanya roh di dalam jasadnya barulah manusia dapat berusaha, berikhtiar dan berpikir untuk mencapai apa yang diinginkan dan dicita-citakannya. Tidak ada yang mengetahui rahasia hidup mati ini kecuali Allah. Telah berabad-abad bahkan beribu tahun manusia berusaha untuk mengetahui rahasia roh ini agar dia dapat hidup selamanya, tetapi sampai sekarang tidak ada seorang ilmuwan pun yang sanggup mengungkap rahasia itu. Karena soal roh itu adalah rahasia yang gaib yang tidak diketahui kecuali oleh Allah sebagai tersebut dalam firman-Nya:\n\nDan mereka bertanya kepadamu (Muhammad) tentang roh. Katakanlah, \"Roh itu termasuk urusan Tuhanku, sedangkan kamu diberi pengetahuan hanya sedikit.\" (al-Isra'\/17: 85)\n\nSelanjutnya Dialah yang menjadikan pergantian antara malam dan siang. Malam dijadikan waktu untuk istirahat dan siang dijadikan waktu untuk berusaha dan bekerja. Dapat dibayangkan bagaimana jadinya dunia ini kalau yang ada hanya siang saja, demikian pula sebaliknya. Mungkin dunia ini dan segala makhluk yang ada di atasnya akan mati terbakar karena selalu ditimpa terik matahari yang amat panas atau mungkin dunia ini akan mati dengan segala isinya kalau yang ada hanya malam saja sepanjang waktu, karena tidak ada matahari yang menjadi sumber energi dan menjadi sebab hidupnya makhluk di dunia ini. Allah menegur sikap dan tindakan manusia yang tidak mau mengingat betapa besar karunia-Nya kepada mereka. Mengapa mereka tidak memikirkan dan memperhatikannya, agar mereka bersyukur dan berterima kasih kepada-Nya atas segala nikmat dan karunia-Nya itu?",
      "text_translation": "Dan Dialah yang menghidupkan dan mematikan, dan Dialah yang (mengatur) pergantian malam dan siang. Tidakkah kamu mengerti?",
      "text": "وَهُوَ الَّذِيْ يُحْيٖ وَيُمِيْتُ وَلَهُ اخْتِلَافُ الَّيْلِ وَالنَّهَارِۗ اَفَلَا تَعْقِلُوْنَ",
      "text_translation_en": "And He it is who grants life and deals death; and to Him is due the alternation of night and day. Will you not, then, use your reason?",
      "juz_number": 18
    },
    "81": {
      "text_tafsir_en": "In this verse God explains the disbelief of the Meccans so that they repeat what the unbelievers once said as if their eyes were blind, their ears were deaf and their hearts were locked to death to observe and ponder the arguments which was given by the Prophet Muhammad, whom they could no longer protest. They say that the day of resurrection is just a nonsense that Muhammad and his apostles used to make. In ancient times there have been prophets and apostles who spoke the same words that Muhammad spoke, but in fact until now there has been such a long time of Judgment Day and the day of resurrection has not yet come. God described their fathers' words of the Day of Resurrection with His word: \"This is what was promised to us and to our fathers, that it is the story of the former!\" (Al-Mu'minun \/ 23: 83",
      "text_tafsir": "Pada ayat ini Allah menerangkan keingkaran orang-orang kafir Mekah itu sehingga mereka mengulang kembali apa yang diucapkan oleh orang-orang kafir dahulu seakan-akan mata mereka telah buta, telinga mereka telah tuli dan hati mereka telah terkunci mati untuk memperhatikan dan memikirkan dalil-dalil yang dikemukakan oleh Nabi Muhammad saw, yang tidak dapat mereka bantah lagi. Mereka mengatakan bahwa hari kebangkitan itu hanyalah omong kosong belaka yang selalu diada-adakan oleh Nabi Muhammad dan para rasul sebelumnya. Semenjak dahulu kala telah ada nabi-nabi dan rasul-rasul yang mengucapkan kata-kata seperti yang diucapkan Muhammad, tetapi nyatanya sampai sekarang telah berlalu masa yang demikian panjang hari Kiamat dan hari kebangkitan itu belum juga datang. \n\nAllah menggambarkan ucapan nenek moyang mereka tentang hari kebangkitan dengan firman-Nya:\n\nSungguh, yang demikian ini sudah dijanjikan kepada kami dan kepada nenek moyang kami dahulu, ini hanyalah dongeng orang-orang terdahulu!\" (al-Mu'minun\/23: 83",
      "text_translation": "Bahkan mereka mengucapkan perkataan yang serupa dengan apa yang diucapkan oleh orang-orang terdahulu.",
      "text": "بَلْ قَالُوْا مِثْلَ مَا قَالَ الْاَوَّلُوْنَ",
      "text_translation_en": "But nay, they speak as the people of olden times did speak:",
      "juz_number": 18
    },
    "82": {
      "text_tafsir_en": "In this verse Allah explains how they repeated the words of their ancestors first. If they are dead and the bones are crushed to the ground, will they be raised again? According to them, this is an impossible and impossible thing to happen, because until now none of their ancestors who have died and become the land can live again. Their words are very wrong.",
      "text_tafsir": "Dalam ayat ini Allah menjelaskan bagaimana mereka mengulang-ulang ucapan nenek moyang mereka dahulu. Jika mereka sudah mati dan tulang belulang hancur luluh menjadi tanah, apakah mereka akan dibangkitkan kembali? Menurut mereka, ini adalah suatu hal yang mustahil dan tak mungkin terjadi, karena sampai sekarang belum ada seorang pun nenek moyang mereka yang telah mati dan menjadi tanah itu dapat hidup kembali. Ucapan mereka ini sangat keliru.",
      "text_translation": "Mereka berkata, “Apakah betul, apabila kami telah mati dan telah menjadi tanah dan tulang belulang, kami benar-benar akan dibangkitkan kembali?  ",
      "text": "قَالُوْٓا ءَاِذَا مِتْنَا وَكُنَّا تُرَابًا وَّعِظَامًا ءَاِنَّا لَمَبْعُوْثُوْنَ",
      "text_translation_en": "they say: “What! After we have died and become mere dust and bones, shall we, forsooth, be raised from the dead?",
      "juz_number": 18
    },
    "83": {
      "text_tafsir_en": "This verse explains how the disbelievers insulted and ridiculed Muhammad by saying that they had been promised no truth at all as to their forefathers who had been promised such Muhammadan promises, but none the promise of the preceding apostles. How can they believe and accept only those crazy Muhammad's words that have no evidence at all and maybe those words are just old tales. In other verses there is an explanation of their utterances and their objections and rejection of those words as the word of God says: \"Are we really to be brought back to life again? also) when we become broken bones? \" They say, \"If so, it's a bad return.\" So the return is just one blow. And then they are living again on the (new) earth. (an-Nazi'at \/ 79: 10-14) And his word: And he made us a simile, and forgot the origin of it; he said, \"Who can revive the bones, which have perished?\" Say (Muhammad), \"He who gives life to him first created it, and He is the All-Knowing of all beings.\" (Yasin \/ 36: 78-79) And He says: Has He promised you that if you had die and become soil and bones, indeed will you be removed (from your grave)? Far away (far from) what is threatened with you, (life) is nothing but our life in this world, (where) we die. He lives and will not be resurrected, but he is a man who lied to Allah, and we will not believe it (al-Mu'minun \/ 23: 35-38)",
      "text_tafsir": "Ayat ini menjelaskan bagaimana orang-orang kafir itu menghina dan memperolok-olokkan Muhammad dengan mengatakan bahwa mereka sudah diberi janji yang tidak ada kebenarannya sama sekali sebagaimana kepada nenek moyang mereka yang telah dijanjikan seperti janji-janji Muhammad ini, tetapi tak ada satu pun janji-janji para rasul yang terdahulu itu yang telah terbukti. Bagaimana mereka akan percaya dan menerima saja ucapan-ucapan Muhammad yang telah gila itu yang tak ada buktinya sama sekali dan mungkin ucapan-ucapannya itu hanya dongengan orang dahulu kala. Pada ayat-ayat lain terdapat penjelasan mengenai ucapan-ucapan mereka beserta bantahan dan penolakan terhadap ucapan-ucapan itu seperti firman Allah:\n\n(Orang-orang kafir) berkata, \"Apakah kita benar-benar akan dikembalikan kepada kehidupan yang semula? Apakah (akan dibangkitkan juga) apabila kita telah menjadi tulang belulang yang hancur?\" Mereka berkata, \"Kalau demikian, itu adalah suatu pengembalian yang merugikan.\" Maka pengembalian itu hanyalah dengan sekali tiupan saja. Maka seketika itu mereka hidup kembali di bumi (yang baru). (an-Nazi'at\/79: 10-14)\n\nDan firman-Nya:\n\nDan dia membuat perumpamaan bagi Kami dan melupakan asal kejadiannya; dia berkata, \"Siapakah yang dapat menghidupkan tulang-belulang, yang telah hancur luluh?\" Katakanlah (Muhammad), \"Yang akan menghidupkannya ialah (Allah) yang menciptakannya pertama kali. Dan Dia Maha Mengetahui tentang segala makhluk. (Yasin\/36: 78-79)\n\nDan firman-Nya:\n\nAdakah dia menjanjikan kepada kamu, bahwa apabila kamu telah mati dan menjadi tanah dan tulang belulang, sesungguhnya kamu akan dikeluarkan (dari kuburmu)? Jauh! Jauh sekali (dari kebenaran) apa yang diancamkan kepada kamu, (kehidupan itu) tidak lain hanyalah kehidupan kita di dunia ini, (di sanalah) kita mati dan hidup dan tidak akan dibangkitkan (lagi), Dia tidak lain hanyalah seorang laki-laki yang mengada-adakan kebohongan terhadap Allah, dan kita tidak akan mempercayainya. (al-Mu'minun\/23: 35-38)",
      "text_translation": "Sungguh, yang demikian ini sudah dijanjikan kepada kami dan kepada nenek moyang kami dahulu, ini hanyalah dongeng orang-orang terdahulu!”",
      "text": "لَقَدْ وُعِدْنَا نَحْنُ وَاٰبَاۤؤُنَا هٰذَا مِنْ قَبْلُ اِنْ هٰذَآ اِلَّآ اَسَاطِيْرُ الْاَوَّلِيْنَ ",
      "text_translation_en": "Indeed, this [very thing] we have been promised - we and our forefathers - long ago! This is nothing but fables of ancient times!”",
      "juz_number": 18
    },
    "84": {
      "text_tafsir_en": "In this verse Allah commands the Prophet Muhammad to ask the unbelievers who said that it is impossible for Allah the power to bring the dead back to life as their bones are crushed to the ground and it is impossible for Him to gather them back in the field of Mahsyar. Who has the earth and everything in it? Unbelievers are asked to answer this question. Basically they will answer that their owner and authority is God, and that is what their ancestors believed. Only they have strayed far from pure religion and their creed has been corrupted by false and misleading beliefs. Therefore, God asks them this question as if they did not know it or have forgotten it.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad saw supaya menanyakan kepada orang-orang kafir yang mengatakan bahwa tidak mungkin Allah kuasa menghidupkan kembali orang yang telah mati sedang tulang belulangnya telah remuk menjadi tanah dan tak mungkin Dia mengumpulkan mereka di padang Mahsyar nanti. Siapakah yang memiliki bumi dan segala yang ada padanya? Orang-orang kafir diminta untuk menjawab pertanyaan ini. Pada dasarnya mereka akan menjawab bahwa pemiliknya dan yang berkuasa atasnya ialah Allah, karena demikianlah kepercayaan nenek moyang mereka. Hanya mereka telah jauh menyimpang dari agama tauhid yang murni dan akidah mereka telah dikotori kepercayaan yang tidak benar dan menyesatkan. Oleh sebab itu, Allah mengemukakan pertanyaan ini kepada mereka seakan-akan mereka tidak mengetahuinya sama sekali atau telah melupakannya.",
      "text_translation": "Katakanlah (Muhammad), “Milik siapakah bumi, dan semua yang ada di dalamnya, jika kamu mengetahui?”",
      "text": "قُلْ لِّمَنِ الْاَرْضُ وَمَنْ فِيْهَآ اِنْ كُنْتُمْ تَعْلَمُوْنَ ",
      "text_translation_en": "Say: “Unto whom belongs the earth and all that lives there on? [Tell me this] if you happen to know [the answer]!”",
      "juz_number": 18
    },
    "85": {
      "text_tafsir_en": "In this verse Allah commands the Prophet Muhammad to ask the unbelievers who said that it is impossible for Allah the power to bring the dead back to life as their bones are crushed to the ground and it is impossible for Him to gather them back in the field of Mahsyar. Who has the earth and everything in it? Unbelievers are asked to answer this question. Basically they will answer that their owner and authority is God, and that is what their ancestors believed. Only they have strayed far from pure religion and their creed has been corrupted by false and misleading beliefs. Therefore, God asks them this question as if they did not know it or have forgotten it.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad saw supaya menanyakan kepada orang-orang kafir yang mengatakan bahwa tidak mungkin Allah kuasa menghidupkan kembali orang yang telah mati sedang tulang belulangnya telah remuk menjadi tanah dan tak mungkin Dia mengumpulkan mereka di padang Mahsyar nanti. Siapakah yang memiliki bumi dan segala yang ada padanya? Orang-orang kafir diminta untuk menjawab pertanyaan ini. Pada dasarnya mereka akan menjawab bahwa pemiliknya dan yang berkuasa atasnya ialah Allah, karena demikianlah kepercayaan nenek moyang mereka. Hanya mereka telah jauh menyimpang dari agama tauhid yang murni dan akidah mereka telah dikotori kepercayaan yang tidak benar dan menyesatkan. Oleh sebab itu, Allah mengemukakan pertanyaan ini kepada mereka seakan-akan mereka tidak mengetahuinya sama sekali atau telah melupakannya.",
      "text_translation": "Mereka akan menjawab, “Milik Allah.” Katakanlah, “Maka apakah kamu tidak ingat?”",
      "text": "سَيَقُوْلُوْنَ لِلّٰهِ ۗقُلْ اَفَلَا تَذَكَّرُوْنَ ",
      "text_translation_en": "[And they will reply: “Unto God.” Say: “Will you not, then, bethink yourselves [of Him]?”",
      "juz_number": 18
    },
    "86": {
      "text_tafsir_en": "Then Allah also ordered the Prophet Muhammad to ask them again, who created the seven heavens and who created the great ark covering the heavens and the earth as it says in his words: \"His seat covers the heavens and the earth.\" (al-Baqarah \/ 2: 255) Who controls and manages it so that everything is in accordance with such a careful and good rule. Allah directs the answer to this question as surely the answers of these infidels are that the creator is all Allah who has and controls it. There will be no answer to that other than that which is basically their belief. Not only did they acknowledge the power of God they worshiped idolatry and so on. Then Allah commanded the Prophet Muhammad to say to them, \"If it is true that Allah created the seven heavens and created the great power, and it is Allah who rules and governs it, why do you not obey Him and do not obey the teachings and commands \"Why do you keep worshiping idols, while worshiping other gods is very angry with Him?\"",
      "text_tafsir": "Kemudian Allah memerintahkan pula agar Nabi Muhammad saw menanyakan kembali kepada mereka, bahwa siapakah yang mencipta-kan langit yang tujuh dan yang menciptakan 'arsy yang besarnya meliputi langit dan bumi sebagaimana tersebut dalam firman-Nya:\n\n\"Kursi-Nya meliputi langit dan bumi.\" (al-Baqarah\/2: 255)\n\nSiapakah yang mengatur dan mengurusnya sehingga segalanya berjalan menurut aturan yang demikian teliti dan baik. Allah menetapkan langsung jawaban atas pertanyaan ini karena pastilah jawaban orang-orang kafir ini sama yaitu pencipta itu semua adalah Allah Yang memiliki dan menguasainya. Tidak akan ada jawaban mereka selain itu karena itulah pada dasarnya kepercayaan mereka. Hanya saja mereka di samping mengakui kekuasaan Allah mereka menyembah pula sembahan-sembahan seperti berhala dan sebagainya. Kemudian Allah memerintahkan kepada Nabi Muhammad agar mengatakan kepada mereka, \"Kalau benar Allah yang menciptakan langit yang tujuh dan menciptakan 'arsy yang mahabesar, dan Allah-lah yang mengatur dan mengurusnya, mengapa kamu tidak bertakwa kepada-Nya dan tidak mau mengikuti ajaran dan perintah-Nya? Kenapa kamu tetap saja menyembah berhala, sedang penyembahan selain Allah itu sangat dimurkai oleh-Nya?\"",
      "text_translation": "Katakanlah, “Siapakah Tuhan yang memiliki langit yang tujuh dan yang memiliki ‘Arsy yang agung?”",
      "text": "قُلْ مَنْ رَّبُّ السَّمٰوٰتِ السَّبْعِ وَرَبُّ الْعَرْشِ الْعَظِيْمِ",
      "text_translation_en": "Say: “Who is it that sustains the seven heavens and is enthroned in His awesome almightiness?”",
      "juz_number": 18
    },
    "87": {
      "text_tafsir_en": "Then Allah also ordered the Prophet Muhammad to ask them again, who created the seven heavens and who created the great ark covering the heavens and the earth as it says in his words: \"His seat covers the heavens and the earth.\" (al-Baqarah \/ 2: 255) Who controls and manages it so that everything is in accordance with such a careful and good rule. Allah directs the answer to this question as surely the answers of these infidels are that the creator is all Allah who has and controls it. There will be no answer to that other than that which is basically their belief. Not only did they acknowledge the power of God they worshiped idolatry and so on. Then Allah commanded the Prophet Muhammad to say to them, \"If it is true that Allah created the seven heavens and created the great power, and it is Allah who rules and governs it, why do you not obey Him and do not obey the teachings and commands \"Why do you keep worshiping idols, while worshiping other gods is very angry with Him?\"",
      "text_tafsir": "Kemudian Allah memerintahkan pula agar Nabi Muhammad saw menanyakan kembali kepada mereka, bahwa siapakah yang mencipta-kan langit yang tujuh dan yang menciptakan 'arsy yang besarnya meliputi langit dan bumi sebagaimana tersebut dalam firman-Nya:\n\n\"Kursi-Nya meliputi langit dan bumi.\" (al-Baqarah\/2: 255)\n\nSiapakah yang mengatur dan mengurusnya sehingga segalanya berjalan menurut aturan yang demikian teliti dan baik. Allah menetapkan langsung jawaban atas pertanyaan ini karena pastilah jawaban orang-orang kafir ini sama yaitu pencipta itu semua adalah Allah Yang memiliki dan menguasainya. Tidak akan ada jawaban mereka selain itu karena itulah pada dasarnya kepercayaan mereka. Hanya saja mereka di samping mengakui kekuasaan Allah mereka menyembah pula sembahan-sembahan seperti berhala dan sebagainya. Kemudian Allah memerintahkan kepada Nabi Muhammad agar mengatakan kepada mereka, \"Kalau benar Allah yang menciptakan langit yang tujuh dan menciptakan 'arsy yang mahabesar, dan Allah-lah yang mengatur dan mengurusnya, mengapa kamu tidak bertakwa kepada-Nya dan tidak mau mengikuti ajaran dan perintah-Nya? Kenapa kamu tetap saja menyembah berhala, sedang penyembahan selain Allah itu sangat dimurkai oleh-Nya?\"",
      "text_translation": "Mereka akan menjawab, “(Milik) Allah.” Katakanlah, “Maka mengapa kamu tidak bertakwa?”",
      "text": "سَيَقُوْلُوْنَ لِلّٰهِ ۗقُلْ اَفَلَا تَتَّقُوْنَ",
      "text_translation_en": "[And] they will reply: “[All this power belongs] to God.” Say: “Will you not, then, remain conscious of Him?”",
      "juz_number": 18
    },
    "88": {
      "text_tafsir_en": "Then Allah commanded Muhammad to ask them again, who controls everything and controls it. That which is in his hand is absolute power. When God protects a person, there is not a single power that can harm him or destroy him. On the other hand, when He intended to harm a person, there was not a single force that could protect that person. Who has such qualities as the Almighty, the Almighty? The Apostle asked the unbelievers to answer these questions if they really knew.",
      "text_tafsir": "Lalu Allah memerintahkan kepada Nabi Muhammad menanyakan pula kepada mereka, siapakah yang menguasai segala sesuatu dan mengaturnya. Yang di tangan-Nya terletak kekuasaan mutlak. Bila Allah melindungi seseorang, tak ada satu kekuasaan pun yang dapat menimpakan malapetaka atasnya atau membinasakannya. Sebaliknya bila Dia hendak menimpakan bahaya kepada seseorang tak ada pula satu kekuatan pun yang dapat melindungi orang itu. Siapakah yang mempunyai sifat demikian Yang Mahakuasa lagi Maha Perkasa? Rasul meminta orang-orang kafir itu menjawab pertanyaan-pertanyaan ini jika mereka benar-benar mengetahui.",
      "text_translation": "Katakanlah, “Siapakah yang di tangan-Nya berada kekuasaan segala sesuatu. Dia melindungi, dan tidak ada yang dapat dilindungi dari (azab-Nya), jika kamu mengetahui?”",
      "text": "قُلْ مَنْۢ بِيَدِهٖ مَلَكُوْتُ كُلِّ شَيْءٍ وَّهُوَ يُجِيْرُ وَلَا يُجَارُ عَلَيْهِ اِنْ كُنْتُمْ تَعْلَمُوْنَ ",
      "text_translation_en": "Say: “In whose hand rests the mighty dominion over all things, and who is it that protects, the while there is no protection against Him? [Tell me this] if you happen to know [the answer]!”",
      "juz_number": 18
    },
    "89": {
      "text_tafsir_en": "They will surely answer that such is the nature of God alone. Therefore, Allah made sure that they would answer that way and ordered the Prophet to ask them again. If they know that God is almighty and mighty, why are they deceived and turned away from the religion and are always opposed to God and evil to him? By worshiping idols or other things as if they had been possessed by magic and their minds could no longer believe so that their faith became a mess, mixing the right with the wrong, so that they would associate God with others. But Allah will not justify their actions even in anger.",
      "text_tafsir": "Mereka pasti akan menjawab bahwa yang demikian itu sifatnya adalah Allah semata. Oleh sebab itu, Allah memastikan bahwa mereka akan menjawab seperti itu dan memerintahkan kepada Nabi untuk menanyakan kembali kepada mereka. Kalau mereka mengetahui bahwa Allah Yang Mahakuasa dan Mahaperkasa, mengapa mereka sampai tertipu dan berpaling dari agama tauhid dan selalu menentang Allah dan durhaka kepada-Nya? Dengan menyembah berhala atau lainnya seakan-akan mereka telah kena sihir dan pikiran mereka tak dapat mempercayai lagi sehingga akidah mereka menjadi kacau balau, mencampur aduk yang benar dengan yang salah, sehingga mereka mempersekutukan Allah dengan lain-Nya. Padahal Allah tidak akan membenarkan tindakan mereka itu bahkan sangat murka.",
      "text_translation": "Mereka akan menjawab, “(Milik) Allah.” Katakanlah, “(Kalau demikian), maka bagaimana kamu sampai tertipu?”",
      "text": "سَيَقُوْلُوْنَ لِلّٰهِ ۗقُلْ فَاَنّٰى تُسْحَرُوْنَ",
      "text_translation_en": "[And] they will reply: “[All this power belongs] to God.” Say: ‘How, then, can you be so deluded?”",
      "juz_number": 18
    },
    "90": {
      "text_tafsir_en": "In this verse Allah confirms to the unbelievers that, because of all the questions they were asked about Allah as the Creator, Owner and Ruler of everything, they answered with the correct and positive answer, that the Qur'an passed down to the Prophet Muhammad repairing and straightening the creed of the deceased, is true and the accusations they make against Muhammad and the Qur'an he bring are false and false. The Qur'an is not a folk tale, but a revelation and guidance from Allah the Creator, the Almighty and the All-Ruler, both on earth and in heaven with His wisdom and wisdom.",
      "text_tafsir": "Pada ayat ini Allah menegaskan kepada orang-orang kafir itu, karena semua pertanyaan yang dikemukakan kepada mereka mengenai Allah sebagai Pencipta, Pemilik dan Pengatur segalanya, mereka jawab dengan jawaban yang benar dan positif, bahwa Al-Qur'an yang diturunkan kepada Nabi Muhammad untuk memperbaiki dan meluruskan akidah mereka yang telah sesat, adalah benar dan tuduhan-tuduhan yang mereka kemukakan terhadap Muhammad dan Al-Qur'an yang dibawanya adalah keliru dan bohong. Al-Qur'an bukanlah dongengan-dongengan orang dahulu, tetapi benar-benar wahyu dan petunjuk dari Allah Yang Maha Pencipta, Mahakuasa dan Yang Mengatur segala sesuatu, baik di bumi maupun di langit dengan hikmat dan kebijaksanaan-Nya.",
      "text_translation": "Padahal Kami telah membawa kebenaran kepada mereka, tetapi mere-ka benar-benar pendusta.",
      "text": "بَلْ اَتَيْنٰهُمْ بِالْحَقِّ وَاِنَّهُمْ لَكٰذِبُوْنَ",
      "text_translation_en": "Nay, We have conveyed unto them the truth: and yet, behold, they are intent on lying [to them­selves]!",
      "juz_number": 18
    },
    "91": {
      "text_tafsir_en": "This verse rejects the claim of the polytheists that the angels are daughters of God by explaining that God has no children at all, because He is Mahakaya, Almighty and Mahakekal, does not need offspring like humans. Humans indeed need a lot of children who will continue their offspring, and when he is old and helpless then the children will help and help him. And if he dies then it will be his children who will continue his business and profession and raise his name among the people. Almighty God, Mahakaya and Mahakekal do not need all that. God is not overtaken by exhaustion because He is almighty, will not be overtaken by death because He is almighty, He will not be overtaken by poverty because He is the Almighty, His property is all that is in heaven and on earth. How foolish are the polytheists who equate God with humans who are very weak and poor, or if they are not stupid then they are big liars because what he says is totally at odds with the minds of intelligent people. Really very weak minds of people who say that God has children or has an ally. Glory be to Allah from all the unreasonable assumptions and accusations.",
      "text_tafsir": "Ayat ini menolak dakwaan kaum musyrik bahwa para malaikat itu adalah putri-putri Allah dengan menerangkan bahwa Allah sekali-kali tidak mempunyai anak, karena Dia Mahakaya, Mahakuasa dan Mahakekal, tidak memerlukan keturunan seperti halnya manusia. Manusia memang banyak memerlukan anak yang akan melanjutkan keturunannya, dan bila dia sudah tua dan tidak berdaya lagi maka anak-anaknya itulah yang akan membantu dan menolongnya. Dan bila dia mati maka anak-anaknya pulalah yang akan melanjutkan usaha dan profesinya dan mengangkat namanya di kalangan masyarakatnya. Allah Yang Mahakuasa, Mahakaya dan Mahakekal tidak memerlukan semua itu.\n\nAllah tidak ditimpa kelelahan karena Dia Mahakuat, tidak akan ditimpa kematian karena Dia Mahakekal, Dia tidak akan ditimpa kemiskinan karena Dia Mahakaya, milik-Nyalah semua yang ada di langit dan di bumi. Alangkah bodohnya kaum musyrikin yang menyamakan Allah dengan manusia yang amat lemah dan miskin, atau kalau mereka tidak bodoh maka mereka adalah pendusta besar karena yang diucapkannya itu bertentangan sama sekali dengan pikiran orang-orang berakal.\n\nSungguh amat lemah pikiran orang yang mengatakan bahwa Allah mempunyai anak atau mempunyai sekutu. Mahasuci Allah dari segala anggapan dan tuduhan yang tidak masuk akal itu.",
      "text_translation": "Allah tidak mempunyai anak, dan tidak ada tuhan (yang lain) bersama-Nya, (sekiranya tuhan banyak), maka masing-masing tuhan itu akan membawa apa (makhluk) yang diciptakannya, dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain. Mahasuci Allah dari apa yang mereka sifatkan itu,",
      "text": "مَا اتَّخَذَ اللّٰهُ مِنْ وَّلَدٍ وَّمَا كَانَ مَعَهٗ مِنْ اِلٰهٍ اِذًا لَّذَهَبَ كُلُّ اِلٰهٍۢ بِمَا خَلَقَ وَلَعَلَا بَعْضُهُمْ عَلٰى بَعْضٍۗ سُبْحٰنَ اللّٰهِ عَمَّا يَصِفُوْنَ ۙ",
      "text_translation_en": "Never did God take unto Himself any offspring, nor has there ever been any deity side by side with Him: [for, had there been any,] lo! each deity would surely have stood apart [from the others] in whatever it had created, and they would surely have [tried to] overcome one another! Limitless in His glory is God, [far] above anything that men may devise by way of definition,",
      "juz_number": 18
    },
    "92": {
      "text_tafsir_en": "This verse explains that Allah is the All-Knower of the unseen and senses of the senses, the All-Knowing of the visible and the real and the visible and the sensible. Whatever happens in this world whether the heavens or the earth all comes to His knowledge, there is nothing great or small except in His infinite knowledge, as it is in His word: And are you not (Muhammad) in a matter, and did not read a verse of the Qur'an nor did you do any work, but We are witnesses to you when you do it. Never mind the knowledge of your Lord no matter how big a zarrah is on earth or in heaven. There is nothing smaller and larger than that, except for all that is contained in the real Book (Far Mahfuz). (Jonah \/ 10:61) It is broad and includes the knowledge of God. Holy of Allah from all accusations of unbelievers who claim to have children and allies.",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah Yang Mahatahu segala yang gaib yang tidak dapat dilihat dan dirasakan dengan panca indera, Maha Mengetahui segala yang tampak dan nyata dan dapat dilihat dan dirasakan. Apapun yang terjadi di alam ini baik alam langit ataupun alam bumi semuanya terjadi dengan sepengetahuan-Nya, tak ada yang besar maupun yang kecil kecuali ada dalam ilmu-Nya yang Mahaluas, seperti tersebut dalam firman-Nya:\n\nDan tidakkah engkau (Muhammad) berada dalam suatu urusan, dan tidak membaca suatu ayat Al-Qur'an serta tidak pula kamu melakukan suatu pekerjaan, melainkan Kami menjadi saksi atasmu ketika kamu melakukannya. Tidak lengah sedikit pun dari pengetahuan Tuhanmu biarpun sebesar zarrah baik di bumi ataupun di langit. Tidak ada sesuatu yang lebih kecil dan yang lebih besar dari itu, melainkan semua tercatat dalam Kitab yang nyata (Lauh Mahfuz). (Yunus\/10: 61)\n\nDemikianlah luas dan mencakupnya ilmu Allah. Mahasuci Allah dari segala tuduhan orang kafir yang mengatakan bahwa Dia mempunyai anak dan sekutu.",
      "text_translation": "(Dialah Tuhan) yang mengetahui semua yang gaib dan semua yang tampak. Mahatinggi (Allah) dari apa yang mereka persekutukan.",
      "text": "عٰلِمِ الْغَيْبِ وَالشَّهَادَةِ فَتَعٰلٰى عَمَّا يُشْرِكُوْنَ ࣖ",
      "text_translation_en": "knowing all that is beyond the reach of a created being’s perception as well as all that can be witnessed by a creature’s senses or mind and, hence, sublimely exalted is He above anything to which they may ascribe a share in His divinity!",
      "juz_number": 18
    },
    "93": {
      "text_tafsir_en": "In this verse Allah commands the Prophet Muhammad to pray for him to be kept away from those who disbelieved when He would punish them, not to destroy them, to be saved from His torment and wrath, and to make them a people . The command to pray like this is taught by God because of the misfortune and catastrophe that God inflicts on the wicked and the oppressors, sometimes even the innocent, because they live together in a society or a country. This is in accordance with the word of God: And protect yourself from torments that not only afflict the unjust among you. Know that God is very cruel to Him. (al-Anfal \/ 8: 25) According to the story of Imam Ahmad and at-Tirmidzi the prayer of the Prophet Muhammad in this case reads: Allah) if You are going to afflict the people (the oppressed) then leave me in a state of torture. (History of Ahmad and at-Tirmid",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad agar berdoa memohon kepada-Nya supaya dijauhkan dari orang-orang kafir yang aniaya itu bila Dia hendak mengazab mereka, jangan dibinasakan bersama mereka, agar diselamatkan dari siksaan dan kemurkaan-Nya, dan menjadikannya golongan orang yang diridai. Perintah supaya berdoa seperti ini diajarkan Allah karena musibah dan malapetaka yang ditimpakan Allah kepada orang-orang durhaka dan aniaya kadang-kadang juga menimpa orang-orang yang tidak bersalah, karena mereka hidup bersama dalam masyarakat atau suatu negara. Ini sesuai dengan firman Allah:\n\nDan peliharalah dirimu dari siksaan yang tidak hanya menimpa orang-orang yang zalim saja di antara kamu. Ketahuilah bahwa Allah sangat keras siksa-Nya.\n\n(al-Anfal\/8: 25)\n\nMenurut riwayat Imam Ahmad dan at-Tirmidzi doa Nabi Muhammad saw dalam hal ini berbunyi:\n\nAllah) apabila Engkau hendak menimpa siksaan kepada kaum (yang aniaya) maka wafatkan aku dalam keadaan tidak ikut disiksa. (Riwayat Ahmad dan at-Tirmid",
      "text_translation": "Katakanlah (Muhammad), “Ya Tuhanku, seandainya Engkau hendak memperlihatkan kepadaku apa (azab) yang diancamkan kepada mereka,",
      "text": "قُلْ رَّبِّ اِمَّا تُرِيَنِّيْ مَا يُوْعَدُوْنَ ۙ",
      "text_translation_en": "SAY: “O my Sustainer! If it be Thy will to let me witness [the fulfillment of] whatever they [who blaspheme against Thee] have been promised [to suffer] –",
      "juz_number": 18
    },
    "94": {
      "text_tafsir_en": "In this verse Allah commands the Prophet Muhammad to pray for him to be kept away from those who disbelieved when He would punish them, not to destroy them, to be saved from His torment and wrath, and to make them a people . The command to pray like this is taught by God because of the misfortune and catastrophe that God inflicts on the wicked and the oppressors, sometimes even the innocent, because they live together in a society or a country. This is in accordance with the word of God: And protect yourself from torments that not only afflict the unjust among you. Know that God is very cruel to Him. (al-Anfal \/ 8: 25) According to the story of Imam Ahmad and at-Tirmidzi the prayer of the Prophet Muhammad in this case reads: Allah) if You are going to afflict the people (the oppressed) then leave me in a state of torture. (History of Ahmad and at-Tirmid",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad agar berdoa memohon kepada-Nya supaya dijauhkan dari orang-orang kafir yang aniaya itu bila Dia hendak mengazab mereka, jangan dibinasakan bersama mereka, agar diselamatkan dari siksaan dan kemurkaan-Nya, dan menjadikannya golongan orang yang diridai. Perintah supaya berdoa seperti ini diajarkan Allah karena musibah dan malapetaka yang ditimpakan Allah kepada orang-orang durhaka dan aniaya kadang-kadang juga menimpa orang-orang yang tidak bersalah, karena mereka hidup bersama dalam masyarakat atau suatu negara. Ini sesuai dengan firman Allah:\n\nDan peliharalah dirimu dari siksaan yang tidak hanya menimpa orang-orang yang zalim saja di antara kamu. Ketahuilah bahwa Allah sangat keras siksa-Nya.\n\n(al-Anfal\/8: 25)\n\nMenurut riwayat Imam Ahmad dan at-Tirmidzi doa Nabi Muhammad saw dalam hal ini berbunyi:\n\nAllah) apabila Engkau hendak menimpa siksaan kepada kaum (yang aniaya) maka wafatkan aku dalam keadaan tidak ikut disiksa. (Riwayat Ahmad dan at-Tirmid",
      "text_translation": "Ya Tuhanku, maka janganlah Engkau jadikan aku dalam golongan orang-orang zalim.”",
      "text": "رَبِّ فَلَا تَجْعَلْنِيْ فِى الْقَوْمِ الظّٰلِمِيْنَ",
      "text_translation_en": "do not, O my Sustainer, let me be one of those evildoing folk!”",
      "juz_number": 18
    },
    "95": {
      "text_tafsir_en": "Allah explained to the Prophet Muhammad, that He had the power to show him the torment that would be inflicted on the unbelievers so that Muhammad could see for himself how terrible and terrible the torment of Allah was. But because of His mercy and love for Muhammad, God did not immediately inflict the punishment, but it was His decree that the torment would overtake them in the Hereafter, because it might be between them or their posterity who will know and believe in God and His Messenger. Therefore, the Prophet Muhammad should not be overly sorry for the actions and treatment of unbelievers against him and the Muslims who are weak and helpless.",
      "text_tafsir": "Allah menjelaskan kepada Nabi Muhammad, bahwa Dia Kuasa memperlihatkan kepadanya siksaan yang akan ditimpakan kepada orang kafir itu sehingga Nabi Muhammad dapat melihat sendiri bagaimana dahsyatnya dan hebatnya siksaan Allah. Tetapi karena rahmat dan kasih sayang-Nya kepada umat Muhammad, Allah tidak menjatuhkan siksa itu dengan segera (di dunia ini), tetapi sudah menjadi ketetapan-Nya bahwa siksaan itu akan menimpa mereka di akhirat, karena mungkin kelak ada di antara mereka atau keturunan mereka yang akan sadar dan beriman kepada Allah dan Rasul-Nya. Oleh sebab itu, Nabi Muhammad jangan terlalu bersedih hati atas tindakan dan perlakuan orang kafir terhadapnya dan kaum Muslimin yang memang dalam keadaan lemah dan tak berdaya.",
      "text_translation": "Dan sungguh, Kami kuasa untuk memperlihatkan kepadamu (Muhammad) apa yang Kami ancamkan kepada mereka.",
      "text": "وَاِنَّا عَلٰٓى اَنْ نُّرِيَكَ مَا نَعِدُهُمْ لَقٰدِرُوْنَ",
      "text_translation_en": "[Pray thus] for, behold, We are most cer­tainly able to let thee witness [the fulfillment, even in this world, of] whatever We promise them!",
      "juz_number": 18
    },
    "96": {
      "text_tafsir_en": "Then Allah gave the Prophet Muhammad the best way to deal with the attitude of the Muslims. Among them, the Prophet must be gentle to them and never respond to evil with evil, violence with violence because it is not yet time to act. When they ridicule and insult the Prophet should forgive those who are not in his place, because that is not his goal but should be answered with words that contain instructions and teachings by giving reasonable explanations and reasons. When they want to commit acts of oppression, avoid them and avoid as many opportunities as they can for such actions and to be faced with patience and perseverance. The Prophet was also ordered to show them that he was a knight with no intention of harm to them. With such a gentle attitude and wisdom, they will not oppress the Muslims. Gradually those who are as hard as a stone will become gentle and realize for themselves what they have done. The Prophet was also asked to believe in his heart that Allah knows all their words and actions. Allah knows best what they do and what is hidden in their chest. In accordance with this guidance God says in another verse: And it is not the same as evil. Reject (evil) in a better way, so that the one who has enmity between you and him will be like a loyal friend. (Fussilat \/ 34: 34) Anas bin Malik said in commenting on this verse, \"A man tells his brother an evil thing.\" He replied, \"If your words are false, then I will ask God to forgive you your lies. If what you say is true then I will ask God to forgive me.\"",
      "text_tafsir": "Kemudian Allah memberikan tuntunan kepada Nabi Muhammad bagaimana cara yang sebaik-baiknya menghadapi sikap kaum musyrik itu. Di antaranya, Nabi harus tetap bersikap lemah lembut terhadap mereka dan jangan sekali-kali membalas kejahatan dengan kejahatan, kekerasan dengan kekerasan karena memang belum waktunya bersikap demikian. Bila mereka mencemooh dan mencaci maki hendaknya Nabi memaafkan ucapan-ucapan mereka yang tidak pada tempatnya itu, karena ucapan itu tidak mengenai sasarannya tetapi hendaklah dibalas dengan kata-kata yang mengandung patunjuk dan ajaran dengan mengemukakan dalil-dalil dan alasan yang masuk akal. Bila mereka hendak melakukan tindakan penganiayaan, hindari mereka dan jauhi sedapat mungkin kesempatan yang membawa kepada tindakan seperti itu dan hendaklah dihadapi dengan penuh kesabaran dan ketabahan. Nabi juga diperintahkan untuk menunjukkan kepada mereka bahwa beliau memang seorang ksatria yang tidak ada niat sedikit pun untuk mencelakakan mereka. Dengan sikap lemah lembut dan kebijaksanaan itu, mereka tidak akan merajalela terhadap kaum Muslimin. Lambat laun mereka yang keras seperti batu itu akan menjadi lembut dan menyadari sendiri kesalahan yang sudah mereka lakukan. Nabi juga diminta untuk meyakini dalam hati bahwa Allah mengetahui semua ucapan dan tindakan mereka. Allah lebih mengetahui apa saja yang mereka lakukan dan apa saja yang tersembunyi dalam dada mereka.\n\nSesuai dengan petunjuk ini Allah berfirman dalam ayat yang lain:\n\nDan tidaklah sama kebaikan dengan kejahatan. Tolaklah (kejahatan itu) dengan cara yang lebih baik, sehingga orang yang ada rasa permusuhan antara kamu dan dia akan seperti teman yang setia. (Fussilat\/41: 34)\n\nAnas bin Malik berkata mengomentari ayat ini, \"Seorang laki-laki mengatakan terhadap saudaranya hal yang tidak-tidak.\" Maka dia menjawab, \"Jika ucapanmu itu bohong maka saya memohon kepada Allah supaya Dia mengampuni kebohonganmu itu. Jika ucapanmu itu benar maka saya memohon kepada Allah supaya mengampuniku.\"",
      "text_translation": "Tolaklah perbuatan buruk mereka dengan (cara) yang lebih baik, Kami lebih mengetahui apa yang mereka sifatkan (kepada Allah).",
      "text": "اِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ السَّيِّئَةَۗ  نَحْنُ اَعْلَمُ بِمَا يَصِفُوْنَ ",
      "text_translation_en": "[But whatever they may say or do,] repel the evil [which they commit] with something that is bet­ter: We are fully aware of what they attribute [to Us].",
      "juz_number": 18
    },
    "97": {
      "text_tafsir_en": "In this verse Allah instructs the Prophet Muhammad to always protect him from the whisperings of the devil and his temptations, and that the devil is always far from him and cannot enter his heart to deceive him. That should be the attitude of every fighter to uphold the truth. They must take care not to be influenced by their passions and be encouraged to act in an unprofessional and dishonest way. Satan is so easy to cast humans into the abyss of sin, humiliation and evil when it can enter human passions. Therefore let us always seek refuge in God from the deception of the devil. Indeed, when a person truly surrenders to his Lord in all his actions and always seeks his protection from the deceptions and temptations of the devil, he becomes pure and his conscience will be punished for always doing good and avoiding evil. The Messenger of Allah always sought refuge from his Lord to prevent him from intervening in his actions, especially in prayers as he recited the Qur'an and at the time of his death. Narrated by Ahmad, Abu David and at-Tirmidzi and judged by al-Baihaqi by 'Amr bin Shu'aib and his father from his grandfather, he said, \"The Messenger of Allah (may peace be upon him) taught him by saying the name of Allah, From his torment, from the evil of his servant, from the whisperings of the devil and from the presence of the devil. (History of Ahmad, Abu David and at-Tirmidzi)",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad supaya dia selalu berlindung kepada-Nya dari bisikan-bisikan setan dan dari godaan-godaannya, dan supaya setan itu selalu jauh daripadanya dan tidak dapat masuk ke dalam hatinya untuk memperdayakannya.\n\nDemikianlah seharusnya sikap setiap pejuang untuk menegakkan kebenaran. Mereka harus benar-benar menjaga supaya tidak sekalipun dipengaruhi hawa nafsunya dan terdorong untuk melakukan tindakan-tindakan yang tidak benar dan tidak jujur. Setan amat mudah sekali menjerumuskan manusia ke jurang kesalahan, penghinaan dan kejahatan apabila ia dapat memasuki hawa nafsu manusia. Karena itu hendaklah kita selalu berlindung kepada Allah dari tipu daya setan. Memang apabila seseorang benar-benar telah berserah diri kepada Tuhannya dalam segala tindakannya dan selalu memohon perlindungan-Nya dari tipu daya dan godaan setan, dirinya menjadi bersih dan hati nuraninya akan terketuk untuk selalu berbuat kebaikan dan menghindari kejahatan. Rasulullah selalu berlindung kepada Tuhannya supaya dijauhkan daripadanya campur tangan setan dalam segala perbuatannya terutama dalam salat ketika membaca Al-Qur'an dan pada saat ajalnya akan tiba.\n\nDiriwayatkan oleh Ahmad, Abu Daud dan at-Tirmidzi dan dinilai sahih oleh al-Baihaqi dari 'Amr bin Syu'aib dan ayahnya dari kakeknya ia berkata, \"Rasulullah saw mengajarkan \n\nDengan menyebut nama Allah, aku berlindung dengan kalimat Allah yang sempurna dari kemurkaan-Nya, dari siksa-Nya. Dari kejahatan hamba-Nya, dari bisikan-bisikan setan dan dari kahadiran setan kepadaku. (Riwayat Ahmad, Abu Daud dan at-Tirmidzi)",
      "text_translation": "Dan katakanlah, “Ya Tuhanku, aku berlindung kepada Engkau dari bisikan-bisikan setan,",
      "text": "وَقُلْ رَّبِّ اَعُوْذُ بِكَ مِنْ هَمَزٰتِ الشَّيٰطِيْنِ ۙ",
      "text_translation_en": "And say: “O my Sustainer! I seek refuge with Thee from the promptings of all evil impulses;",
      "juz_number": 18
    },
    "98": {
      "text_tafsir_en": "In this verse Allah instructs the Prophet Muhammad to always protect him from the whisperings of the devil and his temptations, and that the devil is always far from him and cannot enter his heart to deceive him. That should be the attitude of every fighter to uphold the truth. They must take care not to be influenced by their passions and be encouraged to act in an unprofessional and dishonest way. Satan is so easy to cast humans into the abyss of sin, humiliation and evil when it can enter human passions. Therefore let us always seek refuge in God from the deception of the devil. Indeed, when a person truly surrenders to his Lord in all his actions and always seeks his protection from the deceptions and temptations of the devil, he becomes pure and his conscience will be punished for always doing good and avoiding evil. The Messenger of Allah always sought refuge from his Lord to prevent him from intervening in his actions, especially in prayers as he recited the Qur'an and at the time of his death. Narrated by Ahmad, Abu David and at-Tirmidzi and judged by al-Baihaqi by 'Amr bin Shu'aib and his father from his grandfather, he said, \"The Messenger of Allah (may peace be upon him) taught him by saying the name of Allah, From his torment, from the evil of his servant, from the whisperings of the devil and from the presence of the devil. (History of Ahmad, Abu David and at-Tirmidzi)",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad supaya dia selalu berlindung kepada-Nya dari bisikan-bisikan setan dan dari godaan-godaannya, dan supaya setan itu selalu jauh daripadanya dan tidak dapat masuk ke dalam hatinya untuk memperdayakannya.\n\nDemikianlah seharusnya sikap setiap pejuang untuk menegakkan kebenaran. Mereka harus benar-benar menjaga supaya tidak sekalipun dipengaruhi hawa nafsunya dan terdorong untuk melakukan tindakan-tindakan yang tidak benar dan tidak jujur. Setan amat mudah sekali menjerumuskan manusia ke jurang kesalahan, penghinaan dan kejahatan apabila ia dapat memasuki hawa nafsu manusia. Karena itu hendaklah kita selalu berlindung kepada Allah dari tipu daya setan. Memang apabila seseorang benar-benar telah berserah diri kepada Tuhannya dalam segala tindakannya dan selalu memohon perlindungan-Nya dari tipu daya dan godaan setan, dirinya menjadi bersih dan hati nuraninya akan terketuk untuk selalu berbuat kebaikan dan menghindari kejahatan. Rasulullah selalu berlindung kepada Tuhannya supaya dijauhkan daripadanya campur tangan setan dalam segala perbuatannya terutama dalam salat ketika membaca Al-Qur'an dan pada saat ajalnya akan tiba.\n\nDiriwayatkan oleh Ahmad, Abu Daud dan at-Tirmidzi dan dinilai sahih oleh al-Baihaqi dari 'Amr bin Syu'aib dan ayahnya dari kakeknya ia berkata, \"Rasulullah saw mengajarkan \n\nDengan menyebut nama Allah, aku berlindung dengan kalimat Allah yang sempurna dari kemurkaan-Nya, dari siksa-Nya. Dari kejahatan hamba-Nya, dari bisikan-bisikan setan dan dari kahadiran setan kepadaku. (Riwayat Ahmad, Abu Daud dan at-Tirmidzi)",
      "text_translation": "dan aku berlindung (pula) kepada Engkau ya Tuhanku, agar mereka tidak mendekati aku.”",
      "text": "وَاَعُوْذُ بِكَ رَبِّ اَنْ يَّحْضُرُوْنِ ",
      "text_translation_en": "and I seek refuge with Thee, O my Sustainer, lest they come near unto me!’",
      "juz_number": 18
    },
    "99": {
      "text_tafsir_en": "In this verse God tells us the words spoken by unbelievers in the face of death, though those words could not be heard by those present. The infidel asked God not to be put to death first and to live as he always did so that he might repent of his wrongdoings and transgressions and believe and do good deeds which he had not done in his lifetime. Thus the disbelievers when he was in good health and having the will to believe and practice righteousness, he refused to accept the truth, arrogance and arrogance of the believers, always disobedient to Allah and even doing acts contrary to the law. God and uttering unjust words to Him. However, when they were in death, they were reminded of the sins and mistakes they had committed. At the same time they became aware and consciously asked God to give them a long life to do good to cover up all the wrongdoings and crimes they had committed. However, when death is not the time to seek forgiveness and repent as it is said in his Word: And is not the repentance of Allah from those who do evil (until) when one dies among them, (then) saying: \"Truly I repent now.\" And do not (receive repentance) the dead while they are in disbelief. For them we have provided a painful torment. (an-Nisa '\/ 4: 17-18) Then Allah declares that the request of the unbelievers is only a word that comes out of their mouth and will not be granted. Even if they are given a long life, they will not return to their faith and will not do what is right as Allah declares in His word: And if you (Muhammad) saw them when they were brought to hell, they said, \"If only we had been restored ( to the world) of course we will not deny the revelations of our Lord, and be believers. \" But (in fact) they had already discovered the evil they had hidden before. If they were returned to the world, they would have to repeat what they were forbidden to do. They are really liars. (al-An'am \/ 6: 27-28) Such is the utterance they give as their own consolation, a utterance of no value at all because it is impossible for them to live again because their death has come. In front of them lay a wall that prevented them from returning to the world until the Day of Judgment. Conclusion",
      "text_tafsir": "Pada ayat ini Allah memberitahukan tentang kata-kata yang diucapkan oleh orang kafir ketika menghadapi maut, walaupun kata-kata itu tidak dapat didengar oleh orang-orang yang hadir ketika itu. Orang kafir itu meminta kepada Allah supaya dia jangan dimatikan dahulu dan dibiarkan hidup seperti sediakala agar dia dapat bertobat dari kesalahan dan kedurhakaannya dan dapat beriman dan mengerjakan amal yang baik yang tidak dikerjakannya selama hidupnya.\n\nDemikianlah keadaan orang-orang kafir itu pada waktu dia masih sehat walafiat dan mempunyai kesanggupan untuk beriman dan beramal saleh, dia enggan menerima kebenaran, takabur dan sombong terhadap orang-orang yang beriman, selalu durhaka kepada Allah bahkan melakukan tindakan-tindakan yang bertentangan dengan perintah Allah dan mengucapkan kata-kata yang tidak benar terhadap-Nya. Akan tetapi, ketika dalam keadaan sakaratul maut, mereka teringat pada dosa dan kesalahan yang telah mereka lakukan. Ketika itu juga mereka menjadi insaf dan sadar lalu meminta dengan sepenuh hati kepada Allah agar diberi umur panjang untuk berbuat baik guna menutupi semua kedurhakaan dan kejahatan yang telah mereka lakukan. Namun demikian, saat sakaratul maut bukan waktu untuk meminta ampun dan bertobat sebagaimana tersebut dalam firman-Nya:\n\nDan tidaklah tobat itu diterima Allah dari orang-orang yang mengerjakan kejahatan (yang) hingga apabila datang ajal kepada seseorang di antara mereka, (barulah) ia mengatakan: \"Sesungguhnya saya bertobat sekarang.\" Dan tidak (pula diterima tobat) orang-orang yang mati sedang mereka di dalam keadaan kekafiran. Bagi orang-orang itu telah Kami sediakan siksa yang pedih. (an-Nisa'\/4: 17-18)\n\nLalu Allah menegaskan bahwa permintaan orang-orang kafir itu hanyalah ucapan yang keluar dari mulut mereka saja dan tidak akan dikabulkan. Kalaupun benar-benar diberi umur panjang, mereka tidak juga akan kembali beriman dan tidak akan mau mengerjakan amal saleh sebagaimana ditegaskan Allah dalam firman-Nya:\n\nDan seandainya engkau (Muhammad) melihat ketika mereka dihadapkan ke neraka, mereka berkata, \"Seandainya kami dikembalikan (ke dunia) tentu kami tidak akan mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman.\" Tetapi (sebenarnya) bagi mereka telah nyata kejahatan yang mereka sembunyikan dahulu. Seandainya mereka dikembalikan ke dunia, tentu mereka akan mengulang kembali apa yang telah dilarang mengerjakannya. Mereka itu sungguh pendusta. (al-An'am\/6: 27-28)\n\nDemikianlah ucapan yang mereka lontarkan sebagai penghibur hati mereka sendiri, suatu ucapan yang tidak ada nilainya sama sekali karena tidak mungkin mereka akan hidup kembali karena ajal mereka telah tiba. Di hadapan mereka terbentang dinding yang menghalangi mereka kembali ke dunia sampai hari kiamat.\n\nKesimpulan",
      "text_translation": "(Demikianlah keadaan orang-orang kafir itu), hingga apabila datang kematian kepada seseorang dari mereka, dia berkata, “Ya Tuhanku, kembalikanlah aku (ke dunia),",
      "text": "حَتّٰٓى اِذَا جَاۤءَ اَحَدَهُمُ الْمَوْتُ قَالَ رَبِّ ارْجِعُوْنِ ۙ",
      "text_translation_en": "[AS FOR THOSE who will not believe in the life to come, they go on lying to themselves] until, when death approaches any of them, he prays: “O my Sustainer! Let me return, let me return [to life],",
      "juz_number": 18
    },
    "100": {
      "text_tafsir_en": "In this verse God tells us the words spoken by unbelievers in the face of death, though those words could not be heard by those present. The infidel asked God not to be put to death first and to live as he always did so that he might repent of his wrongdoings and transgressions and believe and do good deeds which he had not done in his lifetime. Thus the disbelievers when he was in good health and having the will to believe and practice righteousness, he refused to accept the truth, arrogance and arrogance of the believers, always disobedient to Allah and even doing acts contrary to the law. God and uttering unjust words to Him. However, when they were in death, they were reminded of the sins and mistakes they had committed. At the same time they became aware and consciously asked God to give them a long life to do good to cover up all the wrongdoings and crimes they had committed. However, when death is not the time to seek forgiveness and repent as it is said in his Word: And is not the repentance of Allah from those who do evil (until) when one dies among them, (then) saying: \"Truly I repent now.\" And do not (receive repentance) the dead while they are in disbelief. For them we have provided a painful torment. (an-Nisa '\/ 4: 17-18) Then Allah declares that the request of the unbelievers is only a word that comes out of their mouth and will not be granted. Even if they are given a long life, they will not return to their faith and will not do what is right as Allah declares in His word: And if you (Muhammad) saw them when they were brought to hell, they said, \"If only we had been restored ( to the world) of course we will not deny the revelations of our Lord, and be believers. \" But (in fact) they had already discovered the evil they had hidden before. If they were returned to the world, they would have to repeat what they were forbidden to do. They are really liars. (al-An'am \/ 6: 27-28) Such is the utterance they give as their own consolation, a utterance of no value at all because it is impossible for them to live again because their death has come. In front of them lay a wall that prevented them from returning to the world until the Day of Judgment. Conclusion",
      "text_tafsir": "Pada ayat ini Allah memberitahukan tentang kata-kata yang diucapkan oleh orang kafir ketika menghadapi maut, walaupun kata-kata itu tidak dapat didengar oleh orang-orang yang hadir ketika itu. Orang kafir itu meminta kepada Allah supaya dia jangan dimatikan dahulu dan dibiarkan hidup seperti sediakala agar dia dapat bertobat dari kesalahan dan kedurhakaannya dan dapat beriman dan mengerjakan amal yang baik yang tidak dikerjakannya selama hidupnya.\n\nDemikianlah keadaan orang-orang kafir itu pada waktu dia masih sehat walafiat dan mempunyai kesanggupan untuk beriman dan beramal saleh, dia enggan menerima kebenaran, takabur dan sombong terhadap orang-orang yang beriman, selalu durhaka kepada Allah bahkan melakukan tindakan-tindakan yang bertentangan dengan perintah Allah dan mengucapkan kata-kata yang tidak benar terhadap-Nya. Akan tetapi, ketika dalam keadaan sakaratul maut, mereka teringat pada dosa dan kesalahan yang telah mereka lakukan. Ketika itu juga mereka menjadi insaf dan sadar lalu meminta dengan sepenuh hati kepada Allah agar diberi umur panjang untuk berbuat baik guna menutupi semua kedurhakaan dan kejahatan yang telah mereka lakukan. Namun demikian, saat sakaratul maut bukan waktu untuk meminta ampun dan bertobat sebagaimana tersebut dalam firman-Nya:\n\nDan tidaklah tobat itu diterima Allah dari orang-orang yang mengerjakan kejahatan (yang) hingga apabila datang ajal kepada seseorang di antara mereka, (barulah) ia mengatakan: \"Sesungguhnya saya bertobat sekarang.\" Dan tidak (pula diterima tobat) orang-orang yang mati sedang mereka di dalam keadaan kekafiran. Bagi orang-orang itu telah Kami sediakan siksa yang pedih. (an-Nisa'\/4: 17-18)\n\nLalu Allah menegaskan bahwa permintaan orang-orang kafir itu hanyalah ucapan yang keluar dari mulut mereka saja dan tidak akan dikabulkan. Kalaupun benar-benar diberi umur panjang, mereka tidak juga akan kembali beriman dan tidak akan mau mengerjakan amal saleh sebagaimana ditegaskan Allah dalam firman-Nya:\n\nDan seandainya engkau (Muhammad) melihat ketika mereka dihadapkan ke neraka, mereka berkata, \"Seandainya kami dikembalikan (ke dunia) tentu kami tidak akan mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman.\" Tetapi (sebenarnya) bagi mereka telah nyata kejahatan yang mereka sembunyikan dahulu. Seandainya mereka dikembalikan ke dunia, tentu mereka akan mengulang kembali apa yang telah dilarang mengerjakannya. Mereka itu sungguh pendusta. (al-An'am\/6: 27-28)\n\nDemikianlah ucapan yang mereka lontarkan sebagai penghibur hati mereka sendiri, suatu ucapan yang tidak ada nilainya sama sekali karena tidak mungkin mereka akan hidup kembali karena ajal mereka telah tiba. Di hadapan mereka terbentang dinding yang menghalangi mereka kembali ke dunia sampai hari kiamat.\n\nKesimpulan",
      "text_translation": "agar aku dapat berbuat kebajikan yang telah aku tinggalkan.” Sekali-kali tidak! Sesungguhnya itu adalah dalih yang diucapkannya saja. Dan di hadapan mereka ada barzakh sampai pada hari mereka dibangkitkan.",
      "text": "لَعَلِّيْٓ اَعْمَلُ صَالِحًا فِيْمَا تَرَكْتُ كَلَّاۗ اِنَّهَا كَلِمَةٌ هُوَ قَاۤىِٕلُهَاۗ وَمِنْ وَّرَاۤىِٕهِمْ بَرْزَخٌ اِلٰى يَوْمِ يُبْعَثُوْنَ ",
      "text_translation_en": "so that I might act righteously in whatever I have failed [aforetime]!” Nay, it is indeed but a [meaningless] word that he utters: for behind those [who leave the world] there is a barrier [of death] until the Day when all will be raised from the dead!",
      "juz_number": 18
    },
    "101": {
      "text_tafsir_en": "In this verse God explains that if the trumpet is blown a second time and the spirits are returned to their bodies on the day of resurrection, then there will be no benefit to the lineage. One can no longer boast of his lineage, that he is of the noble lineage as he was when he was in the world. There is no difference between one and the other, all affected by the atmosphere. They were confused and overwhelmed by the fear of the horror of the day, and lost their love and affection. Each one thinks of himself and does not want to know another, as it is written in the word of God: Then when the sound of the trumpet (second trumpet) comes, on that day man will flee from his brother, and from his mother and father, and from his wife and children. Every single one of them that day had an affair. ('Abasa \/ 80: 33-37) They no longer speak to one another and ask. None of them questioned his family and his descendants, as they did in the world. They don't seem to know each other anymore. The Word of God: And no good friend asked his friend. (al-Ma'arij \/ 70: 10) They are as confused as those who are drunk, but they are not drunk. The Word of God: (Remember) on the day you see it, all the women who breastfeed will neglect their baby, and every pregnant woman will have a miscarriage, and you will see men drunken, though they are not drunk. , but the punishment of Allah is very severe. (al-hajj \/ 22: 2)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa apabila sangkakala ditiup untuk kedua kalinya dan arwah dikembalikan kepada tubuhnya masing-masing pada hari kebangkitan nanti, maka pada waktu itu tidak ada lagi manfaat pertalian nasab. Seseorang tidak dapat lagi membanggakan nasabnya, bahwa dia berasal dari keturunan bangsawan sebagaimana halnya pada waktu ia masih berada di dunia. Tidak ada perbedaan antara seseorang dengan yang lain, semua terpengaruh suasana yang meliputinya. Mereka kebingungan dan diliputi perasaan takut karena kedahsyatan hari itu, sehingga hilanglah rasa cinta dan kasih sayang. Masing-masing memikirkan dirinya sendiri dan tidak mau tahu orang lain, sebagaimana yang dilukiskan di dalam firman Allah:\n\nMaka apabila datang suara yang memekakkan (tiupan sangkakala yang kedua), pada hari itu manusia lari dari saudaranya, dan dari ibu dan bapaknya, dan dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. ('Abasa\/80: 33-37)\n\nMereka tidak lagi saling tegur dan bertanya. Tidak seorang pun di antara mereka yang menanyakan keadaan keluarga dan keturunannya, sebagaimana halnya di dunia. Mereka seolah-olah tidak saling mengenal lagi. Firman Allah:\n\nDan tidak ada seorang teman akrab pun menanyakan temannya. (al- Ma'arij\/70: 10)\n\nMereka kebingungan seperti orang-orang yang sedang mabuk, padahal mereka tidak mabuk. Firman Allah:\n\n(Ingatlah) pada hari ketika kamu melihatnya (goncangan itu), semua perempuan yang menyusui anaknya akan lalai terhadap anak yang disusuinya, dan setiap perempuan yang hamil akan keguguran kandungannya, dan kamu melihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk, tetapi azab Allah itu sangat keras. (al-hajj\/22: 2)",
      "text_translation": "Apabila sangkakala ditiup maka tidak ada lagi pertalian keluarga di antara mereka pada hari itu (hari Kiamat), dan tidak (pula) mereka saling bertanya.",
      "text": "فَاِذَا نُفِخَ فِى الصُّوْرِ فَلَآ اَنْسَابَ بَيْنَهُمْ يَوْمَىِٕذٍ وَّلَا يَتَسَاۤءَلُوْنَ",
      "text_translation_en": "Then, when the trumpet [of resurrection] is blown, no ties of kinship will on that Day prevail among them, and neither will they ask about one another.",
      "juz_number": 18
    },
    "102": {
      "text_tafsir_en": "This verse explains that those who weigh the balance of good deeds, those who believe and do good deeds in the world, are people who are lucky and happy. On the Day of Judgment later, a person before his fate is determined, whether he was put into heaven or in hell, he will first be brought before a court that will give the fairest decision. There will be no fraud in the trial because the judge is God himself. Unlike the case in the court in this world, the guilty person is sometimes found not guilty, because of the clever arguments, distorting the situation or because of the cunning of the defense, so that the judge becomes fooled. Vice versa, an innocent person may be found guilty of not being able to pay for a smart defender and so on. Every decision in an unjust world will be countered again and will be decided once more in the hereafter with the fairest. All unconnected links in this world will be resolved in the hereafter with the fairest. After going through the court process and each connection has been resolved then to know the level of good and evil each of them held a scale, as explained in the word of God: . (al-Anbiya '\/ 21: 47) Whoever weighs the scale of his good deeds, be happy. In line with verse 102 this is the word of God: So as for the one who weighs the balance (goodness), then he is in a satisfying life (happy). (al-Qari'ah \/ 101: 6-7)",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang berat timbangan amal kebaikannya yaitu orang-orang yang beriman dan banyak beramal saleh di dunia, adalah orang-orang yang beruntung dan berbahagia. Pada hari Kiamat nanti, seseorang sebelum ditetapkan nasibnya, apakah ia dimasukkan ke dalam surga atau ke dalam neraka, lebih dahulu ia akan diajukan ke pengadilan yang akan memberi keputusan yang seadil-adilnya. Tidak akan terjadi kecurangan dalam proses pengadilan itu karena yang menjadi hakimnya ialah Allah sendiri. Berbeda halnya dengan pengadilan di dunia ini, orang yang bersalah adakalanya diputuskan tidak bersalah, karena pintarnya bersilat lidah, memutarbalikkan keadaan atau karena kelicikan pembelanya, sehingga hakim menjadi terkecoh. Begitu pula sebaliknya, orang yang tidak bersalah ada kemungkinan diputuskan bersalah karena tidak mampu membayar pembela yang pintar dan sebagainya. Setiap keputusan di dunia yang tidak adil akan dimentahkan kembali dan akan diputuskan sekali lagi di akhirat dengan seadil-adilnya. Segala sangkut paut yang belum selesai di dunia ini akan diselesaikan nanti di akhirat dengan seadil-adilnya. Setelah melalui proses pengadilan dan sangkut paut masing-masing telah diselesaikan maka untuk mengetahui kadar kebaikan dan kejahatan masing-masing diadakan timbangan, sebagaimana dijelaskan di dalam firman Allah:\n\nDan Kami akan memasang timbangan yang tepat pada hari Kiamat, maka tidak seorang pun dirugikan walau sedikit. (al- Anbiya'\/21: 47)\n\nBarangsiapa yang berat timbangan amal kebaikannya, berbahagialah ia. Sejalan dengan ayat 102 ini firman Allah:\n\nMaka adapun orang yang berat timbangan (kebaikan)nya, maka dia berada dalam kehidupan yang memuaskan (senang). (al-Qari'ah\/101: 6-7)",
      "text_translation": "Barangsiapa berat timbangan (kebaikan)nya, maka mereka itulah orang-orang yang beruntung.",
      "text": "فَمَنْ ثَقُلَتْ مَوَازِيْنُهٗ فَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ ",
      "text_translation_en": "And they whose weight [of righteousness] is heavy in the balance - it is they, they who will have attained to a happy state;",
      "juz_number": 18
    },
    "103": {
      "text_tafsir_en": "In this verse, God describes the loss of a person who weighs the benefits. They, while still in the world, did many evil things according to their desires. They disregard the Signs of Allah which causes their deeds to be of no value in the future, as Allah says: They are those who disregard the Signs of their God and (disbelieve) in meeting Him. Their deeds are in vain, and We do not consider their deeds on the Day of Resurrection. (al-Kahf \/ 18: 105) They will remain in Hell. In accordance with verse 103 this is the word of Allah: And as for the light-weighted (good) people, the return home is the hell of Hawiyah. (al-Qari'ah \/ 101: 8-9) Not so! Whoever does evil, and whose sins are covered, then they are the dwellers of hell. They remain in it. (al-Baqarah \/ 2: 81)",
      "text_tafsir": "Pada ayat ini Allah menerangkan kerugian orang yang ringan timbangan kebaikannya. Mereka itu ketika masih berada di dunia banyak berbuat maksiat menuruti kehendak hawa nafsunya. Mereka mengingkari ayat-ayat Allah yang menyebabkan amal-amal mereka tidak bernilai di hari kemudian, sebagaimana firman Allah:\n\nMereka itu adalah orang yang mengingkari ayat-ayat Tuhan mereka dan (tidak percaya) terhadap pertemuan dengan-Nya. Maka sia-sia amal mereka, dan Kami tidak memberikan penimbangan terhadap (amal) mereka pada hari Kiamat. (al-Kahf\/18: 105)\n\nMereka itu akan kekal di dalam neraka Jahanam. Sejalan dengan ayat 103 ini firman Allah:\n\nDan adapun orang yang ringan timbangan (kebaikan)nya, maka tempat kembalinya adalah neraka Hawiyah. (al-Qari'ah\/101: 8-9)\n\nBukan demikian! Barang siapa berbuat keburukan, dan dosanya telah menenggelamkannya, maka mereka itu penghuni neraka. Mereka kekal di dalamnya. (al-Baqarah\/2: 81)",
      "text_translation": "Dan barang siapa ringan timbangan (kebaikan)nya, maka mereka itulah orang-orang yang merugikan dirinya sendiri, mereka kekal di dalam neraka Jahanam",
      "text": "وَمَنْ خَفَّتْ مَوَازِيْنُهٗ فَاُولٰۤىِٕكَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ فِيْ جَهَنَّمَ خٰلِدُوْنَ ۚ",
      "text_translation_en": "whereas they whose weight is light in the balance - it is they who will have squandered their own selves, [destined] to abide in hell:",
      "juz_number": 18
    },
    "104": {
      "text_tafsir_en": "In this verse God explains that those who are put into hell will burn their faces with fire and look very ugly and defective. The meat is crushed, it melts to his feet. They complained of the torment that was upon them, and realized what they had done while in the world, as the word of God had said: And if they had suffered only the punishment of your Lord, they would have said, \"Woe unto us! . (al-Anbiya '\/ 21: 39)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa orang-orang yang dimasukkan ke dalam neraka itu akan dibakar mukanya dengan api sehingga kelihatan jelek sekali dan cacat. Dagingnya hancur, meleleh sampai ke kakinya. Mereka mengeluh atas azab yang menimpanya, dan menyadari perbuatannya ketika masih di dunia, sebagaimana firman Allah:\n\nDan jika mereka ditimpa sedikit saja azab Tuhanmu, pastilah mereka berkata, \"Celakalah kami! Sesungguhnya kami termasuk orang yang selalu menzalimi (diri sendiri).\" (al-Anbiya'\/21: 46)\n\nSeandainya orang kafir itu mengetahui, ketika mereka itu tidak mampu mengelakkan api neraka dari wajah dan punggung mereka, sedang mereka tidak mendapat pertolongan (tentulah mereka tidak meminta disegerakan). (al-Anbiya'\/21: 39)",
      "text_translation": "Wajah mereka dibakar api neraka, dan mereka di neraka dalam keadaan muram dengan bibir yang cacat.",
      "text": "تَلْفَحُ وُجُوْهَهُمُ النَّارُ وَهُمْ فِيْهَا كَالِحُوْنَ ",
      "text_translation_en": "the fire will scorch their faces, and they will abide therein with their lips distorted in pain.",
      "juz_number": 18
    },
    "105": {
      "text_tafsir_en": "In this verse God explains that various questions of his mocking nature are addressed to the inhabitants of hell. It reminded them again that the apostles had been sent to guide them, and to bring down the scriptures for their guidance, that they might have no more reason to disobey and obey the teachings of the apostles, as the word of God had said. : So that there is no reason for man to disobey God once the apostles are sent. (an-Nisa '\/ 4: 165) And he said: But We will not suffer until We send an apostle. (al-Isra '\/ 17: 15) But they disbelieved in the revelations of God and did not believe in it at all, even the apostles whom they were sent to persecute and persecute. In accordance with verse 105 of this verse, the word of God is about to explode in anger. Whenever a group (of the disbelievers) was thrown into it, the guards (hell) asked them, \"Has no one ever come to warn you (in the world)?\" They said, \"Well, indeed, a warner came to us, but we denied it and we said,\" Allah has not sent down anything, but you are in great error. \"(Al-Mulk \/ 67: 8 -9)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa berbagai pertanyaan yang sifatnya mengejek diajukan kepada para penghuni neraka. Hal itu mengingatkan mereka kembali bahwa telah diutus para rasul untuk membimbing mereka, dan diturunkan kitab-kitab samawi untuk menjadi pedoman mereka, supaya tidak ada lagi alasan bagi mereka untuk tidak taat dan patuh kepada ajaran-ajaran yang dibawa para rasul itu, sebagaimana firman Allah:\n\nAgar tidak ada alasan bagi manusia untuk membantah Allah setelah rasul-rasul itu diutus. (an-Nisa'\/4: 165)\n\nDan firman-Nya:\n\nTetapi Kami tidak akan menyiksa sebelum Kami mengutus seorang rasul. (al- Isra'\/17: 15)\n\nTetapi mereka itu mendustakan ayat-ayat Allah dan tidak mempercayainya sedikit pun, bahkan rasul-rasul yang diutus kepada mereka disiksa dan dianiayanya. Sejalan dengan ayat 105 ayat ini, firman Allah:\n\nHampir meledak karena marah. Setiap kali ada sekumpulan (orang-orang kafir) dilemparkan ke dalamnya, penjaga-penjaga (neraka itu) bertanya kepada mereka, \"Apakah belum pernah ada orang yang datang memberi peringatan kepadamu (di dunia)?\" Mereka menjawab, \"Benar, sungguh, seorang pemberi peringatan telah datang kepada kami, tetapi kami mendustakan(nya) dan kami katakan, \"Allah tidak menurunkan sesuatu apa pun, kamu sebenarnya didalam kesesatan yang besar.\" (al-Mulk\/67: 8-9)",
      "text_translation": "Bukankah ayat-ayat-Ku telah dibacakan kepadamu, tetapi kamu selalu mendustakannya?",
      "text": "اَلَمْ تَكُنْ اٰيٰتِيْ تُتْلٰى عَلَيْكُمْ فَكُنْتُمْ بِهَا تُكَذِّبُوْنَ",
      "text_translation_en": "[And God will say:] “Were not My messages conveyed unto you, and were you [not] wont to give them the lie?”",
      "juz_number": 18
    },
    "106": {
      "text_tafsir_en": "In this verse God explains the confession of the inhabitants of hell to their error, though it was sent to them to guide them, and to bring down the scriptures for their guidance. However, they have been overcome by their wickedness, and controlled by lust, so there is no way for them to do good and to avoid the way of error. In line with this verse the word of God: Then we confess our sins. Then is there a way (for us) to come out? (al-Mu'min \/ 40: 11)",
      "text_tafsir": "Pada ayat ini Allah menerangkan pengakuan penghuni neraka atas kesesatan mereka, sekalipun telah diutus kepada mereka rasul-rasul untuk membimbing mereka, dan diturunkan kitab-kitab samawi untuk menjadi pedoman mereka. Akan tetapi, mereka telah dikalahkan oleh kejahatan mereka, dan dikendalikan oleh hawa nafsu, maka tidak ada jalan bagi mereka untuk berbuat kebaikan dan menghindarkan diri dari jalan kesesatan. Sejalan dengan ayat ini firman Allah:\n\nLalu kami mengakui dosa-dosa kami. Maka adakah suatu jalan (bagi kami) untuk keluar (dari neraka)? (al-Mu'min\/40: 11)",
      "text_translation": "Mereka berkata, “Ya Tuhan kami, kami telah dikuasai oleh kejahatan kami, dan kami adalah orang-orang yang sesat.",
      "text": "قَالُوْا رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَاۤلِّيْنَ",
      "text_translation_en": "They will exclaim: “O our Sustainer! Our bad luck has overwhelmed us, and so we went astray!",
      "juz_number": 18
    },
    "107": {
      "text_tafsir_en": "This verse describes the application of the inhabitants of hell to God, that is, they will be released from hell and brought back to the world. They promise that if their request is granted, they will change their unbelief to faith and obey all that God has commanded them. If they continue to do evil as they did in the past, then they are really cruel people and they deserve a very painful punishment and torment.",
      "text_tafsir": "Ayat ini menerangkan permohonan penghuni neraka kepada Allah, yaitu agar mereka dikeluarkan dari neraka dan dikembalikan ke dunia. Mereka berjanji bahwa kalau permohonan mereka dikabulkan, mereka akan mengubah kekafiran mereka kepada keimanan dan taat kepada segala apa yang diperintahkan Allah kepada mereka. Jika mereka masih tetap saja berbuat maksiat sebagaimana halnya dahulu, maka mereka benar-benar orang yang aniaya dan mereka layak menerima azab dan siksa yang amat pedih.",
      "text_translation": "Ya Tuhan kami, keluarkanlah kami darinya (kembalikanlah kami ke dunia), jika kami masih juga kembali (kepada kekafiran), sungguh, kami adalah orang-orang yang zalim.”",
      "text": "رَبَّنَآ اَخْرِجْنَا مِنْهَا فَاِنْ عُدْنَا فَاِنَّا ظٰلِمُوْنَ",
      "text_translation_en": "O our Sustainer! Cause us to come out of this [suffering] - and then, if ever We revert [to sinning], may we truly be [deemed] evildoers!”",
      "juz_number": 18
    },
    "108": {
      "text_tafsir_en": "This verse explains God's answer to the request of the inhabitants of hell to be restored to the world to atone for the sins and sins they have committed. God told them to remain in hell, to be humble and to have no self-esteem. They must remain silent and continue their conversation with God and never repeat their actions because they can no longer be returned to the world.",
      "text_tafsir": "Ayat ini menerangkan jawaban Allah terhadap permintaan penghuni neraka untuk dapat dikembalikan ke dunia menebus kesalahan dan dosa-dosa yang telah diperbuatnya. Allah menegaskan kepada mereka supaya tetap berada di dalam neraka, meringkuk dalam keadaan hina dan tidak mempunyai harga diri sedikit pun. Mereka harus diam dan tidak melanjutkan pembicaraannya dengan Allah serta tidak mengulangi lagi perbuatannya karena mereka tak mungkin lagi dapat dikembalikan ke dunia.",
      "text_translation": "Dia (Allah) berfirman, “Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.”",
      "text": "قَالَ اخْسَـُٔوْا فِيْهَا وَلَا تُكَلِّمُوْنِ",
      "text_translation_en": "[But] He will say: “Away with you into this [ignominy]! And speak no more unto Me!",
      "juz_number": 18
    },
    "109": {
      "text_tafsir_en": "In this verse God explains why their cause was tortured and punished, as well as the insulting answer of their request to return to the world. Such contempt arose because they insulted the believers of God, such as Bilal, Khabbab, shahaib and other weak believers, always drawing close to God, asserting their oath and confession of faith to him, justifying the apostles whom He has sent, always begging forgiveness and begging for His mercy because He is the best of all mercies. The infidels confronted the believers with ridicule, ridicule, and contempt. This verse also explains that the arrogance of those disbelievers makes fun of and makes fun of the believers, making them forget Allah. In line with this verse, God says: Truly sinners are the ones who used to laugh at believers. And when they (believers) pass before them, they blink their eyes, and when they return to their people they return with joy. And when they see (the believers), they say, \"Indeed, they are indeed astray,\" whereas (the sinners) they are not sent as guardians. (al-Muthaffifin \/ 83: 29-33)",
      "text_tafsir": "Pada ayat ini Allah menerangkan sebab musabab mereka disiksa dan diazab, serta jawaban yang menghina atas permintaan mereka kembali ke dunia. Hinaan itu muncul karena mereka menghina hamba-hamba Allah yang telah beriman, seperti Bilal, Khabbab, shuhaib dan orang-orang mukmin yang lemah lainnya, selalu mendekatkan diri kepada Allah, menegaskan ikrar dan pengakuan keimanan mereka kepada-Nya, membenar-kan para rasul yang telah diutus-Nya, senantiasa meminta ampunan dan memohon rahmat kepada-Nya karena Dialah pemberi rahmat yang sebaik-baiknya. Orang-orang kafir menghadapi orang-orang mukmin itu dengan sikap mengejek, menertawakan, dan menghina. Ayat ini juga menerangkan bahwa kesibukan orang-orang kafir itu mereka mengejek dan menertawakan orang-orang mukmin, membuat mereka lupa mengingat Allah. Sejalan dengan ayat ini, Allah berfirman:\n\nSesungguhnya orang-orang yang berdosa, adalah mereka yang dahulu menertawakan orang-orang yang beriman. Dan apabila mereka (orang-orang yang beriman) melintas di hadapan mereka, mereka saling mengedip-ngedipkan matanya, dan apabila kembali kepada kaumnya, mereka kembali dengan gembira ria. Dan apabila mereka melihat (orang-orang mukmin), mereka mengatakan, \"Sesungguhnya mereka benar-benar orang-orang sesat,\" padahal (orang-orang yang berdosa itu), mereka tidak diutus sebagai penjaga (orang-orang mukmin). (al-Muthaffifin\/83: 29-33)",
      "text_translation": "Sesungguhnya ada segolongan dari hamba-hamba-Ku berdoa, “Ya Tuhan kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat, Engkau adalah pemberi rahmat yang terbaik.”",
      "text": "اِنَّهٗ كَانَ فَرِيْقٌ مِّنْ عِبَادِيْ يَقُوْلُوْنَ رَبَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَاَنْتَ خَيْرُ الرّٰحِمِيْنَ ۚ",
      "text_translation_en": "“Behold, there were among My servants such as would pray, ‘O our Sustainer! We have come to believe [in Thee]; forgive, then, our sins and bestow Thy mercy on us: for Thou art the truest bestower of mercy!’",
      "juz_number": 18
    },
    "110": {
      "text_tafsir_en": "In this verse God explains why their cause was tortured and punished, as well as the insulting answer of their request to return to the world. Such contempt arose because they insulted the believers of God, such as Bilal, Khabbab, shahaib and other weak believers, always drawing close to God, asserting their oath and confession of faith to him, justifying the apostles whom He has sent, always begging forgiveness and begging for His mercy because He is the best of all mercies. The infidels confronted the believers with ridicule, ridicule, and contempt. This verse also explains that the arrogance of those disbelievers makes fun of and makes fun of the believers, making them forget Allah. In line with this verse, God says: Truly sinners are the ones who used to laugh at believers. And when they (believers) pass before them, they blink their eyes, and when they return to their people they return with joy. And when they see (the believers), they say, \"Indeed, they are indeed astray,\" whereas (the sinners) they are not sent as guardians. (al-Muthaffifin \/ 83: 29-33)",
      "text_tafsir": "Pada ayat ini Allah menerangkan sebab musabab mereka disiksa dan diazab, serta jawaban yang menghina atas permintaan mereka kembali ke dunia. Hinaan itu muncul karena mereka menghina hamba-hamba Allah yang telah beriman, seperti Bilal, Khabbab, shuhaib dan orang-orang mukmin yang lemah lainnya, selalu mendekatkan diri kepada Allah, menegaskan ikrar dan pengakuan keimanan mereka kepada-Nya, membenar-kan para rasul yang telah diutus-Nya, senantiasa meminta ampunan dan memohon rahmat kepada-Nya karena Dialah pemberi rahmat yang sebaik-baiknya. Orang-orang kafir menghadapi orang-orang mukmin itu dengan sikap mengejek, menertawakan, dan menghina. Ayat ini juga menerangkan bahwa kesibukan orang-orang kafir itu mereka mengejek dan menertawakan orang-orang mukmin, membuat mereka lupa mengingat Allah. Sejalan dengan ayat ini, Allah berfirman:\n\nSesungguhnya orang-orang yang berdosa, adalah mereka yang dahulu menertawakan orang-orang yang beriman. Dan apabila mereka (orang-orang yang beriman) melintas di hadapan mereka, mereka saling mengedip-ngedipkan matanya, dan apabila kembali kepada kaumnya, mereka kembali dengan gembira ria. Dan apabila mereka melihat (orang-orang mukmin), mereka mengatakan, \"Sesungguhnya mereka benar-benar orang-orang sesat,\" padahal (orang-orang yang berdosa itu), mereka tidak diutus sebagai penjaga (orang-orang mukmin). (al-Muthaffifin\/83: 29-33)",
      "text_translation": "Lalu kamu jadikan mereka buah ejekan, sehingga kamu lupa mengingat Aku, dan kamu (selalu) menertawakan mereka,",
      "text": "فَاتَّخَذْتُمُوْهُمْ سِخْرِيًّا حَتّٰٓى اَنْسَوْكُمْ ذِكْرِيْ وَكُنْتُمْ مِّنْهُمْ تَضْحَكُوْنَ",
      "text_translation_en": "- but you made them a target of your derision to the point where it made you forget all remembrance of Me; and you went on and on laugh­ing at them.",
      "juz_number": 18
    },
    "111": {
      "text_tafsir_en": "This verse states that God will reward the believers on the Day of Judgment, because of their patience and perseverance in the face of ridicule and ridicule, and their obedience and obedience to His commandments. Verily, the believers are the victors and the lucky ones. In the hereafter, they sit on the couch while looking on, laughing at the unbelievers who once ridiculed them in the world. This is the reward for those who disbelieve in what they have done in the world, as Allah says: So today, those who believe in ridiculing those who disbelieve, they (sit) on the couch taking their eyes off. Are the infidels rewarded for what they have done? (al-Muthaffifin \/ 83: 34-36)",
      "text_tafsir": "Ayat ini menegaskan bahwa Allah akan memberi balasan kepada orang-orang mukmin pada hari Kiamat nanti, karena kesabaran dan ketabahan mereka menghadapi ejekan dan tertawaan orang-orang kafir, , serta ketaatan dan kepatuhan mereka kepada perintah-Nya. Sesungguhnya orang-orang mukmin, itulah orang-orang yang menang dan beruntung. Di akhirat kelak, mereka duduk di atas dipan-dipan sambil memandang santai, menertawakan orang-orang kafir yang menertawakan mereka dahulu di dunia. Inilah ganjaran bagi orang-orang kafir atas apa yang telah dikerjakannya di dunia, sebagaimana firman Allah:\n\nMaka pada hari ini, orang-orang yang beriman yang menertawakan orang-orang kafir, mereka (duduk) di atas dipan-dipan melepas pandangan. Apakah orang-orang kafir itu diberi balasan (hukuman) terhadap apa yang telah mereka perbuat? (al-Muthaffifin\/83: 34-36)",
      "text_translation": "sesungguhnya pada hari ini Aku memberi balasan kepada mereka, karena kesabaran mereka; sesungguhnya mereka itulah orang-orang yang memperoleh kemenangan.",
      "text": "اِنِّيْ جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوْٓاۙ اَنَّهُمْ هُمُ الْفَاۤىِٕزُوْنَ",
      "text_translation_en": "[But,] behold, today I have rewarded them for their patience in adversity: verily, it is they, they who have achieved a triumph!”",
      "juz_number": 18
    },
    "112": {
      "text_tafsir_en": "After the requests of the inhabitants of hell to be returned to the world were rejected by Allah by affirming that they would continue to curl up in hell and so as not to beg Him, they were asked again how long they lived on earth, from birth to leaving the mortal world to the afterlife.",
      "text_tafsir": "Setelah permintaan penghuni neraka untuk dikembalikan ke dunia ditolak Allah dengan penegasan bahwa mereka akan tetap meringkuk di neraka dan supaya tidak meminta-minta kepada-Nya, mereka ditanya lagi berapa lama mereka hidup di bumi, sejak dilahirkan sampai meninggalkan dunia fana itu ke alam baka.",
      "text_translation": "Dia (Allah) berfirman, “Berapa tahunkah lamanya kamu tinggal di bumi?”",
      "text": "قٰلَ كَمْ لَبِثْتُمْ فِى الْاَرْضِ عَدَدَ سِنِيْنَ",
      "text_translation_en": "[And] He will ask [the doomed]: “What number of years have you spent on earth?”",
      "juz_number": 18
    },
    "113": {
      "text_tafsir_en": "Because of the magnitude of the effects of the disasters on the inhabitants of hell and the severity of the torments and torments they suffered, those poor people could no longer remember how long they lived in the world. They feel very little, even they think that they live in the world for only one day or not until one day when compared to the afterlife. In this verse Allah encourages them to ask how long they lived in the world.",
      "text_tafsir": "Oleh karena besarnya pengaruh bencana yang menimpa penghuni neraka dan hebatnya siksaan dan azab yang dideritanya, maka mereka yang malang itu tidak lagi bisa mengingat berapa lama mereka tinggal di dunia. Mereka merasa sebentar sekali, bahkan mereka menyangka bahwa mereka tinggal di dunia hanya sehari atau tidak sampai satu hari jika dibandingkan dengan kehidupan akhirat. Pada ayat ini Allah menganjurkan kepada mereka untuk menanyakan berapa lama mereka tinggal di dunia.",
      "text_translation": "Mereka menjawab, “Kami tinggal (di bumi) sehari atau setengah hari, maka tanyakanlah kepada mereka yang menghitung.”",
      "text": "قَالُوْا لَبِثْنَا يَوْمًا اَوْ بَعْضَ يَوْمٍ فَسْـَٔلِ الْعَاۤدِّيْنَ ",
      "text_translation_en": "They will answer: ‘We have spent there a day, or part of a day; but ask those who [are able to] count [time] …”",
      "juz_number": 18
    },
    "114": {
      "text_tafsir_en": "This verse explains that they lived in the world for only a short time. Assuming they realize it when they live in the world, while the life they face in the hereafter is an infinite life, they will certainly do things that are beneficial and in accordance with what Allah has commanded. However, they do not realize it, so they deserve Allah's punishment. The Messenger of Allah (may peace be upon him) said: When Ibn 'Abi was careful to recite from Aiqa' bin 'Abd al-Kalai, Allah's Messenger (may peace be upon him) said that if the inhabitants of heaven had entered heaven and the inhabitants of hell had gone into hell; Allah says, \"O inhabitant of heaven! How long will you live on this earth?\" They replied, \"We stay in the world for just a day or not for a day.\" God says, \"It is good for you to invest that day, or not for one day. Then God said, \"O inhabitant of hell! How long will you live on this earth?\" They replied, \"We stay in the world for just a day or not for a day.\" God says, \"It is bad for you all to invest a day or not in a single day. You all accept my anger and enter into my Fire. Stay in hell forever.\"",
      "text_tafsir": "Ayat ini menerangkan bahwa mereka memang tinggal di dunia hanya sebentar. Andaikata mereka menyadari hal itu ketika mereka tinggal di dunia, sedang kehidupan yang dihadapinya di akhirat adalah kehidupan yang tiada batasnya, tentu mereka akan berbuat hal-hal yang bermanfaat dan sesuai dengan yang diperintahkan Allah. Akan tetapi, mereka lalai menyadarinya, sehingga mereka layak mendapat azab dari Allah. Rasulullah bersabda:\n\nKetika Ibnu Abi hatim meriwayatkan dari Aiqa' bin Abd al-Kalai, Rasulullah bersabda bahwa apabila penghuni surga telah masuk ke dalam surga dan penghuni neraka ke dalam neraka; Allah berfirman, \"Wahai penghuni surga! Berapa lama engkau hidup di dunia?\" Mereka menjawab, \"Kami tinggal di dunia hanya sehari atau tidak sampai satu hari.\" Allah berfirman, \"Alangkah baiknya engkau sekalian menginvestasikan waktu yang sehari itu, atau tidak sampai satu hari itu. Engkau sekalian memperoleh rahmat-Ku, rida-Ku dan surga-Ku. Tinggallah kamu sekalian di dalam surga untuk selama-lamanya.\" Sesudah itu Allah berfirman, \"Wahai penghuni neraka! Berapa lamakah kamu tinggal hidup di dunia?\" Mereka menjawab, \"Kami tinggal di dunia hanya sehari atau tidak sampai satu hari.\" Allah berfirman, \"Alangkah buruknya kamu sekalian menginvestasikan waktu yang sehari atau tidak sampai satu hari itu. Kamu sekalian menerima murka-Ku dan memasuki neraka-Ku. Tinggallah di dalam neraka untuk selama-lamanya.\"",
      "text_translation": "Dia (Allah) berfirman, “Kamu tinggal (di bumi) hanya sebentar saja, jika kamu benar-benar mengetahui.” ",
      "text": "قٰلَ اِنْ لَّبِثْتُمْ اِلَّا قَلِيْلًا لَّوْ اَنَّكُمْ كُنْتُمْ تَعْلَمُوْنَ",
      "text_translation_en": "[Whereupon] He will say: “You have spent there but a short while: had you but known [how short it was to be]!",
      "juz_number": 18
    },
    "115": {
      "text_tafsir_en": "This verse explains that the disobedience of the Hellenists about the day of the resurrection relates to their belief that life ends with death, so that God needs to remind them of the question, \"Do they think that they were created by us as fools, as animals, are they rewarded and not punished? Or do they think that they will not be returned to us? \" No, not again. They were created as servants of God and given a duty. Whoever performs their duties, they are rewarded, and for those who neglect their duties, they will be rewarded and returned to God for taking responsibility for everything they do in the world, as God says: Do men think that they will be left alone? (Without responsibility?) (Al-Qiyamah \/ 75: 36)",
      "text_tafsir": "Ayat ini menerangkan bahwa keingkaran para penghuni neraka tentang adanya hari kebangkitan berkaitan dengan keyakinan mereka bahwa kehidupan berakhir dengan kematian, sehingga Allah perlu mengingatkan mereka dengan pertanyaan, \"Apakah mereka menyangka bahwa mereka Kami ciptakan dengan main-main, dibiarkan begitu saja seperti halnya binatang, tidak diberi pahala dan tidak diazab? Ataukah mereka mengira bahwa mereka itu tidak akan dikembalikan kepada Kami?\" Tidak, sekali lagi tidak. Mereka diciptakan sebagai hamba Allah dan diberi kewajiban. Siapa yang melaksanakan kewajiban, mereka diberi pahala, dan bagi yang menyia-nyiakan kewajiban, mereka akan diazab dan dikembalikan kepada Allah untuk mempertanggungjawabkan segala per-buatan mereka di dunia, sesuai firman Allah:\n\nApakah manusia mengira, bahwa ia akan dibiarkan begitu saja? (Tanpa pertanggungjawaban?) (al-Qiyamah\/75: 36)",
      "text_translation": "Maka apakah kamu mengira, bahwa Kami menciptakan kamu main-main (tanpa ada maksud) dan bahwa kamu tidak akan dikembalikan kepada Kami?",
      "text": "اَفَحَسِبْتُمْ اَنَّمَا خَلَقْنٰكُمْ عَبَثًا وَّاَنَّكُمْ اِلَيْنَا لَا تُرْجَعُوْنَ",
      "text_translation_en": "Did you, then, think that We created you in mere idle play, and that you would not have to return to Us?”",
      "juz_number": 18
    },
    "116": {
      "text_tafsir_en": "This verse explains that Allah is the Most Holy of what the polytheists have accused Him of, so does the suspicion that He created man in vain, because He is the true God. There is no god but He, God who has a 'noble Arsy. He is the one who governs this universe, both above and below, as well as all His creatures. God's Word: And we do not play around creating the heavens and the earth and what is between them. We have not created both but with haq (true), but most of them do not know. (ad-Dukhan \/ 44: 38-39)",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah Mahasuci dari apa yang dituduhkan orang-orang musyrik kepada-Nya, begitu pula sangkaan bahwa Dia menciptakan manusia secara sia-sia, karena Dia adalah Tuhan yang sebenarnya. Tiada tuhan melainkan Dia, Tuhan yang memiliki 'Arsy yang mulia. Dialah yang mengatur alam raya ini, baik yang di atas maupun yang di bawah, begitu pula semua makhluk ciptaan-Nya. Firman Allah:\n\nDan tidaklah Kami bermain-main menciptakan langit dan bumi dan apa yang ada di antara keduanya. Tidaklah Kami ciptakan keduanya melainkan dengan haq (benar), tetapi kebanyakan mereka tidak mengetahui. (ad-Dukhan\/44:38-39)",
      "text_translation": "Maka Mahatinggi Allah, Raja yang sebenarnya; tidak ada tuhan (yang berhak disembah) selain Dia, Tuhan (yang memiliki) ‘Arsy yang mulia.",
      "text": "فَتَعٰلَى اللّٰهُ الْمَلِكُ الْحَقُّۚ  لَآ اِلٰهَ اِلَّا هُوَۚ رَبُّ الْعَرْشِ الْكَرِيْمِ",
      "text_translation_en": "[KNOW,] then, [that] God is sublimely exalted, the Ultimate Sovereign, the Ultimate Truth: there is no deity save Him, the Sustainer, in bountiful almightiness enthroned!",
      "juz_number": 18
    },
    "117": {
      "text_tafsir_en": "This verse explains that those who worship God and associate him with other gods, though none are worthy of worship except God, in fact there is no justification for their actions. They shall be brought before God, to count and account for all their works. Allah will reward them for their deeds. Surely those who disbelieve will never prosper, nor will they escape the torment that torments them.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang menyembah Allah dan menyekutukan-Nya dengan tuhan yang lain, padahal tidak ada yang pantas disembah melainkan Allah, pada hakikatnya tidak ada alasan sama sekali yang dapat membenarkan perbuatan mereka itu. Mereka akan diajukan ke hadapan Allah, untuk memperhitungkan dan mempertanggung-jawabkan segala perbuatan mereka. Allah yang akan menyempurnakan ganjaran atas perbuatan mereka. Sesungguhnya orang-orang kafir itu tidak akan beruntung selama-lamanya, dan tidak akan luput dari azab yang menyiksanya.",
      "text_translation": "Dan barang siapa menyembah tuhan yang lain selain Allah, padahal tidak ada suatu bukti pun baginya tentang itu, maka perhitungannya hanya pada Tuhannya. Sesungguhnya orang-orang kafir itu tidak akan beruntung.",
      "text": "وَمَنْ يَّدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ لَا بُرْهَانَ لَهٗ بِهٖۙ فَاِنَّمَا حِسَابُهٗ عِنْدَ رَبِّهٖۗ اِنَّهٗ لَا يُفْلِحُ الْكٰفِرُوْنَ",
      "text_translation_en": "Hence, he who invokes, side by side with God, any other deity [- a deity] for whose existence he has no evidence - shall but find his reckoning with his Sustainer: [and,] verily, such deniers of the truth will never attain to a happy state!",
      "juz_number": 18
    },
    "118": {
      "text_tafsir_en": "This verse explains that after explaining the condition of the unbelievers, their foolishness in the world and the torment provided for them in the hereafter, God instructed His Messenger to ask Him to be forgiven of all his wrongdoing, be merciful and accept his repentance, and be set free. from the torment of the ignorance and the error which he has committed, for He is the best Merciful. God's command to His Apostles as mentioned above, is to be a good example to His people. Whenever they do wrong, they will repent, and every one of them do evil, that they may repent, lest they may be blasphemed, for this shall be a heavy burden in the last day.",
      "text_tafsir": "Ayat ini menerangkan bahwa setelah menjelaskan keadaan orang-orang kafir, kebodohan mereka di dunia dan siksaan yang disediakan bagi mereka di akhirat, Allah memerintahkan Rasul-Nya supaya memohon kepada-Nya agar dimaafkan semua kesalahan yang diperbuatnya, diberi rahmat dengan diterima tobatnya, dan dibebaskan dari azab atas kelalaian dan kekeliruan yang telah diperbuatnya, karena Dialah Pemberi rahmat yang paling baik. Perintah Allah kepada Rasul-Nya seperti tersebut di atas, adalah untuk menjadi contoh yang baik bagi umatnya. Setiap kali mereka berbuat kesalahan, supaya mereka beristigfar, dan setiap mereka berbuat maksiat, supaya cepat-cepat bertobat, jangan sampai kesalahan dan maksiat itu bertumpuk-tumpuk, karena yang demikian itu akan menjadi beban yang berat nanti di hari akhirat.",
      "text_translation": "Dan katakanlah (Muhammad), “Ya Tuhanku, berilah ampunan dan (berilah) rahmat, Engkaulah pemberi rahmat yang terbaik.”",
      "text": "وَقُلْ رَّبِّ اغْفِرْ وَارْحَمْ وَاَنْتَ خَيْرُ الرّٰحِمِيْنَ ࣖ",
      "text_translation_en": "Hence, [O believer,] say: “O my Sustainer! Grant [me] forgiveness and bestow Thy mercy [upon me]: for Thou art the truest bestower of mercy!”",
      "juz_number": 18
    }
  },
  "name": "المؤمنون",
  "name_translation_en": "The Believers",
  "name_translation": "Orang-Orang Mukmin",
  "name_latin": "Al-Mu'minun"
}