{
  "number": 25,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 77,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse God commends himself by passing down the Qur'an to the Prophet Muhammad (peace be upon him) whom he calls \"his servant\" to serve as a warning to the universe (human and spiritual). By praising himself for passing down the Qur'an to the Prophet Muhammad it can be understood that the Qur'an is a very important and very important book in the sight of Allah, for the Qur'an is a guide and the living guidelines for His glorified beings are human, while all other creations in heaven and on earth are for the benefit of man himself. In this verse Allah does not mention the Qur'an but al-Furqan because it is the right and the difference between guidance and error. The Qur'an was revealed to all mankind in the time of Prophet Muhammad and afterwards until the Day of Judgment, because the prophets before Muhammad were only sent to his people while Muhammad was sent to mankind at all times and in all places. Similarly, God did not mention Muhammad or His Messenger but rather called \"His servant\" in order to glorify Him by that title. Man who truly commits himself to God confesses his uniqueness and power, obeys and obeys his commands always making his guidance his life, loving God more than anything in this world, that is the true servant of God, the servant of God is contained in this Surah al-Furqan. In other verses Allah mentions the Prophet Muhammad with the predicate of \"His servant\" as His word: the Holy One (Allah), who guided his servant (Muhammad) in the night from the Mosque to the Aqsa Mosque which We have blessed around . (al-Isra '\/ 17: 1) And his word: And verily, when the servant of Allah (Muhammad) stood up to worship him, they (the jinn-jinn) pressed on him. (al-Jin \/ 72: 19) And His Word is: Praise be to Allah who has revealed the Book (the Qur'an) to His servant and He has not made it twisted. (al-Kahf \/ 18: 1) After God mentioned himself Who sent down the Furqan to his servant, then he acknowledged himself that He is the owner of the heavens and the earth and the sovereignty of the two, sending and administering it according to wisdom, He conforms to the importance and importance of each of His creations. God also stated that He did not have children as the Jews, Jews and Muslims claimed, as he says: And the Jews said, \"Uzair the son of God,\" and the Christians said, \" Christ the son of God. \" That's the word that comes out of their mouths. They imitate the words of the former infidels. God cursed them; how did they turn away? (at-Taubah \/ 9:30) And He said: Then ask them (those who disbelieve in Mecca), \"Are the daughters for your Lord and for the sons?\" or do We create angels as women when they see (her)? Remember, in fact, among their lies they say, \"God has a son.\" And really, they're really liars. Does He (Allah) choose daughters over sons? (as-shaffat \/ 37: 149-153) Furthermore, Allah declares that He does not associate with others in His power, only He is to be worshiped and to Him only men should ask for something, not as human beings do. have gone astray worshiping His creatures such as worshiping humans, idols and other things. Then Allah declares that He is the Creator of all wisdom and governs it according to His will and knowledge. To sum up everything in this world both in heaven and on earth is His being. He is the Creator of no Creator but He has no allies to worship Him, all under His control and submissive to the Sunnah and His decrees. Never imagine or imagine in the human mind that He has children or has allies.",
      "text_tafsir": "Pada ayat ini Allah memuji diri-Nya dengan menurunkan Al-Qur'an kepada Nabi Muhammad saw yang disebutnya \"hamba-Nya\" untuk menjadi peringatan bagi alam semesta (manusia dan jin). Dengan pujian terhadap diri-Nya karena Dia menurunkan Al-Qur'an kepada Nabi Muhammad dapatlah dipahami bahwa Al-Qur'an itu adalah suatu kitab yang amat penting dan amat tinggi nilainya di sisi Allah, karena Al-Qur'an itu adalah petunjuk dan pedoman hidup bagi makhluk-Nya yang dimuliakan-Nya yaitu manusia, sedangkan ciptaan-ciptaan lainnya baik di langit maupun di bumi adalah untuk kepentingan manusia itu sendiri. Pada ayat ini Allah tidak menyebut Al-Qur'an tetapi al-Furqan karena Al-Qur'an itu adalah pembeda yang hak dan yang batil antara petunjuk dan kesesatan. Al-Qur'an diturunkan untuk seluruh umat manusia di masa Nabi Muhammad dan masa sesudahnya sampai hari Kiamat, karena nabi-nabi sebelum Muhammad saw hanya diutus untuk kaumnya sedang Nabi Muhammad diutus untuk manusia di segala masa dan di semua tempat. \n\nDemikian pula Allah tidak menyebut nama Muhammad atau Rasul-Nya tetapi menyebut \"hamba-Nya\" karena hendak memuliakan-Nya dengan gelar itu. Manusia yang benar-benar memperhambakan dirinya kepada Allah mengaku keesaan dan kekuasaan-Nya, taat dan patuh menjalankan perintah-Nya selalu menjadikan petunjuk-Nya sebagai pedoman hidupnya, mencintai Allah secara hakiki lebih daripada apa pun di dunia ini, itulah hamba Allah yang hakiki, hamba Allah terkandung di dalam Surah al-Furqan ini. Di dalam ayat-ayat lain Allah menyebut Nabi Muhammad saw dengan predikat \"hamba-Nya\" seperti firman-Nya:\n\nMahasuci (Allah), yang telah memperjalankan hamba-Nya (Muhammad) pada malam hari dari Masjidilharam ke Masjidil Aqsa yang telah Kami berkahi sekelilingnya. (al-Isra'\/17: 1)\n\nDan firman-Nya:\n\nDan sesungguhnya ketika hamba Allah (Muhammad) berdiri menyembah-Nya (melaksanakan salat), mereka (jin-jin) itu berdesakan mengerumuninya. (al-Jin\/72: 19)\n\nDan firman-Nya:\n\nSegala puji bagi Allah yang telah menurunkan Kitab (Al-Qur'an) kepada hamba-Nya dan Dia tidak menjadikannya bengkok. (al-Kahf\/18: 1)\n\nSetelah Allah menyebutkan diri-Nya Yang menurunkan al-Furqan kepada hamba-Nya, barulah Dia mensifati diri-Nya bahwa Dialah pemilik langit dan bumi dan yang berkuasa atas keduanya, mengutus dan mengurusnya menurut hikmah kebijaksanaan-Nya sesuai dengan kepentingan dan kemaslahatan masing-masing ciptaan-Nya itu. Allah menyatakan pula bahwa Dia tidak mempunyai anak sebagaimana dituduhkan oleh kaum Nasrani, orang-orang Yahudi dan kaum musyrikin, sebagaimana tersebut dalam firman-Nya:\n\nDan orang-orang Yahudi berkata, \"Uzair putra Allah,\" dan orang-orang Nasrani berkata, \"Al-Masih putra Allah.\" Itulah ucapan yang keluar dari mulut mereka. Mereka meniru ucapan orang-orang kafir yang terdahulu. Allah melaknat mereka; bagaimana mereka sampai berpaling? (at-Taubah\/9: 30)\n\nDan firman-Nya:\n\nMaka tanyakanlah (Muhammad) kepada mereka (orang-orang kafir Mekah), \"Apakah anak-anak perempuan itu untuk Tuhanmu sedangkan untuk mereka anak-anak laki-laki?\" atau apakah Kami menciptakan malaikat-malaikat berupa perempuan sedangkan mereka menyaksikan(nya)? Ingatlah, sesungguhnya di antara kebohongannya mereka benar-benar mengatakan, \"Allah mempunyai anak.\" Dan sungguh, mereka benar-benar pendusta. Apakah Dia (Allah) memilih anak-anak perempuan daripada anak-anak laki-laki? (as-shaffat\/37: 149-153)\n\nSelanjutnya Allah menyatakan lagi bahwa Dia tidak bersekutu dengan lainnya dalam kekuasaan-Nya, hanya Dialah yang patut disembah dan kepada-Nya sajalah manusia harus memohonkan sesuatu, bukan seperti yang dilakukan oleh manusia-manusia yang telah sesat yang menyembah makhluk-Nya seperti menyembah manusia, berhala dan benda-benda lainnya. Kemudian Allah menyatakan pula bahwa Dialah Pencipta segala sesuatu sesuai dengan hikmah kebijaksanaan-Nya dan mengaturnya menurut kehendak dan Ilmu-Nya.\n\nRingkasnya segala sesuatu dalam alam ini baik di langit maupun di bumi adalah makhluk-Nya. Dialah Penciptanya tidak ada Pencipta selain Dia tidak ada sekutu bagi-Nya yang patut disembah, semua berada di bawah kekuasaan-Nya dan tunduk patuh kepada sunnah dan peraturan yang telah ditetapkan-Nya. Janganlah sekali-kali terbayang atau terlintas dalam pikiran manusia bahwa Dia mempunyai anak atau mempunyai sekutu.",
      "text_translation": "Mahasuci Allah yang telah menurunkan Furqan (Al-Qur'an) kepada hamba-Nya (Muhammad), agar dia menjadi pemberi peringatan kepada seluruh alam (jin dan manusia).",
      "text": "تَبٰرَكَ الَّذِيْ نَزَّلَ الْفُرْقَانَ عَلٰى عَبْدِهٖ لِيَكُوْنَ لِلْعٰلَمِيْنَ نَذِيْرًا ۙ",
      "text_translation_en": "Hallowed is He who from on high, step by step, has bestowed upon His servant the standard by which to discern the true from the false, so that to all the world it might be a warning:",
      "juz_number": 18
    },
    "2": {
      "text_tafsir_en": "In this verse God commends himself by passing down the Qur'an to the Prophet Muhammad (peace be upon him) whom he calls \"his servant\" to serve as a warning to the universe (human and spiritual). By praising himself for passing down the Qur'an to the Prophet Muhammad it can be understood that the Qur'an is a very important and very important book in the sight of Allah, for the Qur'an is a guide and the living guidelines for His glorified beings are human, while all other creations in heaven and on earth are for the benefit of man himself. In this verse Allah does not mention the Qur'an but al-Furqan because it is the right and the difference between guidance and error. The Qur'an was revealed to all mankind in the time of Prophet Muhammad and afterwards until the Day of Judgment, because the prophets before Muhammad were only sent to his people while Muhammad was sent to mankind at all times and in all places. Similarly, God did not mention Muhammad or His Messenger but rather called \"His servant\" in order to glorify Him by that title. Man who truly commits himself to God confesses his uniqueness and power, obeys and obeys his commands always making his guidance his life, loving God more than anything in this world, that is the true servant of God, the servant of God is contained in this Surah al-Furqan. In other verses Allah mentions the Prophet Muhammad with the predicate of \"His servant\" as His word: the Holy One (Allah), who guided his servant (Muhammad) in the night from the Mosque to the Aqsa Mosque which We have blessed around . (al-Isra '\/ 17: 1) And his word: And verily, when the servant of Allah (Muhammad) stood up to worship him, they (the jinn-jinn) pressed on him. (al-Jin \/ 72: 19) And His Word is: Praise be to Allah who has revealed the Book (the Qur'an) to His servant and He has not made it twisted. (al-Kahf \/ 18: 1) After God mentioned himself Who sent down the Furqan to his servant, then he acknowledged himself that He is the owner of the heavens and the earth and the sovereignty of the two, sending and administering it according to wisdom, He conforms to the importance and importance of each of His creations. God also stated that He did not have children as the Jews, Jews and Muslims claimed, as he says: And the Jews said, \"Uzair the son of God,\" and the Christians said, \" Christ the son of God. \" That's the word that comes out of their mouths. They imitate the words of the former infidels. God cursed them; how did they turn away? (at-Taubah \/ 9:30) And He said: Then ask them (those who disbelieve in Mecca), \"Are the daughters for your Lord and for the sons?\" or do We create angels as women when they see (her)? Remember, in fact, among their lies they say, \"God has a son.\" And really, they're really liars. Does He (Allah) choose daughters over sons? (as-shaffat \/ 37: 149-153) Furthermore, Allah declares that He does not associate with others in His power, only He is to be worshiped and to Him only men should ask for something, not as human beings do. have gone astray worshiping His creatures such as worshiping humans, idols and other things. Then Allah declares that He is the Creator of all wisdom and governs it according to His will and knowledge. To sum up everything in this world both in heaven and on earth is His being. He is the Creator of no Creator but He has no allies to worship Him, all under His control and submissive to the Sunnah and His decrees. Never imagine or imagine in the human mind that He has children or has allies.",
      "text_tafsir": "Pada ayat ini Allah memuji diri-Nya dengan menurunkan Al-Qur'an kepada Nabi Muhammad saw yang disebutnya \"hamba-Nya\" untuk menjadi peringatan bagi alam semesta (manusia dan jin). Dengan pujian terhadap diri-Nya karena Dia menurunkan Al-Qur'an kepada Nabi Muhammad dapatlah dipahami bahwa Al-Qur'an itu adalah suatu kitab yang amat penting dan amat tinggi nilainya di sisi Allah, karena Al-Qur'an itu adalah petunjuk dan pedoman hidup bagi makhluk-Nya yang dimuliakan-Nya yaitu manusia, sedangkan ciptaan-ciptaan lainnya baik di langit maupun di bumi adalah untuk kepentingan manusia itu sendiri. Pada ayat ini Allah tidak menyebut Al-Qur'an tetapi al-Furqan karena Al-Qur'an itu adalah pembeda yang hak dan yang batil antara petunjuk dan kesesatan. Al-Qur'an diturunkan untuk seluruh umat manusia di masa Nabi Muhammad dan masa sesudahnya sampai hari Kiamat, karena nabi-nabi sebelum Muhammad saw hanya diutus untuk kaumnya sedang Nabi Muhammad diutus untuk manusia di segala masa dan di semua tempat. \n\nDemikian pula Allah tidak menyebut nama Muhammad atau Rasul-Nya tetapi menyebut \"hamba-Nya\" karena hendak memuliakan-Nya dengan gelar itu. Manusia yang benar-benar memperhambakan dirinya kepada Allah mengaku keesaan dan kekuasaan-Nya, taat dan patuh menjalankan perintah-Nya selalu menjadikan petunjuk-Nya sebagai pedoman hidupnya, mencintai Allah secara hakiki lebih daripada apa pun di dunia ini, itulah hamba Allah yang hakiki, hamba Allah terkandung di dalam Surah al-Furqan ini. Di dalam ayat-ayat lain Allah menyebut Nabi Muhammad saw dengan predikat \"hamba-Nya\" seperti firman-Nya:\n\nMahasuci (Allah), yang telah memperjalankan hamba-Nya (Muhammad) pada malam hari dari Masjidilharam ke Masjidil Aqsa yang telah Kami berkahi sekelilingnya. (al-Isra'\/17: 1)\n\nDan firman-Nya:\n\nDan sesungguhnya ketika hamba Allah (Muhammad) berdiri menyembah-Nya (melaksanakan salat), mereka (jin-jin) itu berdesakan mengerumuninya. (al-Jin\/72: 19)\n\nDan firman-Nya:\n\nSegala puji bagi Allah yang telah menurunkan Kitab (Al-Qur'an) kepada hamba-Nya dan Dia tidak menjadikannya bengkok. (al-Kahf\/18: 1)\n\nSetelah Allah menyebutkan diri-Nya Yang menurunkan al-Furqan kepada hamba-Nya, barulah Dia mensifati diri-Nya bahwa Dialah pemilik langit dan bumi dan yang berkuasa atas keduanya, mengutus dan mengurusnya menurut hikmah kebijaksanaan-Nya sesuai dengan kepentingan dan kemaslahatan masing-masing ciptaan-Nya itu. Allah menyatakan pula bahwa Dia tidak mempunyai anak sebagaimana dituduhkan oleh kaum Nasrani, orang-orang Yahudi dan kaum musyrikin, sebagaimana tersebut dalam firman-Nya:\n\nDan orang-orang Yahudi berkata, \"Uzair putra Allah,\" dan orang-orang Nasrani berkata, \"Al-Masih putra Allah.\" Itulah ucapan yang keluar dari mulut mereka. Mereka meniru ucapan orang-orang kafir yang terdahulu. Allah melaknat mereka; bagaimana mereka sampai berpaling? (at-Taubah\/9: 30)\n\nDan firman-Nya:\n\nMaka tanyakanlah (Muhammad) kepada mereka (orang-orang kafir Mekah), \"Apakah anak-anak perempuan itu untuk Tuhanmu sedangkan untuk mereka anak-anak laki-laki?\" atau apakah Kami menciptakan malaikat-malaikat berupa perempuan sedangkan mereka menyaksikan(nya)? Ingatlah, sesungguhnya di antara kebohongannya mereka benar-benar mengatakan, \"Allah mempunyai anak.\" Dan sungguh, mereka benar-benar pendusta. Apakah Dia (Allah) memilih anak-anak perempuan daripada anak-anak laki-laki? (as-shaffat\/37: 149-153)\n\nSelanjutnya Allah menyatakan lagi bahwa Dia tidak bersekutu dengan lainnya dalam kekuasaan-Nya, hanya Dialah yang patut disembah dan kepada-Nya sajalah manusia harus memohonkan sesuatu, bukan seperti yang dilakukan oleh manusia-manusia yang telah sesat yang menyembah makhluk-Nya seperti menyembah manusia, berhala dan benda-benda lainnya. Kemudian Allah menyatakan pula bahwa Dialah Pencipta segala sesuatu sesuai dengan hikmah kebijaksanaan-Nya dan mengaturnya menurut kehendak dan Ilmu-Nya.\n\nRingkasnya segala sesuatu dalam alam ini baik di langit maupun di bumi adalah makhluk-Nya. Dialah Penciptanya tidak ada Pencipta selain Dia tidak ada sekutu bagi-Nya yang patut disembah, semua berada di bawah kekuasaan-Nya dan tunduk patuh kepada sunnah dan peraturan yang telah ditetapkan-Nya. Janganlah sekali-kali terbayang atau terlintas dalam pikiran manusia bahwa Dia mempunyai anak atau mempunyai sekutu.",
      "text_translation": "Yang memiliki kerajaan langit dan bumi, tidak mempunyai anak, tidak ada sekutu bagi-Nya dalam kekuasaan(-Nya), dan Dia menciptakan segala sesuatu, lalu menetapkan ukuran-ukurannya dengan tepat. ",
      "text": " ۨالَّذِيْ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَّلَمْ يَكُنْ لَّهٗ شَرِيْكٌ فِى الْمُلْكِ وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهٗ تَقْدِيْرًا",
      "text_translation_en": "He to whom the dominion over the heavens and the earth belongs, and who begets no offspring, and has no partner in His dominion: for it is He who creates every thing and determines its nature in accordance with [His own] design.",
      "juz_number": 18
    },
    "3": {
      "text_tafsir_en": "Allah explains in this verse that the idolatrous worship of the infidels has no meaning at all, and that none of the attributes of perfection nor of the properties possessed by the idols are merely defective properties. How strange is the thinking of those who make idols as gods, worship them and seek their help. Among the degraded attributes of idolatry are: a.The idols cannot create anything, while the worshiper is God the Creator. b.The idols themselves were made by their worshipers. How foolish are the people who worship their homelands lower than themselves. c.The idols are powerless and do not have the power to take action, cannot bring any benefit to themselves or to their worshipers, cannot defend themselves or defend and help others. It is useless to worship statues of this nature. d.The idols cannot turn or kill or gather people to account for their deeds. While for himself the idol cannot give life because it turns out he is still a dead thing, let alone to give life to others. These are the idolatrous things worshiped by the Meccanic monks. Why do they not worship the One who is perfect in all things, the Almighty?",
      "text_tafsir": "Allah menjelaskan dalam ayat ini bahwa berhala-berhala sembahan orang-orang kafir tidak ada sedikit pun mempunyai arti, dan tidak sedikit pun mempunyai sifat kesempurnaan bahkan sifat-sifat yang dimiliki berhala itu hanyalah sifat-sifat kekurangan belaka. Sungguh amat aneh jalan pikiran orang-orang yang menjadikan berhala sebagai tuhan, menyembahnya dan memohonkan pertolongan kepadanya. \n\nDi antara sifat-sifat berhala yang tercela ialah:\n\na.Berhala-berhala itu tidak dapat menciptakan sesuatu apapun, sedang yang patut disembah ialah Allah Yang Maha Pencipta. \n\nb.Berhala-berhala itu sendiri dibuat oleh para penyembahnya. Alangkah bodohnya manusia-manusia yang menyembah buatan mereka sendiri yang lebih rendah derajatnya daripada diri mereka.\n\nc.Berhala-berhala itu tak berdaya dan tak mempunyai tenaga untuk melakukan suatu tindakan, tidak dapat mendatangkan manfaat apapun bagi dirinya sendiri apalagi bagi penyembah-penyembahnya, tidak dapat membela dirinya apalagi untuk membela dan menolong orang lain. Memang tidak ada gunanya menyembah patung-patung yang demikian sifatnya. \n\nd.Berhala-berhala itu tidak dapat menghidupkan atau mematikan atau mengumpulkan manusia untuk memperhitungkan amal perbuatan mereka. Sedangkan untuk dirinya sendiri berhala itu tidak dapat memberika kehidupan karena ternyata dia tetap saja sebagai benda mati, apalagi untuk memberikan kehidupan kepada orang lain. Inilah sifat-sifat berhala yang disembah oleh orang-orang musyrikin Mekah itu. Mengapa mereka tidak menyembah Allah yang mempunyai sifat kesempurnaan Yang Maha Esa, Mahakuasa atas segala sesuatu.",
      "text_translation": "Namun mereka mengambil tuhan-tuhan selain Dia (untuk disembah), padahal mereka (tuhan-tuhan itu) tidak menciptakan apa pun, bahkan mereka sendiri diciptakan dan tidak kuasa untuk (menolak) bahaya terhadap dirinya dan tidak dapat (mendatangkan) manfaat serta tidak kuasa mematikan, menghidupkan dan tidak (pula) membangkitkan.",
      "text": "وَاتَّخَذُوْا مِنْ دُوْنِهٖٓ اٰلِهَةً لَّا يَخْلُقُوْنَ شَيْـًٔا وَّهُمْ يُخْلَقُوْنَ وَلَا يَمْلِكُوْنَ لِاَنْفُسِهِمْ ضَرًّا وَّلَا نَفْعًا وَّلَا يَمْلِكُوْنَ مَوْتًا وَّلَا حَيٰوةً وَّلَا نُشُوْرًا",
      "text_translation_en": "And yet, some choose to worship, instead of Him, imaginary deities that cannot create anything but are themselves created, and have it not within their power to avert harm from, or bring benefit to, themselves, and have no power over death, nor over life, nor over resurrection!",
      "juz_number": 18
    },
    "4": {
      "text_tafsir_en": "The unbelievers say that the Qur'an is not the book that Allah sent down. The Qur'an is just a lie made by Muhammad and in the making of it he is assisted by a group of believers who believe. Muhammad, according to them, always met with a group of scholars and they taught him stories of the ancient peoples and then compiled them in Arabic in good order. It is reported that these verses came down to Nadr bin al-Haris and those who helped Muhammad were Addas slaves Khuwatih bin Abdul Uzza, Yasar slaves al-A'la bin al-Khadrami and Abu Fukaihah ar-Rumi. They were Jewish believers who read the Torah and told many stories about ancient peoples. Then they converted to Islam and many related to Prophet Muhammad. That is why Nadr bin Haris dared to make false accusations. So Allah denied the accusation and said that those who made the false accusations had done wrong and lied. It is clear that the accusation was made because the Qur'an itself and its verses have challenged the Arabs to make one chapter of the same verse and its verse with one of the Qur'anic verses. If they do not succeed then the Qur'an is not Muhammad's creation but a revelation from Allah. It is said in His Word: And if you doubt (the Qur'an) that We have sent down to our servants, then make a surah with him and invite your helpers other than Allah if you are true men. . (al-Baqarah \/ 2: 23) Since none of them can answer the challenge even though they have worked hard, it is true that the Qur'an is not man-made but the revelation of God. But since there is no way for them to oppose the Qur'an, they look for reasons to reject it and they make the above statements.",
      "text_tafsir": "Orang-orang kafir mengatakan bahwa Al-Qur'an itu bukanlah kitab yang diturunkan Allah. Al-Qur'an itu hanyalah suatu kebohongan yang dibuat-buat oleh Muhammad dan dalam membuat Al-Qur'an itu dia dibantu oleh sekelompok ahli kitab yang telah beriman. Muhammad menurut mereka, selalu menemui kelompok ahli kitab itu dan mereka mengajarkan kepadanya kisah-kisah tentang umat-umat yang terdahulu kemudian Muhammad menyusun kisah-kisah itu dalam bahasa Arab yang baik susunan redaksinya.\n\nDiriwayatkan bahwa ayat-ayat ini turun mengenai Nadr bin al-Haris dan orang-orang yang membantu Muhammad ialah Addas budak Khuwatih bin Abdul Uzza, Yasar budak al-A'la bin al-Khadrami dan Abu Fukaihah ar-Rumi. Semula mereka adalah penganut agama Yahudi yang pandai membaca Taurat dan banyak bercerita tentang kisah umat terdahulu. Kemudian mereka masuk Islam dan banyak berhubungan dengan Nabi Muhammad. Oleh sebab itulah Nadr bin Haris berani mengadakan tuduhantuduhan palsu itu. Maka Allah menolak tuduhan tersebut dan mengatakan bahwa orang-orang yang membuat tuduhan palsu itu telah berbuat zalim dan berdusta. Jelaslah bahwa tuduhan itu dibuat-buat karena Al-Qur'an sendiri dengan ayat-ayatnya telah menantang orang-orang Arab untuk membuat satu surah yang sama fasahah dan balagahnya dengan suatu surah dari Al-Qur'an. Kalau mereka tidak berhasil pastilah Al-Qur'an itu bukan bikinan Muhammad tetapi benar-benar wahyu dari Allah. Hal itu tersebut dalam firman-Nya:\n\nDan jika kamu meragukan (Al-Qur'an) yang Kami turunkan kepada hamba Kami (Muhammad), maka buatlah satu surah semisal dengannya dan ajaklah penolong-penolongmu selain Allah, jika kamu orang-orang yang benar. (al-Baqarah\/2: 23)\n\nKarena tidak ada seorang pun di antara mereka yang dapat menjawab tantangan itu walaupun mereka telah berusaha dengan sekuat tenaga, maka benarlah bahwa Al-Qur'an itu bukan buatan manusia melainkan wahyu dari Allah. Tetapi karena tidak ada jalan bagi mereka untuk menentang Al-Qur'an, mereka mencari berbagai alasan untuk mendustakannya dan mereka membuat berita-berita seperti tersebut di atas.",
      "text_translation": "Dan orang-orang kafir berkata, “(Al-Qur'an) ini tidak lain hanyalah kebohongan yang diada-adakan oleh dia (Muhammad), dibantu oleh orang-orang lain,” Sungguh, mereka telah berbuat zalim dan dusta yang besar.",
      "text": "وَقَالَ الَّذِيْنَ كَفَرُوْٓا اِنْ هٰذَآ اِلَّآ اِفْكُ ِۨافْتَرٰىهُ وَاَعَانَهٗ عَلَيْهِ قَوْمٌ اٰخَرُوْنَۚ فَقَدْ جَاۤءُوْ ظُلْمًا وَّزُوْرًا ۚ",
      "text_translation_en": "Moreover, those who are bent on denying the truth are wont to say, “This [Qur’an] is nothing but a lie, which he [himself] has devised with the help of other people, who thereupon have perverted the truth and brought a falsehood into being.”",
      "juz_number": 18
    },
    "5": {
      "text_tafsir_en": "The infidels said that the Qur'an was just the ancient folklore that they wrote in books, and that the Prophet Muhammad asked the Jews to copy it and read it to him so that he could memorize it morning and evening. It was only after he memorized that he recited to his friends and followers as the Qur'an came down from heaven. How dare they invent something that never happened to the Prophet Muhammad. If this were true then his friends would have known it and they would not have believed him. Though Prophet Muhammad was known to them from childhood as the most trusted, honest and never false. Is it possible that such a person from the time he was a child would deceive his loyal ones and proclaim things that are not? (6) Because the disbelievers were making too many false accusations, while they were being challenged in such a way that they could not answer the challenge, Allah ordered the Prophet Muhammad to declare to them that the Qur'an that's not what they were accusing. The Qur'an is truly revealed by Allah who knows all the secrets hidden in heaven and on earth. Therefore it contains the laws of the Shari'a and the rules of the law and in the language of the highest value of the literature so that no one among them can imitate it. The Qur'an contains many things that cannot be known except by the Almighty Allah. Indeed, the Lord who sent down the Qur'an is Most Forgiving and Merciful to His servants. In fact, they should be grateful and thankful for His mercy and love by sending the Qur'an as their guide and guide to the right path. But they continued to rebel and rebel against his teachings. If it had not been for His mercy and mercy they would have suffered a grievous torment.",
      "text_tafsir": "Orang-orang kafir itu mengatakan bahwa Al-Qur'an itu hanyalah dongengan-dongengan orang dahulu yang mereka tulis di dalam buku-buku, dan Nabi Muhammad minta kepada orang-orang Yahudi supaya disalinkan dan dibacakan kepadanya agar dia dapat menghafalnya pagi dan petang. Setelah dihafal barulah dia bacakan kepada para sahabat dan pengikutnya sebagai Al-Qur'an yang turun dari langit. Alangkah beraninya mereka mengada-adakan sesuatu yang tidak pernah terjadi pada Nabi Muhammad saw. Kalau benar demikian tentulah para sahabatnya akan mengetahui hal itu dan tentulah mereka tidak akan percaya lagi kepadanya. Padahal Nabi Muhammad dikenal oleh mereka semenjak kecilnya sebagai orang yang paling dipercaya, jujur dan tidak pernah dusta. Apakah mungkin seorang yang demikian sifatnya sejak dari kecil akan menipu orang yang setia kepadanya dan mendakwahkan hal-hal yang bukan-bukan.\n\n(6) Oleh karena orang-orang kafir itu keterlaluan mengadakan tuduhan-tuduhan yang tidak masuk akal, sedang mereka sudah ditantang sedemikian rupa dan tidak dapat menjawab tantangan itu, maka Allah memerintahkan Nabi Muhammad saw supaya menyatakan kepada mereka dengan tegas bahwa Al-Qur'an itu bukanlah sebagaimana yang mereka tuduhkan. Al-Qur'an itu benar-benar diturunkan oleh Allah yang mengetahui segala rahasia yang tersembunyi di langit dan di bumi. Oleh karena itu terdapat di dalamnya hukum-hukum syariat dan peraturan yang sangat baik dan dalam bahasa yang amat tinggi nilai sastranya sehingga tidak ada seorang pun di antara mereka yang bisa menirunya. Al-Qur'an banyak yang mengandung hal-hal yang tidak dapat diketahui kecuali oleh Allah Yang Mahaluas Ilmu-Nya.\n\nSesungguhnya Tuhan yang menurunkan Al-Qur'an itu, Maha Pengampun dan Penyayang kepada hamba-Nya. Sebenarnya mereka harus bersyukur dan berterima kasih atas rahmat dan kasih sayang-Nya kepada mereka dengan menurunkan Al-Qur'an sebagai petunjuk dan pembimbing mereka ke jalan yang benar. Tetapi mereka tetap ingkar dan durhaka dan menentang ajaran-ajaran-Nya. Kalau tidaklah karena rahmat dan kasih sayang-Nya tentulah telah ditimpakan kepada mereka azab yang pedih.",
      "text_translation": "Dan mereka berkata, “(Itu hanya) dongeng-dongeng orang-orang terdahulu, yang diminta agar dituliskan, lalu dibacakanlah dongeng itu kepadanya setiap pagi dan petang.”",
      "text": "وَقَالُوْٓا اَسَاطِيْرُ الْاَوَّلِيْنَ اكْتَتَبَهَا فَهِيَ تُمْلٰى عَلَيْهِ بُكْرَةً وَّاَصِيْلًا",
      "text_translation_en": "And they say, “Fables of ancient times which he has caused to be written down, so that they might be read out to him at morn and evening!”",
      "juz_number": 18
    },
    "6": {
      "text_tafsir_en": "Because the infidels went too far to make unreasonable accusations, while they were challenged in such a way and could not answer the challenge, then Allah ordered the Prophet Muhammad to declare to them firmly that the Qur'an was not as they alleged. The Qur'an is truly revealed by Allah who knows all the secrets hidden in heaven and on earth. Therefore, there are sharia laws and regulations which are very good and in languages that are very high in literary values so that none of them can imitate them. The Qur'an contains many things that cannot be known except by Allah, the Most Knowledge. Verily the Lord who sent down the Qur'an, is Forgiving and Merciful to His servants. Actually they should be grateful and thankful for His mercy and affection for them by sending down the Qur'an as a guide and guiding them to the right path. But they remain rebellious and lawless and oppose His teachings. If not because of His mercy and compassion, it would have been upon them a painful punishment.",
      "text_tafsir": "Oleh karena orang-orang kafir itu keterlaluan mengadakan tuduhan-tuduhan yang tidak masuk akal, sedang mereka sudah ditantang sedemikian rupa dan tidak dapat menjawab tantangan itu, maka Allah memerintahkan Nabi Muhammad saw supaya menyatakan kepada mereka dengan tegas bahwa Al-Qur'an itu bukanlah sebagaimana yang mereka tuduhkan. Al-Qur'an itu benar-benar diturunkan oleh Allah yang mengetahui segala rahasia yang tersembunyi di langit dan di bumi. Oleh karena itu terdapat di dalamnya hukum-hukum syariat dan peraturan yang sangat baik dan dalam bahasa yang amat tinggi nilai sastranya sehingga tidak ada seorang pun di antara mereka yang bisa menirunya. Al-Qur'an banyak yang mengandung hal-hal yang tidak dapat diketahui kecuali oleh Allah Yang Mahaluas Ilmu-Nya.\n\nSesungguhnya Tuhan yang menurunkan Al-Qur'an itu, Maha Pengampun dan Penyayang kepada hamba-Nya. Sebenarnya mereka harus bersyukur dan berterima kasih atas rahmat dan kasih sayang-Nya kepada mereka dengan menurunkan Al-Qur'an sebagai petunjuk dan pembimbing mereka ke jalan yang benar. Tetapi mereka tetap ingkar dan durhaka dan menentang ajaran-ajaran-Nya. Kalau tidaklah karena rahmat dan kasih sayang-Nya tentulah telah ditimpakan kepada mereka azab yang pedih.",
      "text_translation": "Katakanlah (Muhammad), “(Al-Qur'an) itu diturunkan oleh (Allah) yang mengetahui rahasia di langit dan di bumi. Sungguh, Dia Maha Pengampun, Maha Penyayang.” ",
      "text": "قُلْ اَنْزَلَهُ الَّذِيْ يَعْلَمُ السِّرَّ  فِى السَّمٰوٰتِ وَالْاَرْضِۗ اِنَّهٗ كَانَ غَفُوْرًا رَّحِيْمًا",
      "text_translation_en": "Say [O Muhammad]: “He who knows all the mysteries of the heavens and the earth has bestowed from on high this [Qur’an upon me]! Verily, He is much-forgiving, a dispenser of grace!”",
      "juz_number": 18
    },
    "7": {
      "text_tafsir_en": "The unbelievers say that it is impossible for Muhammad to be a Messenger because there are no signs of his being appointed as a Messenger. He was just a normal person like them even when he saw how his life was getting worse that he lied to proclaim himself as an Apostle because he was just like them even as a human being he was inferior and poorer than them. These criticisms can be summarized, as follows: 1. They said, \"Why is Muhammad eating as well as a normal human being and not having the least advantage over us? a person whose soul is so holy and high that it is not important to eat and drink anymore. \" 2. Why not send angels with him who can serve as proof of his apostasy and help him in giving warnings and guidance to mankind. 3. Why did Muhammad go to the market to earn his living like a normal person? Where was his advantage so that he was appointed by God as a Messenger. 4. Why did God not only send down to him a treasury from heaven so that he could devote his entire attention to his preaching to spread his religion, so that he did not have to go to the market to buy and earn his living. 5. Or why not give him a large garden whose produce can cover his needs. After they gave up because of all their offers rejected by Muhammad there was no way for them except to accuse him of being a magician until he could no longer distinguish between good and evil. They think that such people are not worthy of trust, let alone that God has appointed them as prophets.",
      "text_tafsir": "Orang-orang kafir mengatakan bahwa tidak mungkin Muhammad itu menjadi Rasul karena tidak terdapat padanya tanda-tanda bahwa dia diangkat menjadi Rasul. Dia hanyalah orang biasa seperti mereka bahkan jika dilihat bagaimana kehidupannya tambah nyatalah bahwa dia berbohong mendakwahkan dirinya sebagai Rasul karena dia sama dengan mereka bahkan sebagai manusia dia lebih rendah kedudukannya dan lebih miskin dari mereka. Kritik-kritik itu dapat disimpulkan, sebagai berikut:\n\n1. Mereka berkata, \"Kenapa Muhammad itu makan minum juga seperti manusia biasa dan tidak ada kelebihannya sedikit pun dari kita, tidak akan mungkin dia berhubungan dengan Tuhan. Orang yang dapat berhubungan dengan Tuhan hanya orang-orang yang jiwanya suci dan tinggi sehingga tidak mementingkan makan dan minum lagi.\"\n\n2. Mengapa tidak diturunkan malaikat bersamanya yang dapat menjadi bukti bagi kerasulannya dan membantunya dalam memberi peringatan dan petunjuk kepada manusia.\n\n3. Mengapa Muhammad itu pergi ke pasar untuk mencari nafkah hidupnya seperti orang biasa? Di mana letak kelebihannya sehingga ia diangkat Allah sebagai Rasul.\n\n4. Mengapa Allah tidak menurunkan saja kepadanya perbendaharaan dari langit agar dia dapat menumpahkan seluruh perhatiannya kepada dakwah untuk menyebarkan agamanya, sehingga dia tidak perlu lagi pergi ke pasar melakukan jual beli untuk mencari nafkah hidupnya.\n\n5. Atau kenapa tidak diberikan kepadanya kebun yang luas yang hasilnya dapat menutupi kebutuhannya.\n\nSetelah mereka berputus asa karena semua tawaran mereka ditolak oleh Muhammad tidak ada jalan lain bagi mereka kecuali menuduhnya sebagai orang yang kena sihir sehingg tidak dapat lagi membedakan antara yang baik dan yang buruk. Menurut mereka orang-orang seperti itu tidaklah pantas untuk dipercaya apalagi untuk diangkat Allah sebagai Nabi.",
      "text_translation": "Dan mereka berkata, “Mengapa Rasul (Muhammad) ini memakan makanan dan berjalan di pasar-pasar? Mengapa malaikat tidak diturunkan kepadanya (agar malaikat) itu memberikan peringatan bersama dia,",
      "text": "وَقَالُوْا مَالِ هٰذَا الرَّسُوْلِ يَأْكُلُ الطَّعَامَ وَيَمْشِيْ فِى الْاَسْوَاقِۗ  لَوْلَآ اُنْزِلَ اِلَيْهِ مَلَكٌ فَيَكُوْنَ مَعَهٗ نَذِيْرًا ۙ",
      "text_translation_en": "Yet they say: What sort of apostle is this [man] who eats food [like all other mortals] and goes about in the market places? Why has not an angel [visibly] been sent down unto him, to act as a warner together with him?”",
      "juz_number": 18
    },
    "8": {
      "text_tafsir_en": "The unbelievers say that it is impossible for Muhammad to be a Messenger because there are no signs of his being appointed as a Messenger. He was just a normal person like them even when he saw how his life was getting worse that he lied to proclaim himself as an Apostle because he was just like them even as a human being he was inferior and poorer than them. These criticisms can be summarized, as follows: 1. They said, \"Why is Muhammad eating as well as a normal human being and not having the least advantage over us? a person whose soul is so holy and high that it is not important to eat and drink anymore. \" 2. Why not send angels with him who can serve as proof of his apostasy and help him in giving warnings and guidance to mankind. 3. Why did Muhammad go to the market to earn his living like a normal person? Where was his advantage so that he was appointed by God as a Messenger. 4. Why did God not only send down to him a treasury from heaven so that he could devote his entire attention to his preaching to spread his religion, so that he did not have to go to the market to buy and earn his living. 5. Or why not give him a large garden whose produce can cover his needs. After they gave up because of all their offers rejected by Muhammad there was no way for them except to accuse him of being a magician until he could no longer distinguish between good and evil. They think that such people are not worthy of trust, let alone that God has appointed them as prophets.",
      "text_tafsir": "Orang-orang kafir mengatakan bahwa tidak mungkin Muhammad itu menjadi Rasul karena tidak terdapat padanya tanda-tanda bahwa dia diangkat menjadi Rasul. Dia hanyalah orang biasa seperti mereka bahkan jika dilihat bagaimana kehidupannya tambah nyatalah bahwa dia berbohong mendakwahkan dirinya sebagai Rasul karena dia sama dengan mereka bahkan sebagai manusia dia lebih rendah kedudukannya dan lebih miskin dari mereka. Kritik-kritik itu dapat disimpulkan, sebagai berikut:\n\n1. Mereka berkata, \"Kenapa Muhammad itu makan minum juga seperti manusia biasa dan tidak ada kelebihannya sedikit pun dari kita, tidak akan mungkin dia berhubungan dengan Tuhan. Orang yang dapat berhubungan dengan Tuhan hanya orang-orang yang jiwanya suci dan tinggi sehingga tidak mementingkan makan dan minum lagi.\"\n\n2. Mengapa tidak diturunkan malaikat bersamanya yang dapat menjadi bukti bagi kerasulannya dan membantunya dalam memberi peringatan dan petunjuk kepada manusia.\n\n3. Mengapa Muhammad itu pergi ke pasar untuk mencari nafkah hidupnya seperti orang biasa? Di mana letak kelebihannya sehingga ia diangkat Allah sebagai Rasul.\n\n4. Mengapa Allah tidak menurunkan saja kepadanya perbendaharaan dari langit agar dia dapat menumpahkan seluruh perhatiannya kepada dakwah untuk menyebarkan agamanya, sehingga dia tidak perlu lagi pergi ke pasar melakukan jual beli untuk mencari nafkah hidupnya.\n\n5. Atau kenapa tidak diberikan kepadanya kebun yang luas yang hasilnya dapat menutupi kebutuhannya.\n\nSetelah mereka berputus asa karena semua tawaran mereka ditolak oleh Muhammad tidak ada jalan lain bagi mereka kecuali menuduhnya sebagai orang yang kena sihir sehingg tidak dapat lagi membedakan antara yang baik dan yang buruk. Menurut mereka orang-orang seperti itu tidaklah pantas untuk dipercaya apalagi untuk diangkat Allah sebagai Nabi.",
      "text_translation": "atau (mengapa tidak) diturunkan kepadanya harta kekayaan atau (mengapa tidak ada) kebun baginya, sehingga dia dapat makan dari (hasil)nya?” Dan orang-orang zalim itu berkata, “Kamu hanyalah mengikuti seorang laki-laki yang kena sihir.”",
      "text": "اَوْ يُلْقٰىٓ اِلَيْهِ كَنْزٌ اَوْ تَكُوْنُ لَهٗ جَنَّةٌ يَّأْكُلُ مِنْهَاۗ وَقَالَ الظّٰلِمُوْنَ اِنْ تَتَّبِعُوْنَ اِلَّا رَجُلًا مَّسْحُوْرًا",
      "text_translation_en": "Or: “[Why has not] a treasure been granted to him [by God]?” Or: “He should [at least] have a [bountiful] garden, so that he could eat thereof [without effort]!” And so these evildoers say [unto one another], “If you were to follow [Muhammad, you would follow] but a man bewitched!”",
      "juz_number": 18
    },
    "9": {
      "text_tafsir_en": "In this verse Allah calls upon the Prophet and his people to pay attention to the criticisms put forth by the disbelievers. In view of these accusations it is clear that they have run out of reasons and evidence to reject Muhammad's call to monotheism and to abandon their misleading acts. They could not refuse the reasons and the evidence presented by the Prophet Muhammad in the form of Qur'anic verses and others. They cannot answer the challenge of making just one surah of the same value as one surah in the Qur'an, both in terms of content, meaning and literature. Therefore, they shifted their criticism to the Prophet Muhammad himself. It happens a lot to people who have been beaten to death. Therefore, God did not immediately respond to the accusations and made it clear to everyone that they had been thrown into the corner because they had strayed from the right path.",
      "text_tafsir": "Pada ayat ini Allah menyuruh Nabi dan umatnya memperhatikan kecaman-kecaman yang dikemukakan oleh orang-orang kafir itu. Dengan memperhatikan kecaman-kecaman itu nampak jelas bahwa mereka telah kehabisan alasan dan keterangan untuk menolak seruan Nabi Muhammad kepada tauhid dan meninggalkan sembahan-sembahan mereka yang menyesatkan itu. Mereka tidak sanggup menolak alasan-alasan dan bukti-bukti yang dikemukakan oleh Nabi Muhammad berupa ayat-ayat Al-Qur'an dan lainnya. Mereka tidak sanggup menjawab tantangan membuat satu surah saja yang sama nilainya dengan satu surah dalam Al-Qur'an, baik dari segi isi, makna maupun sastranya. Oleh sebab itu mereka mengalihkan kecaman mereka kepada pribadi Nabi Muhammad sendiri. Hal itu banyak terjadi pada orang-orang yang telah dikalahkan hujjahnya. Oleh sebab itu Allah tidak langsung menjawab kecaman-kecaman itu dan menyuruh memperlihatkannya agar jelas bagi semua orang bahwa mereka itu telah terlempar ke sudut karena mereka memang telah sesat dari jalan yang benar.",
      "text_translation": "Perhatikanlah, bagaimana mereka membuat perumpamaan-perumpamaan tentang engkau, maka sesatlah mereka, mereka tidak sanggup (mendapatkan) jalan (untuk menentang kerasulanmu). ",
      "text": "اُنْظُرْ كَيْفَ ضَرَبُوْا لَكَ الْاَمْثَالَ فَضَلُّوْا فَلَا يَسْتَطِيْعُوْنَ سَبِيْلًا ࣖ",
      "text_translation_en": "See to what they liken thee, [O Prophet, simply] because they have gone astray and are now unable to find a way to the truth]!",
      "juz_number": 18
    },
    "10": {
      "text_tafsir_en": "In the comfort of the Prophet who was despised and despised by the disbelievers, Allah made it clear that if He would, He would grant them better gardens than those who disbelieved and would give them castles. the most magnificent and beautiful. It is very easy for God, but this is not what He wants. God wants the Messenger to carry His brochure as a common man who is an example and a role model for his people in striving for a cause, striving for truth and extending the words of God. In addition to the heavy struggle the Prophet must also consider his personal needs and intentions. That is how a Messenger should be an example and example. If the Prophet Muhammad was a rich man with gardens and palaces and abundant treasury it would not have been so great in value and he would not have been able to emulate his followers in the future. What is the meaning of the palace, what is the meaning of the gardens and what is the significance of the treasury when one is confronted by the Almighty, the Almighty and the Almighty? Thus Prophet Muhammad was pleased with his condition. though poor, weak and accepting of the ridicule and ridicule of his people, yet he was happy and happy because he carried on the sacred duty of his Lord. He once said, \"Oh my God no matter what happens to me and no matter how much I suffer, but I am happy as long as you are pleased with me.\"",
      "text_tafsir": "Sebagai hiburan kepada Nabi yang selalu dihina dan direndahkan oleh orang-orang kafir itu, Allah menjelaskan bahwa kalau Dia menghendaki, niscaya Dia akan memberikan kepadanya kebun-kebun yang lebih baik dari yang diminta oleh orang-orang kafir itu dan akan memberikan pula istana-istana yang paling megah dan indah. Hal itu amat mudah bagi Allah tetapi bukan demikian yang dikehendaki-Nya. Allah menghendaki agar Rasul pembawa risalah-Nya sebagai manusia biasa yang menjadi ikutan dan teladan bagi umatnya dalam memperjuangkan suatu cita-cita, memperjuangkan kebenaran dan meninggikan kalimat Allah. \n\nDi samping perjuangan yang amat berat itu Nabi harus pula memikirkan keperluan dan hajat pribadinya. Begitulah seharusnya seorang Rasul yang akan menjadi contoh dan teladan. Kalaulah Nabi Muhammad itu seorang kaya mempunyai kebun-kebun dan istana serta perbendaharaan yang berlimpah-limpah tentulah tidak akan sebesar itu nilai perjuangannya dan tentulah tidak akan dapat dicontoh oleh pengikut-pengikutnya di belakang hari. Apa arti istana, apa arti kebun-kebun dan apa arti perbendaharaan yang berlimpah-limpah bila seorang berhadapan dengan Khaliknya Yang Mahakuasa, Mahakaya dan Maha Perkasa? Demikianlah Nabi Muhammad rida dengan keadaannya. meskipun miskin, lemah dan menerima berbagai hinaan dan cemoohan kaumnya, tetapi dia senang dan bahagia karena dia mengemban tugas suci dari Tuhannya. Pernah beliau berkata, \"Ya Tuhanku apapun yang terjadi pada diriku dan bagaimana pun beratnya penderitaanku tetapi aku tetap bahagia selama Engkau rida terhadapku.\"",
      "text_translation": "Mahasuci (Allah) yang jika Dia menghendaki, niscaya Dia jadikan bagimu yang lebih baik daripada itu, (yaitu) surga-surga yang mengalir di bawahnya sungai-sungai, dan Dia jadikan (pula) istana-istana untukmu.",
      "text": "تَبٰرَكَ الَّذِيْٓ اِنْ شَاۤءَ جَعَلَ لَكَ خَيْرًا مِّنْ ذٰلِكَ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُۙ وَيَجْعَلْ لَّكَ قُصُوْرًا",
      "text_translation_en": "Hallowed is He who, if it be His will, shall give thee something better than that [whereof they speak] - gardens through which running waters flow - and shall assign to thee mansions [of bliss in the life to come].",
      "juz_number": 18
    },
    "11": {
      "text_tafsir_en": "In this verse Allah emphasizes that the disbelievers have strayed far from the right path, and yet they have denied the coming of Judgment Day, the day of vengeance in which all human deeds are rewarded justly. Good deeds are rewarded with double rewards, bad deeds are rewarded with painful punishments. They deny the Day of Judgment so that they will act unjustly toward the weak, commend them to do wrong, and therefore Allah threatens them with the flames of hell burning because of their disobedience and wickedness, because of their evil deeds in the world.",
      "text_tafsir": "Pada ayat ini Allah menegaskan lagi bahwa orang-orang kafir itu telah jauh tersesat dari jalan yang benar, bahkan mereka mendustakan pula datangnya hari Kiamat, hari pembalasan di mana semua amal perbuatan manusia dibalas dengan adil. Perbuatan baik dibalas dengan pahala yang berlipat ganda, perbuatan jahat dibalas dengan azab yang pedih. Mereka mendustakan hari Kiamat itu agar mereka berbuat sewenang-wenang terhadap kaum yang lemah, bersimaharajalah melakukan kezaliman, oleh sebab itu Allah mengancam mereka dengan api neraka yang menyala-nyala akibat keingkaran dan kedurhakaan mereka, akibat perbuatan jahat mereka di dunia.",
      "text_translation": "Bahkan mereka mendustakan hari Kiamat. Dan Kami menyediakan neraka yang menyala-nyala bagi siapa yang mendustakan hari Kiamat.",
      "text": "بَلْ كَذَّبُوْا بِالسَّاعَةِۙ وَاَعْتَدْنَا لِمَنْ كَذَّبَ بِالسَّاعَةِ سَعِيْرًا",
      "text_translation_en": "But nay! It is [the very coming of] the Last Hour to which they give the lie! However, for such as give the lie to [the announce­ment of] the Last Hour We have readied a blazing flame:",
      "juz_number": 18
    },
    "12": {
      "text_tafsir_en": "When those who disbelieved were dragged to hell, as if from hell they saw them afar off, a roar came from the rage of those infidels, as if a hungry lion had seen its prey approaching it. Ibn Munzir and Ibn Jarir recounted that Ubaid bin Umair said, \"Verily the noise was so loud that the angels and the prophets shook their voices and heard the voice, and Abraham fell on his knees and said,\" My Lord, I have nothing to ask today except My own safety. \"It is possible to imagine how horrific the situation at that time was and how terrible the torment would be to them and how much suffering they would have suffered at that time.",
      "text_tafsir": "Apabila orang-orang kafir itu telah digiring ke neraka, seakan-akan neraka melihat mereka dari jauh, terdengarlah suaranya yang gemuruh karena kemarahan melihat orang-orang kafir itu, seakan-akan neraka itu seekor singa yang lapar melihat mangsanya mendekatinya. Ibnu Munzir dan Ibnu Jarir meriwayatkan bahwa Ubaid bin Umair berkata, \"Sesungguhnya Jahanam itu bergemuruh suaranya sehingga para malaikat dan nabi-nabi gemetar persendiannya mendengar suara itu, sehingga Nabi Ibrahim jatuh berlutut dan berkata, \"Ya Tuhanku tidak ada yang aku mohonkan hari ini kecuali keselamatan diriku.\" Dapatlah dibayangkan bagaimana seramnya keadaan di waktu itu dan bagaimana dahsyatnya siksa yang akan diterima oleh mereka dan bagaimana beratnya penderitaan yang akan mereka rasakan pada waktu itu.",
      "text_translation": "Apabila ia (neraka) melihat mereka dari tempat yang jauh, mereka mendengar suaranya yang gemuruh karena marahnya.",
      "text": "اِذَا رَاَتْهُمْ مِّنْ مَّكَانٍۢ بَعِيْدٍ سَمِعُوْا لَهَا تَغَيُّظًا وَّزَفِيْرًا",
      "text_translation_en": "when it shall face them from afar, they will hear its angry roar and its hiss;",
      "juz_number": 18
    },
    "13": {
      "text_tafsir_en": "When they are thrown into a narrow place in hell with their hands shackled there they will cry \"Woe to me! Why did I disregard the instructions sent down by Allah through the intercession of His Messenger, why did I refute and reject it? I am truly a wretched man. . \"",
      "text_tafsir": "Bila mereka dilemparkan ke suatu tempat yang sempit di neraka itu dengan tangan terbelenggu di sanalah mereka akan berseru \"Celakalah aku! Kenapa aku dahulu mengacuhkan petunjuk yang diturunkan Allah dengan perantaraan Rasul-Nya, kenapa aku membantah dan menolaknya benar-benar aku ini seorang yang celaka.\"",
      "text_translation": "Dan apabila mereka dilemparkan ke tempat yang sempit di neraka dengan dibelenggu, mereka di sana berteriak mengharapkan kebinasaan.",
      "text": "وَاِذَآ اُلْقُوْا مِنْهَا مَكَانًا ضَيِّقًا مُّقَرَّنِيْنَ دَعَوْا هُنَالِكَ ثُبُوْرًا ۗ",
      "text_translation_en": "and when they are flung, linked [all] together, into a tight space within, they will pray for extinction there and then!",
      "juz_number": 18
    },
    "14": {
      "text_tafsir_en": "At that time they were told not to say the word (woe to me) just once. Say that word many times because what they see and experience is just one kind of torture that will befall on him. Many more kinds of torture they will suffer. Therefore, shouting many times, indeed they will be subject to terrible and terrible torture.",
      "text_tafsir": "Di waktu itu diucapkan kepada mereka agar tidak mengucapkan kata itu (celaka aku) sekali saja. Ucapkanlah kata itu berkali-kali karena yang mereka lihat dan alami itu baru satu macam dari siksa yang akan ditimpakan kepadanya. Banyak lagi macam siksaan yang akan mereka derita. Oleh sebab itu berteriak-teriaklah berkali-kali, memang mereka akan ditimpa siksaan yang dahsyat dan hebat.",
      "text_translation": "(Akan dikatakan kepada mereka), “Janganlah kamu mengharapkan pada hari ini satu kebinasaan, melainkan harapkanlah kebinasaan yang berulang-ulang.” ",
      "text": "لَا تَدْعُوا الْيَوْمَ ثُبُوْرًا وَّاحِدًا وَّادْعُوْا ثُبُوْرًا كَثِيْرًا ",
      "text_translation_en": "[But they will be told:] “Pray not today for one single extinction, but pray for many extinctions!”",
      "juz_number": 18
    },
    "15": {
      "text_tafsir_en": "Allah ordered the Prophet Muhammad to tell the unbelievers whether such a great and terrible torment was better than the favorable heaven and mercy provided to the faithful believers. They remain in it forever. Heaven was created for them by faith in Allah and His Messenger and obeying and obeying His commands and abstaining from all His prohibitions.",
      "text_tafsir": "Allah memerintahkan kepada Nabi Muhammad agar mengatakan kepada orang-orang kafir itu, apakah siksaan yang demikian hebat dan dahsyat itu lebih baik dari surga yang penuh nikmat dan rahmat yang disediakan bagi orang-orang mukmin yang bertakwa. Mereka kekal di dalamnya selama-lamanya. Surga itu dijadikan untuk mereka karena beriman kepada Allah dan Rasul-Nya serta taat dan patuh menjalankan perintah-Nya dan menjauhi segala larangan-Nya.",
      "text_translation": "Katakanlah (Muhammad), “Apakah (azab) seperti itu yang baik, atau surga yang kekal yang dijanjikan kepada orang-orang yang bertakwa sebagai balasan, dan tempat kembali bagi mereka?”",
      "text": "قُلْ اَذٰلِكَ خَيْرٌ اَمْ جَنَّةُ الْخُلْدِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَۗ  كَانَتْ لَهُمْ جَزَاۤءً وَّمَصِيْرًا ",
      "text_translation_en": "Say: “Which is better - that, or the paradise of life abiding which has been promised to the God-conscious as their reward and their journey’s end –",
      "juz_number": 18
    },
    "16": {
      "text_tafsir_en": "In that paradise they are given what they ask for and they want in the form of clothes, food and drinks and all the pleasures that no human can imagine in this world. In addition they are always in the Divine Will and this is an unparalleled spiritual favor, for it is the Divine Will that gives peace and happiness to the heart of every servant of God as it is His word. God said, \"This is the time when the righteous will benefit from their righteousness. They will have a river flowing under the rivers, they will abide in it forever. Allah is with them and they seek Him. That is a great victory. \" (al-Ma'idah \/ 5: 119) Such is the promise of Allah to His faithful and fearful servant, and the promise of God must be fulfilled.",
      "text_tafsir": "Di dalam surga itu mereka diberi apa yang mereka minta dan mereka inginkan berupa pakaian, makanan dan minuman serta segala kenikmatan yang tak dapat dibayangkan oleh manusia di dunia ini. Selain dari itu mereka selalu berada dalam keridaan Ilahi dan inilah suatu nikmat rohani yang tidak ada taranya, karena keridaan Ilahi itulah yang menimbulkan rasa tenteram dan bahagia di dalam hati sanubari setiap hamba Allah sebagaimana tersebut dalan firman-Nya.\n\nAllah berfirman, \"Inilah saat orang yang benar memperoleh manfaat dari kebenarannya. Mereka memperoleh surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya selama-lamanya. Allah rida kepada mereka dan mereka pun rida kepada-Nya. Itulah kemenangan yang agung.\" (al-Ma'idah\/5: 119)\n\nDemikianlah janji Allah kepada hamba-Nya yang beriman dan bertakwa dan janji Allah itu pasti terlaksana.",
      "text_translation": "Bagi mereka segala yang mereka kehendaki ada di dalamnya (surga), mereka kekal (di dalamnya). Itulah janji Tuhanmu yang pantas dimohonkan (kepada-Nya).",
      "text": "لَهُمْ فِيْهَا مَا يَشَاۤءُوْنَ خٰلِدِيْنَۗ  كَانَ عَلٰى رَبِّكَ وَعْدًا مَّسْـُٔوْلًا",
      "text_translation_en": "a promise given by thy Sustainer, [always] to be prayed for?”",
      "juz_number": 18
    },
    "17": {
      "text_tafsir_en": "On the Day of Judgment the heathen are gathered together with their idols. Then Allah asked questions to them. Surely they were first in the world to worship them so that they had strayed from the right path, uniting with God in their worship so that they disobeyed the teachings of Allah and the teachings of His Messenger. Among the worshipers worshiped by the disbelievers were some angels, Jesus and Uzair. They find it very strange and astonishing to hear such questions because they never ask people to worship them, but they always call on monotheism, worshiping God without associating with anything. In this verse the question of God is addressed specifically to Jesus, which is His word: And (remember) when Allah said, \"O son of Mary! \"(Jesus) answered,\" Your holiness, it is not right for me to say what is not my right. If I had said it you would have known it. You know what is in me and I do not know what is in you. Indeed, You are the All-Knower of the Unseen. \"(Al-Ma'idah \/ 5: 116)",
      "text_tafsir": "Pada hari Kiamat orang-orang musyrik dikumpulkan bersama-sama dengan sembahan-sembahan mereka. Lalu Allah mengemukakan pertanyaan-pertanyaan kepada sembahan-sembahan itu. Benarkah mereka dahulu di dunia menyuruh mereka itu menyembahnya sehingga mereka telah sesat dari jalan yang benar, mempersekutukan Allah dengan sesembahan itu sehingga mereka mengingkari ajaran-ajaran Allah dan ajaran-ajaran Rasul-Nya. Di antara sembahan-sembahan yang disembah orang-orang kafir itu termasuk beberapa malaikat, Nabi Isa dan Uzair. Mereka merasa sangat heran dan tercengang mendengar pertanyaan-pertanyaan itu karena mereka tidak pernah menyuruh manusia menyembah mereka, bahkan mereka selalu menyeru kepada tauhid, menyembah Allah tanpa mempersekutukan-Nya dengan suatu apapun. Dalam ayat ini disebutkan pertanyaan Allah yang khusus dihadapkan kepada Nabi Isa yaitu firman-Nya:\n\nDan (ingatlah) ketika Allah berfirman, \"Wahai Isa putra Maryam! Engkaukah yang mengatakan kepada orang-orang, \"Jadikanlah aku dan ibuku sebagai dua tuhan selain Allah?\" (Isa) menjawab, \"Mahasuci Engkau, tidak patut bagiku mengatakan apa yang bukan hakku. Jika aku pernah mengatakannya tentulah Engkau telah mengetahuinya. Engkau mengetahui apa yang ada pada diriku dan aku tidak mengetahui apa yang ada pada-Mu. Sungguh, Engkaulah Yang Maha Mengetahui segala yang gaib.\" (al-Ma'idah\/5: 116)",
      "text_translation": "Dan (ingatlah) pada hari (ketika) Allah mengumpulkan mereka bersama apa yang mereka sembah selain Allah, lalu Dia berfirman (kepada yang disembah), “Apakah kamu yang menyesatkan hamba-hamba-Ku itu, atau mereka sendirikah yang sesat dari jalan (yang benar)?” ",
      "text": "وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ فَيَقُوْلُ ءَاَنْتُمْ اَضْلَلْتُمْ عِبَادِيْ هٰٓؤُلَاۤءِ اَمْ هُمْ ضَلُّوا السَّبِيْلَ ۗ",
      "text_translation_en": "BUT [as for people who are oblivious of thy Sus­tainer’s oneness -] one Day He will gather them together with all that they [now] worship instead of God, and will ask [those to whom divinity was falsely ascribed]: “Was it you who led these My creatures astray, or did they by themselves stray from the right path?”",
      "juz_number": 18
    },
    "18": {
      "text_tafsir_en": "Spontaneously they answer the questions of God which they did not expect to be given to him. They said at once, \"You are holy, our Lord, it is not right for us to take refuge except You. This is our belief because no one has the right to worship and to be a protector except you. How can we ask others to worship besides You? contrary to our faith and faith. Perhaps You, our Lord, have bestowed upon them Your grace and mercy, that they may be grateful to You, but they have used that favor and grace to the satisfaction of their passions, so that they have sunk in pleasure and pleasure. they have forgotten you and fallen into the abyss and cannot be helped anymore and are among the dead. \"",
      "text_tafsir": "Dengan spontan mereka menjawab pertanyaan Allah yang tidak mereka duga sedikit pun akan dimajukan kepadanya. Mereka serentak menjawab, \"Mahasuci Engkau Ya Tuhan kami, tidaklah patut bagi kami mengambil perlindungan selain Engkau. Inilah kepercayaan kami karena tidak ada yang berhak disembah dan diambil jadi pelindung kecuali engkau sajalah. Bagaimana pula kami akan menyuruh orang lain menyembah selain Engkau sedangkan hal itu bertentangan dengan akidah dan iman kami. Mungkin Engkau Ya Tuhan kami telah melimpahkan kepada mereka nikmat dan rahmat-Mu agar mereka bersyukur kepada-Mu tetapi mereka pergunakan nikmat dan rahmat itu untuk kepuasan hawa nafsu mereka, sehingga mereka telah tenggelam dalam kesenangan dan kelezatan. Akhirnya mereka melupakan-Mu dan jatuh ke jurang kesesatan dan tidak dapat ditolong lagi dan termasuk ke dalam golongan orang-orang yang binasa.\"",
      "text_translation": "Mereka (yang disembah itu) menjawab, “Mahasuci Engkau, tidaklah pantas bagi kami mengambil pelindung selain Engkau, tetapi Engkau telah memberi mereka dan nenek moyang mereka kenikmatan hidup, sehingga mereka melupakan peringatan; dan mereka kaum yang binasa.”",
      "text": "قَالُوْا سُبْحٰنَكَ مَا كَانَ يَنْۢبَغِيْ لَنَآ اَنْ نَّتَّخِذَ مِنْ دُوْنِكَ مِنْ اَوْلِيَاۤءَ وَلٰكِنْ مَّتَّعْتَهُمْ وَاٰبَاۤءَهُمْ حَتّٰى نَسُوا الذِّكْرَۚ وَكَانُوْا قَوْمًاۢ بُوْرًا",
      "text_translation_en": "They will answer: “Limitless art Thou in Thy glory! It was inconceivable for us to take for our masters anyone but Thyself! But [as for them -] Thou didst allow them and their forefathers to enjoy [the pleasures of] life to such an extent that they forgot all remembrance [of Thee]: for they were people devoid of all good.”",
      "juz_number": 18
    },
    "19": {
      "text_tafsir_en": "God sent his word to the unbelievers. You have heard for yourself the answers of those you worship. Realize now that they are not those who mislead you, they have never told you to worship them. So you are the one who invents worship besides me. Now you will never be able to escape my torment and no one will help you. You have persecuted yourself by worshiping other gods than me, and the fate of those who have persecuted themselves by worshiping me, I will surely put in painful and painful torment.",
      "text_tafsir": "Allah mengarahkan firman-Nya kepada orang-orang musyrik itu. Kamu telah mendengar sendiri jawaban orang-orang yang kamu sembah itu. Nyatalah sekarang bahwa bukan mereka yang menyesatkan kamu, mereka tidak pernah menyuruh kamu supaya menyembah mereka. Jadi kamu sendirilah yang mengada-adakan sembahan selain Aku. Sekarang kamu sekali-kali tidak akan dapat lepas dari siksaan-Ku dan tak ada seorang jua pun yang dapat memberikan pertolongan kepadamu. Kamu telah menganiaya dirimu sendiri dengan membuat-buat sembahan selain Aku, dan nasib orang-orang yang menganiaya dirinya dengan menyembah selain Aku, pasti akan Aku masukkan ke dalam siksaan yang pedih dan berat.",
      "text_translation": "Maka sungguh, mereka (yang disembah itu) telah mengingkari apa yang kamu katakan, maka kamu tidak akan dapat menolak (azab) dan tidak dapat (pula) menolong (dirimu), dan barangsiapa di antara kamu berbuat zalim, niscaya Kami timpakan kepadanya rasa azab yang besar.",
      "text": "فَقَدْ كَذَّبُوْكُمْ بِمَا تَقُوْلُوْنَۙ فَمَا تَسْتَطِيْعُوْنَ صَرْفًا وَّلَا نَصْرًاۚ وَمَنْ يَّظْلِمْ مِّنْكُمْ نُذِقْهُ عَذَابًا كَبِيْرًا",
      "text_translation_en": "[Thereupon God will say:] “And now, they [whom you regarded as divine] have given the lie to all your [past] assertions, and you can neither ward off [your punishment] nor obtain any succour! For, whoever of you has committed [such] evil, him shall We cause to taste great suffering!”",
      "juz_number": 18
    },
    "20": {
      "text_tafsir_en": "In this verse Allah explains to the Prophet Muhammad that the previous prophets also ate and drank like him. The reproaches of the infidels against him were very offensive to Muhammad, but they were not merely insults, but they contained insulting insults that he was a Messenger of Allah. So to comfort and alleviate the inner pressure that Prophet Muhammad saw caused by such criticism and insults, God told him that He had never sent an apostle before as the Meccans demanded. All His messengers were men who were not free from their human nature, but in need of food and drink, still striving to meet the necessities of life according to His word in other verses. And We have not sent before thee (Muhammad), but some of the men whom We have revealed to them, so ask the wise men, if you do not know. And We did not make them a body that does not eat food and they do not (live) forever. (al-Anbiya '\/ 21: 7-8) So the difference between man as the Apostle and the human being is largely based on his personal qualities, his moral highness, his purity of heart and his sincerity in performing his duty, thus the revelation of God was revealed to him and further strengthened by the miracles which no human can match but let him defeat. Thus the ridicule and criticism of the infidels was far from its target, it should not have been passed on to the Prophet Muhammad. If they really want to undo the truth they bring instead of that kind of criticism they have to submit. They were challenged to match the miracle that God had given him by making one short surah of similar value to the short surah of the Qur'an. But they are helpless and incapable of doing so even though they are among the smart and high-class people. Only hatred and envy have dampened their conscience and the fear of losing their influence and position has consumed their anger. Therefore, they continue to challenge even when they are aware of their ignorance. Then God also explained that man is tested by various tests. Each person is given the freedom to stand firm and endure the test or he will turn from the truth because he cannot bear the anger and the bitterness in his heart. God made some of the people as Prophets and Apostles, the bearers of the brochures of His God, some He made kings and rulers over others, some He made rich and strong, poor and weak and so on. People who use their minds and minds, especially those who believe, will not be influenced by differences in degrees, degrees, wealth and position, but they will continue to accept right and reject wrong regardless of where the truth comes from, whether it comes from a head of state or a minister or from a despicable day has no effect. Ali bin Abi Talib once said, \"Pay attention to what is said and do not pay attention to who says it.\" The poor are tested with their fortitude in dealing with their poor condition, unlike the rich who can enjoy all kinds of physical pleasures with their wealth. The infidels of Mecca were tested in their purity by giving the gift of Prophet Muhammad, while he was a common man among them, not from the rich or the influential leaders of the tribe. All human beings are tested for their mental strength against differences and gaps between different groups in society. Whoever wins the test is the one who will find happiness in life both in the world and in the hereafter. In a hadith narrated by the Muslim Imam the Messenger of Allah (may peace be upon him) said: \"Look to those who are inferior to you, and do not look to those who are higher than you, for looking to those who are higher will bring you down to the favor of Allah. to you. \" (Muslim History) Such is the test that Allah gives to His servants, and He knows best among His hard-working and patient servants that He will pass those who pass and win. He will repay the victor the best and inflict punishment on the losers for his impatience and for his arrogance, and he will repay the favors he has given them.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan kepada Nabi Muhammad saw bahwa rasul-rasul sebelumnya juga makan dan minum seperti dia. Kecaman-kecaman orang kafir terhadap dirinya amat menyakitkan hati Muhammad, kecaman-kecaman itu bukan semata-mata kecaman saja, bahkan mengandung hinaan yang sangat merendahkan dirinya padahal dia adalah seorang Rasul yang dimuliakan Allah. Maka untuk menghibur dan meringankan tekanan batin yang diderita Nabi Muhammad saw yang disebabkan kecaman dan hinaan itu, Allah menyatakan kepadanya bahwa Dia tidak pernah mengutus seorang rasul sebelumnya seperti yang dikehendaki oleh orang-orang kafir Mekah itu.\n\nSemua Rasul yang diutusnya adalah manusia yang tidak bebas dari sifat-sifat manusiawinya, tetapi membutuhkan makanan dan minuman, tetap berusaha untuk memenuhi kebutuhan hidupnya sesuai dengan firman-Nya pada ayat-ayat yang lain.\n\nDan Kami tidak mengutus (rasul-rasul) sebelum engkau (Muhammad), melainkan beberapa orang laki-laki yang Kami beri wahyu kepada mereka, maka tanyakanlah kepada orang yang berilmu, jika kamu tidak mengetahui. Dan Kami tidak menjadikan mereka (rasul-rasul) suatu tubuh yang tidak memakan makanan dan mereka tidak (pula) hidup kekal. (al-Anbiya'\/21: 7-8)\n\nJadi perbedaan antara manusia sebagai Rasul dan manusia umumnya terletak pada keutamaan pribadinya, ketinggian akhlaknya, kesucian hati dan keikhlasannya dalam menunaikan tugasnya, karena itu diturunkanlah wahyu Allah kepadanya dan dikuatkan pula dengan mukjizat-mukjizat yang tidak dapat manusia menandinginya apalagi mengalahkannya. Maka ejekan dan kecaman orang kafir itu amat jauh dari sasarannya, tidak wajar dilontarkan kepada Nabi Muhammad saw. Kalau mereka benar-benar hendak membatalkan kebenaran yang dibawanya bukannya dengan kecaman seperti itu yang harus mereka kemukakan. \n\nMereka telah ditantang untuk menandingi mukjizat yang diberikan Allah kepadanya yaitu membuat satu surah pendek saja yang serupa nilainya dengan surah pendek dari Al-Qur'an. Tetapi mereka tidak berdaya dan tidak sanggup membuatnya walaupun mereka sudah termasuk golongan orang yang pintar dan tinggi sastranya. Hanya rasa benci dan dengki telah menggelapkan hati nurani mereka dan rasa takut akan kehilangan pengaruh dan kedudukan telah meluapkan amarah mereka. Karena itu mereka tetap menantang walaupun dalam hati mereka telah menyadari kekhilafan mereka.\n\nKemudian Allah menjelaskan pula bahwa manusia diuji dengan berbagai macam ujian. Masing-masing manusia diberi kebebasan untuk apakah dia akan tabah dan sabar menghadapi ujian itu ataukah dia akan berpaling dari kebenaran karena tidak tahan menanggung amarah dan rasa dengki di dalam hatinya. Allah menjadikan sebagian manusia sebagai Nabi dan Rasul, pembawa risalah Tuhan-Nya, sebagian lain dijadikan-Nya raja dan penguasa yang berkuasa atas manusia lainnya, sebagian lagi dijadikan-Nya kaya dan kuat, miskin dan lemah dan demikian seterusnya. Orang-orang yang mempergunakan akal dan pikirannya, terutama orang-orang yang beriman tidaklah akan terpengaruh oleh perbedaan tingkat, derajat, kekayaan dan kedudukan, tetapi dia akan tetap menerima yang benar dan menolak yang salah tanpa memperhitungkan darimana datangnya kebenaran itu, apakah kebenaran itu datangnya dari seorang kepala negara atau menteri atau dari seorang hina dina tidak mempunyai pengaruh apa-apa. \n\nAli bin Abi Talib pernah berkata, \"Perhatikanlah apa yang dikatakan dan janganlah kamu memperhatikan siapa yang mengatakannya.\" Si miskin diuji ketabahan hatinya menghadapi keadaannya yang serba kurang, tidak seperti orang kaya yang dapat menikmati berbagai macam kesenangan jasmani dengan kekayaannya itu.\n\nOrang-orang kafir Mekah itu diuji kebersihan hati mereka dengan memberikan karunia kerasulan kepada Nabi Muhammad, sedang dia adalah seorang biasa saja di antara mereka, bukan dari orang-orang kaya atau dari pemimpin kabilah yang berpengaruh besar. Semua manusia diuji kekuatan mentalnya menghadapi perbedaan dan jurang pemisah antara berbagai macam golongan dalam masyarakat. Barang siapa yang menang dalam menghadapi ujian itu dialah yang akan mendapatkan kebahagiaan hidup baik di dunia maupun di akhirat. Dalam sebuah hadis yang diriwayatkan oleh Imam Muslim Rasulullah saw bersabda:\n\n\"Lihatlah kepada orang yang rendah derajatnya dari kamu, dan janganlah melihat orang yang lebih tinggi dari kamu, karena melihat kepada orang yang lebih tinggi itu akan membawamu kepada merendahkan nilai nikmat yang telah dianugerahkan Allah kepadamu.\" (Riwayat Muslim)\n\nDemikianlah ujian yang diberikan Allah kepada hamba-hamba-Nya, dan Dia Maha Mengetahui siapa di antara hamba-Nya itu yang tabah dan sabar menghadapi ujian itu sehingga ia termasuk orang-orang yang lulus dan menang. Dia akan memberi balasan sebaik-baiknya kepada pemenangpemenang itu dan akan menimpakan siksaan kepada orang-orang yang kalah yang karena ketidaksabarannya dan karena kesombongannya dia sampai mendurhakai nikmat yang telah diberikan-Nya kepada mereka.",
      "text_translation": "Dan Kami tidak mengutus rasul-rasul sebelummu (Muhammad), melainkan mereka pasti memakan makanan dan berjalan di pasar-pasar. Dan Kami jadikan sebagian kamu sebagai cobaan bagi sebagian yang lain. Maukah kamu bersabar? Dan Tuhanmu Maha Melihat.",
      "text": "وَمَآ اَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِيْنَ اِلَّآ اِنَّهُمْ لَيَأْكُلُوْنَ الطَّعَامَ وَيَمْشُوْنَ فِى الْاَسْوَاقِۗ وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً  ۗ اَتَصْبِرُوْنَۚ وَكَانَ رَبُّكَ بَصِيْرًا ࣖ   ۔",
      "text_translation_en": "AND [even] before thee, [O Muhammad,] We never sent as Our message-bearers any but [mortal men] who indeed ate food [like other human beings] and went about in the market places: for [it is thus that] We cause you [human beings] to be a means of testing one another. Are you able to endure [this test] with patience? For [remember, O man,] thy Sustainer is truly all-seeing!",
      "juz_number": 18
    },
    "21": {
      "text_tafsir_en": "Those who do not believe in the Day of Resurrection or the Resurrection of Judgment, where they will be brought before God to be judged of all their deeds in the world, proudly ask why angels are not revealed to them who bear witness to the truth of Muhammad as a prophet, to dispel doubt they are about the truth of the revelation that was revealed to him. If that is difficult to do, why not just see the God who will tell them that Muhammad was truly sent by him to deliver the good news and warn. If that were to happen, they would say they would believe in Muhammad. These words are nothing but their own arrogance, and their cruelty in rejecting a messenger of God. They did not pay any attention to the miraculous signs that the Messenger had shown them. Everyone who is healthy will surely be amazed to hear their words and consider them speechless. If Allah had granted that desire, they would not have believed in Allah and His Messenger, as it is written in the Word of Allah: And though We sent down angels to them, and the dead spoke to them, and We gathered (in) before them all things (they desire), neither will they believe, unless Allah wills. But most of them do not know. (al-An'am \/ 6: 111) 21. This verse explains the other reasons that the Meccans made for their refusal to believe in the Prophet Muhammad. And those who did not expect to meet with us in the hereafter because of their disobedience to the last days, or because of their fear of it, they said, \"Why are not the angels revealed to us in the true form, who reveal the truth of Muhammad, or why don't we see our God? with the eyes of our heads who also announced the truth of the Prophet Muhammad. \"These requests are as clear as those of the Children of Israel. They are clearly from the hearts of those who are cruel. because they are persuaded by lust, they consider themselves noble, either because of their wealth or their position in society, and they have truly gone beyond the limits of wrongdoing, so if their hearts are covered by infidelity, all truth exists on the front, though bright, not completely ignored.",
      "text_tafsir": "Orang-orang yang tidak percaya hari kebangkitan atau mengingkari hari Kiamat, di mana mereka akan dihadapkan ke hadirat Allah untuk diadili segala perbuatannya di dunia, dengan penuh kesombongan bertanya kenapa tidak diturunkan kepada mereka malaikat yang menjadi saksi atas kebenaran Muhammad sebagai nabi, untuk menghilangkan keraguan mereka tentang kebenaran wahyu yang diturunkan kepadanya. Jika hal itu sulit untuk dilaksanakan, mengapa mereka tidak langsung saja melihat Tuhan yang akan menerangkan kepada mereka bahwa Muhammad itu benar-benar diutus oleh-Nya untuk menyampaikan kabar gembira dan memberi peringatan. Jika yang demikian itu terlaksana, mereka mengatakan akan beriman kepada Muhammad. Ucapan demikian itu tidak lain hanyalah karena kesombongan mereka sendiri, dan karena kezaliman mereka dengan mendustakan seorang utusan Allah. \n\nMereka sama sekali tidak menghiraukan mukjizat nyata yang telah diperlihatkan oleh Rasulullah kepada mereka. Setiap orang yang berakal sehat pasti akan tercengang mendengar ucapan-ucapan mereka itu dan menganggapnya sebagai ucapan orang yang tidak berakal. Seandainya Allah mengabulkan keinginan itu, mereka tetap tidak akan beriman kepada Allah dan rasul-Nya, sebagaimana tercantum dalam firman Allah:\n\nDan sekalipun Kami benar-benar menurunkan malaikat kepada mereka, dan orang yang telah mati berbicara dengan mereka dan Kami kumpulkan (pula) di hadapan mereka segala sesuatu (yang mereka inginkan), mereka tidak juga akan beriman, kecuali jika Allah menghendaki. Tapi kebanyakan mereka tidak mengetahui (arti kebenaran). (al-An'am\/6: 111)\n\n21. Ayat ini menjelaskan tentang alasan lainnya yang dibuat-buat kaum musyrik Mekah karena keengganan mereka beriman kepada Nabi Muhammad. Dan orang-orang yang tidak mengharapkan pertemuan dengan Kami di akhirat karena keingkaran mereka terhadap adanya hari akhir, atau karena ketidaktakutan mereka terhadapnya, mereka berkata, “Mengapa bukan para malaikat yang diturunkan kepada kita dalam wujudnya yang nyata, yang memberitahukan tentang kebenaran Nabi Muhammad, atau mengapa kita tidak melihat Tuhan kita? dengan mata kepala kita yang juga memberitahukan tentang kebenaran Nabi Muhammad.\" Permintaan-permintaan tersebut jelas mengada-ada, sama dengan apa yang dilakukan Bani Israil dahulu. Hal itu jelas muncul dari hati mereka yang penuh kedengkian. Sungguh, mereka telah me-nyombongkan diri mereka karena terbujuk oleh hawa nafsu. Mereka meng-anggap bahwa merekalah yang lebih mulia, baik karena kekayaan atau kedudukan mereka di masyarakat. Dan mereka benar-benar telah melampaui batas dalam melakukan kezaliman. Demikianlah jika hati telah tertutup oleh kekafiran, semua kebenaran yang ada di hadapan, walau sudah terang benderang, tidak diacuhkan sama sekali.",
      "text_translation": "Dan orang-orang yang tidak mengharapkan pertemuan dengan Kami (di akhirat) berkata, “Mengapa bukan para malaikat yang diturunkan kepada kita atau (mengapa) kita (tidak) melihat Tuhan kita?” Sungguh, mereka telah menyombongkan diri mereka dan benar-benar telah melampaui batas (dalam melakukan kezaliman).",
      "text": "۞ وَقَالَ الَّذِيْنَ لَا يَرْجُوْنَ لِقَاۤءَنَا لَوْلَآ اُنْزِلَ عَلَيْنَا الْمَلٰۤىِٕكَةُ اَوْ نَرٰى رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوْا فِيْٓ اَنْفُسِهِمْ وَعَتَوْ عُتُوًّا كَبِيْرًا",
      "text_translation_en": "But those who do not believe that they are destined to meet Us are wont to say, “Why have no angels been sent down to us?” – or, “Why do we not see our Sustainer?” Indeed, they are far too proud of themselves, hav­ing rebelled [against God’s truth] with utter disdain!",
      "juz_number": 19
    },
    "22": {
      "text_tafsir_en": "In this verse is explained the state of unbelievers and unbelievers when they meet with angels in the hereafter. The angels they want as apostles of the world, or as witnesses of the truth of Muhammad's prophecies, will be found in the hereafter. However, the meeting was not what they expected because they would not hear the good news of the angels, either in forgiveness of sin, or in heaven's command. They only heard the most offensive words, the hijrah of the pilgrimage, which means \"(heaven) is forbidden and banned for them\". The angelic utterance was considered to be very painful, as it was commonly spoken by the Arabs when they were having difficulty. As for the believers, they were welcomed by the angels who came to meet them and announced the glad tidings of heaven. This is reflected in the word of Allah: Verily those who say, \"Our Lord is God,\" and then they establish their position, the angels will come down to them, saying, \"Do not be afraid, nor be dismayed.\" and rejoice in that which is promised to you. \" (Fussilat \/ 41: 30)",
      "text_tafsir": "Pada ayat ini dijelaskan keadaan orang-orang kafir dan musyrik ketika berjumpa dengan malaikat di akhirat. Malaikat yang mereka inginkan sebagai rasul di dunia, atau sebagai saksi dari kebenaran kenabian Muhammad, akan mereka temui di akhirat. Namun demikian, pertemuan itu tidak seperti yang mereka harapkan karena mereka tidak akan mendengar kabar gembira dari para malaikat itu, baik berupa ampunan dari dosa, atau perintah masuk surga. Mereka hanya mendengar perkataan yang sangat menyakitkan hati, yaitu hijran mahjuran, yang berarti \"(surga) haram dan diharamkan bagi mereka\". Ucapan malaikat itu dianggap sangat menyakitkan, karena biasa diucapkan orang Arab ketika mendapatkan kesulitan.\n\nAdapun orang-orang mukmin disambut baik oleh para malaikat yang datang menyongsong mereka dan memberi kabar gembira untuk masuk surga. Hal ini digambarkan dalam firman Allah:\n\nSesungguhnya orang-orang yang berkata, \"Tuhan kami adalah Allah,\" kemudian mereka meneguhkan pendirian mereka, maka malaikat-malaikat akan turun kepada mereka (dengan berkata), \"Janganlah kamu merasa takut dan janganlah kamu bersedih hati; dan bergembiralah kamu dengan (memperoleh) surga yang telah dijanjikan kepadamu.\" (Fussilat\/41: 30)",
      "text_translation": "(Ingatlah) pada hari (ketika) mereka melihat para malaikat, pada hari itu tidak ada kabar gembira bagi orang-orang yang berdosa dan mereka berkata, “Hijran mahjura.”",
      "text": "يَوْمَ يَرَوْنَ الْمَلٰۤىِٕكَةَ لَا بُشْرٰى يَوْمَىِٕذٍ لِّلْمُجْرِمِيْنَ وَيَقُوْلُوْنَ حِجْرًا مَّحْجُوْرًا ",
      "text_translation_en": "[Yet] on that Day - the Day on which they shall see the angels there will be no glad tiding for those who were lost in sin; and they will exclaim, “By a forbidding ban [are we from God’s grace debarred]!” –",
      "juz_number": 19
    },
    "23": {
      "text_tafsir_en": "In this verse, Allah explains the causes of disbelief and misfortune for unbelievers. God will show all the deeds they consider good that they have done while living in the world, such as silaturrahim, helping people who suffer, giving alms to alleviate natural disasters, giving assistance to hospitals and orphans, freeing or redeeming captives, and so on. As much as their goodness, will not get any reward in the sight of Allah. They can only see the goodness without being able to take the slightest benefit. Their goodness is then made into God like dust flying in the sky because it is not based on true faith in God. They can only sit pensive filled with regret. That is what they feel as a result of their disbelief and arrogance.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan sebab-sebab kemalangan dan kerugian orang kafir. Allah akan memperlihatkan segala perbuatan yang mereka anggap baik yang pernah dikerjakan selama hidup di dunia, seperti silaturrahim, menolong orang yang menderita, memberikan derma untuk meringankan bencana alam, memberi bantuan kepada rumah sakit dan yatim piatu, membebaskan atau menebus tawanan, dan sebagainya. Sebanyak apa pun kebaikan mereka, tidak akan memperoleh imbalan apa pun di sisi Allah. Mereka hanya dapat memandang kebaikan itu tanpa dapat mengambil manfaatnya sedikit pun. Kebaikan-kebaikan mereka itu lalu dijadikan Allah bagaikan debu yang beterbangan di angkasa karena tidak dilandasi iman yang benar kepada Allah. Mereka hanya bisa duduk termenung penuh dengan penyesalan. Itulah yang mereka rasakan sebagai akibat kekafiran dan kesombongan mereka.",
      "text_translation": "Dan Kami akan perlihatkan segala amal yang mereka kerjakan, lalu Kami akan jadikan amal itu (bagaikan) debu yang beterbangan. ",
      "text": "وَقَدِمْنَآ اِلٰى مَا عَمِلُوْا مِنْ عَمَلٍ فَجَعَلْنٰهُ هَبَاۤءً مَّنْثُوْرًا ",
      "text_translation_en": "for We shall have turned towards all the [supposedly good] deeds they ever wrought, and shall have transformed them into scattered dust –",
      "juz_number": 19
    },
    "24": {
      "text_tafsir_en": "In contrast to the fate of those mentioned above, believers become dwellers of heaven in the hereafter. They get a better place to live than the abode of the idolaters in the world which they always make a symbol of grandeur and luxury. The heavenly abode is the most comfortable resting place. Enjoyment in the world is only temporary because it can only be felt while living in the world and even pleasure can be deceptive, as stated in God's word. Every soul will feel dead. And only on the Day of Resurrection are you given perfectly your reply. Whoever is kept away from hell and put into heaven, truly, he gains victory. Life in the world is just a tricking pleasure. (Ali 'Imran \/ 3: 185).",
      "text_tafsir": "Berbeda dengan nasib orang-orang yang disebut di atas, orang-orang yang beriman menjadi penghuni surga di akhirat. Mereka mendapatkan tempat tinggal yang jauh lebih baik dibandingkan dengan tempat kediaman kaum musyrikin di dunia yang selalu mereka jadikan lambang kemegahan dan kemewahan. Tempat kediaman ahli surga merupakan tempat istirahat yang paling nyaman. Kenikmatan di dunia hanya sementara karena hanya dapat dirasakan selama hidup di dunia dan kesenangannya pun bisa memperdaya, seperti tersebut dalam firman Allah.\n\nSetiap yang bernyawa akan merasakan mati. Dan hanya pada hari Kiamat sajalah diberikan dengan sempurna balasanmu. Barang siapa dijauhkan dari neraka dan dimasukkan ke dalam surga, sungguh, dia memperoleh kemenangan. Kehidupan dunia hanyalah kesenangan yang memperdaya. (ali 'Imran\/3: 185).",
      "text_translation": "Penghuni-penghuni surga pada hari itu paling baik tempat tinggalnya dan paling indah tempat istirahatnya. ",
      "text": "اَصْحٰبُ الْجَنَّةِ يَوْمَىِٕذٍ خَيْرٌ مُّسْتَقَرًّا وَّاَحْسَنُ مَقِيْلًا ",
      "text_translation_en": "[whereas] on that same Day those who are destined for paradise will be graced with the best of abodes and the fairest place of repose.",
      "juz_number": 19
    },
    "25": {
      "text_tafsir_en": "In this verse, God commands Muhammad to explain to his people the terrible day of Judgment. At that time, the heavens will break, and all the celestial bodies in it will fall like a mist, due to the collision of planets and stars that no longer orbit in their terms, as explained in God's word: And the heavens and the doors were opened, and the mountains were led up into mirth. (an-Naba '\/ 78: 19-20) When the heavens are divided; and when the stars are scattered; and when the ocean is flooded; and when the graves are demolished; (then) every soul will know what it has done and what it has forgotten. (al-Infithar \/ 82: 1-5) On that fateful day, angels were sent down in waves bearing books containing all the deeds of the servants of God they had witnessed and recorded while on earth. They were a source of evidence when they were judged by God in the Field of Mahsar. According to scientists, this verse, like many other verses in the Qur'an, confirms the incredible astronomical events that will occur on the Day of Judgment. They all show the total destruction and destruction of the system that connects parts of the universe. Includes total changes in position, shape, and relationships between elements in the universe. A final picture and total change that not only takes place on earth, but also covers the entire celestial body in this universe. The stars' collapsed, colliding with each other, due to the decay (loss) of the force of gravity, the breaking sky and the planets colliding and scattering. White fog depicts all trillions of celestial bodies, looking like fog. At that time the celestial bodies \"skyrocketed\" out of the sky as if pushed inward by the intense pressure that forced them out of the \"balloon\" of the sky. Stars, planets, and other celestial bodies are as small and light as dust “which has no power. The equilibrium and order between the components of the system in the universe no longer exists. The celestial bodies collide and explode. It could even be white fog that accumulates from the vapor generated by the explosions.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan kepada Muhammad untuk menjelaskan kepada kaumnya kedahsyatan hari Kiamat. Ketika itu, langit akan pecah, dan semua benda angkasa yang berada di dalamnya akan hancur bagaikan kabut yang beterbangan, akibat benturan planet-planet dan bintang-bintang yang tidak lagi mengorbit menurut ketentuannya masing-masing, sebagaimana dijelaskan dalam firman Allah:\n\nDan langit pun dibukalah, maka terdapatlah beberapa pintu, dan gunung-gunung pun dijalankan sehingga menjadi fatamorgana. (an-Naba'\/78: 19-20)\n\nApabila langit terbelah; dan apabila bintang-bintang jatuh berserakan; dan apabila lautan dijadikan meluap; dan apabila kuburan-kuburan dibongkar; (maka) setiap jiwa akan mengetahui apa yang telah dikerjakan dan yang dilalaikan(nya). (al-Infithar\/82: 1-5)\n\nPada hari yang dahsyat itu, malaikat diturunkan secara bergelombang sambil membawa kitab-kitab yang berisi catatan semua amal hamba-hamba Allah yang mereka saksikan dan catat ketika di dunia. Kitab-kitab itu menjadi bahan bukti ketika mereka diadili Allah di Padang Mahsyar.\n\nMenurut para ilmuwan, ayat ini, seperti banyak ayat lainnya dalam Al-Qur'an, menegaskan adanya kejadian-kejadian astronomis yang luar biasa kedahsyatannya yang akan terjadi pada hari Kiamat. Semuanya menunjukkan adanya kerusakan dan kehancuran secara menyeluruh dalam sistem yang mengaitkan bagian-bagian dari alam semesta. Termasuk perubahan total dalam kedudukan, bentuk, dan kaitan-kaitan antar elemen dalam semesta jagad raya ini. Suatu gambaran akhir dan perubahan total yang tidak hanya terjadi di bumi, tetapi juga mencakup keseluruhan benda-benda langit yang ada di alam semesta ini. Bintang-bintang 'berjatuhan, saling bertabrakan, karena rusaknya (hilangnya) gaya gravitasi, langit pecah-belah dan planet-planet saling berbenturan dan berhamburan. \n\nKabut putih menggambarkan semua benda-benda langit yang jumlahnya triliunan, seolah terlihat seperti kabut. Kala itu benda-benda langit tersebut \"melejit\" keluar dari langit seperti didesak dari dalam oleh tekanan besar yang memaksa mereka keluar dari \"balon\" langit. Bintang, planet, dan benda langit lainnya tak ubahnya seperti debu yang kecil dan ringan “ yang tidak mempunyai kekuatan apa-apa. Keseimbangan dan keteraturan antar komponen sistem dalam semesta pada saat itu sudah tidak ada lagi. Benda-benda langit saling berbenturan dan meledak. Bisa jadi kabut putih pun adalah awan-awan yang terkumpul dari uap-uap yang dihasilkan dari ledakan-ledakan tersebut.",
      "text_translation": "Dan (ingatlah) pada hari (ketika) langit pecah mengeluarkan kabut putih dan para malaikat diturunkan (secara) bergelombang.",
      "text": "وَيَوْمَ تَشَقَّقُ السَّمَاۤءُ بِالْغَمَامِ وَنُزِّلَ الْمَلٰۤىِٕكَةُ تَنْزِيْلًا ",
      "text_translation_en": "And on the Day on which the skies, together with the clouds, shall burst asunder, and the angels are made to descend in a mighty descent –",
      "juz_number": 19
    },
    "26": {
      "text_tafsir_en": "In this verse it is explained that the true and true kingdoms on the Day of Judgment belong to God, while the kingdoms that once existed in the world are immortal. Who belongs to the kingdom today? \"Belonging to the One, the All-Suffering God (al-Mu'min \/ 40: 16) As the true ruler of the kingdom, Allah is Most Gracious, Merciful, and All-Suffering when He judges His servants especially. But for the unbelievers, the Hereafter is a very difficult day, for the gods whom they worship cannot provide intercession or assistance, and the various difficulties they face make them desperate. against the disbelievers is described in the Qur'an: And if any wrongdoer (has) all things on the earth, he will surely redeem himself therein, and they will hide his regret when they have seen the punishment. among them justly, and they were not mistreated (Jonah 10:54)",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa kerajaan yang benar dan sejati pada hari Kiamat adalah milik Allah, sedangkan kerajaan-kerajaan yang pernah ada di dunia tidak ada yang abadi.\n\nMilik siapakah kerajaan pada hari ini?\" Milik Allah Yang Maha Esa, Maha Mengalahkan. (al-Mu'min\/40: 16)\n\nSebagai pemilik kerajaan yang sejati, Allah Maha Pemurah, Maha Pengasih, dan Mahaadil ketika mengadili para hamba-Nya terutama yang beriman dan patuh melaksanakan perintah-Nya. Sebaliknya bagi orang kafir, hari akhirat merupakan hari yang sangat sulit, karena tuhan-tuhan yang menjadi sembahan mereka tidak dapat memberi syafaat atau pertolongan. Berbagai kesukaran yang mereka hadapi itu membuat mereka putus asa. Situasi yang dihadapi orang-orang kafir digambarkan dalam Al-Qur'an:\n\nDan kalau setiap orang yang zalim itu (mempunyai) segala yang ada di bumi, tentu dia menebus dirinya dengan itu, dan mereka menyembunyikan penyesalannya ketika mereka telah menyaksikan azab itu. Kemudian diberi keputusan di antara mereka dengan adil, dan mereka tidak dizalimi. (Yunus\/10: 54)",
      "text_translation": "Kerajaan yang hak pada hari itu adalah milik Tuhan Yang Maha Pengasih. Dan itulah hari yang sulit bagi orang-orang kafir. ",
      "text": "اَلْمُلْكُ يَوْمَىِٕذِ ِۨالْحَقُّ لِلرَّحْمٰنِۗ وَكَانَ يَوْمًا عَلَى الْكٰفِرِيْنَ عَسِيْرًا ",
      "text_translation_en": "on that Day [it will become obvious to all that] true sover­eignty belongs to the Most Gracious [alone]: hence, a Day of distress will it be for all who deny the truth,",
      "juz_number": 19
    },
    "27": {
      "text_tafsir_en": "On that day, the wrongdoers will bite their fingers with regret for neglecting their duties throughout life. Arrogantly, they turned away from the truth that the Messenger of God had brought to them. They wept bitterly to regret that if they had lived in the world, they would have followed the Messenger of Allah on a straight path leading to world and world security. They said with remorse, \"If I had followed the world before Muhammad, he would be on the right path. Suppose I could endure arrogance and sincerely embrace Islam, I would not have felt this difficulty.\" It's just that regret is no longer useful. They regret having mistakenly been looking for a friend. It was a great accident and destruction. \"If I hadn't made that fulan my close friend, he would not have been able to get me into the wrong.\" It is true that the human being is brought into the accident and the misconception is that there is a demon or a human-shaped demon, such as an Arab monk named Ubay bin Khalaf. The friendship of 'Uqbah bin Abi Mu'aith with Ubay bin Khalaf was very influential for him. 'Uqbah bin Abi Mu'aith often attended the Prophet Muhammad's study and became a good acquaintance. One day, he invited Prophet Muhammad to eat at his house. At that time, the Prophet would not eat unless 'Uqbah bin Abi Mu'aith would convert to Islam and' Uqbah recited two verses of the confession. But the companion of 'Uqbah bin Abi Mu'aith named Ubay bin Khalaf was unhappy and angry with him. 'Uqbah bin Abi Mu'aith said that he converted to Islam only to pretend. Ubay bin Khalaf asked 'Uqbah bin Abi Mu'aith to spit on the face of Prophet Muhammad. He did so while he was performing prayers in Dar an-Nadwah, near the House. 'Uqbah bin Abi Mu'aith obeyed the wishes of his companions. Thus the result of friendship with the bad person will have the same bad consequences. The Prophet Muhammad provided guidelines for always looking for a good friend or friend. His Word: Someone's going to follow his friend's behavior, so watch out for your friend. (History of Abu Dawud and at-Tirmidzi of Abu Hurairah) And the Messenger of Allah (may peace be upon him) said: The image of a good and bad friend is like that of a musket and a smith. The musk carrier is sometimes you accept or buy oil from it. And at least you get the scent from it. As for the blacksmith, he sometimes burns your clothes (because of the burning of the fire) or you find an unpleasant odor. \"(Asya-Shaykh narration of Abu Musa al-Ash'ari).",
      "text_tafsir": "Pada hari itu, orang-orang yang zalim akan menggigit jari mereka dengan penuh penyesalan karena telah melalaikan kewajiban-kewajibannya selama hidup di dunia. Dengan sombong, mereka telah berpaling dari kebenaran yang dibawa oleh utusan Allah kepada mereka. Mereka menangis tersedu-sedu menyesali diri seandainya dulu ketika hidup di dunia mereka mengikuti ajakan Rasulullah kepada jalan yang lurus yang membawa keselamatan dunia dan akhirat. Mereka berkata dengan penuh penyesalan, \"Seandainya aku di dunia dulu mengikuti Muhammad, bersama-sama beliau menuju jalan yang benar. Andaikan aku dulu dapat menahan kesombongan sehingga dengan tulus ikhlas memeluk agama Islam, niscaya aku tidak merasakan kesulitan ini.\" Hanya sayang penyesalan itu tidak berguna lagi. \n\nMereka menyesal karena keliru mencari kawan. Ini kecelakaan dan kebinasaan yang besar. \"Seandainya aku dulu tidak menjadikan si fulan itu teman akrabku, tentu dia tidak dapat menjerumuskan aku ke dalam kesesatan.\" Memang yang menjerumuskan manusia ke dalam kecelakaan dan kesesatan itu ada kalanya setan sendiri atau setan yang berbentuk manusia, seperti seorang musyrik Arab yang bernama Ubay bin Khalaf.\n\nPersahabatan 'Uqbah bin Abi Mu'aith dengan Ubay bin Khalaf sangat berpengaruh baginya. 'Uqbah bin Abi Mu'aith sering menghadiri pengajian Nabi Muhammad sehingga menjadi kenalan yang baik. Pada suatu hari, ia mengundang Nabi Muhammad untuk makan di rumahnya. Ketika itu, Nabi tidak mau makan kecuali jika 'Uqbah bin Abi Mu'aith mau masuk Islam, lalu 'Uqbah membaca dua kalimat syahadat.\n\nNamun sahabat 'Uqbah bin Abi Mu'aith yang bernama Ubay bin Khalaf tidak senang dan marah kepadanya. 'Uqbah bin Abi Mu'aith lalu mengatakan bahwa ia masuk Islam hanya pura-pura saja. Ubay bin Khalaf menyuruh agar 'Uqbah bin Abi Mu'aith meludahi wajah Nabi Muhammad. Hal itu lalu dilakukannya ketika beliau sedang melaksanakan salat di Dar an-Nadwah, dekat Baitullah. 'Uqbah bin Abi Mu'aith mematuhi apa yang dikehendaki sahabatnya. Demikianlah akibat persahabatan dengan orang yang tidak baik akan membawa akibat yang tidak baik pula. \n\nNabi Muhammad memberi pedoman agar selalu mencari sahabat atau teman akrab yang baik. Sabda beliau:\n\nSeseorang akan mengikuti perilaku temannya, maka perhatikanlah siapa temanmu. (Riwayat Abu Dawud dan at-Tirmidzi dari Abu Hurairah)\n\nDan sabda Rasulullah saw:\n\nPerumpamaan teman duduk yang baik dan yang jahat ialah seperti pembawa minyak kasturi dan pandai besi. Pembawa minyak kasturi itu adakalanya kamu menerima atau membeli minyak daripadanya. Dan paling sedikit kamu mendapatkan bau harum daripadanya. Adapun pandai besi kadang-kadang ia membakar pakaianmu (karena semburan apinya) atau kamu menjumpai bau yang tidak sedap.\" (Riwayat asy-Syaikhan dari Abu Musa al-Asy'ari).",
      "text_translation": "Dan (ingatlah) pada hari (ketika) orang-orang zalim menggigit dua jarinya, (menyesali perbuatannya) seraya berkata, “Wahai! Sekiranya (dulu) aku mengambil jalan bersama Rasul.  ",
      "text": "وَيَوْمَ يَعَضُّ الظَّالِمُ عَلٰى يَدَيْهِ يَقُوْلُ يٰلَيْتَنِى اتَّخَذْتُ مَعَ الرَّسُوْلِ سَبِيْلًا ",
      "text_translation_en": "and a Day on which the evildoer will bite his hands [in despair], exclaiming: “Oh, would that I had followed the path shown to me by the apostle!",
      "juz_number": 19
    },
    "28": {
      "text_tafsir_en": "On that day, the wrongdoers will bite their fingers with regret for neglecting their duties throughout life. Arrogantly, they turned away from the truth that the Messenger of God had brought to them. They wept bitterly to regret that if they had lived in the world, they would have followed the Messenger of Allah on a straight path leading to world and world security. They said with remorse, \"If I had followed the world before Muhammad, he would be on the right path. Suppose I could endure arrogance and sincerely embrace Islam, I would not have felt this difficulty.\" It's just that regret is no longer useful. They regret having mistakenly been looking for a friend. It was a great accident and destruction. \"If I hadn't made that fulan my close friend, he would not have been able to get me into the wrong.\" It is true that the human being is brought into the accident and the misconception is that there is a demon or a human-shaped demon, such as an Arab monk named Ubay bin Khalaf. The friendship of 'Uqbah bin Abi Mu'aith with Ubay bin Khalaf was very influential for him. 'Uqbah bin Abi Mu'aith often attended the Prophet Muhammad's study and became a good acquaintance. One day, he invited Prophet Muhammad to eat at his house. At that time, the Prophet would not eat unless 'Uqbah bin Abi Mu'aith would convert to Islam and' Uqbah recited two verses of the confession. But the companion of 'Uqbah bin Abi Mu'aith named Ubay bin Khalaf was unhappy and angry with him. 'Uqbah bin Abi Mu'aith said that he converted to Islam only to pretend. Ubay bin Khalaf asked 'Uqbah bin Abi Mu'aith to spit on the face of Prophet Muhammad. He did so while he was performing prayers in Dar an-Nadwah, near the House. 'Uqbah bin Abi Mu'aith obeyed the wishes of his companions. Thus the result of friendship with the bad person will have the same bad consequences. The Prophet Muhammad provided guidelines for always looking for a good friend or friend. His Word: Someone's going to follow his friend's behavior, so watch out for your friend. (History of Abu Dawud and at-Tirmidzi of Abu Hurairah) And the Messenger of Allah (may peace be upon him) said: The image of a good and bad friend is like that of a musket and a smith. The musk carrier is sometimes you accept or buy oil from it. And at least you get the scent from it. As for the blacksmith, he sometimes burns your clothes (because of the burning of the fire) or you find an unpleasant odor. \"(Asya-Shaykh narration of Abu Musa al-Ash'ari).",
      "text_tafsir": "Pada hari itu, orang-orang yang zalim akan menggigit jari mereka dengan penuh penyesalan karena telah melalaikan kewajiban-kewajibannya selama hidup di dunia. Dengan sombong, mereka telah berpaling dari kebenaran yang dibawa oleh utusan Allah kepada mereka. Mereka menangis tersedu-sedu menyesali diri seandainya dulu ketika hidup di dunia mereka mengikuti ajakan Rasulullah kepada jalan yang lurus yang membawa keselamatan dunia dan akhirat. Mereka berkata dengan penuh penyesalan, \"Seandainya aku di dunia dulu mengikuti Muhammad, bersama-sama beliau menuju jalan yang benar. Andaikan aku dulu dapat menahan kesombongan sehingga dengan tulus ikhlas memeluk agama Islam, niscaya aku tidak merasakan kesulitan ini.\" Hanya sayang penyesalan itu tidak berguna lagi. \n\nMereka menyesal karena keliru mencari kawan. Ini kecelakaan dan kebinasaan yang besar. \"Seandainya aku dulu tidak menjadikan si fulan itu teman akrabku, tentu dia tidak dapat menjerumuskan aku ke dalam kesesatan.\" Memang yang menjerumuskan manusia ke dalam kecelakaan dan kesesatan itu ada kalanya setan sendiri atau setan yang berbentuk manusia, seperti seorang musyrik Arab yang bernama Ubay bin Khalaf.\n\nPersahabatan 'Uqbah bin Abi Mu'aith dengan Ubay bin Khalaf sangat berpengaruh baginya. 'Uqbah bin Abi Mu'aith sering menghadiri pengajian Nabi Muhammad sehingga menjadi kenalan yang baik. Pada suatu hari, ia mengundang Nabi Muhammad untuk makan di rumahnya. Ketika itu, Nabi tidak mau makan kecuali jika 'Uqbah bin Abi Mu'aith mau masuk Islam, lalu 'Uqbah membaca dua kalimat syahadat.\n\nNamun sahabat 'Uqbah bin Abi Mu'aith yang bernama Ubay bin Khalaf tidak senang dan marah kepadanya. 'Uqbah bin Abi Mu'aith lalu mengatakan bahwa ia masuk Islam hanya pura-pura saja. Ubay bin Khalaf menyuruh agar 'Uqbah bin Abi Mu'aith meludahi wajah Nabi Muhammad. Hal itu lalu dilakukannya ketika beliau sedang melaksanakan salat di Dar an-Nadwah, dekat Baitullah. 'Uqbah bin Abi Mu'aith mematuhi apa yang dikehendaki sahabatnya. Demikianlah akibat persahabatan dengan orang yang tidak baik akan membawa akibat yang tidak baik pula. \n\nNabi Muhammad memberi pedoman agar selalu mencari sahabat atau teman akrab yang baik. Sabda beliau:\n\nSeseorang akan mengikuti perilaku temannya, maka perhatikanlah siapa temanmu. (Riwayat Abu Dawud dan at-Tirmidzi dari Abu Hurairah)\n\nDan sabda Rasulullah saw:\n\nPerumpamaan teman duduk yang baik dan yang jahat ialah seperti pembawa minyak kasturi dan pandai besi. Pembawa minyak kasturi itu adakalanya kamu menerima atau membeli minyak daripadanya. Dan paling sedikit kamu mendapatkan bau harum daripadanya. Adapun pandai besi kadang-kadang ia membakar pakaianmu (karena semburan apinya) atau kamu menjumpai bau yang tidak sedap.\" (Riwayat asy-Syaikhan dari Abu Musa al-Asy'ari).",
      "text_translation": "Wahai, celaka aku! Sekiranya (dulu) aku tidak menjadikan si fulan itu teman akrab(ku), ",
      "text": "يٰوَيْلَتٰى لَيْتَنِيْ لَمْ اَتَّخِذْ فُلَانًا خَلِيْلًا ",
      "text_translation_en": "Oh, woe is me! Would that I had not taken so-and-so for a friend!",
      "juz_number": 19
    },
    "29": {
      "text_tafsir_en": "In this verse it is explained that the disbelievers said, \"Someone has led me astray from the teachings of the Qur'an and from faith in Muhammad after the instructions came to me.\" It is the habit of Satan to deceive people and turn them away from the truth and do not want to help the people they have misled.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa orang-orang kafir itu berkata, \"Seseorang telah menyesatkan aku dari ajaran Al-Qur'an dan dari beriman kepada Muhammad setelah petunjuk itu datang kepadaku.\" Adalah kebiasaan setan menipu manusia dan me-malingkannya dari kebenaran dan tidak mau menolong manusia yang telah disesatkannya itu.",
      "text_translation": "sungguh, dia telah menyesatkan aku dari peringatan (Al-Qur'an) ketika (Al-Qur'an) itu telah datang kepadaku. Dan setan memang pengkhianat manusia.” ",
      "text": "لَقَدْ اَضَلَّنِيْ عَنِ الذِّكْرِ بَعْدَ اِذْ جَاۤءَنِيْۗ وَكَانَ الشَّيْطٰنُ لِلْاِنْسَانِ خَذُوْلًا ",
      "text_translation_en": "Indeed, he led me astray from the remembrance [of God] after it had come unto me!” For [thus it is:] Satan is ever a betrayer of man.",
      "juz_number": 19
    },
    "30": {
      "text_tafsir_en": "In this verse, the Prophet complained to Allah, saying, \"O my Lord, surely My people make this Qur'an an indefinite thing. Then Allah commanded His Messenger to be patient and steadfast in facing His people.",
      "text_tafsir": "Pada ayat ini, Rasulullah mengadu kepada Allah dengan berkata, \"Ya Tuhanku, sesungguhnya kaumku menjadikan Al-Qur'an ini sesuatu yang tidak perlu dihiraukan. Mereka tidak beriman kepadanya, tidak memperhatikan janji dan peringatan-nya. Bahkan mereka berpaling darinya dan menolak mengikuti-nya. Kemudian Allah menyuruh rasul-Nya berlaku sabar dan tabah menghadapi kaumnya.",
      "text_translation": "Dan Rasul (Muhammad) berkata, “Ya Tuhanku, sesungguhnya kaumku telah menjadikan Al-Qur'an ini diabaikan.”",
      "text": "وَقَالَ الرَّسُوْلُ يٰرَبِّ اِنَّ قَوْمِى اتَّخَذُوْا هٰذَا الْقُرْاٰنَ مَهْجُوْرًا ",
      "text_translation_en": "AND [on that Day] the Apostle will say: “O my Sustainer! Behold, [some of] my people have come to regard this Qur’an as something [that ought to be] discarded!”",
      "juz_number": 19
    },
    "31": {
      "text_tafsir_en": "God has made every prophet an enemy of the devil and the wicked who always scoff at the purity of religion and underestimate the guidance that the apostles brought to them. Therefore, Allah commands the Prophet not to despair or to feel alone in facing such challenges, for Allah is enough to guide and help. In accordance with the word of God: And thus for every prophet We have made enemies of the devils of men and of spirits, some of them whispering to others words of beauty as deceit. (al-An'am \/ 6: 112)",
      "text_tafsir": "Allah telah menjadikan bagi setiap nabi musuh dari setan dan orang-orang jahat yang selalu mencemoohkan kesucian agama dan meremehkan petunjuk yang dibawa oleh para rasul kepada mereka. Oleh karena itu, Allah berpesan agar Nabi tidak berputus asa ataupun merasa sendirian menghadapi tantangan-tantangan seperti itu, karena cukuplah Allah yang menjadi pemberi petunjuk dan penolong. Sesuai dengan firman Allah:\n\nDan demikianlah untuk setiap nabi Kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin, sebagian mereka membisikkan kepada sebagian yang lain perkataan yang indah sebagai tipuan. (al-An'am\/6: 112)",
      "text_translation": "Begitulah, bagi setiap nabi, telah Kami adakan musuh dari orang-orang yang berdosa. Tetapi cukuplah Tuhanmu menjadi pemberi petunjuk dan penolong. ",
      "text": "وَكَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِّنَ الْمُجْرِمِيْنَۗ وَكَفٰى بِرَبِّكَ هَادِيًا وَّنَصِيْرًا ",
      "text_translation_en": "For so it is that against every prophet We have set up enemies from among those who are lost in sin: yet none can guide and give succour as thy Sustainer does!",
      "juz_number": 19
    },
    "32": {
      "text_tafsir_en": "The unbelievers and the Jews asked why the Qur'an was not sent to Muhammad once, like the previous books of God, the Torah to Moses and the Psalm to David. Allah rejected them and explained why the Qur'an was revealed gradually. The Qur'an was revealed gradually so that Allah would ease and strengthen the heart of the Prophet Muhammad. Allah says: And the Qur'an (We send down) gradually you (Muhammad) will read it to mankind slowly and We will bring it down gradually. (al-Isra '\/ 17: 106) The gradual descent of the Qur'an contains many wisdom, including: 1. The Prophet Muhammad often met with the angel Gabriel so that he received many counsels to increase his spirit, patience, and perseverance to deliver his brochure. 2. Since the Prophet Muhammad could not read and write (ummi) then if the Qur'an was revealed at the same time, he would have difficulty memorizing it. 3. That the memory be more firm, perfect, and avoided from all forgetfulness. 4. If the Qur'an was revealed at the same time, it would have been revealed at the same time. That would have caused a lot of trouble. However, due to the gradual decline, the Shari'a was gradually implemented to make it easier to carry out, both by the Prophet and his people. 5. Because the Qur'anic descent has much to do with its origins such as various questions, events, or events, it is gradually more effective in the hearts of friends as they are able to live it event by event. 6. If the Qur'an is gradually decreasing, they will not be able to imitate the Qur'an even in one verse, especially if it is revealed at once. 7. Some of the laws of the Islamic Shari'ah decreased according to the development of the Muslims during that time. Then, as they became more intelligent and more firm in their faith, a more perfect Islamic law was introduced with the following Qur'anic verses. If the Qur'an was revealed at the same time it would not have been possible.",
      "text_tafsir": "Orang-orang kafir dan orang-orang Yahudi bertanya mengapa Al-Qur'an tidak diturunkan kepada Muhammad sekali turun, seperti kitab-kitab Allah sebelumnya, yaitu kitab Taurat kepada Musa dan Zabur kepada Daud. Allah menolak pertanyaan mereka itu dan menerangkan mengapa Al-Qur'an diturunkan secara ber-angsur-angsur. Al-Qur'an diturunkan berangsur-angsur agar Allah memudahkan dan menguatkan hati Nabi Muhammad. Allah berfirman:\n\nDan Al-Qur'an (Kami turunkan) berangsur-angsur agar engkau (Muhammad) membacakannya kepada manusia perlahan-lahan dan Kami menurunkannya secara bertahap. (al-Isra'\/17: 106)\n\nTurunnya Al-Qur'an secara berangsur-angsur memang mengandung banyak hikmah, di antaranya:\n\n1. Nabi Muhammad sering berjumpa dengan malaikat Jibril sehingga banyak menerima nasihat guna menambah semangat, kesabaran, dan ketabahan dalam menunaikan risalah-Nya.\n\n2. Karena Nabi Muhammad tidak dapat membaca dan menulis (ummi) maka seandainya Al-Qur'an itu diturunkan sekaligus, tentu ia akan kesulitan untuk menghafalnya. \n\n3. Supaya hafalannya lebih mantap, sempurna, dan terhindar dari segala kealpaan.\n\n4. Seandainya Al-Qur'an itu diturunkan sekaligus, tentu syariat-syariatnya pun diturunkan sekaligus. Hal yang demikian itu pasti mengakibatkan banyak kesulitan. Akan tetapi, karena turunnya berangsur-angsur maka syariat pun diberlakukan secara berangsur-angsur sehingga mudah dilaksanakan, baik oleh Rasul maupun umatnya.\n\n5. Karena turunnya Al-Qur'an banyak berkaitan dengan sebab-sebab turunnya seperti adanya berbagai pertanyaan, peristiwa, atau kejadian, maka turunnya secara bertahap lebih berkesan dalam hati para sahabat karena mereka bisa menghayatinya peristiwa demi peristiwa.\n\n6. Kalau dengan turunnya Al-Qur'an secara berangsur-angsur saja, mereka tidak mampu meniru Al-Qur'an walaupun satu ayat, apalagi jika diturunkan sekaligus.\n\n7. Sebagian hukum syariat Islam turun sesuai dengan perkembangan kaum Muslimin pada waktu itu. Kemudian setelah mereka bertambah cerdas dan mantap keimanannya, barulah diterapkan syariat Islam yang lebih sempurna dengan ayat-ayat Al-Qur'an yang turun kemudian. Seandainya Al-Qur'an diturunkan sekaligus tentu hal demikian itu tidak mungkin terjadi.",
      "text_translation": "Dan orang-orang kafir berkata, “Mengapa Al-Qur'an itu tidak diturunkan kepadanya sekaligus?” Demikianlah, agar Kami memperteguh hatimu (Muhammad) dengannya dan Kami membacakannya secara tartil (berangsur-angsur, perlahan dan benar). ",
      "text": "وَقَالَ الَّذِيْنَ كَفَرُوْا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْاٰنُ جُمْلَةً وَّاحِدَةً ۛ كَذٰلِكَ ۛ لِنُثَبِّتَ بِهٖ فُؤَادَكَ وَرَتَّلْنٰهُ تَرْتِيْلًا ",
      "text_translation_en": "Now they who are bent on denying the truth are wont to ask. “Why has not the Qur’an been bestowed on him from on high in one single re­velation?” [it has been revealed] in this manner so that We might strengthen thy heart thereby - for We have so arranged its component parts that they form one consistent whole -",
      "juz_number": 19
    },
    "33": {
      "text_tafsir_en": "In this verse, Allah tells the Prophet Muhammad that He will not allow the disbelievers to come to the Prophet to bring something that they are falsely trying to defile. Allah will only bring the Prophet a truth to reject their accusations and give the best explanation. The same thing is said in the Word of Allah: We cast the right (the truth) to the unjust (the unrighteous) and then the right is destroyed, and then the (unjust) is abolished. (al-Anbiya '\/ 21: 18)",
      "text_tafsir": "Dalam ayat ini, Allah mengatakan kepada Nabi Muhammad bahwa Dia tidak akan membiarkan orang-orang kafir itu datang kepada Nabi membawa sesuatu yang batil yang mereka ada-adakan untuk menodai kerasulannya. Allah hanya akan mendatangkan kepada Nabi suatu yang benar untuk menolak tuduhan mereka dan memberikan penjelasan yang paling baik. Hal seperti ini tersebut pula dalam firman Allah:\n\nSebenarnya Kami melemparkan yang hak (kebenaran) kepada yang batil (tidak benar) lalu yang hak itu menghancurkannya, maka seketika itu (yang batil) lenyap. (al-Anbiya'\/21: 18)",
      "text_translation": "Dan mereka (orang-orang kafir itu) tidak datang kepadamu (membawa) sesuatu yang aneh, melainkan Kami datangkan kepadamu yang benar dan penjelasan yang paling baik. ",
      "text": "وَلَا يَأْتُوْنَكَ بِمَثَلٍ اِلَّا جِئْنٰكَ بِالْحَقِّ وَاَحْسَنَ تَفْسِيْرًا ۗ",
      "text_translation_en": "and [that] they [who deny the truth] might never taunt thee with any deceptive half-truth without Our conveying to thee the [full] truth and [providing thee] with the best explanation.",
      "juz_number": 19
    },
    "34": {
      "text_tafsir_en": "This verse explains that those who are led to Hell, by dragging their faces with chains and shackles, are the worst and worst people of their way. The Prophet Muhammad was commanded by Allah to speak these words to the disbelievers who presented some peculiar traits to defile his letter, in the sense that it was as if he were asking them to compare who was there and who was in misguided. In accordance with the word of Allah: And verily we or you (the disbelievers) must be in truth or in a true error. (Saba '\/ 34: 24) It is also mentioned in the hadith of the Messenger of Allah (may peace be upon him): On the Day of Resurrection, people will be gathered in three groups, one group walking, one another riding, and another group walking with their faces. The Prophet asked, \"How do they walk with his face?\" He replied, \"Surely the Lord who can guide them with both feet can also carry them with his face. Remember, they keep their faces from sharp and thorny things.\" (At-Tirmidzi History of Abu Hurairah). It is meant here that angels drag the faces of unbelievers into hell.",
      "text_tafsir": "Ayat ini menjelaskan bahwa orang-orang yang digiring ke neraka Jahanam, dengan cara menyeret wajah mereka dengan rantai-rantai dan belenggu, adalah orang-orang yang paling buruk tempatnya dan paling sesat jalannya. Nabi Muhammad diperintahkan oleh Allah untuk mengucapkan kata-kata ini kepada orang-orang kafir yang mengemukakan beberapa sifat yang ganjil untuk menodai kerasulannya, dengan maksud seolah-olah beliau ini menyuruh mereka untuk mengadakan perbandingan siapakah di antara mereka yang mendapat petunjuk dan siapa yang berada dalam kesesatan. Sesuai dengan firman Allah:\n\nDan sesungguhnya kami atau kamu (orang-orang musyrik), pasti berada dalam kebenaran atau dalam kesesatan yang nyata. (Saba'\/34: 24)\n\nJuga tersebut dalam hadis Rasulullah saw:\n\nAkan dikumpulkan manusia pada hari Kiamat dalam tiga golongan, segolongan berjalan kaki, segolongan lagi berkendaraan, dan segolongan lagi berjalan dengan wajahnya. Rasulullah ditanya, \"Bagaimana mereka berjalan dengan wajahnya?\" Beliau menjawab, \"Sesungguhnya Tuhan yang dapat memperjalankan mereka dengan kedua kakinya mampu pula memperjalankan mereka dengan wajahnya. Ingatlah, mereka menjaga wajah mereka dari benda-benda yang tajam dan berduri.\" (Riwayat at-Tirmidzi dari Abu Hurairah).\n\nYang dimaksud di sini bahwa malaikat menyeret wajah orang-orang kafir ke dalam neraka.",
      "text_translation": "Orang-orang yang dikumpulkan ke neraka Jahanam dengan diseret wajahnya, mereka itulah yang paling buruk tempatnya dan paling sesat jalannya. ",
      "text": "اَلَّذِيْنَ يُحْشَرُوْنَ عَلٰى وُجُوْهِهِمْ اِلٰى جَهَنَّمَۙ اُولٰۤىِٕكَ شَرٌّ مَّكَانًا وَّاَضَلُّ سَبِيْلًا ࣖ ",
      "text_translation_en": "[And so, tell those who are bent on denying the truth that] they who shall be gathered unto hell upon their faces – it is they who [in the life to come] will be worst in station and still farther astray from the path [of truth]!",
      "juz_number": 19
    },
    "35": {
      "text_tafsir_en": "This verse explains that God passed down the book to Moses just as he handed down the Quran to Muhammad. He also had Aaron, his brother, join him as a vizier (aide) to whom he always consulted to ask his opinion. In another verse it is explained that Aaron was aided by Moses as a prophet. This is not the case because Aaron was a prophet, but in the field of Shari'a he obeyed the law of Moses and followed his instructions. God then explained that Moses and Aaron were commanded to present his message to Pharaoh with the assurance that the final victory would be on their side.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah menurunkan kitab Taurat kepada Nabi Musa seperti menurunkan Al-Qur'an kepada Nabi Muhammad. Dia juga telah menjadikan Harun, saudaranya, menyertai dia sebagai seorang wazir (pembantu) yang selalu diajak musyawarah untuk diminta pendapatnya. Dalam ayat lain diterangkan bahwa Harun itu diperbantukan kepada Musa sebagai seorang nabi. Hal ini tidak bertentangan karena walaupun Harun seorang nabi, tetapi dalam bidang syariat ia mengikuti syariat Musa dan mengikuti petunjuk-petunjuk-Nya. Kemudian Allah menjelaskan bahwa Musa dan Harun diperintahkan supaya menyampaikan risalah-Nya kepada Fir'aun dengan jaminan bahwa kemenangan terakhir pasti berada di pihak mereka.",
      "text_translation": "Dan sungguh, Kami telah memberikan Kitab (Taurat) kepada Musa dan Kami telah menjadikan Harun saudaranya, menyertai dia sebagai wazir (pembantu). ",
      "text": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ وَجَعَلْنَا مَعَهٗٓ اَخَاهُ هٰرُوْنَ وَزِيْرًا ۚ ",
      "text_translation_en": "AND, INDEED, [long before Muhammad] We vouchsafed revelation unto Moses, and appointed his brother Aaron to help him to bear his burden;",
      "juz_number": 19
    },
    "36": {
      "text_tafsir_en": "Then God commanded Moses and Aaron to go and preach to Pharaoh and his people who had rejected the signs of God's oneness in the universe. After they fulfilled their task of delivering the leaflets gently, it turned out that Pharaoh's attitude remained unchanged, so that God destroyed them. As it says in the Word of God: Allah has destroyed them, and for the disbelievers will receive the same. (Muhammad \/ 47: 10). With this incident, God comforted the Prophet Muhammad and taught him to be patient, because he was not the first prophet to be rejected by his people.",
      "text_tafsir": "Kemudian Allah memerintahkan kepada Musa dan Harun untuk pergi dan berdakwah kepada Fir'aun dan kaumnya yang telah mendustakan tanda-tanda keesaan Allah yang terdapat di alam semesta. Setelah mereka menunaikan tugasnya yaitu menyampaikan risalahnya dengan lemah lembut, ternyata sikap Fir'aun tetap tidak berubah, sehingga Allah membinasakan mereka. Seperti tersebut dalam firman Allah:\n\nAllah telah membinasakan mereka, dan bagi orang-orang kafir akan menerima (nasib) yang serupa itu. (Muhammad\/47: 10).\n\nDengan peristiwa ini, Allah menghibur Nabi Muhammad dan mendidiknya supaya berlaku sabar, karena beliau bukanlah nabi pertama yang didustakan oleh kaumnya.",
      "text_translation": "Kemudian Kami berfirman (kepada keduanya), “Pergilah kamu berdua kepada kaum yang mendustakan ayat-ayat Kami.” Lalu Kami hancurkan mereka dengan sehancur-hancurnya. ",
      "text": "فَقُلْنَا اذْهَبَآ اِلَى الْقَوْمِ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَاۗ فَدَمَّرْنٰهُمْ تَدْمِيْرًا ۗ",
      "text_translation_en": "and We said, “Go you both unto the people who have given the lie to Our messages!” - and thereupon We broke those [sinners] to smithereens.",
      "juz_number": 19
    },
    "37": {
      "text_tafsir_en": "Thus God destroyed the people of Noah who had rejected the apostles. After Noah finished his treatise by delivering his preaching to his people, but those who believed in him were few, God drowned them with typhoons and great floods that destroyed all people and animals except those in Noah's ark. God made the event a lesson for mankind so that they would always remember and appreciate the favors of God who had saved them from the threatening disaster. This is in accordance with the word of Allah: Verily when the water rises (up to the mountain), We bring you (the ancestors) into the ship, that We may make it a warning to you and to hear it with the ear that will hear. (al-haqqah \/ 69: 11-12). Then God explained the consequences of those who rejected the Prophet's message with His word that He had provided for those who were tormented with cruelty. This verse contains a warning to the Quraysh that they should not reject the prophecies of Muhammad because they are likely to suffer the same fate as the previous people who had rejected His apostles.",
      "text_tafsir": "Demikian pula Allah telah membinasakan kaum Nuh yang telah mendustakan para rasul. Setelah Nabi Nuh menunaikan risalahnya dengan menyampaikan dakwah kepada kaumnya, tetapi yang beriman kepadanya hanya sedikit sekali, Allah lalu menenggelamkan mereka dengan topan dan banjir besar yang membinasakan semua manusia dan binatang kecuali yang berada dalam kapal Nabi Nuh. Allah menjadikan peristiwa itu sebagai pelajaran bagi umat manusia supaya mereka selalu ingat dan mensyukuri nikmat-nikmat Allah yang telah menyelamatkan mereka dari bencana yang mengancam. Hal ini sesuai dengan firman Allah:\n\nSesungguhnya ketika air naik (sampai ke gunung), Kami membawa (nenek moyang) kamu ke dalam kapal, agar Kami jadikan (peristiwa itu) sebagai peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar. (al-haqqah\/69: 11-12).\n\nLalu Allah menerangkan akibat orang-orang yang mendustakan risalah Nabi dengan firman-Nya bahwa Ia telah menyediakan bagi orang-orang zalim siksa yang pedih. Ayat ini mengandung peringatan pada orang-orang Quraisy supaya mereka jangan sampai mendustakan kenabian Muhammad karena besar kemungkinan mereka pun akan ditimpa azab seperti umat-umat terdahulu yang telah mendustakan para rasul-Nya.",
      "text_translation": "Dan (telah Kami binasakan) kaum Nuh ketika mereka mendustakan para rasul. Kami tenggelamkam mereka dan Kami jadikan (cerita) mereka itu pelajaran bagi manusia. Dan Kami telah sediakan bagi orang-orang zalim azab yang pedih; ",
      "text": "وَقَوْمَ نُوْحٍ لَّمَّا كَذَّبُوا الرُّسُلَ اَغْرَقْنٰهُمْ وَجَعَلْنٰهُمْ لِلنَّاسِ اٰيَةًۗ وَاَعْتَدْنَا لِلظّٰلِمِيْنَ عَذَابًا اَلِيْمًا ۚ ",
      "text_translation_en": "And [think of] the people of Noah: when they gave the lie to [one of] the apostles, We caused them to drown, and made them a symbol for all mankind: for, grievous suffering have We readied for all who [knowingly] do wrong!",
      "juz_number": 19
    },
    "38": {
      "text_tafsir_en": "This verse explains that God destroyed the 'ad, the Hud, with the blowing wind of great power and very cold, destroyed the Samud, the Saleh people, with a loud thunderous voice, and also destroyed the people of the Rass the land of Yamamah that killed the prophet. The same fate has also affected future generations as a result of their rebellion.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah membinasakan kaum 'ad, kaum Nabi Hud, dengan angin yang bertiup dengan kekuatan yang sangat besar dan sangat dingin, membinasakan kaum Samud, kaum Nabi Saleh, dengan suara keras yang menggelegar, dan juga membinasakan penduduk Rass yang ada di negeri Yamamah yang telah membunuh nabi. Nasib yang sama juga telah menimpa generasi-generasi berikutnya akibat pembangkangan mereka.",
      "text_translation": "dan (telah Kami binasakan) kaum ‘Ad dan samud dan penduduk Rass serta banyak (lagi) generasi di antara (kaum-kaum) itu. ",
      "text": "وَعَادًا وَّثَمُوْدَا۟ وَاَصْحٰبَ الرَّسِّ وَقُرُوْنًاۢ بَيْنَ ذٰلِكَ كَثِيْرًا ",
      "text_translation_en": "And [remember how We punished the tribes of] Ad and Thamud and the people of Ar-Rass, and many generations [of sinners] in-between:",
      "juz_number": 19
    },
    "39": {
      "text_tafsir_en": "In this verse, God explains that the story of the ancients was told by the prophets to the Muslims as tamsil or parallels, and explained to them the details of the oneness of God. However, it turned out that they kept denying it and denying it until God destroyed them. Allah then ordered Muhammad to remind the Mecca monks to take lessons from these events. The ruins of the ruined tribes they often went to during their trading journey were the former Lut and Samud regions when they went to Sham, and the former tribal areas (Ahqaf) that they passed on their way to Yemen.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan agar kisah umat dahulu itu diceritakan nabi kepada kaum musyrikin sebagai tamsil atau ibarat, dan menjelaskan kepada mereka dalil-dalil keesaan Allah. Akan tetapi, ternyata mereka terus-menerus mendustakan dan mengingkarinya sehingga Allah membinasakan mereka sampai hancur-lebur. Allah lalu memerintahkan kepada Muhammad agar mengingatkan orang-orang musyrik Mekah agar mengambil pelajaran dari berbagai peristiwa itu. Tempat-tempat kaum yang telah dibinasakan itu selalu mereka lalui ketika dalam perjalanan dagangnya, yaitu bekas-bekas kawasan kaum Lut dan Samud ketika mereka pergi ke Syam, dan bekas kawasan kaum 'ad (Ahqaf) yang mereka lewati ketika pergi menuju Yaman.",
      "text_translation": "Dan masing-masing telah Kami jadikan perumpamaan dan masing-masing telah Kami hancurkan sehancur-hancurnya.  ",
      "text": "وَكُلًّا ضَرَبْنَا لَهُ الْاَمْثَالَۖ وَكُلًّا تَبَّرْنَا تَتْبِيْرًا ",
      "text_translation_en": "and unto each of them did We proffer lessons and each of them did We destroy with utter destruction.",
      "juz_number": 19
    },
    "40": {
      "text_tafsir_en": "Indeed, the Meccanic monks often passed through the land of Sodom which was once riddled with stones and former dwellings of the Lutans known for their homosexual acts. Do they not see the former ruins as a punishment for denying a messenger of God. Then God explained that the main reason they closed their hearts to the causes of the torment was not because they did not see, but because they did not believe in the resurrection on the Day of Resurrection, after they died.",
      "text_tafsir": "Sesungguhnya kaum musyrikin Mekah sering melewati negeri Sodom yang dahulu pernah dihujani dengan batu dan bekas kediaman kaum Nabi Lut yang terkenal dengan perbuatan homoseksual. Apakah mereka tidak menyaksikan bekas reruntuhan itu sebagai azab akibat mendustakan seorang utusan Allah. Kemudian Allah menjelaskan bahwa sebab utama yang menutup mata hati mereka terhadap sebab-sebab turunnya azab itu bukan karena mereka tidak melihat, tetapi karena mereka tidak percaya akan adanya hari kebangkitan pada hari Kiamat, sesudah mereka mati.",
      "text_translation": "Dan sungguh, mereka (kaum musyrik Mekah) telah melalui negeri (Sodom) yang (dulu) dijatuhi hujan yang buruk (hujan batu). Tidakkah mereka menyaksikannya? Bahkan mereka itu sebenarnya tidak mengharapkan hari kebangkitan. ",
      "text": "وَلَقَدْ اَتَوْا عَلَى الْقَرْيَةِ الَّتِيْٓ اُمْطِرَتْ مَطَرَ السَّوْءِۗ اَفَلَمْ يَكُوْنُوْا يَرَوْنَهَاۚ بَلْ كَانُوْا لَا يَرْجُوْنَ نُشُوْرًا ",
      "text_translation_en": "And they [who now deny Our messages] must surely have come across that town which was rained upon by a rain of evil: have they, then, never beheld it [with their minds eye]? But nay, they would not believe in resurrection!",
      "juz_number": 19
    },
    "41": {
      "text_tafsir_en": "In this verse, Allah asserts to the Prophet Muhammad that unbelievers always mocked him by saying, \"Is this the man whom the Messenger of Allah has sent?\" That is the mockery of the unbelievers whenever they see the Prophet Muhammad.",
      "text_tafsir": "Pada ayat ini, Allah menegaskan kepada Nabi Muhammad bahwa orang kafir selalu mengejeknya dengan mengatakan, \"Apakah ini orang yang diutus sebagai rasul?\" Itulah ejekan kaum kafir setiap kali mereka melihat Nabi Muhammad saw.",
      "text_translation": "Dan apabila mereka melihat engkau (Muhammad), mereka hanyalah menjadikan engkau sebagai ejekan (dengan mengatakan), “Inikah orangnya yang diutus Allah sebagai Rasul? ",
      "text": "وَاِذَا رَاَوْكَ اِنْ يَّتَّخِذُوْنَكَ اِلَّا هُزُوًاۗ اَهٰذَا الَّذِيْ بَعَثَ اللّٰهُ رَسُوْلًا ",
      "text_translation_en": "Hence, whenever they consider thee, [O Muhammad,] they but make thee a target of their mockery, [saying:] “Is this the one whom God has sent as an apostle?",
      "juz_number": 19
    },
    "42": {
      "text_tafsir_en": "The sayings of the Muslims that Muhammad almost misled them from his worship, if they were not diligent and impatient in worshiping him, shows that the Prophet Muhammad had uttered his preaching with real arguments. The Prophet (saws) also performed many miracles so that they almost abandoned the religion of their ancestors and entered Islam. Their words also showed great opposition in their hearts, on one side they scoffed at the Prophet, and on the other they feared to be influenced by the very powerful and logical preaching of the Prophet. Furthermore, this verse explains that they will find out who went astray when they saw the torment. According to history, this verse is related to Abu Jahal's doings whenever he met the Prophet. The same was done by the ancient people to the apostles of Allah as it was in the word of God: And indeed, some of the apostles before you (Muhammad) were mocked, so that the punishment of those who scoffed came down in retribution. (al-An'am \/ 6: 10)",
      "text_tafsir": "Ucapan orang-orang musyrik bahwa Muhammad hampir saja menyesatkan mereka dari sembahan-sembahannya, seandainya mereka tidak tekun dan sabar menyembahnya, menunjukkan bahwa Nabi Muhammad telah menyampaikan dakwahnya dengan sungguh-sungguh disertai dengan hujah-hujah yang nyata. Nabi saw juga memperlihatkan berbagai mukjizat sehingga mereka hampir-hampir meninggalkan agama nenek moyangnya dan memasuki agama Islam. Ucapan mereka itu menunjukkan pula adanya pertentangan yang hebat dalam hati sanubari mereka, dari satu sisi mereka mencemoohkan Nabi saw, dan dari sisi lain mereka merasa khawatir akan terpengaruh oleh dakwah Nabi saw yang sangat kuat dan logis itu. \n\nSelanjutnya, ayat ini menerangkan bahwa mereka akan mengetahui tentang siapa yang sesat jalannya pada saat mereka melihat azab. Menurut riwayat, ayat ini terkait dengan ulah yang dilakukan Abu Jahal pada setiap kali ia bertemu dengan Rasulullah. Cara serupa itu dilakukan oleh umat terdahulu kepada para rasul Allah seperti tersebut dalam firman Allah:\n\nDan sungguh, beberapa rasul sebelum engkau (Muhammad) telah diperolok-olokkan, sehingga turunlah azab kepada orang-orang yang mencemoohkan itu sebagai balasan olok-olokan mereka. (al-An'am\/6: 10)",
      "text_translation": "Sungguh, hampir saja dia menyesatkan kita dari sesembahan kita, seandainya kita tidak tetap bertahan (menyembah)nya.” Dan kelak mereka akan mengetahui pada saat mereka melihat azab, siapa yang paling sesat jalannya.",
      "text": "اِنْ كَادَ لَيُضِلُّنَا عَنْ اٰلِهَتِنَا لَوْلَآ اَنْ صَبَرْنَا عَلَيْهَاۗ وَسَوْفَ يَعْلَمُوْنَ حِيْنَ يَرَوْنَ الْعَذَابَ مَنْ اَضَلُّ سَبِيْلًا ",
      "text_translation_en": "Indeed, he would well-nigh have led us astray from our deities, had we not been [so] steadfastly attached to them!” But in time, when they see the suffering [that awaits them], they will come to know who it was that went farthest astray from the path [of truth]!",
      "juz_number": 19
    },
    "43": {
      "text_tafsir_en": "Ibn 'Abbas ra said, \"The people of ignorance worshiped white stone for some time. However, if they saw another good worship, they would abandon the white stone and choose the second one according to the size of their desires. So come down to this verse. \" In this verse, God condemns the disbelievers of Mecca who defy their passions and make them the basis for all their religious affairs. They do not listen to the real arguments, and the explanations are clear. God advised Muhammad not to think too much about their attitude, because he was not assigned to awaken them to faith forever, especially if they did not want to break free from the shackles of their passions and follow the instructions to the truth. Allah says that Muhammad is not their protector or guardian. It is the duty of the Prophet (saws) to deliver only the leaflets. This is according to the word of God: You are not a ruler over them. (al-Gasyiyah \/ 88: 22)",
      "text_tafsir": "Ibnu 'Abbas r.a. berkata, \"Orang-orang pada zaman Jahiliah pernah menyembah batu yang putih selama beberapa masa. Akan tetapi, jika melihat sembahan lain yang lebih baik, maka ia meninggalkan batu putih itu dan memilih sembahan kedua yang lebih baik menurut ukuran hawa nafsunya. Sehubungan dengan itu turunlah ayat ini.\"\n\nPada ayat ini, Allah mencela orang-orang kafir Mekah yang mempertuhankan hawa nafsunya sehingga dijadikan landasan untuk semua urusan agamanya. Mereka tidak mendengarkan hujah yang nyata, dan penjelasan-penjelasan yang terang. Allah menasihatkan supaya Muhammad tidak terlalu memikirkan sikap mereka, karena beliau tidak ditugaskan untuk menyadarkan mereka agar beriman selamanya, apalagi jika mereka tidak mau melepaskan diri dari belenggu hawa nafsunya dan mengikuti petunjuk kepada kebenaran. Allah mengatakan bahwa Muhammad tidak menjadi pemelihara dan penjamin bagi mereka. Kewajiban Nabi saw hanya menyampaikan risalah saja. Hal ini sesuai dengan firman Allah:\n\nEngkau bukanlah orang yang berkuasa atas mereka. (al-Gasyiyah\/88: 22)",
      "text_translation": "Sudahkah engkau (Muhammad) melihat orang yang menjadikan keinginannya sebagai tuhannya. Apakah engkau akan menjadi pelindungnya? ",
      "text": "اَرَءَيْتَ مَنِ اتَّخَذَ اِلٰهَهٗ هَوٰىهُۗ اَفَاَنْتَ تَكُوْنُ عَلَيْهِ وَكِيْلًا ۙ",
      "text_translation_en": "Hast thou ever considered [the kind of man] who makes his own desires his deity? Couldst thou, then, [O Prophet,] be held responsible for him?",
      "juz_number": 19
    },
    "44": {
      "text_tafsir_en": "In this verse, Allah advised the Prophet Muhammad not to assume that most Muslims listen to the verse and understand the truth contained in the verse so that they can practice his guidance to do good deeds and improve morals. God reminds us that because they are like animals, they are even more lost. Compared to livestock, the animal is subject to its owner, who loves it, knows who does what is right and who does evil to it, can find for himself a place where his grass and his water, once with the Muslims themselves. They do not want to know the Creator and the Provider, they do not feel the benefits God has bestowed upon them. The heathen do not feel tricked by the devil, who always looks down on his lustful desires. The foolishness of livestock is confined to itself, but their ignorance can lead to slander and destruction and to hinder others from the path of truth, and to cause divisions and wars among men. Although the beast did not know of the martyrdom and the prophecies, they did not oppose it, unlike the pagans who rejected the martyrdom because of their arrogance and ignorance of the false teachings inherited from their ancestors. The animals do not waste the instinct that God has given them. Unlike the monks, they were endowed with good thoughts and instincts from birth, but they wereted the good sense to distinguish what was good and what was not. In the verse it is stated that most of them do not hear or understand the truth. It is true that a small number of them admit the truth, but are unable to follow it because they fear losing their position.",
      "text_tafsir": "Pada ayat ini, Allah menasihati Nabi Muhammad supaya jangan menganggap bahwa kebanyakan orang-orang musyrik mendengarkan ayat dan memahami kebenaran yang terkandung dalam ayat itu sehingga mereka dapat mengamalkan petunjuknya untuk melakukan amal saleh dan memperbaiki akhlak. Allah mengingatkan yang demikian karena mereka itu seperti hewan ternak, bahkan mereka lebih sesat. Jika dibandingkan dengan hewan ternak, maka binatang tunduk kepada majikannya, yang dirasakan mencintainya, tahu siapa yang berbuat kebaikan dan yang berbuat kejahatan kepadanya, dapat mencari sendiri tempat di mana ada rumput makanannya dan air minumannya, dan jika malam hari tahu kembali ke kandangnya, berbeda sekali dengan kaum musyrikin itu sendiri. Mereka tidak mau mengenal Pencipta dan Pemberi rezeki, mereka tidak merasakan berbagai nikmat yang dilimpahkan Tuhan kepadanya. \n\nOrang-orang musyrik tidak merasa tertipu oleh setan, yang selalu memandang baik bujukan hawa nafsunya. Kebodohan binatang ternak terbatas hanya pada dirinya sendiri, tetapi kebodohan mereka menjalar sampai menimbulkan berbagai fitnah dan kebinasaan serta menghalangi orang lain dari jalan kebenaran, sampai menimbulkan perpecahan dan peperangan di antara sesama manusia. Walaupun binatang itu tidak mengetahui ketauhidan dan kenabian, namun mereka tidak menentangnya, berbeda dengan orang-orang musyrik yang mengingkari ketauhidan karena kesombongan dan kefanatikan terhadap ajaran keliru yang diwarisi dari nenek moyangnya. Binatang ternak tidak menyia-nyiakan insting yang dikaruniakan Allah kepadanya. Lain halnya dengan kaum musyrikin, mereka dianugerahi akal dan naluri yang baik sejak lahir, tetapi mereka menyia-nyiakan akal yang sehat itu untuk membedakan mana yang baik dan mana yang tidak.\n\nDi dalam ayat disebutkan bahwa sebagian besar mereka tidak mendengar atau memahami kebenaran. Memang ada sebagian kecil di antara mereka yang mengakui kebenaran, tetapi tidak sanggup mengikutinya karena khawatir akan kehilangan kedudukan.",
      "text_translation": "Atau apakah engkau mengira bahwa kebanyakan mereka itu mendengar atau memahami? Mereka itu hanyalah seperti hewan ternak, bahkan lebih sesat jalannya.",
      "text": "اَمْ تَحْسَبُ اَنَّ اَكْثَرَهُمْ يَسْمَعُوْنَ اَوْ يَعْقِلُوْنَۗ اِنْ هُمْ اِلَّا كَالْاَنْعَامِ  بَلْ هُمْ اَضَلُّ سَبِيْلًا ࣖ",
      "text_translation_en": "Or dost thou think that most of them listen [to thy message] and use their reason? Nay, they are but like cattle - nay, they are even less conscious of the right way!",
      "juz_number": 19
    },
    "45": {
      "text_tafsir_en": "In this verse, God commands His apostles to pay attention to His creation, how He lengthens and shortens the shadows of each object exposed to the sun, from the rising to the setting. God deliberately makes the heat from the hot sun. If He wills, He will make the shadows remain, not move. God made the shadows lengthen or shorten for human use as a measure of time, as in Egypt using a device called al-Misallat to measure time during the day and determine the seasons for a year. Since time immemorial, the Arabs have also used a tool called al-Mazawil to determine prayer times in the shadows. They can ascertain the arrival of Zuhur time when the shadow of the needle has moved from west to east, and the time of Asar comes when the shadow of every object that stands has reached it. Only Imam Abu Hanifa believes that the shadow must be twice the length of the object itself. So it is clear that according to this verse, God made the shadows from the sun as a guide for time.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan rasul-Nya supaya memperhatikan ciptaan-Nya, bagaimana Dia memanjangkan dan memendekkan bayang-bayang dari tiap-tiap benda yang terkena sinar matahari, dari mulai terbit sampai terbenam. Allah sengaja menjadikan panas dari terik cahaya matahari. Kalau Dia menghendaki niscaya Dia menjadikan bayang-bayang itu tetap, tidak berpindah-pindah. Allah menjadikan bayang-bayang itu memanjang atau memendek untuk dipergunakan manusia sebagai pengukur waktu, seperti di Mesir mempergunakan alat yang diberi nama al-Misallat untuk mengukur waktu pada siang hari dan menentukan musim-musim selama setahun. Sejak dahulu kala, bangsa Arab pun telah mempergunakan alat yang diberi nama al-Mazawil untuk menentukan waktu salat dengan bayang-bayang. Mereka dapat memastikan tibanya waktu Zuhur bila bayangan jarumnya sudah berpindah dari arah barat ke timur, dan tiba waktu Asar bila bayangan setiap benda yang berdiri sudah menyamainya. Hanya Imam Abu Hanifah yang berpendapat bahwa bayangan itu harus dua kali dari panjang benda itu sendiri. Jadi jelas bahwa menurut ayat ini, Allah menjadikan bayang-bayang dari sinar matahari sebagai petunjuk waktu.",
      "text_translation": "Tidakkah engkau memperhatikan (penciptaan) Tuhanmu, bagaimana Dia memanjangkan (dan memendekkan) bayang-bayang; dan sekiranya Dia menghendaki, niscaya Dia jadikannya (bayang-bayang itu) tetap, kemudian Kami jadikan matahari sebagai petunjuk, ",
      "text": "اَلَمْ تَرَ اِلٰى رَبِّكَ كَيْفَ مَدَّ الظِّلَّۚ وَلَوْ شَاۤءَ لَجَعَلَهٗ سَاكِنًاۚ  ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيْلًا ۙ",
      "text_translation_en": "Art thou not aware of thy Sustainer [through His works]? - how He causes the shadow to lengthen [towards the night] when, had He so willed, He could indeed have made it stand still: but then, We have made the sun its guide;",
      "juz_number": 19
    },
    "46": {
      "text_tafsir_en": "Then Allah removes the shadows slowly in line with the process of setting the sun little by little. According to scientists, this verse speaks of the precise order of the universe. This verse describes the function of the motion and \"long\" shadows that move from morning, afternoon, and evening. Extending the shadow of an object in physics is the event of the shrinking angle of light coming and the shortening of the shadow length due to the greater angle of light coming. This event we often encounter in our daily lives. In the morning, the shadows of objects exposed to sunlight falling to the earth will look long. The more daytime and until the position of the sun at the culmination point, the shadow will appear shorter and shorter. Conversely, when the sun begins to shift westward until late afternoon, the shadows will look back to being long. This happens because the angle of incidence of sunlight becomes smaller again. What happens when the long shadows are fixed or unchanged? This is an extraordinary event. It can simply be interpreted that the position of the sun and the earth in a state remains unchanged, then the sun will illuminate the earth continuously. This means that the surface of the earth (which is bright) will undergo a heating process. Surface temperature will continue to increase during the irradiation. Sea water will be bubbling and boiling. If this continues for a long time the earth will catch fire and be destroyed by rising temperatures. While the surface of the earth that is not facing the sun, will experience the reverse process, which is experiencing extraordinary cooling. It may be that the surface of the sea will freeze, and life will die. Extreme temperatures in both hemispheres may lead to the extinction of life. Doomsday? Allah knows best. Allah is the Almighty for all His creations. Long and short events or to the west and east of the shadows above to the position of the sun can be an indication of time for humans who are on earth. The disappearance of the shadows occurs slowly is a simple picture as the events of the events of the sunset slowly. The second thing that can be obtained is that the above verse already indicates there will be an earth's rotation on its axis. The paragraph below can also be used for this indication. And the sun goes by its place. Such is the decree of the Almighty, All-knowing. And We have appointed the place for circulation for the moon, so that (after it reaches the last circulation) it returns like an old bunch. It is not possible for the sun to catch up with the moon and night can not precede the day. Each circulates on the path. (Yasin \/ 36: 38-40). The above verse can also be used to show the existence of order in the universe. The last sentence of the verse clearly states it. The same thing can also be found in Surah al-Anbiya '\/ 21: 33, az-Zumar \/ 39: 5, and ar-Rahman \/ 55: 1-5. In Surah Yasin \/ 36: 38-40 above it is stated that the sun circulates on its track. Modern astronomy proves the truth of this Qur'anic statement. As is known, the sun is located on the outer side of the Milky Way galaxy disk. This galaxy is disk-shaped, which has a radius of about 10 kiloparsecs. If calculated in the mile dimension, is equal to 2 with 17 zeros. Astronomical research shows that the Milky Way galaxy is rotating on its axis (revolution), and one revolution takes 250 million years. Because the sun is in the outer disk of this galaxy, the sun also circulates in accordance with the path of the outer edge of the galaxy disk. The word yasbahun found in Surah Yasin \/ 36: 40, is more correct when translated with swimming, rather than circulating. Because, in modern astronomy, this space is not empty at all, but contains and is filled with subatomic particles known as neutrinos. So all the celestial bodies in the universe are actually 'swimming in neutrinos. Regarding earth's rotation, data shows that the earth rotates on its axis at a speed of 1,670 km per hour. This speed approaches the speed of the bullet released from modern weapons, which is 1,800 km per hour. Then you can imagine, how fast the rotation of the earth. The one who rotates this fast is not a small and light object like a bullet, but an object with a very large size and mass. The speed of the Earth's orbit towards the sun is about 60 times the speed of a bullet, which is about 108,000 km per hour. With this speed, an aircraft will be able to circle the earth in 22 minutes. The accuracy of the rotation which results in day and night on this earth, is confirmed by the paragraph below. It is not possible for the sun to catch up with the moon and night can not precede the day. Each circulates on the path. (Yasin \/ 36: 40)",
      "text_tafsir": "Kemudian Allah menghapus bayang-bayang itu dengan perlahan-lahan sejalan dengan proses terbenam matahari sedikit demi sedikit. Menurut para ilmuwan, ayat ini berbicara mengenai presisi keteraturan alam semesta. Ayat ini menerangkan fungsi gerakan dan \"panjang\" bayang-bayang yang bergerak dari pagi, siang, dan sore hari. Memanjangkan bayangan suatu benda dalam ilmu fisika adalah peristiwa mengecilnya sudut datang cahaya dan memendeknya panjang bayangan dikarenakan semakin besarnya sudut datang cahaya. Peristiwa ini sering kita temui dalam kehidupan kita sehari-hari. Pada pagi hari, bayang-bayang benda akibat terkena sinar matahari yang jatuh ke bumi akan tampak panjang. Semakin siang hari dan sampai posisi matahari pada titik kulminasi, bayangan akan tampak semakin memendek. Sebaliknya ketika matahari mulai bergeser ke arah barat sampai menjelang sore hari, akan terlihat bayang-bayang pun kembali menjadi panjang. Hal ini terjadi dikarenakan sudut datang sinar matahari menjadi semakin kecil kembali.\n\nApa yang terjadi manakala bayang-bayang panjangnya tetap atau tidak berubah? Ini peristiwa luar biasa. Secara sederhana dapat diartikan bahwa posisi matahari dan bumi dalam keadaan tetap tidak berubah, maka matahari akan menyinari bumi secara terus menerus. Artinya permukaan bumi (yang terang) akan mengalami proses pemanasan. Suhu permukaan akan terus meningkat selama penyinaran berlangsung. Air laut akan menggelegak dan mendidih. Apabila hal ini terus berlangsung dalam tempo yang lama maka bumi akan terbakar dan hancur akibat suhu yang meningkat. Sedangkan permukaan bumi yang tidak menghadap matahari, akan mengalami proses sebaliknya, yaitu mengalami pendinginan yang luar biasa. Boleh jadi permukaan laut akan beku, dan kehidupan akan mati. Keadaan ekstrem suhu di kedua belahan bumi ini mungkin dapat menjurus ke arah punahnya kehidupan. Kiamatkah? Wallahu a'lam. Allah Mahakuasa atas segala ciptaan-Nya.\n\nPeristiwa panjang dan pendek atau arah barat dan arah timur bayang-bayang tadi terhadap posisi matahari dapat menjadi petunjuk waktu bagi manusia yang berada di bumi. Lenyapnya bayang-bayang terjadi secara perlahan merupakan gambaran sederhana sebagaimana peristiwa kejadian matahari terbenam secara perlahan. \n\nHal kedua yang dapat diperoleh adalah bahwa ayat di atas sudah mengindikasikan akan adanya perputaran bumi pada sumbunya. Ayat di bawah ini juga dapat digunakan untuk indikasi tersebut.\n\nDan matahari berjalan di tempat peredarannya. Demikianlah ketetapan (Allah) Yang Mahaperkasa, Maha Mengetahui. Dan telah Kami tetapkan tempat peredaran bagi bulan, sehingga (setelah ia sampai ke tempat peredaran yang terakhir) kembalilah ia seperti bentuk tandan yang tua. Tidaklah mungkin bagi matahari mengejar bulan dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya. (Yasin\/36: 38-40).\n\nAyat di atas dapat juga digunakan untuk memperlihatkan adanya keteraturan di alam semesta. Kalimat terakhir dari ayat tersebut secara jelas menyatakannya. Hal serupa dapat pula ditemui pada Surah al-Anbiya'\/21: 33, az-Zumar\/39: 5, dan ar-Rahman\/55: 1-5.\n\nDalam Surah Yasin\/36: 38-40 di atas disebutkan bahwa matahari beredar pada garis lintasannya. Astronomi modern membuktikan kebenaran pernyataan Al-Qur'an ini. Seperti diketahui, matahari terletak di sisi terluar dari piringan galaksi Bima Sakti. Galaksi ini berbentuk piringan, yang mempunyai jari-jari sekitar 10 kiloparsecs. Jika dihitung dalam dimensi mil, sama dengan 2 dengan 17 angka nol. Penelitian astronomi menunjukkan bahwa galaksi Bima Sakti ini melakukan perputaran pada sumbunya (revolusi), dan satu revolusi membutuhkan waktu selama 250 juta tahun. Karena matahari berada pada piringan terluar galaksi ini, maka matahari turut pula beredar sesuai dengan garis edar sisi terluar dari piringan galaksi tersebut.\n\nKata yasbahun yang terdapat pada Surah Yasin\/36: 40, lebih tepat bila diterjemahkan dengan berenang, dibanding beredar. Sebab, dalam astronomi modern, antariksa ini tidaklah kosong sama sekali, tetapi berisi dan dipenuhi oleh partikel-partikel sub-atomik yang dikenal dengan neutrino. Jadi semua benda langit di jagad-raya ini sesungguhnya 'berenang pada gelombang neutrino.\n\nMengenai rotasi bumi, data memperlihatkan bahwa bumi berputar pada sumbunya dengan kecepatan 1.670 km per jam. Kecepatan ini mendekati kecepatan peluru yang dilepaskan dari senjata modern, yaitu 1.800 km per jam. Maka dapat dibayangkan, betapa cepatnya rotasi bumi. Yang melakukan rotasi secepat ini bukan benda berukuran kecil dan ringan seperti peluru, tetapi suatu benda dengan ukuran dan massa yang sangat besar. Kecepatan orbit bumi terhadap matahari adalah sekitar 60 kali kecepatan peluru, yaitu sekitar 108.000 km per jam. Dengan kecepatan demikian, sebuah pesawat akan dapat mengelilingi bumi dalam waktu 22 menit. \n\nKetepatan rotasi yang mengakibatkan terjadinya siang dan malam di bumi ini, dikonfirmasi oleh ayat di bawah ini.\n\nTidaklah mungkin bagi matahari mengejar bulan dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya. (Yasin\/36: 40)",
      "text_translation": "kemudian Kami menariknya (bayang-bayang itu) kepada Kami sedikit demi sedikit. ",
      "text": "ثُمَّ قَبَضْنٰهُ اِلَيْنَا قَبْضًا يَّسِيْرًا ",
      "text_translation_en": "and then, [after having caused it to lengthen,] We draw it in towards Our­selves with a gradual drawing-in.",
      "juz_number": 19
    },
    "47": {
      "text_tafsir_en": "Allah then mentions His second authority, which is to make that night beneficial to humans as the benefits of clothing that covers the body. God also makes sleep so good for humans that it is like dying, because a person at sleep is completely unconscious, and his limbs stop working except the heart and several other organs. Thus, he can rest perfectly as in the word of God: And it is He who puts you to sleep at night. (al-An'am \/ 6: 60). Allah holds the life (of a person) at the time of his death and the life of (of a person) who hasn't died when he sleeps. (az-Zumar \/ 39: 42) Allah made the day to try and move. As sleep at night is likened to death, then waking up during the day is likened to waking up again from the dead. Likewise humans after the end of their lives in this world and die, will be resurrected after their death, to be judged by God all they have done while living in the world.",
      "text_tafsir": "Allah lalu menyebutkan kekuasaan-Nya yang kedua yaitu menjadikan malam itu bermanfaat bagi manusia seperti manfaatnya pakaian yang menutup badan. Allah juga menjadikan tidur nyenyak bagi manusia sehingga ia seperti mati, karena seseorang pada waktu tidur tidak sadar sama sekali, dan anggota badannya berhenti bekerja kecuali jantung dan beberapa organ lainnya. Dengan demikian, dia dapat beristirahat dengan sempurna seperti dalam firman Allah:\n\nDan Dialah yang menidurkan kamu pada malam hari. (al-An'am\/6: 60).\n\nAllah memegang nyawa (seseorang) pada saat kematiannya dan nyawa (seseorang) yang belum mati ketika dia tidur. (az-Zumar\/39: 42)\n\nAllah menjadikan siang untuk berusaha dan beraktivitas. Sebagaimana tidur pada malam hari yang diserupakan dengan mati, maka bangun pada siang hari diserupakan dengan bangun lagi dari mati. Demikian pula manusia setelah berakhir masa hidupnya di dunia ini dan mati, akan dibangkitkan kembali setelah matinya, untuk diadili oleh Allah segala yang telah mereka kerjakan selama hidup di dunia.",
      "text_translation": "Dan Dialah yang menjadikan malam untukmu (sebagai) pakaian, dan tidur untuk istirahat, dan Dia menjadikan siang untuk bangkit berusaha. ",
      "text": "وَهُوَ الَّذِيْ جَعَلَ لَكُمُ الَّيْلَ لِبَاسًا وَّالنَّوْمَ سُبَاتًا وَّجَعَلَ النَّهَارَ نُشُوْرًا  ",
      "text_translation_en": "And He it is who makes the night a garment for you, and [your] sleep a rest, and causes every [new] day to be a resurrection.",
      "juz_number": 19
    },
    "48": {
      "text_tafsir_en": "The power of the third God is He who blows the wind as a bearer of glad tidings especially to the peasants that the rain which is His mercy is coming soon. He is the one who pours clear rain water to clean the body and clothing, especially for drinking and other necessities.",
      "text_tafsir": "Kekuasaan Allah yang ketiga ialah Dia yang meniupkan angin sebagai pembawa kabar gembira terutama bagi para petani bahwa hujan yang merupakan rahmat-Nya akan segera turun. Dia pula yang menurunkan air hujan yang amat jernih untuk membersihkan badan dan pakaian, terutama untuk minum dan keperluan lainnya.",
      "text_translation": "Dan Dialah yang meniupkan angin (sebagai) pembawa kabar gembira sebelum kedatangan rahmat-Nya (hujan); dan Kami turunkan dari langit air yang sangat bersih, ",
      "text": "وَهُوَ الَّذِيْٓ اَرْسَلَ الرِّيٰحَ بُشْرًاۢ بَيْنَ يَدَيْ رَحْمَتِهٖۚ وَاَنْزَلْنَا مِنَ السَّمَاۤءِ مَاۤءً طَهُوْرًا ۙ",
      "text_translation_en": "And He it is who sends forth the winds as a glad tiding of His coming grace; and [thus, too,] We cause pure water to descend from the skies,",
      "juz_number": 19
    },
    "49": {
      "text_tafsir_en": "In this verse, Allah explains that the rain was sent down to fertilize dead and barren lands or lands. Also with rain water, Allah gives drink to most of His creatures, such as cattle and humans. In another verse explained: And you see the earth is dry, then when We have sent water (rain) on it, live the earth and become fertile and grow various kinds of beautiful pairs (plants). (al-hajj \/ 22: 5) And His word: So pay attention to the traces of God's grace, how Allah revived the earth after death (dry). Really, that means He must (have the power) to resurrect the dead. (ar-Rum \/ 30: 50) According to scientists, from the above paragraph two things can be discussed, namely: 1. Regarding the occurrence of rain 2. Regarding indications that rain water brings life, so that it can \".... bring to life with a country that dead ... \"Regarding the occurrence of rain, the story begins with water flowing along a tributary that will join with other tributaries forming a much larger river, which eventually flows into the sea. While water flows through tributaries and rivers, some will evaporate due to the heat of the sun (turning into gas) but most will continue to flow to the sea. In this sea the next process of evaporation or evaporation takes place. All evaporated water, whether coming from a tributary, river or sea, forms water vapor in the atmosphere. This vapor rises and will become cold when it reaches a higher atmosphere. If there is a lot of gas in the atmosphere, this water vapor will solidify into a group of gases called clouds. If the clouds are blown by the wind so they gather together, and go up so that they reach a higher level in the atmosphere, then the water vapor will turn into drops of ice. When clouds become colder due to lower atmospheric temperatures, water becomes dense (ice) and falls, initially like tiny drops of ice, which usually melt before reaching the ground. Thus, drops of water will fall to the earth as rain. (See also ar-Ra'd \/ 13: 17; an-Naml \/ 27: 60; al-'Ankabut \/ 29: 63; Luqman \/ 31: 34; as-Sajdah \/ 32: 27; Fathir \/ 35: 27; az-Zumar \/ 39: 21; Qaf \/ 50: 9-11).",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa hujan diturunkan untuk menyuburkan negeri-negeri atau tanah yang mati dan tandus. Dengan air hujan pula, Allah memberi minum sebagian besar makhluk-Nya, seperti binatang ternak dan manusia. Dalam ayat lain diterangkan:\n\nDan kamu lihat bumi ini kering, kemudian apabila telah Kami turunkan air (hujan) di atasnya, hiduplah bumi itu dan menjadi subur dan menumbuhkan berbagai jenis pasangan (tetumbuhan) yang indah. (al-hajj\/22: 5)\n\nDan firman-Nya:\n\nMaka perhatikanlah bekas-bekas rahmat Allah, bagaimana Allah menghidupkan bumi setelah mati (kering). Sungguh, itu berarti Dia pasti (berkuasa) menghidupkan yang telah mati. (ar-Rum\/30: 50)\n\nMenurut para ilmuwan, dari ayat di atas dapat dibahas dua hal, yaitu:\n\n1.Mengenai terjadinya hujan\n\n2.Mengenai indikasi bahwa air hujan membawa kehidupan, sehingga dapat \".... menghidupkan dengannya negeri yang mati...\"\n\nMengenai terjadinya hujan, kisahnya dimulai dengan air yang mengalir di sepanjang anak sungai yang akan bergabung dengan anak sungai lainnya membentuk sungai yang jauh lebih besar, yang akhirnya mengalir ke laut. Sementara air mengalir melalui anak sungai dan sungai, sebagian akan menguap karena panas sinar matahari (berubah menjadi gas) tetapi sebagian besar terus mengalir sampai ke laut. Di laut inilah proses penguapan atau evaporasi selanjutnya berlangsung. \n\nSemua air yang menguap, baik yang berasal dari anak sungai, sungai, atau laut, membentuk uap air di atmosfer. Uap ini naik dan akan menjadi dingin saat mencapai atmosfer yang lebih tinggi. Jika terdapat banyak gas di atmosfer maka uap air ini akan memadat menjadi kelompok gas yang disebut awan. Jika awan tersebut ditiup angin sehingga berkumpul sesamanya, dan naik ke atas sehingga mencapai bagian yang lebih tinggi lagi di lapisan atmosfer, maka uap air akan berubah menjadi tetes-tetes es. \n\nKetika awan menjadi lebih dingin karena suhu atmosfer yang lebih rendah, air menjadi padat (es) dan jatuh, awalnya seperti tetes-tetes es yang sangat kecil, yang biasanya mencair sebelum mencapai tanah. Dengan demikian, tetes air akan jatuh ke bumi sebagai hujan. (lihat juga ar-Ra'd\/13: 17; an-Naml\/27: 60; al-'Ankabut\/29: 63; Luqman\/31: 34; as-Sajdah\/32: 27; Fathir\/35: 27; az-Zumar\/39: 21; Qaf\/50: 9-11).",
      "text_translation": "agar (dengan air itu) Kami menghidupkan negeri yang mati (tandus), dan Kami memberi minum kepada sebagian apa yang telah Kami ciptakan, (berupa) hewan-hewan ternak dan manusia yang banyak. ",
      "text": "لِّنُحْيِ َۧ بِهٖ بَلْدَةً مَّيْتًا وَّنُسْقِيَهٗ مِمَّا خَلَقْنَآ اَنْعَامًا وَّاَنَاسِيَّ كَثِيْرًا ",
      "text_translation_en": "so that We may bring dead land to life thereby, and give to drink thereof to many [beings] of Our creation, beasts as well as humans.",
      "juz_number": 19
    },
    "50": {
      "text_tafsir_en": "This verse explains that God has indeed decreed rain for the human race. Sometimes it was day or night, sometimes aimed at watering the land of a people who had just practiced the Istisqa prayers, sometimes turned away from the people who had done a great deal of rebellion and rebellion. All of this is for humans to learn from it, and for them to understand that it is God who controls the rain cycle as it regulates the circulation of stars and planets in outer space. The rain is not just the downfall that is regulated by rotation, but also its shape and condition. Sometimes the water is frozen if the air temperature is below zero and is ice. Then if heated it turned to liquid, and if heated it turned to steam. Water is an element that is present in all living things, in plants, animals, and people, as God says: And We have created everything that comes from water. (al-Anbiya '\/ 21: 30) All of this must be a thought for man to be grateful for the favor of God. However, most people are reluctant to even ignore those favors.",
      "text_tafsir": "Ayat ini menjelaskan bahwa sesungguhnya Allah telah mengatur turunnya hujan secara bergiliran bagi manusia. Kadang-kadang ia turun siang atau malam, kadang-kadang ditujukan untuk menyirami tanah satu kaum yang baru melaksanakan salat Istisqa, kadang-kadang dipalingkan dari kaum yang banyak melakukan kedurhakaan dan kemaksiatan. Semua itu bertujuan agar manusia mengambil pelajaran darinya, dan agar mereka mengerti bahwa Tuhanlah yang mengatur giliran hujan itu seperti mengatur peredaran bintang-bintang dan planet di angkasa luar. \n\nAir hujan itu bukan hanya turunnya saja yang diatur dengan bergiliran, akan tetapi bentuk dan keadaannya juga. Kadang-kadang air itu membeku jika suhu udara jauh di bawah nol dan merupakan es batu. Kemudian jika dipanaskan berubah menjadi cair, dan jika dipanaskan berubah menjadi uap. Air merupakan unsur yang terdapat dalam semua makhluk hidup, dalam tumbuh-tumbuhan, binatang, dan manusia, seperti dalam firman Allah:\n\nDan Kami jadikan segala sesuatu yang hidup berasal dari air. (al-Anbiya'\/21: 30)\n\nSemua ini harus jadi bahan pemikiran bagi manusia agar dapat mensyukuri nikmat Allah. Akan tetapi, kebanyakan manusia enggan bahkan mengingkari nikmat-nikmat itu.",
      "text_translation": "Dan sungguh, Kami telah mempergilirkan (hujan) itu di antara mereka agar mereka mengambil pelajaran; tetapi kebanyakan manusia tidak mau (bersyukur), bahkan mereka mengingkari (nikmat).",
      "text": "وَلَقَدْ صَرَّفْنٰهُ بَيْنَهُمْ لِيَذَّكَّرُوْاۖ فَاَبٰىٓ اَكْثَرُ النَّاسِ اِلَّا كُفُوْرًا ",
      "text_translation_en": "And, indeed, many times have We repeated [all] this unto men, so that they might take it to heart: but most men refuse to be aught but ingrate.",
      "juz_number": 19
    },
    "51": {
      "text_tafsir_en": "This verse explains that if God wills, He will send a messenger to every nation, who will warn. However, Allah sent Muhammad as a prophet to all mankind, as Allah said: Say, \"O mankind! Verily I am the Messenger of Allah to you all.\" (al-A'raf \/ 7: 158) And We have not sent thee (Muhammad), but to all mankind as a bearer of glad tidings and a warner. (Saba '\/ 34: 28) If other prophets were sent to certain people, then Allah sent Prophet Muhammad as a messenger to all mankind as a bearer of glad tidings and warnings. Therefore, the miracle given to the Prophet Muhammad was no longer a temporal one, only suited to a particular race and place. However, it is given the Qur'an which is universal, the values it contains to be applied anywhere and anytime.",
      "text_tafsir": "Ayat ini menjelaskan bahwa seandainya Allah menghendaki, Dia akan mengutus seorang utusan untuk setiap negeri, yang akan memberi peringatan. Akan tetapi, Allah mengirimkan Muhammad sebagai nabi penutup kepada seluruh umat manusia, sebagaimana firman Allah:\n\nKatakanlah (Muhammad), \"Wahai manusia! Sesungguhnya aku ini utusan Allah bagi kamu semua.\" (al-A'raf\/7: 158)\n\nDan Kami tidak mengutus engkau (Muhammad), melainkan kepada semua umat manusia sebagai pembawa berita gembira dan sebagai pemberi peringatan. (Saba'\/34: 28)\n\nJika para nabi lain diutus kepada umat-umat tertentu, maka Allah mengutus Nabi Muhammad sebagai rasul kepada seluruh umat manusia sebagai pembawa berita gembira dan memberi peringatan. Oleh karena itu, mukjizat yang diberikan kepada Nabi Muhammad tidak lagi bersifat temporal, yang hanya sesuai untuk suatu kaum dan tempat tertentu. Akan tetapi, ia diberi Al-Qur'an yang bersifat universal, nilai-nilai yang dikandungnya sesuai untuk diterapkan di mana pun dan kapan pun.",
      "text_translation": "Dan sekiranya Kami menghendaki, niscaya Kami utus seorang pemberi peringatan pada setiap negeri. ",
      "text": "وَلَوْ شِئْنَا لَبَعَثْنَا فِيْ كُلِّ قَرْيَةٍ نَّذِيْرًا ۖ",
      "text_translation_en": "Now had We so willed. We could have [con­tinued as before and] raised up a [separate] warner in every single community:",
      "juz_number": 19
    },
    "52": {
      "text_tafsir_en": "The Prophet Muhammad was commanded by God to deliver his brochure vigorously, to perform jihad and struggle with wisdom, patience, perseverance, and not fear or fear of the enemy. The Prophet (saws) had to be sure that Allah would surely help, so that victory was in his hands and the believers. In this verse, Allah forbids Prophet Muhammad to follow the unbelievers who ask him to compromise with them in religion. He should remain firm and consistent in carrying out his preaching and jihad spreading the Qur'an. Literally, jihad is to strive earnestly, if necessary at the expense of anything, property or soul. Jihad can be carried out in a state of war or peace. In the course of war, jihad was carried out with qital, that is to fight in the way of God. While jihad in peace can be practiced in economics, education, culture, etc. This verse 52 belongs to the Makkiyyah verse group, revealed before emigration in peace. The jihad here is emphasized on the seriousness of carrying out propaganda, education, and social efforts to improve society. God promises those who fight jihad will always be guided in the right direction. Allah says: And to those who fight for us, We will show them our ways. And indeed, Allah is with those who do good. (al-'Ankabut \/ 29: 69)",
      "text_tafsir": "Nabi Muhammad diperintahkan Allah untuk menyampaikan risalahnya dengan sungguh-sungguh, melaksanakan jihad dan perjuangan dengan penuh kebijaksanaan, kesabaran, ketabahan, dan tidak takut atau gentar terhadap musuh. Nabi saw harus yakin bahwa Allah pasti menolong, sehingga kemenangan berada di tangannya dan kaum Mukminin. Dalam ayat ini, Allah melarang Nabi Muhammad mengikuti orang-orang kafir yang mengajaknya mengadakan kompromi dengan mereka dalam hal agama. Ia harus tetap bersikap tegas dan konsekuen dalam melaksanakan dakwah dan berjihad menyebarkan Al-Qur'an. \n\nSecara bahasa, jihad ialah berusaha sungguh-sungguh, jika perlu dengan mengorbankan apa saja, harta ataupun jiwa. Jihad dapat dilaksanakan dalam keadaan perang maupun damai. Dalam keadaan perang, jihad dilaksanakan dengan qital, yaitu berperang di jalan Allah. Sedangkan jihad dalam keadaan damai dapat dilaksanakan di bidang ekonomi, pendidikan, budaya, dan lain-lain.\n\nAyat 52 ini termasuk dalam kelompok ayat Makkiyyah, diturunkan sebelum hijrah dalam keadaan damai. Maka jihad di sini lebih ditekankan pada kesungguhan melaksanakan dakwah, pendidikan, maupun usaha-usaha sosial untuk memperbaiki kondisi masyarakat. Allah menjanjikan kepada orang yang berjihad dengan sungguh-sungguh akan selalu diberi petunjuk ke jalan yang lurus. Allah berfirman:\n\nDan orang-orang yang berjihad untuk (mencari keridaan) Kami, Kami akan tunjukkan kepada mereka jalan-jalan Kami. Dan sungguh, Allah bersama orang-orang yang berbuat baik. (al-'Ankabut\/29: 69)",
      "text_translation": "Maka janganlah engkau taati orang-orang kafir, dan berjuanglah terhadap mereka dengannya (Al-Qur'an) dengan (semangat) perjuangan yang besar. ",
      "text": "فَلَا تُطِعِ الْكٰفِرِيْنَ وَجَاهِدْهُمْ بِهٖ جِهَادًا كَبِيْرًا ",
      "text_translation_en": "hence, do not defer to [the likes and dislikes of] those who deny the truth, but strive hard against them, by means of this [divine writ], with utmost striving.",
      "juz_number": 19
    },
    "53": {
      "text_tafsir_en": "This verse contains the fourth sign of God's power, which is He who allows two kinds of water to flow side by side, one fresh and fresh, while the other is salty and bitter, as happens at the mouth of large rivers. However, even though the water tastes close together it doesn't mix as if there is a wall that divides the two, so that one doesn't damage the other's taste. Even though the eyes of the two seas were mixed, in reality the fresh water separated from the salty with the power of God as in His word: He allowed two flowing seas which (then) the two met, between them there was a boundary that was not exceeded by each -everyone. (ar-Rahman \/ 55: 19-20). According to scientists, God has created a sea and river water separator, even though the river water falls swiftly from high ground. Barzakh (separator) serves to prevent the two water from erasing their characteristics. The sea is salty and fresh as if there is already a dividing wall between the two, so it doesn't mix. Humans can make choices because both salt and fresh water are of no use. In 1873, British marine scientists (with Challenger ships) discovered differences in sea characteristics in terms of salt content, temperature, fish \/ animal species, and so on. Each type of water groups by itself in a certain form, separate from other types of water no matter how far it flows. Amazon River water that flows swiftly into the Atlantic Sea to the limit of 200 miles, is still fresh. The springs in the Persian Gulf have distinctive fish and each does not live except at its location. The two seas referred to are oceans which fill around the earth and rivers that are accommodated by the land and which emit springs and large rivers which then flow into the ocean. Barzakh (separator) is a reservoir of water contained in the earth and earth channels that prevent sea water from mixing with river water so that it does not turn it into salty. The state of salt water that penetrates or flows from the ocean to the rocks near the coast, but it does not mix with fresh water that penetrates or flows into the sea from the mainland. Position of the river flow higher than sea level, allows relatively little fresh water to penetrate salt water but not totally mixed. Another related verse is: He allowed two flowing seas which (then) the two met, between them there is a boundary that is not exceeded by each. (ar-Rahman \/ 55: 19-20).",
      "text_tafsir": "Ayat ini berisi tanda kekuasaan Allah yang keempat, yaitu Dia yang membiarkan dua macam air mengalir berdampingan, yang satu tawar dan segar, sedangkan yang lain asin dan pahit, seperti yang terjadi di muara sungai-sungai besar. Namun demikian, walaupun berdekatan rasa airnya tidak bercampur seolah-olah ada dinding yang membatasi di antara keduanya, sehingga yang satu tidak merusak rasa yang lainnya. Walaupun menurut pandangan mata kedua lautan itu bercampur, namun pada kenyataannya air yang tawar terpisah dari yang asin dengan kekuasaan Allah seperti dalam firman-Nya:\n\nDia membiarkan dua laut mengalir yang (kemudian) keduanya bertemu, di antara keduanya ada batas yang tidak dilampaui oleh masing-masing. (ar-Rahman\/55: 19-20).\n\nMenurut para ilmuwan, Allah telah menciptakan pemisah air laut dan sungai, walaupun air sungai terjun dengan derasnya dari tempat tinggi. Barzakh (pemisah) ini berfungsi menghalangi kedua air untuk tidak saling menghapus ciri-cirinya. Laut asin dan tawar seolah-olah sudah ada dinding pembatas di antara keduanya, sehingga tidak bercampur aduk. Manusia dapat menentukan pilihannya karena baik air asin maupun tawar ada gunanya. \n\nPada tahun 1873, para pakar ilmu kelautan Inggris (dengan kapal Challenger) menemukan perbedaan ciri-ciri laut dari segi kadar garam, temperatur, jenis ikan\/binatang, dan sebagainya. Setiap jenis air berkelompok dengan sendirinya dalam bentuk tertentu, terpisah dari jenis air yang lain betapapun ia mengalir jauh. Air Sungai Amazon yang mengalir deras ke laut Atlantik sampai batas 200 mil, masih tetap tawar. Mata air-mata air di Teluk Persia mempunyai ikan-ikan yang khas dan masing-masing tidak hidup kecuali di lokasinya.\n\nKedua laut dimaksud adalah lautan yang memenuhi sekitar Â¾ bumi ini serta sungai yang ditampung oleh tanah dan yang memancarkan mata air-mata air serta sungai-sungai besar yang kemudian mengalir ke lautan. Barzakh (pemisah) adalah penampungan air yang terdapat di bumi itu dan saluran-saluran bumi yang menghalangi air laut bercampur dengan air sungai sehingga tidak mengubahnya menjadi asin.\n\nKeadaan air asin yang merambah atau mengalir dari lautan ke batu-batuan di dekat pantai, namun ia tidak bercampur dengan air tawar yang merambah atau mengalir ke laut dari daratan. Posisi aliran sungai yang lebih tinggi dari permukaan laut, memungkinkan air tawar yang relatif sedikit menembus air laut yang asin tetapi tidak berbaur total. Ayat lain yang terkait adalah: \n\nDia membiarkan dua laut mengalir yang (kemudian) keduanya bertemu, di antara keduanya ada batas yang tidak dilampaui oleh masing-masing. (ar-Rahman\/55: 19-20).",
      "text_translation": "Dan Dialah yang membiarkan dua laut mengalir (berdampingan); yang ini tawar dan segar dan yang lain sangat asin lagi pahit; dan Dia jadikan antara keduanya dinding dan batas yang tidak tembus. ",
      "text": "۞ وَهُوَ الَّذِيْ مَرَجَ الْبَحْرَيْنِ هٰذَا عَذْبٌ فُرَاتٌ وَّهٰذَا مِلْحٌ  اُجَاجٌۚ وَجَعَلَ بَيْنَهُمَا بَرْزَخًا وَّحِجْرًا مَّحْجُوْرًا ",
      "text_translation_en": "AND HE it is who has given freedom of movement to the two great bodies of water – the one sweet and thirst-allaying, and the other salty and bitter - and yet has wrought between them a barrier and a forbidding ban.",
      "juz_number": 19
    },
    "54": {
      "text_tafsir_en": "The fifth sign of God's power, He created man from sperm. He then made humans have offspring and musaharah (ordering) or family relationships due to the marriage of biological children with other people, so that the term family, such as son-in-law, brother-in-law, in-law, and so forth. The Word of God: Wasn't he originally only a drop of sperm that was shed (into the womb), then (the sperm) became something that was attached, then God created it and perfected it, then He made from it a pair of men and women. (Al-Qiyamah \/ 75: 37-39) Allah created a very beautiful human body structure equipped with senses, perfected with reason and the ability to think. Humans are also given all the facilities so that everything that is on the surface of the earth, is for them. The Word of God: Have you not noticed that Allah has subdued that which is in heaven and that which is in the earth for your interests and perfects His favors for you physically and mentally. (Luqman \/ 31: 20 In terms of science, some of the verses related to the above verse are: And do those who disbelieve not see that the heavens and the earth were both coherent, then We separated them. And We made them from the water of all living things, so why don't they believe (al-Anbiya '\/ 21: 30) And Allah created all kinds of animals from water, some of them walk on their bellies and some of them walk on two moderate feet some walk on four legs, Allah creates what He wants, in fact Allah is almighty over everything. (an-Nur \/ 24: 45) The three verses above indicate a close relationship between water and the existence of life. close to living things Humans and most animals come from sperm fluid 2. All life begins with water Water here is more accurately interpreted as the ocean This chemical chain is believed to start from the depths of the ocean . The notion that at sea was the start of life due to atmospheric conditions at that time had not yet developed into an area that could be inhabited by living things. From this description, the role of water for life is very clear, starting from the existence of living things on earth (originating from the depths of the sea), for its survival (water is needed for the formation of organs and carrying out organ functions), and starting life (especially for groups of animals \"water certain derived from sperm).",
      "text_tafsir": "Tanda kekuasaan Allah yang kelima, yaitu Dia yang menciptakan manusia dari sperma. Dia lalu jadikan manusia mempunyai keturunan dan musaharah (perbesanan) atau hubungan kekeluargaan akibat perkawinan anak kandung dengan orang lain, sehingga muncul istilah kekeluargaan, seperti menantu, ipar, mertua, dan sebagainya. Firman Allah:\n\nBukankah dia mulanya hanya setetes mani yang ditumpahkan (ke dalam rahim), kemudian (mani itu) menjadi sesuatu yang melekat, lalu Allah menciptakannya dan menyempurnakannya, lalu Dia menjadikan darinya sepasang laki-laki dan perempuan. (al-Qiyamah\/75: 37-39)\n\nAllah menciptakan manusia yang sangat indah susunan tubuhnya dilengkapi dengan pancaindra, disempurnakan dengan akal dan kemampuan untuk berpikir. Manusia juga diberi segala fasilitas sehingga semua yang berada di atas permukaan bumi, diperuntukkan bagi mereka. Firman Allah:\n\nTidakkah kamu memperhatikan bahwa Allah telah menundukkan apa yang ada di langit dan apa yang ada di bumi untuk (kepentingan)mu dan menyempurnakan nikmat-Nya untukmu lahir dan batin. (Luqman\/31: 20\n\nDitinjau dari segi sains, beberapa ayat yang terkait dengan ayat di atas adalah: \n\nDan apakah orang-orang yang kafir tidak melihat bahwa langit dan bumi keduanya dahulu adalah suatu yang padu, kemudian Kami pisahkan keduanya. Dan Kami jadikan dari air segala sesuatu yang hidup. Maka mengapa mereka tidak beriman. (al-Anbiya'\/21: 30).\n\nDan Allah telah menciptakan semua jenis hewan dari air, maka sebagian dari mereka ada yang berjalan di atas perutnya dan sebagian berjalan dengan dua kaki sedang sebagian berjalan dengan empat kaki. Allah menciptakan apa yang dikehendaki-Nya, sesungguhnya Allah Mahakuasa atas segala sesuatu. (an-Nur\/24: 45).\n\nKetiga ayat di atas mengindikasikan hubungan yang erat antara air dan adanya kehidupan. \n\n1.Air ditengarai sangat dekat dengan makhluk hidup. Manusia dan kebanyakan hewan berasal dari cairan sperma. \n\n2.Semua kehidupan dimulai dari air. Air di sini lebih tepat bila diartikan sebagai laut. Rantai kimia ini dipercaya dimulai dari kedalaman lautan. Dugaan bahwa di lautlah mulainya kehidupan disebabkan karena kondisi atmosfer pada saat itu belum berkembang menjadi kawasan yang dapat dihuni makhluk hidup. \n\nDari uraian ini, peran air bagi kehidupan sangat jelas, dari mulai adanya makhluk hidup di bumi (berasal dari kedalaman laut), bagi kelangsungan hidupnya (air diperlukan untuk pembentukan organ dan menjalankan fungsi organ), serta memulai kehidupan (terutama bagi kelompok hewan”air tertentu yang berasal dari sperma).",
      "text_translation": "Dan Dia (pula) yang menciptakan manusia dari air, lalu Dia jadikan manusia itu (mempunyai) keturunan dan musaharah dan Tuhanmu adalah Mahakuasa. ",
      "text": "وَهُوَ الَّذِيْ خَلَقَ مِنَ الْمَاۤءِ بَشَرًا فَجَعَلَهٗ نَسَبًا وَّصِهْرًاۗ وَكَانَ رَبُّكَ قَدِيْرًا ",
      "text_translation_en": "And He it is who out of this [very] water has created man, and has endowed him with [the con­sciousness of] descent and marriage-tie: for thy Sustainer is ever infinite in His power.",
      "juz_number": 19
    },
    "55": {
      "text_tafsir_en": "This verse explains that the idolaters worshiped gods other than God, which were statues and idols that did not benefit them. They worship it only to follow their passions and continue the tradition of their ancestors, and they worship the God who created them and has given them many pleasures. In addition, they have created evil by assisting the devil in his act of enmity with God, his apostles and the believers, as depicted in his word: And their friends (unbelievers and the wicked) help the demons in deceiving. (al-A'raf \/ 7: 202) The preface in another verse is interpreted as a helper. Some interpreters interpret it as insulting or futile until the meaning of the verse becomes: And the unbelievers on the side of their Lord are despicable and vain.",
      "text_tafsir": "Ayat ini menjelaskan bahwa orang-orang musyrik itu menyembah tuhan selain Allah, yaitu patung-patung dan berhala yang tidak memberi manfaat kepada mereka. Mereka menyembahnya hanya sekadar mengikuti hawa nafsu dan melanjutkan tradisi nenek moyang mereka saja, dan meninggalkan ibadah kepada Allah yang menciptakan mereka dan telah melimpahkan berbagai kenikmatan. Di samping itu, mereka telah membuat kemungkaran dengan membantu setan dalam tindakannya memusuhi Allah, rasul-Nya dan kaum Mukminin, seperti digambarkan dalam firman-Nya:\n\nDan teman-teman mereka (orang kafir dan fasik) membantu setan-setan dalam menyesatkan. (al-A'raf\/7: 202)\n\nKata dhahir dalam ayat lain diartikan penolong. Sebagian ahli tafsir mengartikan terhina atau tersia-sia sehingga arti ayat itu menjadi: Dan orang-orang kafir pada sisi Tuhannya sangat hina dan sia-sia.",
      "text_translation": "Dan mereka menyembah selain Allah apa yang tidak memberi manfaat kepada mereka dan tidak (pula) mendatangkan bencana kepada mereka. Orang-orang kafir adalah penolong (setan untuk berbuat durhaka) terhadap Tuhannya. ",
      "text": "وَيَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَا يَنْفَعُهُمْ وَلَا يَضُرُّهُمْۗ وَكَانَ الْكَافِرُ عَلٰى رَبِّهٖ ظَهِيْرًا ",
      "text_translation_en": "And yet, some people worship, instead of God, things that can neither benefit them nor harm them: thus, he who denies the truth does indeed turn his back on his Sustainer!",
      "juz_number": 19
    },
    "56": {
      "text_tafsir_en": "Why did the unbelievers help the devil to do evil to God, when he sent his messenger to give glad tidings to the believers and the righteous, and to warn them? They also knew that the apostle was sent to bring glad tidings and warnings. How foolish are those who hate the apostles.",
      "text_tafsir": "Mengapa kaum musyrikin itu membantu setan berbuat durhaka terhadap Allah, padahal Dia telah mengutus rasul-Nya memberi berita gembira bagi orang yang beriman dan beramal saleh, dan memberi peringatan kepada mereka. Mereka juga mengetahui bahwa rasul itu diutus untuk membawa kabar gembira dan memberi peringatan. Alangkah bodohnya orang-orang yang memusuhi rasul.",
      "text_translation": "Dan tidaklah Kami mengutus engkau (Muhammad) melainkan hanya sebagai pembawa kabar gembira dan pemberi peringatan. ",
      "text": "وَمَآ اَرْسَلْنٰكَ اِلَّا مُبَشِّرًا وَّنَذِيْرًا ",
      "text_translation_en": "Yet [withal, O Prophet,] We have sent thee only as a herald of glad tidings and a warner.",
      "juz_number": 19
    },
    "57": {
      "text_tafsir_en": "Allah instructed the Prophet to explain to his people that although he was sent for their safety, he did not take advantage of himself. He does not ask them to pay this brochure, except for those who are willing to do good deeds to draw near to God, by giving alms or voluntary aid, which is good for him.",
      "text_tafsir": "Allah memerintahkan Nabi supaya menerangkan kepada kaumnya bahwa walaupun beliau diutus untuk keselamatan mereka, namun beliau sama sekali tidak mengambil keuntungan untuk diri pribadinya. Beliau tidak meminta upah sedikit pun kepada mereka dalam menyampaikan risalah ini, kecuali bagi orang yang dengan kemauannya sendiri ingin berbuat amal saleh untuk mendekatkan diri kepada Allah, dengan mengeluarkan sedekah atau bantuan suka rela, itulah yang baik baginya.",
      "text_translation": "Katakanlah, “Aku tidak meminta imbalan apa pun dari kamu dalam menyampaikan (risalah) itu, melainkan (mengharapkan agar) orang-orang mau mengambil jalan kepada Tuhannya.” ",
      "text": "قُلْ مَآ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ اِلَّا مَنْ شَاۤءَ اَنْ يَّتَّخِذَ اِلٰى رَبِّهٖ سَبِيْلًا ",
      "text_translation_en": "Say: “For this, no reward do I ask of you [- no reward] other than that he who so wills may unto his Sustainer find a way!”",
      "juz_number": 19
    },
    "58": {
      "text_tafsir_en": "This verse commands man to trust in the Eternal God who does not die, the Lord of the universe, surrender to him, and be patient in all the calamities that befall him. It is God who provides for mankind, who delivers to the purpose of happiness. Humans are also commanded to glorify God, purifying Him from all their associates, children, wives, and all other unworthy traits, as the Muslims accuse him. God's command to trust in Him does not mean that man should never try again, or that he should not think about the motives behind the effort, but rather that he should submit to God everything he has done. In this verse, God commands us to trust only in the One who is alive, since all beings will die, so they must not depend on God. Only Allah is the Everlasting One, who knows all the deeds of his servants' deeds and sins and who can pay for their deeds. Good deeds are rewarded with rewards, and bad deeds are rewarded with punishment.",
      "text_tafsir": "Ayat ini memerintahkan manusia agar bertawakal kepada Allah yang Hidup Kekal tidak mati, Tuhan seru sekalian alam, berserah diri kepada-Nya, dan bersabar dalam segala musibah yang menimpa dirinya. Tuhanlah yang memberi kecukupan kepada manusia, yang menyampaikan kepada tujuan kebahagiaan. Manusia juga diperintahkan untuk bertasbih dengan memuji Allah, mensucikan-Nya dari segala sekutu, anak, istri, dan segala sifat yang tidak pantas, seperti yang dituduhkan oleh kaum musyrikin kepada-Nya. Perintah Allah bertawakal kepada-Nya itu bukan berarti bahwa manusia tidak perlu berusaha lagi, atau tidak perlu memikirkan sebab-sebab yang menimbulkan usaha itu, tetapi maksudnya ialah agar manusia menyerahkan kepada Allah segala sesuatu yang telah diusahakannya. Dalam ayat ini, Allah memerintahkan supaya bertawakal hanya kepada-Nya Yang Mahahidup, karena semua makhluk akan mati, maka tidak patut bertawakal kepada selain Allah. Hanya Allah-lah Yang Maha Hidup Kekal, yang mengetahui segala amal perbuatan dan dosa-dosa hamba-Nya dan yang mampu memberi balasan amal-amalnya. Amalan yang baik dibalas dengan pahala, dan amalan yang buruk dibalas dengan siksa.",
      "text_translation": "Dan bertawakallah kepada Allah Yang Hidup, Yang tidak mati, dan bertasbihlah dengan memuji-Nya. Dan cukuplah Dia Maha Mengetahui dosa hamba-hamba-Nya, ",
      "text": "وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِيْ لَا يَمُوْتُ وَسَبِّحْ بِحَمْدِهٖۗ وَكَفٰى بِهٖ بِذُنُوْبِ عِبَادِهٖ خَبِيْرًا ۚ",
      "text_translation_en": "Hence, place thy trust in the Living One who dies not, and extol His limitless glory and praise: for none is as aware as His creatures’ sins as He –",
      "juz_number": 19
    },
    "59": {
      "text_tafsir_en": "In this verse it is explained that God created the heavens, the earth, and what is between them in six periods. The word yaum is usually translated as \"day\", but \"day\" in this verse is not a 24-hour day, but a word \"yaum\". Then Allah dwells on the 'Throne (see Surah al-A'raf \/ 7: 54). Every believer believes that God is the One, eternal life, who created the heavens, the earth, and everything between them in six ages. Allah is Most Gracious because His grace and grace are great to humankind, whether they believe or not. For believers to know the nature of God, it will increase the stability of the faith. For those who do not already know the nature of His personality should ask the person who really knows the religion. Allah says: Ask the wise, if you do not know. (an-Nahl \/ 16: 43; See also Surah al-Anbiya '\/ 21: 7) In the time of the Prophet, if there were any questions regarding religion, his companions could ask him directly. After the Prophet's death, the Muslims should ask the scholars who were religious.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa Allah yang menciptakan langit, bumi, dan apa yang ada di antara keduanya dalam waktu enam masa. Kata yaum biasanya diterjemahkan sebagai \"hari\", tetapi \"hari\" dalam ayat ini bukanlah hari yang lamanya 24 jam, tetapi yaum diartikan sebagai \"masa\". Kemudian Allah bersemayam di atas 'Arasy (lihat Surah al-A'raf\/7: 54).\n\nSetiap mukmin meyakini bahwa Allah Maha Esa, hidup kekal, yang menciptakan langit, bumi, dan segala yang ada di antara keduanya dalam enam masa. Allah Maha Pemurah karena rahmat dan karunia-Nya amat besar kepada manusia, baik yang beriman maupun tidak. \n\nBagi orang-orang yang beriman hendaklah mengenal sifat-sifat Allah, karena hal itu akan menambah kemantapan iman. Bagi orang yang belum mengenal sifat-sifat-Nya tersebut hendaklah bertanya kepada orang yang betul-betul mengetahui urusan agama. Allah berfirman:\n\nMaka tanyakanlah kepada orang yang berilmu, jika kamu tidak mengetahui. (an-Nahl\/16: 43; Lihat juga Surah al-Anbiya'\/21: 7) \n\nPada masa Rasulullah, jika ada persoalan terkait dengan agama, para sahabat dapat bertanya langsung kepada beliau. Setelah Rasul wafat, kaum muslimin hendaknya bertanya kepada para ulama yang mendalami urusan agama.",
      "text_translation": "yang menciptakan langit dan bumi dan apa yang ada di antara keduanya dalam enam masa, kemudian Dia bersemayam di atas ‘Arsy, (Dialah) Yang Maha Pengasih, maka tanyakanlah (tentang Allah) kepada orang yang lebih mengetahui (Muhammad). ",
      "text": "اَلَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَيْنَهُمَا فِيْ سِتَّةِ اَيَّامٍ ثُمَّ اسْتَوٰى عَلَى الْعَرْشِۚ  اَلرَّحْمٰنُ فَسْـَٔلْ بِهٖ خَبِيْرًا ",
      "text_translation_en": "He who has created the heavens and the earth and all that is between them in six aeons, and is established on the throne of His almightiness: the Most Gracious! Ask, then, about Him, [the] One who is [truly] aware.",
      "juz_number": 19
    },
    "60": {
      "text_tafsir_en": "After explaining how much grace and grace He bestowed upon them, God also described the attitude of unbelievers who should be grateful and grateful, but they did the opposite. When those who worship other than God are commanded to bow down to the Merciful God, they answer, \"Who is the Merciful God?\" Their questions were as the Children of Israel asked Moses when he said, \"Indeed I am a messenger of Rabbul 'alamin.\" The children of Israel asked, \"Who is that Rabbul? The monk in his protest said, \"Shall we bow before the Most Merciful God, but we do not know him at all?\" The order of prostration made them defiant and away from faith. It is narrated by adh-ahhaq that the Prophet Muhammad and his companions prostrated themselves after reading this verse, as he was among the verses that were said to be prostrate to his readers and listeners. His bow is called prostrate. The verses are said to bow down to 15, two of which are in Surah al-hajj and the other 13 are in Surah al-A'raf, ar-Ra'd, an-Nahl, al-Isra ' , Mary, al-Furqan, an-Naml, as-Sajdah, sad, Fussilat, an-Najm, al-Insyiqaq, and al-'Alaq. The contents of Surah Sad are not only prostrate, but also prostrate. After Allah described the attitude of the disbelievers who shied away from prostration to Him, He described the attitude of their refusal of the people to bow down, even as they became stubborn and turned away from their Lord.",
      "text_tafsir": "Setelah menjelaskan betapa besar karunia dan nikmat yang dilimpahkan-Nya kepada mereka, Allah menerangkan pula sikap orang-orang kafir yang seharusnya bersyukur dan berterima kasih, tetapi mereka berbuat sebaliknya. Apabila mereka yang menyembah selain Allah diperintahkan untuk sujud kepada Tuhan Yang Maha Penyayang, mereka menjawab, \"Siapakah Tuhan Yang Maha Penyayang?\" Pertanyaan mereka seperti pertanyaan Bani Israil kepada Musa ketika ia mengatakan, \"Sesungguhnya aku adalah seorang utusan dari Rabbul 'alamin.\" Bani Israil bertanya, \"Siapakah Rabbul 'alamin itu?\" Kaum musyrikin itu dalam bantahannya mengatakan, \"Apakah kami akan sujud kepada Tuhan yang dikatakan Maha Penyayang, tetapi kami belum kenal sama sekali?\" Perintah sujud itu menambah mereka ingkar dan jauh dari iman.\n\nDiriwayatkan oleh adh-ahhaq bahwa Nabi Muhammad beserta para sahabat bersujud ketika selesai membaca ayat ini, karena ia termasuk di antara ayat-ayat yang disunatkan bersujud bagi para pembaca dan pendengarnya. Sujudnya dinamakan sujud tilawah. Ayat-ayat yang disunatkan sujud tilawah ada 15 buah, dua buah di antaranya berada dalam Surah al-hajj dan yang 13 lagi tersebar dalam Surah-surah al-A'raf, ar-Ra'd, an-Nahl, al-Isra', Maryam, al-Furqan, an-Naml, as-Sajdah, sad, Fussilat, an-Najm, al-Insyiqaq, dan al-'Alaq. Yang berada dalam Surah sad bukan saja sujud tilawah, tetapi juga sujud syukur. Setelah Allah menerangkan sikap orang-orang kafir yang menjauhkan diri dari sujud kepada-Nya, maka Dia menerangkan sikap penolakan orang-orang untuk sujud, bahkan mereka bertambah keras kepala dan menjauh dari Tuhannya.",
      "text_translation": "Dan apabila dikatakan kepada mereka, “Sujudlah kepada Yang Maha Pengasih”, mereka menjawab, “Siapakah yang Maha Pengasih itu? Apakah kami harus sujud kepada Allah yang engkau (Muhammad) perintahkan kepada kami (bersujud kepada-Nya)?” Dan mereka makin jauh lari (dari kebenaran). ",
      "text": "وَاِذَا قِيْلَ لَهُمُ اسْجُدُوْا لِلرَّحْمٰنِ قَالُوْا وَمَا الرَّحْمٰنُ اَنَسْجُدُ لِمَا تَأْمُرُنَا وَزَادَهُمْ نُفُوْرًا ۩ ࣖ",
      "text_translation_en": "Yet when they [who are bent on denying the truth! are told, “Prostrate yourselves before the Most Gracious.” they are wont to ask, “And [who and] what is the Most Gracious? Are we to prostrate ourselves before whatever thou biddest us [to worship]?” - and so [thy call] but increases their aversion,",
      "juz_number": 19
    },
    "61": {
      "text_tafsir_en": "The glory of God made in the stars countless stars. God made the sun shining and the moon shining. According to scientists, when it comes to space objects, the Qur'an also distinguishes stars from planets. Stars are celestial bodies that radiate light. Whereas the planets reflect only the rays received from the stars. Thus, stars have a source of light, whereas planets do not (See Jonah \/ 10: 5 and al-hijr \/ 15: 16).",
      "text_tafsir": "Mahasuci Allah yang menjadikan di langit bintang-bintang yang jumlahnya tidak terhitung. Allah menjadikan pula matahari yang bersinar terang dan bulan yang bercahaya. \n\nMenurut para ilmuwan, dalam membicarakan benda-benda angkasa, Al-Qur'an juga sudah membedakan bintang dari planet. Bintang adalah benda langit yang memancarkan sinar. Sedangkan planet hanya memantulkan sinar yang diterima dari bintang. Dengan demikian, bintang mempunyai sumber sinar, sedangkan planet tidak (Lihat Yunus\/10: 5 dan al-hijr\/15: 16).",
      "text_translation": "Mahasuci Allah yang menjadikan di langit gugusan bintang-bintang dan Dia juga menjadikan padanya matahari dan bulan yang bersinar. ",
      "text": "تَبٰرَكَ الَّذِيْ جَعَلَ فِى السَّمَاۤءِ بُرُوْجًا وَّجَعَلَ فِيْهَا سِرَاجًا وَّقَمَرًا مُّنِيْرًا  ",
      "text_translation_en": "HALLOWED is He who has set up in the skies great constellations, and has placed among them a [radiant] lamp and a light-giving moon.",
      "juz_number": 19
    },
    "62": {
      "text_tafsir_en": "It is also Allah who makes the nights and the turns in order to be a lesson for people who always remember His blessings and think about the miracles of His creation. Thus, an urge arises to be grateful for the favors of God. If if night and day do not take turns, and the sun keeps on shining, surely it will cause boredom or boredom and fatigue because you cannot rest at night. Likewise, if the night continues without sunshine, it will undoubtedly bring damage to the creatures who need it. The change of day and night provides an opportunity to perfect the shortcomings in sunnah worship, namely when someone due to busy work during the day do not have time to pray or read wirid, then it can be carried out at night, as mentioned in a valid hadith: Verily Allah reaches out Him at night so that those who sin during the day can repent and stretch out His hands during the day so that they can repent the sinners at night, until the sun rises from their setting. (Muslim history from Abu Musa). It is reported that Umar bin Khaththab had prayed Duha for a long time. When he was reprimanded by one of his friends, he replied that he had left some wird today, because of his work, so he intended to replace the deficiency with Salat Duha, then he read this verse 62. Night, day, sun and moon are the four favors of Allah. God created the night so that humans can rest due to the darkness of the night. Day was created by God with the sun rising to work. Allah created the sun and moon each have their own axis and path. Tirelessly, and never silent, everything continues to circulate. Substitution of day with night can only be a change of light into dark. However, psychologically the change from light to darkness gives a totally different mood effect from the daytime mood. Various experiments have been carried out to observe how psychic influences night workers. Psychosomatic symptoms (physical symptoms caused by psychological causes) were observed, ranging from nausea to rather severe mental depression. This is only a short-term influence on the physical and mental health of humans. Long-term effects can have more severe effects. Therefore, Allah outlines the night to rest and the day to work. So working at night called overtime is contrary to human nature as outlined by God. This condition is not surprising because during the day the earth gets exposure (visible) exposure to light, begins to shift to yellow at sunset, shifts to infra-red during Isha prayer, to ultraviolet when the night has dissolved, and approaching dangerous gamma waves approaching at dawn . This exposure causes people to suffer psychosomatic if they do not rest and are forced to work.",
      "text_tafsir": "Allah pula yang menjadikan malam dan siang silih berganti agar menjadi pelajaran bagi orang-orang yang selalu mengingat nikmat-Nya dan bertafakur tentang keajaiban ciptaan-Nya. Dengan demikian, timbul dorongan untuk mensyukuri nikmat-nikmat Allah itu. Jika seandainya malam dan siang tidak bergiliran, dan matahari terus saja bersinar, niscaya hal itu menimbulkan perasaan jemu atau bosan dan lelah karena tidak dapat beristirahat di malam hari. Demikian pula jika malam terus berlangsung tanpa diselingi dengan sinar matahari, niscaya membawa kerusakan bagi makhluk yang membutuhkannya. Adanya pergantian siang dan malam itu memberikan kesempatan untuk menyempurnakan kekurangan dalam ibadah yang sunah yaitu bilamana seseorang karena kesibukan bekerja pada siang harinya tidak sempat berdoa atau membaca wirid, maka dapat dilaksanakan pada malam harinya, seperti tersebut dalam sebuah hadis sahih:\n\nSesungguhnya Allah mengulurkan tangan-Nya di malam hari supaya orang yang berbuat dosa pada siang hari dapat bertobat dan mengulurkan tangan-Nya pada siang hari supaya dapat bertobat orang yang berdosa pada malam harinya, sampai matahari terbit dari tempat terbenamnya. (Riwayat Muslim dari Abu Musa). \n\nDiriwayatkan bahwa Umar bin Khaththab pernah salat Duha lama sekali. Tatkala beliau ditegur oleh salah seorang sahabat, beliau menjawab bahwa ia meninggalkan beberapa wirid hari ini, karena kesibukan, maka ia bermaksud mengganti kekurangan itu dengan salat Duha, lalu beliau membaca ayat 62 ini.\n\nMalam, siang, matahari, dan bulan merupakan empat nikmat Allah. Allah menciptakan malam sehingga manusia dapat beristirahat akibat gelapnya malam. Siang diciptakan oleh Allah dengan terbitnya matahari untuk bekerja. Allah menciptakan matahari dan bulan masing-masing mempunyai poros dan garis edarnya sendiri-sendiri. Tanpa kenal lelah, dan tidak pernah diam, semuanya terus beredar.\n\nPergantian siang dengan malam bisa hanya berupa perubahan terang menjadi gelap. Akan tetapi, secara psikologis pergantian dari terang menjadi gelap itu memberikan dampak suasana hati yang sama sekali berbeda dengan suasana siang. Berbagai percobaan telah dilakukan untuk mengamati bagaimana pengaruh psikis terhadap pekerja malam. Teramati gejala psikosomatis (gejala fisik yang disebabkan oleh penyebab psikis) mulai dari hanya mual-mual sampai yang agak berat yaitu depresi mental. Ini baru pengaruh jangka pendek terhadap fisik dan kejiwaan manusia. Pengaruh jangka panjang bisa memberikan efek yang lebih berat. Oleh sebab itu, Allah menggariskan malam untuk istirahat dan siang untuk bekerja. Jadi bekerja malam hari yang disebut lembur itu bertentangan dengan kodrat manusia seperti yang digariskan Allah.\n\nKondisi ini tak mengherankan karena pada siang hari bumi mendapatkan paparan (exposure) sinar tampak, mulai bergeser ke warna kuning saat matahari terbenam, bergeser ke infra-merah saat salat Isya, ke ultraviolet jika malam telah larut, dan mendekati gelombang gamma yang berbahaya mendekati subuh. Paparan ini yang menyebabkan manusia menderita psikosomatik jika tidak beristirahat dan terpaksa harus bekerja.",
      "text_translation": "Dan Dia (pula) yang menjadikan malam dan siang silih berganti bagi orang yang ingin mengambil pelajaran atau yang ingin bersyukur.",
      "text": "وَهُوَ الَّذِيْ جَعَلَ الَّيْلَ وَالنَّهَارَ خِلْفَةً لِّمَنْ اَرَادَ اَنْ يَّذَّكَّرَ اَوْ اَرَادَ شُكُوْرًا ",
      "text_translation_en": "And He it is who causes the night and the day to succeed one another, [revealing Himself in His works] unto him who has the will to take thought - that is has the will to be grateful.",
      "juz_number": 19
    },
    "63": {
      "text_tafsir_en": "The attributes of the servant of the Most Merciful are described in this verse 63 and the following verses. These attributes can all be summed up as 9 qualities that a Muslim possesses, he will have God's will in the world and in the hereafter, and will be placed in a high and noble position in the Na'im paradise. These traits are: First: When they walk, they look at their attitude and simplicity, they are far from arrogant, they are steady, orderly, and not designed to attract people or to show who they are. That is the attitude and attitude of a believer when he or she is walking. Allah says: And do not walk on this earth proudly. (al-Isra '\/ 17: 37) Second: When people speak unkind or offensive words to them, they do not respond in the same way. Instead, they respond with good words, and contain advice and hope that they may be guided by the Most Gracious, Merciful, and Merciful. As well as the attitude of the Prophet when he was attacked and humiliated with harsh words, he kept his chest open and kept on punishing those who were unkind. Al-hasan al-Basri explains that believers are always careful, and never speak harsh words. When they are spoken in profane terms, they are not emotional and do not respond with profane words. Some people may find that such attitudes and attitudes show weakness and lack of self-esteem, because it is natural for people to act rudely in response to rude behavior. However, when pondered in depth, it will inevitably lead to prolonged strife and strife. Every believer should avoid dissension and dissension. One of the most appropriate and powerful ways to get rid of it is to respond to bad actions with good ones so that those who do bad things will feel ashamed, and realize they have done something wrong. This attitude is explained by God in His word: And it is not good to be evil. Reject (evil) in a better way, so that the one who has enmity between you and him will be like a loyal friend. And (those virtues) will not be awarded except to those who are patient and will not be granted except to those who have great fortune. (Fussilat \/ 41: 34-35). Such is the attitude and attitude of the believers when they are in the daytime when they are always remembering their fellow servants of God.",
      "text_tafsir": "Sifat-sifat hamba Allah Yang Maha Pengasih dijelaskan mulai ayat 63 ini dan ayat-ayat berikutnya. Sifat-sifat itu semua dapat disimpulkan menjadi 9 sifat yang bila dimiliki oleh seorang muslim, dia akan mendapat keridaan Allah di dunia dan di akhirat, serta akan ditempatkan di posisi yang tinggi dan mulia yaitu di surga Na'im. Sifat-sifat tersebut ialah:\n\nPertama: Apabila mereka berjalan, terlihat sikap dan sifat kesederhanaan, mereka jauh dari sifat kesombongan, langkahnya mantap, teratur, dan tidak dibuat-buat dengan maksud menarik perhatian orang atau untuk menunjukkan siapa dia. Itulah sifat dan sikap seorang mukmin bila ia berjalan. Allah berfirman:\n\nDan janganlah engkau berjalan di bumi ini dengan sombong. (al-Isra'\/17: 37)\n\nKedua: Apabila ada orang yang mengucapkan kata-kata yang tidak pantas atau tidak senonoh terhadap mereka, mereka tidak membalas dengan kata-kata yang serupa. Akan tetapi, mereka menjawab dengan ucapan yang baik, dan mengandung nasihat dan harapan semoga mereka diberi petunjuk oleh Allah Yang Maha Pemurah, Maha Pengasih, dan Penyayang. Demikian pula dengan sikap Rasulullah bila ia diserang dan dihina dengan kata-kata yang kasar, beliau tetap berlapang dada dan tetap menyantuni orang-orang yang tidak berakhlak itu. \n\nAl-hasan al-Basri menjelaskan bahwa orang-orang mukmin senantiasa berlapang hati, dan tidak pernah mengucapkan kata-kata kasar. Bila kepada mereka diucapkan kata-kata yang kurang sopan, mereka tidak emosi dan tidak membalas dengan kata-kata yang tidak sopan pula. Mungkin ada orang yang menganggap bahwa sifat dan sikap seperti itu menunjukkan kelemahan dan tidak tahu harga diri, karena wajar bila ada orang yang bertindak kurang sopan dibalas dengan tindakan kurang sopan pula. Akan tetapi, bila direnungkan secara mendalam, pasti hal itu akan membawa pertengkaran dan perselisihan yang berkepanjangan. Setiap mukmin harus mencegah perselisihan dan permusuhan yang berlarut-larut. Salah satu cara yang paling tepat dan ampuh untuk membasminya ialah dengan membalas tindakan yang tidak baik dengan tindakan yang baik sehingga orang yang melakukan tindakan yang tidak baik itu akan merasa malu, dan sadar bahwa mereka telah melakukan sesuatu yang tidak wajar. Sikap seperti ini dijelaskan oleh Allah dalam firman-Nya:\n\nDan tidaklah sama kebaikan dengan kejahatan. Tolaklah (kejahatan itu) dengan cara yang lebih baik, sehingga orang yang ada rasa permusuhan antara kamu dan dia akan seperti teman yang setia. Dan (sifat-sifat yang baik itu) tidak akan dianugerahkan kecuali kepada orang-orang yang sabar dan tidak dianugerahkan kecuali kepada orang-orang yang mempunyai keberuntungan yang besar. (Fussilat\/41: 34-35).\n\nDemikianlah sifat dan sikap orang-orang mukmin di kala mereka berada di siang hari di mana mereka selalu ingat dengan sesama hamba Allah.",
      "text_translation": "Adapun hamba-hamba Tuhan Yang Maha Pengasih itu adalah orang-orang yang berjalan di bumi dengan rendah hati dan apabila orang-orang bodoh menyapa mereka (dengan kata-kata yang menghina), mereka mengucapkan “salam,” ",
      "text": "وَعِبَادُ الرَّحْمٰنِ الَّذِيْنَ يَمْشُوْنَ عَلَى الْاَرْضِ هَوْنًا وَّاِذَا خَاطَبَهُمُ الْجٰهِلُوْنَ قَالُوْا سَلٰمًا  ",
      "text_translation_en": "For, [true] servants of the Most Gracious are [only] they who walk gently on earth, and who, whenever the foolish address them, reply with [words of] peace;",
      "juz_number": 19
    },
    "64": {
      "text_tafsir_en": "Third: Then God also explains their attitude and character in relation to God the Creator of the night. When the night was quiet, the people were tired of the deep sleep, they performed the Tahajud prayer and stood before the One True God. They leave the comfort and comfort of sleep, they absorb it with all their soul and feel how it pleases and rests with God. They performed the night prayers of the Tahajud prayers as did the Messenger because by night prayers their souls became pure and clean. Their faith increased, their confidence so strong that there was no God but Him, whose mercy and love were abundant over all His creatures. There they prayed and prayed earnestly for forgiveness of their sins and errors and bestowed His grace and grace. After performing the prayer that night, they were able to sleep in a happy and fearful way. Ibn 'Abbas said, \"Whoever prays two rak'ahs or more after the Islamic prayer, he has prayed all night.\" In another verse, God also describes the attributes of the believers performing this night's prayer: They draw from their beds, they pray to their Lord with fear and hope, and they devote some of the provision We have given them. (as-Sajdah \/ 32: 16). And He says: (Do you (64) Third: Then Allah recounts their attitude and character in relation to the Creator of the night, and when the night is quiet, men are weary of deep sleep, they perform the Tahajud prayers and standing before the One True God, they left the comfort and comfort of their sleep, they applied themselves wholeheartedly and practiced how good and peaceful they were to be with God. Their faith increased, their conviction that there is no God but Him, His grace and love is abundant in all His creatures, where they earnestly pray and pray for forgiveness of sins and mistakes and grace. and after their prayers that night, they went to bed feeling happy I know and fear. Ibn 'Abbas said, \"Whoever prays two rak'ahs or more after the Islamic prayer, he has prayed all night.\" In another verse, God also describes the attributes of the believers performing this night's prayer: They draw from their beds, they pray to their Lord with fear and hope, and they devote some of the provision We have given them. (as-Sajdah \/ 32: 16). And He said: (Are you a lucky Muslim) or do you worship at night in prostration and stand up, for fear of the Hereafter and expect the mercy of His Lord? (az-Zumar \/ 39: 9). And He says: \"They sleep a little at night; and at night they seek (Allah's) forgiveness.\" (adz-dzariyat \/ 51: 17 “18) g more fortunate) or those who worship at night in prostration and stand up, for fear of the Hereafter and to expect the mercy of their Lord? (az-Zumar \/ 39: 9). And He says: \"They sleep a little at night; and at night they seek (Allah's) forgiveness.\" (adz-dzariyat \/ 51: 17 “18)",
      "text_tafsir": "Ketiga: Kemudian Allah menjelaskan pula sikap dan sifat mereka ketika berhubungan dengan Tuhan Pencipta alam pada malam hari. Apabila malam telah sunyi sepi, manusia lelap dibuai oleh tidur nyenyak, mereka mengerjakan salat Tahajud dan berdiri menghadap Tuhan Yang Maha Esa. Mereka tinggalkan kesenangan dan kenyamanan tidur, mereka resapkan dengan sepenuh jiwa dan raga bagaimana nikmat dan tenteramnya bermunajat dengan Tuhan. Mereka mengerjakan salat malam salat Tahajud seperti yang dilakukan Rasulullah karena dengan salat di malam hari itu jiwa mereka menjadi suci dan bersih. Iman mereka bertambah, keyakinan menjadi mantap bahwa tiada Tuhan selain Dia, rahmat dan kasih sayang-Nya Maha Luas meliputi semua makhluk-Nya. Di sanalah mereka memohon dan berdoa dengan penuh khusyuk dan tawaduk agar diampuni dosa dan kesalahan mereka dan dilimpahkan rahmat dan keridaan-Nya. Setelah melakukan salat malam itu, barulah mereka tidur dengan perasaan bahagia penuh tawakal dan takwa.\n\nIbnu 'Abbas berkata, \"Barang siapa yang melakukan salat dua rakaat atau lebih sesudah salat Isya berarti dia telah salat sepanjang malam.\" \n\nDalam ayat lain, Allah menjelaskan pula sifat-sifat orang-orang mukmin yang mengerjakan salat malam ini:\n\nLambung mereka jauh dari tempat tidurnya, mereka berdoa kepada Tuhannya dengan rasa takut dan penuh harap, dan mereka menginfakkan sebagian dari rezeki yang Kami berikan kepada mereka. (as-Sajdah\/32: 16).\n\nDan firman-Nya:\n\n(Apakah kamu oran(64) Ketiga: Kemudian Allah menjelaskan pula sikap dan sifat mereka ketika berhubungan dengan Tuhan Pencipta alam pada malam hari. Apabila malam telah sunyi sepi, manusia lelap dibuai oleh tidur nyenyak, mereka mengerjakan salat Tahajud dan berdiri menghadap Tuhan Yang Maha Esa. Mereka tinggalkan kesenangan dan kenyamanan tidur, mereka resapkan dengan sepenuh jiwa dan raga bagaimana nikmat dan tenteramnya bermunajat dengan Tuhan. Mereka mengerjakan salat malam salat Tahajud seperti yang dilakukan Rasulullah karena dengan salat di malam hari itu jiwa mereka menjadi suci dan bersih. Iman mereka bertambah, keyakinan menjadi mantap bahwa tiada Tuhan selain Dia, rahmat dan kasih sayang-Nya Maha Luas meliputi semua makhluk-Nya. Di sanalah mereka memohon dan berdoa dengan penuh khusyuk dan tawaduk agar diampuni dosa dan kesalahan mereka dan dilimpahkan rahmat dan keridaan-Nya. Setelah melakukan salat malam itu, barulah mereka tidur dengan perasaan bahagia penuh tawakal dan takwa.\n\nIbnu 'Abbas berkata, \"Barang siapa yang melakukan salat dua rakaat atau lebih sesudah salat Isya berarti dia telah salat sepanjang malam.\" \n\nDalam ayat lain, Allah menjelaskan pula sifat-sifat orang-orang mukmin yang mengerjakan salat malam ini:\n\nLambung mereka jauh dari tempat tidurnya, mereka berdoa kepada Tuhannya dengan rasa takut dan penuh harap, dan mereka menginfakkan sebagian dari rezeki yang Kami berikan kepada mereka. (as-Sajdah\/32: 16).\n\nDan firman-Nya:\n\n(Apakah kamu orang musyrik yang lebih beruntung) ataukah orang yang beribadah pada waktu malam dengan sujud dan berdiri, karena takut kepada (azab) akhirat dan mengharapkan rahmat Tuhannya? (az-Zumar\/39: 9).\n\nDan firman-Nya:\n\n\"Mereka sedikit sekali tidur pada waktu malam; dan pada akhir malam mereka memohon ampun (kepada Allah).\" (adz-dzariyat\/51: 17“18)\n\ng musyrik yang lebih beruntung) ataukah orang yang beribadah pada waktu malam dengan sujud dan berdiri, karena takut kepada (azab) akhirat dan mengharapkan rahmat Tuhannya? (az-Zumar\/39: 9).\n\nDan firman-Nya:\n\n\"Mereka sedikit sekali tidur pada waktu malam; dan pada akhir malam mereka memohon ampun (kepada Allah).\" (adz-dzariyat\/51: 17“18)",
      "text_translation": "dan orang-orang yang menghabiskan waktu malam untuk beribadah kepada Tuhan mereka dengan bersujud dan berdiri. ",
      "text": "وَالَّذِيْنَ يَبِيْتُوْنَ لِرَبِّهِمْ سُجَّدًا وَّقِيَامًا ",
      "text_translation_en": "and who remember their Sustainer far into the night, prostrating themselves and standing;",
      "juz_number": 19
    },
    "65": {
      "text_tafsir_en": "Fourth: They always remember the afterlife and the day of reckoning. They believe that all human deeds will be held accountable on that day, good will be rewarded double, and evil will be repaid in due course. While they were worshiping God at night, they reflected on how terrible the atmosphere was at that moment as if they had actually seen how fierce the fire of hell always awaited the wicked servants of God to be their prey and their prey. At that time their tears flowed and they earnestly petitioned the Lord to be freed from the torment of the fiery hell. Those who are so strong in their belief in the hereafter will surely use the opportunity of life in this world to do many good deeds and will not commit evil acts because they believe their deeds will be rewarded with painful torture. No matter how good a man-made law is and how strict a watch is in its execution, but a man who is ignorant of God's control can escape the bond of law and law. However, a believer, even though he has no rules and laws, will not commit any crime, for he is aware that although he may be free from the punishment of the world, he will not escape the torment in the hereafter. It is this consciousness and essence that is deeply rooted in the hearts of every Muslim who has earned the nickname \"Servant of the Most Merciful.\" This verse explains how a believer is really afraid to fall into the torment of hell because his torture is so painful and terrible. Hell is a terrible place provided for a disobedient and wicked servant of God. The infidels remain in it forever, suffering many kinds of torture. Although their skin was burning and the fire of fire had penetrated the flesh and bones, yet they lived to experience such torture in His word: Indeed, those who disbelieve in Our Signs, We shall to hell. Each time their skin was scorched, We replaced it with another skin, so that they could feel the torment. Indeed, Allah is Mighty, Mighty. (Nisa '\/ 4: 56).",
      "text_tafsir": "Keempat: Mereka selalu mengingat hari akhirat dan hari perhitungan. Mereka yakin bahwa semua amal perbuatan manusia akan dipertanggungjawabkan di hari itu, yang baik diberi ganjaran berlipat ganda, dan yang jahat akan dibalas dengan balasan yang setimpal. Di kala mereka bermunajat dengan Tuhan di malam hari tergambarlah dalam pikiran mereka bagaimana dahsyatnya suasana di waktu itu seakan-akan mereka benar-benar melihat bagaimana ganasnya api neraka yang selalu menanti para hamba Allah yang durhaka untuk menjadi mangsa dan santapannya. Di kala itu meneteslah air mata mereka dan mereka memohon dengan sungguh-sungguh kepada Tuhan agar dibebaskan dari siksaan api neraka yang pedih itu. \n\nOrang-orang yang demikian kuat keyakinannya kepada hari akhirat tentu akan mempergunakan kesempatan hidup di dunia ini untuk berbuat amal kebajikan sebanyak-banyaknya dan tidak akan melakukan perbuatan jahat karena yakin perbuatannya itu akan dibalas dengan siksaan yang pedih. Betapa pun baiknya suatu peraturan yang dibuat manusia dan betapa ketatnya pengawasan dalam pelaksanaannya, tetapi manusia yang tidak sadar akan pengawasan Allah dapat saja meloloskan diri dari ikatan peraturan dan undang-undang itu. Akan tetapi, manusia yang beriman, andaikata tidak ada peraturan dan undang-undang, tidak akan melakukan satu kejahatan pun, karena dia sadar walaupun dapat bebas dari hukuman di dunia, namun tidak akan dapat melepaskan diri dari azab di akhirat. Kesadaran dan keinsyafan inilah yang tertanam dengan kuat di dalam hati setiap muslim yang mendapat julukan \"hamba Allah Yang Maha Penyayang.\"\n\nAyat ini menjelaskan bagaimana seorang mukmin benar-benar takut jatuh ke dalam siksaan neraka karena siksaannya amat pedih dan dahsyat. Neraka itu merupakan seburuk-buruk tempat yang disediakan bagi hamba Allah yang ingkar dan durhaka. Orang-orang kafir kekal di dalamnya selama-lamanya, menderita berbagai macam siksaan. Meskipun kulit mereka telah hangus terbakar dan panasnya api neraka telah menembus ke dalam daging dan tulang belulang, namun mereka tetap hidup untuk merasakan siksaan itu sebagai tersebut dalam firman-Nya:\n\nSungguh, orang-orang yang kafir kepada ayat-ayat Kami, kelak akan Kami masukkan ke dalam neraka. Setiap kali kulit mereka hangus, Kami ganti dengan kulit yang lain, agar mereka merasakan azab. Sungguh, Allah Mahaperkasa, Mahabijaksana. (an-Nisa'\/4: 56).",
      "text_translation": "Dan orang-orang yang berkata, “Ya Tuhan kami, jauhkanlah azab Jahanam dari kami, karena sesungguhnya azabnya itu membuat kebinasaan yang kekal,”",
      "text": "وَالَّذِيْنَ يَقُوْلُوْنَ رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَۖ اِنَّ عَذَابَهَا كَانَ غَرَامًا ۖ",
      "text_translation_en": "and who pray: “O our Sustainer, avert from us the suffering of hell - for, verily, the suffering caused by it is bound to be a torment dire:",
      "juz_number": 19
    },
    "66": {
      "text_tafsir_en": "Fourth: They always remember the afterlife and the day of reckoning. They believe that all human deeds will be held accountable on that day, good will be rewarded double, and evil will be repaid in due course. While they were worshiping God at night, they reflected on how terrible the atmosphere was at that moment as if they had actually seen how fierce the fire of hell always awaited the wicked servants of God to be their prey and their prey. At that time their tears flowed and they earnestly petitioned the Lord to be freed from the torment of the fiery hell. Those who are so strong in their belief in the hereafter will surely use the opportunity of life in this world to do many good deeds and will not commit evil acts because they believe their deeds will be rewarded with painful torture. No matter how good a man-made law is and how strict a watch is in its execution, but a man who is ignorant of God's control can escape the bond of law and law. However, a believer, even though he has no rules and laws, will not commit any crime, for he is aware that although he may be free from the punishment of the world, he will not escape the torment in the hereafter. It is this consciousness and essence that is deeply rooted in the hearts of every Muslim who has earned the nickname \"Servant of the Most Merciful.\" This verse explains how a believer is really afraid to fall into the torment of hell because his torture is so painful and terrible. Hell is a terrible place provided for a disobedient and wicked servant of God. The infidels remain in it forever, suffering many kinds of torture. Although their skin was burning and the fire of fire had penetrated the flesh and bones, yet they lived to experience such torture in His word: Indeed, those who disbelieve in Our Signs, We shall to hell. Each time their skin was scorched, We replaced it with another skin, so that they could feel the torment. Indeed, Allah is Mighty, Mighty. (Nisa '\/ 4: 56).",
      "text_tafsir": "Keempat: Mereka selalu mengingat hari akhirat dan hari perhitungan. Mereka yakin bahwa semua amal perbuatan manusia akan dipertanggungjawabkan di hari itu, yang baik diberi ganjaran berlipat ganda, dan yang jahat akan dibalas dengan balasan yang setimpal. Di kala mereka bermunajat dengan Tuhan di malam hari tergambarlah dalam pikiran mereka bagaimana dahsyatnya suasana di waktu itu seakan-akan mereka benar-benar melihat bagaimana ganasnya api neraka yang selalu menanti para hamba Allah yang durhaka untuk menjadi mangsa dan santapannya. Di kala itu meneteslah air mata mereka dan mereka memohon dengan sungguh-sungguh kepada Tuhan agar dibebaskan dari siksaan api neraka yang pedih itu. \n\nOrang-orang yang demikian kuat keyakinannya kepada hari akhirat tentu akan mempergunakan kesempatan hidup di dunia ini untuk berbuat amal kebajikan sebanyak-banyaknya dan tidak akan melakukan perbuatan jahat karena yakin perbuatannya itu akan dibalas dengan siksaan yang pedih. Betapa pun baiknya suatu peraturan yang dibuat manusia dan betapa ketatnya pengawasan dalam pelaksanaannya, tetapi manusia yang tidak sadar akan pengawasan Allah dapat saja meloloskan diri dari ikatan peraturan dan undang-undang itu. Akan tetapi, manusia yang beriman, andaikata tidak ada peraturan dan undang-undang, tidak akan melakukan satu kejahatan pun, karena dia sadar walaupun dapat bebas dari hukuman di dunia, namun tidak akan dapat melepaskan diri dari azab di akhirat. Kesadaran dan keinsyafan inilah yang tertanam dengan kuat di dalam hati setiap muslim yang mendapat julukan \"hamba Allah Yang Maha Penyayang.\"\n\nAyat ini menjelaskan bagaimana seorang mukmin benar-benar takut jatuh ke dalam siksaan neraka karena siksaannya amat pedih dan dahsyat. Neraka itu merupakan seburuk-buruk tempat yang disediakan bagi hamba Allah yang ingkar dan durhaka. Orang-orang kafir kekal di dalamnya selama-lamanya, menderita berbagai macam siksaan. Meskipun kulit mereka telah hangus terbakar dan panasnya api neraka telah menembus ke dalam daging dan tulang belulang, namun mereka tetap hidup untuk merasakan siksaan itu sebagai tersebut dalam firman-Nya:\n\nSungguh, orang-orang yang kafir kepada ayat-ayat Kami, kelak akan Kami masukkan ke dalam neraka. Setiap kali kulit mereka hangus, Kami ganti dengan kulit yang lain, agar mereka merasakan azab. Sungguh, Allah Mahaperkasa, Mahabijaksana. (an-Nisa'\/4: 56).",
      "text_translation": "sungguh, Jahanam itu seburuk-buruk tempat menetap dan tempat kediaman.",
      "text": "اِنَّهَا سَاۤءَتْ مُسْتَقَرًّا وَّمُقَامًا ",
      "text_translation_en": "verily, how evil an abode and a station!” -;",
      "juz_number": 19
    },
    "67": {
      "text_tafsir_en": "Fifth: Another good trait of the believers is that they spend their precious and naive property, but maintain a balance between the two. The extravagant nature will surely bring about the destruction of property and the destruction of society. An extravagant person who, despite his personal and family's luxuries, will spend his wealth on other pleasures, such as gambling, women's play, liquor, and so on. Thus, he destroys himself and the community around him. In fact, the wealth that God has given to him must be safeguarded in the best interests of himself, his family, and his community. Even the stubbornness and insanity will lead to loss and damage. The poor man always tries to accumulate wealth even though he lives as a poor man and does not want to spend his money for the benefit of the people. If it was for his own and his family's sake, he would be reluctant to spend money, let alone for the benefit of others. Thus, the wealth will rest on one or more greedy and greedy people. Such a person is threatened by God with the fire of hell as it says in his Word: Woe to every curser and scoundrel, who gathers up wealth and calculates it, he (mankind) thinks that his wealth can sustain it. Never! He'll be thrown into hell. (al-Humazah \/ 104: 1-4). This is the attitude of a believer in giving away his wealth. He is not so reckless that he does not think about tomorrow nor is he so cruel that he tortures himself for accumulating wealth. The balance between these two despicable qualities is what is always maintained and maintained. If he is rich, he can help his people according to his wealth, and if he is poor, he can control his passions by living modestly. Yazid bin Abi habib said, \"Such is the nature of the companions of the Prophet Muhammad. They do not eat for luxury and enjoy good food; they dress not for boasting with beauty. Instead, they eat only to quench their hunger. and to strengthen the physical body in order to worship the orders of Allah. his daughter-in-law asked, “How are you going to make a living for my son?” Umar replied, “I choose the good between the two bad ones” (meaning the good between the two bad ones are wasteful and stupid).",
      "text_tafsir": "Kelima: Sifat baik lainnya dari orang-orang mukmin adalah mereka dalam menafkahkan harta tidak boros dan tidak pula kikir, tetapi tetap memelihara keseimbangan antara kedua sifat yang buruk itu. Sifat boros pasti akan membawa kemusnahan harta benda dan kerusakan masyarakat. Seseorang yang boros walaupun kebutuhan pribadi dan keluarganya telah terpenuhi dengan hidup secara mewah, tetap akan menghambur-hamburkan kekayaannya pada kesenangan lain, seperti main judi, main perempuan, minum-minuman keras, dan lain sebagainya. Dengan demikian, dia merusak diri sendiri dan masyarakat sekelilingnya. Padahal, kekayaan yang dititipkan Allah kepadanya harus dipelihara sebaik-baiknya sehingga dapat bermanfaat untuk dirinya, keluarga, dan masyarakat. \n\nSifat kikir dan bakhil pun akan membawa kepada kerugian dan kerusakan. Orang yang bakhil selalu berusaha menumpuk kekayaan walaupun dia sendiri hidup sebagai seorang miskin dan dia tidak mau mengeluarkan uangnya untuk kepentingan masyarakat. Kalau untuk kepentingan dirinya dan keluarganya saja, dia merasa segan mengeluarkan uang, apalagi untuk kepentingan orang lain. Dengan demikian, akan tertumpuklah kekayaan itu pada diri seorang atau beberapa gelintir manusia yang serakah dan tamak. Orang yang sifatnya seperti ini diancam Allah dengan api neraka sebagaimana tersebut dalam firman-Nya:\n\nCelakalah bagi setiap pengumpat dan pencela, yang mengumpulkan harta dan menghitung-hitungnya, dia (manusia) mengira bahwa hartanya itu dapat mengekalkannya. Sekali-kali tidak! Pasti dia akan dilemparkan ke dalam (neraka) Hutamah. (al-Humazah\/104: 1-4).\n\nDemikianlah sifat orang mukmin dalam menafkahkan hartanya. Dia tidak bersifat boros sehingga tidak memikirkan hari esok dan tidak pula bersifat kikir sehingga menyiksa dirinya sendiri karena hendak mengumpulkan kekayaan. Keseimbangan antara kedua macam sifat yang tercela itulah yang selalu dipelihara dan dijaga. Kalau kaya, dia dapat membantu masyarakatnya sesuai dengan kekayaannya, dan kalau miskin, dia dapat menguasai hawa nafsu dirinya dengan hidup secara sederhana. \n\nYazid bin Abi habib berkata, \"Demikianlah sifat para sahabat Nabi Muhammad saw. Mereka bukan makan untuk bermewah-mewah dan menikmati makanan yang enak-enak, mereka berpakaian bukan untuk bermegah-megah dengan keindahan. Akan tetapi, mereka makan sekadar untuk menutup rasa lapar dan untuk menguatkan jasmani karena hendak beribadah melaksanakan perintah Allah. Mereka berpakaian sekadar untuk menutup aurat dan memelihara tubuh mereka terhadap angin dan panas. \n\n'Abdul Malik bin Marwan, pada waktu mengawinkan Fathimah (putrinya) dengan 'Umar bin 'Abdul 'Aziz, bertanya kepada calon menantunya, \"Bagaimana engkau memberi nafkah kepada anakku?\" Umar menjawab, \"Aku memilih yang baik di antara dua sifat yang buruk\" (maksudnya sifat yang baik di antara dua sifat yang buruk yaitu boros dan kikir). Kemudian dia membacakan ayat ini.",
      "text_translation": "Dan (termasuk hamba-hamba Tuhan Yang Maha Pengasih) orang-orang yang apabila menginfakkan (harta), mereka tidak berlebihan, dan tidak (pula) kikir, di antara keduanya secara wajar,",
      "text": "وَالَّذِيْنَ اِذَآ اَنْفَقُوْا لَمْ يُسْرِفُوْا وَلَمْ يَقْتُرُوْا وَكَانَ بَيْنَ ذٰلِكَ قَوَامًا ",
      "text_translation_en": "and who, whenever they spend on others, are neither wasteful nor niggardly but [remember that] there is always a just mean between those [two extremes];",
      "juz_number": 19
    },
    "68": {
      "text_tafsir_en": "Sixth: In this verse, God again describes the qualities of the Most Merciful, Most Merciful servant, that he worships none other than God, and does not associate with him in anything. He really embraces pure monotheism. When he worships, his worship is purely for Allah's sake, and when he does good, he does it for Allah's sake and not for his sake. When he prays, his prayers are answered directly to the presence of God not through mediation. He is fully convinced that those who are able to answer his prayer are only God. They do not commit murder against anyone because they realize that a person's soul belongs to him. It cannot be killed except by the right appointed by God such as apostasy or the killing of unjust people. They will not commit adultery because they realize that adultery is a serious sin, a very horrific act that God condemns. By preserving the purity of monotheism which is the basis of faith, one will be purified of his soul, clear of his mind, and will not be disturbed by misleading beliefs. By avoiding murder without a right, he will cleanse himself of unrighteousness and cleanse the community of chaos. The rights of every citizen will be well protected so that they can truly enjoy peace and security. By keeping himself from the act of adultery he will cleanse himself from impurity and cleanse the community from the chaos and chaos of the lineage which creates many difficulties and instincts. In this regard, in a hadith of the Prophet (peace be upon him) it is explained: 'Abdullah bin Mas'ud said, \"I asked the Messenger of Allah,' What is the greatest sin? Then, I asked again, 'What is another sin?' The Messenger replied, 'Sin committed adultery with your neighbor's wife. justify the words of Prophet Muhammad. \" (History of al-Bukhari and Muslim) Then Allah punished the people who committed the sin with the greatest threat, the Day of Resurrection in retribution for all the sins they had committed in the world. Even Allah will multiply their doom for their great sin. They will be cast into hell and will remain there. In addition to suffering physical torments such as hot beverages that burn their throat and intestines, they also experience inner or spiritual torment, as they have always been humiliated and often regret their mistakes in the past.",
      "text_tafsir": "Keenam: Pada ayat ini, Allah menerangkan lagi sifat-sifat hamba Allah Yang Maha Pengasih lagi Maha Penyayang yaitu dia tidak menyembah selain Allah, dan tidak mempersekutukan-Nya dengan sesuatu apa pun. Dia benar-benar menganut tauhid yang murni. Bila dia beribadah, maka ibadahnya itu hanya semata-mata karena Allah, dan bila dia berbuat kebajikan, perbuatannya itu karena Allah bukan karena dia atau ingin dipuji orang. Bila dia berdoa, benar-benar doanya langsung dipanjatkan ke hadirat Allah tidak melalui perantara. Dia yakin sepenuhnya bahwa yang sanggup mengabulkan doanya hanya Allah semata. \n\nMereka tidak melakukan pembunuhan terhadap siapa pun karena menyadari bahwa jiwa seseorang menjadi hak atas dirinya. Ia tidak boleh dibunuh kecuali dengan hak yang telah ditetapkan oleh Allah seperti murtad atau membunuh orang tanpa hak. Mereka tidak akan melakukan perbuatan zina karena menyadari bahwa berzina itu termasuk dosa besar, suatu perbuatan yang sangat terkutuk dan dimurkai Allah. Dengan memelihara kemurnian tauhid yang menjadi dasar bagi akidah, seseorang akan bersih jiwanya, jernih pikirannya, dan tidak dapat diombang-ambingkan oleh kepercayaan-kepercayaan yang menyesatkan. Dengan menjauhi pembunuhan tanpa hak, akan bersihlah dirinya dari perbuatan zalim dan bersihlah masyarakat dari kekacauan. Hak setiap warga masyarakat akan terpelihara dengan baik sehingga mereka benar-benar dapat menikmati keamanan dan ketenteraman. Dengan memelihara dirinya dari perbuatan zina akan bersihlah dirinya dari kekotoran dan bersih pula masyarakat dari keonaran dan kekacauan nasab yang menimbulkan berbagai kesulitan dan ketidakstabilan. \n\nSehubungan dengan hal ini, dalam sebuah hadis Nabi saw dijelaskan:\n\n'Abdullah bin Mas'ud berkata, \"Aku bertanya kepada Rasulullah, 'Dosa apakah yang paling besar? Rasulullah menjawab, 'Engkau menjadikan tandingan bagi Allah padahal Dia yang menciptakan kamu. Aku bertanya pula, 'Dosa apakah lagi? Rasulullah menjawab, 'Dosa membunuh anakmu karena takut (miskin) karena dia akan makan bersamamu. Kemudian aku bertanya lagi, 'Dosa apakah lagi? Rasulullah menjawab, 'Dosa berzina dengan istri tetanggamu. Allah menurunkan ayat ini untuk membenarkan sabda Nabi Muhammad.\" (Riwayat al-Bukhari dan Muslim)\n\nKemudian Allah mengancam orang-orang yang melakukan perbuatan dosa itu dengan ancaman yang amat keras, yaitu neraka di hari Kiamat sebagai balasan atas semua dosa yang telah mereka perbuat di dunia. Bahkan Allah akan melipatgandakan azab bagi mereka karena dosa besar yang mereka lakukan itu. Mereka akan dilemparkan ke neraka dan akan tetap di sana. Di samping menderita siksaan jasmani seperti minuman yang sangat panas yang membakar kerongkongan dan usus mereka, mereka juga mendapat siksaan batin atau rohani, karena selalu mendapat penghinaan dan selalu menyesali kesalahan mereka sewaktu di dunia dahulu.",
      "text_translation": "dan orang-orang yang tidak mempersekutukan Allah dengan sembahan lain dan tidak membunuh orang yang diharamkan Allah kecuali dengan (alasan) yang benar, dan tidak berzina; dan barangsiapa melakukan demikian itu, niscaya dia mendapat hukuman yang berat,",
      "text": "وَالَّذِيْنَ لَا يَدْعُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ وَلَا يَقْتُلُوْنَ النَّفْسَ الَّتِيْ حَرَّمَ اللّٰهُ اِلَّا بِالْحَقِّ وَلَا يَزْنُوْنَۚ وَمَنْ يَّفْعَلْ ذٰلِكَ يَلْقَ اَثَامًا ۙ",
      "text_translation_en": "and who never invoke any [imaginary] deity side by side with God, and do not take any human beings life - [the life] which God has willed to be sacred - otherwise than in [the pursuit of] justice, and do not commit adultery. And [know that] he who commits aught thereof shall [not only] meet with a full requital",
      "juz_number": 19
    },
    "69": {
      "text_tafsir_en": "Sixth: In this verse, God again describes the qualities of the Most Merciful, Most Merciful servant, that he worships none other than God, and does not associate with him in anything. He really embraces pure monotheism. When he worships, his worship is purely for Allah's sake, and when he does good, he does it for Allah's sake and not for his sake. When he prays, his prayers are answered directly to the presence of God not through mediation. He is fully convinced that those who are able to answer his prayer are only God. They do not commit murder against anyone because they realize that a person's soul belongs to him. It cannot be killed except by the right appointed by God such as apostasy or the killing of unjust people. They will not commit adultery because they realize that adultery is a serious sin, a very horrific act that God condemns. By preserving the purity of monotheism which is the basis of faith, one will be purified of his soul, clear of his mind, and will not be disturbed by misleading beliefs. By avoiding murder without a right, he will cleanse himself of unrighteousness and cleanse the community of chaos. The rights of every citizen will be well protected so that they can truly enjoy peace and security. By keeping himself from the act of adultery he will cleanse himself from impurity and cleanse the community from the chaos and chaos of the lineage which creates many difficulties and instincts. In this regard, in a hadith of the Prophet (peace be upon him) it is explained: 'Abdullah bin Mas'ud said, \"I asked the Messenger of Allah,' What is the greatest sin? Then, I asked again, 'What is another sin?' The Messenger replied, 'Sin committed adultery with your neighbor's wife. justify the words of Prophet Muhammad. \" (History of al-Bukhari and Muslim) Then Allah punished the people who committed the sin with the greatest threat, the Day of Resurrection in retribution for all the sins they had committed in the world. Even Allah will multiply their doom for their great sin. They will be cast into hell and will remain there. In addition to suffering physical torments such as hot beverages that burn their throat and intestines, they also experience inner or spiritual torment, as they have always been humiliated and often regret their mistakes in the past.",
      "text_tafsir": "Keenam: Pada ayat ini, Allah menerangkan lagi sifat-sifat hamba Allah Yang Maha Pengasih lagi Maha Penyayang yaitu dia tidak menyembah selain Allah, dan tidak mempersekutukan-Nya dengan sesuatu apa pun. Dia benar-benar menganut tauhid yang murni. Bila dia beribadah, maka ibadahnya itu hanya semata-mata karena Allah, dan bila dia berbuat kebajikan, perbuatannya itu karena Allah bukan karena dia atau ingin dipuji orang. Bila dia berdoa, benar-benar doanya langsung dipanjatkan ke hadirat Allah tidak melalui perantara. Dia yakin sepenuhnya bahwa yang sanggup mengabulkan doanya hanya Allah semata. \n\nMereka tidak melakukan pembunuhan terhadap siapa pun karena menyadari bahwa jiwa seseorang menjadi hak atas dirinya. Ia tidak boleh dibunuh kecuali dengan hak yang telah ditetapkan oleh Allah seperti murtad atau membunuh orang tanpa hak. Mereka tidak akan melakukan perbuatan zina karena menyadari bahwa berzina itu termasuk dosa besar, suatu perbuatan yang sangat terkutuk dan dimurkai Allah. Dengan memelihara kemurnian tauhid yang menjadi dasar bagi akidah, seseorang akan bersih jiwanya, jernih pikirannya, dan tidak dapat diombang-ambingkan oleh kepercayaan-kepercayaan yang menyesatkan. Dengan menjauhi pembunuhan tanpa hak, akan bersihlah dirinya dari perbuatan zalim dan bersihlah masyarakat dari kekacauan. Hak setiap warga masyarakat akan terpelihara dengan baik sehingga mereka benar-benar dapat menikmati keamanan dan ketenteraman. Dengan memelihara dirinya dari perbuatan zina akan bersihlah dirinya dari kekotoran dan bersih pula masyarakat dari keonaran dan kekacauan nasab yang menimbulkan berbagai kesulitan dan ketidakstabilan. \n\nSehubungan dengan hal ini, dalam sebuah hadis Nabi saw dijelaskan:\n\n'Abdullah bin Mas'ud berkata, \"Aku bertanya kepada Rasulullah, 'Dosa apakah yang paling besar? Rasulullah menjawab, 'Engkau menjadikan tandingan bagi Allah padahal Dia yang menciptakan kamu. Aku bertanya pula, 'Dosa apakah lagi? Rasulullah menjawab, 'Dosa membunuh anakmu karena takut (miskin) karena dia akan makan bersamamu. Kemudian aku bertanya lagi, 'Dosa apakah lagi? Rasulullah menjawab, 'Dosa berzina dengan istri tetanggamu. Allah menurunkan ayat ini untuk membenarkan sabda Nabi Muhammad.\" (Riwayat al-Bukhari dan Muslim)\n\nKemudian Allah mengancam orang-orang yang melakukan perbuatan dosa itu dengan ancaman yang amat keras, yaitu neraka di hari Kiamat sebagai balasan atas semua dosa yang telah mereka perbuat di dunia. Bahkan Allah akan melipatgandakan azab bagi mereka karena dosa besar yang mereka lakukan itu. Mereka akan dilemparkan ke neraka dan akan tetap di sana. Di samping menderita siksaan jasmani seperti minuman yang sangat panas yang membakar kerongkongan dan usus mereka, mereka juga mendapat siksaan batin atau rohani, karena selalu mendapat penghinaan dan selalu menyesali kesalahan mereka sewaktu di dunia dahulu.",
      "text_translation": "(yakni) akan dilipatgandakan azab untuknya pada hari Kiamat dan dia akan kekal dalam azab itu, dalam keadaan terhina, ",
      "text": "يُّضٰعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيٰمَةِ وَيَخْلُدْ فِيْهٖ مُهَانًا ۙ",
      "text_translation_en": "[but] shall have his suffering doubled on Resurrection Day: for on that [Day] he shall abide in ignominy.",
      "juz_number": 19
    },
    "70": {
      "text_tafsir_en": "In these verses, God explains that those who commit such sin in the above verse, repent with true repentance, return to faith, and always do good deeds, their evil deeds will be replaced by good and evil. The double rewards of God are Forgiving, Merciful and Merciful. According to some disbelievers, the replacement of the sin of sin with the reward of good is to abolish every sin that has been committed in the past for proper repentance, and then the good deeds that they have done after repentance are multiplied to their reward so that they can erase their past sins. Other believers say that God gives the repentant a reward that is in proportion to the sins they have committed. Then he repents and does good deeds, so good deeds will be rewarded with double. So the repentant person receives two good things - his former sins are abolished and then he is rewarded as much as the sin he has committed. In a hadith, it is narrated that: From Abu thawil Syathab al-Mamdud, he came to the Prophet and asked, \"What is your opinion of a person who commits all sin, there is no sin except he does. Is his repentance acceptable? Are you converting to Islam? \"He replied,\" I testify that there is no god but the One and only ally. And you are the messenger of Allah. \"The Prophet said,\" Yes, yes. You do good and leave evil behind. Then Allah will do you all good. \"He asked again,\" All my sins are forgiven? \"\" Yes, \"replied the Prophet.\" Allahu Akbar, \"said the man, and he continued his motions until he went unseen. ) Then Allah declares that repentance must be accompanied by good deeds. Repentance begins with remorse for the evil that has been done, and ceases to do evil, followed by good deeds to prove that it is a true and true repentance. -sungguh (sigh).",
      "text_tafsir": "Pada ayat-ayat ini, Allah menerangkan bahwa orang-orang yang mengerjakan perbuatan dosa seperti tersebut pada ayat di atas, lalu bertobat dengan sebenar-benar tobat, kembali beriman, serta selalu berbuat amal saleh, perbuatan mereka yang jahat itu akan diganti dengan kebaikan dan pahala yang berlipat ganda karena Allah adalah Maha Pengampun, Maha Pengasih dan Maha Penyayang. Menurut sebagian mufasir, penggantian dosa kejahatan dengan pahala kebaikan itu ialah dengan menghapuskan segala dosa yang telah dikerjakan di masa yang lalu karena tobat yang benar, kemudian amal kebaikan yang dikerjakannya sesudah bertobat dilipatgandakan pahalanya sehingga bisa menghapus dosa yang telah dilakukan dahulu. \n\nMufasir-mufasir lain mengatakan bahwa Allah memberikan kepada orang yang bertobat itu pahala yang seimbang banyaknya dengan dosa yang telah dikerjakan. Kemudian dia bertobat dan mengerjakan amal yang baik, maka amal yang baik itu akan diberi pahala yang berlipat ganda pula. Jadi orang yang bertobat itu mendapat dua kebaikan yaitu dosa-dosanya yang terdahulu dihapuskan dan kemudian diberi pula pahala yang sama banyaknya dengan dosa yang telah dikerjakannya itu.\n\nDalam sebuah hadis, diriwayatkan bahwa:\n\nDari Abu thawil Syathab al-Mamdud, ia menghadap Nabi saw dan bertanya, \"Apakah pendapat anda tentang seseorang yang mengerjakan segala dosa, tidak ada perbuatan dosa kecuali ia lakukan. Apakah tobatnya diterima? Nabi saw menjawab, \"Apakah kamu sudah masuk Islam?\" Dia menjawab, \"Saya sendiri bersaksi bahwa tidak ada tuhan selain Allah Yang Maha Esa dan tidak ada sekutu bagi-Nya. Dan engkau adalah utusan Allah.\" Nabi saw berkata, \"Ya, benar. Kamu mengerjakan kebajikan dan meninggalkan keburukan. Maka Allah akan menjadikan untukmu kebaikan semuanya.\" Dia bertanya lagi, \"Semua kesalahanku diampuni?\" \"Ya,\" jawab Nabi saw. \"Allahu Akbar,\" kata orang tadi, dan dia terus bertakbir sampai pergi tidak kelihatan. (Riwayat al-thabrani)\n\nKemudian Allah menyatakan bahwa tobat yang diterima itu haruslah diiringi dengan perbuatan baik. Tobat dimulai dengan penyesalan atas perbuatan jahat yang telah dilaksanakan, dan berhenti dari berbuat maksiat, diiringi dengan perbuatan baik untuk menjadi bukti bahwa tobat itu adalah tobat yang sebenarnya dan dilakukan dengan sungguh-sungguh (nasuha).",
      "text_translation": "kecuali orang-orang yang bertobat dan beriman dan mengerjakan kebajikan; maka kejahatan mereka diganti Allah dengan kebaikan. Allah Maha Pengampun, Maha Penyayang.",
      "text": "اِلَّا مَنْ تَابَ وَاٰمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَاُولٰۤىِٕكَ يُبَدِّلُ اللّٰهُ سَيِّاٰتِهِمْ حَسَنٰتٍۗ وَكَانَ اللّٰهُ غَفُوْرًا رَّحِيْمًا ",
      "text_translation_en": "Excepted, however, shall be they who repent and attain to faith and do righteous deeds: for it is they whose [erstwhile] bad deeds God will transform into good ones - seeing that God is indeed much-forgiving, a dispenser of grace,",
      "juz_number": 19
    },
    "71": {
      "text_tafsir_en": "In these verses, God explains that those who commit such sin in the above verse, repent with true repentance, return to faith, and always do good deeds, their evil deeds will be replaced by good and evil. The double rewards of God are Forgiving, Merciful and Merciful. According to some disbelievers, the replacement of the sin of sin with the reward of good is to abolish every sin that has been committed in the past for proper repentance, and then the good deeds that they have done after repentance are multiplied to their reward so that they can erase their past sins. Other believers say that God gives the repentant a reward that is in proportion to the sins they have committed. Then he repents and does good deeds, so good deeds will be rewarded with double. So the repentant person receives two good things - his former sins are abolished and then he is rewarded as much as the sin he has committed. In a hadith, it is narrated that: From Abu thawil Syathab al-Mamdud, he came to the Prophet and asked, \"What is your opinion of a person who commits all sin, there is no sin except he does. Is his repentance acceptable? Are you converting to Islam? \"He replied,\" I testify that there is no god but the One and only ally. And you are the messenger of Allah. \"The Prophet said,\" Yes, yes. You do good and leave evil behind. Then Allah will do you all good. \"He asked again,\" All my sins are forgiven? \"\" Yes, \"replied the Prophet.\" Allahu Akbar, \"said the man, and he continued his motions until he went unseen. ) Then Allah declares that repentance must be accompanied by good deeds. Repentance begins with remorse for the evil that has been done, and ceases to do evil, followed by good deeds to prove that it is a true and true repentance. -sungguh (sigh).",
      "text_tafsir": "Pada ayat-ayat ini, Allah menerangkan bahwa orang-orang yang mengerjakan perbuatan dosa seperti tersebut pada ayat di atas, lalu bertobat dengan sebenar-benar tobat, kembali beriman, serta selalu berbuat amal saleh, perbuatan mereka yang jahat itu akan diganti dengan kebaikan dan pahala yang berlipat ganda karena Allah adalah Maha Pengampun, Maha Pengasih dan Maha Penyayang. Menurut sebagian mufasir, penggantian dosa kejahatan dengan pahala kebaikan itu ialah dengan menghapuskan segala dosa yang telah dikerjakan di masa yang lalu karena tobat yang benar, kemudian amal kebaikan yang dikerjakannya sesudah bertobat dilipatgandakan pahalanya sehingga bisa menghapus dosa yang telah dilakukan dahulu. \n\nMufasir-mufasir lain mengatakan bahwa Allah memberikan kepada orang yang bertobat itu pahala yang seimbang banyaknya dengan dosa yang telah dikerjakan. Kemudian dia bertobat dan mengerjakan amal yang baik, maka amal yang baik itu akan diberi pahala yang berlipat ganda pula. Jadi orang yang bertobat itu mendapat dua kebaikan yaitu dosa-dosanya yang terdahulu dihapuskan dan kemudian diberi pula pahala yang sama banyaknya dengan dosa yang telah dikerjakannya itu.\n\nDalam sebuah hadis, diriwayatkan bahwa:\n\nDari Abu thawil Syathab al-Mamdud, ia menghadap Nabi saw dan bertanya, \"Apakah pendapat anda tentang seseorang yang mengerjakan segala dosa, tidak ada perbuatan dosa kecuali ia lakukan. Apakah tobatnya diterima? Nabi saw menjawab, \"Apakah kamu sudah masuk Islam?\" Dia menjawab, \"Saya sendiri bersaksi bahwa tidak ada tuhan selain Allah Yang Maha Esa dan tidak ada sekutu bagi-Nya. Dan engkau adalah utusan Allah.\" Nabi saw berkata, \"Ya, benar. Kamu mengerjakan kebajikan dan meninggalkan keburukan. Maka Allah akan menjadikan untukmu kebaikan semuanya.\" Dia bertanya lagi, \"Semua kesalahanku diampuni?\" \"Ya,\" jawab Nabi saw. \"Allahu Akbar,\" kata orang tadi, dan dia terus bertakbir sampai pergi tidak kelihatan. (Riwayat al-thabrani)\n\nKemudian Allah menyatakan bahwa tobat yang diterima itu haruslah diiringi dengan perbuatan baik. Tobat dimulai dengan penyesalan atas perbuatan jahat yang telah dilaksanakan, dan berhenti dari berbuat maksiat, diiringi dengan perbuatan baik untuk menjadi bukti bahwa tobat itu adalah tobat yang sebenarnya dan dilakukan dengan sungguh-sungguh (nasuha).",
      "text_translation": "Dan barangsiapa bertobat dan mengerjakan kebajikan, maka sesungguhnya dia bertobat kepada Allah dengan tobat yang sebenar-benarnya.",
      "text": "وَمَنْ تَابَ وَعَمِلَ صَالِحًا فَاِنَّهٗ يَتُوْبُ اِلَى اللّٰهِ مَتَابًا ",
      "text_translation_en": "and seeing that he who repents and [thenceforth] does what is right has truly turned unto God by [this very act of] repent­ance.",
      "juz_number": 19
    },
    "72": {
      "text_tafsir_en": "Seventh: In this verse, God explains that among the nature of the servant of the Most Merciful is not willing and never swearing. When he passed in front of those who liked to say unkind words and to no avail, he passed without joining them. He realizes that a believer is inadequate to serve those who waste their precious time with nonsense, especially when it is used to talk about things that lead to sinful acts such as ridiculing people or accusing innocent people and etc. False oaths are strictly prohibited in Islam, because during that oath, someone has lied and has not revealed the truth. Too many people make false oaths to defend the unjust so that they can rob or have the rights of others and commit cruelty. In fact, if he did not take the oath, then the right would be clear and clear, and there would be no tyranny or deprivation of rights. As a believer, he must stand on the right side and must feel responsible to uphold justice and eradicate injustice. Umar bin Khaththab was furious at the perjury and he used to torture a 40-year-old man with a false oath, smash his face in black, shave all his hair, and then parade him in the middle of the market. The nature and attitude of these praised servants of God are reflected in His word: And when they heard bad words, they turned away from him and said, \"To us our deeds and to your deeds, be safe, we don't want to (hang out) with stupid people. \" (al-Qasas \/ 28: 55).",
      "text_tafsir": "Ketujuh: Pada ayat ini, Allah menerangkan bahwa di antara sifat hamba Allah Yang Maha Pengasih adalah tidak mau dan tidak pernah melakukan sumpah palsu. Apabila lewat di hadapan orang-orang yang suka mengucapkan kata-kata yang tidak karuan dan tidak ada faedahnya sama sekali, dia berlalu tanpa ikut bergabung dengan mereka. Dia menyadari bahwa seorang mukmin tidak layak melayani orang-orang yang menyia-nyiakan waktunya yang sangat berharga dengan omong kosong, apalagi bila waktu itu dipergunakan untuk membicarakan hal-hal yang membawa kepada perbuatan dosa seperti mempergunjingkan orang atau menuduh orang-orang yang tidak bersalah dan lain-lain sebagainya. \n\nBersumpah palsu sangat dilarang dalam agama Islam, karena ketika bersumpah itu, seseorang telah berdusta dan tidak menyatakan yang sebenarnya. Banyak sekali orang yang melakukan sumpah palsu untuk membela orang-orang yang tidak benar agar orang itu dapat merampas atau memiliki hak orang lain dan melakukan kezaliman. Padahal, kalau ia tidak ikut bersumpah, tentulah yang hak itu akan nyata dan jelas, serta tidak akan terjadi kezaliman atau perampasan hak. Sebagai seorang mukmin, dia harus berdiri di pihak yang benar dan harus merasa bertanggung jawab untuk menegakkan keadilan dan memberantas kezaliman. \n\nUmar bin Khaththab sangat marah kepada orang yang melakukan sumpah palsu dan dia pernah mendera orang yang bersumpah palsu 40 kali dera, mencorengi mukanya dengan warna hitam, mencukur semua rambut kepalanya, dan kemudian mengaraknya di tengah pasar. \n\nSifat dan sikap hamba-hamba Allah yang terpuji ini digambarkan Allah dalam firman-Nya:\n\nDan apabila mereka mendengar perkataan yang buruk, mereka berpaling darinya dan berkata, \"Bagi kami amal-amal kami dan bagimu amal-amal kamu, semoga selamatlah kamu, kami tidak ingin (bergaul) dengan orang-orang bodoh.\" (al-Qasas\/28: 55).",
      "text_translation": "Dan orang-orang yang tidak memberikan kesaksian palsu, dan apabila mereka bertemu dengan (orang-orang) yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, mereka berlalu dengan menjaga kehormatan dirinya,",
      "text": "وَالَّذِيْنَ لَا يَشْهَدُوْنَ الزُّوْرَۙ وَاِذَا مَرُّوْا بِاللَّغْوِ مَرُّوْا كِرَامًا ",
      "text_translation_en": "And [know that true servants of God are only] those who never bear witness to what is false, and [who], whenever they pass by [people engaged in] frivolity, pass on with dignity;",
      "juz_number": 19
    },
    "73": {
      "text_tafsir_en": "Eighth: In this verse, God describes the nature of His servants, that they may respond to the warnings given by God when they hear the warning. Their hearts are always open to receiving advice and lessons, and their minds are constantly pondering the Scriptures to understand and practice, thus increasing their faith and confidence that the teachings that God has given them are truly high values and, in essence, teachings a truth that cannot be denied. It is no wonder that they are so fanatical in their teaching, because they believe in its goodness. There is a great difference between them and the muslims who are fanatical in their worship. They are blind fanatics for refusing to accept the truth even when it is clear that their creed is wrong and contrary to common sense. However strong and clear are the reasons given to them for the misunderstanding they hold, they will not accept it because their heart is closed and their eyes are blind to thinking what is right and what is wrong.",
      "text_tafsir": "Kedelapan: Pada ayat ini, Allah menerangkan sifat para hamba-Nya, yaitu mereka dapat menanggapi peringatan yang diberikan Allah bila mereka mendengar peringatan itu. Hati mereka selalu terbuka untuk menerima nasihat dan pelajaran, pikiran mereka pun selalu merenungkan ayat-ayat Allah untuk dipahami dan diamalkan, sehingga bertambahlah keimanan dan keyakinan mereka bahwa ajaran-ajaran yang diberikan Allah kepada mereka benar-benar ajaran yang tinggi nilai dan mutunya, ajaran yang benar yang tidak dapat dibantah lagi. Tidaklah mengherankan apabila mereka sangat fanatik kepada ajaran itu, karena mereka sangat meyakini kebaikannya. \n\nSangat jauh perbedaan antara mereka dengan kaum musyrikin yang juga fanatik kepada sembahan-sembahannya. Kefanatikan mereka adalah fanatik buta karena tidak mau menerima kebenaran walaupun telah jelas dan nyata bahwa akidah yang mereka anut itu salah dan bertentangan dengan akal yang sehat. Bagaimana pun kuat dan jelasnya alasan-alasan yang dikemukakan kepada mereka tentang ketidakbenaran faham yang dianut mereka tidak akan mau menerimanya karena hatinya telah tertutup dan matanya telah buta untuk memikirkan mana yang benar dan mana yang salah.",
      "text_translation": "dan orang-orang yang apabila diberi peringatan dengan ayat-ayat Tuhan mereka, mereka tidak bersikap sebagai orang-orang yang tuli dan buta,",
      "text": "وَالَّذِيْنَ اِذَا ذُكِّرُوْا بِاٰيٰتِ رَبِّهِمْ لَمْ يَخِرُّوْا عَلَيْهَا صُمًّا وَّعُمْيَانًا ",
      "text_translation_en": "and who, whenever they are reminded of their Sustainer’s messages, do not throw themselves upon them [as if] deaf and blind;",
      "juz_number": 19
    },
    "74": {
      "text_tafsir_en": "Ninth: Among the attributes of the servant of God is that they are always begging and begging Him to be given a righteous and good posterity. His wife and children were very pleasant and comforting because their family consisted of godly and devout men. Thus, there will be more and more servants of the Most Merciful and Merciful God. In addition, they enjoined God to make his descendants the people of the whole world, to call upon the people to fear, and to be the leaders of those who feared. It is the light of faith that has filled their hearts and illuminated it with guidance and guidance so that they long for the righteous who receive guidance more and more. Their desire for their grandchildren and their descendants to be leaders of those who are not responsible for high position or absolute authority, but simply because of their sincere desire for the inhabitants of this world to be filled by believers and law-abiding. It also aims to have their grandchildren continue their struggle for justice and truth. Thus, even though they themselves died, they still received the reward of their great-grandson's struggle in accordance with the word of the Prophet: \"When a man dies, all his deeds shall be cut off except for three kinds: charity which may be used by man; the benefit of others after his death, the pious child who prays for it. \" (Muslim History of Abu Hurairah). These are the nine virtues of the servants of the Most Merciful God. When those qualities are possessed by someone, then they deserve the nickname. Those who receive the nickname will surely be loved by God and in the Hereafter will receive the bountiful and great grace and grace.",
      "text_tafsir": "Kesembilan: Di antara sifat-sifat hamba Allah ialah mereka selalu bermunajat dan memohon kepada-Nya agar dianugerahi keturunan yang saleh dan baik. Istri dan anak-anaknya benar-benar menyenangkan hati dan menyejukkan perasaan karena keluarga mereka terdiri dari orang-orang yang saleh dan bertakwa kepada Tuhan. Dengan demikian, akan bertambah banyaklah di muka bumi ini hamba-hamba Allah Yang Maha Pengasih lagi Maha Penyayang. \n\nDi samping itu, mereka bermunajat kepada Allah agar keturunannya menjadi orang-orang yang bertakwa seluruhnya, menjadi penyeru manusia untuk bertakwa, dan menjadi pemimpin bagi orang-orang yang bertakwa. Ini adalah cahaya iman yang telah memenuhi hati mereka dan meneranginya dengan petunjuk dan hidayah sehingga mereka ingin sekali supaya orang-orang yang bertakwa yang mendapat petunjuk kian lama kian bertambah juga. Keinginan mereka agar anak cucu dan keturunannya menjadi pemimpin bagi orang-orang yang bertakwa bukanlah karena ingin kedudukan yang tinggi atau kekuasaan mutlak, tetapi semata-mata karena keinginan yang tulus ikhlas agar penduduk dunia ini dipenuhi oleh orang-orang yang beriman dan bertakwa. Juga bertujuan agar anak cucu mereka melanjutkan perjuangannya menegakkan keadilan dan kebenaran. Dengan demikian, walaupun mereka sendiri telah mati, tetapi mereka tetap menerima pahala perjuangan anak cucu mereka sesuai dengan sabda Rasulullah:\n\n\"Apabila seseorang mati, maka putuslah segala amalnya kecuali dari tiga macam: sedekah yang dapat dimanfaatkan orang, ilmu pengetahuan yang ditinggalkannya yang dapat diambil manfaatnya oleh orang lain sesudah matinya, anak yang saleh yang selalu mendoakannya.\" (Riwayat Muslim dari Abu Hurairah).\n\nDemikianlah sembilan sifat baik yang dimiliki oleh hamba-hamba Allah Yang Maha Penyayang. Bila sifat-sifat itu telah dimiliki oleh seseorang, maka mereka berhak mendapat julukan demikian itu. Orang-orang yang mendapat julukan pasti akan disayang Allah dan di akhirat nanti akan mendapat karunia dan rahmat yang sangat mulia dan besar.",
      "text_translation": "Dan orang-orang yang berkata, “Ya Tuhan kami, anugerahkanlah kepada kami pasangan kami dan keturunan kami sebagai penyenang hati (kami), dan jadikanlah kami pemimpin bagi orang-orang yang bertakwa.”",
      "text": "وَالَّذِيْنَ يَقُوْلُوْنَ رَبَّنَا هَبْ لَنَا مِنْ اَزْوَاجِنَا وَذُرِّيّٰتِنَا قُرَّةَ اَعْيُنٍ وَّاجْعَلْنَا لِلْمُتَّقِيْنَ اِمَامًا ",
      "text_translation_en": "and who pray “O our Sustainer! Grant that our spouses and our offspring be a joy to our eyes, and cause us to be foremost among those who are conscious of Thee!”",
      "juz_number": 19
    },
    "75": {
      "text_tafsir_en": "In these two verses, God describes the reward and the gift that will be given to \"the servants of the Most Merciful God\", servants of God with perfect attributes and noble character thanks to their patience and kindness in obeying all of God's commandments. , thanks to their patience and perseverance in resisting their passions. They are placed in the most glorious and highest place in heaven. The angels greeted them with greetings in their honor. This is reflected in the word of God: \"As the angels entered into their places from all doors; (saying),\" Peace be to you for your endurance. (ar-Ra'd \/ 13: 23-24). Then God explained that the gifts and favors they received were the gifts and the blessings that will last forever. There is no doubt that the place is a good place to live and a good place to live.",
      "text_tafsir": "Pada dua ayat ini, Allah menerangkan ganjaran dan karunia yang akan diberikan kepada \"hamba-hamba Allah Yang Maha Penyayang itu\", hamba-hamba Allah yang mempunyai sifat-sifat yang sempurna dan akhlak yang mulia berkat kesabaran dan keuletan mereka dalam mematuhi segala perintah Allah, berkat kesabaran dan keuletan mereka melawan hawa nafsu dalam menjauhi segala larangan-Nya. Mereka ditempatkan di tempat yang paling mulia dan tinggi dalam surga. Mereka disambut oleh para malaikat dengan salam sebagai penghormatan kepada mereka. Hal ini tergambar dalam firman Allah:\n\n\"Sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu; (sambil mengucapkan), 'Selamat sejahtera atasmu karena kesabaranmu. Maka alangkah nikmatnya tempat kesudahan itu.\" (ar-Ra'd\/13: 23-24).\n\nKemudian Allah menerangkan bahwa karunia dan nikmat yang mereka terima itu adalah karunia dan nikmat yang kekal abadi yang tiada putus-putusnya. Tidak diragukan lagi bahwa tempat itu adalah sebaik-baik tempat menetap dan sebaik-baik tempat kediaman.",
      "text_translation": "Mereka itu akan diberi balasan dengan tempat yang tinggi (dalam surga) atas kesabaran mereka, dan di sana mereka akan disambut dengan penghormatan dan salam.",
      "text": "اُولٰۤىِٕكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوْا وَيُلَقَّوْنَ فِيْهَا تَحِيَّةً وَّسَلٰمًا ۙ",
      "text_translation_en": "[Such as] these will be rewarded for all their patient endurance [in life] with a high station [in paradise], and will be met therein with a greeting of welcome and peace,",
      "juz_number": 19
    },
    "76": {
      "text_tafsir_en": "In these two verses, God describes the reward and the gift that will be given to \"the servants of the Most Merciful God\", servants of God with perfect attributes and noble character thanks to their patience and kindness in obeying all of God's commandments. , thanks to their patience and perseverance in resisting their passions. They are placed in the most glorious and highest place in heaven. The angels greeted them with greetings in their honor. This is reflected in the word of God: \"As the angels entered into their places from all doors; (saying),\" Peace be to you for your endurance. (ar-Ra'd \/ 13: 23-24). Then God explained that the gifts and favors they received were the gifts and the blessings that will last forever. There is no doubt that the place is a good place to live and a good place to live.",
      "text_tafsir": "Pada dua ayat ini, Allah menerangkan ganjaran dan karunia yang akan diberikan kepada \"hamba-hamba Allah Yang Maha Penyayang itu\", hamba-hamba Allah yang mempunyai sifat-sifat yang sempurna dan akhlak yang mulia berkat kesabaran dan keuletan mereka dalam mematuhi segala perintah Allah, berkat kesabaran dan keuletan mereka melawan hawa nafsu dalam menjauhi segala larangan-Nya. Mereka ditempatkan di tempat yang paling mulia dan tinggi dalam surga. Mereka disambut oleh para malaikat dengan salam sebagai penghormatan kepada mereka. Hal ini tergambar dalam firman Allah:\n\n\"Sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu; (sambil mengucapkan), 'Selamat sejahtera atasmu karena kesabaranmu. Maka alangkah nikmatnya tempat kesudahan itu.\" (ar-Ra'd\/13: 23-24).\n\nKemudian Allah menerangkan bahwa karunia dan nikmat yang mereka terima itu adalah karunia dan nikmat yang kekal abadi yang tiada putus-putusnya. Tidak diragukan lagi bahwa tempat itu adalah sebaik-baik tempat menetap dan sebaik-baik tempat kediaman.",
      "text_translation": "Mereka kekal di dalamnya. Surga itu sebaik-baik tempat menetap dan tempat kediaman.",
      "text": "خٰلِدِيْنَ فِيْهَاۗ حَسُنَتْ مُسْتَقَرًّا وَّمُقَامًا ",
      "text_translation_en": "therein to abide: [and] how goodly an abode and [how high] a station!",
      "juz_number": 19
    },
    "77": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad to tell the unbelievers that because of his ignorance, arrogance, and arrogance, God would not care about them. They will never receive the gift given to believers but they will receive a fair reward, hell. They will be thrown into it and suffer an indescribable torment and will remain in hell.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan kepada Nabi Muhammad agar mengatakan kepada orang-orang kafir bahwa karena kekufuran, kesombongan, dan keangkuhannya, Allah tidak akan mempedulikan mereka sedikit pun. Mereka sekali-kali tidak akan mendapat karunia yang diberikan kepada orang-orang yang beriman bahkan mereka akan mendapat balasan yang setimpal yaitu neraka Jahanam. Mereka akan dilemparkan ke dalamnya dan mendapat siksaan yang tidak dapat digambarkan bagaimana pedihnya dan akan kekal abadi dalam neraka itu.",
      "text_translation": "Katakanlah (Muhammad, kepada orang-orang musyrik), “Tuhanku tidak akan mengindahkan kamu, kalau tidak karena ibadahmu. (Tetapi bagaimana kamu beribadah kepada-Nya), padahal sungguh, kamu telah mendustakan-Nya? Karena itu, kelak (azab) pasti (menimpamu).”",
      "text": "قُلْ مَا يَعْبَؤُا بِكُمْ رَبِّيْ لَوْلَا دُعَاۤؤُكُمْۚ فَقَدْ كَذَّبْتُمْ فَسَوْفَ يَكُوْنُ لِزَامًا ࣖ",
      "text_translation_en": "SAY [unto those who believe]: “No weight or value would my Sustainer attach to you were it not for your faith [in Him]!” And say unto those who deny the truth:] “You have indeed given the lie [to God’s message], and in time this [sin] will cleave unto you!”",
      "juz_number": 19
    }
  },
  "name": "الفرقان",
  "name_translation_en": "The Criterion",
  "name_translation": "Pembeda",
  "name_latin": "Al-Furqan"
}