{
  "number": 28,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 88,
  "ayat": {
    "1": {
      "text_tafsir_en": "tha Sin Mim, see the interpretation of hijaiyah letters at the beginning of Surah al-Baqarah.",
      "text_tafsir": "tha Sin Mim, lihat tafsir mengenai huruf-huruf hijaiyah pada awal Surah al-Baqarah.",
      "text_translation": "Tha Sin Mim",
      "text": " طٰسۤمّۤ ",
      "text_translation_en": "Ta. Sin. Mim.",
      "juz_number": 20
    },
    "2": {
      "text_tafsir_en": "In this verse, Allah emphasizes that the verses passed down to the Prophet Muhammad are clear and easy-to-understand verses of the Qur'an. The verses provide information on matters related to religious matters and reveal the stories of earlier peoples whose truths were unknown to the people at that time. This shows that the Qur'an was not made by Muhammad (peace be upon him) as claimed by the Muslims, because Muhammad was an illiterate people. He also never studied the wise men, especially the Bible scholars. Where can the Prophet Muhammad know about the people who lived centuries ago if not from the revelation that God had revealed to him? Therefore, there can be no doubt that the verses of the Qur'an containing laws and matters relating to religion and the stories of the ancient peoples are truly revelation from God.",
      "text_tafsir": "Pada ayat ini, Allah menegaskan bahwa ayat-ayat yang diturunkan kepada Nabi Muhammad adalah ayat-ayat dari Al-Qur'an yang jelas dan mudah dipahami. Ayat-ayat itu memberikan keterangan tentang hal-hal yang berkaitan dengan urusan agama dan mengungkap kisah umat-umat terdahulu yang kebenaran beritanya tidak diketahui oleh manusia di masa itu. Ini menunjukkan bahwa Al-Qur'an bukan buatan Muhammad saw sebagaimana dituduhkan oleh orang-orang musyrik, karena Muhammad adalah seorang ummi yang tidak tahu menulis dan membaca. Beliau juga tidak pernah belajar kepada orang-orang pandai apalagi kepada pendeta-pendeta Ahli Kitab. Dari mana Nabi Muhammad dapat mengetahui kisah umat-umat yang hidup berabad-abad yang lalu kalau tidak dari wahyu yang telah diturunkan Allah kepadanya. Oleh karena itu, tidak dapat diragukan lagi bahwa ayat-ayat Al-Qur'an yang mengandung hukum-hukum dan hal-hal yang berhubungan dengan agama serta kisah-kisah mengenai umat-umat dahulu kala, adalah benar-benar wahyu dari Allah.",
      "text_translation": "Ini ayat-ayat Kitab (Al-Qur'an) yang jelas (dari Allah).",
      "text": "تِلْكَ اٰيٰتُ الْكِتٰبِ الْمُبِيْنِ ",
      "text_translation_en": "These are messages of a divine writ clear in itself and clearly showing the truth.",
      "juz_number": 20
    },
    "3": {
      "text_tafsir_en": "In this verse it is explained that God read to Muhammad through Gabriel the verses related to the story of Moses and Pharaoh to serve as a lesson for the believers. Watching the story, in which they learn that the fate of the wicked is punished and that the believers are freed from the oppression of the wrongdoers, they are increasingly convinced that the Qur'an is a revelation which Allah revealed to Muhammad. In this verse it is said that the story of Moses was told only to believers, while the Qur'an was revealed to all mankind, both believers and unbelievers. The purpose is to explain that only believers can benefit from the exposition of the stories of the ancients because they have a clear mind and a pure heart, and are not influenced by matters of soul and mind. As for the unbelievers and the unbelievers, it is impossible to benefit from them, for they are deeply rooted in idolatry. Their hearts were filled with jealousy, arrogance, and arrogance, and they were willing to obey, making it difficult for them to accept the truth contrary to their desires and desires. No matter how clear the verses and the evidence they produce, they will still reject and reject them for various reasons such as claiming that Muhammad saw was insane or that the miracles that were revealed to him were mere magic.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa Allah membacakan kepada Nabi Muhammad dengan perantaraan Jibril ayat-ayat yang berhubungan dengan kisah Nabi Musa dan Fir'aun untuk menjadi pelajaran bagi orang-orang yang beriman. Dengan memperhatikan kisah itu, di mana mereka mengetahui bahwa nasib orang-orang yang durhaka mendapat azab dan orang-orang mukmin terbebas dari penindasan orang-orang zalim, mereka bertambah yakin bahwa Al-Qur'an memang wahyu yang diturunkan Allah kepada Muhammad saw.\n\nDalam ayat ini disebutkan bahwa kisah Nabi Musa diceritakan khusus bagi kaum mukminin saja, padahal Al-Qur'an diturunkan untuk semua umat manusia baik yang beriman maupun yang kafir. Tujuannya adalah untuk menjelaskan bahwa hanya orang-orang beriman yang dapat mengambil manfaat dari pemaparan kisah-kisah umat terdahulu karena mereka mempunyai pikiran yang jernih dan hati yang suci, serta tidak dipengaruhi oleh hal-hal yang mengotori jiwa dan akal. \n\nAdapun orang-orang kafir dan tetap dalam kekafiran tidak akan mungkin mendapat manfaat daripadanya, karena mereka telah jauh terperosok ke dalam kemusyrikan. Hati mereka telah dikuasai oleh perasaan dengki, sombong, dan takabur, serta suka memperturutkan hawa nafsu, sehingga sulit bagi mereka menerima kebenaran yang bertentangan dengan keinginan dan kemauan mereka. Bagaimana pun jelasnya ayat-ayat dan bukti-bukti yang dikemukakan, mereka akan tetap mengingkari dan menolaknya dengan berbagai alasan yang dicari-cari seperti me-ngatakan bahwa Muhammad saw sudah gila atau mukjizat yang diturunkan kepadanya hanya sihir belaka.",
      "text_translation": "Kami membacakan kepadamu sebagian dari kisah Musa dan Fir‘aun dengan sebenarnya untuk orang-orang yang beriman.",
      "text": "نَتْلُوْا عَلَيْكَ مِنْ نَّبَاِ مُوْسٰى وَفِرْعَوْنَ بِالْحَقِّ لِقَوْمٍ يُّؤْمِنُوْنَ ",
      "text_translation_en": "We [now] convey unto thee some of the story of Moses and Pharaoh, setting forth the truth for [the benefit of] people who will believe.",
      "juz_number": 20
    },
    "4": {
      "text_tafsir_en": "In this verse, God describes the story of Pharaoh having absolute authority in the land of Egypt. There is no power greater than his power. Whatever he likes and wants should be done. All the people were submissive and obedient under his command until he raised himself to be a god. With his absolute power, he can execute cruelty and persecution unjustly. His rule was not based on justice and good manners, but on his will and desire. His politics was to divide his people into groups. Then he planted the seeds of opposition and hostility on his part so that he would still have power over them. Any movement that he feels is against his power must be eradicated and eradicated. If there is news or an issue that says that an individual or a group is trying to overthrow their power or may be the reason for their downfall, then that person or group must be destroyed. Those who are considered loyal and always supportive and supportive of their foundation will be honored. They are also given a variety of facilities and privileges to be strong and successful. Pharaoh had oppressed the Children of Israel for being considered a dangerous group, if left to it would have threatened his rule. He treated this group arbitrarily, humiliated and humiliated, and treated them as having no rights. This group was even forced to build a pyramid and do other rough and hard work. Especially when he heard from his sorcerers that the power of the children of Israel would fall. Since then Pharaoh has been unanimous in trying to eradicate this group. In addition to enslaving and enslaving the Children of Israel, Pharaoh also decreed that every son born to the Children of Israel should be killed, without mercy. She ignored the crying tears of a mother who lost her labor for nine months and was the focus of her hope. By doing this, Pharaoh thinks that the Children of Israel will perish by themselves because there are no more offspring to be born. As for the girls being left alive because besides being considered weak and unable to fight, they are also used as appetizers. Therefore, God labeled Pharaoh as the destroyer of the earth. There are actually many other ways that are not in conflict with the human spirit that Pharaoh can take to prevent what he fears. However, as his heart was hardened and his mind was dark, there was no way he could see it except to kill all the sons of the children of Israel. Pharaoh then spreads spies all over Egypt to investigate all the women. When any of them are pregnant, they are immediately recorded and awaited delivery. When born a daughter is left alone, but when a boy is born it is taken away to be killed. Is it possible for Pharaoh to retain his power? Definitely not! Because behind that power, there is a far more powerful power which is the power of God that no one can defeat. He is the Creator, the Mighty, the Mighty. As-Suddi narrates that Pharaoh dreamed of seeing fire come to his country from Jerusalem. The fire burned down the houses of the Pharaohs and left the houses of the Children of Israel. Pharaoh asked wise men and magicians. They replied that the dream was to give birth to a son (from the Children of Israel) who would overthrow his power in Egypt. It was this preaching that prompted Pharaoh to commit such cruel and violent acts.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan kisah Fir'aun yang berkuasa mutlak di negeri Mesir. Tidak ada satu kekuasaan pun yang lebih tinggi dari kekuasaannya. Apa saja yang disukai dan dikehendakinya harus terlaksana. Semua rakyat tunduk dan patuh di bawah perintahnya sampai dia mengangkat dirinya menjadi tuhan. \n\nDengan kekuasaan mutlak itu, ia dapat melakukan kezaliman dan penganiayaan dengan sewenang-wenang. Pemerintahannya bukan berdasar keadilan dan akhlak yang mulia, tetapi berdasarkan kemauan dan keinginan semata. Politik yang dijalankannya adalah memecah belah kaumnya menjadi beberapa golongan. Kemudian ia menanamkan benih pertentangan dan permusuhan pada golongan-golongan itu agar dia tetap berkuasa terhadap mereka. Gerakan apa pun yang dirasakan menentang kekuasaannya harus dibasmi dan dikikis habis. Kalau ada berita atau isu yang mengatakan bahwa seseorang atau satu golongan berusaha untuk menumbangkan kekuasaannya atau mungkin menjadi sebab bagi kejatuhannya, pasti orang atau golongan itu dimusnahkannya. \n\nGolongan yang dianggap setia dan selalu menunjang dan mengokohkan singgasananya akan dimuliakan. Mereka juga diberi berbagai macam fasilitas dan keistimewaan agar menjadi kuat dan jaya. Fir'aun telah menindas Bani Israil karena dianggap golongan yang berbahaya, bila dibiarkan pasti akan menggerogoti pemerintahannya. Dia memperlakukan golongan ini dengan sewenang-wenang, direndahkan dan dihinakan, serta dianggap sebagai golongan budak yang tidak mempunyai hak apa-apa. Golongan ini bahkan dipaksa membangun piramida dan mengerjakan pekerjaan-pekerjaan kasar dan berat lainnya. Apalagi setelah ia mendengar dari tukang-tukang tenungnya bahwa yang akan merobohkan kekuasaannya ialah Bani Israil. Semenjak itu Fir'aun bertekad bulat untuk membasmi golongan ini. \n\nSelain memperlemah dan memperbudak Bani Isra'il, Fir'aun juga memutuskan setiap anak laki-laki yang lahir di kalangan Bani Israil harus dibunuh, tanpa belas kasihan. Ia tidak mempedulikan ratap tangis ibu yang kehilangan anak yang dikandungnya dengan susah payah selama sembilan bulan dan menjadi tumpuan harapannya.\n\nDengan tindakan ini, Fir'aun menyangka bahwa Bani Israil akan punah dengan sendirinya karena tidak ada lagi keturunan anak laki-laki yang akan lahir dan berkembang. Adapun anak-anak perempuan dibiarkan hidup karena selain dianggap lemah dan tak mampu melawan, mereka juga digunakan sebagai pemuas nafsu. Oleh karena itu, Allah mencap Firaun sebagai orang yang berbuat kebinasaan di muka bumi. \n\nSebenarnya banyak cara lain yang tidak bertentangan dengan peri kemanusiaan yang dapat dilakukan Fir'aun untuk menghalangi terjadinya apa yang ditakutkannya itu. Akan tetapi, karena hatinya sudah keras membatu dan pikirannya sudah gelap, tidak ada lagi jalan yang tampak olehnya kecuali membasmi semua anak laki-laki Bani Israil. Fir'aun lalu menyebarkan mata-mata ke seluruh pelosok negeri Mesir untuk menyelidiki semua perempuan. Bila ada di antara mereka yang hamil, langsung dicatat dan ditunggu masa melahirkannya. Bila yang dilahirkan anak perempuan akan dibiarkan saja, tetapi kalau yang dilahirkan anak laki-laki langsung diambil untuk dibunuh.\n\nApakah dengan tindakan itu Fir'aun dapat mempertahankan kekuasaannya? Pasti tidak! Karena di balik kekuasaannya itu, ada kekuasaan yang jauh lebih perkasa yaitu kekuasaan Allah yang tak dapat dikalahkan oleh siapa pun. Dialah Maha Pencipta, Mahakuasa, dan Mahaperkasa.\n\nDiriwayatkan oleh as-Suddi bahwa Fir'aun bermimpi melihat api datang ke negerinya dari Baitul Makdis. Api itu membakar rumah-rumah kaum Fir'aun dan membiarkan rumah-rumah Bani Israil. Fir'aun bertanya kepada orang-orang cerdik-pandai dan tukang-tukang tenung. Mereka menjawab bahwa takwil mimpi itu ialah akan lahir seorang anak laki-laki (dari Bani Israil) yang akan meruntuhkan kekuasaannya di Mesir. Takwil inilah yang mendorong Fir'aun melakukan tindakan kejam dan ganas itu.",
      "text_translation": "Sungguh, Fir‘aun telah berbuat sewenang-wenang di bumi dan menjadikan penduduknya berpecah belah, dia menindas segolongan dari mereka (Bani Israil), dia menyembelih anak laki-laki mereka dan membiarkan hidup anak perempuan mereka. Sungguh, dia (Fir‘aun) termasuk orang yang berbuat kerusakan.",
      "text": "اِنَّ فِرْعَوْنَ عَلَا فِى الْاَرْضِ وَجَعَلَ اَهْلَهَا شِيَعًا يَّسْتَضْعِفُ طَاۤىِٕفَةً مِّنْهُمْ يُذَبِّحُ اَبْنَاۤءَهُمْ وَيَسْتَحْيٖ نِسَاۤءَهُمْ ۗاِنَّهٗ كَانَ مِنَ الْمُفْسِدِيْنَ ",
      "text_translation_en": "Behold, Pharaoh exalted himself in the land and divided its people into castes. One group of them he deemed utterly low; he would slaughter their sons and spare (only) their women: for, behold, he was one of those who spread corruption [on earth].",
      "juz_number": 20
    },
    "5": {
      "text_tafsir_en": "In this verse, God explains that He will bestow His grace and grace upon the oppressed and weakened Children of Israel by giving them worldly and religious power and authority. Because of the struggle of the Children of Israel, a great and powerful kingdom was established in the land of Shamim and finally they had a great power in Egypt that had once oppressed and enslaved them. God declares in His Word: And We give to the oppressed, the east and the west We bless. And have fulfilled the good word of your Lord (for a promise) to the children of Israel through their patience. And We break down what Pharaoh and his people did and what they built. (al-A'raf \/ 7: 137) Thus, when God requires something, it must be fulfilled. No matter how strong Pharaoh was with his army and his wealth and how weak the Children of Israel were to the extent that they had no power at all, they were always oppressed, persecuted, and oppressed, but because God wanted to glorify them, there was only way and opportunity for them to rise and move. Thanks to their patience and patience, they succeeded in conquering the land of Egypt that had enslaved them. God revealed to Pharaoh what he had always feared, as well as Haman (his minister) and his army, the collapse of their kingdom with the birth of a baby, Moses. The baby escaped the care of Pharaoh, was raised and reared in his palace, and was nourished and raised with love. In fact, it is the baby that, in its heyday, will overthrow its power, crush its army and subdue its country. How hurt he was in Pharaoh's heart when he saw his beloved and pampered son, challenging and resisting his power. Pride, arrogance, and arrogance of Pharaoh are of no use when it comes to the power and authority of God. All of his actions were rewarded with equal action. Among the actions taken by the Pharaoh beyond the limits are: 1. Considering himself in absolute power so that he is arrogant and arrogant and even claims to be a god. 2. To ensure the end of his power, he divided his people, destroyed those who opposed him, killed all the infants of the Children of Israel, and let their daughters live to be employed and made into concubines and concubines. 3. Act arbitrarily and do damage to the earth. The Pharaoh's actions were retaliated by God in several ways: 1. God freed the Children of Israel from the clutches of Pharaoh and his people and made them leaders and leaders in the world. 2. Allah has given them the land of Sham by making them ruling there and giving them a place on earth. 3. God reveals to Pharaoh, Haman, and his army how their power has fallen. Thus Allah shows His power. Something that seems impossible, can happen is the overthrow of a great power by the weak, oppressed and oppressed. Indeed, Allah has given power to whom He wills, making and removing power from whom He wills it in His Word: Say, \"O Lord of the Power, You give power to whomever You will, and you take away the power of whomever you desire, and you revive whatever you please and you despise whom you desire.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Dia akan melimpahkan rahmat dan karunia-Nya kepada Bani Israil yang tertindas dan lemah itu dengan memberikan kepada mereka kekuatan dan kekuasaan duniawi dan agama. Maka berkat perjuangan Bani Israil, berdirilah satu kerajaan yang besar dan kuat di negeri Syam dan akhirnya mereka mempunyai kekuasaan yang besar di Mesir yang dahulunya pernah menindas dan memperbudak mereka. Hal ini ditegaskan Allah dalam firman-Nya:\n\nDan Kami wariskan kepada kaum yang tertindas itu, bumi bagian timur dan bagian baratnya yang telah Kami berkahi. Dan telah sempurnalah firman Tuhanmu yang baik itu (sebagai janji) untuk Bani Israil disebabkan kesabaran mereka. Dan Kami hancurkan apa yang telah dibuat Fir'aun dan kaumnya dan apa yang telah mereka bangun. (al-A'raf\/7: 137)\n\nDemikianlah, bila Allah menghendaki sesuatu, pasti terlaksana. Bagaimana pun kuatnya Fir'aun dengan tentara dan kekayaannya serta bagaimana pun lemahnya Bani Israil sampai tidak mempunyai kekuasaan sedikit pun bahkan selalu ditindas, dianiaya, dan dimusuhi, tetapi karena Allah hendak memuliakan mereka, ada saja jalan dan kesempatan bagi mereka untuk bangkit dan bergerak. Berkat keuletan dan kesabaran, mereka berhasil menguasai negeri Mesir yang pernah memperbudak mereka. \n\nAllah memperlihatkan kepada Fir'aun apa yang selalu ditakutinya, juga oleh Haman (menterinya) dan tentaranya, yaitu keruntuhan kerajaan mereka dengan lahirnya seorang bayi, yaitu Musa. Bayi ini luput dari pengawasan Fir'aun, bahkan diasuh dan dididik di istananya, serta dimanjakan dan dibesarkan dengan penuh kasih sayang. Padahal, bayi itulah nanti, di waktu besarnya, yang akan menumbangkan kekuasaannya, menghancurkan tentaranya dan menaklukkan negaranya. Bagaimana pedihnya luka di hati Fir'aun ketika melihat anak yang disayangi dan dimanjakan, menantang dan melawan kekuasaannya. \n\nKesombongan, takabur, dan keangkuhan Fir'aun memang tak ada gunanya ketika berhadapan dengan kekuasaan dan keperkasaan Allah. Semua tindakannya dibalas dengan tindakan yang setimpal. Di antara tindakan yang dilakukan oleh Fir'aun yang melampaui batas adalah:\n\n1. Menganggap dirinya berkuasa mutlak sehingga ia bersikap takabur dan sombong bahkan mendakwakan dirinya sebagai tuhan.\n\n2. Untuk menjamin kelanggengan kekuasaannya, dia memecah belah bangsanya, memusnahkan golongan yang menentangnya, membunuh semua bayi laki-laki Bani Israil, dan membiarkan anak-anak perempuan mereka hidup untuk dipekerjakan dan dijadikan sebagai gundik dan dayang-dayang kerajaan.\n\n3. Berlaku sewenang-wenang dan berbuat kerusakan di muka bumi.\n\nTindakan Fir'aun itu dibalas oleh Allah dengan beberapa tindakan pula, yaitu:\n\n1. Allah membebaskan Bani Israil dari cengkeraman Fir'aun dan kaumnya dan menjadikan mereka pemuka dan pemimpin di dunia.\n\n2. Allah mewariskan kepada mereka negeri Syam dengan menjadikan mereka berkuasa di sana dan memberikan tempat di muka bumi.\n\n3. Allah memperlihatkan kepada Fir'aun, Haman, dan tentaranya bagaimana keruntuhan kekuasaan mereka. \n\nDemikianlah Allah memperlihatkan kekuasaan-Nya. Suatu hal yang rasanya tidak mungkin, bisa terjadi yaitu tumbangnya suatu kekuasaan besar oleh orang-orang yang lemah, tertindas dan teraniaya. Sungguh Allah telah memberikan kekuasaan kepada siapa yang dikehendaki-Nya, membuat dan mencabut kekuasaan dari siapa yang dikehendaki-Nya sebagaimana tersebut dalam firman-Nya:\n\nKatakanlah (Muhammad), \"Wahai Tuhan pemilik kekuasaan, Engkau berikan kekuasaan kepada siapa pun yang Engkau kehendaki, dan Engkau cabut kekuasaan dari siapa pun yang Engkau kehendaki. Engkau muliakan siapa pun yang Engkau kehendaki dan Engkau hinakan siapa pun yang Engkau kehendaki. Di tangan Engkaulah segala kebajikan. Sungguh, Engkau Mahakuasa atas segala suatu. (ali 'Imran\/3: 26)",
      "text_translation": "Dan Kami hendak memberi karunia kepada orang-orang yang tertindas di bumi (Mesir) itu, dan hendak menjadikan mereka pemimpin dan menjadikan mereka orang-orang yang mewarisi (bumi),",
      "text": "وَنُرِيْدُ اَنْ نَّمُنَّ عَلَى الَّذِيْنَ اسْتُضْعِفُوْا فِى الْاَرْضِ وَنَجْعَلَهُمْ اَىِٕمَّةً وَّنَجْعَلَهُمُ الْوٰرِثِيْنَ ۙ",
      "text_translation_en": "But it was Our will to bestow Our favour upon those [very people] who were deemed [so] utterly low in the land, and to make them forerunners in faith. and to make them heirs [to Pharaoh’s glory],",
      "juz_number": 20
    },
    "6": {
      "text_tafsir_en": "In this verse, God explains that He will bestow His grace and grace upon the oppressed and weakened Children of Israel by giving them worldly and religious power and authority. Because of the struggle of the Children of Israel, a great and powerful kingdom was established in the land of Shamim and finally they had a great power in Egypt that had once oppressed and enslaved them. God declares in His Word: And We give to the oppressed, the east and the west We bless. And have fulfilled the good word of your Lord (for a promise) to the children of Israel through their patience. And We break down what Pharaoh and his people did and what they built. (al-A'raf \/ 7: 137) Thus, when God requires something, it must be fulfilled. No matter how strong Pharaoh was with his army and his wealth and how weak the Children of Israel were to the extent that they had no power at all, they were always oppressed, persecuted, and oppressed, but because God wanted to glorify them, there was only way and opportunity for them to rise and move. Thanks to their patience and patience, they succeeded in conquering the land of Egypt that had enslaved them. God revealed to Pharaoh what he had always feared, as well as Haman (his minister) and his army, the collapse of their kingdom with the birth of a baby, Moses. The baby escaped the care of Pharaoh, was raised and reared in his palace, and was nourished and raised with love. In fact, it is the baby that, in its heyday, will overthrow its power, crush its army and subdue its country. How hurt he was in Pharaoh's heart when he saw his beloved and pampered son, challenging and resisting his power. Pride, arrogance, and arrogance of Pharaoh are of no use when it comes to the power and authority of God. All of his actions were rewarded with equal action. Among the actions taken by the Pharaoh beyond the limits are: 1. Considering himself in absolute power so that he is arrogant and arrogant and even claims to be a god. 2. To ensure the end of his power, he divided his people, destroyed those who opposed him, killed all the infants of the Children of Israel, and let their daughters live to be employed and made into concubines and concubines. 3. Act arbitrarily and do damage to the earth. The Pharaoh's actions were retaliated by God in several ways: 1. God freed the Children of Israel from the clutches of Pharaoh and his people and made them leaders and leaders in the world. 2. Allah has given them the land of Sham by making them ruling there and giving them a place on earth. 3. God reveals to Pharaoh, Haman, and his army how their power has fallen. Thus Allah shows His power. Something that seems impossible, can happen is the overthrow of a great power by the weak, oppressed and oppressed. Indeed, Allah has given power to whom He wills, making and removing power from whom He wills it in His Word: Say, \"O Lord of the Power, You give power to whomever You will, and you take away the power of whomever you desire, and you revive whatever you please and you despise whom you desire.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Dia akan melimpahkan rahmat dan karunia-Nya kepada Bani Israil yang tertindas dan lemah itu dengan memberikan kepada mereka kekuatan dan kekuasaan duniawi dan agama. Maka berkat perjuangan Bani Israil, berdirilah satu kerajaan yang besar dan kuat di negeri Syam dan akhirnya mereka mempunyai kekuasaan yang besar di Mesir yang dahulunya pernah menindas dan memperbudak mereka. Hal ini ditegaskan Allah dalam firman-Nya:\n\nDan Kami wariskan kepada kaum yang tertindas itu, bumi bagian timur dan bagian baratnya yang telah Kami berkahi. Dan telah sempurnalah firman Tuhanmu yang baik itu (sebagai janji) untuk Bani Israil disebabkan kesabaran mereka. Dan Kami hancurkan apa yang telah dibuat Fir'aun dan kaumnya dan apa yang telah mereka bangun. (al-A'raf\/7: 137)\n\nDemikianlah, bila Allah menghendaki sesuatu, pasti terlaksana. Bagaimana pun kuatnya Fir'aun dengan tentara dan kekayaannya serta bagaimana pun lemahnya Bani Israil sampai tidak mempunyai kekuasaan sedikit pun bahkan selalu ditindas, dianiaya, dan dimusuhi, tetapi karena Allah hendak memuliakan mereka, ada saja jalan dan kesempatan bagi mereka untuk bangkit dan bergerak. Berkat keuletan dan kesabaran, mereka berhasil menguasai negeri Mesir yang pernah memperbudak mereka. \n\nAllah memperlihatkan kepada Fir'aun apa yang selalu ditakutinya, juga oleh Haman (menterinya) dan tentaranya, yaitu keruntuhan kerajaan mereka dengan lahirnya seorang bayi, yaitu Musa. Bayi ini luput dari pengawasan Fir'aun, bahkan diasuh dan dididik di istananya, serta dimanjakan dan dibesarkan dengan penuh kasih sayang. Padahal, bayi itulah nanti, di waktu besarnya, yang akan menumbangkan kekuasaannya, menghancurkan tentaranya dan menaklukkan negaranya. Bagaimana pedihnya luka di hati Fir'aun ketika melihat anak yang disayangi dan dimanjakan, menantang dan melawan kekuasaannya. \n\nKesombongan, takabur, dan keangkuhan Fir'aun memang tak ada gunanya ketika berhadapan dengan kekuasaan dan keperkasaan Allah. Semua tindakannya dibalas dengan tindakan yang setimpal. Di antara tindakan yang dilakukan oleh Fir'aun yang melampaui batas adalah:\n\n1. Menganggap dirinya berkuasa mutlak sehingga ia bersikap takabur dan sombong bahkan mendakwakan dirinya sebagai tuhan.\n\n2. Untuk menjamin kelanggengan kekuasaannya, dia memecah belah bangsanya, memusnahkan golongan yang menentangnya, membunuh semua bayi laki-laki Bani Israil, dan membiarkan anak-anak perempuan mereka hidup untuk dipekerjakan dan dijadikan sebagai gundik dan dayang-dayang kerajaan.\n\n3. Berlaku sewenang-wenang dan berbuat kerusakan di muka bumi.\n\nTindakan Fir'aun itu dibalas oleh Allah dengan beberapa tindakan pula, yaitu:\n\n1. Allah membebaskan Bani Israil dari cengkeraman Fir'aun dan kaumnya dan menjadikan mereka pemuka dan pemimpin di dunia.\n\n2. Allah mewariskan kepada mereka negeri Syam dengan menjadikan mereka berkuasa di sana dan memberikan tempat di muka bumi.\n\n3. Allah memperlihatkan kepada Fir'aun, Haman, dan tentaranya bagaimana keruntuhan kekuasaan mereka. \n\nDemikianlah Allah memperlihatkan kekuasaan-Nya. Suatu hal yang rasanya tidak mungkin, bisa terjadi yaitu tumbangnya suatu kekuasaan besar oleh orang-orang yang lemah, tertindas dan teraniaya. Sungguh Allah telah memberikan kekuasaan kepada siapa yang dikehendaki-Nya, membuat dan mencabut kekuasaan dari siapa yang dikehendaki-Nya sebagaimana tersebut dalam firman-Nya:\n\nKatakanlah (Muhammad), \"Wahai Tuhan pemilik kekuasaan, Engkau berikan kekuasaan kepada siapa pun yang Engkau kehendaki, dan Engkau cabut kekuasaan dari siapa pun yang Engkau kehendaki. Engkau muliakan siapa pun yang Engkau kehendaki dan Engkau hinakan siapa pun yang Engkau kehendaki. Di tangan Engkaulah segala kebajikan. Sungguh, Engkau Mahakuasa atas segala suatu. (ali 'Imran\/3: 26)",
      "text_translation": "dan Kami teguhkan kedudukan mereka di bumi dan Kami perlihatkan kepada Fir‘aun dan Haman bersama bala tentaranya apa yang selalu mereka takutkan dari mereka.",
      "text": "وَنُمَكِّنَ لَهُمْ فِى الْاَرْضِ وَنُرِيَ فِرْعَوْنَ وَهَامٰنَ وَجُنُوْدَهُمَا مِنْهُمْ مَّا كَانُوْا يَحْذَرُوْنَ ",
      "text_translation_en": "and to establish them securely on earth, and to let Pharaoh and Haman and their hosts experience through those [children of Israel] the very thing against which they sought to protect themselves.",
      "juz_number": 20
    },
    "7": {
      "text_tafsir_en": "This verse describes the very worrying situation of Moses' mother giving birth to her child. He knew that the child would be snatched from his lap and killed without mercy and compassion. Although Moses' birth may be concealed, it will eventually be known to Pharaoh's spies that are scattered throughout the land, so that the fate of the baby will be similar to that of other Israelite infants. After giving birth to Moses, his mother was always anxious and worried about the fate of her nine-month-old son who had been struggling for much after the baby grew. Therefore, he always asked God for his son to be rescued from the deadly danger that threatened him. In that anxiety and anxiety, God told Moses that he would not have to worry and worry. She should continue to nurse and take good care of her. If he is afraid that there are signs that his son will be known to Pharaoh, then he will throw the child into the Nile. Moses' mother was commanded by God not to doubt and worry, for He would keep and restore Moses to his bosom. The child would later become the Messenger of God who would deliver the message to Pharaoh.",
      "text_tafsir": "Ayat ini menggambarkan situasi yang sangat mencemaskan ibu Musa yang akan melahirkan anaknya. Ia tahu bahwa anak itu akan direnggut dari pangkuannya dan akan dibunuh tanpa rasa iba dan belas kasihan. Walaupun kelahiran Musa dapat disembunyikan, tetapi lama-kelamaan pasti akan diketahui oleh mata-mata Fir'aun yang banyak bertebaran di pelosok negeri, sehingga nasib bayinya akan sama dengan nasib bayi-bayi Bani Israil lainnya. Setelah melahirkan Musa, ibunya selalu merasa gelisah dan khawatir memikirkan nasib anaknya yang telah dikandungnya dengan susah payah selama sembilan bulan yang menjadi tumpuan harapan setelah bayi itu besar. Oleh karena itu, ia selalu memohon kepada Allah agar anaknya diselamatkan dari bahaya maut yang selalu mengancamnya. \n\nDalam keadaan gelisah dan cemas itu, Allah mengilhamkan kepada ibu Musa bahwa dia tidak perlu khawatir dan cemas. Hendaklah dia tetap menyusui dan menjaganya dengan sebaik-baiknya. Bila dia merasa takut karena ada tanda-tanda bahwa anaknya itu akan diketahui oleh Fir'aun, maka hendaklah ia melemparkan anak itu ke sungai Nil. Ibu Musa diperintahkan Allah untuk tidak merasa ragu dan khawatir, karena Dia akan menjaga dan mengembalikan Musa ke pangkuannya. Kelak anak itu akan menjadi rasul Allah yang akan menyampaikan dakwah kepada Fir'aun.",
      "text_translation": "Dan Kami ilhamkan kepada ibunya Musa, “Susuilah dia (Musa), dan apabila engkau khawatir terhadapnya maka hanyutkanlah dia ke sungai (Nil). Dan janganlah engkau takut dan jangan (pula) bersedih hati, sesungguhnya Kami akan mengembalikannya kepadamu, dan menjadikannya salah seorang rasul.”",
      "text": "وَاَوْحَيْنَآ اِلٰٓى اُمِّ مُوْسٰٓى اَنْ اَرْضِعِيْهِۚ فَاِذَا خِفْتِ عَلَيْهِ فَاَلْقِيْهِ فِى الْيَمِّ وَلَا تَخَافِيْ وَلَا تَحْزَنِيْ ۚاِنَّا رَاۤدُّوْهُ اِلَيْكِ وَجَاعِلُوْهُ مِنَ الْمُرْسَلِيْنَ ",
      "text_translation_en": "And so, [when he was born,] We inspired [thus] the mother of Moses: Suckle him [for a time], and then, when thou hast cause to fear for him, cast him into the river, and have no fear and do not grieve - for We shall restore him to thee, and shall make him one of Our message-bearers!”",
      "juz_number": 20
    },
    "8": {
      "text_tafsir_en": "This verse explains how Moses' mother applied the inspiration she received because she was sure what God had promised her would come true. After Moses' baby was wrapped around his body and placed in a coffin, Moses was swept into the Nile and the stream carried it toward Pharaoh's palace built by the river. One of Pharaoh's family saw the coffin floating down the river and immediately took it and took it to Pharaoh's wife. When he opened it, he was shocked to see that the contents of the box were a baby. At the same time, the pharaoh's wife appeared to love the baby. She quickly brought the baby to Pharaoh. Pharaoh reluctantly ordered that the baby be killed for fear that he was a descendant of the Children of Israel. However, Pharaoh's wife persuaded him not to kill the baby, and raised her as a child in the hope that the child would serve Pharaoh and his kingdom. Pharaoh finally allowed the child to be raised and cared for by his wife, without realizing that God intended this event. God desires that when the child grows up, he will be the greatest enemy of Pharaoh and will overthrow his power, not be a child who will serve and serve him. Thus God decreed the collapse of Pharaoh's power, in return for his arrogance, cruelty, and cruelty to the Children of Israel. Indeed Pharaoh, Haman, and his army had committed a great sin by committing such cruelty. It was natural that God would destroy Pharaoh's power by interfering with a descendant of the Children of Israel.",
      "text_tafsir": "Pada ayat ini dijelaskan bagaimana ibu Musa melaksanakan ilham yang diterimanya karena ia yakin apa yang dijanjikan Allah kepadanya pasti terjadi. Setelah bayi Musa dibungkus badannya dan dimasukkan ke dalam peti, Musa dihanyutkan ke sungai Nil dan arus sungai membawanya ke arah istana Fir'aun yang dibangun di tepi sungai itu. \n\nSalah seorang keluarga Fir'aun melihat peti itu terapung-apung dibawa arus sungai dan segera mengambil dan membawanya kepada istri Fir'aun. Setelah dibuka, ia sangat terkejut ketika melihat bahwa isi peti itu adalah seorang bayi. Saat itu juga timbul kasih sayang istri Fir'aun kepada bayi itu. Dengan cepat dibawanya bayi itu kepada Fir'aun. Tanpa ragu-ragu Fir'aun memerintahkan supaya bayi itu dibunuh karena takut kalau ia keturunan Bani Israil. Akan tetapi, istri Fir'aun membujuknya agar tidak membunuh bayi itu, dan mengangkatnya sebagai anak dengan harapan kelak anak itu akan berjasa kepada Fir'aun dan kerajaannya. Akhirnya Fir'aun mengizinkan anak itu diasuh dan dipelihara oleh istrinya, tanpa menyadari bahwa Allah menghendaki kejadian ini.\n\nAllah menghendaki apabila anak itu dewasa nanti, ia akan menjadi musuh Fir'aun yang paling besar dan akan menumbangkan kekuasaannya, bukan menjadi anak yang akan berjasa dan berbakti kepadanya. Demikianlah Allah menakdirkan keruntuhan kekuasaan Fir'aun, sebagai balasan atas kesombongan, kezaliman, dan kekejamannya terhadap Bani Israil. Sesungguhnya Fir'aun, Haman, dan tentaranya telah berbuat kesalahan besar dengan melakukan kekejaman itu. Sudah sewajarnya Allah menghancurkan kekuasaan Fir'aun itu dengan perantaraan seorang keturunan Bani Israil yang dihinakannya.",
      "text_translation": "Maka dia dipungut oleh keluarga Fir‘aun agar (kelak) dia menjadi musuh dan kesedihan bagi mereka. Sungguh, Fir‘aun dan Haman bersama bala tentaranya adalah orang-orang yang bersalah.",
      "text": "فَالْتَقَطَهٗٓ اٰلُ فِرْعَوْنَ لِيَكُوْنَ لَهُمْ عَدُوًّا وَّحَزَنًاۗ اِنَّ فِرْعَوْنَ وَهَامٰنَ وَجُنُوْدَهُمَا كَانُوْا خٰطِـِٕيْنَ ",
      "text_translation_en": "And [some of] Pharaoh’s household found [and spared] him: for [We had willed] that he becomes an enemy unto them and [a source of] grief, seeing that Pharaoh and Haman and their hosts were sinners indeed!",
      "juz_number": 20
    },
    "9": {
      "text_tafsir_en": "In this verse, Allah explains the answer of Pharaoh's wife to keep the baby from being killed, because Pharaoh is worried that the baby is the son of a Children of Israel who is feared to destroy his power. The wife of Pharaoh who had loved the child because he was interested to see his beautiful face said, \"Do not kill this child because I am very dear and interested in him. Let me nurture and educate him. He will be a comforter to my heart and your heart when it is difficult. Who know in the future he will be meritorious for us. Or it would be nice if he we take our adopted children, because until now we have not been blessed with a child. \" Because of the persistence of the wife of Pharaoh and the logical reasons he put forward, Pharaoh finally let the child live and take care of himself by his wife. Such is God's destiny. He had made Pharaoh's wife love the child and made Pharaoh's heart soft because of his wife's seduction so that the child would not be killed. In fact, that child will later be against Pharaoh and will become his main enemy without even realizing it.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan jawaban istri Fir'aun untuk mempertahankan bayi itu agar tidak dibunuh, karena Fir'aun khawatir kalau bayi itu anak seorang Bani Israil yang dikhawatirkan akan menghancurkan kekuasaannya. Istri Fir'aun yang telah telanjur menyayangi anak itu karena tertarik melihat parasnya yang rupawan mengatakan, \"Janganlah engkau bunuh anak ini karena saya amat sayang dan tertarik kepadanya. Biarkanlah saya mengasuh dan mendidiknya. Dia akan menjadi penghibur hatiku dan hatimu di kala susah. Siapa tahu di kemudian hari dia akan berjasa kepada kita. Atau alangkah baiknya kalau dia kita ambil menjadi anak angkat kita, karena sampai sekarang kita belum dikaruniai seorang anak pun.\" Karena kegigihan istri Fir'aun dan alasan-alasan logis yang dikemukakannya, akhirnya Fir'aun membiarkan anak itu hidup dan diasuh sendiri oleh istrinya. \n\nDemikianlah takdir Allah. Dia telah menjadikan istri Fir'aun menyayangi anak itu dan menjadikan hati Fir'aun lunak karena rayuan istrinya sehingga anak itu tidak jadi dibunuh. Padahal, anak itulah kelak yang akan menentang Fir'aun dan akan menjadi musuhnya yang utama tanpa dia sadari sedikit pun.",
      "text_translation": "Dan istri Fir‘aun berkata, “(Dia) adalah penyejuk mata hati bagiku dan bagimu. Janganlah kamu membunuhnya, mudah-mudahan dia bermanfaat kepada kita atau kita ambil dia menjadi anak,” sedang mereka tidak menyadari.",
      "text": "وَقَالَتِ امْرَاَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّيْ وَلَكَۗ  لَا تَقْتُلُوْهُ ۖعَسٰٓى اَنْ يَّنْفَعَنَآ اَوْ نَتَّخِذَهٗ وَلَدًا وَّهُمْ لَا يَشْعُرُوْنَ ",
      "text_translation_en": "Now the wife of Pharaoh said: “A joy to the eye [could this child be] for me and thee! Slay him not: he may well be of use to us, or we may adopt him as a son!” And they had no presentiment [of what he was to become].",
      "juz_number": 20
    },
    "10": {
      "text_tafsir_en": "In this verse, God describes how Moses' mother was after she threw her son into the Nile to carry out the inspiration he received from God. Although he acted on the inspiration of God with the promise that his son would be returned to him, he was still uneasy and thoughtless about the fate of his son who had been swept into the Nile. All sorts of questions came to Moses' mind. Sometimes he regrets himself for doing such a thing. How do I find her child again? Will he scream and admit that he threw his son into the river, then ask the public to find him? His heart and mind are completely empty. She has lost her mind and consciousness so she can't think anymore. However, God strengthened his heart and calmed his mind until he realized and believed that God had promised to return his child to his lap and would later raise him to apostles.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bagaimana keadaan ibu Musa setelah ia melemparkan anaknya ke sungai Nil untuk melaksanakan ilham yang diterimanya dari Allah. Walaupun tindakan yang dilakukannya berdasarkan ilham dari Allah dengan janji bahwa anaknya akan dikembalikan kepadanya, namun ia tetap gelisah dan tidak pernah merasa tenteram memikirkan nasib anaknya yang telah dihanyutkan ke sungai Nil. \n\nBerbagai macam pertanyaan terlintas dalam pikiran ibu Musa. Kadang-kadang dia menyesali dirinya telah melakukan perbuatan itu. Bagaimanakah cara menemukan anaknya kembali? Apakah dia akan berteriak-teriak dan mengakui bahwa dia telah melemparkan anaknya ke sungai, kemudian minta tolong kepada khalayak ramai untuk mencarinya? Benar-benar hati dan pikirannya telah kosong. Dia telah kehilangan akal dan kesadaran sehingga tak dapat berpikir lagi. Akan tetapi, Allah menguatkan hatinya dan menenteramkan pikirannya sehingga sadar dan percaya bahwa Allah telah menjanjikan akan mengembalikan anaknya ke pangkuannya dan kelak akan mengangkatnya menjadi rasul.",
      "text_translation": "Dan hati ibu Musa menjadi kosong. Sungguh, hampir saja dia menyatakannya (rahasia tentang Musa), seandainya tidak Kami teguhkan hatinya, agar dia termasuk orang-orang yang beriman (kepada janji Allah).",
      "text": "وَاَصْبَحَ فُؤَادُ اُمِّ مُوْسٰى فٰرِغًاۗ اِنْ كَادَتْ لَتُبْدِيْ بِهٖ لَوْلَآ اَنْ رَّبَطْنَا عَلٰى قَلْبِهَا لِتَكُوْنَ مِنَ الْمُؤْمِنِيْنَ ",
      "text_translation_en": "On the morrow, however, an aching void grew up in the heart of the mother of Moses, and she would indeed have disclosed all about him had We not endowed her heart with enough strength to keep alive her faith [in Our promise].",
      "juz_number": 20
    },
    "11": {
      "text_tafsir_en": "Although Moses' mother had done what God had inspired her to do, her heart was not at peace. Therefore, he had his daughter (Moses' sister) seek the news of Moses. Then Moses' brother went to the coffin containing Moses. Finally he saw from a distance that the box had entered Pharaoh's territory and was interrupted by his family. Although this event was witnessed by many, they were unaware of Moses' presence. In the palace people were busy finding out who was suitable for breastfeeding, as he refused every woman to breastfeed. When Moses' brother learned of this, he dared to look into his face and said he knew a woman who was healthy and had plenty of water. Maybe the child wants to be breastfed by the woman. The woman is from a good family and the child will be cared for with care and affection. Ibn 'Abbas, on the other hand, reported that after Moses' brother spoke these words, Moses' mother was brought to the palace, and they looked at him with suspicion and asked the question, \"Where did you know that the woman would take good care of him and shed his love for her?\" ? \" Moses' brother replied, \"Of course he will do so for the sake of Pharaoh's favor and for his great gift.\" With these answers their suspicion disappeared. Moses was then taken back to his mother's house. When she got home, her mother put Moses on her lap for breastfeeding. Moses' mouth immediately grabbed his mother's nipples. Those present were very pleased to see this and sent an envoy to the king to announce it. The queen summoned Moses' mother and gave her many gifts and gifts and asked her to be ready to stay in the palace to take care of Moses. Moses' mother politely declined the offer and told the empress that she had a husband and children and did not want to leave them. He begged the emperor to allow him to bring Moses to his house. The empress did not mind the proposal and allowed Moses to be brought to his mother's house. The empress gave her enough hugs. In addition, the empress also gave her gifts in money, clothing, and so on. Finally, Moses' mother returned to the house with her happy and happy heart. God removes all of Moses' mother's worries and worries and replaces them with abundant peace, glory, and sustenance and returns Moses to live with his mother.",
      "text_tafsir": "Walaupun ibu Musa telah melaksanakan apa yang diilhamkan Allah kepadanya, namun hatinya belum tenteram. Oleh sebab itu, ia menyuruh anak perempuannya (kakak Musa) mencari-cari berita tentang Musa. Lalu kakak Musa pergi mengikuti peti yang berisi Musa. Akhirnya dia melihat dari kejauhan peti itu telah memasuki kawasan Fir'aun dan disela-matkan keluarganya. Meskipun peristiwa ini disaksikan orang banyak, tetapi mereka tidak menyadari kehadiran Musa di antara mereka. \n\nDi istana orang-orang sibuk mencari siapa yang cocok menyusukan anak itu, karena ia menolak setiap wanita yang hendak menyusukannya. Setelah saudara Musa mengetahui hal ini, dia pun memberanikan diri tampil ke muka dan mengatakan bahwa ia mengetahui seorang wanita yang sehat dan banyak air susunya. Mungkin anak itu mau disusukan oleh wanita tersebut. Wanita itu dari keluarga baik-baik dan anak itu pasti akan dijaga dengan penuh perhatian dan penuh rasa kasih sayang.\n\nDiriwayatkan dari Ibnu 'Abbas bahwa setelah saudara Musa mengucapkan kata-kata itu, lalu ibu Musa dibawa ke istana, mereka memandang kepadanya dengan rasa curiga dan mengemukakan pertanyaan, \"Dari mana engkau tahu bahwa wanita itu akan menjaganya dengan baik dan akan menumpahkan kasih sayang terhadapnya?\" Saudara Musa menjawab, \"Tentu saja ia akan berbuat demikian karena mengharapkan kesenangan hati raja Fir'aun dan mengharapkan pemberian yang banyak darinya.\" Dengan jawaban ini hilanglah kecurigaan mereka. \n\nMusa kemudian dibawa kembali ke rumah ibunya. Sesampainya di rumah, ibunya meletakkan Musa di pangkuannya untuk disusukan. Dengan segera mulut Musa menangkap puting susu ibunya. Mereka yang hadir sangat gembira melihat hal itu dan dikirimlah utusan permaisuri raja untuk memberitakan hal itu. Permaisuri memanggil ibu Musa dan memberinya hadiah dan pemberian yang banyak serta meminta kepadanya supaya ia bersedia tinggal di istana untuk merawat dan mengasuh Musa. Ibu Musa menolak tawaran itu dengan halus dan mengatakan kepada permaisuri bahwa dia mempunyai suami dan anak-anak dan tidak sampai hati meninggalkan mereka. Dia memohon agar permaisuri mengizinkannya membawa Musa ke rumahnya. Permaisuri tidak merasa keberatan atas usul itu dan mengizinkan Musa dibawa ke rumah ibunya. Permaisuri memberinya perongkosan yang cukup. Di samping itu, permaisuri juga memberinya hadiah berupa uang, pakaian, dan lain sebagainya. Akhirnya kembalilah ibu Musa ke rumah membawa anak kandungnya dengan hati yang senang dan gembira.\n\nAllah telah menghilangkan semua kegelisahan dan kekhawatiran ibu Musa dan menggantinya dengan ketenteraman, kemuliaan, dan rezeki yang melimpah dan mengembalikan Musa untuk tinggal bersama ibunya.",
      "text_translation": "Dan dia (ibunya Musa) berkata kepada saudara perempuan Musa, “Ikutilah dia (Musa).” Maka kelihatan olehnya (Musa) dari jauh, sedang mereka tidak menyadarinya.",
      "text": "وَقَالَتْ لِاُخْتِهٖ قُصِّيْهِۗ فَبَصُرَتْ بِهٖ عَنْ جُنُبٍ وَّهُمْ لَا يَشْعُرُوْنَ ۙ",
      "text_translation_en": "And so she said to his sister, “Follow him” - and [the girl] watched him from afar, while they [who had taken him in] were not aware of it,",
      "juz_number": 20
    },
    "12": {
      "text_tafsir_en": "Although Moses' mother had done what God had inspired her to do, her heart was not at peace. Therefore, he had his daughter (Moses' sister) seek the news of Moses. Then Moses' brother went to the coffin containing Moses. Finally he saw from a distance that the box had entered Pharaoh's territory and was interrupted by his family. Although this event was witnessed by many, they were unaware of Moses' presence. In the palace people were busy finding out who was suitable for breastfeeding, as he refused every woman to breastfeed. When Moses' brother learned of this, he dared to look into his face and said he knew a woman who was healthy and had plenty of water. Maybe the child wants to be breastfed by the woman. The woman is from a good family and the child will be cared for with care and affection. Ibn 'Abbas, on the other hand, reported that after Moses' brother spoke these words, Moses' mother was brought to the palace, and they looked at him with suspicion and asked the question, \"Where did you know that the woman would take good care of him and shed his love for her?\" ? \" Moses' brother replied, \"Of course he will do so for the sake of Pharaoh's favor and for his great gift.\" With these answers their suspicion disappeared. Moses was then taken back to his mother's house. When she got home, her mother put Moses on her lap for breastfeeding. Moses' mouth immediately grabbed his mother's nipples. Those present were very pleased to see this and sent an envoy to the king to announce it. The queen summoned Moses' mother and gave her many gifts and gifts and asked her to be ready to stay in the palace to take care of Moses. Moses' mother politely declined the offer and told the empress that she had a husband and children and did not want to leave them. He begged the emperor to allow him to bring Moses to his house. The empress did not mind the proposal and allowed Moses to be brought to his mother's house. The empress gave her enough hugs. In addition, the empress also gave her gifts in money, clothing, and so on. Finally, Moses' mother returned to the house with her happy and happy heart. God removes all of Moses' mother's worries and worries and replaces them with abundant peace, glory, and sustenance and returns Moses to live with his mother.",
      "text_tafsir": "Walaupun ibu Musa telah melaksanakan apa yang diilhamkan Allah kepadanya, namun hatinya belum tenteram. Oleh sebab itu, ia menyuruh anak perempuannya (kakak Musa) mencari-cari berita tentang Musa. Lalu kakak Musa pergi mengikuti peti yang berisi Musa. Akhirnya dia melihat dari kejauhan peti itu telah memasuki kawasan Fir'aun dan disela-matkan keluarganya. Meskipun peristiwa ini disaksikan orang banyak, tetapi mereka tidak menyadari kehadiran Musa di antara mereka. \n\nDi istana orang-orang sibuk mencari siapa yang cocok menyusukan anak itu, karena ia menolak setiap wanita yang hendak menyusukannya. Setelah saudara Musa mengetahui hal ini, dia pun memberanikan diri tampil ke muka dan mengatakan bahwa ia mengetahui seorang wanita yang sehat dan banyak air susunya. Mungkin anak itu mau disusukan oleh wanita tersebut. Wanita itu dari keluarga baik-baik dan anak itu pasti akan dijaga dengan penuh perhatian dan penuh rasa kasih sayang.\n\nDiriwayatkan dari Ibnu 'Abbas bahwa setelah saudara Musa mengucapkan kata-kata itu, lalu ibu Musa dibawa ke istana, mereka memandang kepadanya dengan rasa curiga dan mengemukakan pertanyaan, \"Dari mana engkau tahu bahwa wanita itu akan menjaganya dengan baik dan akan menumpahkan kasih sayang terhadapnya?\" Saudara Musa menjawab, \"Tentu saja ia akan berbuat demikian karena mengharapkan kesenangan hati raja Fir'aun dan mengharapkan pemberian yang banyak darinya.\" Dengan jawaban ini hilanglah kecurigaan mereka. \n\nMusa kemudian dibawa kembali ke rumah ibunya. Sesampainya di rumah, ibunya meletakkan Musa di pangkuannya untuk disusukan. Dengan segera mulut Musa menangkap puting susu ibunya. Mereka yang hadir sangat gembira melihat hal itu dan dikirimlah utusan permaisuri raja untuk memberitakan hal itu. Permaisuri memanggil ibu Musa dan memberinya hadiah dan pemberian yang banyak serta meminta kepadanya supaya ia bersedia tinggal di istana untuk merawat dan mengasuh Musa. Ibu Musa menolak tawaran itu dengan halus dan mengatakan kepada permaisuri bahwa dia mempunyai suami dan anak-anak dan tidak sampai hati meninggalkan mereka. Dia memohon agar permaisuri mengizinkannya membawa Musa ke rumahnya. Permaisuri tidak merasa keberatan atas usul itu dan mengizinkan Musa dibawa ke rumah ibunya. Permaisuri memberinya perongkosan yang cukup. Di samping itu, permaisuri juga memberinya hadiah berupa uang, pakaian, dan lain sebagainya. Akhirnya kembalilah ibu Musa ke rumah membawa anak kandungnya dengan hati yang senang dan gembira.\n\nAllah telah menghilangkan semua kegelisahan dan kekhawatiran ibu Musa dan menggantinya dengan ketenteraman, kemuliaan, dan rezeki yang melimpah dan mengembalikan Musa untuk tinggal bersama ibunya.",
      "text_translation": "Dan Kami cegah dia (Musa) menyusu kepada perempuan-perempuan yang mau menyusui(nya) sebelum itu; maka berkatalah dia (saudaranya Musa), “Maukah aku tunjukkan kepadamu, keluarga yang akan memeliharanya untukmu dan mereka dapat berlaku baik padanya?”",
      "text": "۞ وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ مِنْ قَبْلُ فَقَالَتْ هَلْ اَدُلُّكُمْ عَلٰٓى اَهْلِ بَيْتٍ يَّكْفُلُوْنَهٗ لَكُمْ وَهُمْ لَهٗ نَاصِحُوْنَ ",
      "text_translation_en": "Now from the very beginning We caused him to refuse the breast of [Egyptian] nurses; and [when his sister came to know this,] she said: “Shall I guide you to a family that might rear him for you, and look after him with good will?”",
      "juz_number": 20
    },
    "13": {
      "text_tafsir_en": "This verse explains that the promise of God to Moses' mother was fulfilled, which was to bring her back to him so that her heart could rest and not be sad. In the same way, God kept His promise to appoint Moses, but most of the people did not. Who would have thought that a child who was destined to die because he was the son of the Children of Israel would be loved and raised in the palace with love and love in the hope that he would grow up as he grew up. However, it turns out that the child would become an apostle and oppose Pharaoh's power, even overthrowing the kingdom itself.",
      "text_tafsir": "Ayat ini menerangkan bahwa janji Allah kepada ibu Musa telah terlaksana yaitu mengembalikan Musa kepadanya supaya hatinya menjadi tenteram dan tidak lagi merasa sedih. Demikian pula Allah telah menepati janji-Nya untuk mengangkat Musa menjadi rasul, tetapi kebanyakan manusia tidak mengetahuinya. Siapa yang mengira bahwa seorang anak yang telah diincar maut karena dia anak dari Bani Israil kemudian disayangi dan diasuh dalam istana dengan penuh rasa cinta dan kasih dengan harapan dia akan berjasa bila dia dewasa. Akan tetapi, ternyata anak itu akan menjadi rasul dan menentang kekuasaan Fir'aun, bahkan meruntuhkan kerajaan itu sendiri.",
      "text_translation": "Maka Kami kembalikan dia (Musa) kepada ibunya, agar senang hatinya dan tidak bersedih hati, dan agar dia mengetahui bahwa janji Allah adalah benar, tetapi kebanyakan mereka tidak mengetahuinya.",
      "text": "فَرَدَدْنٰهُ اِلٰٓى اُمِّهٖ كَيْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ اَنَّ وَعْدَ اللّٰهِ حَقٌّ وَّلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ ࣖ",
      "text_translation_en": "And thus We restored him to his mother, so that her eye might he gladdened, and that she might grieve no longer, and that she might know that God’s promise always comes true - even though most of them know it not!",
      "juz_number": 20
    },
    "14": {
      "text_tafsir_en": "In these verses it is explained that as an adult, God gave Moses knowledge and wisdom because of his obedience and obedience to God and his patience through various trials. It is natural that when Moses learned from his mother how he came to be living in the palace of the king Pharaoh, when he was just a regular kid from the Children of Israel were always despised and enslaved by the Pharaoh and his people. This would have led to the sympathy of Moses to the Children of Israel even though Pharaoh had been educating and nurturing from childhood to being a healthy adult both physically and mentally. The feeling of sympathy for relatives and people was an inseparable instinct for one, especially from Moses who daily saw the Children of Israel oppressed and persecuted by the Qibthi people of Egypt. However, thanks to his patience, as a gift of God, he was able to hold back his heart until God provided a way for him to lift his people from the valley of humiliation and suffering. Because of his patience, kindness and behavior, and his adherence to religious teachings, Moses was blessed with God of knowledge and wisdom in preparation for his appointment as an apostle. He was sent to deliver the leaflets of God to his people and Pharaoh, who was very arrogant, arrogant, and elevated himself as a god.",
      "text_tafsir": "Pada ayat-ayat ini diterangkan bahwa setelah dewasa, Allah mengaruniakan kepada Musa ilmu dan hikmah karena ketaatan dan kepatuhannya kepada Tuhan serta kesabarannya menghadapi berbagai cobaan. Sudah sewajarnyalah bila Musa mengetahui dari ibunya bagaimana ia sampai dapat tinggal di istana keluarga raja Fir'aun, padahal ia hanya anak orang biasa dari Bani Israil yang selalu dihina dan diperhamba oleh Fir'aun dan kaumnya. Hal ini akan menimbulkan simpati Musa kepada Bani Israil walaupun Fir'aun telah berjasa mendidik dan mengasuhnya semenjak kecil sampai menjadi seorang laki-laki dewasa yang sehat wal afiat, baik fisik maupun mentalnya.\n\nRasa simpati kepada kerabat dan kaumnya adalah naluri yang tidak dapat dipisahkan dari jiwa seseorang, apalagi dari diri Musa yang setiap hari melihat Bani Israil ditindas dan dianiaya oleh orang-orang Qibthi penduduk negeri Mesir. Akan tetapi, berkat kesabaran yang dimilikinya, sebagai karunia Allah, ia dapat menahan hatinya sampai Allah memberikan jalan baginya untuk mengangkat kaumnya dari lembah kehinaan dan penderitaan. Karena kesabaran, kebaikan budi dan tingkah laku, serta kepatuhannya menjalankan ajaran agama, Musa dikaruniai Allah ilmu dan hikmah sebagai persiapan untuk diangkat menjadi rasul. Ia diutus untuk menyampaikan risalah Allah kepada kaumnya dan Fir'aun yang sangat sombong, takabur, dan mengangkat dirinya sebagai tuhan.",
      "text_translation": "Dan setelah dia (Musa) dewasa dan sempurna akalnya, Kami anugerahkan kepadanya hikmah (kenabian) dan pengetahuan. Dan demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "text": "وَلَمَّا بَلَغَ اَشُدَّهٗ وَاسْتَوٰىٓ اٰتَيْنٰهُ حُكْمًا وَّعِلْمًاۗ وَكَذٰلِكَ نَجْزِى الْمُحْسِنِيْنَ ",
      "text_translation_en": "Now when [Moses] reached full manhood and had become mature [of mind]. We bestowed upon him the ability to judge [between right and wrong] as well as [innate] knowledge: for thus do We reward the doers of good.",
      "juz_number": 20
    },
    "15": {
      "text_tafsir_en": "One day Moses went into the city without anyone knowing it, while the people were sleeping during the day after the time of Zuhur. There he saw two fighting men, one from the Children of Israel and the other from the native land of Egypt whom he considered to be enemies for always insulting and defaming the Children of Israel. People from the Children of Israel shouted for help to escape the cruelty of their enemies. Encouraged by the fanatics of his people, Moses quickly hunted down the Egyptians. Out of anger and without thinking of the consequences of his actions, Moses struck the Egyptians with all his might. As a result of the blow, the Egyptian collapsed and died. Moses did not intend to kill him at all, but he died in one blow. Moses was very sorry for his appearance and considered his actions to be wrong, so much so. He told himself that his work was a demonic act that had always deceived mankind into doing evil and evil. Indeed, he has fallen into the trap of the devil who is the enemy of man and constantly strives to deceive him.",
      "text_tafsir": "Pada suatu hari, Musa menyelinap masuk ke kota tanpa diketahui orang banyak, ketika orang-orang sedang tidur siang hari sesudah waktu Zuhur. Di sana ia melihat dua orang sedang berkelahi, yang seorang dari kaum Bani Israil dan seorang lagi dari penduduk asli negeri Mesir yang dianggapnya sebagai musuh karena selalu menghina dan menganggap rendah golongan Bani Israil. Orang yang berasal dari Bani Israil berteriak meminta tolong untuk melepaskan diri dari kekejaman lawannya.\n\nDidorong rasa fanatik kepada kaumnya, dengan cepat Musa memburu orang Mesir itu. Karena amarah dan tanpa memikirkan akibat perbuatannya, Musa memukul orang Mesir itu dengan sekuat tenaga. Akibat pukulan itu, orang Mesir itu roboh seketika dan mati. Sebenarnya Musa tidak berniat sama sekali hendak membunuhnya, tetapi ternyata orang itu mati hanya dengan sekali pukulan saja. Musa amat menyesal atas ketelanjurannya dan menganggap tindakannya itu salah, tindakan yang tergopoh-gopoh. Dia berkata kepada dirinya sendiri bahwa perbuatannya adalah perbuatan setan yang selalu memperdayakan manusia agar melakukan kezaliman dan maksiat. Sesungguhnya ia telah terperosok masuk perangkap setan yang menjadi musuh manusia dan selalu berusaha untuk menyesatkannya.",
      "text_translation": "Dan dia (Musa) masuk ke kota (Memphis) ketika penduduknya sedang lengah, maka dia mendapati di dalam kota itu dua orang laki-laki sedang berkelahi; yang seorang dari golongannya (Bani Israil) dan yang seorang (lagi) dari pihak musuhnya (kaum Fir‘aun). Orang yang dari golongannya meminta pertolongan kepadanya, untuk (mengalahkan) orang yang dari pihak musuhnya, lalu Musa meninjunya, dan matilah musuhnya itu. Dia (Musa) berkata, “Ini adalah perbuatan setan. Sungguh, dia (setan itu) adalah musuh yang jelas menyesatkan.”",
      "text": "وَدَخَلَ الْمَدِيْنَةَ عَلٰى حِيْنِ غَفْلَةٍ مِّنْ اَهْلِهَا فَوَجَدَ فِيْهَا رَجُلَيْنِ يَقْتَتِلٰنِۖ هٰذَا مِنْ شِيْعَتِهٖ وَهٰذَا مِنْ عَدُوِّهٖۚ فَاسْتَغَاثَهُ الَّذِيْ مِنْ شِيْعَتِهٖ عَلَى الَّذِيْ مِنْ عَدُوِّهٖ ۙفَوَكَزَهٗ مُوْسٰى فَقَضٰى عَلَيْهِۖ قَالَ هٰذَا مِنْ عَمَلِ الشَّيْطٰنِۗ اِنَّهٗ عَدُوٌّ مُّضِلٌّ مُّبِيْنٌ ",
      "text_translation_en": "And [one day] he entered the city at a time when [most of] its people were [resting in their houses,] unaware of what was going on [in the streets]; and there he encountered two men fighting with one another - one of his own people, and the other of his enemies. And the one who belonged to his own people cried out to him for help against him who was of his enemies - whereupon Moses struck him down with his fist, and [thus] brought about his end. [But then] he said [to himself]: “This is of Satan’s doing! Verily, he is an open foe, leading [man] astray!”",
      "juz_number": 20
    },
    "16": {
      "text_tafsir_en": "In this verse it is explained that when he realized his guilt, Moses begged God for forgiveness, saying, \"Indeed I have persecuted myself by murdering an innocent person. . \" God is Oft-Forgiving, Most Merciful to His servants, forgiving Moses. With that forgiveness, Moses' heart became calm and free from anxiety and trouble thinking of his fate by committing sin. Indeed, forgiveness is the mercy and grace of God. Of the gift of God to Moses it is stated in His word: And thou hast slain a man, and We have delivered thee out of great trouble; (thaha \/ 20:40) Moses promised that he would never do that again and would not be a helper to the wrongdoer. Especially the help will result in persecution or murder and self-harm.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa di saat menyadari kesalahannya, Musa memohon ampun kepada Tuhan, seraya berkata, \"Sesungguhnya aku telah menganiaya diriku sendiri dengan melakukan pembunuhan terhadap orang yang tidak boleh dibunuh. Maka ampunilah dosaku dan janganlah Engkau siksa aku karena perbuatan yang tidak kusengaja itu.\" Allah Yang Maha Pengampun dan Maha Penyayang terhadap hamba-Nya, mengampuni kesalahan Musa. Dengan pengampunan itu, hati Musa menjadi tenteram dan bebas dari kebimbangan dan kesusahan memikirkan nasibnya karena melakukan perbuatan dosa. Sesungguhnya pengampunan itu adalah rahmat dan karunia Allah. Di antara karunia Allah kepada Musa disebutkan dalam firman-Nya:\n\nDan engkau pernah membunuh seseorang, lalu Kami selamatkan engkau dari kesulitan (yang besar) dan Kami telah mencobamu dengan beberapa cobaan (yang berat). (thaha\/20: 40)\n\nMusa berjanji tidak akan melakukan kesalahan itu lagi dan tidak akan menjadi penolong bagi orang yang melakukan kesalahan. Apalagi pertolongan itu akan menyebabkan penganiayaan atau pembunuhan dan mencelakakan diri sendiri.",
      "text_translation": "Dia (Musa) berdoa, “Ya Tuhanku, sesungguhnya aku telah menzalimi diriku sendiri, maka ampunilah aku.” Maka Dia (Allah) mengampuninya. Sungguh, Allah, Dialah Yang Maha Pengampun, Maha Penyayang.",
      "text": "قَالَ رَبِّ اِنِّيْ ظَلَمْتُ نَفْسِيْ فَاغْفِرْ لِيْ فَغَفَرَ لَهٗ ۗاِنَّهٗ هُوَ الْغَفُوْرُ الرَّحِيْمُ ",
      "text_translation_en": "[And] he prayed: O my Sustainer! Verily, I have sinned against myself! Grant me, then, Thy forgiveness!” And He forgave him - for, verily, He alone is truly forgiving, a dispenser of grace.",
      "juz_number": 20
    },
    "17": {
      "text_tafsir_en": "In this verse it is explained that when he realized his guilt, Moses begged God for forgiveness, saying, \"Indeed I have persecuted myself by murdering an innocent person. . \" God is Oft-Forgiving, Most Merciful to His servants, forgiving Moses. With that forgiveness, Moses' heart became calm and free from anxiety and trouble thinking of his fate by committing sin. Indeed, forgiveness is the mercy and grace of God. Of the gift of God to Moses it is stated in His word: And thou hast slain a man, and We have delivered thee out of great trouble; (thaha \/ 20:40) Moses promised that he would never do that again and would not be a helper to the wrongdoer. Especially the help will result in persecution or murder and self-harm.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa di saat menyadari kesalahannya, Musa memohon ampun kepada Tuhan, seraya berkata, \"Sesungguhnya aku telah menganiaya diriku sendiri dengan melakukan pembunuhan terhadap orang yang tidak boleh dibunuh. Maka ampunilah dosaku dan janganlah Engkau siksa aku karena perbuatan yang tidak kusengaja itu.\" Allah Yang Maha Pengampun dan Maha Penyayang terhadap hamba-Nya, mengampuni kesalahan Musa. Dengan pengampunan itu, hati Musa menjadi tenteram dan bebas dari kebimbangan dan kesusahan memikirkan nasibnya karena melakukan perbuatan dosa. Sesungguhnya pengampunan itu adalah rahmat dan karunia Allah. Di antara karunia Allah kepada Musa disebutkan dalam firman-Nya:\n\nDan engkau pernah membunuh seseorang, lalu Kami selamatkan engkau dari kesulitan (yang besar) dan Kami telah mencobamu dengan beberapa cobaan (yang berat). (thaha\/20: 40)\n\nMusa berjanji tidak akan melakukan kesalahan itu lagi dan tidak akan menjadi penolong bagi orang yang melakukan kesalahan. Apalagi pertolongan itu akan menyebabkan penganiayaan atau pembunuhan dan mencelakakan diri sendiri.",
      "text_translation": "Dia (Musa) berkata, “Ya Tuhanku! Demi nikmat yang telah Engkau anugerahkan kepadaku, maka aku tidak akan menjadi penolong bagi orang-orang yang berdosa.”",
      "text": "قَالَ رَبِّ بِمَآ اَنْعَمْتَ عَلَيَّ فَلَنْ اَكُوْنَ ظَهِيْرًا لِّلْمُجْرِمِيْنَ ",
      "text_translation_en": "Said he: “O my Sustainer! [I vow] by all the blessings which Thou hast bestowed on me: Never­more shall I aid such as are lost in sin!”",
      "juz_number": 20
    },
    "18": {
      "text_tafsir_en": "God's forgiveness has made his heart full and free, but what about the indigenous people of Egypt where he lived among them? Will they just let it go if they find out the murder? This is what disturbs the peace of Moses' heart and is always a burden to his mind. So Moses secretly seeks to find out what his actions are known to the people, and when they find out, how do they react? What action will they take against him? As he walked down the city, he saw his first aid and shouted for help to help him against another Egyptian. Apparently the man he had helped before was again involved in a fight with other Egyptians. Perhaps the man asked him to kill the Egyptian as he had killed him before. It shows in his brain how he was guilty of the murder, but God in his mercy and mercy has forgiven him. Will he make a mistake again, yet he has promised his Lord that he will never do it again. So Moses told the Israelites that he was a pervert. However, it also reflected in his mind how the fate of his people was humiliated and persecuted by the Egyptians, so his anger rose and he almost attacked the Egyptian. But before he could attack, the Egyptian slapped him, saying that he would kill him just as he killed his friend yesterday? Apparently that person already knew Moses' face because people in the city were talking about the murder and the culprit. Then the Egyptians shouted, \"You have acted justly in the land. You are not one of those who do good.\" With that in mind, Moses realized and remembered his promise that he would never repeat his mistake so that he would not hit the man. In the opinion of some of the infidels who spoke these words to Moses it was not the Egyptians but the Israelites he had helped, because Moses accused him of being a pervert and wanted to beat him.",
      "text_tafsir": "Pengampunan Allah telah menjadikan hatinya lega dan lapang, tetapi bagaimana dengan penduduk asli Mesir di mana ia hidup di kalangan mereka? Apakah mereka akan membiarkan saja bila pembunuhan itu mereka ketahui? Inilah yang sangat mengganggu ketenteraman hati Musa dan selalu menjadi beban pikirannya. Oleh sebab itu, dengan sembunyi-sembunyi Musa mencari informasi apakah perbuatannya itu telah diketahui orang, dan bila mereka telah mengetahuinya, bagaimana sikap mereka? Tindakan apakah yang akan mereka ambil terhadapnya? \n\nKetika ia menyusuri kota itu, kelihatan olehnya orang yang ditolong dahulu dan berteriak lagi minta tolong agar ia membantunya sekali lagi melawan orang Mesir yang lain. Rupanya orang yang ditolongnya dahulu itu kembali terlibat dalam perkelahian dengan orang Mesir lainnya. Mungkin orang itu meminta kepadanya supaya ia membunuh orang Mesir itu sebagaimana ia telah membunuh dahulu. Tergambarlah dalam otaknya bagaimana ia telah dosa dengan pembunuhan itu, tetapi Tuhan dengan rahmat dan kasih sayang-Nya, telah mengampuni kesalahannya. Apakah ia akan berbuat kesalahan lagi, apalagi ia telah berjanji dengan Tuhannya bahwa dia tidak akan mengulangi lagi perbuatan itu. \n\nOleh sebab itu, Musa berkata kepada orang Israil itu bahwa ia adalah orang yang sesat. Akan tetapi, tergambar pula dalam pikirannya bagaimana nasib kaumnya yang terhina dan selalu dianiaya oleh orang-orang Mesir, maka bangkit pulalah rasa amarahnya dan hampir saja ia menyerang orang Mesir itu. Namun sebelum ia menyerang, orang Mesir itu membentaknya dengan mengatakan apakah ia hendak membunuhnya seperti ia membunuh kawannya kemarin? Rupanya orang itu sudah mengenali wajah Musa karena orang-orang di kota ramai membicarakan pembunuhan itu dan pelakunya. \n\nKemudian orang Mesir itu membentaknya dan mengatakan, \"Sesungguhnya engkau telah bertindak sewenang-wenang di muka bumi. Engkau bukanlah termasuk orang-orang yang berbuat baik.\" Dengan bentakan itu, Musa sadar dan ingat akan janjinya bahwa dia tidak akan mengulangi kesalahannya lagi sehingga dia tidak jadi memukul orang itu.\n\nMenurut pendapat sebagian mufasir yang mengucapkan kata-kata tersebut kepada Musa bukanlah orang Mesir tetapi orang Israil yang telah ditolongnya, karena Musa menuduhnya sebagai orang yang sesat dan hendak memukulnya.",
      "text_translation": "Karena itu, dia (Musa) menjadi ketakutan berada di kota itu sambil menunggu (akibat perbuatannya), tiba-tiba orang yang kemarin meminta pertolongan berteriak meminta pertolongan kepadanya. Musa berkata kepadanya, “Engkau sungguh, orang yang nyata-nyata sesat.”",
      "text": "فَاَصْبَحَ فِى الْمَدِيْنَةِ خَاۤىِٕفًا يَّتَرَقَّبُ فَاِذَا الَّذِى اسْتَنْصَرَهٗ بِالْاَمْسِ يَسْتَصْرِخُهٗ ۗقَالَ لَهٗ مُوْسٰٓى اِنَّكَ لَغَوِيٌّ مُّبِيْنٌ ",
      "text_translation_en": "And next morning he found himself in the city, looking fearfully about him, when lo! the one who had sought his help the day before [once again] cried out to him [for help whereupon] Moses said unto him: “Behold, thou art indeed, most clearly, deeply in the wrong!",
      "juz_number": 20
    },
    "19": {
      "text_tafsir_en": "God's forgiveness has made his heart full and free, but what about the indigenous people of Egypt where he lived among them? Will they just let it go if they find out the murder? This is what disturbs the peace of Moses' heart and is always a burden to his mind. So Moses secretly seeks to find out what his actions are known to the people, and when they find out, how do they react? What action will they take against him? As he walked down the city, he saw his first aid and shouted for help to help him against another Egyptian. Apparently the man he had helped before was again involved in a fight with other Egyptians. Perhaps the man asked him to kill the Egyptian as he had killed him before. It shows in his brain how he was guilty of the murder, but God in his mercy and mercy has forgiven him. Will he make a mistake again, yet he has promised his Lord that he will never do it again. So Moses told the Israelites that he was a pervert. However, it also reflected in his mind how the fate of his people was humiliated and persecuted by the Egyptians, so his anger rose and he almost attacked the Egyptian. But before he could attack, the Egyptian slapped him, saying that he would kill him just as he killed his friend yesterday? Apparently that person already knew Moses' face because people in the city were talking about the murder and the culprit. Then the Egyptians shouted, \"You have acted justly in the land. You are not one of those who do good.\" With that in mind, Moses realized and remembered his promise that he would never repeat his mistake so that he would not hit the man. In the opinion of some of the infidels who spoke these words to Moses it was not the Egyptians but the Israelites he had helped, because Moses accused him of being a pervert and wanted to beat him.",
      "text_tafsir": "Pengampunan Allah telah menjadikan hatinya lega dan lapang, tetapi bagaimana dengan penduduk asli Mesir di mana ia hidup di kalangan mereka? Apakah mereka akan membiarkan saja bila pembunuhan itu mereka ketahui? Inilah yang sangat mengganggu ketenteraman hati Musa dan selalu menjadi beban pikirannya. Oleh sebab itu, dengan sembunyi-sembunyi Musa mencari informasi apakah perbuatannya itu telah diketahui orang, dan bila mereka telah mengetahuinya, bagaimana sikap mereka? Tindakan apakah yang akan mereka ambil terhadapnya? \n\nKetika ia menyusuri kota itu, kelihatan olehnya orang yang ditolong dahulu dan berteriak lagi minta tolong agar ia membantunya sekali lagi melawan orang Mesir yang lain. Rupanya orang yang ditolongnya dahulu itu kembali terlibat dalam perkelahian dengan orang Mesir lainnya. Mungkin orang itu meminta kepadanya supaya ia membunuh orang Mesir itu sebagaimana ia telah membunuh dahulu. Tergambarlah dalam otaknya bagaimana ia telah dosa dengan pembunuhan itu, tetapi Tuhan dengan rahmat dan kasih sayang-Nya, telah mengampuni kesalahannya. Apakah ia akan berbuat kesalahan lagi, apalagi ia telah berjanji dengan Tuhannya bahwa dia tidak akan mengulangi lagi perbuatan itu. \n\nOleh sebab itu, Musa berkata kepada orang Israil itu bahwa ia adalah orang yang sesat. Akan tetapi, tergambar pula dalam pikirannya bagaimana nasib kaumnya yang terhina dan selalu dianiaya oleh orang-orang Mesir, maka bangkit pulalah rasa amarahnya dan hampir saja ia menyerang orang Mesir itu. Namun sebelum ia menyerang, orang Mesir itu membentaknya dengan mengatakan apakah ia hendak membunuhnya seperti ia membunuh kawannya kemarin? Rupanya orang itu sudah mengenali wajah Musa karena orang-orang di kota ramai membicarakan pembunuhan itu dan pelakunya. \n\nKemudian orang Mesir itu membentaknya dan mengatakan, \"Sesungguhnya engkau telah bertindak sewenang-wenang di muka bumi. Engkau bukanlah termasuk orang-orang yang berbuat baik.\" Dengan bentakan itu, Musa sadar dan ingat akan janjinya bahwa dia tidak akan mengulangi kesalahannya lagi sehingga dia tidak jadi memukul orang itu.\n\nMenurut pendapat sebagian mufasir yang mengucapkan kata-kata tersebut kepada Musa bukanlah orang Mesir tetapi orang Israil yang telah ditolongnya, karena Musa menuduhnya sebagai orang yang sesat dan hendak memukulnya.",
      "text_translation": "Maka ketika dia (Musa) hendak memukul dengan keras orang yang menjadi musuh mereka berdua, dia (musuhnya) berkata, “Wahai Musa! Apakah engkau bermaksud membunuhku, sebagaimana kemarin engkau membunuh seseorang? Engkau hanya bermaksud menjadi orang yang berbuat sewenang-wenang di negeri (ini), dan engkau tidak bermaksud menjadi salah seorang dari orang-orang yang mengadakan perdamaian.”",
      "text": "فَلَمَّآ اَنْ اَرَادَ اَنْ يَّبْطِشَ بِالَّذِيْ هُوَ عَدُوٌّ لَّهُمَاۙ قَالَ يٰمُوْسٰٓى اَتُرِيْدُ اَنْ تَقْتُلَنِيْ كَمَا قَتَلْتَ نَفْسًاۢ بِالْاَمْسِۖ اِنْ تُرِيْدُ اِلَّآ اَنْ تَكُوْنَ جَبَّارًا فِى الْاَرْضِ وَمَا تُرِيْدُ اَنْ تَكُوْنَ مِنَ الْمُصْلِحِيْنَ ",
      "text_translation_en": "But then as soon as he was about to lay violent hands on the man who was their [common] enemy, the latter exclaimed: “O Moses, dost thou intend to slay me as thou didst slay another man yesterday? Thy sole aim is to become a tyrant in this land, for thou dost not care to be of those who would set things to rights!”",
      "juz_number": 20
    },
    "20": {
      "text_tafsir_en": "In this verse, God explains that a man of the Pharaohs, sympathetic to Moses, attended the consultation held by Pharaoh with his leaders. In the deliberations it was decided that Moses should be killed. The man who was at the meeting came to see Moses to tell him the evil plan, because he was very sympathetic and respectful. He asked Moses to leave Egypt immediately. Otherwise, he might be caught and killed as they are preparing a secret army to besiege and capture him. He told Moses everything he was talking about was true and he advised Moses to run away immediately. That advice really came from his heartfelt heart for Moses' own safety.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa seorang laki-laki dari kaum Fir'aun, yang bersimpati kepada Musa, ikut menghadiri musyawarah yang diadakan Fir'aun bersama pembesar-pembesarnya. Dalam musyawarah diputuskan bahwa Musa harus dibunuh. Orang laki-laki yang ikut musyawarah tersebut datang menjumpai Musa untuk memberitahukan kepadanya rencana jahat itu, karena ia sangat bersimpati dan hormat kepadanya. Ia minta supaya Musa segera meninggalkan Mesir. Kalau tidak, mungkin ia akan tertangkap dan dibunuh karena mereka sedang menyiapkan tentara rahasia untuk mengepung dan menangkapnya. Ia menyatakan kepada Musa semua yang dibicarakannya itu adalah benar dan ia menasihati Musa agar lari dengan segera. Nasihat itu benar-benar timbul dari hatinya yang ikhlas demi keselamatan Musa sendiri.",
      "text_translation": "Dan seorang laki-laki datang bergegas dari ujung kota seraya berkata, “Wahai Musa! Sesungguhnya para pembesar negeri sedang berunding tentang engkau untuk membunuhmu, maka keluarlah (dari kota ini), sesungguhnya aku termasuk orang-orang yang memberi nasihat kepadamu.”",
      "text": "وَجَاۤءَ رَجُلٌ مِّنْ اَقْصَى الْمَدِيْنَةِ يَسْعٰىۖ قَالَ يٰمُوْسٰٓى اِنَّ الْمَلَاَ يَأْتَمِرُوْنَ بِكَ لِيَقْتُلُوْكَ فَاخْرُجْ اِنِّيْ لَكَ مِنَ النّٰصِحِيْنَ ",
      "text_translation_en": "And [then and there] a man came running from the farthermost end of the city, and said: “O Moses! Behold, the great ones [of the kingdom] are deli­berating upon thy case with a view to killing thee! Begone, then: verily, I am of those who wish thee well!”",
      "juz_number": 20
    },
    "21": {
      "text_tafsir_en": "Hearing the advice given by the man and seeing his honesty and sincerity, Moses immediately set out on alert, for behind him some Pharaoh's soldiers were ready to lay siege to him. How heavy the pressure of Moses must have been. Nevertheless, he kept trying to save himself and prayed to God, \"O my almighty, merciful and merciful God, deliver me from the clutches of the oppressed Pharaoh. God answered his prayer and showed him the way to Mahay. According to history, Pharaoh ordered his army to chase Moses down the narrow streets and forbade them from the road because he was convinced that Moses would not be able to go that way.",
      "text_tafsir": "Mendengar nasihat yang dikemukakan oleh orang itu dan melihat sikapnya yang menampakkan kejujuran dan keikhlasan, dengan segera Musa berangkat dalam keadaan selalu waspada, karena di belakangnya beberapa orang tentara Fir‘aun telah siap-siap untuk mengepung dan menangkapnya. Alangkah beratnya tekanan yang diderita Musa. Walaupun demikian, ia tetap berusaha menyelamatkan dirinya dan berdoa kepada Allah, “Hai Tuhanku Yang Mahakuasa, Yang Maha Pengasih lagi Maha Penyayang, bebaskanlah aku dari cengkeraman kaum Fir‘aun yang aniaya. Allah mengabulkan doanya dan menunjukkannya jalan menuju Madyan.\n\nMenurut riwayat, Fir‘aun memerintahkan kepada tentaranya supaya mengejar Musa sampai ke jalan-jalan kecil dan melarang mereka melalui jalan raya karena ia yakin bahwa Musa tidak mungkin akan menempuh jalan itu.",
      "text_translation": "Maka keluarlah dia (Musa) dari kota itu dengan rasa takut, waspada (kalau ada yang menyusul atau menangkapnya), dia berdoa, “Ya Tuhanku, selamatkanlah aku dari orang-orang yang zalim itu.”",
      "text": "فَخَرَجَ مِنْهَا خَاۤىِٕفًا يَّتَرَقَّبُ ۖقَالَ رَبِّ نَجِّنِيْ مِنَ الْقَوْمِ الظّٰلِمِيْنَ ࣖ ",
      "text_translation_en": "So he went forth from thence, looking fearfully about him, and prayed: “O my Sustainer! Save me from all evildoing folk!”",
      "juz_number": 20
    },
    "22": {
      "text_tafsir_en": "After Musa learned that the road he was on was the normal road for people to get to Madyan, he was sure that he would not get lost in that vast desert. Moreover, he had prayed to his Lord to always be shown to the straight path. However, even though the road he was on was a road that people usually traveled, the distance he had to travel was very far, whereas he did not bring provisions because he was in a hurry to leave the city of Egypt. It is reported that Moses walked for eight days and eight nights, without food and with bare feet. There is nothing to eat except wood leaves. However, his heart remained steadfast and his spirit remained burning because he escaped from the pursuit of Pharaoh. He survived the trap of Pharaoh in his childhood, even though many baby boys from the Children of Israel were killed, and now he has been free from the pursuit of Pharaoh when he was an adult. All of that is due to God's grace and protection. Therefore, he believes in the long and difficult journey, he will remain in His protection.",
      "text_tafsir": "Setelah Musa mengetahui bahwa jalan yang ditempuhnya itu adalah jalan yang biasa dilalui orang menuju ke Madyan, ia yakin bahwa ia tidak akan tersesat menempuh padang pasir yang luas itu. Apalagi ia telah berdoa kepada Tuhannya agar selalu ditunjuki ke jalan yang lurus. Akan tetapi, walaupun jalan yang ditempuhnya itu adalah jalan raya yang biasa dilalui orang, namun jarak yang harus ditempuhnya sangat jauh sekali, sedangkan dia tidak membawa bekal karena ia tergesa-gesa meninggalkan kota Mesir.\n\nDiriwayatkan bahwa Musa berjalan selama delapan hari delapan malam, tanpa makanan dan dengan kaki telanjang. Tak ada yang bisa dimakan kecuali daun-daun kayu. Namun demikian, hatinya tetap tabah dan semangatnya tetap membaja karena ia luput dari kejaran Fir'aun. Dia telah selamat dari jebakan Fir'aun di waktu kecilnya, padahal banyak bayi laki-laki dari Bani Israil mati dibunuh, dan sekarang ia telah bebas dari kejaran Fir'aun di waktu ia sudah dewasa. Semua itu adalah karena rahmat dan lindungan Allah. Oleh karena itu, ia yakin dalam perjalanan yang jauh dan sulit itu, ia akan tetap berada dalam lindungan-Nya.",
      "text_translation": "Dan ketika dia menuju ke arah negeri Madyan dia berdoa lagi, “Mudah-mudahan Tuhanku memimpin aku ke jalan yang benar.”",
      "text": "وَلَمَّا تَوَجَّهَ تِلْقَاۤءَ مَدْيَنَ قَالَ عَسٰى رَبِّيْٓ اَنْ يَّهْدِيَنِيْ سَوَاۤءَ السَّبِيْلِ ",
      "text_translation_en": "And as he turned his face towards Madyan, he said [to himself]: “It may well be that my Sustainer will [thus] guide me onto the right path”",
      "juz_number": 20
    },
    "23": {
      "text_tafsir_en": "In this verse it is explained that at last Moses came to a fountain in the city of Maroon. He saw people in the crowd hurrying to fetch water and feed their livestock. Somewhere down the line, it appeared that two girls were holding and holding her goat's cord, always looking forward to the men taking water because it was so thirsty. Seeing this, he felt pity in Moses' heart, and he approached the two girls to ask why they did not go with the crowds to draw water and feed their goats. They said, \"We cannot fetch water unless the people are all done with it, because we are not strong enough to push and push the crowd. we had to wait for the people to leave and we could only fetch water, if there was any water left. \"",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa pada akhirnya sampailah Musa ke sebuah sumber mata air di kota Madyan. Dilihatnya di sana orang-orang sedang ramai berdesak-desakan mengambil air dan memberi minum binatang ternak mereka. Di tempat yang agak rendah, tampak olehnya dua orang gadis memegang dan menahan tali kambingnya yang selalu hendak maju ke arah orang-orang yang mengambil air karena sudah sangat haus. Melihat hal itu, timbullah rasa kasihan dalam hati Musa, lalu ia dekati kedua gadis itu hendak menanyakan mengapa tidak ikut bersama orang banyak mengambil air dan memberi minum kambing mereka. Keduanya menjawab, \"Kami tidak dapat mengambil air kecuali orang-orang itu semuanya telah selesai mengambilnya, karena kami tidak kuat berebut dan berdesak-desakan dengan orang banyak. Bapak kami sudah sangat tua, sehingga tidak sanggup datang ke mari untuk mengambil air. Itulah sebabnya kami terpaksa menunggu orang-orang itu pergi dan kami hanya dapat mengambil air, jika ada sisa-sisa air yang ditinggalkan mereka.\"",
      "text_translation": "Dan ketika dia sampai di sumber air negeri Madyan, dia menjumpai di sana sekumpulan orang yang sedang memberi minum (ternaknya), dan dia menjumpai di belakang orang banyak itu, dua orang perempuan sedang menghambat (ternaknya). Dia (Musa) berkata, “Apakah maksudmu (dengan berbuat begitu)?” Kedua (perempuan) itu menjawab, “Kami tidak dapat memberi minum (ternak kami), sebelum penggembala-penggembala itu memulangkan (ternaknya), sedang ayah kami adalah orang tua yang telah lanjut usianya.”",
      "text": "وَلَمَّا وَرَدَ مَاۤءَ مَدْيَنَ وَجَدَ عَلَيْهِ اُمَّةً مِّنَ النَّاسِ يَسْقُوْنَ ەۖ وَوَجَدَ مِنْ دُوْنِهِمُ امْرَاَتَيْنِ تَذُوْدٰنِۚ قَالَ مَا خَطْبُكُمَا ۗقَالَتَا لَا نَسْقِيْ حَتّٰى يُصْدِرَ الرِّعَاۤءُ وَاَبُوْنَا شَيْخٌ كَبِيْرٌ",
      "text_translation_en": "NOW WHEN he arrived at the wells of Madyan, he found there a large group of men who were watering [their herds and flocks]; and at some distance from them he came upon two women who were keeping back their flock. He asked [them]: “What is the matter with you?” They answered: “We cannot water [our animals] until the herdsmen drive [theirs] home - for [we are weak and] our father is a very old man.”",
      "juz_number": 20
    },
    "24": {
      "text_tafsir_en": "Moses quickly took water for the two girls to give their goats to drink. Due to exhaustion, he took shelter under a tree while feeling hungry and thirsty because he had not eaten for several days except leaves. Moses prayed to God because he desperately needed His mercy and compassion, to eliminate the suffering he experienced.",
      "text_tafsir": "Dengan cepat Musa mengambil air untuk kedua gadis itu agar memberi minum kambing mereka. Karena kelelahan, ia berlindung di bawah sebatang pohon sambil merasakan lapar dan haus karena sudah beberapa hari tidak makan kecuali daun-daunan. Musa berdoa kepada Allah karena ia sangat membutuhkan rahmat dan kasih sayang-Nya, untuk melenyapkan penderitaan yang dialaminya.",
      "text_translation": "Maka dia (Musa) memberi minum (ternak) kedua perempuan itu, kemudian dia kembali ke tempat yang teduh lalu berdoa, “Ya Tuhanku, sesungguhnya aku sangat memerlukan sesuatu kebaikan (makanan) yang Engkau turunkan kepadaku.”",
      "text": "فَسَقٰى لَهُمَا ثُمَّ تَوَلّٰىٓ اِلَى الظِّلِّ فَقَالَ رَبِّ اِنِّيْ لِمَآ اَنْزَلْتَ اِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ ",
      "text_translation_en": "So he watered [their flock] for them: and when he withdrew into the shade and prayed: “O my Sus­tainer! Verily, in dire need am I of any good which Thou mayest bestow upon me!”",
      "juz_number": 20
    },
    "25": {
      "text_tafsir_en": "This verse explains how the end of the suffering that Moses experienced was answered by God. Unexpectedly, one of the two girls came in shyly and told Moses that his father had invited Moses to his house just to repay Moses for helping them to drink water and to feed their livestock. Moses could understand that the two girls were from a well-to-do family, having seen his manners and coming to him and hearing that he who invited him to his house was not his own but his father. If the girl herself invites, it may have a bad effect on her. The disbelievers disagree about the girl's father as to whether she was a prophet or not. Some scholars believe that the girl's father was a virtuous and advanced religious leader. As for the opinion that the woman's father was a Sheikh she could not be accepted because she lived long before Moses. Finally Moses went with the girl to their parents' house. When he arrived, Moses told his parents the story of his life with Pharaoh, how he was haughty and humiliated against the Children of Israel, until his decision and order to kill him, so that he fled Egypt for fear of being killed. The old man listened to Moses' story with great care. When Moses had finished speaking, the old man said to him, \"You do not need to be afraid and anxious because you have escaped the power of the wicked. They will not be able to arrest you, for you are beyond the limits of their kingdom.\" Thus, Moses' heart was at peace as he had been sheltered in the home of a powerful religious leader in the area.",
      "text_tafsir": "Pada ayat ini dijelaskan bagaimana akhir penderitaan yang dialami Musa dengan dikabulkan doanya oleh Allah. Tak disangka-sangka, datanglah salah seorang dari kedua gadis itu dengan agak malu-malu dan berkata kepada Musa bahwa ayahnya mengundang Musa datang ke rumahnya untuk sekadar membalas budi baik Musa yang telah menolong mereka mengambil air minum dan memberi minum binatang ternak mereka. Musa dapat memahami bahwa kedua gadis itu berasal dari keluarga orang baik-baik, karena melihat sikapnya yang sopan dan di waktu datang kepadanya dan mendengar bahwa yang mengundang datang ke rumahnya itu bukan dia sendiri melainkan ayahnya. Kalau gadis itu sendiri yang mengundang, mungkin timbul kesan yang tidak baik terhadapnya.\n\nPara mufasir berbeda pendapat tentang ayah gadis itu apakah dia Nabi Syuaib atau bukan. Sebagian ulama berpendapat bahwa ayah kedua gadis itu adalah seorang pemuka agama yang saleh dan telah berusia lanjut. Adapun pendapat yang mengatakan bahwa ayah wanita itu adalah Nabi Syuaib tidak bisa diterima karena Nabi Syuaib hidup jauh sebelum Nabi Musa. \n\nAkhirnya berangkatlah Musa bersama gadis itu ke rumah orang tua mereka. Setelah sampai, Musa menceritakan kepada orang tua gadis itu riwayat hidupnya bersama Fir'aun, bagaimana kesombongan dan penghinaannya terhadap Bani Israil, sampai kepada keputusan dan perintah untuk membunuhnya, sehingga ia lari dari Mesir karena takut dibunuh. Orang tua itu mendengarkan cerita Musa dengan penuh perhatian. Setelah Musa selesai bercerita, orang tua itu berkata kepadanya, \"Engkau tidak perlu merasa takut dan khawatir karena engkau telah lepas dari kekuasaan orang-orang zalim itu. Mereka tidak akan dapat menangkapmu, karena engkau telah berada di luar batas kerajaan mereka.\" Dengan demikian, hati Musa merasa tenteram karena ia sudah mendapat perlindungan di rumah seorang pemuka agama yang besar pengaruhnya di kawasan tersebut.",
      "text_translation": "Kemudian datanglah kepada Musa salah seorang dari kedua perempuan itu berjalan dengan malu-malu, dia berkata, “Sesungguhnya ayahku mengundangmu untuk memberi balasan sebagai imbalan atas (kebaikan)mu memberi minum (ternak) kami.” Ketika (Musa) mendatangi ayahnya  dan dia menceritakan kepadanya kisah (mengenai dirinya), dia berkata, “Janganlah engkau takut! Engkau telah selamat dari orang-orang yang zalim itu.”",
      "text": "فَجَاۤءَتْهُ اِحْدٰىهُمَا تَمْشِيْ عَلَى اسْتِحْيَاۤءٍ  ۖقَالَتْ اِنَّ اَبِيْ يَدْعُوْكَ لِيَجْزِيَكَ اَجْرَ مَا سَقَيْتَ لَنَاۗ فَلَمَّا جَاۤءَهٗ وَقَصَّ عَلَيْهِ الْقَصَصَۙ  قَالَ لَا تَخَفْۗ نَجَوْتَ مِنَ الْقَوْمِ الظّٰلِمِيْنَ ",
      "text_translation_en": "[Shortly] afterwards, one of the two [maidens] approached him, walking shyly, and said: “Behold, my father invites thee, so that he might duly reward thee for thy having watered [our flock] for us.” And as soon as [Moses] came unto him and told him the story [of his life], he said: “Have no fear! Thou art now safe from those evildoing folk!”",
      "juz_number": 20
    },
    "26": {
      "text_tafsir_en": "Apparently the old man had no sons and no helper. Therefore, the only ones who took care of all the affairs of the family were his two daughters only, until they both had to shepherd their goats, while caring for the household. It was thought by one of the daughters to ask Moses for a favorable attitude and good manners and strong strength as a helper in this house. The daughter proposes to her father to raise Moses as their helper to shepherd the flock, to fetch water, and so forth because she is an honest, trustworthy, and powerful man. That proposal pleased her father, not only wanted to raise her as a maid, but he wanted to marry one of his daughters with Moses.",
      "text_tafsir": "Rupanya orang tua itu tidak mempunyai anak laki-laki dan tidak pula mempunyai pembantu. Oleh sebab itu, yang mengurus semua urusan keluarga itu hanyalah kedua putrinya saja, sampai keduanya terpaksa menggembala kambing mereka, di samping mengurus rumah tangga. Terpikir oleh salah seorang putri itu untuk meminta tolong kepada Musa yang tampaknya amat baik sikap dan budi pekertinya dan kuat tenaganya menjadi pembantu di rumah ini. \n\nPutri itu mengusulkan kepada bapaknya agar mengangkat Musa sebagai pembantu mereka untuk menggembala kambing, mengambil air, dan sebagainya karena dia seorang yang jujur, dapat dipercaya, dan kuat tenaganya. Usul itu berkenan di hati bapaknya, bahkan bukan hanya ingin mengangkatnya sebagai pembantu, malah ia hendak mengawinkan salah satu putrinya dengan Musa.",
      "text_translation": "Dan salah seorang dari kedua (perempuan) itu berkata, “Wahai ayahku! Jadikanlah dia sebagai pekerja (pada kita), sesungguhnya orang yang paling baik yang engkau ambil sebagai pekerja (pada kita) ialah orang yang kuat dan dapat dipercaya.”",
      "text": "قَالَتْ اِحْدٰىهُمَا يٰٓاَبَتِ اسْتَأْجِرْهُ ۖاِنَّ خَيْرَ مَنِ اسْتَأْجَرْتَ الْقَوِيُّ الْاَمِيْنُ ",
      "text_translation_en": "Said one of the two [daughters]: “O my father! Hire him: for, behold, the best [man] that thou couldst hire is one who is [as] strong and worthy of trust [as he]!”",
      "juz_number": 20
    },
    "27": {
      "text_tafsir_en": "The old man immediately asked Moses to talk. He openly says he wants to marry Moses with one of his daughters. As an expert in this marriage, Moses had to work as a shepherd for eight years, if Moses worked ten years then it would be better. This is a very sympathetic and heartbreaking offer to Moses, as a fugitive who seeks to escape from death, one who is unsure of his future, whether he will flee to the land of the people, because of the uncertain direction he will go. What could be more valuable and happier than that offer? Moses had no doubt decided to accept the offer. The scholars conclude with this verse that a father may ask a man to be his daughter's husband. This happened a lot in the time of the Messenger of Allah (may peace be upon him), even among the women who offered to marry him or to marry him whom he wished. Umar once offered his son Hafsah (the widow) to Abu Bakr but Abu Bakr remained silent. Then offered to 'Umanman, but' Umanman apologized for the objection. This was reported to Abu Bakr to the Prophet. He also calmed his heart by saying, \"May Allah give Hafsah better people than Abu Bakr and 'Uthman.\" Then Hafsah was married to the Prophet.",
      "text_tafsir": "Dengan segera orang tua itu mengajak Musa berbincang. Dengan terus terang dia mengatakan keinginannya untuk mengawinkan Musa dengan salah seorang putrinya. Sebagai mahar perkawinan ini, Musa harus bekerja menggembalakan kambing selama delapan tahun, kalau Musa menyanggupi bekerja sepuluh tahun maka itu lebih baik. Ini adalah tawaran yang amat simpatik dan amat melegakan hati Musa, sebagai seorang pelarian yang ingin menghindarkan diri dari maut, seorang yang belum yakin akan masa depannya, apakah ia akan terlunta-lunta di negeri orang, karena tidak tentu arah yang akan ditujunya. Apalagi yang lebih berharga dan lebih membahagiakan dari tawaran itu? Tanpa ragu-ragu Musa telah menetapkan dalam hatinya untuk menerima tawaran tersebut.\n\nPara ulama mengambil dalil dengan ayat ini bahwa seorang bapak boleh meminta seorang laki-laki untuk menjadi suami putrinya. Hal ini banyak terjadi di masa Rasulullah saw, bahkan ada di antara wanita yang menawarkan dirinya supaya dikawini oleh Rasulullah saw atau supaya beliau mengawinkan mereka dengan siapa yang diinginkannya.\n\nUmar pernah menawarkan anaknya Hafsah (yang sudah janda) kepada Abu Bakar tetapi Abu Bakar hanya diam. Kemudian ditawarkan kepada 'Utsman, tetapi 'Utsman meminta maaf karena keberatan. Hal ini diberitahukan Abu Bakar kepada Nabi. Beliau pun menenteramkan hatinya dengan mengatakan, \"Semoga Allah akan memberikan kepada Hafsah orang yang lebih baik dari Abu Bakar dan 'Utsman.\" Kemudian Hafsah dikawini oleh Rasulullah.",
      "text_translation": "Dia (Syekh Madyan) berkata, “Sesungguhnya aku bermaksud ingin menikahkan engkau dengan salah seorang dari kedua anak perempuanku ini, dengan ketentuan bahwa engkau bekerja padaku selama delapan tahun dan jika engkau sempurnakan sepuluh tahun maka itu adalah (suatu kebaikan) darimu, dan aku tidak bermaksud memberatkan engkau. Insya Allah engkau akan mendapatiku termasuk orang yang baik.”",
      "text": "قَالَ اِنِّيْٓ اُرِيْدُ اَنْ اُنْكِحَكَ اِحْدَى ابْنَتَيَّ هٰتَيْنِ عَلٰٓى اَنْ تَأْجُرَنِيْ ثَمٰنِيَ حِجَجٍۚ فَاِنْ اَتْمَمْتَ عَشْرًا فَمِنْ عِنْدِكَۚ وَمَآ اُرِيْدُ اَنْ اَشُقَّ عَلَيْكَۗ سَتَجِدُنِيْٓ اِنْ شَاۤءَ اللّٰهُ مِنَ الصّٰلِحِيْنَ ",
      "text_translation_en": "[After some time, the father] said: “Behold, I am willing to let thee wed one of these two daughters of mine on the understanding that thou wilt remain eight years in my service; and if thou shouldst com­plete ten [years], that would be [an act of grace] from thee, for I do not want to impose any hardship on thee: [on the contrary,] thou wilt find me, if God so wills, righteous in all my dealings.”",
      "juz_number": 20
    },
    "28": {
      "text_tafsir_en": "Musa accepted the offer and promised the parents of the two girls that he would fulfill the agreed terms and would fulfill one of the two terms offered, eight or ten years. After that there are no more obligations that must be imposed on him. Moses also stated that God was a witness to the truth of what was shared together.",
      "text_tafsir": "Musa menerima tawaran itu dan berjanji kepada orang tua kedua gadis itu bahwa dia akan memenuhi syarat-syarat yang disepakati dan akan memenuhi salah satu dari dua masa yang ditawarkan, yaitu delapan atau sepuluh tahun. Sesudah itu tidak ada kewajiban lagi yang harus dibebankan kepadanya. Musa juga menyatakan bahwa Allah yang menjadi saksi atas kebenaran apa yang telah diikrarkan bersama.",
      "text_translation": "Dia (Musa) berkata, “Itu (perjanjian) antara aku dan engkau. Yang mana saja dari kedua waktu yang ditentukan itu yang aku sempurnakan, maka tidak ada tuntutan (tambahan) atas diriku (lagi). Dan Allah menjadi saksi atas apa yang kita ucapkan.”",
      "text": "قَالَ ذٰلِكَ بَيْنِيْ وَبَيْنَكَۗ اَيَّمَا الْاَجَلَيْنِ قَضَيْتُ فَلَا عُدْوَانَ عَلَيَّۗ وَاللّٰهُ عَلٰى مَا نَقُوْلُ وَكِيْلٌ ࣖ",
      "text_translation_en": "Answered [Moses]: “Thus shall it be between me and thee! Whichever of the two terms I fulfill, let there be no ill will against me. And God be witness to all that we say!”",
      "juz_number": 20
    },
    "29": {
      "text_tafsir_en": "This verse explains that after Moses fulfilled his ten-year duties as well as possible, he also said good-bye to his parents-in-law to return to Egypt, which was his hometown, with his wife. Of course there is no reason for his parents-in-law to detain him because all the provisions that have been set to marry his child have been fulfilled by Moses. It's just that as a parent, he will not have the heart to let go of his son-in-law just like that, without giving just supplies on the road. His in-laws provided enough and gave him several goats. Musa then left with his wife on the path he had taken before when he fled from Egypt. On the way, he stopped somewhere to let go of fatigue. Because night had come and it was pitch black, he tried to light a fire with stones. However, his tinder would not light up so he was almost desperate because he could not do anything in the pitch black. The air was so cold that he and his family would not be able to survive for long, without a fire to die. In such circumstances, from a distance he saw the flame to the right of Mount Tur. He then told his wife to wait in his place because he was going to the fire place. Hopefully the people there can give him instructions about this trip or he can bring a piece of extension wood so that they can warm themselves from the unbearable cold air.",
      "text_tafsir": "Ayat ini menerangkan bahwa setelah Musa menunaikan tugasnya selama sepuluh tahun dengan sebaik-baiknya, dia pun pamit kepada mertuanya untuk kembali ke Mesir, yang merupakan kampung halamannya, bersama istrinya. Tentu saja tidak ada alasan bagi mertuanya untuk menahannya karena semua ketentuan yang telah ditetapkan untuk mengawini anaknya sudah dipenuhi Musa. Hanya saja sebagai orang tua, ia tidak akan sampai hati melepaskan anak menantunya begitu saja, tanpa memberikan sekadar bekal di jalan. Mertuanya membekali secukupnya dan memberikan kepadanya beberapa ekor kambing. \n\nMusa lalu berangkat bersama istrinya menempuh jalan yang pernah ditempuhnya dahulu sewaktu dia lari dari Mesir. Di tengah jalan, dia berhenti di suatu tempat untuk melepaskan lelah. Karena malam telah tiba dan keadaan gelap gulita, maka ia mencoba menyalakan api dengan batu. Akan tetapi, rabuknya tidak mau menyala sehingga ia hampir putus asa karena ia tidak dapat mengerjakan sesuatu dalam gelap gulita itu. Udara pun sangat dingin sehingga dia dan keluarganya tidak akan dapat bertahan lama, tanpa ada api untuk berdiang. \n\nDalam keadaan demikian, dari jauh dia melihat nyala api di sebelah kanan Gunung Tur. Dia lalu berkata kepada istrinya untuk menunggu di tempatnya karena ia akan pergi ke tempat api itu. Semoga orang-orang di sana dapat memberikan petunjuk kepadanya tentang perjalanan ini atau ia dapat membawa sepotong kayu penyuluh supaya mereka dapat menghangatkan badan dari udara dingin yang tak tertahankan.",
      "text_translation": "Maka ketika Musa telah menyelesaikan waktu yang ditentukan itu dan dia berangkat dengan keluarganya, dia melihat api di lereng gunung. Dia berkata kepada keluarganya, “Tunggulah (di sini), sesungguhnya aku melihat api, mudah-mudahan aku dapat membawa suatu berita kepadamu dari (tempat) api itu atau (membawa) sepercik api, agar kamu dapat menghangatkan badan.”",
      "text": "۞ فَلَمَّا قَضٰى مُوْسَى الْاَجَلَ وَسَارَ بِاَهْلِهٖٓ اٰنَسَ مِنْ جَانِبِ الطُّوْرِ نَارًاۗ قَالَ لِاَهْلِهِ امْكُثُوْٓا اِنِّيْٓ اٰنَسْتُ نَارًا لَّعَلِّيْٓ اٰتِيْكُمْ مِّنْهَا بِخَبَرٍ اَوْ جَذْوَةٍ مِّنَ النَّارِ لَعَلَّكُمْ تَصْطَلُوْنَ",
      "text_translation_en": "And when Moses had fulfilled his term and was wandering with his family [in the desert], he per­ceived a fire on the slope of Mount Sinai; [and so] he said to his family: “Wait here. Behold, I perceive a fire [far away]; perhaps I may bring you from there some tiding, or [at least] a burning brand from the fire, so that you might warm yourselves.",
      "juz_number": 20
    },
    "30": {
      "text_tafsir_en": "Moses walked toward the fire he saw. As he was near the fire, he was shouted by a voice in the valley to his right. He heard a cry that told him that it was the call of God, the Lord of hosts. Moses heard the voice of his Lord in the silent night, in the valley in his own state, and no one was with him. How could Moses hear the Divine Discourse directly from his God? Because it is a supernatural thing, no one knows but Allah. He inspired Moses to believe that the one who spoke to him was the God of nature. The valley where Moses stood was a place of blessing because it was where Moses heard the word of his Lord and was appointed an apostle.",
      "text_tafsir": "Musa berjalan ke arah api yang dilihatnya itu. Tatkala dia sudah berada di dekat api itu, ia diseru oleh suatu suara di lembah sebelah kanannya. Ia mendengar seruan yang menyatakan kepadanya bahwasanya itu adalah seruan Allah, Tuhan sekalian alam. Musa mendengar seruan Tuhannya di malam yang sunyi senyap, di lembah dalam keadaan sendiri, dan tak seorang pun yang menemaninya. Bagaimana Musa dapat mendengar Kalam Ilahi langsung dari Tuhannya? Karena hal itu adalah suatu hal yang gaib, tidak ada yang mengetahuinya kecuali Allah. Dia telah mengilhamkan kepada Musa keyakinan bahwa yang berbicara dengannya adalah Tuhan sekalian alam. Lembah di mana Musa berdiri dijadikan tempat yang penuh berkah karena di sanalah Musa mendengar firman Tuhannya dan diangkat menjadi rasul.",
      "text_translation": "Maka ketika dia (Musa) sampai ke (tempat) api itu, dia diseru dari (arah) pinggir sebelah kanan lembah, dari sebatang pohon, di sebidang tanah yang diberkahi, “Wahai Musa! Sungguh, Aku adalah Allah, Tuhan seluruh alam!",
      "text": "فَلَمَّآ اَتٰىهَا نُوْدِيَ مِنْ شَاطِئِ الْوَادِ الْاَيْمَنِ فِى الْبُقْعَةِ الْمُبٰرَكَةِ مِنَ الشَّجَرَةِ اَنْ يّٰمُوْسٰٓى اِنِّيْٓ اَنَا اللّٰهُ رَبُّ الْعٰلَمِيْنَ ۙ",
      "text_translation_en": "But when he came close to it, a call was sounded from the right-side bank of the valley, out of the tree [burning] on blessed ground: “O Moses! Verily, I am God, the Sustainer of all the worlds!”",
      "juz_number": 20
    },
    "31": {
      "text_tafsir_en": "Then God told Moses to throw his stick. Moses diligently threw his stick, but it turned into a large, fast-moving snake. Moses was shocked and horrified and afraid to see the snake. Immediately, he ran away without looking back. He thought nothing but to save himself from the bite of the terrible snake. At that time the Lord called for Moses to return to his place and do not be afraid of the serpent. The snake is just a stick that turns into a snake and won't bother it. There is nothing that can disturb his peace. This is the miracle that God gave Moses to face the proud and arrogant Pharaoh. Moses felt safe and at peace when he heard that his security was guaranteed by God.",
      "text_tafsir": "Kemudian Allah memerintahkan kepada Musa supaya melemparkan tongkatnya. Musa dengan patuh melemparkan tongkatnya, tetapi tongkat itu berubah menjadi ular besar yang bergerak dengan cepat dan gesit. Musa sangat terkejut dan merasa ngeri serta takut melihat ular itu. Dengan serta merta, ia lari tanpa menoleh ke belakang. Tidak ada yang dipikirkannya kecuali menyelamatkan diri dari gigitan ular yang dahsyat itu.\n\nDi waktu itu Tuhan berseru lagi agar Musa kembali ke tempat semula dan jangan takut kepada ular itu. Ular itu hanyalah tongkatnya yang berubah menjadi ular dan tidak akan mengganggunya. Tidak ada sesuatu pun yang dapat mengganggu ketenteramannya. Ini adalah mukjizat yang Allah berikan kepada Musa untuk menghadapi Fir'aun yang sombong dan takabur. Hati Musa merasa aman dan tenteram setelah mendengar bahwa keamanannya dijamin oleh Allah.",
      "text_translation": "Dan lemparkanlah tongkatmu.” Maka ketika dia (Musa) melihatnya bergerak-gerak seakan-akan seekor ular yang (gesit), dia lari berbalik ke belakang tanpa menoleh. (Allah berfirman), “Wahai Musa! Kemarilah dan jangan takut. Sesungguhnya engkau termasuk orang yang aman.",
      "text": "وَاَنْ اَلْقِ عَصَاكَ ۗفَلَمَّا رَاٰهَا تَهْتَزُّ كَاَنَّهَا جَاۤنٌّ وَّلّٰى مُدْبِرًا وَّلَمْ يُعَقِّبْۗ يٰمُوْسٰٓى اَقْبِلْ وَلَا تَخَفْۗ اِنَّكَ مِنَ الْاٰمِنِيْنَ ",
      "text_translation_en": "And [then He said]: “Throw down thy staff!” But as soon as [Moses] saw it move rapidly, as if it were a snake, he drew back [in terror], and did not [dare to] return. [And God spoke to him again:] “O Moses! Draw near, and have no fear - for, behold, thou art of those who are secure [in this world and in the next]!",
      "juz_number": 20
    },
    "32": {
      "text_tafsir_en": "Then God told Moses to put his hands on his clothes. Moses obeyed this command and obeyed it. As he removed his hand from the neck of his shirt, he saw his hand turn glowing white and glow not because of grease or anything else. Moses was startled, shocked, and scared. However, immediately after that came the Lord's command to dispel the shock and fear that had overtaken him so that he could hold both hands to his chest. Then God confirmed to Moses that the two miracles he had been given were to show his power. Moses was commanded to show the two miracles to the haughty and wicked Pharaoh when he called upon him to believe in God and to abandon his error. At that time, Moses understood that on his shoulders he had burdened the pamphlets that were to be given to Pharaoh and his people, and to the children of Israel. This means that he has become an apostle. Thus, what God promised Moses 'mother that his son would return to his birth was fulfilled in Moses' childhood. Now the promise of the second God was fulfilled that he had appointed Moses to be an apostle. Previously, what drove Moses from Egypt to Egypt was the feeling of longing for his hometown and his relatives. He dared to do so because he hoped the Egyptians had forgotten about the murderous events he had committed in the past so that he could enter Egypt secretly. However, he must now return there openly and oppose Pharaoh's mighty power. Then Pharaoh and his people would surely kill him. She starts to worry about herself when she goes alone. The more worrying thing was that if he was killed by Pharaoh, surely the message of his Lord would not reach his people (Children of Israel).",
      "text_tafsir": "Kemudian Allah memerintahkan Musa supaya memasukkan tangannya ke baju. Perintah ini pun dilaksanakan Musa dengan taat dan patuh. Ketika ia mengeluarkan tangannya dari leher bajunya, ia melihat tangannya berubah menjadi putih bercahaya dan bersinar bukan karena sakit sopak atau yang lainnya. Musa kaget, terkejut, dan merasa takut. Akan tetapi, segera sesudah itu turun pula perintah Tuhan untuk menghilangkan rasa terkejut dan takut yang telah menguasai dirinya supaya dia mendekapkan kedua tangannya ke dada.\n\nKemudian Allah menegaskan kepada Musa bahwa dua mukjizat yang diberikan kepadanya adalah untuk menunjukkan kekuasaan-Nya. Musa diperintahkan untuk memperlihatkan kedua mukjizat itu kepada Fir'aun yang sombong dan fasik ketika Musa menyerunya agar dia beriman kepada Allah dan meninggalkan kesesatan yang dianutnya. Ketika itu, Musa mengerti bahwa di atas pundaknya telah dibebankan risalah yang harus disampaikan kepada Fir'aun dan kaumnya, serta kepada Bani Israil sendiri. Ini berarti bahwa dia telah menjadi rasul. Dengan demikian, apa yang dijanjikan Allah kepada ibu Musa bahwa putranya akan dikembalikan ke haribaannya telah terlaksana di waktu Musa masih kecil. Sekarang terlaksana pula janji Allah yang kedua bahwa Dia mengangkat Musa menjadi rasul. \n\nSebelum ini, yang mendorong Musa meninggalkan Madyan menuju Mesir adalah perasaan rindu kepada kampung halaman dan sanak keluarganya. Ia berani melakukan hal itu karena dia berharap orang Mesir telah lupa akan peristiwa pembunuhan yang dilakukannya di masa lampau sehingga ia dapat memasuki Mesir secara diam-diam. Akan tetapi, ia sekarang harus kembali ke sana secara terang-terangan dan menentang kekuasaan Fir'aun yang perkasa. Dengan begitu, Fir'aun dan kaumnya pasti akan membunuhnya. Dia mulai merasa khawatir terhadap dirinya kalau dia pergi sendirian. Hal yang lebih dikhawatirkannya adalah kalau ia terbunuh oleh Fir'aun, tentu risalah Tuhannya tidak akan sampai kepada kaumnya (Bani Israil).",
      "text_translation": "Masukkanlah tanganmu ke leher bajumu, dia akan keluar putih (bercahaya) tanpa cacat, dan dekapkanlah kedua tanganmu ke dadamu apabila ketakutan. Itulah dua mukjizat dari Tuhanmu (yang akan engkau pertunjukkan) kepada Fir‘aun dan para pembesarnya. Sungguh, mereka adalah orang-orang fasik.”    ",
      "text": "اُسْلُكْ يَدَكَ فِيْ جَيْبِكَ تَخْرُجْ بَيْضَاۤءَ مِنْ غَيْرِ سُوْۤءٍ ۖوَّاضْمُمْ اِلَيْكَ جَنَاحَكَ مِنَ الرَّهْبِ  فَذٰنِكَ بُرْهَانٰنِ مِنْ رَّبِّكَ اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖۗ اِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِيْنَ ",
      "text_translation_en": "“[And now] put thy hand into thy bosom: it will come forth [shining] white, without blemish. And [henceforth] hold thine arm close to thyself, free of all fear. “These, then, shall be the two signs [of thy bearing a message] from thy Sustainer unto Pharaoh and his great ones - for, behold, they are people depraved!”",
      "juz_number": 20
    },
    "33": {
      "text_tafsir_en": "Moses confessed to his Lord that he had once killed a young man. It was widely reported among the Egyptians, and Pharaoh decided to kill it. It was very worrying for Moses, who knew when he was there, that Pharaoh and his people were preparing to kill him. Thus the brochures that had been charged to him became vacant. Moses also claimed that he had a brother named Aaron who was more eloquent than he was, more capable of debate and testimony. With his kindness, Aaron will be able to defend him, when Pharaoh and his people make accusations that may be burdensome to him.",
      "text_tafsir": "Musa mengadukan kepada Tuhannya bahwa dulu dia pernah membunuh seorang anak muda. Hal itu telah tersiar luas di kalangan orang Mesir, dan Fir'aun telah menetapkan untuk membunuhnya. Hal itu sangat mengkhawatirkan Musa, siapa tahu setibanya di sana, Fir'aun dan kaumnya telah bersiap-siap untuk membunuhnya. Dengan demikian risalah yang telah dibebankan kepadanya menjadi terlantar. \n\nMusa juga mengadukan bahwa ia mempunyai seorang saudara bernama Harun yang lebih fasih perkataannya daripadanya, lebih pandai berdebat dan memberikan keterangan. Dengan kefasihannya, Harun akan dapat membelanya, bila Fir'aun dan kaumnya membuat tuduhan-tuduhan yang mungkin memberatkannya.",
      "text_translation": "Dia (Musa) berkata, “Ya Tuhanku, sungguh aku telah membunuh seorang dari golongan mereka, sehingga aku takut mereka akan membunuhku. ",
      "text": "قَالَ رَبِّ اِنِّيْ قَتَلْتُ مِنْهُمْ نَفْسًا فَاَخَافُ اَنْ يَّقْتُلُوْنِ ",
      "text_translation_en": "Said [Moses] “O my Sustainer! I have slain one of them, and so I fear that they will slay me.",
      "juz_number": 20
    },
    "34": {
      "text_tafsir_en": "Moses confessed to his Lord that he had once killed a young man. It was widely reported among the Egyptians, and Pharaoh decided to kill it. It was very worrying for Moses, who knew when he was there, that Pharaoh and his people were preparing to kill him. Thus the brochures that had been charged to him became vacant. Moses also claimed that he had a brother named Aaron who was more eloquent than he was, more capable of debate and testimony. With his kindness, Aaron will be able to defend him, when Pharaoh and his people make accusations that may be burdensome to him.",
      "text_tafsir": "Musa mengadukan kepada Tuhannya bahwa dulu dia pernah membunuh seorang anak muda. Hal itu telah tersiar luas di kalangan orang Mesir, dan Fir'aun telah menetapkan untuk membunuhnya. Hal itu sangat mengkhawatirkan Musa, siapa tahu setibanya di sana, Fir'aun dan kaumnya telah bersiap-siap untuk membunuhnya. Dengan demikian risalah yang telah dibebankan kepadanya menjadi terlantar. \n\nMusa juga mengadukan bahwa ia mempunyai seorang saudara bernama Harun yang lebih fasih perkataannya daripadanya, lebih pandai berdebat dan memberikan keterangan. Dengan kefasihannya, Harun akan dapat membelanya, bila Fir'aun dan kaumnya membuat tuduhan-tuduhan yang mungkin memberatkannya.",
      "text_translation": "Dan saudaraku Harun, dia lebih fasih lidahnya daripada aku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan (perkataan)ku; sungguh, aku takut mereka akan mendustakanku.” ",
      "text": "وَاَخِيْ هٰرُوْنُ هُوَ اَفْصَحُ مِنِّيْ لِسَانًا فَاَرْسِلْهُ مَعِيَ رِدْءًا يُّصَدِّقُنِيْٓ  ۖاِنِّيْٓ اَخَافُ اَنْ يُّكَذِّبُوْنِ ",
      "text_translation_en": "And my brother Aaron - he is far better in speech than I am. Send him, therefore, as a helper, so that he might [more eloquently] bear witness to my speaking the truth: for I fear indeed that they will give me the lie.”",
      "juz_number": 20
    },
    "35": {
      "text_tafsir_en": "God granted Moses' request and promised to raise Aaron to be an apostle and his companion (vizier). God also reassures his heart which is always filled with worry because of the weight of the burden placed on him. Allah promised that He would give Moses and his brother power that could not be defeated by any power in the world let alone Pharaoh's very limited power. With a safe and secure heart, Moses returned to the place where his wife had left him. He told him all the events he had experienced, that he had been appointed by God to be an apostle. Hearing the story of Moses, his wife's heart became at peace. Musa then left with his family for Egypt, driven by the sacred ideal of delivering the message of God to the Pharaohs and the Children of Israel. In Egypt, Aaron was preparing to carry the message and help his brother.",
      "text_tafsir": "Allah mengabulkan permintaan Musa dan berjanji mengangkat Harun menjadi rasul dan pendampingnya (wazir). Allah juga menenteramkan hatinya yang selalu diliputi kekhawatiran karena beratnya beban yang dipikulkan kepadanya. Allah menjanjikan bahwa Dia akan memberikan kepada Musa dan saudaranya kekuatan yang tak dapat dikalahkan oleh kekuatan apa pun di dunia apalagi kekuatan Fir'aun yang sangat terbatas. \n\nDengan hati yang aman dan tenteram, Musa kembali ke tempat istrinya yang ditinggalkannya. Dia menceritakan kepadanya semua kejadian yang dialaminya, yaitu dia telah diangkat Allah menjadi rasul. Mendengar cerita Musa, hati istrinya menjadi tenteram. Musa lalu berangkat bersama keluarganya menuju Mesir didorong oleh cita-cita yang suci yaitu menyampaikan risalah Allah kepada Fir'aun dan Bani Israil. Di Mesir, Harun telah bersiap-siap untuk memikul risalah itu dan membantu saudaranya.",
      "text_translation": "Dia (Allah) berfirman, “Kami akan menguatkan engkau (membantumu) dengan saudaramu, dan Kami berikan kepadamu berdua kekuasaan yang besar, maka mereka tidak akan dapat mencapaimu; (berangkatlah kamu berdua) dengan membawa mukjizat Kami, kamu berdua dan orang yang mengikuti kamu yang akan menang.” ",
      "text": "قَالَ سَنَشُدُّ عَضُدَكَ بِاَخِيْكَ وَنَجْعَلُ لَكُمَا سُلْطٰنًا فَلَا يَصِلُوْنَ اِلَيْكُمَا  ۛبِاٰيٰتِنَا  ۛ اَنْتُمَا وَمَنِ اتَّبَعَكُمَا الْغٰلِبُوْنَ ",
      "text_translation_en": "Said He: “We shall strengthen thine arm through thy brother, and endow both of you with power, so that they will not be able to touch you: by virtue of Our messages shall you two, and all who follow you, prevail!”",
      "juz_number": 20
    },
    "36": {
      "text_tafsir_en": "Moses then came to Pharaoh and his people to call them to the religion of religion by giving them clear and conclusive evidence. Thus, there is no reason for them to reject the truth that it presents. However, they immediately rejected what Moses said. When they were cornered and could no longer argue with the truth they brought, they accused them of being mere magic and never heard what Moses had said from their ancestors. Such is the attitude of the disbelievers towards the apostles who call upon such a true religion in his word: Thus whenever an apostle comes to those before them, they (his people) must say, \"He is a sorcerer or crazy person.\" (adz-dzariyat \/ 51: 52).",
      "text_tafsir": "Musa lalu datang kepada Fir'aun dan kaumnya untuk menyeru mereka kepada agama tauhid dengan memberikan bukti-bukti yang nyata dan keterangan yang kuat dan jelas. Dengan demikian, tidak ada alasan bagi mereka menolak kebenaran yang dikemukakannya. Akan tetapi, serta merta mereka menolak apa yang diucapkan oleh Musa. Ketika mereka telah terpojok dan tidak dapat lagi membantah kebenaran yang dibawanya, mereka lalu menuduh semua itu hanya sihir belaka dan mereka tidak pernah mendengar apa yang diucapkan Musa dari nenek moyang mereka. \n\nDemikianlah sikap orang-orang kafir terhadap rasul-rasul yang menyeru kepada agama yang benar seperti tersebut dalam firman-Nya:\n\nDemikianlah setiap kali seorang rasul yang datang kepada orang-orang yang sebelum mereka, mereka (kaumnya) pasti mengatakan, \"Dia itu pesihir atau orang gila.\" (adz-dzariyat\/51: 52).",
      "text_translation": "Maka ketika Musa datang kepada mereka dengan (membawa) mukjizat Kami yang nyata, mereka berkata, “Ini hanyalah sihir yang dibuat-buat, dan kami tidak pernah mendengar (yang seperti) ini pada nenek moyang kami dahulu.” ",
      "text": "فَلَمَّا جَاۤءَهُمْ مُّوْسٰى بِاٰيٰتِنَا بَيِّنٰتٍ قَالُوْا مَا هٰذَآ اِلَّا سِحْرٌ مُّفْتَرًىۙ وَّمَا سَمِعْنَا بِهٰذَا فِيْٓ اٰبَاۤىِٕنَا الْاَوَّلِيْنَ ",
      "text_translation_en": "But as soon as Moses came unto them with Our clear messages [Pharaoh and his great ones] said: “All this is nothing but spellbinding eloquence devised [by man]: and never did we hear [the like of] this, [nor has it ever been heard of] in the time of our forebears of old!”",
      "juz_number": 20
    },
    "37": {
      "text_tafsir_en": "The accusations of Pharaoh and his people that the evidence presented by Moses were merely magic answered calmly and did not go out of manners and manners of arguing, without accusing his opponent that they had perverted. Moses told them that his Lord knew better who was the guide of God and who was the lucky one to be happy in the hereafter. On the contrary, in his heart he is fully convinced that he is right, that he is lucky and that he who opposes the truth he brings will surely be at a loss and regret. This answer is the same as the answer given by the Prophet Muhammad to the Muslims who opposed him, as it is in the word of Allah: Say (Muhammad), Who gives you sustenance from heaven and from earth? Say, \"Allah,\" and verily we or you (the heathen), must be in truth or in plain error. (Saba '\/ 34: 24) Nevertheless, Moses insisted that the wicked would not be victorious. This is a signal to Pharaoh and his people that they will not win. They will surely be defeated and destroyed because they are arrogant and cruel people.",
      "text_tafsir": "Tuduhan Fir'aun dan kaumnya bahwa bukti-bukti yang dikemukakan Musa hanya sihir belaka dijawabnya dengan tenang dan tidak keluar dari adab dan sopan santun berdebat, tanpa menuduh lawannya bahwa mereka telah sesat. Musa mengatakan kepada mereka bahwa Tuhannya yang lebih mengetahui siapa sebenarnya yang membawa petunjuk dari Allah dan siapa sebenarnya yang beruntung yang akan mendapat kebahagiaan di akhirat. Di balik itu, dalam hatinya ia yakin sepenuhnya dialah yang benar, dialah orang yang beruntung dan siapa yang menentang kebenaran yang dibawanya pasti akan merugi dan menyesal. Jawaban ini sama dengan jawaban yang diberikan oleh Nabi Muhammad kepada kaum musyrikin yang menentangnya, seperti tersebut dalam firman Allah:\n\nKatakanlah (Muhammad), \"Siapakah yang memberi rezeki kepadamu dari langit dan dari bumi?\" Katakanlah, \"Allah,\" dan sesungguhnya kami atau kamu (orang-orang musyrik), pasti berada dalam kebenaran atau dalam kesesatan yang nyata. (Saba'\/34: 24) \n\nWalaupun demikian, Musa tetap menegaskan bahwa orang zalim tidak akan memperoleh kemenangan. Ini adalah sebagai isyarat kepada Fir'aun dan kaumnya bahwa mereka tidak akan menang. Mereka pasti akan kalah dan hancur karena mereka adalah orang-orang yang sombong dan aniaya.",
      "text_translation": "Dan dia (Musa) menjawab, “Tuhanku lebih mengetahui siapa yang (pantas) membawa petunjuk dari sisi-Nya dan siapa yang akan mendapat kesudahan (yang baik) di akhirat. Sesungguhnya orang-orang yang zalim tidak akan mendapat kemenangan.” ",
      "text": "وَقَالَ مُوْسٰى رَبِّيْٓ اَعْلَمُ بِمَنْ جَاۤءَ بِالْهُدٰى مِنْ عِنْدِهٖ وَمَنْ تَكُوْنُ لَهٗ عَاقِبَةُ الدَّارِۗ اِنَّهٗ لَا يُفْلِحُ الظّٰلِمُوْنَ ",
      "text_translation_en": "And Moses replied: “My Sustainer knows best as to who comes with guidance from Him, and to whom the future belongs! Verily, never will evil­doers attain to a happy state!”",
      "juz_number": 20
    },
    "38": {
      "text_tafsir_en": "This verse explains that after running out of reasons and arguments to contradict Moses' testimony and the evidence he presented, Pharaoh ordered his people not to believe the false news that Moses had presented. During this time no one dared to declare that there was a God besides him. Since ancient times in Egypt it has been ruled by Pharaohs, who have changed, and no one has denied that Pharaohs are the most powerful gods on earth. The people's hearts are lined with fairy tales and superstitions that say that humans should submit to Pharaoh's authority. He was always cruel and cruel to those who dared to betray his power as a god by torturing and imprisoning and even killing him. It is said in the word of Allah: Then he gathered (his princes) and called (called his people). (Seraya) said, \"I am your supreme god.\" (an-Nazi'at \/ 79: 23-24) The Word of God: He (Pharaoh) said, \"If you worship God other than me, I will surely put you in prison.\" (asy-Syu'ara '\/ 26: 29) Imam Fakhruddin ar-Razi argues that Pharaoh declared himself a god, not that he created the heavens, the earth, the seas, mountains, and human beings as such would not be possible. accepted by the intellect. The point is to get people to enslave themselves to it. He simply rejected the existence of a god to be worshiped and worshiped besides him. Then Pharaoh commanded his vassal, Haman, to light a great fire to make a great brick, and to erect a great building, that he might ascend into heaven to see the Lord whom Moses had declared. Pharaoh then asserted that Moses was a great liar. At this, God said: And Pharaoh said, \"O Haman! Make for me a high tower, that I may come to the gates, (that is) the gates of heaven, that I may see the Lord of Moses, and yet I look. a liar. \" And so it was felt to Pharaoh for his evil deeds, and he was shut out from the path (of truth); and that Pharaoh's deception was nothing but loss. (al-Mu'min \/ 40: 36-37)",
      "text_tafsir": "Ayat ini menerangkan bahwa setelah kehabisan alasan dan dalil untuk membantah keterangan Musa dan bukti-bukti yang dikemukakannya, Fir'aun memerintahkan kepada kaumnya supaya jangan percaya kepada berita dusta yang dikemukakan Musa. Selama ini tidak ada seorang pun yang berani mendakwahkan bahwa ada Tuhan selain dia. Semenjak dahulu selama Mesir diperintah oleh Fir'aun, yang silih berganti, tak seorang pun yang mengingkari bahwa Fir'aun adalah tuhan-tuhan yang berkuasa di muka bumi. Mata hati rakyat dikelabui dengan dongeng dan khurafat yang menyatakan bahwa manusia harus tunduk kepada kekuasaan Fir'aun. Dia selalu melakukan tindakan yang kejam dan bengis terhadap orang yang berani mengingkari kekuasaannya sebagai tuhan dengan menyiksa dan memenjarakan bahkan membunuhnya. Hal ini disebutkan dalam firman Allah:\n\nKemudian dia mengumpulkan (pembesar-pembesarnya) lalu berseru (memanggil kaumnya). (Seraya) berkata, \"Akulah tuhanmu yang paling tinggi.\" (an-Nazi'at\/79: 23-24)\n\nFirman Allah:\n\nDia (Fir'aun) berkata, \"Sungguh, jika engkau menyembah Tuhan selain aku, pasti aku masukkan engkau ke dalam penjara.\" (asy-Syu'ara'\/26: 29)\n\nImam Fakhruddin ar-Razi berpendapat bahwa Fir'aun mendakwakan dirinya sebagai tuhan maksudnya bukan dia yang menciptakan langit, bumi, lautan, gunung-gunung, dan manusia seluruhnya karena hal itu tidak akan dapat diterima oleh akal. Maksudnya adalah supaya orang memperhambakan diri kepadanya. Dia hanya menolak adanya tuhan yang harus dipatuhi dan di sembah selain dia.\n\nLalu Fir'aun memerintahkan kepada wazirnya, Haman, supaya menyalakan api yang besar untuk membuat batu bata yang banyak dan mendirikan bangunan yang tinggi supaya dia dapat naik ke langit melihat Tuhan yang didakwahkan Musa. Fir'aun lalu menegaskan bahwa Musa adalah pembohong besar. Senada dengan ini, Allah berfirman:\n\nDan Fir'aun berkata, \"Wahai Haman! Buatkanlah untukku sebuah bangunan yang tinggi agar aku sampai ke pintu-pintu, (yaitu) pintu-pintu langit, agar aku dapat melihat Tuhannya Musa, tetapi aku tetap memandangnya seorang pendusta.\" Dan demikianlah dijadikan terasa indah bagi Fir'aun perbuatan buruknya itu, dan dia tertutup dari jalan (yang benar); dan tipu daya Fir'aun itu tidak lain hanyalah membawa kerugian. (al-Mu'min\/40: 36-37)",
      "text_translation": "Dan Fir‘aun berkata, “Wahai para pembesar kaumku! Aku tidak mengetahui ada Tuhan bagimu selain aku. Maka bakarlah tanah liat untukku wahai Haman (untuk membuat batu bata), kemudian buatkanlah bangunan yang tinggi untukku agar aku dapat naik melihat Tuhannya Musa, dan aku yakin bahwa dia termasuk pendusta.” ",
      "text": "وَقَالَ فِرْعَوْنُ يٰٓاَيُّهَا الْمَلَاُ مَا عَلِمْتُ لَكُمْ مِّنْ اِلٰهٍ غَيْرِيْۚ فَاَوْقِدْ لِيْ يٰهَامٰنُ عَلَى الطِّيْنِ فَاجْعَلْ لِّيْ صَرْحًا لَّعَلِّيْٓ اَطَّلِعُ اِلٰٓى اِلٰهِ مُوْسٰىۙ وَاِنِّيْ لَاَظُنُّهٗ مِنَ الْكٰذِبِيْنَ ",
      "text_translation_en": "Whereupon Pharaoh said: “O you nobles! I did not know that you could have any deity other than myself Well, then, O Haman, kindle me a fire for [baking bricks of] clay, and then build me a lofty tower, that haply I may have a look at the god of Moses although, behold, I am convinced that he is of those who [always] tell lies!”",
      "juz_number": 20
    },
    "39": {
      "text_tafsir_en": "In this verse, God emphasizes that Pharaoh and his army are very arrogant and arrogant. Pharaoh considered and claimed to be the only sovereign on earth. Anyone who challenges him is considered wrong and wicked. When he was told that there was a God greater than his power, the Pharaoh became weak, and could no longer control himself, as he immediately ordered something impossible, such as building a sky-high building so that he could face the almighty God. Pharaoh and his people thought they would not be resurrected, no matter what they did during their lifetime, and no one would be tortured if they committed cruelty and cruelty. Such is their belief in the influence of arrogance and ambiguity. They built a large pyramid for their tombs, complete with elaborate furnishings and exquisite clothing and jewelry, to be enjoyed after death. Because of that arrogance and arrogance, God punished them in this world and the Hereafter. In Pharaoh's world he and his army were drowned in the sea, and in the hereafter they will be tormented in hell. Such is the fate God has decreed for the arrogant and arrogant, cruel and cruel to God and his neighbor. In fact the continuation of the pharaoh's story can be found in other chapters of the Qur'an such as Surah al-A'raf, Yunus, thaha, and so on. However, God wants to emphasize here the fate of the wicked who no longer use their senses and minds so that their hearts are closed to receive the truth from wherever they come, so that they become arrogant and arrogant. It deserves the attention and the lesson for all mankind.",
      "text_tafsir": "Pada ayat ini, Allah menegaskan bahwa Fir'aun dan tentaranya sangat sombong dan takabur. Fir'aun menganggap dan mengaku hanya dialah penguasa yang mutlak di muka bumi. Siapa saja yang menantangnya dianggap salah dan durhaka. Kalau dikatakan kepadanya ada Tuhan yang lebih besar daripada kekuasaannya, Fir'aun menjadi kalap, dan tak dapat lagi menguasai dirinya, seperti memerintahkan dengan segera membuat suatu hal yang mustahil, seperti membuat bangunan setinggi langit agar dia dapat berhadapan dengan Tuhan Yang Mahakuasa lagi Mahaperkasa.\n\nFir'aun dan kaumnya mengira bahwa mereka tidak akan dibangkitkan, tidak akan diperhitungkan apa yang telah dikerjakan selama hidup di dunia, dan tidak ada yang akan menyiksa bila mereka melakukan kezaliman dan kekejaman. Memang demikianlah kepercayaan mereka karena pengaruh kesombongan dan ketakaburan itu. Mereka membuat piramida yang besar untuk kuburan mereka yang diisi dengan perabot yang lengkap dan serba mewah serta pakaian dan perhiasan yang indah-indah, untuk dinikmati sesudah mati.\n\nKarena kesombongan dan ketakaburan itu, Allah mengazab mereka di dunia dan akhirat. Di dunia Fir'aun ditenggelamkan bersama tentaranya ke dalam lautan, dan di akhirat mereka akan disiksa dalam neraka.\n\nDemikianlah nasib yang telah ditetapkan Allah bagi orang yang takabur dan sombong, berbuat zalim dan aniaya terhadap Allah dan sesamanya. Sebenarnya kelanjutan kisah Fir'aun bisa ditemukan pada surah-surah lain dalam Al-Qur'an seperti Surah al-A'raf, Yunus, thaha, dan sebagainya. Akan tetapi, Allah hendak menegaskan di sini bagaimana nasib orang-orang yang durhaka yang tidak lagi mempergunakan akal dan pikirannya sehingga tertutuplah hatinya untuk menerima kebenaran dari mana pun datangnya, sehingga dia menjadi sombong dan takabur. Hal itu layak menjadi perhatian dan pelajaran bagi seluruh manusia.",
      "text_translation": "Dan dia (Fir‘aun) dan bala tentaranya berlaku sombong, di bumi tanpa alasan yang benar, dan mereka mengira bahwa mereka tidak akan dikembalikan kepada Kami.",
      "text": "وَاسْتَكْبَرَ هُوَ وَجُنُوْدُهٗ فِى الْاَرْضِ بِغَيْرِ الْحَقِّ وَظَنُّوْٓا اَنَّهُمْ اِلَيْنَا لَا يُرْجَعُوْنَ ",
      "text_translation_en": "Thus arrogantly, without the least good sense, did he and his hosts behave on earth - just as if they thought that they would never have to appear before Us [for judgment]!",
      "juz_number": 20
    },
    "40": {
      "text_tafsir_en": "In this verse, God emphasizes that Pharaoh and his army are very arrogant and arrogant. Pharaoh considered and claimed to be the only sovereign on earth. Anyone who challenges him is considered wrong and wicked. When he was told that there was a God greater than his power, the Pharaoh became weak, and could no longer control himself, as he immediately ordered something impossible, such as building a sky-high building so that he could face the almighty God. Pharaoh and his people thought they would not be resurrected, no matter what they did during their lifetime, and no one would be tortured if they committed cruelty and cruelty. Such is their belief in the influence of arrogance and ambiguity. They built a large pyramid for their tombs, complete with elaborate furnishings and exquisite clothing and jewelry, to be enjoyed after death. Because of that arrogance and arrogance, God punished them in this world and the Hereafter. In Pharaoh's world he and his army were drowned in the sea, and in the hereafter they will be tormented in hell. Such is the fate God has decreed for the arrogant and arrogant, cruel and cruel to God and his neighbor. In fact the continuation of the pharaoh's story can be found in other chapters of the Qur'an such as Surah al-A'raf, Yunus, thaha, and so on. However, God wants to emphasize here the fate of the wicked who no longer use their senses and minds so that their hearts are closed to receive the truth from wherever they come, so that they become arrogant and arrogant. It deserves the attention and the lesson for all mankind.",
      "text_tafsir": "Pada ayat ini, Allah menegaskan bahwa Fir'aun dan tentaranya sangat sombong dan takabur. Fir'aun menganggap dan mengaku hanya dialah penguasa yang mutlak di muka bumi. Siapa saja yang menantangnya dianggap salah dan durhaka. Kalau dikatakan kepadanya ada Tuhan yang lebih besar daripada kekuasaannya, Fir'aun menjadi kalap, dan tak dapat lagi menguasai dirinya, seperti memerintahkan dengan segera membuat suatu hal yang mustahil, seperti membuat bangunan setinggi langit agar dia dapat berhadapan dengan Tuhan Yang Mahakuasa lagi Mahaperkasa.\n\nFir'aun dan kaumnya mengira bahwa mereka tidak akan dibangkitkan, tidak akan diperhitungkan apa yang telah dikerjakan selama hidup di dunia, dan tidak ada yang akan menyiksa bila mereka melakukan kezaliman dan kekejaman. Memang demikianlah kepercayaan mereka karena pengaruh kesombongan dan ketakaburan itu. Mereka membuat piramida yang besar untuk kuburan mereka yang diisi dengan perabot yang lengkap dan serba mewah serta pakaian dan perhiasan yang indah-indah, untuk dinikmati sesudah mati.\n\nKarena kesombongan dan ketakaburan itu, Allah mengazab mereka di dunia dan akhirat. Di dunia Fir'aun ditenggelamkan bersama tentaranya ke dalam lautan, dan di akhirat mereka akan disiksa dalam neraka.\n\nDemikianlah nasib yang telah ditetapkan Allah bagi orang yang takabur dan sombong, berbuat zalim dan aniaya terhadap Allah dan sesamanya. Sebenarnya kelanjutan kisah Fir'aun bisa ditemukan pada surah-surah lain dalam Al-Qur'an seperti Surah al-A'raf, Yunus, thaha, dan sebagainya. Akan tetapi, Allah hendak menegaskan di sini bagaimana nasib orang-orang yang durhaka yang tidak lagi mempergunakan akal dan pikirannya sehingga tertutuplah hatinya untuk menerima kebenaran dari mana pun datangnya, sehingga dia menjadi sombong dan takabur. Hal itu layak menjadi perhatian dan pelajaran bagi seluruh manusia.",
      "text_translation": "Maka Kami siksa dia (Fir‘aun) dan bala tentaranya, lalu Kami lemparkan mereka ke dalam laut. Maka perhatikanlah bagaimana kesudahan orang yang zalim.",
      "text": "فَاَخَذْنٰهُ وَجُنُوْدَهٗ فَنَبَذْنٰهُمْ فِى الْيَمِّ ۚفَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الظّٰلِمِيْنَ ",
      "text_translation_en": "And so We seized him and his hosts and cast them into the sea: and behold what happened in the end to those evildoers:",
      "juz_number": 20
    },
    "41": {
      "text_tafsir_en": "This verse gives nickname to Fir'awn and his lawless people that they are leaders who bring people to hell because they have led humans astray and forced everyone to disbelieve in their Lord. They feel free to commit tyranny as they wish, without any sense of justice and compassion. Actually they have made two mistakes, mistakes for themselves and mistakes that lead others astray. So it is fitting for them to receive multiple torments, tortures against their own heresy and torture for misleading others. Therefore, there will be no help for them in the hereafter and no one will be free from the punishment of Allah.",
      "text_tafsir": "Ayat ini memberi julukan kepada Fir'aun dan kaumnya yang durhaka bahwa mereka adalah pemimpin-pemimpin yang membawa manusia ke neraka karena mereka telah menyesatkan manusia dan memaksa setiap orang untuk kafir terhadap Tuhannya. Mereka merasa bebas melakukan kezaliman sekehendak hatinya, tanpa ada rasa keadilan dan rasa kasih sayang.\n\nSebenarnya mereka ini telah melakukan dua kesalahan, kesalahan bagi diri mereka sendiri dan kesalahan menyesatkan orang lain. Maka pantaslah bila mereka menerima siksaan yang berlipat ganda, siksaan terhadap kesesatan sendiri dan siksaan karena menyesatkan orang lain. Oleh karena itu, tidak akan ada penolong bagi mereka di akhirat nanti dan tidak ada yang akan membebaskan dari siksa Allah.",
      "text_translation": "Dan Kami jadikan mereka para pemimpin yang mengajak (manusia) ke neraka dan pada hari Kiamat mereka tidak akan ditolong.",
      "text": "وَجَعَلْنٰهُمْ اَىِٕمَّةً يَّدْعُوْنَ اِلَى النَّارِۚ وَيَوْمَ الْقِيٰمَةِ لَا يُنْصَرُوْنَ ",
      "text_translation_en": "[We destroyed them,] and We set them up as archetypes [of evil] that show the way to the fire [of hell]; and [whereas] no succour will come to them on Resurrection Day,",
      "juz_number": 20
    },
    "42": {
      "text_tafsir_en": "This verse gives nickname to Fir'awn and his lawless people that they are leaders who bring people to hell because they have led humans astray and forced everyone to disbelieve in their Lord. They feel free to commit tyranny as they wish, without any sense of justice and compassion. Actually they have made two mistakes, mistakes for themselves and mistakes that lead others astray. So it is fitting for them to receive multiple torments, tortures against their own heresy and torture for misleading others. Therefore, there will be no help for them in the hereafter and no one will be free from the punishment of Allah.",
      "text_tafsir": "Ayat ini memberi julukan kepada Fir'aun dan kaumnya yang durhaka bahwa mereka adalah pemimpin-pemimpin yang membawa manusia ke neraka karena mereka telah menyesatkan manusia dan memaksa setiap orang untuk kafir terhadap Tuhannya. Mereka merasa bebas melakukan kezaliman sekehendak hatinya, tanpa ada rasa keadilan dan rasa kasih sayang.\n\nSebenarnya mereka ini telah melakukan dua kesalahan, kesalahan bagi diri mereka sendiri dan kesalahan menyesatkan orang lain. Maka pantaslah bila mereka menerima siksaan yang berlipat ganda, siksaan terhadap kesesatan sendiri dan siksaan karena menyesatkan orang lain. Oleh karena itu, tidak akan ada penolong bagi mereka di akhirat nanti dan tidak ada yang akan membebaskan dari siksa Allah.",
      "text_translation": "Dan Kami susulkan laknat kepada mereka di dunia ini; sedangkan pada hari Kiamat mereka termasuk orang-orang yang dijauhkan (dari rahmat Allah).",
      "text": "وَاَتْبَعْنٰهُمْ فِيْ هٰذِهِ الدُّنْيَا لَعْنَةً ۚوَيَوْمَ الْقِيٰمَةِ هُمْ مِّنَ الْمَقْبُوْحِيْنَ ࣖ",
      "text_translation_en": "We have caused a curse to follow them in this world as well; and on Resurrection Day they will find themselves among those who are bereft of all good.",
      "juz_number": 20
    },
    "43": {
      "text_tafsir_en": "This verse explains that God revealed to Moses the Book of the Torah as a mercy to him and his people, who had long been oppressed and persecuted under Pharaoh's authority. It contains wisdom and the law that guides mankind toward the happiness of the world and the hereafter. Here there appears a great and distinct difference in the way God treats the leaders and the wicked, the arrogant and the arrogant with his treatment of the virtuous, the sincere and the obedient. The first groups, such as Pharaoh and his people, suffered catastrophe and torture until they were sunk with their soldiers into the sea. To the second group, such as Moses, Aaron, and his people, the Book was revealed that would guide them in life, both in the world and in the Hereafter. Such is the precept that has happened since time immemorial. How many of His earlier people He has destroyed in various ways as happened to the people of Noah, Prophet Saleh, Prophet Hud, and others. From Abu Sa'id al-Khudri quoting from the Prophet (saws), he said, \"After he had revealed the Torah on the earth Allah would no longer destroy a people with punishment from heaven or earth unless the inhabitants of the land were transformed into monks, they were the children of Israel. Moses, and then he recited this verse (al-Qasas \/ 28: 43).",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah menurunkan kepada Musa kitab Taurat sebagai rahmat baginya dan bagi kaumnya, yang telah lama tertindas dan teraniaya di bawah kekuasaan Fir'aun. Di dalamnya terdapat hikmah dan hukum yang membimbing manusia menuju kebahagiaan dunia dan akhirat. Di sini tampak perbedaan yang besar dan nyata dalam perlakuan Allah terhadap pemimpin-pemimpin dan kaum yang durhaka, sombong dan takabur dengan perlakuannya terhadap pemimpin yang saleh dan ikhlas serta taat kepada-Nya.\n\nKepada golongan pertama, seperti Fir'aun dan kaumnya, diturunkan malapetaka dan siksaan sehingga dia ditenggelamkan bersama tentaranya ke dalam laut. Kepada golongan kedua, seperti Musa, Harun, dan kaumnya, diturunkan Kitab yang akan menjadi petunjuk bagi mereka dalam menempuh kehidupan, baik di dunia maupun di akhirat. Demikianlah sunatullah yang berlaku semenjak dahulu kala. Berapa banyaknya umat-umat yang terdahulu yang telah dibinasakan-Nya dengan berbagai macam cara seperti yang terjadi pada kaum Nabi Nuh, Nabi Saleh, Nabi Hud, dan lain-lain.\n\nDari Abu Sa'id al-Khudri bersumber dari Nabi saw, beliau bersabda, \"Setelah diturunkannya kitab Taurat di atas bumi Allah tidak lagi membinasakan suatu kaum dengan azab dari langit atau bumi kecuali penduduk negeri yang diubah menjadi kera, mereka adalah orang Bani Israil sepeninggal Nabi Musa, lalu Nabi saw membaca ayat ini (al-Qasas\/28: 43). (Riwayat al-hakim)",
      "text_translation": "Dan sungguh, telah Kami berikan kepada Musa Kitab (Taurat) setelah Kami binasakan umat-umat terdahulu, untuk menjadi pelita bagi manusia dan petunjuk serta rahmat, agar mereka mendapat pelajaran.",
      "text": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ مِنْۢ بَعْدِ مَآ اَهْلَكْنَا الْقُرُوْنَ الْاُوْلٰى بَصَاۤىِٕرَ لِلنَّاسِ وَهُدًى وَّرَحْمَةً لَّعَلَّهُمْ يَتَذَكَّرُوْنَ ",
      "text_translation_en": "And [then,] indeed, after We had destroyed those earlier generations [of sinners], We vouchsafed unto Moses [Our] revelation as a means of insight for men, and as a guidance and grace, so that they might bethink themselves [of Us].",
      "juz_number": 20
    },
    "44": {
      "text_tafsir_en": "This verse explains that Muhammad was never on the west side of the Holy Valley, where God revealed the sheets of the Torah to Moses. At that time, God imposed on him prophetic affairs. Since he was not one of the group of 70 people who had been selected to hear the details of what God had revealed to Moses, it was impossible for Muhammad to explain all that, except in the way of revelation from God. Muhammad saw able to convey mysterious things that had not happened and which he had never seen or seen. -Have it. It is a clear proof that Muhammad was truly a prophet and a prophet of God. All of this is conveyed and told through the revelation of God. The Word of God: And they say, \"Why has he not brought us a sign from his Lord?\" Has not the evidence (of them) been given to them in the ancient books? (thaha \/ 20: 133)",
      "text_tafsir": "Ayat ini menerangkan bahwa Muhammad saw tidak pernah berada di sisi sebelah barat Lembah Suci thuwa, tempat Allah mewahyukan lembaran-lembaran Taurat kepada Musa. Ketika itu, Allah membebankan urusan-urusan kenabian kepadanya. Karena tidak termasuk salah seorang dari rombongan 70 orang yang telah terpilih untuk mendengarkan secara terperinci hal-hal yang diwahyukan Allah kepada Musa, maka Muhammad saw tidak mungkin menerangkan semua itu, kecuali dengan jalan wahyu dari Allah. Muhammad saw dapat menyampaikan hal-hal gaib yang telah lama terjadi serta tidak disaksikan dan dilihatnya sama sekali, padahal ia adalah seorang 'ummi tidak dapat membaca dan menulis, berada di tengah-tengah kaum yang 'ummi pula, dan tidak mengetahui sedikit pun tentang hal-hal tersebut. Hal itu merupakan bukti nyata bahwa Muhammad benar-benar nabi dan rasul Allah. Semua itu disampaikan dan dikisahkannya melalui perantaraan wahyu dari Allah. Firman Allah:\n\nDan mereka berkata, \"Mengapa dia tidak membawa tanda (bukti) kepada kami dari Tuhannya?\" Bukankah telah datang kepada mereka bukti (yang nyata) sebagaimana yang tersebut di dalam kitab-kitab yang dahulu? (thaha\/20: 133)",
      "text_translation": "Dan engkau (Muhammad) tidak berada di sebelah barat (lembah suci Tuwa) ketika Kami menyampaikan perintah kepada Musa, dan engkau tidak (pula) termasuk orang-orang yang menyaksikan (kejadian itu).",
      "text": "وَمَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ اِذْ قَضَيْنَآ اِلٰى مُوْسَى الْاَمْرَ وَمَا كُنْتَ مِنَ الشّٰهِدِيْنَ ۙ",
      "text_translation_en": "NOW [as for thee, O Muhammad,] thou wert not present on the sunset slope [of Mount Sinai] when We imposed the Law upon Moses, nor wert thou among those who witnessed [his times]:",
      "juz_number": 20
    },
    "45": {
      "text_tafsir_en": "This verse explains that God has created generations from Moses to Prophet Muhammad for a long time and it is a time of emptiness, so that their knowledge decreases, their morals decline and they lead to destruction and moral decadence. At that time it was necessary that an apostle should be sent to guide and direct them in the right way. He was sent by the Prophet Muhammad and he was informed of the circumstances and circumstances of the previous prophets, as well as the circumstances and beliefs of Moses. God also explains in this verse that Muhammad did not live with the people of Mahayana to ask questions and learn the story of Moses from those who witnessed the story itself. All this was known to the Prophet Muhammad by the revelation that was revealed to him.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah menciptakan generasi demi generasi sejak Nabi Musa sampai kepada Nabi Muhammad dalam waktu yang panjang dan merupakan masa kekosongan, sehingga pengetahuan mereka berkurang, akhlak mereka menurun dan telah menjurus kepada kehancuran dan dekadensi moral. Pada waktu itu terasa benar perlunya diutus seorang rasul untuk membimbing dan memberi petunjuk kepada mereka ke jalan yang benar. Maka diutuslah Nabi Muhammad saw dan dia diberitahu oleh Allah keadaan dan ihwal nabi-nabi terdahulu, begitu juga keadaan dan hal ikhwal Nabi Musa. Allah juga menerangkan pada ayat ini bahwa Muhammad tidak tinggal bersama-sama penduduk Madyan untuk menanyakan dan mempelajari kisah Nabi Musa dari orang-orang yang menyaksikan kisah itu sendiri. Semua itu diketahui oleh Nabi Muhammad dengan perantaraan wahyu yang diturunkan kepadanya.",
      "text_translation": "Tetapi Kami telah menciptakan beberapa umat, dan telah berlalu atas mereka masa yang panjang, dan engkau (Muhammad) tidak tinggal bersama-sama penduduk Madyan dengan membacakan ayat-ayat Kami kepada mereka, tetapi Kami telah mengutus rasul-rasul.",
      "text": "وَلٰكِنَّآ اَنْشَأْنَا قُرُوْنًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُۚ وَمَا كُنْتَ ثَاوِيًا فِيْٓ اَهْلِ مَدْيَنَ تَتْلُوْا عَلَيْهِمْ اٰيٰتِنَاۙ وَلٰكِنَّا كُنَّا مُرْسِلِيْنَ ",
      "text_translation_en": "nay, but [between them and thee] We brought into being [many] generations, and long was their span of life. And neither didst thou dwell among the people of Madyan, conveying Our messages unto them: nay, but We have [always] been sending [Our message-bearers unto man].",
      "juz_number": 20
    },
    "46": {
      "text_tafsir_en": "This verse explains that the Prophet Muhammad was not near the Mountain of God when God called Moses and when there was a miracle between them. This event is known to Muhammad through the use of the Holy Qur'an revealed to him as the grace of God in which the story is presented. There are also things that bring misery and happiness to them in the world and in the hereafter, to give Muhammad a warning to the Quraysh who have never received a warning before. In addition to this verse, it is a clear proposition to Muhammad's letter, as well as a proposition to the miraculousness of the Qur'an, as it tells of events that had occurred for hundreds of years. But the Prophet did not witness the event and even appeared in their midst.",
      "text_tafsir": "Ayat ini menerangkan bahwa Nabi Muhammad tidak berada di dekat Gunung Tur pada waktu Allah menyeru Nabi Musa dan ketika terjadi munajat antara keduanya. Peristiwa itu diketahui oleh Muhammad dengan perantaraan kitab suci Al-Qur'an yang diwahyukan kepadanya sebagai rahmat Allah yang di dalamnya dibentangkan kisah tersebut. Juga terdapat hal-hal yang mendatangkan maslahat dan kebahagiaan bagi mereka di dunia dan di akhirat, agar Muhammad memberi peringatan kepada kaum Quraisy yang belum pernah memperoleh peringatan sebelumnya. Selain ayat ini sebagai dalil yang jelas atas kerasulan Muhammad saw, juga sebagai dalil atas kemukjizatan Al-Qur'an, karena ia menceritakan peristiwa yang telah terjadi beratus-ratus tahun. Padahal Rasulullah tidak menyaksikan peristiwa tersebut apalagi hadir di tengah-tengah mereka.",
      "text_translation": "Dan engkau (Muhammad) tidak berada di dekat Tur (gunung) ketika Kami menyeru (Musa), tetapi (Kami utus engkau) sebagai rahmat dari Tuhanmu, agar engkau memberi peringatan kepada kaum (Quraisy) yang tidak didatangi oleh pemberi peringatan sebelum engkau agar mereka mendapat pelajaran.",
      "text": "وَمَا كُنْتَ بِجَانِبِ الطُّوْرِ اِذْ نَادَيْنَا وَلٰكِنْ رَّحْمَةً مِّنْ رَّبِّكَ لِتُنْذِرَ قَوْمًا مَّآ اَتٰىهُمْ مِّنْ نَّذِيْرٍ مِّنْ قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُوْنَ ",
      "text_translation_en": "And neither wert thou present on the slope of Mount Sinai when We called out [to Moses]: but [thou, too, art sent] as an act of thy Sustainer’s grace, to warn people to whom no warner has come before thee, so that they might bethink themselves [of Us];",
      "juz_number": 20
    },
    "47": {
      "text_tafsir_en": "This verse explains that one of the wisdom of Muhammad's decision was to reject their reasons, when they would soon receive a painful punishment for their disobedience to God and the sins he had committed. If Muhammad had not been sent when the torment would overtake them, they would have made excuses and arguments. They will say, \"O our Lord! Why did not a messenger be sent to us before Your wrath came upon us, and Your punishment was sent down to us, that we might follow Your precepts, and practice the verses of the book?\" \"It was you who was sent to the apostles, that we might believe in your God and justify the messenger whom you sent?\" Therefore, long before they were enraged and punished by Allah, Muhammad was sent to warn and threaten with the wrath and torment that would come upon them if they continued in the religion of their ancestors, worshiped idols, united with God. Thus, there is no way for them to come up with reasons and arguments. That is the law that applies to every people. This is emphasized in other verses of the Qur'an as the word of God: The apostles are the bearers of glad tidings and warnings, so that there is no reason for man to disobey God once they are sent. God is Mighty, Mighty. (an-Nisa '\/ 4: 165) And His saying: Whoever does according to the guidance of Allah, then it is for his (salvation); and whoever goes astray, then it is for him. And a sinner cannot bear the sins of others, but We will not suffer until We send an apostle. (al-Isra '\/ 17: 15) One of the wisdom of the apostles' decision was to contain and reject the reasons for their decision. Wisdom revealed the Holy Qur'an also to reject the reason they would say that they do not believe because the book is only revealed to two groups of Jews and Christians, as Allah swt says: (We bring down the Qur'an) so that you (say), \"The book was only passed down to the two groups before us (Jews and Christians) and indeed, we did not pay attention to what they read.\" (al-An'am \/ 6: 156)",
      "text_tafsir": "Ayat ini menerangkan bahwa salah satu hikmah pengutusan Muhammad kepada mereka adalah untuk menolak alasan-alasan mereka, ketika kelak mendapat azab yang pedih atas kekafiran mereka terhadap Allah dan dosa-dosa yang telah diperbuatnya. Seandainya Muhammad belum diutus sedangkan azab menimpa mereka, tentu mereka akan mengemukakan alasan dan hujah. Mereka akan berkata, \"Wahai Tuhan kami! Kenapa tidak diutus seorang rasul kepada kami sebelum kemurkaan-Mu menimpa kami, dan azab-Mu diturunkan kepada kami, agar kami dapat mengikuti petunjuk-petunjuk-Mu, mengamalkan ayat-ayat yang ada di dalam kitab-Mu yang diturunkan kepada rasul itu, sehingga kami percaya atas ketuhanan-Mu dan membenarkan rasul yang Engkau utus itu?\"\n\nOleh sebab itu, jauh sebelum mereka dimurkai dan diazab oleh Allah, Muhammad telah diutus kepada mereka untuk memberi peringatan dan ancaman dengan kemurkaan dan azab yang akan ditimpakan kalau mereka tetap dalam agama nenek moyang mereka, menyembah berhala, mempersekutukan Allah. Dengan demikian, tidak ada jalan bagi mereka untuk mengemukakan alasan-alasan dan hujah. Itulah sunatullah yang berlaku pada tiap-tiap umat. Hal ini ditegaskan dalam ayat lain dalam Al-Qur'an seperti firman Allah:\n\nRasul-rasul itu adalah sebagai pembawa berita gembira dan pemberi peringatan, agar tidak ada alasan bagi manusia untuk membantah Allah setelah rasul-rasul itu diutus. Allah Mahaperkasa, Mahabijaksana. (an-Nisa'\/4: 165)\n\nDan firman-Nya:\n\nBarang siapa berbuat sesuai dengan petunjuk (Allah), maka sesungguhnya itu untuk (keselamatan) dirinya sendiri; dan barang siapa tersesat maka sesungguhnya (kerugian) itu bagi dirinya sendiri. Dan seorang yang berdosa tidak dapat memikul dosa orang lain, tetapi Kami tidak akan menyiksa sebelum Kami mengutus seorang rasul. (al-Isra'\/17: 15)\n\nSalah satu hikmat pengutusan para rasul adalah untuk membendung dan menolak alasan yang akan dikemukakan mereka. Hikmah diturunkannya kitab suci Al-Qur'an juga untuk menolak alasan mereka yang akan mengatakan bahwa mereka tidak beriman karena kitab samawi hanya diturunkan kepada dua golongan saja yaitu Yahudi dan Nasrani, sebagaimana firman Allah swt:\n\n(Kami turunkan Al-Qur'an itu) agar kamu (tidak) mengatakan, \"Kitab itu hanya diturunkan kepada dua golongan sebelum kami (Yahudi dan Nasrani) dan sungguh, kami tidak memperhatikan apa yang mereka baca.\" (al-An'am\/6: 156)",
      "text_translation": "Dan agar mereka tidak mengatakan ketika azab menimpa mereka disebabkan apa yang mereka kerjakan, “Ya Tuhan kami, mengapa Engkau tidak mengutus seorang rasul kepada kami, agar kami mengikuti ayat-ayat Engkau dan termasuk orang mukmin.”",
      "text": "وَلَوْلَآ اَنْ تُصِيْبَهُمْ مُّصِيْبَةٌ ۢبِمَا قَدَّمَتْ اَيْدِيْهِمْ فَيَقُوْلُوْا رَبَّنَا لَوْلَآ اَرْسَلْتَ اِلَيْنَا رَسُوْلًا فَنَتَّبِعَ اٰيٰتِكَ وَنَكُوْنَ مِنَ الْمُؤْمِنِيْنَ ",
      "text_translation_en": "and [We have sent thee] lest they say [on Judg­ment Day], when disaster befalls them as an outcome of what their own hands have wrought, “O our Sus­tainer, if only Thou had sent an apostle unto us, we would have followed Thy messages, and would have been among those who believe!”",
      "juz_number": 20
    },
    "48": {
      "text_tafsir_en": "This verse explains that when Muhammad was sent to the Quraysh who had never been visited by an apostle who was given the Holy Qur'an, they bragged, resisted, and showed misguidedness. They said, \"Why does he not have a miracle just as Moses was miraculously given, like a stick to a snake, the sea split with a rod, his hand became white, shadowed by a cloud, and so on?\" ) to abandon some of what has been revealed to you and your breasts narrow, because they will say, \"Why is it not given to him (wealth) or to come with him?\" Indeed, you are only a warner and Allah is the protector of all things. 11: 12) The Quraysh answered that those who were wicked and arrogant in Moses' day disobeyed the miracle given to Moses, and even accused Moses and Aaron of being two helpers of magic. Will Mecca follow what Moses did? Will they disobey what Muhammad has said, and say that Moses and Muhammad were magicians? Wouldn't they also believe in both their brochures and miracles? Regarding the allegations that the two were magicians in this verse, Said bin Jubair, Mujahid, and Ibn Zaid argued that \"both were magicians\" were Moses and Aaron. This is what the Jews were saying at the beginning of the epistle. While Ibn 'Abbas and al-hasan al-Basri are of the opinion that the two witches are Moses and Muhammad, and this is the speech of the Arabs.",
      "text_tafsir": "Ayat ini menerangkan bahwa ketika Muhammad diutus kepada kaum Quraisy yang belum pernah didatangi oleh seorang rasul yang dibekali kitab suci Al-Qur'an, mereka menyombongkan diri, menentang, dan memperlihatkan kesesatan. Mereka berkata, \"Mengapa ia tidak memiliki mukjizat sebagaimana halnya Nabi Musa yang diberi mukjizat, seperti tongkat menjadi ular, lautan terbelah dengan pukulan tongkatnya, tangannya menjadi putih, dinaungi oleh awan, dan lain-lain. Firman Allah:\n\nMaka boleh jadi engkau (Muhammad) hendak meninggalkan sebagian dari apa yang diwahyukan kepadamu dan dadamu sempit karenanya, karena mereka akan mengatakan, \"Mengapa tidak diturunkan kepadanya harta (kekayaan) atau datang bersamanya malaikat?\" Sungguh, engkau hanyalah seorang pemberi peringatan dan Allah pemelihara segala sesuatu. (Hud\/11: 12)\n\nUcapan kaum Quraisy itu dijawab bahwa orang-orang yang durhaka dan sombong pada masa Nabi Musa telah ingkar kepada mukjizat yang diberikan kepada Musa dahulu. Bahkan mereka menuduh Musa dan Harun adalah dua ahli sihir yang saling membantu. Apakah orang-orang kafir Mekah akan mengikuti apa yang telah diperbuat kaum Nabi Musa? Apakah mereka akan mengingkari apa yang didatangkan Muhammad, dan mengatakan bahwa Musa dan Muhammad adalah ahli sihir? Apakah mereka juga tidak akan mempercayai risalah dan mukjizat keduanya? \n\nMengenai tuduhan bahwa keduanya adalah ahli sihir pada ayat ini, Said bin Jubair, Mujahid, dan Ibnu Zaid berpendapat bahwa yang dimaksud dengan \"keduanya adalah ahli sihir\" ialah Musa dan Harun. Ini adalah ucapan orang-orang Yahudi pada permulaan kerasulan. Sedangkan Ibnu 'Abbas dan al-hasan al-Basri berpendapat bahwa yang dimaksud dengan keduanya adalah ahli sihir yaitu Musa dan Muhammad saw, dan ini adalah ucapan orang-orang musyrikin bangsa Arab.",
      "text_translation": "Maka ketika telah datang kepada mereka kebenaran (Al-Qur'an) dari sisi Kami, mereka berkata, “Mengapa tidak diberikan kepadanya (Muhammad) seperti apa yang telah diberikan kepada Musa dahulu?” Bukankah mereka itu telah ingkar (juga) kepada apa yang diberikan kepada Musa dahulu? Mereka dahulu berkata, “(Musa dan Harun adalah) dua pesihir yang bantu-membantu.” Dan mereka (juga) berkata, “Sesungguhnya kami sama sekali tidak mempercayai masing-masing mereka itu.”",
      "text": "فَلَمَّا جَاۤءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوْا لَوْلَآ اُوْتِيَ مِثْلَ مَآ اُوْتِيَ مُوْسٰىۗ اَوَلَمْ يَكْفُرُوْا بِمَآ اُوْتِيَ مُوْسٰى مِنْ قَبْلُۚ قَالُوْا سِحْرٰنِ تَظَاهَرَاۗ وَقَالُوْٓا اِنَّا بِكُلٍّ كٰفِرُوْنَ ",
      "text_translation_en": "And yet, now that the truth has come unto them from Us, they say, “Why has he not been vouch­safed the like of what Moses was vouchsafed?” But did they not also, before this, deny the truth of what Moses was vouchsafed? [For] they do say, “Two examples of delusion, [seemingly] supporting each other!” And they add, “Behold, we refuse to accept either of them as true!”",
      "juz_number": 20
    },
    "49": {
      "text_tafsir_en": "God sent Muhammad to challenge the disbelievers of Mecca who said that Moses and Muhammad were magicians, and that the Torah and the Qur'an were mere magic, to bring forth a book from Allah's guidance that was more direct and more beneficial than both. . The Prophet assured them that he was willing to leave the Qur'an if they were true to their confession, and could actually bring the book in question.",
      "text_tafsir": "Allah menyuruh Muhammad menantang orang-orang kafir Mekah yang mengatakan bahwa Musa dan Muhammad adalah ahli sihir, dan Taurat dan Al-Qur'an adalah sihir belaka, untuk mendatangkan sebuah kitab dari sisi Allah yang lebih memberi petunjuk dan lebih mendatangkan kemaslahatan daripada kedua kitab itu. Nabi menegaskan kepada mereka bahwa dia bersedia meninggalkan Al-Qur'an apabila mereka itu benar dalam pengakuan mereka, dan benar-benar dapat mendatangkan kitab yang dimaksud.",
      "text_translation": "Katakanlah (Muhammad), “Datangkanlah olehmu sebuah kitab dari sisi Allah yang kitab itu lebih memberi petunjuk daripada keduanya (Taurat dan Al-Qur'an), niscaya aku mengikutinya, jika kamu orang yang benar.”",
      "text": "قُلْ فَأْتُوْا بِكِتٰبٍ مِّنْ عِنْدِ اللّٰهِ هُوَ اَهْدٰى مِنْهُمَآ اَتَّبِعْهُ اِنْ كُنْتُمْ صٰدِقِيْنَ ",
      "text_translation_en": "Say: “Produce, then, [another] revelation from God which would offer better guidance than either of these two [and] I shall follow it, if you speak the truth!”",
      "juz_number": 20
    },
    "50": {
      "text_tafsir_en": "This verse explains that if the unbelievers could not meet the challenge of the Prophet to bring a book from Allah that guarantees happiness more than the Torah and the Qur'an, then that means that their rebellion is really just a mere impulse, and they follow the devil's request. which is completely unreasonable. The only people who follow their passions and follow the devil's enticements without the guidance of God, are the most perverted and the most perverted. Therefore, Allah forbids following their passions as they will be led astray from the right path. Those who go astray from the way of Allah will receive a severe punishment, says Allah: (O God), \"O David! Verily, We have appointed you as a Caliph on the earth; You are following the lust, for it will lead you astray from the way of Allah. Indeed, those who go astray from the way of Allah will suffer heavy punishment, for they forget the day of reckoning. \" (shad \/ 38: 26) At the end of verse 50 it is emphasized that Allah will not guide the wrongdoers and always abandon Allah's commands, break His prohibition, reject His apostles, follow the desires of the lust, and prefer obedience to the devil out of obedience to God. Those who do wrong will receive a terrible torment in the hereafter. Allah's Word: Verily, they have disobeyed what you said, so you will not refuse, nor will you help, and whoever among you will do wrong, feel for him a great punishment. (al-Furqan \/ 25: 19) And His saying: But the (disputed) groups are at variance between them; then woe to those who are unjust because of the torment on a painful day (Resurrection). (az-Zukhruf43: 65)",
      "text_tafsir": "Ayat ini menerangkan bahwa kalau orang-orang musyrik itu tidak dapat memenuhi tantangan Nabi mendatangkan kitab dari sisi Allah yang lebih menjamin kebahagiaan daripada Taurat dan Al-Qur'an, maka itu berarti bahwa pembangkangan mereka sesungguhnya hanyalah dorongan hawa nafsu belaka, dan mengikuti ajakan setan yang tidak beralasan sama sekali. Orang-orang yang hanya mengikuti hawa nafsunya dan menuruti bujukan setan tanpa ada petunjuk dari Allah, adalah orang-orang yang sangat sesat bahkan paling sesat. Oleh sebab itu, Allah melarang mengikuti hawa nafsu karena akan menyesatkan dari jalan yang benar. Orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, firman Allah:\n\n(Allah berfirman), \"Wahai Daud! Sesungguhnya engkau Kami jadikan khalifah (penguasa) di bumi, maka berilah keputusan (perkara) di antara manusia dengan adil dan janganlah engkau mengikuti hawa nafsu, karena akan menyesatkan engkau dari jalan Allah. Sungguh, orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan.\" (shad\/38: 26)\n\nPada akhir ayat 50 ini ditegaskan bahwa Allah tidak akan memberi petunjuk kepada orang yang zalim dan selalu meninggalkan perintah Allah, melanggar larangan-Nya, mendustakan rasul-Nya, mengikuti kemauan hawa nafsu, dan lebih mengutamakan ketaatan kepada setan daripada ketaatan kepada Allah. Orang-orang zalim itu akan mendapat azab yang amat pedih di akhirat. Firman Allah:\n\nMaka sungguh, mereka (yang disembah itu) telah mengingkari apa yang kamu katakan, maka kamu tidak akan dapat menolak (azab) dan tidak dapat (pula) menolong (dirimu), dan barang siapa di antara kamu berbuat zalim, niscaya Kami rasakan kepadanya azab yang besar. (al-Furqan\/25: 19)\n\nDan firman-Nya:\n\nTetapi golongan-golongan (yang ada) saling berselisih di antara mereka; maka celakalah orang-orang yang zalim karena azab pada hari yang pedih (Kiamat). (az-Zukhruf43: 65)",
      "text_translation": "Maka jika mereka tidak menjawab (tantanganmu), maka ketahuilah bahwa mereka hanyalah mengikuti keinginan mereka. Dan siapakah yang lebih sesat daripada orang yang mengikuti keinginannya tanpa mendapat petunjuk dari Allah sedikit pun? Sungguh, Allah tidak memberi petunjuk kepada orang-orang yang zalim.",
      "text": "فَاِنْ لَّمْ يَسْتَجِيْبُوْا لَكَ فَاعْلَمْ اَنَّمَا يَتَّبِعُوْنَ اَهْوَاۤءَهُمْۗ وَمَنْ اَضَلُّ مِمَّنِ اتَّبَعَ هَوٰىهُ بِغَيْرِ هُدًى مِّنَ اللّٰهِ ۗاِنَّ اللّٰهَ لَا يَهْدِى الْقَوْمَ الظّٰلِمِيْنَ ࣖ",
      "text_translation_en": "And since they cannot respond to this thy challenge, know that they are following only their own likes and dislikes: and who could be more astray than he who follows [but] his own likes and dislikes without any guidance from God? Verily, God does not grace with His guidance peo­ple who are given to evildoing!",
      "juz_number": 20
    },
    "51": {
      "text_tafsir_en": "This verse explains that Allah revealed the Qur'an in stages, part by part in accordance with the wisdom that He has outlined, so that it is easy to read, remember, understand, and can strengthen the heart and strengthen the faith. This is an answer to the requests of unbelievers who want the Qur'an to be revealed at once. The Word of God: And the disbelievers say, \"Why wasn't the Qur'an revealed to him at once?\" So that We strengthen your heart (Muhammad) with it and We read it in tartil (gradually, slowly and correctly). (al-Furqan \/ 25: 32)",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menurunkan Al-Qur'an secara bertahap, sebagian demi sebagian sesuai dengan kebijaksanaan yang telah digariskan-Nya, agar mudah dibaca, diingat, dipahami, dan bisa memantapkan hati dan menguatkan iman. Ini merupakan jawaban atas permintaan orang-orang kafir yang menghendaki Al-Qur'an itu diturunkan sekaligus. Firman Allah:\n\nDan orang-orang kafir berkata, \"Mengapa Al-Qur'an itu tidak diturunkan kepadanya sekaligus?\" Demikianlah agar Kami memperteguh hatimu (Muhammad) dengannya dan Kami membacakannya secara tartil (berangsur-angsur, perlahan dan benar). (al-Furqan\/25: 32)",
      "text_translation": "Dan sungguh, Kami telah menyampaikan perkataan ini (Al-Qur'an) kepada mereka agar mereka selalu mengingatnya.",
      "text": "۞ وَلَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُوْنَ ۗ ",
      "text_translation_en": "NOW, INDEED, We have caused this word [of Ours] to reach mankind step by step, so that they might [learn to] keep it in mind.",
      "juz_number": 20
    },
    "52": {
      "text_tafsir_en": "This verse explains that the Bible scholars who believed in the Torah and the Gospel, and met the prophecies of Muhammad, also believed in the Qur'an. They find in their scriptures exciting news about the Qur'an and the matching of the Qur'anic attributes with the qualities described in their books. This is also explained in another verse: And indeed among the People of the Scripture are those who believe in Allah, and what is revealed to you, and what is revealed to them, because they are humble to God. (ali 'Imran \/ 3: 199) And he says: Those to whom We have given the Book, they read it as they should, they believe in it. (al-Baqarah \/ 2: 121)",
      "text_tafsir": "Ayat ini menerangkan bahwa Ahli Kitab yang percaya kepada Taurat dan Injil, dan bertemu dengan masa kenabian Muhammad saw, juga percaya kepada Al-Qur'an. Mereka menemukan dalam kitab suci mereka berita yang menggembirakan tentang Al-Qur'an dan kecocokan sifat-sifat Al-Qur'an dengan sifat-sifat yang dijelaskan di dalam kitab mereka. Hal ini dijelaskan pula di dalam ayat yang lain: \n\nDan sesungguhnya di antara Ahli Kitab ada yang beriman kepada Allah, dan kepada apa yang diturunkan kepada kamu, dan yang diturunkan kepada mereka, karena mereka berendah hati kepada Allah. (ali 'Imran\/3: 199) \n\nDan firman-Nya:\n\nOrang-orang yang telah Kami beri Kitab, mereka membacanya sebagaimana mestinya, mereka itulah yang beriman kepadanya. (al-Baqarah\/2: 121)",
      "text_translation": "Orang-orang yang telah Kami berikan kepada mereka Al-Kitab sebelum Al-Qur'an, mereka beriman (pula) kepadanya (Al-Qur'an).",
      "text": "اَلَّذِيْنَ اٰتَيْنٰهُمُ الْكِتٰبَ مِنْ قَبْلِهٖ هُمْ بِهٖ يُؤْمِنُوْنَ ",
      "text_translation_en": "As for those unto whom We have vouchsafed revelation aforetime - they [are bound to] believe in this one [as well];",
      "juz_number": 20
    },
    "53": {
      "text_tafsir_en": "This verse explains that when the Qur'an was read to them, they recognized that the Qur'an was really from Allah. In fact, they have justified it before being revealed because they have discovered the characteristics of Muhammad and the qualities of the Qur'an in their holy books. The People of the Book's Trust in the Qur'an has long been because their ancestors read the description of the attributes of the Qur'an in their holy books. This custom applies from generation to generation to his grandchildren long before the Qur'an was revealed.",
      "text_tafsir": "Ayat ini menerangkan bahwa apabila Al-Qur'an dibacakan kepada mereka, mereka mengakui bahwa Al-Qur'an itu benar-benar dari Allah. Bahkan, mereka telah membenarkannya sebelum diturunkan karena mereka telah menemukan sifat-sifat Muhammad dan sifat-sifat Al-Qur'an dalam kitab suci mereka. Kepercayaan Ahli Kitab kepada Al-Qur'an sudah sejak dulu karena nenek moyang mereka membaca uraian tentang sifat-sifat Al-Qur'an dalam kitab suci mereka. Kebiasaan ini berlaku turun-temurun sampai ke anak cucunya jauh sebelum Al-Qur'an itu diturunkan.",
      "text_translation": "Dan apabila (Al-Qur'an) dibacakan kepada mereka, mereka berkata, “Kami beriman kepadanya, sesungguhnya (Al-Qur'an) itu adalah suatu kebenaran dari Tuhan kami. Sungguh, sebelumnya kami adalah orang muslim.”",
      "text": "وَاِذَا يُتْلٰى عَلَيْهِمْ قَالُوْٓا اٰمَنَّا بِهٖٓ اِنَّهُ الْحَقُّ مِنْ رَّبِّنَآ اِنَّا كُنَّا مِنْ قَبْلِهٖ مُسْلِمِيْنَ ",
      "text_translation_en": "and whenever it is [clearly] conveyed unto them, they [are bound to] profess, “We have come to believe in it, for, behold, it is the truth from our Sustainer - and, verily, even before this have we surrendered ourselves unto Him!”",
      "juz_number": 20
    },
    "54": {
      "text_tafsir_en": "This verse explains that those who believe in the Qur'an after believing in the ancient scriptures will be rewarded twice. Rewards for trusting in their scriptures, and rewards for trusting in the Qur'an. It takes patience and perseverance to defend their faith. The slander and trials they must face must be very serious, even when they are treated unfairly because they follow Muhammad and follow his religion. There are three types of people who are rewarded twice as described in the words of the Prophet Muhammad: Three people are rewarded twice, each twice. A Bookkeeper believed in his prophet, then he found time (Muhammad saw) and he believed in him and followed him and justified him for two merits. The servant of the servant who bestows the rights of Allah 'Azza wa Jalla and the rights of his master, then for him there are two rewards. And a man who had a maidservant slave and fed him, and gave him a good education, then he divorced her and married her, for him there were two merits. \" they also have some qualities that bring them closer to God, including: 1.They reject evil with good: what they hear is offensive, in the form of such and such, not responded but welcomed calmly and even forgiven. God has given them the right way, and they have also provided for them alms and good deeds. Destroy (your treasure) in the way of Allah. (al-Baqarah \/ 2: 195) And He says: O you who believe! k-well. (al-Baqarah \/ 2: 267)",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang percaya kepada Al-Qur'an sesudah mereka percaya kepada kitab-kitab suci sebelumnya, akan diberikan pahala dua kali lipat. Pahala atas kepercayaan mereka kepada kitab-kitab suci mereka, dan pahala atas kepercayaan mereka kepada Al-Qur'an. Diperlukan kesabaran dan ketabahan untuk mempertahankan kepercayaan mereka. Fitnah dan cobaan yang harus dihadapi tentu sangat berat, bahkan mereka mendapat perlakuan yang tidak wajar karena mereka mengikuti Muhammad dan menganut agamanya.\n\nAda tiga macam orang yang mendapat pahala dua kali lipat sebagaimana dijelaskan di dalam sabda Nabi Muhammad:\n\nTiga golongan orang yang diberi pahala, masing-masing dua kali lipat. Seorang Ahli Kitab yang percaya kepada nabinya, kemudian ia mendapati masa (Muhammad saw) maka ia beriman pula kepadanya dan mengikutinya serta membenarkannya maka baginya dua pahala. Hamba sahaya yang menunaikan hak Allah 'Azza wa Jalla dan hak tuannya, maka baginya dua pahala. Dan seorang yang mempunyai hamba sahaya perempuan lalu ia memberi makan, dan memberinya pendidikan yang baik, kemudian ia memerdekakannya lalu menikahinya, maka baginya dua pahala.\" (Riwayat al-Bukhari dari Abu Musa al-Asy'ari).\n\nSelain kesabaran dan ketabahan, mereka juga mempunyai beberapa sifat yang menjadikan mereka dekat kepada Allah, antara lain:\n\n1.Mereka menolak kejahatan dengan kebaikan. Apa yang mereka dengar yang menyakitkan hati, berupa cacian dan sebagainya, tidak dibalas tetapi disambut dengan tenang bahkan dimaafkan. \n\n2.Mereka menginfakkan rezeki yang diberikan Allah ke jalan yang benar. Mereka memperoleh rezeki juga dengan halal dan baik. Mereka mengeluarkan zakat, belanja rumah tangga, bederma untuk pembangunan masjid, madrasah, pengajian, pembinaan dan pemeliharaan anak yatim, dan lain sebagainya. Dalam firman-Nya:\n\nDan infakkanlah (hartamu) di jalan Allah. (al-Baqarah\/2: 195) \n\nDan firman-Nya:\n\nWahai orang-orang yang beriman! Infakkanlah sebagian dari hasil usahamu yang baik-baik. (al-Baqarah\/2: 267)",
      "text_translation": "Mereka itu diberi pahala dua kali (karena beriman kepada Taurat dan Al-Qur'an) disebabkan kesabaran mereka, dan mereka menolak kejahatan dengan kebaikan, dan menginfakkan sebagian dari rezeki yang telah Kami berikan kepada mereka.",
      "text": "اُولٰۤىِٕكَ يُؤْتَوْنَ اَجْرَهُمْ مَّرَّتَيْنِ بِمَا صَبَرُوْا وَيَدْرَءُوْنَ بِالْحَسَنَةِ السَّيِّئَةَ وَمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ ",
      "text_translation_en": "These it is that shall receive a twofold reward for having been patient in adversity, and having repelled evil with good, and having spent on others out of what We provided for them as sus­tenance,",
      "juz_number": 20
    },
    "55": {
      "text_tafsir_en": "This verse describes the third characteristic of those who draw near to God, that when they hear unprofitable words, both worldly and the hereafter, such as blasphemy, ridicule, etc., they turn away and do not serve them. When they are treated harshly or hurt by words or actions, they do not respond in the same way. Instead, they calmly confronted them and said, \"To us our deeds will not be rewarded nor rewarded for you. For your deeds, we will demand nothing of them, nor will we seek revenge. Peace be upon you, we do not want to do as you do. \" The Word of God: And those who do not give false testimony, and when they meet (those) who do unprofitable things, they pass by keeping their honor. (al-Furqan \/ 25: 72) Muhammad bin Isaac recounts having visited the Prophet in Mecca twenty times more than the people of Nasara Habasyah after hearing the news of him. They found the Prophet in the mosque, and they sat down together. Around the Ka'ba at that time leaders of the Quraysh were sitting together. The Prophet then called on the people of Nasara Habasyah to believe in Allah and to recite to them the Qur'an. When they heard the verses of the Qur'an, they wept bitterly and spontaneously believed in God and believed in him and justified him. They knew that the attributes they witnessed in the Messenger of Allah were similar to those described in their scriptures. When they left the Prophet Muhammad, they were intercepted by Abu Jahal bin Hisham and some of the Quraysh and they said, \"May Allah thwart your intentions, you are sent by your friends only to find out Muhammad's personal characteristics and to inform them. You have been influenced and left your religion and justify what Muhammad said. We do not see any more ignorant entourage than you. \" Hearing the sharp and sharp words of Abu Jahal bin Hisham, they said, \"Farewell to you, we will not retaliate against you. To us our deeds, and to you your deeds.\"",
      "text_tafsir": "Ayat ini menerangkan tentang sifat yang ketiga dari orang-orang yang mendekatkan diri kepada Allah yaitu apabila mereka mendengar perkataan yang tidak bermanfaat, baik mengenai urusan dunia maupun akhirat, seperti cacian, cemoohan, dan sebagainya, mereka berpaling dan tidak melayaninya. Apabila mereka diperlakukan kasar atau disakiti dengan kata-kata atau perbuatan, mereka tidak membalasnya dengan tindakan serupa. Akan tetapi, mereka menghadapinya dengan tenang dan berkata, \"Bagi kami amal-amal kami, kamu tidak akan diberi pahala dan tidak pula diganjar karenanya. Bagimu amal-amalmu, kami tidak akan menuntut sedikit pun dari perbuatan itu, dan tidak akan berusaha membalasnya. Kedamaian atasmu, kami tidak ingin berbuat sebagaimana kamu berbuat.\" Firman Allah:\n\nDan orang-orang yang tidak memberikan kesaksian palsu, dan apabila mereka bertemu dengan (orang-orang) yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, mereka berlalu dengan menjaga kehormatan dirinya. (al-Furqan\/25: 72) \n\nDiriwayatkan oleh Muhammad bin Ishak bahwa telah berkunjung kepada Rasulullah di Mekah dua puluh orang lebih dari kaum Nasara Habasyah setelah mendengar berita tentang beliau. Mereka menemui Nabi di dalam masjid, kemudian mereka duduk bersama-sama. Di sekeliling Ka'bah pada waktu itu tokoh-tokoh kaum Quraisy sedang duduk berkumpul. Rasulullah kemudian menyeru kaum Nasara Habasyah untuk beriman kepada Allah dan membacakan kepada mereka Al-Qur'an. Setelah mereka mendengar ayat-ayat Al-Qur'an, mereka menangis tersedu-sedu dan dengan spontan beriman kepada Allah serta percaya kepada beliau dan membenarkannya. Mereka mengetahui bahwa sifat-sifat yang mereka saksikan pada diri Rasulullah sama dengan sifat-sifat yang telah diterangkan di dalam kitab suci mereka. \n\nKetika meninggalkan Nabi Muhammad, mereka dicegat oleh Abu Jahal bin Hisyam dan beberapa orang Quraisy dan mereka mengatakan, \"Semoga Allah menggagalkan niatmu, kalian diutus oleh teman-teman kalian hanya untuk mengetahui sifat-sifat pribadi Muhammad lalu memberitahukan kepada mereka. Akan tetapi, kenyataannya kalian sudah terpengaruh lalu meninggalkan agama kalian dan membenarkan apa yang dikatakan Muhammad. Kami tidak melihat ada rombongan yang lebih bodoh dari kalian.\" Mendengar kata-kata pedas dan tajam dari Abu Jahal bin Hisyam, mereka menjawab, \"Selamat tinggal buat kamu, kami tidak akan membalas dan berbuat jahat kepadamu. Bagi kami amal-amal kami, dan bagimu amal-amalmu.\"",
      "text_translation": "Dan apabila mereka mendengar perkataan yang buruk, mereka berpaling darinya dan berkata, “Bagi kami amal-amal kami dan bagimu amal-amal kamu, semoga selamatlah kamu, kami tidak ingin (bergaul) dengan orang-orang bodoh.”",
      "text": "وَاِذَا سَمِعُوا اللَّغْوَ اَعْرَضُوْا عَنْهُ وَقَالُوْا لَنَآ اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْ ۖسَلٰمٌ عَلَيْكُمْ ۖ لَا نَبْتَغِى الْجٰهِلِيْنَ",
      "text_translation_en": "and, whenever they heard frivolous talk, having turned away from it and said: “Unto us shall be accounted Our deeds, and unto you, your deeds. Peace be upon you - [but] we do not seek out such as are ignorant [of the meaning of right and wrong].”",
      "juz_number": 20
    },
    "56": {
      "text_tafsir_en": "This verse explains that Muhammad could not make his people obey and obey the religion he brought, even if he was working hard. It is only his duty to convey it and only God will guide him to whom He wills. He has deep wisdom and reason enough. The same is stated in other verses in the Qur'an. It is not your duty (Muhammad) to guide them, but it is Allah who guides whom He wills. (al-Baqarah \/ 2: 272) And his word: And most men will not believe even though you desire it. (Joseph \/ 12: 103) At the end of this verse, God emphasizes that He is more aware of those who are willing and worthy of such guidance. Among them are the Scripture Readers who have been referred to in the previous verses. Instead of those who are not prepared to receive guidance like some of the Prophet's relatives, guidance will not be given to them.",
      "text_tafsir": "Ayat ini menerangkan bahwa Muhammad tidak dapat menjadikan kaumnya untuk taat dan menganut agama yang dibawanya, sekalipun ia berusaha sekuat tenaga. Ia hanya berkewajiban menyampaikan dan hanya Allah yang akan memberi petunjuk kepada orang yang dikehendaki-Nya. Dia yang mempunyai kebijaksanaan yang mendalam dan alasan yang cukup. Hal tersebut ditegaskan pula pada ayat lain di dalam Al-Qur'an.\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah\/2: 272) \n\nDan firman-Nya:\n\nDan kebanyakan manusia tidak akan beriman walaupun engkau sangat menginginkannya. (Yusuf\/12:103)\n\nPada akhir ayat ini, Allah menegaskan bahwa Dia lebih mengetahui siapa orang-orang yang bersedia dan pantas menerima hidayah itu. Di antara mereka ialah orang-orang Ahli Kitab yang pernah dikisahkan peristiwanya pada ayat-ayat yang lalu. Sebaliknya orang-orang yang tidak bersedia menerima hidayah seperti beberapa kerabat Nabi, maka hidayah tidak akan diberikan kepada mereka.",
      "text_translation": "Sungguh, engkau (Muhammad) tidak dapat memberi petunjuk kepada orang yang engkau kasihi, tetapi Allah memberi petunjuk kepada orang yang Dia kehendaki, dan Dia lebih mengetahui orang-orang yang mau menerima  petunjuk.",
      "text": "اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ وَلٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَاۤءُ ۚوَهُوَ اَعْلَمُ بِالْمُهْتَدِيْنَ ",
      "text_translation_en": "VERILY, thou canst not guide aright everyone whom thou lovest: but it is God who guides him that wills [to be guided]; and He is fully aware of all who would let themselves be guided.",
      "juz_number": 20
    },
    "57": {
      "text_tafsir_en": "Ibn Jarir, of Ibn 'Abbas, narrated that this verse came down to al-haris bin Uthman bin' Abd Manaf when he and some other Quraysh came to the Prophet and they said to the Prophet, \"We know that what you say is true.\" However, the only thing that hinders us from following your religion is the Arabs who will oppress us and expel us from our country, and we have no will to fight against them. \" This verse explains that some Meccans have come up with reasons that are not acceptable to the healthy mind. They said, \"If we follow the guidance Muhammad gave us, and the religion that was passed down to him, we are afraid of being expelled from our country. Arabs and Arab leaders will also oppress us with violence while we cannot fight them. . \" With this warning it appears that they are more afraid of the creatures than the God who created them. They never imagined that they would be punished. They forget that they are in the area of the Haram which has always been respected, safe and rich in sustenance and fruit. Do they think they will remain safe and prosperous in the safe harbor if they remain in disbelief and idolatry. Not a few of them are ignorant and unaware of the grace and punishment of Allah which will be given to every person according to their good and bad deeds. They should know that their abundant provision comes from God. Therefore, He is the one to be feared and obeyed not by man, the weak and the weak.",
      "text_tafsir": "Diriwayatkan oleh Ibnu Jarir dari Ibnu 'Abbas bahwa ayat ini turun berkenaan dengan al-haris bin Utsman bin 'Abd Manaf ketika ia dan beberapa orang Quraisy lainnya mendatangi Nabi saw dan mereka berkata kepada Nabi, \"Kami telah mengetahui bahwa apa yang engkau katakan itu benar. Akan tetapi, yang menghalangi kami mengikuti agamamu ialah orang-orang Arab yang akan memusuhi dan mengusir kami dari negeri kami, dan kami tidak mempunyai kesanggupan sedikit pun untuk melawan mereka.\"\n\nAyat ini menerangkan bahwa sebagian orang musyrik Mekah mengemukakan alasan yang tidak dapat diterima oleh pikiran yang sehat. Mereka berkata, \"Jika kami mengikuti petunjuk yang diberikan Muhammad kepada kami, dan agama yang diturunkan kepadanya, kami khawatir akan diusir dari negeri kami. Orang-orang musyrik serta tokoh-tokoh bangsa Arab juga akan memusuhi kami dengan kekerasan sedang kami tidak mampu melawan mereka.\" Dengan peringatan ini tampak bahwa mereka lebih takut kepada makhluk daripada Tuhan yang menciptakan mereka. Mereka tidak pernah membayangkan azab yang akan ditimpakan kepada mereka. \n\nMereka lupa bahwa mereka berada di daerah Haram yang sangat dihormati sejak dahulu kala, aman dan mendapat aneka macam rezeki dan buah-buahan. Apakah mereka mengira akan tetap aman dan sejahtera di daerah Haram yang aman itu kalau mereka tetap dalam kekafiran dan kemusyrikan. Tidak sedikit di antara mereka yang tidak mengetahui dan menyadari nikmat dan azab Allah yang akan diberikan kepada setiap orang sesuai dengan amal baik dan buruk mereka.\n\nMereka seharusnya mengetahui bahwa rezeki yang berlimpah itu datang dari Allah. Oleh karena itu, Dialah yang patut ditakuti dan ditaati bukan manusia, makhluk yang lemah dan serba kekurangan.",
      "text_translation": "Dan mereka berkata, “Jika kami mengikuti petunjuk bersama engkau, niscaya kami akan diusir dari negeri kami.” (Allah berfirman) Bukankah Kami telah meneguhkan kedudukan mereka dalam tanah haram (tanah suci) yang aman, yang didatangkan ke tempat itu buah-buahan dari segala macam (tumbuh-tumbuhan) sebagai rezeki (bagimu) dari sisi Kami? Tetapi kebanyakan mereka tidak mengetahui.",
      "text": "وَقَالُوْٓا اِنْ نَّتَّبِعِ الْهُدٰى مَعَكَ نُتَخَطَّفْ مِنْ اَرْضِنَاۗ اَوَلَمْ نُمَكِّنْ لَّهُمْ حَرَمًا اٰمِنًا يُّجْبٰٓى اِلَيْهِ ثَمَرٰتُ كُلِّ شَيْءٍ رِّزْقًا مِّنْ لَّدُنَّا وَلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ ",
      "text_translation_en": "Now some say, “If we were to follow the guidance to which thou invitest us, we would be torn away from our very soil!” Why - have We not established for them a sanc­tuary secure, to which, as a provision from Us, shall be gathered the fruits of all (good) things? But most of them are unaware [of this truth].",
      "juz_number": 20
    },
    "58": {
      "text_tafsir_en": "Many of the rest of the country are enjoying their rich wealth, but because they are always doing harm and not giving thanks to Allah, God destroys their land and only a few homes remain. While God will not destroy a nation while it is doing good, God says: And your Lord will not destroy the land for the sake of its inhabitants, for the sake of its inhabitants. (Hud \/ 11: 117) After the people were destroyed, their dwellings became desolate and prosperous, until the land returned to its true owner, God. The Word of Allah: And Allah hath made a parable (with) a land that was once peaceful and prosperous, sustenance came to him from all over, but his people turned away from the favors of Allah. , because of what they did. (Nahl \/ 16: 112)",
      "text_tafsir": "Banyak penduduk negeri yang semula hidup bersenang-senang dengan kekayaan berlimpah ruah, tetapi karena mereka selalu membuat kerusakan dan tidak mensyukuri nikmat Allah, maka Allah menghancurkan negeri mereka dan hanya sedikit saja rumah-rumah mereka yang tersisa. Padahal Allah tidak akan menghancurkan suatu negeri selama penduduk negeri itu berbuat kebaikan, firman Allah:\n\nDan Tuhanmu tidak akan membinasakan negeri-negeri secara zalim, selama penduduknya orang-orang yang berbuat kebaikan. (Hud\/11: 117) \n\nSetelah kaum itu hancur, maka tempat tinggal mereka menjadi gersang dan tidak dimakmurkan lagi, hingga negeri itu kembali kepada pemiliknya yang hakiki, yaitu Allah. Firman Allah:\n\nDan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri yang dahulunya aman lagi tenteram, rezeki datang kepadanya melimpah ruah dari segenap tempat, tetapi (penduduk)nya mengingkari nikmat-nikmat Allah, karena itu Allah menimpakan kepada mereka bencana kelaparan dan ketakutan, disebabkan apa yang mereka perbuat. (an-Nahl\/16: 112)",
      "text_translation": "Dan betapa banyak (penduduk) negeri yang sudah bersenang-senang dalam kehidupannya yang telah Kami binasakan, maka itulah tempat kediaman mereka yang tidak didiami (lagi) setelah mereka, kecuali sebagian kecil. Dan Kamilah yang mewarisinya.” ",
      "text": "وَكَمْ اَهْلَكْنَا مِنْ قَرْيَةٍ ۢ بَطِرَتْ مَعِيْشَتَهَا ۚفَتِلْكَ مَسٰكِنُهُمْ لَمْ تُسْكَنْ مِّنْۢ بَعْدِهِمْ اِلَّا قَلِيْلًاۗ وَكُنَّا نَحْنُ الْوَارِثِيْنَ ",
      "text_translation_en": "And how many a community that [once] exult­ed in its wanton wealth and ease of life have We destroyed, so that those dwelling-places of theirs – all but a few - have never been dwelt-in after them: for it is indeed We alone who shall remain when all else will have passed away!",
      "juz_number": 20
    },
    "59": {
      "text_tafsir_en": "This verse explains that in accordance with His law, God never destroyed a city, except first sending an apostle to that city to recite to His people the truths of Allah containing truth. The apostle was commissioned to call and warn them that they should believe in God, but they did not heed it. The Word of God: We will not suffer until We send an apostle. (al-Isra '\/ 17: 15) After God had sent the apostles to guide the city to the straight path, to guide the truth, but they continued to do wrong and to deny the apostle, to disregard his signs, he would destroy the city it and its people. The mass destruction of the people as happened to the ancient people did not occur to the people of Prophet Muhammad. He was the last prophet sent to all the world, so the total destruction has not happened. There are only partial or local destruction such as natural disasters, natural disasters, earthquakes, tsunamis, and so on. Muhammad's decision as the last prophet means that Allah will not send any prophet or apostle after him. While the task of “the task of preaching and the responsibility of warning the people rests upon the shoulders of the scholars.",
      "text_tafsir": "Ayat ini menerangkan bahwa sesuai dengan sunah-Nya, Allah tidak pernah membinasakan suatu kota, kecuali terlebih dahulu mengutus seorang rasul ke kota itu untuk membacakan kepada penduduknya ayat-ayat Allah yang berisi kebenaran. Rasul itu ditugaskan untuk menyeru dan memberi peringatan kepada mereka supaya mereka itu beriman kepada Allah, namun mereka tidak mengindahkannya. Firman Allah:\n\nKami tidak akan menyiksa sebelum Kami mengutus seorang rasul. (al-Isra'\/17: 15)\n\nSesudah Allah mengutus rasul untuk membimbing penduduk kota itu ke jalan yang lurus, memberi petunjuk kepada kebenaran, tetapi mereka tetap melakukan kezaliman dan mendustakan rasul, mengingkari ayat-ayat-Nya, maka Dia akan membinasakan kota itu beserta penduduknya. \n\nPembinasaan umat secara besar-besaran sebagaimana terjadi pada umat-umat terdahulu tidak terjadi pada umat Nabi Muhammad. Beliau adalah nabi terakhir yang diutus bagi seluruh alam, sehingga pembinasaan total sudah tidak terjadi lagi. Yang ada hanyalah pembinasaan parsial atau lokal seperti bencana penyakit, bencana alam, gempa bumi, gelombang tsunami, dan sebagainya.\n\nPengutusan Muhammad saw sebagai nabi terakhir berarti Allah tidak akan mengutus nabi atau rasul setelah beliau. Sedangkan tugas“tugas dakwah dan tanggung jawab memberi peringatan kepada umat terletak di pundak para ulama.",
      "text_translation": "Dan Tuhanmu tidak akan membinasakan negeri-negeri, sebelum Dia mengutus seorang rasul di ibukotanya yang membacakan ayat-ayat Kami kepada mereka; dan tidak pernah (pula) Kami membinasakan (penduduk) negeri; kecuali penduduknya melakukan kezaliman. ",
      "text": "وَمَا كَانَ رَبُّكَ مُهْلِكَ الْقُرٰى حَتّٰى يَبْعَثَ فِيْٓ اُمِّهَا رَسُوْلًا يَّتْلُوْا عَلَيْهِمْ اٰيٰتِنَاۚ وَمَا كُنَّا مُهْلِكِى الْقُرٰىٓ اِلَّا وَاَهْلُهَا ظٰلِمُوْنَ ",
      "text_translation_en": "Yet, withal, thy Sustainer would never destroy a community without having [first] raised in its midst an apostle who would convey unto them Our mes­sages; and never would We destroy a community unless its people are wont to do wrong [to one another].",
      "juz_number": 20
    },
    "60": {
      "text_tafsir_en": "This verse explains that what God has given to humans in the form of material possessions or offspring is only worldly pleasure. Life in the world with all its ornaments does not guarantee their safety and happiness. On the other hand, the rewards that are on the side of God given to His obedient servants are better, because they are eternal and eternal. It is different from worldly pleasures which he adores because his time is very limited, and after that it is exhausted and extinct. God's Word: And what is with Allah is better for those who are dedicated. (Ali 'Imran \/ 3: 198) What is by your side will disappear, and what is with Allah is eternal. (an-Nahl \/ 16: 96) And the life of this world is only a joke and a game. And in fact the afterlife is the real life, if only they knew. (al-'Ankabut \/ 29: 64) While you (unbelievers) choose the life of the world, even though the afterlife is better and more eternal. (al-A'la \/ 87: 16-17) This verse closes with a question that is mocked as well as a warning from God. Why don't they want to use their minds, and think deeply so they know what's good and what's not. Do they think world life with all its mortal pleasures and can be enjoyed in a very short time is better than that of eternal and eternal life.",
      "text_tafsir": "Ayat ini menerangkan bahwa apa yang diberikan Allah bagi manusia baik berupa harta benda maupun keturunan hanya merupakan kesenangan duniawi. Kehidupan dunia dengan segala perhiasannya belum tentu menjamin keselamatan dan kebahagiaan mereka. Sebaliknya, pahala yang ada di sisi Allah yang diberikan kepada hamba-hamba-Nya yang taat adalah lebih baik, karena yang demikian itu kekal dan abadi. Berbeda dengan kesenangan duniawi yang dipujanya karena waktunya terbatas sekali, dan sesudah itu habis dan punah. Firman Allah:\n\nDan apa yang di sisi Allah lebih baik bagi orang-orang yang berbakti. (ali 'Imran\/3: 198) \n\nApa yang ada di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. (an-Nahl\/16: 96) \n\nDan kehidupan dunia ini hanya senda-gurau dan permainan. Dan sesungguhnya negeri akhirat itulah kehidupan yang sebenarnya, sekiranya mereka mengetahui. (al-'Ankabut\/29:64)\n\nSedangkan kamu (orang-orang kafir) memilih kehidupan dunia, padahal kehidupan akhirat itu lebih baik dan lebih kekal. (al-A'la\/87: 16-17)\n\nAyat ini ditutup dengan pertanyaan yang bernada ejekan sekaligus peringatan dari Allah. Mengapa mereka tidak mau menggunakan akalnya, dan berpikir secara mendalam sehingga mereka mengetahui mana yang baik dan mana yang tidak. Apakah menurut mereka kehidupan dunia dengan segala kenikmatannya yang fana dan bisa dinikmati dalam waktu yang sangat singkat lebih baik daripada kehidupan akhirat yang kekal dan abadi itu.",
      "text_translation": "Dan apa saja (kekayaan, jabatan, keturunan) yang diberikan kepada kamu, maka itu adalah kesenangan hidup duniawi dan perhiasannya; sedang apa yang di sisi Allah adalah lebih baik dan lebih kekal. Tidakkah kamu mengerti?",
      "text": "وَمَآ اُوْتِيْتُمْ مِّنْ شَيْءٍ فَمَتَاعُ الْحَيٰوةِ الدُّنْيَا وَزِيْنَتُهَا ۚوَمَا عِنْدَ اللّٰهِ خَيْرٌ وَّاَبْقٰىۗ اَفَلَا تَعْقِلُوْنَ ࣖ",
      "text_translation_en": "And [remember:] whatever you are given [now] is but for the [passing] enjoyment of life in this world, and for its embellishment - whereas that which is with God is [so much] better and more enduring. Will you not, then, use your reason?",
      "juz_number": 20
    },
    "61": {
      "text_tafsir_en": "This verse starts with a question to make sure that the disbelievers consciously think and compare which one is better. Will those who are promised by Allah if they obey and obey His commands and stay away from His prohibitions will be blessed with favors in the hereafter that are never seen by the eyes, heard by the ears, and never crossed someone's heart and they really get them in the afterlife. Which is better between those who obey God's commands and stay away from prohibitions with those who choose worldly pleasures but do not obey God's commands and work out His prohibitions. According to common sense, of course the first group is better than the second group. This verse shows that the disbelievers were given worldly pleasures, but in the hereafter were put into hell. The Word of God: Truly, hell is as bad a place to live and a place to live. (al-Furqan \/ 25: 66) While believers are patient and steadfast in facing the various trials of the world, because they are sure of God's promise, in the hereafter they will be put into heaven. God's Word: The inhabitants of heaven on that day are the best place to live and the most beautiful place to rest. (al-Furqan \/ 25: 24) The parable of heaven promised to the righteous (is like a garden), flowing beneath rivers; always bear fruit and shade. (ar-Ra'd \/ 13: 35)",
      "text_tafsir": "Ayat ini dimulai dengan pertanyaan untuk meyakinkan agar orang-orang kafir itu dengan penuh kesadaran berpikir dan membandingkan tentang mana yang lebih baik. Apakah orang-orang yang dijanjikan Allah apabila mereka taat dan menuruti perintah dan menjauhi larangan-Nya akan dikaruniai nikmat di akhirat yang tidak pernah dilihat oleh mata, didengar oleh telinga, dan tidak pernah terlintas dalam hati seseorang dan mereka benar-benar memperolehnya di akhirat.\n\nMana yang lebih baik antara orang yang taat menjalankan perintah Allah dan menjauhi larangan dengan orang yang memilih kesenangan duniawi tetapi tidak menaati perintah Allah dan mengerjakan larangan-larangan-Nya. Menurut akal yang sehat, tentu golongan pertama lebih baik dari golongan kedua. Ayat ini menunjukkan bahwa orang kafir diberi kesenangan duniawi, tetapi di akhirat dimasukkan ke dalam neraka. Firman Allah:\n\nSungguh, Jahanam itu seburuk-buruk tempat menetap dan tempat kediaman. (al-Furqan\/25: 66)\n\nSedang orang mukmin yang sabar dan tabah menghadapi berbagai cobaan dunia, karena yakin akan janji Allah, di akhirat nanti mereka dimasukkan ke dalam surga. Firman Allah:\n\nPenghuni-penghuni surga pada hari itu paling baik tempat tinggalnya dan paling indah tempat istirahatnya. (al-Furqan\/25: 24)\n\nPerumpamaan surga yang dijanjikan kepada orang yang bertakwa (ialah seperti taman), mengalir di bawahnya sungai-sungai; senantiasa berbuah dan teduh. (ar-Ra'd\/13: 35)",
      "text_translation": "Maka apakah sama orang yang Kami janjikan kepadanya suatu janji yang baik (surga) lalu dia memperolehnya, dengan orang yang Kami berikan kepadanya kesenangan hidup duniawi; kemudian pada hari Kiamat dia termasuk orang-orang yang diseret (ke dalam neraka)?",
      "text": "اَفَمَنْ وَّعَدْنٰهُ وَعْدًا حَسَنًا فَهُوَ لَاقِيْهِ كَمَنْ مَّتَّعْنٰهُ مَتَاعَ الْحَيٰوةِ الدُّنْيَا ثُمَّ هُوَ يَوْمَ الْقِيٰمَةِ مِنَ الْمُحْضَرِيْنَ ",
      "text_translation_en": "Is, then, he to whom We have given that goodly promise which he shall see fulfilled [on his resurrection] comparable to one on whom We have bestowed [all] the enjoyments of this worldly life but who, on Resurrection Day, will find himself among those that shall be arraigned [before Us]?",
      "juz_number": 20
    },
    "62": {
      "text_tafsir_en": "In this verse, Allah commands the Prophet (saw) to warn his people of the day when Allah calls on those who mislead and hinder mankind from the way of Allah. God will say to them, \"Where are my allies? Where are the angels, the spirits, and the idols that you consider to be my allies in the world? Can all these be freed from the torment that has come upon you?\" Of course not. This is presented only for contempt. In line with this verse God says: And you came to us as We created you at first, and what We gave you, you left behind (in the world). We do not see your intercessors (helpers) whom you consider to be allies (to Allah). Indeed, all (of you) have been cut off from you and have lost what you once thought (as an ally of Allah). (al-An'am \/ 6: 94)",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan Nabi saw untuk memperingatkan kaumnya tentang hari ketika Allah memanggil orang-orang yang menyesatkan dan menghalang-halangi manusia dari jalan Allah. Allah akan berkata kepada mereka, \"Mana sekutu-sekutu-Ku? Mana malaikat, jin, dan berhala-berhala yang kamu anggap sekutu-sekutu-Ku di dunia? Dapatkah semuanya itu melepaskan dari azab yang menimpamu?\" Tentu tidak. Hal ini dikemukakan sekedar penghinaan kepada mereka. Sejalan dengan ayat ini Allah berfirman:\n\nDan kamu benar-benar datang sendiri-sendiri kepada Kami sebagaimana Kami ciptakan kamu pada mulanya, dan apa yang telah Kami karuniakan kepadamu, kamu tinggalkan di belakangmu (di dunia). Kami tidak melihat pemberi syafaat (pertolongan) besertamu yang kamu anggap bahwa mereka itu sekutu-sekutu (bagi Allah). Sungguh, telah terputuslah (semua pertalian) antara kamu dan telah lenyap dari kamu apa yang dahulu kamu sangka (sebagai sekutu Allah). (al-An'am\/6: 94)",
      "text_translation": "Dan (ingatlah) pada hari ketika Dia (Allah) menyeru mereka dan berfirman, “Di manakah sekutu-sekutu-Ku yang dahulu kamu sangka?”",
      "text": "وَيَوْمَ يُنَادِيْهِمْ فَيَقُوْلُ اَيْنَ شُرَكَاۤءِيَ الَّذِيْنَ كُنْتُمْ تَزْعُمُوْنَ ",
      "text_translation_en": "For, on that Day He will call unto them, and will ask: “Where, now, are those [beings or powers] whom you imagined to have a share in My divinity?”",
      "juz_number": 20
    },
    "63": {
      "text_tafsir_en": "This verse explains the answers of the abusers and poets to the unbelievers who try to break free from their responsibility to mislead others. They were displeased with the wrath and with the threat of God by His word: I will surely fill Hell with the spirits and the human beings together. (as-Sajdah \/ 32: 13) The invaders to the disbelief finally went to hell. They said, \"O our Lord, they are what we have lost as well as we have gone astray. We have only invited them and they have followed our deceitful urges by our own will. There is no compulsion.\" When they are asked to believe in God, they ignore it at all, but it is a true one. This kind of event is similar to what will happen in the hereafter, which is the dialogue between the devil and the man whom he has misled, as God said: And the devil said when the matter (hisab) was resolved, \"Indeed, Allah has promised you the true promise, and I have I have no power over you, except I call upon you and you obey my voice, therefore do not despise me, but try on your own behalf: I cannot help you, and you cannot help me. I do not allow your actions to associate with me (with Allah) in the past. \" Truly, the unjust will receive a painful torment. (Ibrahim \/ 14: 22) The demon's self-defense by saying that the astrologer obeys his own will, not the pressure of him because he has no power over mankind, is strengthened by God's word to Satan: Verily you (Satan) have no power over My servants, except those who follow you, are astray. (al-hijr \/ 15: 42) The deceitful leaders claimed no responsibility to God for the acts of their followers, on the grounds that they did not worship him but the idols. Such events are mentioned in another verse, which is the word of Allah: (That is) when those who follow take their hands off those who follow, and they see the torment, and (when) all the relations between them are cut off. (al-Baqarah \/ 2: 166)",
      "text_tafsir": "Ayat ini menerangkan jawaban para penyesat dan pengajak kepada kekafiran yang berusaha melepaskan diri dari tanggung jawabnya menyesatkan orang lain. Mereka telah dipastikan mendapat kemurkaan dan yang telah mendapat ancaman dari Allah dengan firman-Nya:\n\nPasti akan Aku penuhi neraka Jahanam dengan jin dan manusia bersama-sama. (as-Sajdah\/32: 13)\n\nPara pengajak kepada kekafiran itu akhirnya masuk ke dalam neraka. Mereka berkata, \"Wahai Tuhan kami, mereka itulah yang telah kami sesatkan sebagaimana kami juga sesat. Kami sekadar mengajak mereka lalu mereka mengikuti ajakan kami yang menyesatkan itu dengan kemauan sendiri. Tidak ada paksaan sama sekali dari kami.\" Ketika mereka diajak untuk beriman kepada Allah, mereka tidak menghiraukannya sama sekali padahal ajakan itu adalah ajakan yang sebenarnya. Peristiwa semacam ini sama dengan peristiwa yang akan terjadi di akhirat yaitu dialog antara setan dengan manusia yang telah disesatkannya, sebagaimana firman Allah:\n\nDan setan berkata ketika perkara (hisab) telah diselesaikan, \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan aku pun telah menjanjikan kepadamu tetapi aku menyalahinya. Tidak ada kekuasaan bagiku terhadapmu, melainkan (sekadar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri. Aku tidak dapat menolongmu, dan kamu pun tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.\" Sungguh, orang yang zalim akan mendapat siksaan yang pedih. (Ibrahim\/14: 22) \n\nPembelaan diri setan dengan mengatakan bahwa orang yang sesat itu mematuhi ajakannya dengan kemauan mereka sendiri, bukan tekanan darinya karena ia tidak punya kekuasaan atas manusia, dikuatkan oleh firman Allah kepada Iblis:\n\nSesungguhnya kamu (Iblis) tidak kuasa atas hamba-hamba-Ku, kecuali mereka yang mengikutimu, yaitu orang yang sesat. (al-hijr\/15: 42)\n\nPemimpin-pemimpin yang menyesatkan itu menyatakan tidak bertanggung jawab kepada Allah atas perbuatan pengikut-pengikutnya, dengan alasan bahwa mereka tidak menyembah kepada-Nya tetapi kepada berhala-berhala. Kejadian seperti ini disebutkan dalam ayat yang lain yaitu firman Allah:\n\n(Yaitu) ketika orang-orang yang diikuti berlepas tangan dari orang-orang yang mengikuti, dan mereka melihat azab, dan (ketika) segala hubungan antara mereka terputus. (al-Baqarah\/2: 166)",
      "text_translation": "Orang-orang yang sudah pasti akan mendapatkan hukuman berkata, “Ya Tuhan kami, mereka inilah orang-orang yang kami sesatkan itu; kami telah menyesatkan mereka sebagaimana kami (sendiri) sesat, kami menyatakan kepada Engkau berlepas diri (dari mereka), mereka sekali-kali tidak menyembah kami.” ",
      "text": "قَالَ الَّذِيْنَ حَقَّ عَلَيْهِمُ الْقَوْلُ رَبَّنَا هٰٓؤُلَاۤءِ الَّذِيْنَ اَغْوَيْنَاۚ  اَغْوَيْنٰهُمْ كَمَا غَوَيْنَاۚ تَبَرَّأْنَآ اِلَيْكَ مَا كَانُوْٓا اِيَّانَا يَعْبُدُوْنَ ",
      "text_translation_en": "[whereupon] they against whom the word [of truth] shall thus stand revealed will exclaim: O our Sustainer! Those whom we caused to err so grievously, we but caused to err as we our­selves had been erring. We [now] disavow them before Thee: it was not us that they worshipped!”",
      "juz_number": 20
    },
    "64": {
      "text_tafsir_en": "In this verse it is explained that those who associate God with the gods and other religions of the world, are called upon their gods to be allies of Allah to reject the punishment that has come upon them. When they called him, the idols could not answer because they were powerless. This is done only to show the ignorance of those who are seen by all the inhabitants of the hereafter. Those who call and those who are called believe that they will be dragged to hell because of their sins, and they cannot escape and flee to another place, as the word of God says: inside, and they couldn't find a place to turn from it. (al-Kahf \/ 18: 53) After seeing the torment that was upon them, they regretted that when they were alive in the world they had received guidance and faith in God. However, that assumption is just a wish that cannot be fulfilled.",
      "text_tafsir": "Pada ayat ini diterangkan bahwa mereka yang menyekutukan Allah dengan tuhan-tuhan dan sembahan-sembahan lain di dunia, disuruh memanggil tuhan-tuhan mereka yang dijadikan sekutu Allah untuk menolak azab yang menimpa mereka. Ketika mereka memanggilnya, berhala-berhala itu tentu tidak bisa menjawab karena tidak berdaya sedikit pun. Hal ini dilakukan hanya untuk memperlihatkan kebodohan mereka yang disaksikan oleh segenap penghuni akhirat. Mereka yang memanggil dan yang dipanggil yakin bahwa mereka akan diseret ke neraka karena dosa-dosa mereka, dan mereka sudah tidak dapat mengelak dan lari ke tempat lain, sebagaimana firman Allah:\n\nDan orang yang berdosa melihat neraka, lalu mereka menduga bahwa mereka akan jatuh ke dalamnya, dan mereka tidak menemukan tempat berpaling darinya. (al-Kahf\/18: 53)\n\nSetelah menyaksikan azab yang akan menimpa mereka, ketika itu mereka menyesal seandainya dahulu ketika masih hidup di dunia mereka menerima petunjuk dan beriman kepada Allah. Akan tetapi, pengandaian itu hanya merupakan angan-angan yang tidak mungkin terlaksana.",
      "text_translation": "Dan dikatakan (kepada mereka), “Serulah sekutu-sekutumu,” lalu mereka menyerunya, tetapi yang diseru tidak menyambutnya, dan mereka melihat azab. (Mereka itu berkeinginan) sekiranya mereka dahulu menerima petunjuk. ",
      "text": "وَقِيْلَ ادْعُوْا شُرَكَاۤءَكُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيْبُوْا لَهُمْ ۗوَرَاَوُا الْعَذَابَۚ  لَوْ اَنَّهُمْ كَانُوْا يَهْتَدُوْنَ",
      "text_translation_en": "And [they] will be told: “Call [now] unto those [beings or powers] to whom you were wont to ascribe a share in God’s divinity!” and they will call unto them [for help], but those [fake objects of worship] will not respond to them: whereupon they will see the suffering [that awaits them - the suffering which could have been avoided] if only they had allowed them­selves to be guided!",
      "juz_number": 20
    },
    "65": {
      "text_tafsir_en": "After they were told that their actions in fellowship with God were misguided, then in response to their actions, they were asked in this verse how they responded to the call of the apostles to purify themselves from idolatry, and to invoke faith in Allah. They are silent in a thousand languages, unable to give any reason as to the answer to the statement issued. They are confused as to what to say. Therefore, they ask each other, as if they were having a hard time. They are subject to shame and regret. If the apostles could not answer the questions raised to him about the answer and the response of his people to his appeal to them, surely the perverted and deceitful people in the world who would not heed the cries of the prophets were more anxious. The Word of God: (Remember) the day when He gathered the apostles, and He asked them, \"What is the answer of your people?\" They said, \"We do not know. You are the All-Knower of the Unseen.\" (al-Ma'idah \/ 5: 109)",
      "text_tafsir": "Sesudah dinyatakan kepada mereka bahwa tindakan mereka mempersekutukan Allah adalah sesat, maka sebagai cercaan atas perbuatannya, itu pada ayat ini ditanyakan kepada mereka tentang bagaimana cara mereka menyambut seruan para rasul untuk membersihkan diri dari penyembahan berhala, dan mengajak berakidah tauhid, mengesakan Allah. Mereka diam seribu bahasa, tidak dapat mengemukakan sedikit pun alasan sebagai jawaban dari pernyataan yang dilontarkan. Mereka bingung tidak tahu apa yang mesti dikatakan. Oleh karena itu, mereka saling bertanya, seperti orang yang sedang menghadapi kesulitan. Mereka tertunduk karena malu dan menyesal. Apabila para rasul tidak dapat menjawab pertanyaan yang dimajukan kepadanya tentang jawaban dan sambutan kaumnya mengenai seruannya kepada mereka, tentu orang-orang yang sesat dan menyesatkan di dunia yang tidak mengindahkan seruan nabi-nabi lebih cemas lagi. Firman Allah:\n\n(Ingatlah) pada hari ketika Allah mengumpulkan para rasul, lalu Dia bertanya (kepada mereka), \"Apa jawaban (kaummu) terhadap (seruan)mu?\" Mereka (para rasul) menjawab, \"Kami tidak tahu (tentang itu). Sesungguhnya Engkaulah Yang Maha Mengetahui segala yang gaib.\" (al-Ma'idah\/5: 109)",
      "text_translation": "Dan (ingatlah) pada hari ketika Dia (Allah) menyeru mereka, dan berfirman, “Apakah jawabanmu terhadap para rasul?”",
      "text": "وَيَوْمَ يُنَادِيْهِمْ فَيَقُوْلُ مَاذَآ اَجَبْتُمُ الْمُرْسَلِيْنَ ",
      "text_translation_en": "And on that Day He will call unto them, and will ask: “How did you respond to My message­ bearers?”",
      "juz_number": 20
    },
    "66": {
      "text_tafsir_en": "After they were told that their actions in fellowship with God were misguided, then in response to their actions, they were asked in this verse how they responded to the call of the apostles to purify themselves from idolatry, and to invoke faith in Allah. They are silent in a thousand languages, unable to give any reason as to the answer to the statement issued. They are confused as to what to say. Therefore, they ask each other, as if they were having a hard time. They are subject to shame and regret. If the apostles could not answer the questions raised to him about the answer and the response of his people to his appeal to them, surely the perverted and deceitful people in the world who would not heed the cries of the prophets were more anxious. The Word of God: (Remember) the day when He gathered the apostles, and He asked them, \"What is the answer of your people?\" They said, \"We do not know. You are the All-Knower of the Unseen.\" (al-Ma'idah \/ 5: 109)",
      "text_tafsir": "Sesudah dinyatakan kepada mereka bahwa tindakan mereka mempersekutukan Allah adalah sesat, maka sebagai cercaan atas perbuatannya, itu pada ayat ini ditanyakan kepada mereka tentang bagaimana cara mereka menyambut seruan para rasul untuk membersihkan diri dari penyembahan berhala, dan mengajak berakidah tauhid, mengesakan Allah. Mereka diam seribu bahasa, tidak dapat mengemukakan sedikit pun alasan sebagai jawaban dari pernyataan yang dilontarkan. Mereka bingung tidak tahu apa yang mesti dikatakan. Oleh karena itu, mereka saling bertanya, seperti orang yang sedang menghadapi kesulitan. Mereka tertunduk karena malu dan menyesal. Apabila para rasul tidak dapat menjawab pertanyaan yang dimajukan kepadanya tentang jawaban dan sambutan kaumnya mengenai seruannya kepada mereka, tentu orang-orang yang sesat dan menyesatkan di dunia yang tidak mengindahkan seruan nabi-nabi lebih cemas lagi. Firman Allah:\n\n(Ingatlah) pada hari ketika Allah mengumpulkan para rasul, lalu Dia bertanya (kepada mereka), \"Apa jawaban (kaummu) terhadap (seruan)mu?\" Mereka (para rasul) menjawab, \"Kami tidak tahu (tentang itu). Sesungguhnya Engkaulah Yang Maha Mengetahui segala yang gaib.\" (al-Ma'idah\/5: 109)",
      "text_translation": "Maka gelaplah bagi mereka segala macam alasan pada hari itu, karena itu mereka tidak saling bertanya. ",
      "text": "فَعَمِيَتْ عَلَيْهِمُ الْاَنْۢبَاۤءُ يَوْمَىِٕذٍ فَهُمْ لَا يَتَسَاۤءَلُوْنَ ",
      "text_translation_en": "but all arguments and excuses will by then have been erased from their minds, and they will not [be able to] obtain any [helpful] answer from one another.",
      "juz_number": 20
    },
    "67": {
      "text_tafsir_en": "No matter how much a person sins, including associating God as his greatest sin, when he repents and returns to the truth, and worships him, justifies his prophet, obeys his commandments, and abandons his prohibition, a lucky and happy person in the hereafter. His crime was replaced by God with virtue. He received the gift and entered the paradise of grace. He dwells therein forever, as God says: And those who do not associate God with other worships and do not kill those whom Allah forbids except for the right, and the immoral; and whoever does that, he will receive a severe punishment, (that is) a double punishment for him on the Day of Judgment, and he will remain in that torment, in disgrace except those who repent and believe and do good; then their evil will be replaced by God for good. Allah is Oft-Forgiving, Most Merciful. (al-Furqan \/ 25: 68-70)",
      "text_tafsir": "Betapapun banyaknya dosa seseorang, termasuk menyekutukan Allah yang merupakan dosa yang paling besar, bila ia tobat dan kembali kepada kebenaran, serta beribadah kepada-Nya, membenarkan nabi-Nya, mengerjakan perintah-Nya, dan meninggalkan larangan-Nya, tentu ia termasuk orang-orang yang beruntung dan berbahagia di akhirat. Kejahatannya diganti oleh Allah dengan kebajikan. Ia mendapat karunia dan masuk ke surga yang penuh nikmat. Ia tinggal di dalamnya kekal untuk selama-lamanya, sebagaimana firman Allah :\n\nDan orang-orang yang tidak mempersekutukan Allah dengan sembahan lain dan tidak membunuh orang yang diharamkan Allah kecuali dengan (alasan) yang benar, dan tidak berzina; dan barang siapa melakukan demikian itu, niscaya dia mendapat hukuman yang berat, (yakni) akan dilipatgandakan azab untuknya pada hari Kiamat dan dia akan kekal dalam azab itu, dalam keadaan terhina, kecuali orang-orang yang bertobat dan beriman dan mengerjakan kebajikan; maka kejahatan mereka diganti Allah dengan kebaikan. Allah Maha Pengampun, Maha Penyayang. (al-Furqan\/25: 68-70)",
      "text_translation": "Maka adapun orang yang bertobat dan beriman, serta mengerjakan kebajikan, maka mudah-mudahan dia termasuk orang yang beruntung. ",
      "text": "فَاَمَّا مَنْ تَابَ وَاٰمَنَ وَعَمِلَ صَالِحًا فَعَسٰٓى اَنْ يَّكُوْنَ مِنَ الْمُفْلِحِيْنَ ",
      "text_translation_en": "But as against this - anyone who repents and attains to faith and does righteous deeds may well [hope to] find himself among those who achieve a happy state [in the life to come].",
      "juz_number": 20
    },
    "68": {
      "text_tafsir_en": "This verse explains that it is God who creates what He wills. He is the only one who has the power to choose and decide something, whether it be seen or not, as He says: Is the God who created it unknowingly? And He is All-Knowing, All-Knowing. (al-Mulk \/ 67: 14) And His saying: Do they not know that Allah knows what they hide and what they declare? (al-Baqarah \/ 2: 77) Allah is All-knowing, all-knowing, all-knowing, in character, and in character. Then He chose from His servants, who among them had the right and the right to receive guidance and was appointed to be an Apostle capable of performing His duty. The Word of God: God knows best where He places His writings. (al-An'am \/ 6: 124) If Allah has determined something, then man cannot choose according to his will. He must accept and obey what God has decreed. The Word of God: And it is not right for believing men and women who believe, when Allah and His Messenger make a decree, that they will have a choice. (al-Ahzab \/ 33: 36) This verse concludes with an explanation that Allah is Most Holy and Exalted in what they associate. No one can interfere with his will and revoke his will. However, the desire and persistence of the Prophet Muhammad led to the demise of his uncle Abu the bible, and yet the desire and determination of the people of Mecca to be sent by an apostle from among them, all failed and failed. Only God's will and purpose are realized and fulfilled.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah yang menciptakan apa yang dikehendaki-Nya. Dia satu-satunya yang berwenang memilih dan menentukan sesuatu hal, baik yang tampak maupun yang tidak, sebagaimana firman-Nya:\n\nApakah (pantas) Allah yang menciptakan itu tidak mengetahui? Dan Dia Mahahalus, Maha Mengetahui. (al-Mulk\/67: 14)\n\nDan firman-Nya:\n\nDan tidakkah mereka tahu bahwa Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan? (al-Baqarah\/2: 77) \n\nAllah Maha Mengetahui semua makhluk-Nya, mengetahui hal ihwal, watak, dan karakternya. Kemudian Dia memilih dari hamba-hamba-Nya, siapa di antara mereka yang berhak dan wajar menerima hidayah dan diangkat menjadi rasul yang mampu melaksanakan tugasnya. Firman Allah:\n\nAllah lebih mengetahui di mana Dia menempatkan tugas kerasulan-Nya. (al-An'am\/6: 124) \n\nBila Allah telah menentukan sesuatu, maka manusia tidak dapat memilih sesuai keinginannya. Ia harus menerima dan menaati apa yang telah ditetapkan Allah. Firman Allah:\n\nDan tidaklah pantas bagi laki-laki yang mukmin dan perempuan yang mukmin, apabila Allah dan Rasul-Nya telah menetapkan suatu ketetapan, akan ada pilihan (yang lain) bagi mereka tentang urusan mereka. (al-Ahzab\/33: 36)\n\nAyat ini diakhiri dengan satu penjelasan bahwa Allah Mahasuci dan Mahatinggi dari apa yang mereka persekutukan. Tidak ada seorang pun yang dapat menghalangi pilihan-Nya dan membatalkan ketentuan-Nya. Bagaimanapun keinginan dan kegigihan Nabi Muhammad memberi petunjuk untuk mengislamkan pamannya, Abu thalib, dan bagaimanapun kehendak dan kesungguhan penduduk Mekah supaya diutus seorang rasul dari kalangan mereka, semuanya itu gagal dan tidak terlaksana. Hanya pilihan dan ketentuan Allah yang berlaku dan menjadi kenyataan.",
      "text_translation": "Dan Tuhanmu menciptakan dan memilih apa yang Dia kehendaki. Bagi mereka (manusia) tidak ada pilihan. Mahasuci Allah dan Mahatinggi Dia dari apa yang mereka persekutukan.",
      "text": "وَرَبُّكَ يَخْلُقُ مَا يَشَاۤءُ وَيَخْتَارُ ۗمَا كَانَ لَهُمُ الْخِيَرَةُ ۗسُبْحٰنَ اللّٰهِ وَتَعٰلٰى عَمَّا يُشْرِكُوْنَ ",
      "text_translation_en": "AND [thus it is:] thy Sustainer creates whatever He wills; and He chooses [for mankind] whatever is best for them. Limitless is God in His glory, and sub­limely exalted above anything to which they may ascribe a share in His divinity!",
      "juz_number": 20
    },
    "69": {
      "text_tafsir_en": "This verse explains that what is hidden in the heart and what one says, surely God knows. His Word: The same (for Allah), who among you kept his speech secret and who spoke the truth; and who hid during the night and who walked during the day. (ar-Ra'd \/ 13: 10) And His Word is He Who knows all that is supernatural and all that is visible. Higher than what they associate with. (al-Mu'minun \/ 23: 92) (70) In this verse, Allah makes it clear that He is the One, who has no right to worship except Allah. He knoweth all things, and he hath power over him. It is He who is worthy of praise for all His works, for He is the One who gives us all the pleasures we have in this world and the hereafter. All the rules and conditions that He has outlined must be in force. It is impossible to intervene because He is above all His creatures, the Just Judge, who determines and determines that what is right and what is wrong is wrong. To Him all things will be restored, the Word of God says: Only to Allah will everything be restored. (al-Anfal \/ 8: 44) On the Day of Judgment, every person is rewarded according to his deeds in the world. If good be rewarded in heaven, and if evil be rewarded with torment in hell.",
      "text_tafsir": "Ayat ini menerangkan bahwa apa yang disembunyikan di dalam hati dan apa yang dinyatakan seseorang, pasti Allah mengetahuinya. Firman Nya:\n\nSama saja (bagi Allah), siapa di antaramu yang merahasiakan ucapannya dan siapa yang berterus terang dengannya; dan siapa yang bersembunyi pada malam hari dan yang berjalan pada siang hari. (ar-Ra'd\/13: 10) \n\nDan firman-Nya:\n\nDialah Tuhan) yang mengetahui semua yang gaib dan semua yang tampak. Mahatinggi (Allah) dari apa yang mereka persekutukan. (al-Mu'minun\/23: 92) \n\n(70) Pada ayat ini, Allah menerangkan bahwa Dialah yang Maha Esa, tidak ada yang berhak disembah melainkan Allah. Dialah yang mengetahui segala sesuatu dan Dia pula yang berkuasa atasnya. Dialah yang berhak dipuji segala perbuatan-Nya, karena Dialah yang memberikan segala kenikmatan yang kita peroleh baik di dunia maupun di akhirat. Segala peraturan dan ketentuan yang telah digariskan-Nya harus berlaku dan terlaksana. Tidak mungkin diganggu gugat karena Dia berada di atas segala makhluk-Nya, Hakim Yang Paling Adil, yang menentukan dan menetapkan bahwa yang benar itu benar dan yang salah itu salah. Kepada-Nya segala sesuatu akan dikembalikan, firman Allah:\n\nHanya kepada Allah segala urusan dikembalikan. (al-Anfal\/8: 44) \n\nDi hari Kiamat, tiap-tiap orang dibalas setimpal dengan perbuatannya di dunia. Kalau baik dibalas dengan surga, dan kalau jahat dibalas dengan siksa di neraka.",
      "text_translation": "Dan Tuhanmu mengetahui apa yang disembunyikan dalam dada mereka dan apa yang mereka nyatakan. ",
      "text": "وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُوْرُهُمْ وَمَا يُعْلِنُوْنَ ",
      "text_translation_en": "And thy Sustainer knows all that their hearts conceal as well as all that they bring into the open:",
      "juz_number": 20
    },
    "70": {
      "text_tafsir_en": "In this verse, God makes it clear that He is the One, who has no right to worship except Allah. He knoweth all things, and he hath power over him. It is He who is worthy of praise for all His works, for He is the One who gives us all the pleasures we have in this world and the hereafter. All the rules and conditions that He has outlined must be in force. It is impossible to intervene because He is above all His creatures, the Just Judge, who determines and determines that what is right and what is wrong is wrong. To Him all things will be restored, the Word of God says: Only to Allah will everything be restored. (al-Anfal \/ 8: 44) On the Day of Judgment, every person is rewarded according to his deeds in the world. If good be rewarded in heaven, and if evil be rewarded with torment in hell.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Dialah yang Maha Esa, tidak ada yang berhak disembah melainkan Allah. Dialah yang mengetahui segala sesuatu dan Dia pula yang berkuasa atasnya. Dialah yang berhak dipuji segala perbuatan-Nya, karena Dialah yang memberikan segala kenikmatan yang kita peroleh baik di dunia maupun di akhirat. Segala peraturan dan ketentuan yang telah digariskan-Nya harus berlaku dan terlaksana. Tidak mungkin diganggu gugat karena Dia berada di atas segala makhluk-Nya, Hakim Yang Paling Adil, yang menentukan dan menetapkan bahwa yang benar itu benar dan yang salah itu salah. Kepada-Nya segala sesuatu akan dikembalikan, firman Allah: Hanya kepada Allah segala urusan dikembalikan. (al-Anfal\/8: 44) Di hari Kiamat, tiap-tiap orang dibalas setimpal dengan perbuatannya di dunia. Kalau baik dibalas dengan surga, dan kalau jahat dibalas dengan siksa di neraka.",
      "text_translation": "Dan Dialah Allah, tidak ada tuhan (yang berhak disembah) selain Dia, segala puji bagi-Nya di dunia dan di akhirat, dan bagi-Nya segala penentuan dan kepada-Nya kamu dikembalikan.",
      "text": "وَهُوَ اللّٰهُ لَآ اِلٰهَ اِلَّا هُوَ ۗ لَهُ الْحَمْدُ فِى الْاُوْلٰى وَالْاٰخِرَةِ ۖوَلَهُ الْحُكْمُ وَاِلَيْهِ تُرْجَعُوْنَ ",
      "text_translation_en": "for He is God, save whom there is no deity. Unto Him all praise is due, at the beginning and at the end [of time]; and with Him rests all judgment; and unto Him shall you all be brought back.",
      "juz_number": 20
    },
    "71": {
      "text_tafsir_en": "In this verse, God asks His Messenger to ask those who are His allies. If God had said that this night would continue all night till the Day of Judgment without any daylight interrupting it, would any of their prayers have power and could bring forth daylight so that its light could be used? Are the muslims not using their hearing? They seem deaf. If they had used their reasoning wisely, they would have realized and realized with certainty that only Almighty God could have the night to replace the day when it was needed. He comes day to day to destroy the night when He pleases and nothing can be done. The Word of God: And We make the night and the day two signs, then We remove the night and We make the light of day. (al-Isra '\/ 17: 12)",
      "text_tafsir": "Pada ayat ini, Allah menyuruh Rasul-Nya supaya bertanya kepada orang-orang yang mempersekutukan-Nya. Andai kata Allah menjadikan malam ini terus menerus sepanjang masa sampai hari Kiamat tanpa ada siang yang menyelinginya, apakah di antara sembahan-sembahan mereka itu kuasa dan mampu mendatangkan siang untuk dapat dimanfaatkan cahayanya? Apakah kaum musyrikin itu tidak mempergunakan pendengarannya? Mereka itu seakan-akan tuli. Kalaulah mereka mempergunakan akal sebaik-baiknya, tentu mereka akan insaf dan sadar serta mengetahui dengan yakin bahwa hanya Allah Yang Mahakuasa yang dapat mendatangkan malam untuk menggantikan siang apabila dikehendaki. Dia mendatangkan siang untuk menghapuskan malam apabila Dia kehendaki dan tiada sesuatu pun yang dapat melakukan yang demikian itu.\n\nFirman Allah:\n\nDan Kami jadikan malam dan siang sebagai dua tanda (kebesaran Kami), kemudian Kami hapuskan tanda malam dan Kami jadikan tanda siang itu terang. (al-Isra'\/17: 12)",
      "text_translation": "Katakanlah (Muhammad), “Bagaimana pendapatmu, jika Allah menjadikan untukmu malam itu terus-menerus sampai hari Kiamat. Siapakah tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Apakah kamu tidak mendengar?”",
      "text": "قُلْ اَرَءَيْتُمْ اِنْ جَعَلَ اللّٰهُ عَلَيْكُمُ الَّيْلَ سَرْمَدًا اِلٰى يَوْمِ الْقِيٰمَةِ مَنْ اِلٰهٌ غَيْرُ اللّٰهِ يَأْتِيْكُمْ بِضِيَاۤءٍ ۗ اَفَلَا تَسْمَعُوْنَ ",
      "text_translation_en": "Say: “Have you ever considered [this]: If God had willed that there should always be night about you, without break, until the Day of Resurrection - is there any deity other than God that could bring you light? Will you not, then, listen [to the truth]?”",
      "juz_number": 20
    },
    "72": {
      "text_tafsir_en": "The contents of this verse are the opposite of the previous verse. In this verse, Allah told His Messenger to ask the polytheists, if God made that day continuously throughout the ages until the Day of Judgment without any alternating night with him, is there a god other than Allah who is able to bring the night? Do they not pay attention to the signs of God's perfect power? As if they have no thoughts. If they pay close attention, of course they will draw the conclusion that there is nothing worthy of worship except God who has given innumerable gifts and favors and the power to make day and night alternately to create a balance. Day is used as a light to seek sustenance with all the available capabilities. Then that afternoon vanished was replaced by a night whose atmosphere was suitable for releasing and eliminating fatigue so that energy and mind recovered in search of sustenance the next day. The Word of God: And He (also) who makes the night and day alternately for people who want to take lessons or who want to be grateful. (Al-Furqan \/ 25: 62) According to scientific studies, sunlight in physical science is a radiant wave of energy that resulting from fusion and fission nuclear reactions that occur on the surface of the sun on an ongoing basis. When this beam is emitted continuously and in a long time will cause heat What will happen if the day continues until the Day of Judgment? Certainly the state of air and air from second to second, from minute to minute and from hour to hour will become increasingly hot. In just 100 hours the air can reach temperatures above the 100ºC boiling point. Therefore, oceans, lakes, rivers, etc. will boil and bubbly. Can you imagine what would happen if all the rivers, lakes and oceans boil the water? Likewise the blood that flows in our body also boils. In such circumstances, no creature can live. All of them will die and perish into flying dust. God also makes night a time of rest for humans. All of that aims to enable humans to imagine how great is the power of God and also the protection that He provides for the life of each of His creatures, especially humans who are endowed with perfect minds.",
      "text_tafsir": "Kandungan ayat ini kebalikan dari ayat sebelumnya. Pada ayat ini, Allah menyuruh Rasul-Nya menanyakan kepada orang-orang musyrik, andaikata Allah menjadikan siang itu terus menerus sepanjang masa sampai di hari Kiamat tanpa ada malam silih berganti dengannya, apakah ada tuhan selain dari Allah yang mampu mendatangkan malam? Apakah mereka tidak memperhatikan tanda-tanda kekuasaan Allah yang sempurna? Seakan-akan mereka tidak punya pikiran. \n\nSekiranya mereka memperhatikan dengan baik, tentu mereka akan mengambil kesimpulan bahwa tidak ada yang layak disembah kecuali Tuhan yang telah memberikan karunia dan nikmat yang tak terhingga banyaknya dan kuasa menjadikan siang dan malam itu silih berganti untuk terciptanya suatu keseimbangan. Siang dijadikan terang untuk mencari rezeki dengan segala kemampuan yang ada. Kemudian siang itu lenyap digantikan oleh malam yang suasananya cocok digunakan untuk melepaskan dan menghilangkan kelelahan agar tenaga dan pikiran kembali pulih guna mencari rezeki pada keesokan harinya. Firman Allah:\n\nDan Dia (pula) yang menjadikan malam dan siang silih berganti bagi orang yang ingin mengambil pelajaran atau yang ingin bersyukur.(al-Furqan\/25: 62)\n\nMenurut kajian ilmiah, sinar matahari dalam ilmu pengetahuan fisika merupakan pancaran gelombang energi yang dihasilkan dari reaksi nuklir fusi dan fisi yang terjadi di permukaan matahari secara berkesinambungan. Ketika sinar ini dipancarkan secara terus menerus dan dalam waktu cukup lama akan menimbulkan panas \n\nApa yang akan terjadi sekiranya siang terus menerus sampai hari Kiamat? Sudah pasti keadaan udara dan hawa dari detik ke detik, dari menit ke menit dan dari jam ke jam akan menjadi semakin panas. Dalam waktu 100 jam saja udara bisa mencapai temperatur di atas titik didih 100ÂºC. Karenanya, lautan, danau, sungai, dan sebagainya akan mendidih dan menggelegak. Dapat dibayangkan apa yang akan terjadi sekiranya seluruh sungai, danau, dan samudera mendidih airnya? Begitu juga darah yang mengalir di dalam tubuh kita juga turut mendidih. Dalam keadaan demikian, tidak ada satu pun makhluk yang dapat hidup. Semuanya akan mati dan musnah menjadi debu-debu yang beterbangan. \n\nAllah juga menjadikan malam sebagai waktu istirahat bagi manusia. Semuanya itu bertujuan agar manusia dapat mem-bayangkan betapa hebatnya kekuasaan Allah dan juga perlindungan yang diberikan-Nya untuk kehidupan setiap makhluk ciptaan-Nya khususnya manusia yang dikaruniai akal pikiran yang sempurna.",
      "text_translation": "Katakanlah (Muhammad), “Bagaimana pendapatmu, jika Allah menjadikan untukmu siang itu terus-menerus sampai hari Kiamat. Siapakah tuhan selain Allah yang akan mendatangkan malam kepadamu sebagai waktu istirahatmu? Apakah kamu tidak memperhatikan?”",
      "text": "قُلْ اَرَءَيْتُمْ اِنْ جَعَلَ اللّٰهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا اِلٰى يَوْمِ الْقِيٰمَةِ مَنْ اِلٰهٌ غَيْرُ اللّٰهِ يَأْتِيْكُمْ بِلَيْلٍ تَسْكُنُوْنَ فِيْهِ ۗ اَفَلَا تُبْصِرُوْنَ ",
      "text_translation_en": "Say: “Have you ever considered [this]: If God had willed that there should always be daylight about you, without break, until the Day of Resurrection - is there any deity other than God that could bring you [the darkness of] night, wherein you might rest? Will you not, then, see [the truth]?”",
      "juz_number": 20
    },
    "73": {
      "text_tafsir_en": "The change of day and night with their respective functions, that is, the day used to seek sustenance and the night to be used for rest and relaxation, so that the rest of the energy used in the day is restored, is a great grace of God which is priceless and indispensable. . The undeserved favor will be lost and withdrawn by God. On the contrary, the favored favor of using it to the best of God's will will continue to increase. The Word of Allah: And (remember) when your Lord informed, \"Verily, if ye are grateful, I will surely add unto you, but if ye deny (My favors), then My punishment will be very severe.\" (Abraham \/ 14: 7)",
      "text_tafsir": "Pergantian siang dan malam dengan fungsinya masing-masing, yaitu siang digunakan untuk berusaha mencari rezeki dan malam digunakan untuk istirahat dan melepaskan lelah, sehingga pulih kembali tenaga yang telah dipergunakan pada siang harinya, adalah merupakan rahmat besar dari Allah yang tak ternilai harganya dan wajib disyukuri. Nikmat yang tak disyukuri akan hilang lenyap dicabut dan ditarik kembali oleh Allah. Sebaliknya nikmat yang disyukuri dengan memanfaatkannya sebaik-baiknya sesuai dengan perintah Allah, akan bertambah terus. Firman Allah:\n\nDan (ingatlah) ketika Tuhanmu memaklumkan, \"Sesungguhnya jika kamu bersyukur, niscaya Aku akan menambah (nikmat) kepadamu, tetapi jika kamu mengingkari (nikmat-Ku), maka pasti azab-Ku sangat berat.\" (Ibrahim\/14: 7)",
      "text_translation": "Dan adalah karena rahmat-Nya, Dia jadikan untukmu malam dan siang, agar kamu beristirahat pada malam hari dan agar kamu mencari sebagian karunia-Nya (pada siang hari) dan agar kamu bersyukur kepada-Nya.",
      "text": "وَمِنْ رَّحْمَتِهٖ جَعَلَ لَكُمُ الَّيْلَ وَالنَّهَارَ لِتَسْكُنُوْا فِيْهِ وَلِتَبْتَغُوْا مِنْ فَضْلِهٖ وَلَعَلَّكُمْ تَشْكُرُوْنَ ",
      "text_translation_en": "For it is out of His grace that He has made for you the night and the day, so that you might rest therein as well as seek to obtain [what you need] of His bounty: and [He gave you all this] so that you might have cause to be grateful.",
      "juz_number": 20
    },
    "74": {
      "text_tafsir_en": "This verse explains that on the Day of Judgment God will call on the unbelievers and say to them, \"Where are my allies whom you consider to be my allies in the world? Atheists were called at that time to declare a testimony of their worship other than God. It also seeks to make them realize that the fellowship of God is the main reason for His wrath, just as He is the main reason for His will.",
      "text_tafsir": "Ayat ini menerangkan bahwa di hari Kiamat Allah akan memanggil orang-orang musyrik dan berkata kepada mereka, \"Di mana sekutu-sekutu-Ku yang kalian anggap sebagai sekutu-Ku di dunia? Dapatkah mereka itu melepaskan kalian dari keadaan yang menghimpit sekarang ini.\" Sengaja orang musyrik dipanggil pada waktu itu untuk mengikrarkan suatu kesaksian atas penyembahan mereka selain dari Allah. Ini juga bertujuan supaya mereka mengetahui bahwa mempersekutukan Allah itu adalah sebab paling utama atas kemurkaan-Nya, sebagaimana mengesakan-Nya adalah sebab utama atas rida-Nya.",
      "text_translation": "Dan (ingatlah) pada hari ketika Dia (Allah) menyeru mereka, dan berfirman, “Di manakah sekutu-sekutu-Ku yang dahulu kamu sangka?”",
      "text": "وَيَوْمَ يُنَادِيْهِمْ فَيَقُوْلُ اَيْنَ شُرَكَاۤءِيَ الَّذِيْنَ كُنْتُمْ تَزْعُمُوْنَ ",
      "text_translation_en": "AND ON THAT DAY He will call unto those [that shall have been arraigned before His judgment seat], and will ask: “Where, now, are those [beings or powers] whom you imagined to have a share in My divinity?”",
      "juz_number": 20
    },
    "75": {
      "text_tafsir_en": "Allah declares that on the Day of Judgment He will bring a witness to every people. Each apostle will be a witness to each of his people, to the extent that they accept and accept the religion they bring to God. Prophet Muhammad will also be a witness to his people on the Day of Judgment, as Allah says: And what if We bring a witness (messenger) from every people and We bring you (Muhammad) as their witness. (an-Nisa '\/ 4: 41) The Muslims on the Day of Judgment will be held accountable for their shirk. They are also asked for evidence and reasons to justify their actions, which of course they cannot come up with. At that time they knew that they would be tormented forever in hell. The Word of God: So I warn you of a fiery hell, which is entered only by the most wicked, who deny (truth) and turn away (from faith). (al-Lail \/ 92: 14-16) At that time, they will realize and believe that what God has revealed through His prophet is true. Eliminate from them everything they once had in the world, such as denying the apostles sent to them, associating with God, and so on.",
      "text_tafsir": "Allah menerangkan bahwa di hari Kiamat Dia akan mendatangkan saksi atas tiap-tiap umat. Tiap rasul akan menjadi saksi atas umatnya masing-masing, sampai di mana sambutan dan penerimaan umatnya itu kepada agama yang dibawanya dari Allah. Nabi Muhammad pun akan menjadi saksi pada umatnya nanti di hari Kiamat, sebagaimana firman Allah:\n\nDan bagaimanakah (keadaan orang kafir nanti), jika Kami mendatangkan seorang saksi (rasul) dari setiap umat dan Kami mendatangkan engkau (Muhammad) sebagai saksi atas mereka. (an-Nisa'\/4: 41) \n\nOrang-orang musyrik di hari Kiamat akan dimintai pertanggungjawaban atas perbuatan syiriknya. Mereka juga dimintai keterangan dan alasan-alasan untuk membenarkan perbuatan mereka, yang tentunya mereka tidak dapat mengemukakan satu alasan pun. Pada waktu itulah mereka mengetahui bahwa mereka akan diazab untuk selama-lamanya dalam neraka. Firman Allah:\n\nMaka Aku memperingatkan kamu dengan neraka yang menyala-nyala, yang hanya dimasuki oleh orang yang paling celaka, yang mendustakan (kebenaran) dan berpaling (dari iman). (al-Lail\/92: 14-16) \n\nPada waktu itu, mereka akan sadar dan yakin bahwa apa yang telah diterangkan Allah melalui nabi-Nya itulah yang benar. Lenyaplah sama sekali dari mereka segala apa yang dahulunya mereka ada-adakan di dunia seperti mendustakan rasul yang diutus kepada mereka, mempersekutukan Allah, dan sebagainya.",
      "text_translation": "Dan Kami datangkan dari setiap umat seorang saksi, lalu Kami katakan, “Kemukakanlah bukti kebenaranmu,” maka tahulah mereka bahwa yang hak (kebenaran) itu milik Allah dan lenyaplah dari mereka apa yang dahulu mereka ada-adakan.",
      "text": "وَنَزَعْنَا مِنْ كُلِّ اُمَّةٍ شَهِيْدًا فَقُلْنَا هَاتُوْا بُرْهَانَكُمْ فَعَلِمُوْٓا اَنَّ الْحَقَّ لِلّٰهِ وَضَلَّ عَنْهُمْ مَّا كَانُوْا يَفْتَرُوْنَ ࣖ",
      "text_translation_en": "And [they will remain silent: for by then] We will have called forth witnesses from within every community, and will have said [unto the sinners]: “Produce an evidence for what you have been claim­ing!” And so they will come to understand that all truth is God’s [alone]; and all their false imagery will have forsaken them.",
      "juz_number": 20
    },
    "76": {
      "text_tafsir_en": "This verse explains that Karun was a member of the Prophet Moses, and one of his uncles was still counted. Karun also has another name, \"al-Munawar\" (radiant) because of his handsome face. He read the most of the Torah among his friends from the Children of Israel, only he was a hypocrite like Samiri. He was persecuted and arrogant towards fellow Children of Israel. And if God pays some fortune to His servants, surely they will go beyond the limits of the earth, but He decreases to the size He wants. Indeed, He is Examining His servants, Seer. (Ash-Shura \/ 42: 27) Abundant wealth and treasury of wealth given by God to him, so the keys are not able to be borne by a number of people who are strong because of its weight, causing it to be very proud, apply persecution, and arrogant towards each other and looked down on them and despised them. Ibn 'Abbas said that the keys to the treasury of treasure could be carried by forty strong men. Even though he was warned by his people not to be too proud of his abundant wealth and heaps of wealth, because God does not like people who boast, but he does not care at all. He remained proud and boasted. The warning and prohibition of being overly happy and proud of God's gift is also stated in another verse, as He said: So that you do not grieve for what you have escaped, and do not be too happy for what He has given you. And Allah does not like anyone who is arrogant and prides himself. (al-hadid \/ 57: 23) Allah does not like people who are arrogant and boast. (an-Nisa '\/ 4: 36)",
      "text_tafsir": "Ayat ini menerangkan bahwa Karun termasuk kaum Nabi Musa, dan masih terhitung salah seorang pamannya. Karun juga mempunyai nama lain, yaitu \"al-Munawar\" (bercahaya) karena wajahnya yang tampan. Ia paling banyak membaca kitab Taurat di antara teman-temannya dari Bani Israil, hanya dia munafik seperti halnya Samiri. Ia berlaku aniaya dan sombong terhadap sesama Bani Israil.\n\nDan sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya niscaya mereka akan berbuat melampaui batas di bumi, tetapi Dia menurunkan dengan ukuran yang Dia kehendaki. Sungguh, Dia Mahateliti terhadap (keadaan) hamba-hamba-Nya, Maha Melihat. (asy-Syura\/42: 27)\n\nKekayaan melimpah ruah dan perbendaharaan harta yang banyak yang diberikan Allah kepadanya, sehingga kunci-kunci tidak sanggup dipikul oleh sejumlah orang-orang yang kuat karena beratnya, menyebabkan ia sangat bangga, berlaku aniaya, dan sombong terhadap sesamanya serta memandang remeh dan hina mereka. Ibnu 'Abbas mengatakan bahwa kunci-kunci perbendaharaan harta Karun dapat dibawa oleh empat puluh laki-laki yang kuat. \n\nSekalipun ia diperingatkan oleh kaumnya agar jangan terlalu membanggakan hartanya yang berlimpah-limpah dan kekayaan yang bertumpuk-tumpuk itu, karena Allah tidak menyukai orang yang membanggakan diri, tetapi ia tidak menggubrisnya sama sekali. Ia tetap bangga dan menyombongkan diri. Peringatan dan larangan terlalu gembira dan bangga atas pemberian Allah itu ditegaskan juga dalam ayat lain, sebagaimana firman Nya:\n\nAgar kamu tidak bersedih hati terhadap apa yang luput dari kamu, dan jangan pula terlalu gembira terhadap apa yang diberikan-Nya kepadamu. Dan Allah tidak menyukai setiap orang yang sombong dan membanggakan diri. (al-hadid\/57: 23) \n\nAllah tidak menyukai orang yang sombong dan membanggakan diri. (an-Nisa'\/4: 36)",
      "text_translation": "Sesungguhnya Karun termasuk kaum Musa, tetapi dia berlaku zalim terhadap mereka, dan Kami telah menganugerahkan kepadanya perbendaharaan harta yang kunci-kuncinya sungguh berat dipikul oleh sejumlah orang yang kuat-kuat. (Ingatlah) ketika kaumnya berkata kepadanya, “Janganlah engkau terlalu bangga. Sungguh, Allah tidak menyukai orang yang membanggakan diri.”",
      "text": "۞ اِنَّ قَارُوْنَ كَانَ مِنْ قَوْمِ مُوْسٰى فَبَغٰى عَلَيْهِمْ ۖوَاٰتَيْنٰهُ مِنَ الْكُنُوْزِ مَآ اِنَّ مَفَاتِحَهٗ لَتَنُوْۤاُ بِالْعُصْبَةِ اُولِى الْقُوَّةِ اِذْ قَالَ لَهٗ قَوْمُهٗ لَا تَفْرَحْ  اِنَّ اللّٰهَ لَا يُحِبُّ الْفَرِحِيْنَ ",
      "text_translation_en": "[NOW,] BEHOLD, Qarun was one of the people of Moses; but he arrogantly exalted himself above them - simply because We had granted him such riches that his treasure-chests alone would surely have been too heavy a burden for a troop of ten men or even more. When [they perceived his arrogance,] his people said unto him: “Exult not [in thy wealth], for, verily, God does not love those who exult [in things vain]!",
      "juz_number": 20
    },
    "77": {
      "text_tafsir_en": "In this verse, God describes four kinds of advice and guidance directed to Karun by his people. Those who practice such advice and guidance will find prosperity in the world and in the hereafter. 1. He who has been given by God abundant wealth, accumulated wealth, and many favors, let him use in the way of God, obey and obey his commandments, draw near to him for the rich reward in the world and the hereafter. The Word of the Prophet saw: Take advantage of the five before coming (the enemy) five; your youth before your age, your health before your illness, your life before your poverty, your free time before your busy days and your life before your death. (History of al-Baihaqi from Ibn 'Abbas) 2. Everyone is welcome not to miss out on the worldly pleasures of food, drink, clothing, and other pleasures as long as they do not conflict with the teachings set forth by God. Neither God, ourselves, nor the family, has the right to someone to act upon. The word of the prophet Muhammad: Do the work of those who think they will live forever. And watch out like you're going to die tomorrow. (History of al-Baihaqi from Ibn 'Umar) 3. Everyone should do good as Allah does good to him, such as helping those in need, connecting the cord of friendship, etc. 4. Everyone is forbidden to do evil on earth, and to do evil to fellow beings, for Allah does not like those who do evil.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan empat macam nasihat dan petunjuk yang ditujukan kepada Karun oleh kaumnya. Orang yang mengamalkan nasihat dan petunjuk itu akan memperoleh kesejahteraan di dunia dan akhirat.\n\n1. Orang yang dianugerahi oleh Allah kekayaan yang berlimpah ruah, perbendaharaan harta yang bertumpuk-tumpuk, serta nikmat yang banyak, hendaklah ia memanfaatkan di jalan Allah, patuh dan taat pada perintah-Nya, mendekatkan diri kepada-Nya untuk memperoleh pahala sebanyak-banyaknya di dunia dan akhirat.\n\nSabda Nabi saw:\n\nManfaatkan yang lima sebelum datang (lawannya) yang lima; mudamu sebelum tuamu, sehatmu sebelum sakitmu, kayamu sebelum miskinmu, waktu senggangmu sebelum kesibukanmu dan hidupmu sebelum matimu. (Riwayat al-Baihaqi dari Ibnu 'Abbas)\n\n2. Setiap orang dipersilakan untuk tidak meninggalkan sama sekali kesenangan dunia baik berupa makanan, minuman, pakaian, serta kesenangan-kesenangan yang lain sepanjang tidak bertentangan dengan ajaran yang telah digariskan oleh Allah. Baik Allah, diri sendiri, maupun keluarga, mempunyai hak atas seseorang yang harus dilaksanakannya. Sabda Nabi Muhammad: \n\nKerjakanlah seperti kerjanya orang yang mengira akan hidup selamanya. Dan waspadalah seperti akan mati besok. (Riwayat al-Baihaqi dari Ibnu 'Umar)\n\n3. Setiap orang harus berbuat baik sebagaimana Allah berbuat baik kepadanya, misalnya membantu orang-orang yang memerlukan, menyambung tali silaturrahim, dan lain sebagainya.\n\n4. Setiap orang dilarang berbuat kerusakan di atas bumi, dan berbuat jahat kepada sesama makhluk, karena Allah tidak menyukai orang-orang yang berbuat kerusakan.",
      "text_translation": "Dan carilah (pahala) negeri akhirat dengan apa yang telah dianugerahkan Allah kepadamu, tetapi janganlah kamu lupakan bagianmu di dunia dan berbuatbaiklah (kepada orang lain) sebagaimana Allah telah berbuat baik kepadamu, dan janganlah kamu berbuat kerusakan di bumi. Sungguh, Allah tidak menyukai orang yang berbuat kerusakan.",
      "text": "وَابْتَغِ فِيْمَآ اٰتٰىكَ اللّٰهُ الدَّارَ الْاٰخِرَةَ  وَلَا تَنْسَ نَصِيْبَكَ مِنَ الدُّنْيَا  وَاَحْسِنْ كَمَآ اَحْسَنَ اللّٰهُ اِلَيْكَ  وَلَا تَبْغِ الْفَسَادَ فِى الْاَرْضِ ۗاِنَّ اللّٰهَ لَا يُحِبُّ الْمُفْسِدِيْنَ",
      "text_translation_en": "Seek instead, by means of what God has granted thee, [the good of] the life to come, without forget­ting, withal, thine own [rightful] share in this world; and do good [unto others] as God has done good unto thee; and seek not to spread corruption on earth: for, verily, God does not love the spreaders of corruption!”",
      "juz_number": 20
    },
    "78": {
      "text_tafsir_en": "This verse describes Karun's reaction to the advice and guidance given by his people. He proudly said, \"The treasure that God has given me is because of the knowledge that I have. God knows it. Therefore, he sought me and gave it to me.\" Not a few people when faced with danger, they turn to God, and pray earnestly. All the prayers he knew were read in the hope that the danger he had experienced was gone. If that was to be done, he would forget the God who had taken the danger away from him. In fact, he admitted that it was because of his intelligence, because of the right calculations, and so on. The Word of God: So when men are in danger he calls upon us, then when We give him our favor he says, \"Verily I am given this favor only for my intelligence.\" Actually, it's a test, but most of them don't know. (az-Zumar \/ 39: 49) Such a confession above is rejected by God in his words, \"Has he forgotten or never known that God has destroyed his people before him, when they are stronger and more wealth he has accumulated?\" . \" If God had given one a wealth and the other just because of the wisdom and goodness that he had, so that God would favor him, surely He would not have destroyed the ancients who were much richer, stronger and wiser than Karun. He whom God rules will not destroy. Did he not see the fate of the Pharaoh who had a great government and his many followers with the blasphemy of God? At the end of this verse, God declares that if He were to punish those who were sinning, He would not ask how many sins He had committed, as well as His kind, because He is all-knowing. In another verse it is also stated as follows: Then on that day men and jinn were not asked about their sins. (ar-Rahman \/ 55: 39)",
      "text_tafsir": "Ayat ini menerangkan reaksi Karun atas nasihat dan petunjuk yang diberikan oleh kaumnya. Dengan sombong ia berkata, \"Harta yang diberikan Allah kepadaku adalah karena ilmu yang ada padaku. Allah mengetahui hal itu. Oleh karena itu, Ia rida padaku dan memberikan harta itu kepadaku.\" Tidak sedikit manusia apabila ditimpa bahaya, ia kembali kepada Tuhan, dan berdoa sepenuh hati. Semua doa yang diketahuinya dibaca dengan harapan supaya bahaya yang menimpanya itu lenyap. Jika maksudnya itu tercapai, ia kemudian lupa kepada Tuhan yang mencabut bahaya itu darinya. Bahkan, ia mengaku bahwa hal itu terjadi karena kepintarannya, karena perhitungan yang tepat, dan sebagainya. Firman Allah:\n\nMaka apabila manusia ditimpa bencana dia menyeru Kami, kemudian apabila Kami berikan nikmat Kami kepadanya dia berkata, \"Sesungguhnya aku diberi nikmat ini hanyalah karena kepintaranku.\" Sebenarnya, itu adalah ujian, tetapi kebanyakan mereka tidak mengetahui. (az-Zumar\/39: 49) \n\nPengakuan seperti tersebut di atas ditolak oleh Allah dengan firman Nya, \"Apakah ia lupa ataukah tidak pernah mengetahui bahwa Allah telah membinasakan umat dahulu sebelum dia, padahal mereka itu jauh lebih kuat dan lebih banyak harta yang dikumpulkannya.\" Sekiranya Allah memberi seseorang harta kekayaan dan lainnya hanya karena kepintaran dan kebaikan yang ada padanya, sehingga Allah rida kepadanya, tentu Dia tidak akan membinasakan orang-orang dahulu yang jauh lebih kaya, kuat dan pintar dari Karun. Orang yang diridai Allah tentu tidak akan dibinasakan-Nya. Tidakkah ia menyaksikan nasib Fir'aun yang mempunyai kerajaan besar dan pengikutnya yang banyak dengan sekejap mata dihancurkan oleh Allah.\n\nPada akhir ayat ini, Allah menegaskan bahwa apabila Dia hendak mengazab orang-orang yang bergelimang dosa itu, Dia tidak akan menanyakan berapa banyak dosa yang telah diperbuatnya, begitu juga jenisnya, karena Dia Maha Mengetahui semuanya itu. Dalam ayat lain ditegaskan juga sebagai berikut:\n\nMaka pada hari itu manusia dan jin tidak ditanya tentang dosanya. (ar-Rahman\/55: 39)",
      "text_translation": "Dia (Karun) berkata, “Sesungguhnya aku diberi (harta itu), semata-mata karena ilmu yang ada padaku.” Tidakkah dia tahu, bahwa Allah telah membinasakan umat-umat sebelumnya yang lebih kuat daripadanya, dan lebih banyak mengumpulkan harta? Dan orang-orang yang berdosa itu tidak perlu ditanya tentang dosa-dosa mereka.",
      "text": "قَالَ اِنَّمَآ اُوْتِيْتُهٗ عَلٰى عِلْمٍ عِنْدِيْۗ اَوَلَمْ يَعْلَمْ اَنَّ اللّٰهَ قَدْ اَهْلَكَ مِنْ قَبْلِهٖ مِنَ الْقُرُوْنِ مَنْ هُوَ اَشَدُّ مِنْهُ قُوَّةً وَّاَكْثَرُ جَمْعًا ۗوَلَا يُسْـَٔلُ عَنْ ذُنُوْبِهِمُ الْمُجْرِمُوْنَ ",
      "text_translation_en": "Answered he: “This [wealth] has been given to me only by virtue of the knowledge that is in me!” Did he not know that God had destroyed [the arrogant of] many a generation that preceded him - people who were greater than he in power, and richer in what they had amassed? But such as are lost in sin may not be asked about, their sins.",
      "juz_number": 20
    },
    "79": {
      "text_tafsir_en": "This verse explains that one day Karun went out into the midst of his people with magnificent clothing and excessive jewelry in a procession complete with bodyguards, slaves, and nanny hosts to show their height and greatness to humans. Such a thing is a very despicable, damned pride for sensible and healthy-minded people. That caused his people to be divided in two. First, people who are concerned with earthly life who always think and try their hardest how to be able to live in luxury in this world. According to their assumption, such life is happiness. They hope that they can also have what Karun has, which is heaps of wealth and excessive wealth, because this is considered to be a great fortune. Thus they will live happily, and do as they please feel the pleasure of the world with all its variations. Human desire like this until now still exists, even thrives in the midst of society. Everywhere we can see that there are not a few people who have a strong desire to own what rich people, big business people, and others have, such as large houses with luxurious furniture, luxury cars, land, and fields of fields that have tens and even hundreds of hectares. They did this even though they used an unnatural road, which was not in accordance with religious law and state regulations. That causes fraud and corruption everywhere.",
      "text_tafsir": "Ayat ini menerangkan bahwa pada suatu hari Karun keluar ke tengah-tengah kaumnya dengan pakaian yang megah dan perhiasan yang berlebihan dalam suatu iring-iringan yang lengkap dengan pengawal, hamba sahaya, dan inang pengasuh untuk mempertontonkan ketinggian dan kebesarannya kepada manusia. Hal yang demikian itu adalah sifat yang amat tercela, kebanggaan yang terkutuk bagi orang yang berakal dan berpikiran sehat. Hal itu menyebabkan kaumnya terbagi dua.\n\nPertama, orang-orang yang mementingkan kehidupan duniawi yang selalu berpikir dan berusaha sekuat tenaga bagaimana caranya supaya bisa hidup mewah di dunia ini. Menurut anggapan mereka, hidup yang demikian itu adalah kebahagiaan. Mereka itu berharap juga dapat memiliki sebagaimana yang dimiliki Karun yaitu harta yang bertumpuk-tumpuk dan kekayaan yang berlebih-lebihan, karena yang demikian itu dianggap sebagai keberun-tungan yang besar. \n\nDengan demikian mereka akan hidup senang, dan berbuat sekehendak hatinya merasakan kenikmatan dunia dengan segala variasinya. Keinginan manusia seperti ini sampai sekarang tetap ada, bahkan tumbuh dengan subur di tengah-tengah masyarakat. Di mana-mana kita dapat menyaksikan bahwa tidak sedikit orang yang berkeinginan keras untuk memiliki seperti apa yang telah dimiliki orang-orang kaya, pengusaha besar, dan lainnya, seperti rumah besar dengan perabot serba mewah, mobil mewah, tanah, dan sawah ladang yang berpuluh-puluh bahkan beratus hektar. Hal itu mereka lakukan sekalipun menggunakan jalan yang tidak wajar, yang tidak sesuai dengan hukum agama dan peraturan negara. Hal itu menyebabkan timbulnya kecurangan dan korupsi di mana-mana.",
      "text_translation": "Maka keluarlah dia (Karun) kepada kaumnya dengan kemegahannya. Orang-orang yang menginginkan kehidupan dunia berkata, “Mudah-mudahan kita mempunyai harta kekayaan seperti apa yang telah diberikan kepada Karun, sesungguhnya dia benar-benar mempunyai keberuntungan yang besar.”",
      "text": "فَخَرَجَ عَلٰى قَوْمِهٖ فِيْ زِيْنَتِهٖ ۗقَالَ الَّذِيْنَ يُرِيْدُوْنَ الْحَيٰوةَ الدُّنْيَا يٰلَيْتَ لَنَا مِثْلَ مَآ اُوْتِيَ قَارُوْنُۙ اِنَّهٗ لَذُوْ حَظٍّ عَظِيْمٍ ",
      "text_translation_en": "And so he went forth before his people in all his pomp; [and] those who cared only for the life of this world would say, “Oh, if we but had the like of what Qarun has been given! Verily, with tremendous good fortune is he endowed!”",
      "juz_number": 20
    },
    "80": {
      "text_tafsir_en": "This verse describes the second group of knowledgeable and sane people. They consider the thinking of those who belonged to the first group to be very mistaken, even considered a great catastrophe and a real loss, because it is more important to the mortal world than to the hereafter. The second group argues that the reward from God for those who believe in God and His Messenger and do good deeds is far better than accumulating wealth. What is in the presence of God remains eternal, while what is in human nature will perish and perish, as He says: What is on your side will perish, and what is on God's side will be eternal. (an-Nahl \/ 16: 96) Verse 80 concludes with an explanation that those who can accept and practice the advice from the above verse are only those who are patient and diligent in obeying God's command, avoiding His prohibition. They also accept what God has given them and spend it for their own benefit and for society.",
      "text_tafsir": "Ayat ini menerangkan kelompok kedua yaitu orang-orang yang berilmu dan berpikiran waras. Mereka menganggap bahwa cara berpikir orang-orang yang termasuk golongan pertama tadi sangat keliru, bahkan dianggap sebagai satu bencana besar dan kerugian yang nyata, karena lebih mementingkan kehidupan dunia yang fana dari kehidupan akhirat yang kekal. Golongan kedua berpendapat bahwa pahala di sisi Allah bagi orang-orang yang percaya kepada Allah dan rasul-Nya serta beramal saleh, jauh lebih baik daripada menumpuk harta. Apa yang di sisi Allah kekal abadi, sedangkan apa yang dimiliki manusia akan lenyap dan musnah, sebagaimana firman-Nya:\n\nApa yang ada di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. (an-Nahl\/16: 96)\n\nAyat 80 diakhiri satu penjelasan bahwa yang dapat menerima dan mengamalkan nasihat dari ayat di atas hanyalah orang-orang yang sabar dan tekun mematuhi perintah Allah, menjauhi larangan-Nya. Mereka juga menerima baik apa yang telah diberikan Allah kepadanya serta membelanjakannya untuk kepentingan diri dan masyarakat.",
      "text_translation": "Tetapi orang-orang yang dianugerahi ilmu berkata, “Celakalah kamu! Ketahuilah, pahala Allah lebih baik bagi orang-orang yang beriman dan mengerjakan kebajikan, dan (pahala yang besar) itu hanya diperoleh oleh orang-orang yang sabar.”",
      "text": "وَقَالَ الَّذِيْنَ اُوْتُوا الْعِلْمَ وَيْلَكُمْ ثَوَابُ اللّٰهِ خَيْرٌ لِّمَنْ اٰمَنَ وَعَمِلَ صَالِحًا ۚوَلَا يُلَقّٰىهَآ اِلَّا الصّٰبِرُوْنَ ",
      "text_translation_en": "But those who had been granted true knowl­edge said: “Woe unto you! Merit in the sight of God is by far the best for any who attains to faith and does what is right: but none save the patient in adversity can ever achieve this [blessing].”",
      "juz_number": 20
    },
    "81": {
      "text_tafsir_en": "In this verse, God describes the consequences of pride and pride. He and his house and all his wealth and wealth are buried in the earth. No one can save him from the torment of Allah, either individually or together. Karun himself cannot defend himself. Few people go astray, and they misunderstand what they are given. They thought of the treasure only for the sake of luxury and pleasure so that they did not channel its use into the way that God approved. Therefore, Allah inflicted His punishment upon them.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan akibat kesombongan dan keangkuhan Karun. Ia beserta rumah dan segala kemegahan dan kekayaannya dibenamkan ke dalam bumi. Tidak ada yang dapat menyelamatkannya dari azab Allah itu, baik perorangan maupun secara bersama-sama. Karun sendiri tidak dapat membela dirinya. Tidak sedikit orang yang sesat jalan, dan keliru paham tentang harta yang diberikan kepadanya. Mereka menyangka harta itu hanya untuk kemegahan dan kesenangan sehingga mereka tidak menyalurkan penggunaannya ke jalan yang diridai Allah. Oleh karena itu, Allah menimpakan azab-Nya kepada mereka.",
      "text_translation": "Maka Kami benamkan dia (Karun) bersama rumahnya ke dalam bumi. Maka tidak ada baginya satu golongan pun yang akan menolongnya selain Allah, dan dia tidak termasuk orang-orang yang dapat membela diri.",
      "text": "فَخَسَفْنَا بِهٖ وَبِدَارِهِ الْاَرْضَ ۗفَمَا كَانَ لَهٗ مِنْ فِئَةٍ يَّنْصُرُوْنَهٗ مِنْ دُوْنِ اللّٰهِ ۖوَمَا كَانَ مِنَ الْمُنْتَصِرِيْنَ ",
      "text_translation_en": "And thereupon We caused the earth to swallow him and his dwelling; and he had none and nothing to succour him against God, nor was he of those who could succour themselves.",
      "juz_number": 20
    },
    "82": {
      "text_tafsir_en": "This verse explains that those who aspire to have the same honorable position and position as Karun once possessed, immediately abolish their ambition after seeing the torment inflicted on Karun. They realize that the abundance of wealth and luxurious earthly life does not send them to the will of God. He gives to those whom He wants, and He does not give to those who do not. God raises and humbles those whom He wills. They are all based on the wisdom of God and the decrees that He has set. Ibn Mas'ud, may Allah be pleased with them, reported that Allah has given to each of His people the same as He has shared their sustenance among them. Indeed, Allah gives wealth to those whom He loves, and does not bestow faith except those whom He loves and loves. They feel the gift of God because their ambition is not fulfilled. If they had been achieved, they would have been buried in the earth as Karun had experienced. Their understanding is even stronger that those who disregard the favor of God, reject His Messenger, and the reward promised in the Hereafter to those who obey Him. They will be destroyed by the chastisement of the word of Allah: And indeed, there came to them an apostle from among themselves, but they denied it, therefore they were punished and they were unjust. (an-Nahl \/ 16: 113)",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang semula bercita-cita ingin mempunyai kedudukan dan posisi terhormat seperti yang pernah dimiliki Karun, dengan seketika mengurungkan cita-citanya setelah menyaksikan azab yang ditimpakan kepada Karun. Mereka menyadari bahwa harta benda yang banyak dan kehidupan duniawi yang serba mewah, tidak mengantarkan mereka pada keridaan Allah. Dia memberi rezeki kepada yang dikehendaki-Nya, dan tidak memberi kepada yang tidak dikehendaki. Allah meninggikan dan merendahkan orang yang dikehendaki-Nya. Kesemuanya itu adalah berdasarkan kebijaksanaan Allah dan ketetapan yang telah digariskan-Nya.\n\nDiriwayatkan dari Ibnu Mas'ud bahwa Allah telah memberikan kepada manusia watak masing-masing sebagaimana Dia telah membagi-bagikan rezeki di antara mereka. Sesungguhnya Allah itu memberikan harta kepada orang yang disenangi, dan tidak menganugerahkan iman kecuali kepada orang yang disenangi dan dikasihi-Nya.\n\nMereka merasa memperoleh karunia dari Allah karena cita-cita mereka belum tercapai. Andaikata sudah tercapai, tentu mereka dibenamkan juga ke dalam bumi sebagaimana yang telah dialami Karun. Pengertian mereka bertambah mantap bahwa tidak beruntung orang-orang yang mengingkari nikmat Allah, mendustakan rasul-Nya, dan pahala yang dijanjikan di akhirat bagi orang yang taat kepada-Nya. Mereka akan dimusnahkan oleh azab, firman Allah:\n\nDan sungguh, telah datang kepada mereka seorang rasul dari (kalangan) mereka sendiri, tetapi mereka mendustakannya, karena itu mereka ditimpa azab dan mereka adalah orang yang zalim. (an-Nahl\/16: 113)",
      "text_translation": "Dan orang-orang yang kemarin mengangan-angankan kedudukannya (Karun) itu berkata, “Aduhai, benarlah kiranya Allah yang melapangkan rezeki bagi siapa yang Dia kehendaki di antara hamba-hamba-Nya dan membatasi (bagi siapa yang Dia kehendaki di antara hamba-hamba-Nya). Sekiranya Allah tidak melimpahkan karunia-Nya pada kita, tentu Dia telah membenamkan kita pula. Aduhai, benarlah kiranya tidak akan beruntung orang-orang yang mengingkari (nikmat Allah).”",
      "text": "وَاَصْبَحَ الَّذِيْنَ تَمَنَّوْا مَكَانَهٗ بِالْاَمْسِ يَقُوْلُوْنَ وَيْكَاَنَّ اللّٰهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ مِنْ عِبَادِهٖ وَيَقْدِرُۚ  لَوْلَآ اَنْ مَّنَّ اللّٰهُ عَلَيْنَا لَخَسَفَ بِنَا ۗوَيْكَاَنَّهٗ لَا يُفْلِحُ الْكٰفِرُوْنَ ࣖ ",
      "text_translation_en": "And on the morrow, those who but yesterday had longed to be in his place exclaimed: “Alas [for our not having been aware] that it is indeed God [alone] who grants abundant sustenance, or gives it in scant measure, unto whichever He wills of His crea­tures! Had not God been gracious to us, He might have caused [the earth] to swallow us, too! Alas [for our having forgotten] that those who deny the truth can never attain to a happy state!”",
      "juz_number": 20
    },
    "83": {
      "text_tafsir_en": "This verse explains that happiness and all the pleasures of the hereafter are provided for those who are not obscured, do not boast, and do no harm on earth such as persecution and so on. They are humble, know how to give themselves to older people and more knowledge. For the younger and less educated, they are loving, unmotivated, and proud of themselves. Those who are arrogant and arrogant are displeased with Allah, will suffer great torment, and will not go to heaven hereafter, as Allah says: As for those who believe and do good deeds, Allah will reward them and increase some of their bounty. -Yes. As for those who refuse (to worship Allah) and boast, Allah will punish them with a painful torment. And they will find no protector and helper other than Allah. (an-Nisa '\/ 4: 173) The word of the Messenger of Allah (may peace be upon him): There will not be a paradise in his heart that is obscure, even in size. (Muslim and Abu Dawud History of Ibn Mas'ud) Verse 83 closes with the explanation that the good end of heaven is obtained by those who fear Allah by practicing His commands, abstaining from His prohibitions, unrepentant and self-righteous such as Pharaohs and Treasures.",
      "text_tafsir": "Ayat ini menerangkan bahwa kebahagiaan dan segala kenikmatan di akhirat disediakan untuk orang-orang yang tidak takabur, tidak menyombongkan diri, dan tidak berbuat kerusakan di muka bumi seperti menganiaya dan sebagainya. Mereka itu bersifat rendah hati, tahu menempatkan diri kepada orang yang lebih tua dan lebih banyak ilmunya. Kepada yang lebih muda dan kurang ilmunya, mereka mengasihi, tidak takabur, dan menyom-bongkan diri. Orang yang takabur dan menyombongkan diri tidak disukai Allah, akan mendapat siksa yang amat pedih, dan tidak masuk surga di akhirat nanti, sebagaimana firman Allah:\n\nAdapun orang-orang yang beriman dan mengerjakan kebajikan, Allah akan menyempurnakan pahala bagi mereka dan menambah sebagian dari karunia-Nya. Sedangkan orang-orang yang enggan (menyembah Allah) dan menyombongkan diri, maka Allah akan mengazab mereka dengan azab yang pedih. Dan mereka tidak akan mendapatkan pelindung dan penolong selain Allah. (an-Nisa'\/4: 173) \n\nSabda Rasulullah saw:\n\nTidak akan masuk surga orang yang ada di dalam hatinya sifat takabur, sekalipun sebesar zarah. (Riwayat Muslim dan Abu Dawud dari Ibnu Mas'ud) \n\nAyat 83 ini ditutup dengan penjelasan bahwa kesudahan yang baik berupa surga diperoleh orang-orang yang takwa kepada Allah dengan mengamalkan perintah-Nya, menjauhi larangan-Nya, tidak takabur dan tidak menyombongkan diri seperti Fir'aun dan Karun.",
      "text_translation": "Negeri akhirat itu Kami jadikan bagi orang-orang yang tidak menyombongkan diri dan tidak berbuat kerusakan di bumi. Dan kesudahan (yang baik) itu bagi orang-orang yang bertakwa.",
      "text": "تِلْكَ الدَّارُ الْاٰخِرَةُ نَجْعَلُهَا لِلَّذِيْنَ لَا يُرِيْدُوْنَ عُلُوًّا فِى الْاَرْضِ وَلَا فَسَادًا ۗوَالْعَاقِبَةُ لِلْمُتَّقِيْنَ ",
      "text_translation_en": "As for that [happy] life in the hereafter, We grant it [only] to those who do not seek to exalt themselves on earth, nor yet to spread corruption: for the future belongs to the God-conscious.",
      "juz_number": 20
    },
    "84": {
      "text_tafsir_en": "This verse explains that whoever comes in the future brings a good deed, will be rewarded with a better, and multiplied as much as possible. No one knows how many multiples except God as a gift and mercy from Him. The Messenger of Allah said: Whoever intends to do one good, then does not do it, Allah records the reward on His side a perfect good, if he intends to do one good then he does, then Allah records (the reward) with all good up to seven hundred fold, even double more. (History of al-Bukhari and Muslim from Ibn 'Abbas) In another hadith the Messenger of Allah said: And whoever intends to do one crime then does not do it, then write by Allah Almighty on His side a perfect goodness, and if he intends to do it later he did, so God listed for him only one crime. (History of al-Bukhari and Muslim from Ibn 'Abbas) This is in accordance with the word of Allah: And whoever brings evil, their faces are thrown into hell. You are not given a reply, but (in kind) with what you have done. (an-Naml \/ 27: 90)",
      "text_tafsir": "Ayat ini menerangkan bahwa siapa yang di akhirat datang dengan membawa satu amal kebajikan, akan dibalas dengan yang lebih baik, dan dilipatgandakan sebanyak-banyaknya. Tidak ada yang mengetahui berapa kelipatannya kecuali Allah sebagai karunia dan rahmat dari-Nya. Rasulullah saw bersabda:\n\nSiapa yang bermaksud akan mengerjakan satu kebaikan, kemudian tidak jadi dikerjakannya, Allah mencatat pahala pada sisi-Nya satu kebaikan yang sempurna, kalau ia bermaksud mengerjakan satu kebaikan lalu dikerjakannya, maka Allah mencatat (pahala) dengan sepenuh kebaikan sampai tujuh ratus kali lipat, bahkan lipat ganda yang lebih banyak lagi. (Riwayat al-Bukhari dan Muslim dari Ibnu 'Abbas)\n\nDalam hadis lain Rasulullah bersabda:\n\nDan barang siapa yang bermaksud mengerjakan satu kejahatan kemudian tidak dikerjakannya, maka ditulislah oleh Allah swt di sisi-Nya satu kebaikan yang sempurna, dan kalau ia bermaksud mengerjakan kemudian dikerjakannya, maka Allah mencatatkan baginya hanya satu kejahatan saja. (Riwayat al-Bukhari dan Muslim dari Ibnu 'Abbas)\n\nHal ini sesuai dengan firman Allah:\n\nDan barang siapa membawa kejahatan, maka disungkurkanlah wajah mereka ke dalam neraka. Kamu tidak diberi balasan, melainkan (setimpal) dengan apa yang telah kamu kerjakan. (an-Naml\/27: 90)",
      "text_translation": "Barangsiapa datang dengan (membawa) kebaikan, maka dia akan mendapat (pahala) yang lebih baik daripada kebaikannya itu; dan barang siapa datang dengan (membawa) kejahatan, maka orang-orang yang telah mengerjakan kejahatan itu hanya diberi balasan (seimbang) dengan apa yang dahulu mereka kerjakan.",
      "text": "مَنْ جَاۤءَ بِالْحَسَنَةِ فَلَهٗ خَيْرٌ مِّنْهَاۚ وَمَنْ جَاۤءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِيْنَ عَمِلُوا السَّيِّاٰتِ اِلَّا مَا كَانُوْا يَعْمَلُوْنَ ",
      "text_translation_en": "Whosoever shall come [before God] with a good deed will gain [further] good there from; but as for any who shall come with an evil deed - [know that] they who do evil deeds will not be requited with more than [the like of] what they have done.",
      "juz_number": 20
    },
    "85": {
      "text_tafsir_en": "In this verse, Allah explains that He is obliged to Muhammad to practice the Qur'an, and to carry out the laws and commandments therein. He was the one who would return Muhammad to the holy land of Mecca, the land of his blood in triumph and recapture it from the people who had driven him from there. Muhammad saw his return to Mecca with a great victory for the Muslims, thus allowing him to develop Islam freely and to suppress the will of the Muslims. This was a promise from Allah when Muhammad was always hurting and under heavy pressure from his people that he would emigrate from Mecca, and return to victory. In addition to returning to Mecca, some think that Allah will return the Messenger to death or return to heaven, as Allah says: Say: \"O my people! to find a (best) place in the Hereafter, but the unjust will not prosper (al-An'am \/ 6: 135)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Dialah yang mewajibkan kepada Muhammad mengamalkan isi Al-Qur'an, dan melaksanakan hukum-hukum dan perintah yang ada di dalamnya. Dia pulalah yang akan mengembalikan Muhammad ke tanah suci Mekah, tanah tumpah darahnya dalam keadaan menang dan merebutnya kembali dari kaum yang telah mengusirnya dari sana. Muhammad saw kembali ke Mekah dengan satu kemenangan besar bagi kaum Muslimin, karena dengan demikian ia dapat mengembangkan Islam dengan bebas dan dapat menekan kehendak kaum musyrikin. Ini adalah janji dari Allah ketika Muhammad selalu disakiti dan mendapat tekanan yang berat dari kaumnya bahwa dia akan hijrah meninggalkan Mekah, dan akan kembali dalam keadaan menang. \n\nSelain kembali ke Mekah, ada yang berpendapat Allah mengembalikan Rasul kepada kematian atau mengembalikan ke surga, sebagaimana firman Allah:\n\nKatakanlah (Muhammad), \"Wahai kaumku! Berbuatlah menurut kedudukanmu, aku pun berbuat (demikian). Kelak kamu akan mengetahui, siapa yang akan memperoleh tempat (terbaik) di akhirat (nanti). Sesungguhnya orang-orang yang zalim itu tidak akan beruntung. (al-An'am\/6: 135)",
      "text_translation": "Sesungguhnya (Allah) yang mewajibkan engkau (Muhammad) untuk (melaksanakan hukum-hukum) Al-Qur'an, benar-benar akan mengembalikanmu ke tempat kembali. Katakanlah (Muhammad), “Tuhanku mengetahui orang yang membawa petunjuk dan orang yang berada dalam kesesatan yang nyata.”",
      "text": "اِنَّ الَّذِيْ فَرَضَ عَلَيْكَ الْقُرْاٰنَ لَرَاۤدُّكَ اِلٰى مَعَادٍ ۗقُلْ رَّبِّيْٓ اَعْلَمُ مَنْ جَاۤءَ بِالْهُدٰى وَمَنْ هُوَ فِيْ ضَلٰلٍ مُّبِيْنٍ ",
      "text_translation_en": "VERILY, [O believer,] He who has laid down this Qur’an in plain terms, making it binding on thee, will assuredly bring thee back [from death] to a life renewed. Say [unto those who reject the truth]: My Sus­tainer knows best, as to who is right-guided and who is obviously lost in error!”",
      "juz_number": 20
    },
    "86": {
      "text_tafsir_en": "This verse explains that Muhammad never expected the Qur'an to be revealed to him to know the stories of the people before, and what happened thereafter, such as religion that brought happiness to mankind in the world and the hereafter, as well as manners - that raises their degrees and sharpens their minds. Nevertheless, Allah sent it all to Muhammad as His mercy. In this verse, Allah forbids the Prophet Muhammad and his people to help fight the unbelievers in any form. The Muhammadans were instead asked to help strengthen the struggle of the Muslims. Therefore, he should praise his Lord for the blessings bestowed upon him by the downfall of the Holy Qur'an. The Prophet (peace be upon him) did not need to help and support those who disobey the Holy Qur'an, but rather separate and turn away from them according to the word of Allah. to you) and turn away from the idolaters. (al-hijr \/ 15: 94)",
      "text_tafsir": "Ayat ini menerangkan bahwa Muhammad tidak pernah mengharapkan diturunkannya Al-Qur'an kepadanya untuk mengetahui berita-berita orang-orang sebelumnya, dan hal-hal yang terjadi sesudahnya, antara lain seperti agama yang mengandung kebahagiaan bagi manusia di dunia dan akhirat, dan juga adab-adab yang meninggikan derajat mereka dan mencerdaskan akal pikiran mereka. Sekalipun demikian, Allah menurunkan semuanya itu kepada Muhammad sebagai rahmat dari-Nya.\n\nPada ayat ini, Allah melarang Nabi Muhammad dan umatnya untuk membantu perjuangan orang-orang kafir dalam bentuk apa pun. Umat Muhammad justru dituntut untuk membantu memperkuat perjuangan umat Islam. Oleh karena itu, hendaklah ia memuji Tuhannya atas nikmat yang dikaruniakan kepadanya dengan penurunan kitab suci Al-Qur'an. Nabi saw tidak perlu menolong dan membantu orang-orang musyrik yang mengingkari Kitab suci Al-Qur'an itu, tetapi hendaklah ia memisahkan diri dan berpaling dari mereka sesuai dengan firman Allah:\n\nMaka sampaikanlah (Muhammad) secara terang-terangan segala apa yang diperintahkan (kepadamu) dan berpalinglah dari orang yang musyrik. (al-hijr\/15: 94)",
      "text_translation": "Dan engkau (Muhammad) tidak pernah mengharap agar Kitab (Al-Qur'an) itu diturunkan kepadamu, tetapi ia (diturunkan) sebagai rahmat dari Tuhanmu, sebab itu janganlah sekali-kali engkau menjadi penolong bagi orang-orang kafir,",
      "text": "وَمَا كُنْتَ تَرْجُوْٓا اَنْ يُّلْقٰٓى اِلَيْكَ الْكِتٰبُ اِلَّا رَحْمَةً مِّنْ رَّبِّكَ  فَلَا تَكُوْنَنَّ ظَهِيْرًا لِّلْكٰفِرِيْنَ ۖ ",
      "text_translation_en": "Now [as for thyself, O believer,] thou couldst never foresee that this divine writ would [one day] be offered to thee: but [it did come to thee] by thy Sustainer’s grace. Hence, never uphold those who deny the truth [of divine guidance],",
      "juz_number": 20
    },
    "87": {
      "text_tafsir_en": "Allah advised Muhammad not to tolerate the disbelief of the unbelievers, and never be influenced until they succeeded in preventing the transmission of the Holy Qur'an after it was revealed to him. God was always with him and strengthened and won his religion from unbelievers. Even the Prophet (peace and blessings be upon him) was commanded to call his people to Allah's way and to convey his religion to them, worshiping only Allah who had no allies for him. At the end of this verse, God emphasized that Muhammad should never abandon his preaching, and always deliver his leaflets to the Muslims, so that he, unlike them, would not violate his commands. In another verse it is explained: And never join the heathen. (al-An'am \/ 6: 14",
      "text_tafsir": "Allah menganjurkan kepada Muhammad agar tidak mengindahkan tipu daya orang-orang kafir, dan jangan sekali-kali terpengaruh sehingga mereka berhasil menghalang-halangi penyampaian ayat-ayat suci Al-Qur'an sesudah diturunkan kepadanya. Allah selalu bersamanya dan menguatkan serta memenangkan agama-Nya dari orang-orang kafir. Bahkan Nabi saw diperintahkan menyeru kaumnya ke jalan Allah dan menyampaikan agama-Nya kepada mereka, menyembah hanya kepada Allah saja yang tidak ada sekutu bagi-Nya. Pada akhir ayat ini, Allah menekankan supaya Muhammad jangan sekali-kali meninggalkan dakwahnya, dan selalu menyampaikan risalahnya kepada kaum musyrikin, supaya dia tidak seperti mereka, bermaksiat menyalahi perintah-Nya. Di ayat lain diterangkan:\n\nDan jangan sekali-kali kamu masuk golongan orang-orang musyrik. (al-An'am\/6: 14",
      "text_translation": "dan jangan sampai mereka menghalang-halangi engkau (Muhammad) untuk (menyampaikan) ayat-ayat Allah, setelah ayat-ayat itu diturunkan kepadamu, dan serulah (manusia) agar (beriman) kepada Tuhanmu, dan janganlah engkau termasuk orang-orang musyrik.",
      "text": "وَلَا يَصُدُّنَّكَ عَنْ اٰيٰتِ اللّٰهِ بَعْدَ اِذْ اُنْزِلَتْ اِلَيْكَ وَادْعُ اِلٰى رَبِّكَ وَلَا تَكُوْنَنَّ مِنَ الْمُشْرِكِيْنَ ۚ ",
      "text_translation_en": "and never let them turn thee away from God’s messages after they have been bestowed upon thee from on high: instead summon [all men] to thy Sustainer. And never be of those who ascribe divinity to aught but Him,",
      "juz_number": 20
    },
    "88": {
      "text_tafsir_en": "In this verse, Allah forbids Prophet Muhammad to worship other than Allah, because there is no God to be worshiped except Allah, as He says: (He is) the God of the east and the west, there is no god but Him, therefore make Him a protector. (al-Muzzammil \/ 73: 9) God is immortal even though all living beings are dead and perish. The Word of God: Everything on earth will perish, but the face of your Lord of glory and glory will remain. (ar-Rahman \/ 55: 26-27) And the words of the Prophet Muhammad (saw): The most correct expression of the poet is what Labid said, \"Know that everything but Allah will perish.\" (The History of al-Bukhari and the Muslims of Abu Hurairah) He is the ruler of the kingdom, and he does his will. He determines everything that will happen to all beings. To him shall all be restored, and shall be repaid according to their deeds. If he does good, obeys, and obeys the commandments of God, he will enter heaven. Instead, if he commits sin and commits sin, he will go to hell. The Prophet (peace be upon him) said, as Abu Hurairah reported: All my people will go to heaven except those who do not. Whoever obeys me, he goes into heaven, and whoever does evil to me he does not refuse. (History of al-Bukhari from Abu Hurairah).",
      "text_tafsir": "Pada ayat ini, Allah melarang Nabi Muhammad menyembah sembahan lain selain Allah, karena tiada Tuhan yang patut disembah kecuali Allah, sebagaimana firman Nya:\n\n(Dialah) Tuhan timur dan barat, tidak ada tuhan selain Dia, maka jadikanlah Dia sebagai pelindung. (al-Muzzammil\/73: 9) \n\nAllah itu kekal abadi sekalipun semua makhluk yang ada sudah mati dan binasa. Firman Allah:\n\nSemua yang ada di bumi itu akan binasa, tetapi wajah Tuhanmu yang memiliki kebesaran dan kemuliaan tetap kekal. (ar-Rahman\/55: 26-27) \n\nDan sabda Nabi Muhammad saw:\n\nUngkapan paling benar yang diucapkan penyair adalah yang diucapkan oleh Labid, yaitu: \"Ketahuilah setiap sesuatu selain dari Allah akan binasa.\" (Riwayat al-Bukhari dan Muslim dari Abu Hurairah)\n\nAllah-lah yang mempunyai kerajaan, dan berbuat sekehendak-Nya. Dia-lah yang menentukan segala sesuatu yang akan berlaku kepada semua makhluk. Kepada-Nyalah akan dikembalikan semuanya, dan dibalas menurut amal perbuatannya masing-masing. Kalau ia beramal baik, taat, dan patuh kepada perintah Allah, akan dimasukkan ke dalam surga. Sebaliknya kalau ia berbuat maksiat dan bergelimang dosa, akan dimasukkan ke dalam neraka. Nabi saw bersabda sebagaimana diriwayatkan dari Abu Hurairah:\n\nSemua umatku akan masuk surga kecuali yang tidak mau. Barang siapa taat kepadaku, maka ia masuk ke dalam surga, dan barang siapa durhaka kepadaku, maka sungguh ia telah enggan. (Riwayat al-Bukhari dari Abu Hurairah).",
      "text_translation": "Dan jangan (pula) engkau sembah tuhan yang lain selain Allah. Tidak ada tuhan (yang berhak disembah) selain Dia. Segala sesuatu pasti binasa, kecuali Allah. Segala keputusan menjadi wewenang-Nya, dan hanya kepada-Nya kamu dikembalikan.",
      "text": "وَلَا تَدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَۘ  لَآ اِلٰهَ اِلَّا هُوَۗ كُلُّ شَيْءٍ هَالِكٌ اِلَّا وَجْهَهٗ ۗ لَهُ الْحُكْمُ وَاِلَيْهِ تُرْجَعُوْنَ ࣖ ",
      "text_translation_en": "and never call upon any other deity side by side with God. There is no deity save Him. Everything is bound to perish, save His [eternal] self. With Him rests all judgment; and unto Him shall you all be brought back.",
      "juz_number": 20
    }
  },
  "name": "القصص",
  "name_translation_en": "The Stories",
  "name_translation": "Kisah-Kisah",
  "name_latin": "Al-Qasas"
}