{
  "number": 29,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 69,
  "ayat": {
    "1": {
      "text_tafsir_en": "Alif Lam Mim, see the interpretation of the hijaiyah letters at the beginning of Surah al-Baqarah",
      "text_tafsir": "Alif Lam Mim, lihat tafsir mengenai huruf-huruf hijaiyah pada awal Surah al-Baqarah",
      "text_translation": "Alif Lam Mim.",
      "text": "الۤمّۤ ۗ ",
      "text_translation_en": "Alif. Lam. Mim.",
      "juz_number": 20
    },
    "2": {
      "text_tafsir_en": "In this verse, Allah asks people who have claimed to believe by saying the shahada that they will be left to acknowledge the faith without first being tested? No, even every believer must be tested first, so that it can be known to what extent they are patient and hold the test. The trials they have to take vary. For example commands to migrate (leaving home to save faith and belief), strive in the way of Allah, control lust, carry out tasks in order to obey God, and various disasters such as the loss of family members, and dry heat that causes growth - plants die of drought. All trials are intended to test who among those who truly believe sincerely and who also has a hypocritical spirit. It also aims to find out whether they are people who have a strong stance or who are still doubtful and doubtful so that their faith is still fragile. The purpose of this verse can be seen in other verses, namely: Do you think that you will be left (just like that), even though Allah does not know those who strive among you and do not take a loyal friend other than Allah, His Messenger and those believers. Allah is thorough in what you do. (at-Taubah \/ 9: 16) From the above explanation it can be concluded that every person who professes the faith will not reach the true nature of faith before he takes various tests. The test can be in the form of obligations such as obligations in utilizing property, hijrah, jihad in the way of Allah, paying zakat to the poor, helping people who are experiencing difficulties and difficulties, and can also be in the form of disaster.",
      "text_tafsir": "Pada ayat ini, Allah bertanya kepada manusia yang telah mengaku beriman dengan mengucapkan kalimat syahadat bahwa apakah mereka akan dibiarkan begitu saja mengakui keimanan tersebut tanpa lebih dahulu diuji? Tidak, malah setiap orang beriman harus diuji lebih dahulu, sehingga dapat diketahui sampai di manakah mereka sabar dan tahan menerima ujian tersebut. Ujian yang mesti mereka tempuh itu bermacam-macam. Umpamanya perintah berhijrah (meninggalkan kampung halaman demi menyelamatkan iman dan keyakinan), berjihad di jalan Allah, mengendalikan syahwat, mengerjakan tugas-tugas dalam rangka taat kepada Allah, dan bermacam-macam musibah seperti kehilangan anggota keluarga, dan hawa panas yang kering yang menyebabkan tumbuh-tumbuhan mati kekeringan. Semua cobaan itu dimaksudkan untuk menguji siapakah di antara mereka yang sungguh-sungguh beriman dengan ikhlas dan siapa pula yang berjiwa munafik. Juga bertujuan untuk mengetahui apakah mereka termasuk orang yang kokoh pendiriannya atau orang yang masih bimbang dan ragu sehingga iman mereka masih rapuh.\n\nMaksud ayat ini dapat dilihat dalam ayat lain, yakni:\n\nApakah kamu mengira bahwa kamu akan dibiarkan (begitu saja), padahal Allah belum mengetahui orang-orang yang berjihad di antara kamu dan tidak mengambil teman yang setia selain Allah, Rasul-Nya dan orang-orang yang beriman. Allah Mahateliti terhadap apa yang kamu kerjakan. (at-Taubah\/9: 16) \n\nDari paparan di atas dapat diambil kesimpulan bahwa setiap orang yang mengaku beriman tidak akan mencapai hakikat iman yang sebenarnya sebelum ia menempuh berbagai macam ujian. Ujian itu bisa berupa kewajiban seperti kewajiban dalam memanfaatkan harta benda, hijrah, jihad di jalan Allah, membayar zakat kepada fakir miskin, menolong orang yang sedang mengalami kesusahan dan kesulitan, dan bisa juga berupa musibah.",
      "text_translation": "Apakah manusia mengira bahwa mereka akan dibiarkan hanya dengan mengatakan, “Kami telah beriman,” dan mereka tidak diuji?",
      "text": "اَحَسِبَ النَّاسُ اَنْ يُّتْرَكُوْٓا اَنْ يَّقُوْلُوْٓا اٰمَنَّا وَهُمْ لَا يُفْتَنُوْنَ ",
      "text_translation_en": "DO MEN THINK that on their [mere] saying, “We have attained to faith”, they will be left to themselves, and will not be put to a test?",
      "juz_number": 20
    },
    "3": {
      "text_tafsir_en": "Those who believe and hold fast to their faith will face many kinds of suffering and hardship. They are patient and steadfast in resisting the pain. For example, the children of Israel believed, God tested them with all kinds of torture that Pharaoh inflicted on them. Believers in Jesus also did not escape punishment and suffering. They are all examples and lessons for this Muslim community. In a hadith of the Holy Prophet (may peace be upon him), it is narrated: Khabbab bin al-Aratt, narrated that he said, \"We confessed to the Messenger of Allah that he was sleeping in his bed beside the Kaaba, we said (that we suffered many kinds of severe tortures from the Muslims). Will you not help us, O Messenger of Allah, by praying for our deliverance from the torment? The Messenger replied, \"People before you have experienced this, even worse. A person whose faith is dedicated to God is punished, and digs a special hole for him. A saw was placed over his head. Then the saw was lowered slowly, so that the man's body was split in two. Others were combed with a heated iron comb. But they do not want to step down from their religious beliefs. By Allah, this religion will be upheld by all, so that it is safe for travelers traveling from shan'a 'to Hadramaut. They do not fear but to God, even though the wolves surround the animals. But you want to succeed too quickly. \" I put my hands on her blanket. Then I noticed the heat on his blanket. I said, 'O Messenger of Allah, what a wonderful summer this is. The Messenger of Allah (may peace be upon him) replied, We are faced with many temptations, but God has given us many rewards. I asked again, 'O Messenger of Allah, who is the one who suffered the most? He answered, 'Prophets. I asked again, 'O Messenger of Allah, then who else? 'O righteous people, answer him. \"(Ibn Majah) The Prophet's statement is reinforced by the verse which reads: And how many prophets fought with a large number of his followers who feared, and they did not (become) weak because of disaster who trampled on him in the way of Allah, did not despair and did not give up (to the enemy), and Allah loves those who are patient. (Ali 'Imran \/ 3: 146) With all these different kinds of suffering, Allah knows who is right God will reward each of them with what he deserves. In short, God forbids humans to think that he was created for free. determines who has the highest degree in the eyes of God. struggle, whether we are reluctant or willing to deal with it. The higher the level of patience, the higher the victory and the lessons to be gained. That is the law of God for the people of old and now.",
      "text_tafsir": "Orang-orang yang beriman dan berpegang teguh dengan keimanannya akan menghadapi berbagai macam penderitaan dan kesulitan. Mereka sabar dan tabah menahan penderitaan itu. Umpamanya Bani Israil yang beriman, telah diuji Allah dengan berbagai macam siksaan yang dijatuhkan Fir'aun kepadanya. Umat Nabi Isa yang beriman juga tidak luput dari azab dan kesengsaraan. Semuanya menjadi contoh dan pelajaran bagi umat beragama Islam ini. Dalam sebuah hadis Nabi saw dijelaskan:\n\nDiriwayatkan oleh Khabbab bin al-Aratt bahwa ia berkata, \"Kami mengadukan kepada Rasulullah yang dalam keadaan tidur beralaskan sorbannya di sisi Ka'bah, kami mengatakan (bahwa kami menderita berbagai macam siksaan berat dari kaum musyrikin). Apakah kamu tidak akan menolong kami wahai Rasulullah, dengan cara engkau berdoa untuk keselamatan kami dari siksaan tersebut? Rasulullah menjawab, \"Orang-orang sebelum kamu juga mengalami hal seperti ini, bahkan lebih hebat lagi. Seseorang yang karena keimanannya yang membaja kepada Tuhan ia dihukum, dan digali lubang khusus untuknya. Diletakkan gergaji di atas kepalanya. Kemudian gergaji itu diturunkan perlahan-lahan, sehingga tubuh orang tersebut terbelah dua. Ada pula yang badannya disisir dengan sisir besi runcing yang sudah dipanaskan. Namun mereka tidak mau mundur dari keyakinan agamanya. Demi Allah, agama ini pasti akan kutegakkan jua, sehingga amanlah musafir yang sedang dalam perjalanan dari shan'a' ke Hadramaut. Mereka tidak takut kecuali hanya kepada Allah, walaupun serigala-serigala mengelilingi binatang ternaknya. Tetapi kamu terlalu ingin cepat berhasil.\" (Riwayat al-Bukhari)\n\nDiriwayatkan dari Abi Sa'id al-Khudri bahwa dia berkata, \"Saya memasuki rumah Rasulullah dan menjumpai beliau sedang tidak enak badan (demam). Saya meletakkan tangan di atas selimut beliau. Maka saya dapati rasa panas di atas selimut beliau. Saya berkata, 'Wahai Rasulullah, alangkah hebatnya panas ini. Rasulullah menjawab, 'Ya memang begitu. Kita sedang ditimpa cobaan yang berlipat ganda datangnya, tetapi pahalanya pun berlipat ganda diberikan Allah kepada kita. Saya bertanya lagi, 'Wahai Rasulullah, siapakah orang yang paling berat penderitaan yang dialaminya? Beliau menjawab, 'Nabi-nabi. Saya bertanya lagi, 'Wahai Rasulullah, lalu siapa lagi? 'Orang-orang yang saleh, jawab beliau.\" (Riwayat Ibnu Majah)\n\nKeterangan Rasulullah demikian diperkuat oleh ayat yang berbunyi:\n\nDan betapa banyak nabi yang berperang didampingi sejumlah besar dari pengikut(nya) yang bertakwa. Mereka tidak (menjadi) lemah karena bencana yang menimpanya di jalan Allah, tidak patah semangat dan tidak (pula) menyerah (kepada musuh). Dan Allah mencintai orang-orang yang sabar. (ali 'Imran\/3: 146) \n\nDengan beraneka ragam penderitaan itulah, Allah mengetahui siapakah yang betul-betul sempurna keimanannya, dan siapa pula yang menutupi kepalsuannya dengan sikap beriman. Allah akan membalas masing-masing mereka itu dengan apa yang pantas baginya. Ringkasnya, Allah melarang manusia berprasangka bahwa ia diciptakan dengan percuma begitu saja. Justru Allah akan menguji setiap manusia, untuk menentukan siapakah yang paling tinggi derajatnya di sisi Allah. Derajat tersebut tidak mungkin diperoleh kecuali dengan menempuh ujian yang berat. \n\nHidup ini memang penuh dengan perjuangan, baik kita enggan atau senang menghadapinya. Semakin tinggi tingkat kesabaran, makin tinggi pula kemenangan dan pengajaran yang akan diperoleh. Itulah sunah Allah yang berlaku bagi umat dahulu dan sekarang.",
      "text_translation": "Dan sungguh, Kami telah menguji orang-orang sebelum mereka, maka Allah pasti mengetahui orang-orang yang benar dan pasti mengetahui orang-orang yang dusta.",
      "text": "وَلَقَدْ فَتَنَّا الَّذِيْنَ مِنْ قَبْلِهِمْ  فَلَيَعْلَمَنَّ اللّٰهُ الَّذِيْنَ صَدَقُوْا وَلَيَعْلَمَنَّ الْكٰذِبِيْنَ ",
      "text_translation_en": "Yea, indeed, We did test those who lived before them; and so, [too, shall be tested the people now living: and] most certainly will God mark out those who prove themselves true, and most certainly will He mark out those who are lying.",
      "juz_number": 20
    },
    "4": {
      "text_tafsir_en": "God warns, however, that there is still a group of people who think that those who are still doing evil will be able to weaken God, so that He has no power to compensate. Has not God's provision for the unjust before been fulfilled, where they have been tortured with the punishment of their sins? According to Ibn 'Abbas, this verse came down to condemn a number of Meccanic monks who think that whatever they do, no one can repay. They are al-Walid bin al-Mugirah, Abu Jahal, al-Aswad, al-'as bin Hisham, 'Utbah bin Rabi'ah, al-Walid bin' Utbah, 'Utbah bin Abi Mu'aith, Handhalah bin Abu Sufyan, and al-'as bin Wa'il. Indeed such thoughts are false and incorrect. God does not make something useless. He tests and educates people with a variety of teachings, with the aim of gaining a clear Divine conscience.",
      "text_tafsir": "Seterusnya Allah memperingatkan, apakah masih ada segolongan manusia yang berprasangka bahwa orang-orang yang masih mengerjakan perbuatan jahat itu akan sanggup melemahkan Allah, sehingga Dia tidak kuasa mendatangkan balasan yang sebanding dengan perbuatannya. Apakah belum berlaku lagi ketetapan Tuhan bagi orang-orang zalim sebelumnya, di mana mereka telah disiksa dengan siksaan yang setimpal dengan kesalahan mereka? \n\nMenurut Ibnu 'Abbas, ayat ini turun sebagai kecaman kepada sejumlah tokoh musyrikin Mekah yang menganggap bahwa apa saja yang mereka kerjakan, tidak ada yang sanggup membalasnya. Mereka itu adalah al-Walid bin al-Mugirah, Abu Jahal, al-Aswad, al-'as bin Hisyam, 'Utbah bin Rabi'ah, al-Walid bin 'Utbah, 'Utbah bin Abi Mu'aith, Handhalah bin Abu Sufyan, dan al-'as bin Wa'il. Sesungguhnya pikiran yang demikian adalah keliru dan tidak benar. Allah tidak menjadikan sesuatu itu sia-sia. Dia menguji dan mendidik manusia dengan berbagai macam pengajaran, dengan maksud agar mereka memperoleh nur Ilahi yang terang benderang.",
      "text_translation": "Ataukah orang-orang yang mengerjakan kejahatan itu mengira bahwa mereka akan luput dari (azab) Kami? Sangatlah buruk apa yang mereka tetapkan itu! ",
      "text": "اَمْ حَسِبَ الَّذِيْنَ يَعْمَلُوْنَ السَّيِّاٰتِ اَنْ يَّسْبِقُوْنَا ۗسَاۤءَ مَا يَحْكُمُوْنَ ",
      "text_translation_en": "Or do they think - they who do evil deeds [while claiming to have attained to faith] - that they can escape Us? Bad, indeed, is their judgment!",
      "juz_number": 20
    },
    "5": {
      "text_tafsir_en": "This verse explains that the person who longs to meet God and receives his charitable reward on the Day of Judgment, should practice and avoid any restrictions that might provoke him. Because the reward for one's charity will surely come. Allah is All-Hearing and All-Knowing. Therefore, this verse is a warning that every person always intends to achieve what he wants, the will of God and instills fear in his heart of punishment and torment. The purpose of \"meeting God\" in this verse is \"to receive goodwill in heaven in return for good deeds\", where the peak of enjoyment is to see the substance of God himself. Meanwhile, Ibn 'Abbas interpreted it as \"the Day of Resurrection and the Day of reckoning\". The clear meaning contained in this verse encourages one to prepare by doing as much good as possible and avoiding Allah's prohibitions altogether. Thus, they receive eternal happiness in the hereafter. Jumhur scholars have interpreted liqa'ullah with death (death) which is certain to come. But the words above contain the promise of God in return for good deeds and torture for evil deeds. Whether death or the promise of God, both will surely come.",
      "text_tafsir": "Ayat ini menjelaskan bahwa orang yang sangat menginginkan untuk bertemu dengan Allah dan memperoleh balasan amal dari-Nya di hari Kiamat, sepatutnya beramal dan menjauhi segala larangan yang mungkin menimbulkan kemurkaan-Nya. Sebab balasan untuk amal seseorang pasti akan datang. Allah Maha Mendengar dan Maha Mengetahui niat dan amal seseorang. Oleh karena itu, ayat ini merupakan peringatan agar setiap orang senantiasa berniat untuk mencapai apa yang diinginkannya, yakni keridaan Allah dan menanamkan rasa takut dalam hati sanubarinya akan azab dan siksa-Nya.\n\nMaksud \"menemui Allah\" dalam ayat ini ialah \"memperoleh nikmat dalam surga sebagai balasan amal perbuatan baik\", di mana puncak dari kenikmatan itu adalah dengan melihat Zat Allah itu sendiri. Sementara itu Ibnu 'Abbas menafsirkan dengan arti \"hari Kebangkitan dan hari Perhitungan\". Yang jelas makna yang terkandung dalam ayat ini mendorong seseorang untuk mempersiapkan diri dengan mengerjakan perbuatan baik sebanyak mungkin dan menjauhi sama sekali larangan-larangan Allah. Dengan demikian, mereka memperoleh kebahagiaan yang abadi di akhirat kelak. \n\nJumhur ulama tafsir menafsirkan liqa'ullah dengan maut (kematian) yang sudah pasti datangnya. Namun dalam kata di atas terkandung pula arti janji Allah berupa balasan bagi amal baik dan siksaan untuk perbuatan jahat. Baik mati atau janji Allah, keduanya pasti akan datang.",
      "text_translation": "Barangsiapa mengharap pertemuan dengan Allah, maka sesungguhnya waktu (yang dijanjikan) Allah pasti datang. Dan Dia Yang Maha Mendengar, Maha Mengetahui.",
      "text": "مَنْ كَانَ يَرْجُوْا لِقَاۤءَ اللّٰهِ فَاِنَّ اَجَلَ اللّٰهِ لَاٰتٍ ۗوَهُوَ السَّمِيْعُ الْعَلِيْمُ ",
      "text_translation_en": "Whoever looks forward [with hope and awe] to meeting God [on Resurrection Day, let him be ready for it]: for, behold, the end set by God [for every­one’s life] is bound to come - and He alone is all-hearing, all-knowing!",
      "juz_number": 20
    },
    "6": {
      "text_tafsir_en": "Allah explains that a person who is fighting hard (jihad), which is one of the aspects of the expression of longing for God, is in fact the struggle for himself, not for God. Jihad means fighting the enemy and fighting your own lust. It could mean devoting all efforts to God and not just war. The one who will earn the fruits of his struggle is the one who relies on his intention to get revenge from God, the Lord of hosts. God does not need whether they will fight for themselves or not at all, because He is rich from all His creation. He is the Sovereign of the universe and does it at his own will. The essence of jihad is patience, either jihad in fighting the enemy or jihad in controlling lust. A person who is patient in jihad means he is able to withstand trials and to hold fast to the truths he has come to believe. In addition, it also strives to overcome obstacles in upholding that truth. In other verses, God emphasizes that one's beneficence is in the best interests of himself. As Allah says: Whoever does good is for himself and whoever does evil is responsible for himself. And your Lord does not wrong His servants. (Fussilat \/ 41: 46) And the word of Allah: If you do good, then you do good to yourself. And if you do evil, then (loss of evil) is for yourself. (al-Isra '\/ 17: 7)",
      "text_tafsir": "Allah menjelaskan bahwa seseorang yang sungguh-sungguh berjuang (berjihad), yang merupakan salah satu aspek dari ungkapan kerinduan menemui Allah, pada hakikatnya perjuangan itu untuk dirinya sendiri, bukan untuk Allah. Jihad berarti memerangi musuh dan melawan nafsu sendiri. Bisa juga berarti mengerahkan segala upaya untuk Allah dan bukan hanya bermakna perang. \n\nOrang yang akan memperoleh hasil dari perjuangannya adalah orang yang menyandarkan niatnya untuk memperoleh balasan dari Allah, Tuhan semesta alam. Allah tidak memerlukan apakah mereka akan berjuang untuk dirinya sendiri atau tidak berjuang sama sekali, sebab Dia Maha Kaya dari sekalian ciptaan-Nya. Dialah Yang Menguasai sekalian alam ini dan berbuat menurut kehendaknya sendiri. \n\nInti dari jihad adalah sabar, baik jihad dalam memerangi musuh maupun jihad dalam mengendalikan nafsu. Orang yang sabar dalam berjihad berarti tahan dalam menghadapi cobaan dan tetap berpegang teguh kepada kebenaran yang telah diyakininya. Selain itu, ia juga berusaha mengatasi rintangan-rintangan dalam menegakkan kebenaran itu. Dalam ayat-ayat lain, Allah menegaskan bahwa faedah amaliah seseorang itu betul-betul untuk kepentingan dirinya.\n\nSebagaimana firman Allah:\n\nBarang siapa mengerjakan kebajikan maka (pahalanya) untuk dirinya sendiri dan barang siapa berbuat jahat maka (dosanya) menjadi tanggungan dirinya sendiri. Dan Tuhanmu sama sekali tidak menzalimi hamba-hamba(-Nya). (Fussilat\/41: 46) \n\nDan firman Allah:\n\nJika kamu berbuat baik (berarti) kamu berbuat baik untuk dirimu sendiri. Dan jika kamu berbuat jahat, maka (kerugian kejahatan) itu untuk dirimu sendiri. (al-Isra'\/17: 7)",
      "text_translation": "Dan barangsiapa berjihad, maka sesungguhnya jihadnya itu untuk dirinya sendiri. Sungguh, Allah Mahakaya (tidak memerlukan sesuatu) dari seluruh alam.",
      "text": "وَمَنْ جَاهَدَ فَاِنَّمَا يُجَاهِدُ لِنَفْسِهٖ ۗاِنَّ اللّٰهَ لَغَنِيٌّ عَنِ الْعٰلَمِيْنَ ",
      "text_translation_en": "Hence, whoever strives hard [in God’s cause] does so only for his own good: for, verily, God does not stand in need of anything in all the worlds!",
      "juz_number": 20
    },
    "7": {
      "text_tafsir_en": "Then Allah made it clear that those who believe in Allah and His Messenger with true faith, though tempted by various trials, did not turn to disbelief. In the same way that he suffered in the face of the unbelievers, he kept his duties, avoided all restrictions, raised fears, helped the oppressed, defended the oppressed, defended and defended the country against enemy attacks, and cooperated with each other. . They receive a reward from God for forgiveness of all their past sins and mistakes. All of this is because of the multiplicity of rewards that God has given us ten times. Allah says: He who does good will receive tenfold for his deeds. And whoever commits a crime is compensated for his crime. They were not harmed at all. (al-An'am \/ 6: 160)",
      "text_tafsir": "Kemudian Allah menjelaskan bahwa orang yang beriman kepada Allah dan rasul-Nya dengan keimanan yang benar walaupun diuji dengan berbagai cobaan, ia tidak berbalik kepada kekafiran (murtad). Begitu juga ketika mengalami penderitaan dalam berhadapan dengan orang-orang musyrik, dia tetap mengerjakan segala kewajibannya, menjauhi segala larangan, mempertinggi ketakwaan, menolong orang yang sedang kesusahan, membela orang teraniaya, mempertahankan dan membela negara dari serangan musuh, dan bekerja sama satu sama lain. Mereka itu mendapat ganjaran dari Allah berupa ampunan dari semua dosa dan kesalahan mereka yang telah lalu. Semua itu merupakan sebab pelipatgandaan pahala yang diberikan Allah menjadi sepuluh kali lipat.\n\nAllah berfirman:\n\nBarang siapa berbuat kebaikan mendapat balasan sepuluh kali lipat amalnya. Dan barang siapa berbuat kejahatan dibalas seimbang dengan kejahatannya. Mereka sedikit pun tidak dirugikan (dizalimi). (al-An'am\/6: 160)",
      "text_translation": "Dan orang-orang yang beriman dan mengerjakan kebajikan, pasti akan Kami hapus kesalahan-kesalahannya dan mereka pasti akan Kami beri balasan yang lebih baik dari apa yang mereka kerjakan.",
      "text": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَنُكَفِّرَنَّ عَنْهُمْ سَيِّاٰتِهِمْ وَلَنَجْزِيَنَّهُمْ اَحْسَنَ الَّذِيْ كَانُوْا يَعْمَلُوْنَ ",
      "text_translation_en": "And as for those who attain to faith and do righteous deeds, We shall most certainly efface their [previous] bad deeds, and shall most certainly reward them in accordance with the best that they ever did.",
      "juz_number": 20
    },
    "8": {
      "text_tafsir_en": "God commands people to do good to their parents. The only way to do good is to earn (spend), nurture, and respect them both with love, unless they both invoke shirk. So, the limit of doing good is that all things ordered do not involve acts that contain the elements of shirk. In another verse it is said: And your Lord commanded that ye should not worship but him, and that ye should do good to the fathers. If one of the two or both of them reaches adulthood in your upbringing, never say the word \"ah\" and do not shout at them, and say both good words. (al-Isra '\/ 17: 23) The same meaning is also found in the verse: And We command men to do good to their parents. Her mother conceived her with great difficulty, and gave birth to her with great difficulty (again). Her pregnancy lasted for thirty months, so that when she (the child) had grown up and she was forty years old she prayed, \"My Lord, give me guidance that I may be grateful for the favor you have bestowed on me and on both men.\" and that I may do the good that thou hast in me, and grant me good that shall flow unto my children. Verily I repent unto thee and verily I am a Muslim. \" (al-Ahqaf \/ 46: 15) To gain a comprehensive understanding of the meaning found in the above verse, see Allah's statement in the following verse: And We command men (to do good) to both parents. Her mother had conceived her in a weakened state, and weaned her for two years. Be grateful to me and to your parents. Only to me is your return. And if they compel you to associate me with something you have no knowledge of, then do not obey them, and go on in the world well, and follow the path of those who return to me. Then only to me your return, and I will tell you what you have done. (Luqman \/ 31: 14-15) Concerning the prohibition of obedience to beings in the practice of evil is mentioned in the authentic hadith, that is: It is impossible to obey (human) beings in disobeying God (Khaliq). (History of Ahmad from Ali bin Abi bible) The meaning of the word \"something you do not know\" in the verse is that there is no knowledge of divine or divine matters. In other words, it is not permissible to follow a person, as long as it is not known what is going on. Therefore, one cannot imitate something that is clearly mistaken. Furthermore, it is said that all mankind will return to Allah on the Day of Judgment, both the unbeliever and the believer, both the good of the parents and the wicked. All the deeds done in the world will be rewarded by God, good will be rewarded with good, and evil will be repaid with evil.",
      "text_tafsir": "Allah memerintahkan manusia berbuat baik kepada orang tua (ibu bapak). Jalan berbuat baik itu ialah dengan memberi nafkah (belanja), memelihara, dan menghormati keduanya dengan penuh kasih sayang, kecuali apabila keduanya mengajak kepada perbuatan syirik. Jadi, batas berbuat baik itu ialah sepanjang hal-hal yang diperintahkan tidak menyangkut kepada perbuatan yang mengandung unsur syirik. Dalam ayat lain disebutkan pula:\n\nDan Tuhanmu telah memerintahkan agar kamu jangan menyembah selain Dia dan hendaklah berbuat baik kepada ibu bapak. Jika salah seorang di antara keduanya atau kedua-duanya sampai berusia lanjut dalam pemeliharaanmu, maka sekali-kali janganlah engkau mengatakan kepada keduanya perkataan \"ah\" dan janganlah engkau membentak keduanya, dan ucapkanlah kepada keduanya perkataan yang baik. (al-Isra'\/17: 23) \n\nKeterangan yang hampir sama maksudnya diperoleh pula dalam ayat:\n\nDan Kami perintahkan kepada manusia agar berbuat baik kepada kedua orang tuanya. Ibunya telah mengandungnya dengan susah payah, dan melahirkannya dengan susah payah (pula). Masa mengandung sampai menyapihnya selama tiga puluh bulan, sehingga apabila dia (anak itu) telah dewasa dan umurnya mencapai empat puluh tahun dia berdoa, \"Ya Tuhanku, berilah aku petunjuk agar aku dapat mensyukuri nikmat-Mu yang telah Engkau limpahkan kepadaku dan kepada kedua orang tuaku dan agar aku dapat berbuat kebajikan yang Engkau ridhai; dan berilah aku kebaikan yang akan mengalir sampai kepada anak cucuku. Sesungguhnya aku bertobat kepada Engkau dan sungguh, aku termasuk orang muslim.\" (al-Ahqaf\/46: 15) \n\nUntuk memperoleh pengertian yang menyeluruh dari arti yang didapat pada ayat di atas, bisa diperhatikan keterangan Allah dalam ayat di bawah ini:\n\nDan Kami perintahkan kepada manusia (agar berbuat baik) kepada kedua orang tuanya. Ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam usia dua tahun. Bersyukurlah kepada-Ku dan kepada kedua orang tuamu. Hanya kepada Aku kembalimu. Dan jika keduanya memaksamu untuk mempersekutukan Aku dengan sesuatu yang engkau tidak mempunyai ilmu tentang itu, maka janganlah engkau menaati keduanya, dan pergaulilah keduanya di dunia dengan baik, dan ikutilah jalan orang yang kembali kepada-Ku. Kemudian hanya kepada-Ku tempat kembalimu, maka akan Aku beritahukan kepadamu apa yang telah kamu kerjakan. (Luqman\/31: 14-15) \n\nMengenai larangan taat kepada makhluk dalam berbuat maksiat disebutkan dalam hadis sahih, yakni:\n\nTidak boleh taat kepada makhluk (manusia) dalam mendurhakai Tuhan (Khaliq). (Riwayat Ahmad dari Ali bin Abi thalib) \n\nMaksud perkataan \"sesuatu yang tidak engkau ketahui\" dalam ayat tersebut ialah tidak adanya pengetahuan tentang soal-soal ketuhanan atau ilahiyah. Dengan kata lain tidak dibenarkan taat mengikuti seseorang, sepanjang tidak diketahui tentang soal yang diikuti itu. Oleh sebab itu, tidak boleh mencontoh sesuatu yang sudah jelas kekeliruannya. Selanjutnya dikatakan semua manusia akan kembali kepada Allah pada hari Kiamat, baik yang kafir maupun yang mukmin, baik yang berbuat baik kepada orang tuanya maupun yang durhaka. Semua amal yang dikerjakan di dunia, akan dibalas oleh Allah, yang berbuat baik dibalas dengan kebaikan, dan yang berbuat jahat dibalas dengan kejahatan pula.",
      "text_translation": "Dan Kami wajibkan kepada manusia agar (berbuat) kebaikan kepada kedua orang tuanya. Dan jika keduanya memaksamu untuk mempersekutukan Aku dengan sesuatu yang engkau tidak mempunyai ilmu tentang itu, maka janganlah engkau patuhi keduanya. Hanya kepada-Ku tempat kembalimu, dan akan Aku beritakan kepadamu apa yang telah kamu kerjakan.",
      "text": "وَوَصَّيْنَا الْاِنْسَانَ بِوَالِدَيْهِ حُسْنًا ۗوَاِنْ جَاهَدٰكَ لِتُشْرِكَ بِيْ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ فَلَا تُطِعْهُمَا ۗاِلَيَّ مَرْجِعُكُمْ فَاُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ ",
      "text_translation_en": "Now [among the best of righteous deeds which] We have enjoined upon man [is] goodness towards his parents; yet [even so,] should they endeavour to make thee ascribe divinity, side by side with Me, to something which thy mind cannot accept [as divine], obey then, not: [for] it is unto Me that you all must return, whereupon I shall make you [truly] understand [the right and wrong of] all that you were doing [in life].",
      "juz_number": 20
    },
    "9": {
      "text_tafsir_en": "Then reaffirmed the position of those who believe and do good and who always purify their souls. They will be included in the group of virtuous people, and placed in heaven \"Jannatun na'im\". God placed them in the company of the righteous as a reward given to those who chose to obey the commands of Allah and His Messenger instead of the deceptive parents. The refusal of the child to obey the parents' orders must have led to a strained relationship between the two parties. Therefore, God promised the child that he would be rewarded better, which would include the righteous. As-shalihin here means a group of people who are very devoted to Allah and who join the group of prophets and others, as mentioned in the word of Allah in Surah an-Nisa '\/ 4: 69: And who obeys Allah and The Messenger of Allah (Muhammad), then they will be with those whom Allah has bestowed, that is, prophets, lovers of truth, martyrs and godly men. They are the best of friends. (Nisa '\/ 4: 69)",
      "text_tafsir": "Kemudian ditegaskan kembali kedudukan orang-orang yang beriman dan berbuat baik serta orang yang senantiasa menyucikan jiwanya. Mereka akan dimasukkan dalam kelompok orang-orang saleh, dan ditempatkan dalam surga \"Jannatun na'im\".\n\nAllah memasukkan mereka ke dalam golongan orang-orang saleh sebagai ganjaran yang dianugerahkan kepada siapa saja yang memilih untuk mengindahkan perintah Allah dan rasul-Nya daripada perintah orang tua yang bersifat kedurhakaan. Keengganan anak mengikuti perintah orang tuanya pasti mengakibatkan kekeruhan hubungan antara kedua pihak. Untuk itu, Allah menjanjikan kepada sang anak bahwa ia akan diberi ganti yang lebih baik, yaitu akan dimasukkan ke dalam golongan orang-orang yang saleh.\n\nAs-shalihin di sini maksudnya adalah kelompok orang-orang yang sangat berbakti kepada Allah dan yang bergabung dengan kelompok para nabi dan lain-lain, sebagaimana disebutkan dalam firman Allah dalam Surah an-Nisa'\/4: 69:\n\nDan barang siapa menaati Allah dan Rasul (Muhammad), maka mereka itu akan bersama-sama dengan orang yang diberikan nikmat oleh Allah, (yaitu) para nabi, para pencinta kebenaran, orang-orang yang mati syahid dan orang-orang saleh. Mereka itulah teman yang sebaik-baiknya. (an-Nisa'\/4: 69)",
      "text_translation": "Dan orang-orang yang beriman dan mengerjakan kebajikan mereka pasti akan Kami masukkan mereka ke dalam (golongan) orang yang saleh.",
      "text": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَنُدْخِلَنَّهُمْ فِى الصّٰلِحِيْنَ ",
      "text_translation_en": "But as for those who have attained to faith and have done righteous deeds, We shall most certainly cause them to join the righteous [in the hereafter as well].",
      "juz_number": 20
    },
    "10": {
      "text_tafsir_en": "According to history, these verses have been revealed in connection with an incident involving a person named 'Ayyasy bin Abi Rabi'ah where he initially converted to Islam and emigrated to Medinah. However, because of his Islam, he suffered many kinds of torture. Because he couldn't stand it anymore, he apostatized and turned into a Catholic. The tormentor was a Quraysh infidel named Abu Jahal and al-harits. Both are his own uncle (his mother's biological sister). Finally 'Ayyasy converted to Islam and became a good Muslim. This verse describes the condition of a person who claims to believe in God and declares with his tongue what is unified. However, when he is slandered or tortured by unbelievers who dislike his religion, he assumes that the slander of trial and torment of others is the same as the torment of God in the hereafter. Therefore, instead of undergoing continual torture, it is better to return to idolatry. In fact, if he was a true believer, he would have endured the ordeal, and put his peace of mind in his heart. However, the temptation instead turned his heart away from believing in Allah, just as Allah's punishment turned away from his unbelief. He thought the torment of man was inevitable, and the torment of Allah in the hereafter could have been avoided. In another verse it is said: And among men there is worship of God only on the edge; then when he gets good, he is satisfied, and when he is tempted, he turns back. He lost in this world and in the hereafter. That's a real disadvantage. (al-hajj \/ 22: 11) If the help of Allah comes to the struggling believers, then those who still doubt the truth of Islam pretend to be good friends and say, \"We are always with you as brothers, brother, and we will help you in the face of the enemy. \" What they say is nothing but the words of their mouths. Because they have lied about what they have said. The rest of the verse emphasizes: (that is) the people who are waiting for (events) to happen to you. When you receive victory from Allah they say, \"Are we not with you?\" And if the disbelievers get their share, they say, \"Did we not win you over, and defend you from the believers?\" Then Allah will decide between you on the Day of Resurrection. Allah will not give way to unbelievers to defeat the believers. (Nisa '\/ 4: 141)",
      "text_tafsir": "Menurut riwayat, ayat-ayat ini diturunkan berkaitan dengan peristiwa yang terjadi pada seseorang yang bernama 'Ayyasy bin Abi Rabi'ah di mana pada mulanya ia telah masuk Islam kemudian berhijrah ke Medinah. Akan tetapi, karena keislamannya itu, ia mengalami berbagai macam siksaan. Karena tidak tahan lagi, ia kembali murtad dan kembali menjadi musyrik. Orang yang menyiksanya adalah tokoh kafir Quraisy bernama Abu Jahal dan al-harits. Keduanya adalah pamannya sendiri (adik kandung ibunya). Akhirnya 'Ayyasy masuk Islam kembali dan menjadi muslim yang baik.\n\nAyat ini menerangkan keadaan seseorang yang mengaku beriman kepada Allah dan mengikrarkan dengan lidah tentang keesaan-Nya. Akan tetapi, bila ia difitnah atau disiksa oleh orang musyrik yang tidak senang dengan keislamannya, ia menganggap bahwa fitnah yang berupa cobaan dan siksaan dari orang lain itu sama saja dengan azab dari Tuhan di akhirat. Oleh karena itu, daripada mengalami siksaan terus-menerus, lebih baik ia kembali lagi kepada agama berhala (murtad). \n\nSebenarnya kalau ia sungguh-sungguh beriman, tentu ia bersabar atas cobaan tersebut, dan menenteramkan hatinya dengan keimanan yang bersarang dalam dadanya. Namun demikian, cobaan tersebut justru memalingkan hatinya dari beriman kepada Allah, sebagaimana azab Allah memalingkan seseorang dari kekafirannya. Ia menyangka siksaan dari manusia tidak dapat dihindarkan, sedang azab Allah di akhirat bisa saja dihindari. Dalam ayat lain disebutkan lagi:\n\nDan di antara manusia ada yang menyembah Allah hanya di tepi; maka jika dia memperoleh kebajikan, dia merasa puas, dan jika dia ditimpa suatu cobaan, dia berbalik ke belakang. Dia rugi di dunia dan di akhirat. Itulah kerugian yang nyata. (al-hajj\/22: 11)\n\nJika pertolongan Allah didatangkan kepada orang-orang mukmin yang sedang berjuang, maka golongan yang masih ragu-ragu dengan kebenaran Islam itu pura-pura menjadi sahabat yang baik dan mengatakan, \"Kami selalu bersamamu sebagai saudara-saudara seagama, dan kami akan menolongmu dalam menghadapi musuh.\" Apa yang mereka ucapkan itu tidak lain hanyalah sekadar ucapan mulut mereka saja. Sebab mereka telah berdusta dengan apa yang telah mereka dakwakan. Keterangan ayat lain menegaskan:\n\n(yaitu) orang yang menunggu-nunggu (peristiwa) yang akan terjadi pada dirimu. Apabila kamu mendapat kemenangan dari Allah mereka berkata, \"Bukankah kami (turut berperang) bersama kamu?\" Dan jika orang kafir mendapat bagian, mereka berkata, \"Bukankah kami turut memenangkanmu, dan membela kamu dari orang mukmin?\" Maka Allah akan memberi keputusan di antara kamu pada hari Kiamat. Allah tidak akan memberi jalan kepada orang kafir untuk mengalahkan orang-orang beriman. (an-Nisa'\/4: 141)",
      "text_translation": "Dan di antara manusia ada sebagian yang berkata, “Kami beriman kepada Allah,” tetapi apabila dia disakiti (karena dia beriman) kepada Allah, dia menganggap cobaan manusia itu sebagai siksaan Allah. Dan jika datang pertolongan dari Tuhanmu, niscaya mereka akan berkata, “Sesungguhnya kami bersama kamu.” Bukankah Allah lebih mengetahui apa yang ada di dalam dada semua manusia?",
      "text": "وَمِنَ النَّاسِ مَنْ يَّقُوْلُ اٰمَنَّا بِاللّٰهِ فَاِذَآ اُوْذِيَ فِى اللّٰهِ جَعَلَ فِتْنَةَ النَّاسِ كَعَذَابِ اللّٰهِ ۗوَلَىِٕنْ جَاۤءَ نَصْرٌ مِّنْ رَّبِّكَ لَيَقُوْلُنَّ اِنَّا كُنَّا مَعَكُمْۗ اَوَلَيْسَ اللّٰهُ بِاَعْلَمَ بِمَا فِيْ صُدُوْرِ الْعٰلَمِيْنَ ",
      "text_translation_en": "Now there is among men many a one who says [of himself and of others like him], “We do believe in God” - but whenever he is made to suffer in God’s cause, he thinks that persecution at the hands of man is as [much to be feared, or even more than,] God’s chastisement; whereas, if succour from thy Sustainer comes [to those who truly believe] he is sure to say. “Behold, we have always been with you!” Is not God fully aware of what is in the hearts of all creatures?",
      "juz_number": 20
    },
    "11": {
      "text_tafsir_en": "God warns the attitude of such people and asserts that He knows everything that is in their hearts. There is nothing hidden. In short, those hypocrites have been known to God by their true hearts even though they have always expressed their faith. It is impossible for God to deceive them in this way. Slander in the form of trials and tortures is nothing more than to exclude believers, those who are deeply religious and who are hypocritical (hypocritical). People who truly believe will obey Allah in all situations and situations. Those who persevere and endure hardship will receive a fair reward and reward from God. On the contrary, hypocrites will return to him when they are in trial or when they feel the burden and obligation imposed so heavy that they cannot bear to do it. Further evidence can be found in verse 12 of this chapter, and in the verse: God will not allow those who believe as you are today, so He distinguishes between good and bad. God will not show you supernatural things, but He will choose whom He wills from His apostles. Therefore, believe in Allah and His apostles. If you believe and are obedient, you will receive a great reward (Ali 'Imran \/ 3: 179)",
      "text_tafsir": "Allah memperingatkan sikap orang-orang yang demikian dan menegaskan bahwa Dia mengetahui segala sesuatu yang tergores dalam hati mereka. Tidak ada sedikit pun yang tersembunyi. Ringkasnya orang-orang munafik tersebut telah diketahui Allah bagaimana hati mereka yang sebenarnya sekalipun mereka senantiasa menyatakan imannya. Allah tidak mungkin dapat mereka tipu dengan cara demikian. Fitnah dalam bentuk cobaan dan siksaan tersebut tidak lain hanyalah untuk menyisihkan orang-orang yang beriman, siapa yang sungguh-sungguh murni keyakinannya dan siapa pula yang berjiwa munafik (hipokrit). Orang yang betul-betul beriman akan menaati Allah dalam segala keadaan dan situasi. Mereka yang tabah dan sabar menghadapi penderitaan akan memperoleh kemenangan dan pahala yang setimpal dari Allah. Sebaliknya, orang munafik kembali akan mendurhakai-Nya bila sedang ditimpa cobaan atau ketika merasakan beban dan kewajiban yang dipikulkan sangat memberatkan, sehingga hati mereka tidak tahan mengerjakannya. Keterangan selanjutnya dapat dilihat pada ayat 12 surah ini, dan pada ayat:\n\nAllah tidak akan membiarkan orang-orang yang beriman sebagaimana dalam keadaan kamu sekarang ini, sehingga Dia membedakan yang buruk dari yang baik. Allah tidak akan memperlihatkan kepadamu hal-hal yang gaib, tetapi Allah memilih siapa yang Dia kehendaki di antara rasul-rasul-Nya. Oleh karena itu, berimanlah kepada Allah dan rasul-rasul-Nya. Jika kamu beriman dan bertakwa, maka kamu akan mendapat pahala yang besar.(ali 'Imran\/3:179)",
      "text_translation": "Dan Allah pasti mengetahui orang-orang yang beriman dan Dia pasti mengetahui orang-orang yang munafik.",
      "text": "وَلَيَعْلَمَنَّ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَلَيَعْلَمَنَّ الْمُنٰفِقِيْنَ ",
      "text_translation_en": "[Yea-] and most certainly will God mark out those who have [truly] attained to faith, and most certainly will He mark out the hypocrites.",
      "juz_number": 20
    },
    "12": {
      "text_tafsir_en": "According to Mujahid, this verse was taken to express the efforts of the Quraysh to persuade the believers by saying, \"We and you will not be raised again. Therefore, follow our steps. that sin. \" In connection with this, God warned the believers that the unbelievers were lying. Because on the Day of Judgment, no one is allowed to bear the sins of others. Allah declares: And the sinner will not bear the sins of others. And if a man who is burdened with a heavy burden calls (others) to bear the burden, it will not be cast down in spite of (his calling) his relatives. (Fathir \/ 35:18) And the word of God: They see one another. On that day, the sinner would wish that he might redeem (himself) from the torment with his children. (al-Ma'arij \/ 70: 11) At the end of this verse, Allah reiterates that they are liars. Imam az-Zamakhsyari interpreted that among those who invited his colleagues to sin were also those who professed Islam. They promised to endure his torture so that the foolish and weak of his faith were tempted with such persuasion and gentle appeal.",
      "text_tafsir": "Menurut Mujahid, ayat ini diturunkan untuk mengungkapkan usaha-usaha orang Quraisy membujuk kaumnya yang telah beriman dengan mengatakan, \"Kami dan kamu tidak akan dibangkitkan kembali. Oleh karena itu, ikutilah langkah-langkah kami. Andaikata kamu berdosa lantaran pekerjaan ini, kamilah yang memikul dosa itu.\" Berkaitan dengan hal ini, Allah memperingatkan orang-orang beriman bahwa orang-orang kafir itu berdusta. Sebab pada hari Kiamat, tidak ada seorang pun diperkenankan memikul dosa orang lain. Allah menegaskan:\n\nDan orang yang berdosa tidak akan memikul dosa orang lain. Dan jika seseorang yang dibebani berat dosanya memanggil (orang lain) untuk memikul bebannya itu, tidak akan dipikulkan sedikit pun meskipun (yang dipanggilnya itu) kaum kerabatnya. (Fathir\/35: 18) \n\nDan firman Allah:\n\nSedang mereka saling melihat. Pada hari itu, orang yang berdosa ingin sekiranya dia dapat menebus (dirinya) dari azab dengan anak-anaknya. (al-Ma'arij\/70: 11) \n\nPada akhir ayat ini, Allah menegaskan kembali bahwa mereka itu adalah orang-orang yang bohong. Imam az-Zamakhsyari menafsirkan bahwa di antara mereka yang mengajak rekan-rekannya berbuat dosa itu terdapat juga orang-orang yang mengaku beragama Islam. Mereka menjanjikan untuk menanggung siksaannya sehingga orang-orang bodoh dan lemah imannya tergoda dengan bujukan dan rayuan halus itu.",
      "text_translation": "Dan orang-orang yang kafir berkata kepada orang-orang yang beriman, “Ikutilah jalan kami, dan kami akan memikul dosa-dosamu,” padahal mereka sedikit pun tidak (sanggup) memikul dosa-dosa mereka sendiri. Sesungguhnya mereka benar-benar pendusta.",
      "text": "وَقَالَ الَّذِيْنَ كَفَرُوْا لِلَّذِيْنَ اٰمَنُوا اتَّبِعُوْا سَبِيْلَنَا وَلْنَحْمِلْ خَطٰيٰكُمْۗ وَمَا هُمْ بِحَامِلِيْنَ مِنْ خَطٰيٰهُمْ مِّنْ شَيْءٍۗ اِنَّهُمْ لَكٰذِبُوْنَ ",
      "text_translation_en": "And [He is aware, too, that] they who are bent on denying the truth speak [thus, as it were,] to those who have attained to faith: “Follow our way [of life], and we shall indeed take your sins upon ourselves!” But never could they take upon themselves aught of the sins of those [whom they would thus mislead]: behold, they are liars indeed!",
      "juz_number": 20
    },
    "13": {
      "text_tafsir_en": "Against the demands and persuasion of those infidels, Allah emphasized that they were of no use to them. The argument is conveyed in an attempt to persuade others to the disbelief and error they must bear and to those who commit it because of their persuasion. But those who do it themselves will not be lessened even if those who first ask for it are doubly tortured. In this verse it is reiterated: (Their words) cause them on the Day of Judgment to bear their own sins perfectly, and some of the sins of those whom they have erred in ignorance. Remember, what a terrible (sin) they have accumulated. (an-Nahl \/ 16: 25) In a hadith narrated by Muslims from Abu Hurairah, the Messenger of Allah (may peace be upon him) said: Whoever invokes a person to guide (Allah), he will receive as much reward as those who practice it without any less. his reward (to Doomsday), and whoever drives a person astray, to him is as much sin as one who follows it (to the Day of Judgment) without the least penalty. (Muslim History of Abu Hurairah). At the end of this verse, God emphasizes that in the future they will be asked for their responsibility for the lies they have committed in the world. He was asked questions in a tone of contempt for those whom they had lied to, so that they became lost.",
      "text_tafsir": "Terhadap ajakan dan bujukan orang-orang kafir itu, Allah menegaskan bahwa tidak ada gunanya bagi diri mereka rayuan-rayuan tersebut. Bujukan tersebut disampaikan dalam usaha mengajak orang lain kepada kekafiran dan kesesatan yang harus mereka tanggung dosanya dan orang yang melakukan karena bujukannya. Namun orang yang melakukannya sendiri tidak akan berkurang dosanya sekalipun yang mengajaknya lebih dahulu dilipatgandakan siksaannya. Pada ayat ini ditegaskan kembali:\n\n(Ucapan mereka) menyebabkan mereka pada hari Kiamat memikul dosa-dosanya sendiri secara sempurna, dan sebagian dosa-dosa orang yang mereka sesatkan yang tidak mengetahui sedikit pun (bahwa mereka disesatkan). Ingatlah, alangkah buruknya (dosa) yang mereka pikul itu. (an-Nahl\/16: 25) \n\nDalam sebuah hadis yang diriwayatkan oleh Muslim dari Abu Hurairah, Rasulullah bersabda:\n\nSiapa yang mengajak seseorang kepada petunjuk (Tuhan), ia akan memperoleh pahala sebanyak yang diperoleh oleh orang yang mengamalkan petunjuk itu tanpa dikurangi sedikit pun pahalanya (sampai Kiamat), dan siapa yang mendorong seseorang kepada kesesatan, baginya dosa sebanyak dosa orang yang mengikuti kesesatan itu (sampai hari Kiamat) tanpa dikurangi sedikit pun dosanya. (Riwayat Muslim dari Abu Hurairah).\n\nPada akhir ayat ini, Allah menegaskan bahwa di hari kemudian kelak mereka akan dimintai pertanggungjawabannya tentang kebohongan yang mereka perbuat di dunia. Kepadanya ditanyakan pertanyaan-pertanyaan dengan nada menghina tentang orang-orang yang telah mereka tipu dengan kebohongannya, sehingga mereka menjadi tersesat.",
      "text_translation": "Dan mereka benar-benar akan memikul dosa-dosa mereka sendiri, dan dosa-dosa yang lain bersama dosa mereka, dan pada hari Kiamat mereka pasti akan ditanya tentang kebohongan yang selalu mereka ada-adakan.",
      "text": "وَلَيَحْمِلُنَّ اَثْقَالَهُمْ وَاَثْقَالًا مَّعَ اَثْقَالِهِمْ وَلَيُسْـَٔلُنَّ يَوْمَ الْقِيٰمَةِ عَمَّا كَانُوْا يَفْتَرُوْنَ ࣖ ",
      "text_translation_en": "Yet most certainly will they have to bear their own burdens, and other burdens besides their own; and most certainly will they be called to account on Resurrection Day for all their false assertions!",
      "juz_number": 20
    },
    "14": {
      "text_tafsir_en": "The story of the prophets begins with the story of Noah's struggle. He was the father of the prophets. He preached to his people to believe in the One True God and to believe in his message for nine hundred and fifty years. However, he never tired of inviting them, day or night. Sometimes with a soft voice, but often with a loud voice they convey God's threat to their unbelief. But his efforts did not succeed. Only a few among those who believe. The rest refused and denied him. Therefore, Allah tormented them. There was a torture called the \"Noah's Hurricane\", which was the flood that drowned them all. No one survived God's torment except those who believed in Noah's ark. Al-judge recounts: Ibn 'Abbas, in fact, reported that he said, \"Allah sent Noah when he was 40 years old and preached to his people for 950 years calling upon them to follow the religion of Allah and Noah lived after the flood (typhoon) for 60 years, the number of human beings is increasing and spreading.",
      "text_tafsir": "Kisah para nabi itu dimulai dengan menceritakan riwayat perjuangan Nabi Nuh. Beliau adalah bapak para nabi. Ia berdakwah menyeru kaumnya supaya beriman kepada Allah Yang Maha Esa dan mempercayai kerasulannya selama sembilan ratus lima puluh tahun. Namun demikian, ia tidak pernah merasa bosan mengajak mereka, baik siang maupun malam. Kadang-kadang dengan suara yang lemah lembut, tetapi sering juga dengan suara keras menyampaikan ancaman Allah terhadap kekafiran mereka. Akan tetapi usaha beliau tidak kunjung berhasil. Hanya segelintir saja di antara mereka yang mau beriman. Selebihnya menolak dan mendustakan beliau. Oleh karena itu, Allah menyiksa mereka. Dikirimlah siksaan yang disebut \"Topan Nabi Nuh\", yakni berupa banjir yang menenggelamkan mereka semua. Tidak seorang pun yang selamat dari siksaan Allah itu kecuali orang yang beriman yang ikut dalam bahtera Nuh.\n\nAl-hakim meriwayatkan:\n\nDiriwayatkan dari Ibnu 'Abbas bahwa ia berkata, \"Allah mengutus Nabi Nuh ketika usia 40 tahun dan berdakwah pada kaumnya selama 950 tahun menyeru mereka untuk mengikuti agama Allah dan Nabi Nuh hidup setelah banjir (topan) selama 60 tahun, sehingga jumlah manusia menjadi banyak dan tersebar. (Riwayat al-hakim)",
      "text_translation": "Dan sungguh, Kami telah mengutus Nuh kepada kaumnya, maka dia tinggal bersama mereka selama seribu tahun kurang lima puluh tahun. Kemudian mereka dilanda banjir besar, sedangkan mereka adalah orang-orang yang zalim.",
      "text": "وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَلَبِثَ فِيْهِمْ اَلْفَ سَنَةٍ اِلَّا خَمْسِيْنَ عَامًا ۗفَاَخَذَهُمُ الطُّوْفَانُ وَهُمْ ظٰلِمُوْنَ ",
      "text_translation_en": "And, indeed, [in times long past] We sent forth Noah unto his people, and he dwelt among them a thousand years bar fifty; and then the floods over­whelmed them while they were still lost in evildoing:",
      "juz_number": 20
    },
    "15": {
      "text_tafsir_en": "God saved Noah and his followers by a boat that he had made. The ark of the ark of Noah was an example and a lesson for the people thereafter, as it lay still intact on a hill called Bukit Judi. The boat of Noah for a long time can still be seen by people who visit there intact. It awakens people to the favor of God which He has revealed to believers by saving them from the danger of the flood. This is stated in another verse that says: \"When the waters rise (to the mountain), We bring you (the ancestors) to the ship. That we may make it a warning to you and to hear it with your ears. (al-haqqah \/ 69: 11-12) The lesson to be learned from the above story is that the apostles after Noah did not need to feel sad because their people were not accepting the truth of the revelation they had brought. Torture and obstruction of unbelievers and unbelievers to Islam is a warning to believers that even if the Muslims torture and hurt them in the world, they will eventually return to God. The unbelievers returned to the misery and torment in the flaming hell, while believers and patiently faced the suffering to return to the glorious place of God's help. Such is the lesson from the story of Noah. The unbelievers who had been hurting Noah and his people were eventually drowned by God in the flood, but the believers with Noah survived, sailing on board. Noah's patience to preach in the long run should be a lesson for every preacher. In fact, we should be more patient with Noah, because our age and age are not preaching throughout the lifetime of Noah.",
      "text_tafsir": "Allah menyelamatkan Nuh dan para pengikutnya dengan sebuah perahu yang telah dibuatnya. Adanya bahtera Nabi Nuh menjadi contoh dan pengajaran bagi orang sesudahnya, karena ia terdampar masih dalam keadaan utuh di sebuah bukit yang bernama Bukit Judi. Perahu Nabi Nuh sampai beberapa lama masih dapat disaksikan oleh orang yang berkunjung ke sana dalam keadaan utuh. Hal ini menyadarkan orang kepada nikmat Allah yang diturunkan-Nya kepada orang beriman dengan menyelamatkan mereka dari bahaya banjir. Hal demikian dinyatakan dalam ayat lain yang berbunyi:\n\nSesungguhnya ketika air naik (sampai ke gunung), Kami membawa (nenek moyang) kamu ke dalam kapal. Agar Kami jadikan (peristiwa itu) sebagai peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar. (al-haqqah\/69: 11-12) \n\nPelajaran yang dapat dipetik dari kisah di atas ialah bahwa para rasul sesudah Nuh tidak perlu merasa sedih karena keingkaran kaumnya menerima kebenaran wahyu yang dibawanya. Siksaan dan halangan dari kaum kafir dan musyrik yang tidak senang kepada Islam merupakan peringatan bagi orang yang beriman bahwa sekalipun orang-orang musyrik itu menyiksa dan menyakiti mereka di dunia, namun pada akhirnya semuanya akan kembali juga kepada Tuhan. Orang-orang musyrik itu kembali dengan menemui malapetaka dan kesengsaraan dalam neraka yang menyala-nyala, sedang orang beriman dan sabar dalam menghadapi penderitaan itu kembali ke tempat yang mulia dengan penuh pertolongan Allah.\n\nDemikianlah pelajaran dari kisah Nabi Nuh. Orang kafir yang selama ini menyakiti Nuh dan kaumnya pada akhirnya ditenggelamkan Tuhan dengan banjir, tetapi orang beriman bersama Nuh selamat, berlayar di atas kapal. Kesabaran Nuh berdakwah dalam masa yang lama itu hendaknya dijadikan pelajaran bagi setiap juru dakwah. Bahkan, seharusnya kita yang lebih besar memiliki rasa kesabaran dari Nuh, sebab umur dan usia kita berdakwah tidaklah sepanjang usia Nabi Nuh.",
      "text_translation": "Maka Kami selamatkan Nuh dan orang-orang yang berada di kapal itu, dan Kami jadikan (peristiwa) itu sebagai pelajaran bagi semua manusia.",
      "text": "فَاَنْجَيْنٰهُ وَاَصْحٰبَ السَّفِيْنَةِ وَجَعَلْنٰهَآ اٰيَةً لِّلْعٰلَمِيْنَ ",
      "text_translation_en": "but We saved him, together with all who were in the ark, which We then set up as a symbol [of Our grace] for all people [to remember].",
      "juz_number": 20
    },
    "16": {
      "text_tafsir_en": "God told the Prophet Muhammad to tell his people the story of Abraham. Having grown up, fully developed in his mind, capable of thinking and analyzing things objectively, and having made it possible to achieve the degree of prophetic perfection, Abraham began to devote his attention to calling upon the people to accept the truth he had brought. He invited them to put God in worship and to cleanse themselves of all forms of idolatry. He also called on them to serve God faithfully whether in person or in public, and to abstain from the wrath of God by fulfilling all the duties and responsibilities He had commanded, and abstaining from all His prohibitions. These are the commandments of God that Abraham must convey to his people. What they are saying is that it is best to assume that they have a bit of knowledge. With that knowledge they can distinguish between good and bad, and how to find or gain the most for the world and the hereafter. Then Abraham showed them the misery that had come to those who sought God other than Allah.",
      "text_tafsir": "Allah memerintahkan Nabi Muhammad agar menceritakan kepada umatnya kisah Nabi Ibrahim. Setelah dewasa, sempurna pertumbuhan akalnya, sanggup untuk berpikir dan menganalisa sesuatu dengan objektif, dan telah memungkinkan untuk mencapai derajat kenabian yang sempurna, maka Ibrahim mulai mencurahkan perhatiannya menyeru manusia untuk menerima kebenaran yang dibawanya. Ia mengajak mereka untuk mengesakan Allah dalam ibadah dan membersihkan diri dari segala bentuk kemusyrikan. Ia juga menyerukan agar mereka ikhlas mengabdi kepada Allah baik ketika seorang diri atau di hadapan orang banyak, serta menjauhi murka Allah dengan melaksanakan segala tugas dan kewajiban yang diperintahkan-Nya, serta menjauhi segala larangan-Nya. \n\nSemuanya itu merupakan perintah Allah yang harus disampaikan oleh Ibrahim kepada kaumnya. Apa yang disampaikan itu adalah yang terbaik andaikata mereka memiliki sedikit ilmu pengetahuan. Dengan ilmu itu mereka dapat membedakan antara yang baik dan yang buruk, dan bagaimana mencari atau memperoleh kemanfaatan sebanyak-banyaknya untuk dunia dan akhirat. Kemudian Ibrahim menunjukkan kepada mereka tentang kesengsaraan yang menimpa orang yang mencari tuhan selain Allah.",
      "text_translation": "Dan (ingatlah) Ibrahim, ketika dia berkata kepada kaumnya, “Sembahlah Allah dan bertakwalah kepada-Nya. Yang demikian itu lebih baik bagimu, jika kamu mengetahui.",
      "text": "وَاِبْرٰهِيْمَ اِذْ قَالَ لِقَوْمِهِ اعْبُدُوا اللّٰهَ وَاتَّقُوْهُ ۗذٰلِكُمْ خَيْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ ",
      "text_translation_en": "And Abraham, [too, was inspired by Us] when he said unto his people: “Worship God, and be conscious of Him: this is the best for you, if you but knew it!",
      "juz_number": 20
    },
    "17": {
      "text_tafsir_en": "In this verse, God emphasizes that worship other than He is obviously the product of human hands, but they lie by pretending to be true gods. They consider their sculptural and sculptural works to be of benefit to them. Abraham criticized and criticized their ideas because the statues had little to offer them. That provision is the absolute authority that only God has. Therefore, it is advisable for them to seek their sustenance and income only to Allah, and then be grateful that the request has been granted. Only God provides sustenance for man and all the enjoyment of his servant. Humans are encouraged to seek His will by drawing closer to Him. This verse closes with the words \"to Him you are returned\" which means that people should prepare to meet God in worship and gratitude. Every human being will be asked to be accountable for all his deeds and all the enjoyment they receive",
      "text_tafsir": "Pada ayat ini, Allah menegaskan bahwa sesembahan selain Dia sudah jelas merupakan hasil ciptaan tangan manusia sendiri, tetapi mereka berdusta dengan menganggapnya tuhan yang sebenarnya. Mereka menganggap hasil ciptaan mereka yang berbentuk patung dan berhala itu sanggup memberi manfaat atau keuntungan kepada mereka. Ibrahim mencela dan mengecam anggapan mereka karena patung-patung itu sedikit pun tidak sanggup memberi rezeki kepada mereka. Rezeki itu adalah wewenang mutlak yang hanya dimiliki oleh Allah. Oleh karena itu, dianjurkan kepada mereka supaya memohon rezeki dan penghasilan hanya kepada Allah, kemudian mensyukuri jika yang diminta itu telah dikabulkan-Nya. Hanya Allah yang mendatangkan rezeki bagi manusia serta semua kenikmatan hamba-Nya. Manusia dianjurkan untuk mencari keridaan-Nya dengan jalan mendekatkan diri kepada-Nya. \n\nAyat ini ditutup dengan lafal \"kepada-Nyalah kamu dikembalikan\" artinya manusia harus bersiap-siap menemui Allah dengan beribadah dan bersyukur. Setiap manusia akan dimintai pertanggungjawaban atas segala amal perbuatannya dan semua kenikmatan yang mereka terima",
      "text_translation": "Sesungguhnya yang kamu sembah selain Allah hanyalah berhala-berhala, dan kamu membuat kebohongan. Sesungguhnya apa yang kamu sembah selain Allah itu tidak mampu memberikan rezeki kepadamu; maka mintalah rezeki dari Allah, dan sembahlah Dia dan bersyukurlah kepada-Nya. Hanya kepada-Nya kamu akan dikembalikan.",
      "text": "اِنَّمَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ اَوْثَانًا وَّتَخْلُقُوْنَ اِفْكًا ۗاِنَّ الَّذِيْنَ تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ لَا يَمْلِكُوْنَ لَكُمْ رِزْقًا فَابْتَغُوْا عِنْدَ اللّٰهِ الرِّزْقَ وَاعْبُدُوْهُ وَاشْكُرُوْا لَهٗ ۗاِلَيْهِ تُرْجَعُوْنَ ",
      "text_translation_en": "You worship only [lifeless] idols instead of God, and [thus] you give visible shape to a lie! Behold, those [things and beings] that you worship instead of God have it not in their power to provide sustenance for you: seek, then, all [your] sustenance from God, and worship Him [alone] and be grateful to Him: [for] unto Him you shall be brought back!",
      "juz_number": 20
    },
    "18": {
      "text_tafsir_en": "Abraham again warned his people that if they would justify what they had been told, they would be happy. Instead, they will suffer harm and misery if they continue to reject the prophetic cries as the people before them rejected God's messengers. Among them were the people of Noah, Prophet Hud, and Prophet Saleh. They were all tormented by God for their rebellion. On the other hand, God has saved the believers and His apostles. This verse concludes by emphasizing that the mission and mission of the apostle is to convey the truth to mankind. If they were to justify or reject it, it would not have any effect on the apostles themselves. There is no authority given by God to every apostle to compel mankind to believe in his preaching. Whether they want to justify it or deny it is beyond their responsibility.",
      "text_tafsir": "Ibrahim kembali memperingatkan kaumnya bahwa jika mereka membenarkan apa yang telah disampaikan kepada mereka, pasti mereka akan bahagia. Sebaliknya, mereka akan mendapat mudarat dan kesengsaraan jika tetap mendustakan seruan nabi seperti yang dialami orang-orang sebelum mereka yang mendustakan para utusan Tuhan. Di antaranya seperti yang telah dialami umat Nabi Nuh, Nabi Hud, dan Nabi Saleh. Mereka semua telah disiksa Allah akibat kedurhakaan mereka. Di sisi lain, Allah telah menyelamatkan orang-orang yang beriman beserta para rasul-Nya. \n\nAyat ini diakhiri dengan penegasan bahwa tugas dan misi rasul adalah menyampaikan kebenaran yang nyata kepada umat manusia. Andaikata mereka itu mau membenarkan atau menolaknya, maka itu tidak membawa akibat apa-apa terhadap diri rasul. Tidak ada wewenang yang diberikan Allah kepada setiap rasul untuk memaksa manusia mempercayai seruan dakwahnya. Apakah mereka mau membenarkannya atau tetap mendustakannya adalah di luar tanggung jawabnya.",
      "text_translation": "Dan jika kamu (orang kafir) mendustakan, maka sungguh, umat sebelum kamu juga telah mendustakan (para rasul). Dan kewajiban rasul itu hanyalah menyampaikan (agama Allah) dengan jelas.”",
      "text": "وَاِنْ تُكَذِّبُوْا فَقَدْ كَذَّبَ اُمَمٌ مِّنْ قَبْلِكُمْ ۗوَمَا عَلَى الرَّسُوْلِ اِلَّا الْبَلٰغُ الْمُبِيْنُ ",
      "text_translation_en": "“And if you give [me] the lie - well, [other] communities have given the lie [to Gods prophets] before your time: but no more is an apostle bound to do than clearly deliver the message [entrusted to him].”",
      "juz_number": 20
    },
    "19": {
      "text_tafsir_en": "Some scholars view this verse as referring to the people of Mecca who do not believe in the Prophet. But many disbelievers argue that this verse is still a series of Abraham's warnings to his people. It is here that Allah emphasizes that when unbelievers do not believe in the One True God as His apostles convey, they are invited to see and reflect on the process of their own creation from beginning to end. God created man from the womb in the womb for six or nine months, or more. After birth, humans are equipped with hearing, vision, and reasoning skills. In order to guarantee his life, God facilitates the provision of resources to support his life. When destiny has come, God will redeem it by the commission of angels. For God to raise people is as easy as creating them. God states in another verse: And it is He who initiates creation, then repeats it, and it is easier for Him. He has the highest nature in heaven and on earth. And He is the Mighty, the Wise. (ar-Romans \/ 30: 127) The emphasis of this verse warns that man should understand how easy it is for God to create man. But why don't they believe in the Resurrection when it is easier for God?",
      "text_tafsir": "Sebagian ulama memandang ayat ini ditujukan kepada penduduk Mekah yang tidak mau beriman kepada Rasulullah. Tetapi jumhur mufasir berpendapat bahwa ayat ini masih merupakan rangkaian dari peringatan Nabi Ibrahim kepada kaumnya. \n\nDi sini Allah menegaskan bilamana orang-orang kafir tetap tidak juga percaya kepada Allah Yang Maha Esa seperti apa yang disampaikan oleh para rasul-Nya, maka mereka diajak untuk melihat dan memikirkan tentang proses kejadian diri mereka sendiri sejak dari permulaan sampai akhir. Allah menciptakan manusia mulai dari proses di rahim ibu selama enam atau sembilan bulan, atau lebih. Setelah lahir, manusia dilengkapi dengan kemampuan pendengaran, penglihatan, dan akal pikiran. Untuk menjamin kehidupannya, Allah memudahkan sumber-sumber rezeki guna menunjang kelestarian hidupnya. Apabila telah datang takdir, Allah mewafatkannya melalui malaikat yang ditugaskan. Bagi Allah membangkitkan manusia adalah mudah seperti mudahnya menciptakan mereka. Allah menegaskan dalam ayat lain:\n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. Dia memiliki sifat yang Mahatinggi di langit dan di bumi. Dan Dialah Yang Mahaperkasa, Mahabijaksana. (ar-Rum\/30: 127) \n\nTegasnya ayat ini memperingatkan bahwa manusia seharusnya dapat memahami betapa mudahnya bagi Allah menciptakan manusia. Akan tetapi, mengapa mereka tidak mempercayai akan adanya hari Kebangkitan padahal itu justru lebih mudah bagi Allah?",
      "text_translation": "Dan apakah mereka tidak memperhatikan bagaimana Allah memulai penciptaan (makhluk), kemudian Dia mengulanginya (kembali). Sungguh, yang demikian itu mudah bagi Allah.",
      "text": "اَوَلَمْ يَرَوْا كَيْفَ يُبْدِئُ اللّٰهُ الْخَلْقَ ثُمَّ يُعِيْدُهٗ ۗاِنَّ ذٰلِكَ عَلَى اللّٰهِ يَسِيْرٌ ",
      "text_translation_en": "Are then they [who deny the truth] not aware of how God creates [life] in the first instance, and then brings it forth anew? This, verily, is easy for God!",
      "juz_number": 20
    },
    "20": {
      "text_tafsir_en": "While people still do not understand the meaning of the verse above Allah, they encourage them to go to other places to observe and reflect on how God created His creatures. Humans are also commanded to observe the order of the heavens and the earth, and millions of glittering stars. Some remain in their position, but rotate along their orbits. So are the mountains and the vast land that God created as a home. A wide variety of plants and fruits, rivers and oceans stretch out. Everything when contemplated will make one realize how great the Almighty God is. Should we not believe that it is a very easy thing for God to revive and kill a weak human being? Similarly, to resurrect in the second life (the Hereafter) is also a difficult matter for God. In another verse Allah explains: We will show them our Signs in every corner and in themselves, so that it is clear to them that the Qur'an is true. Is it not enough (for you) that your Lord is witness of all things? (Fussilat \/ 41: 53) Likewise, we find a verse that reads: Thus is Allah your Lord, the Creator of all things, and there is no god but Him; then how can you be turned away? (al-Mu'min \/ 40: 62)",
      "text_tafsir": "Bilamana manusia masih belum juga memahami apa maksud ayat di atas Allah, menganjurkan supaya mereka berjalan mengunjungi tempat-tempat lain seraya memperhatikan dan memikirkan betapa Allah kuasa menciptakan makhluk-Nya. Manusia juga diperintahkan untuk memperhatikan susunan langit dan bumi, serta jutaan bintang yang gemerlapan. Sebagian ada yang tetap pada posisinya, tetapi berputar pada garis orbitnya. Demikian juga gunung-gunung dan daratan luas yang diciptakan Allah sebagai tempat hidup. Beraneka ragam tumbuh-tumbuhan dan buah-buahan, sungai dan lautan yang terbentang luas. Semuanya bila direnungkan akan menyadarkan seseorang betapa Maha Kuasanya Allah Pencipta semua itu. \n\nMaka patutkah kita tidak percaya bahwa untuk menghidupkan dan mematikan diri manusia yang lemah itu adalah suatu hal yang sangat mudah bagi Allah? Begitu pula untuk membangkitkan kembali dalam menempuh kehidupan kedua (hari akhirat) juga masalah yang tidak sukar bagi Allah. Pada ayat lain Allah menjelaskan lagi:\n\nKami akan memperlihatkan kepada mereka tanda-tanda (kebesaran) Kami di segenap penjuru dan pada diri mereka sendiri, sehingga jelaslah bagi mereka bahwa Al-Qur'an itu adalah benar. Tidak cukupkah (bagi kamu) bahwa Tuhanmu menjadi saksi atas segala sesuatu? (Fussilat\/41: 53) \n\nBegitu juga kita jumpai ayat yang berbunyi:\n\nDemikianlah Allah, Tuhanmu, Pencipta segala sesuatu, tidak ada tuhan selain Dia; maka bagaimanakah kamu dapat dipalingkan? (al-Mu'min\/40: 62)",
      "text_translation": "Katakanlah, “Berjalanlah di bumi, maka perhatikanlah bagaimana (Allah) memulai penciptaan (makhluk), kemudian Allah menjadikan kejadian yang akhir. Sungguh, Allah Mahakuasa atas segala sesuatu.",
      "text": "قُلْ سِيْرُوْا فِى الْاَرْضِ فَانْظُرُوْا كَيْفَ بَدَاَ الْخَلْقَ ثُمَّ اللّٰهُ يُنْشِئُ النَّشْاَةَ الْاٰخِرَةَ ۗاِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ۚ",
      "text_translation_en": "Say: “Go all over the earth and behold how [wondrously] He has created [man] in the first in­stance: and thus, too, will God bring into being your second life for, verily, God has the power to will anything!",
      "juz_number": 20
    },
    "21": {
      "text_tafsir_en": "Hearing the advice given by the man and seeing his honesty and sincerity, Moses immediately set out on alert, for behind him some Pharaoh's soldiers were ready to lay siege to him. How heavy the pressure of Moses must have been. Nevertheless, he kept on trying to save himself and prayed to God, \"O my almighty, merciful, merciful God, deliver me from the clutches of the oppressed Pharaoh. He ordered his army to chase Moses down the small streets and forbade them by the road because he was convinced that Moses would not be able to go that way.",
      "text_tafsir": "Mendengar nasihat yang dikemukakan oleh orang itu dan melihat sikapnya yang menampakkan kejujuran dan keikhlasan, dengan segera Musa berangkat dalam keadaan selalu waspada, karena di belakangnya beberapa orang tentara Fir'aun telah siap-siap untuk mengepung dan menangkapnya. Alangkah beratnya tekanan yang diderita Musa. Walaupun demikian, ia tetap berusaha menyelamatkan dirinya dan berdoa kepada Allah, \"Hai Tuhanku Yang Mahakuasa, Yang Maha Pengasih lagi Maha Penyayang, bebaskanlah aku dari cengkeraman kaum Fir'aun yang aniaya. Allah mengabulkan doanya dan menunjukkannya jalan menuju Madyan.\n\nMenurut riwayat, Fir'aun memerintahkan kepada tentaranya supaya mengejar Musa sampai ke jalan-jalan kecil dan melarang mereka melalui jalan raya karena ia yakin bahwa Musa tidak mungkin akan menempuh jalan itu.",
      "text_translation": "Dia (Allah) mengazab siapa yang Dia kehendaki dan memberi rahmat kepada siapa yang Dia kehendaki, dan hanya kepada-Nya kamu akan dikembalikan.",
      "text": "يُعَذِّبُ مَنْ يَّشَاۤءُ وَيَرْحَمُ مَنْ يَّشَاۤءُ ۚوَاِلَيْهِ تُقْلَبُوْنَ ",
      "text_translation_en": "He causes to suffer whomever He wills, and bestows His mercy on whomever He wills; and unto Him you shall be made to return:",
      "juz_number": 20
    },
    "22": {
      "text_tafsir_en": "Nothing beats and rivals God's power. Allah has power over all His servants. All beings need Him. If someone goes looking for a place to escape to high sky, or hides in the belly of a fish in the sea, he will not be able to escape from the grip of God's power. Therefore, none of human beings can find a helper who will deliver him from the punishment and punishment of God, both in heaven and on earth.",
      "text_tafsir": "Tidak ada yang mengalahkan dan menandingi kekuasaan Allah. Allah berkuasa atas sekalian hamba-Nya. Semua makhluk membutuhkan-Nya. Andaikata seseorang pergi mencari tempat pelarian ke langit yang tinggi, atau bersembunyi dalam perut ikan di laut, ia takkan dapat melepaskan diri dari genggaman kekuasaan Allah. Oleh karena itu, tidak seorang pun di antara manusia yang dapat mencari seorang penolong yang akan melepaskannya dari azab dan siksaan Allah, baik di langit maupun di bumi.",
      "text_translation": "Dan kamu sama sekali tidak dapat melepaskan diri (dari azab Allah) baik di bumi maupun di langit, dan tidak ada pelindung dan penolong bagimu selain Allah.",
      "text": "وَمَآ اَنْتُمْ بِمُعْجِزِيْنَ فِى الْاَرْضِ وَلَا فِى السَّمَاۤءِ ۖوَمَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ وَّلِيٍّ وَّلَا نَصِيْرٍ ࣖ",
      "text_translation_en": "and never - not on earth and not in the skies - can you [hope to] elude Him: and you have none to protect you from God, and none to bring you succour.”",
      "juz_number": 20
    },
    "23": {
      "text_tafsir_en": "After explaining the three fundamental issues of Islam that are part of the pillar of faith, Allah threatens the unbelievers who refuse to justify His above assertions that they will not receive the grace of God, and they give up. For disregarding the wrath of God, denying the apostles sent to them, and not believing in the Day of Resurrection, they did not fear the threat of Allah's punishment and did not expect a good reward from Him. Therefore, it would be appropriate for them to be threatened with a painful doom, both in the world and in the hereafter.",
      "text_tafsir": "Setelah menjelaskan tiga masalah pokok dalam Islam yang merupakan sebagian dari rukun iman, maka Allah mengancam orang kafir yang tidak mau membenarkan keterangan-keterangan-Nya di atas bahwa mereka tidak akan mendapat rahmat Allah, sehingga mereka berputus asa. Karena mengingkari keesaan Allah, mendustakan para rasul yang diutus kepada mereka, serta tidak percaya akan adanya hari Kebangkitan, berarti mereka tidak takut akan ancaman azab Allah dan tidak mengharapkan balasan yang baik dari sisi Nya. Oleh karena itu, wajar jika mereka diancam dengan azab yang pedih, di dunia maupun akhirat.",
      "text_translation": "Dan orang-orang yang mengingkari ayat-ayat Allah dan pertemuan dengan-Nya, mereka berputus asa dari rahmat-Ku, dan mereka itu akan mendapat azab yang pedih.",
      "text": "وَالَّذِيْنَ كَفَرُوْا بِاٰيٰتِ اللّٰهِ وَلِقَاۤىِٕهٖٓ اُولٰۤىِٕكَ يَىِٕسُوْا مِنْ رَّحْمَتِيْ وَاُولٰۤىِٕكَ لَهُمْ عَذَابٌ اَلِيْمٌ ",
      "text_translation_en": "And [thus it is:] they who are bent on denying the truth of God’s messages and of their [ultimate] meeting with Him - it is they who abandon all hope of My grace and mercy: and it is they whom grievous suffering awaits [in the life to come].",
      "juz_number": 20
    },
    "24": {
      "text_tafsir_en": "Moses quickly took water for the two girls to give their goats to drink. Due to exhaustion, he took shelter under a tree while feeling hungry and thirsty because he had not eaten for several days except leaves. Moses prayed to God because he desperately needed His mercy and compassion, to eliminate the suffering he experienced.",
      "text_tafsir": "Dengan cepat Musa mengambil air untuk kedua gadis itu agar memberi minum kambing mereka. Karena kelelahan, ia berlindung di bawah sebatang pohon sambil merasakan lapar dan haus karena sudah beberapa hari tidak makan kecuali daun-daunan. Musa berdoa kepada Allah karena ia sangat membutuhkan rahmat dan kasih sayang-Nya, untuk melenyapkan penderitaan yang dialaminya.",
      "text_translation": "Maka tidak ada jawaban kaumnya (Ibrahim), selain mengatakan, “Bunuhlah atau bakarlah dia,” lalu Allah menyelamatkannya dari api. Sungguh, pada yang demikian itu pasti terdapat tanda-tanda (kebesaran Allah) bagi orang yang beriman.",
      "text": "فَمَا كَانَ جَوَابَ قَوْمِهٖٓ اِلَّآ اَنْ قَالُوا اقْتُلُوْهُ اَوْ حَرِّقُوْهُ فَاَنْجٰىهُ اللّٰهُ مِنَ النَّارِۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يُّؤْمِنُوْنَ ",
      "text_translation_en": "Now [as for Abraham,] his people’s only answer was, “Slay him, or burn him!” – but God saved him from the fire. Behold, in this [story] there are messages indeed for people who will believe!",
      "juz_number": 20
    },
    "25": {
      "text_tafsir_en": "After his deliverance, Abraham came to his people again in an attitude of ridicule and reproach of the gods they worshiped. \"The fact that you worship idols is nothing but to preserve the love of your neighbor. You are friendly and close to your worship. There is not a single reason that can justify such worship,\" Ibrahim told his people. On the contrary, on the Day of Judgment, the relationship of love will be transformed into an atmosphere of accusation and hatred, even cursing, between one's close friends and those who follow (the people) and those who follow (the leader). The only thing they can no longer expect is God's help. This will not happen to those who believe and fear. Allah said: The best friends of the day were at enmity with each other except those who feared. (az-Zukhruf \/ 43: 67)",
      "text_tafsir": "Setelah selamat, Ibrahim mendatangi kaumnya lagi dengan sikap mengecam dan mencela tuhan-tuhan yang mereka sembah. \"Sebenarnya kamu menyembah berhala-berhala itu tidak lain adalah untuk memelihara kasih sayang antara sesamamu. Kamu merasa mesra dan semakin akrab karena menyembah kepadanya. Padahal tidak ada sedikit pun alasan yang dapat membenarkan penyembahan itu,\" kata Ibrahim memberi pengajaran kepada kaumnya. Sebaliknya di hari Kiamat kelak hubungan kasih sayang itu akan berubah menjadi suasana saling tuduh menuduh dan saling membenci, bahkan saling mengutuk, baik antara sesama teman akrab, maupun antara yang mengikuti (rakyat) dengan yang diikuti (pemimpin). Hanya satu yang tidak mungkin lagi mereka harapkan yakni pertolongan dari Allah. Hal tersebut tidak akan terjadi pada orang-orang yang beriman dan bertakwa.\n\nAllah berfirman:\n\nTeman-teman karib pada hari itu saling bermusuhan satu sama lain, kecuali mereka yang bertakwa. (az-Zukhruf\/43: 67)",
      "text_translation": "Dan dia (Ibrahim) berkata, “Sesungguhnya berhala-berhala yang kamu sembah selain Allah, hanya untuk menciptakan perasaan kasih sayang di antara kamu dalam kehidupan di dunia, kemudian pada hari Kiamat sebagian kamu akan saling mengingkari dan saling mengutuk; dan tempat kembalimu ialah neraka, dan sama sekali tidak ada penolong bagimu.”",
      "text": "وَقَالَ اِنَّمَا اتَّخَذْتُمْ مِّنْ دُوْنِ اللّٰهِ اَوْثَانًاۙ مَّوَدَّةَ بَيْنِكُمْ فِى الْحَيٰوةِ الدُّنْيَا ۚ ثُمَّ يَوْمَ الْقِيٰمَةِ يَكْفُرُ بَعْضُكُمْ بِبَعْضٍ وَّيَلْعَنُ بَعْضُكُمْ بَعْضًا ۖوَّمَأْوٰىكُمُ النَّارُ وَمَا لَكُمْ مِّنْ نّٰصِرِيْنَۖ ",
      "text_translation_en": "And [Abraham] said: “You have chosen to worship idols instead of God for no other reason than to have a bond of love in the life of this world, between yourselves [and your forebears]: but then, on Resurrection Day, you shall disown one another and curse one another - for the goal of you all will be the fire, and you will have none to succour you.",
      "juz_number": 20
    },
    "26": {
      "text_tafsir_en": "In this verse is mentioned a servant of God called Lut, that is, Lut bin Haran. He was the nephew of Abraham. After witnessing the power of God's miracle on Abraham (he was not consumed by fire), he immediately declared his faith. Abraham welcomed his first disciple by saying, \"I will make the land of Shamma a homeland where I have migrated.\" According to historians, the village where Ibrahim was the place of emigration was from the Kufah region, which is the Kutsa to Sham. Lut his faith is strengthened by seeking guidance from God, despite living in a hostile society, wasting time, and doing worthless work. If Abraham was silent without carrying out the task of preaching, it would be a sign of disapproval of the evil deeds of his people. Ibrahim said in his heart, if he stayed in his country, he wasted no time. For this reason Abraham migrated to Sham. Imam al-Baihaqi recounts from Anas bin Malik that among the first Muslims (during the time of the Prophet) to emigrate with his family was his companion Uthman bin 'Affan: Anas bin Malik, he said, \"Uthman with his wife Ruqayah the son of Rasulullah emigrated to The Messenger of Allah (may peace be upon him) heard the news of 'Uthman and his daughter to the Prophet, the Messenger of Allah (may peace be upon him) said, to Allah after the Lut. \" (History of ath-thabrani) According to the above hadith, it is clear that Lut was the first to compel migration with Abraham in order to save his religion. Abraham's reason for making the pilgrimage was because Allah alone had the power to help him. It is God who prevents the intention of someone who wants to do harm to him. He is Wise in the management of his creatures, and in everything they do. Another reason is that Abraham's state was no longer conducive to maintaining the faith of his followers.",
      "text_tafsir": "Pada ayat ini disebutkan seorang hamba Allah yang bernama Lut yaitu Lut bin Haran. Beliau anak saudara Nabi Ibrahim. Setelah menyaksikan kehebatan mukjizat Allah atas Nabi Ibrahim (tidak hangus dimakan api), ia segera menyatakan keimanannya. Ibrahim menyambut gembira pengikut pertamanya itu dengan ucapan, \"Aku akan menjadikan negeri Syam sebagai kampung tempat aku berhijrah.\" \n\nMenurut keterangan ahli sejarah, kampung yang dijadikan Ibrahim tempat berhijrah tersebut adalah dalam wilayah Kufah yaitu Kutsa sampai ke negeri Syam. Lut semakin kuat keimanannya dengan memperoleh hidayah dari Allah, meskipun hidup dalam suasana masyarakat yang porak-poranda, membuang waktu, dan melakukan pekerjaan yang tiada bermanfaat. Jika Ibrahim diam tanpa menjalankan tugas dakwah, maka hal itu adalah tanda tidak setuju atas perbuatan mungkar yang dilakukan kaumnya. Ibrahim berkata dalam hatinya, jika ia tinggal tetap di negerinya, berarti ia membuang waktu dengan percuma. Atas pertimbangan inilah Ibrahim hijrah ke negeri Syam. \n\nImam al-Baihaqi meriwayatkan dari Anas bin Malik bahwa di antara kaum Muslimin (pada masa Rasulullah saw) yang pertama hijrah dengan keluarganya adalah sahabat Utsman bin 'Affan: \n\nDiriwayatkan dari Anas bin Malik, ia berkata, \"Utsman bersama istrinya Ruqayah binti Rasulullah berhijrah ke negeri Habsyah. Kemudian Rasulullah tertahan tidak mendapat berita tentang keadaan mereka di Habsyah, padahal beliau mengharapkan berita mereka. Kemudian ada seorang wanita yang menyampaikan kabar tentang 'Utsman dan putri beliau kepada Nabi, Rasulullah kemudian bersabda, 'Utsman adalah orang pertama yang hijrah dengan keluarganya kepada Allah sesudah Nabi Lut.\" (Riwayat ath-thabrani) \n\nBerdasarkan hadis di atas, jelaslah bahwa Lut adalah orang pertama yang terpaksa melakukan hijrah bersama Ibrahim demi menyelamatkan agamanya. Alasan Ibrahim melakukan hijrah itu adalah karena Allah sajalah yang berkuasa untuk memberikan pertolongan kepadanya. Allah yang mencegah niat seseorang yang ingin berbuat jahat kepadanya. Dia Maha Bijaksana dalam mengatur urusan makhluk-Nya, dan segala apa yang mereka usahakan. Sebab lain adalah karena negeri Ibrahim sudah tidak kondusif untuk menjaga iman pengikutnya.",
      "text_translation": "Maka Lut membenarkan (kenabian Ibrahim). Dan dia (Ibrahim) berkata, “Sesungguhnya aku harus berpindah ke (tempat yang diperintahkan) Tuhanku; sungguh, Dialah Yang Mahaperkasa, Mahabijaksana.”",
      "text": "۞ فَاٰمَنَ لَهٗ لُوْطٌۘ وَقَالَ اِنِّيْ مُهَاجِرٌ اِلٰى رَبِّيْ ۗاِنَّهٗ هُوَ الْعَزِيْزُ الْحَكِيْمُ ",
      "text_translation_en": "Thereupon [his brother’s son] Lot came to believe in him and said: “Verily, I [too] shall forsake the domain of evil [and turn] to my Sustainer: for, verily, He alone is almighty, truly wise!”",
      "juz_number": 20
    },
    "27": {
      "text_tafsir_en": "In this verse, God recounts some of the favors that God bestowed on Abraham in the world and in the Hereafter in return for his sincerity in practicing. The gifts of the gift include: a. Abraham was blessed with a son named Isaac. Later Isaac was blessed with a son named Jacob. They were appointed prophets, the word of God: So when he (Abraham) separated from them and from what they worshiped besides Allah, We gave him Isaac and Jacob. And each of us adopted a prophet. (Mary \/ 19: 49) In another verse it is explained: And We bestowed upon him (Abraham) Isaac and Jacob, as a gift. And each of us made a righteous man. (al-Anbiya '\/ 21: 72) The degrees of Abraham, Isaac, and Jacob were once more emphasized by the Messenger of Allah in his message: Verily the man of honor is the son of the noble, the son of the noble, the son of the noble , that is, Joseph the son of Jacob, the son of Isaac, the son of Abraham. (History of al-Bukhari and Muslim from Abu Hurairah) b. From the lineage of Abraham's grandson, were born those who obtained the degree of nubuwwah (prophecy) by receiving revelation. From his son Isaac was born Jacob, Joseph, and Jesus and from Ishmael the Prophet Muhammad was born. c. It was given to Abraham the reward of the world. Interpreters explain the meaning of the \"reward of the world\" here, which is the offspring of many who have transformed their followers' faith from a perverted nation to a people of influence. From his descendants, many have obtained prophetic degrees. Abraham's name was mentioned in his salutations during the salat, and his name was known as \"the father of the prophets\", where he was a lesser known man. This is emphasized by God in the verse that reads: They say, \"Who has done this to our gods? Indeed, he is a wicked man.\" They (the others) said, \"We have heard that there is a young man who reproaches (these idols), his name is Ibrahim.\" (al-Anbiya '\/ 21: 59-60) Abraham was the only prophet to receive the title of \"Khalilullah\" (lover of God). d. On the Day of Resurrection, Abraham was included in the ranks of the righteous. His purpose was to be perfected for him the merits of goodness and piety. It also improves its reward by providing a variety of benefits. Moreover, he gained the victory by reaching several degrees above the God of the universe. In short, God granted Abraham many kinds of happiness in the world and the hereafter.",
      "text_tafsir": "Pada ayat ini, Allah menceritakan beberapa nikmat yang telah dianugerahkan Allah kepada Ibrahim di dunia dan akhirat sebagai imbalan dari keikhlasan beliau dalam beramal. Nikmat karunia tersebut adalah antara lain:\n\na. Ibrahim dikaruniai putra bernama Ishak. Ishak kelak dikaruniai putra yang bernama Yakub. Keduanya diangkat menjadi nabi, firman Allah:\n\nMaka ketika dia (Ibrahim) sudah menjauhkan diri dari mereka dan dari apa yang mereka sembah selain Allah, Kami anugerahkan kepadanya Ishak dan Yakub. Dan masing-masing Kami angkat menjadi nabi. (Maryam\/19: 49) \n\nPada ayat lain diterangkan pula:\n\nDan Kami menganugerahkan kepadanya (Ibrahim) Ishak dan Yakub, sebagai suatu anugerah. Dan masing-masing Kami jadikan orang yang saleh. (al-Anbiya'\/21: 72)\n\nKetinggian derajat Ibrahim, Ishak, dan Yakub pernah pula ditegas-kan oleh Rasulullah dalam sabdanya:\n\nSesungguhnya orang yang dikatakan mulia adalah anak dari orang mulia, anak dari orang yang mulia, anak dari orang yang mulia, yaitu Yusuf bin Yakub bin Ishak bin Ibrahim. (Riwayat al-Bukhari dan Muslim dari Abu Hurairah)\n\nb. Dari garis keturunan anak cucu Ibrahim, lahir orang-orang yang mendapat derajat nubuwwah (kenabian) dengan memperoleh wahyu. Dari anak beliau Ishak lahir Yakub, Yusuf, dan Isa dan dari Ismail lahir Nabi Muhammad.\n\nc. Dianugerahkan kepada Ibrahim pahala di dunia. Para ahli tafsir menerangkan makna \"pahala di dunia\" di sini ialah keturunan yang banyak mengubah keyakinan pengikutnya dari bangsa yang sesat menjadi bangsa yang memperoleh hidayah. Dari kalangan keturunannya, banyak yang memperoleh derajat kenabian. Nama Ibrahim disebut dalam ucapan selamat ketika mengerjakan salat, dan namanya terkenal sebagai \"bapak para nabi\", di mana sebelumnya dia seorang laki-laki yang tidak begitu banyak dikenal. Ini ditegaskan Allah dalam ayat yang berbunyi:\n\nMereka berkata, \"Siapakah yang melakukan (perbuatan) ini terhadap tuhan-tuhan kami? Sungguh, dia termasuk orang yang zalim.\" Mereka (yang lain) berkata, \"Kami mendengar ada seorang pemuda yang mencela (berhala-berhala ini), namanya Ibrahim.\" (al-Anbiya'\/21: 59-60) \n\nNabi Ibrahim adalah satu-satunya nabi yang memperoleh gelar \"Khalilullah\" (kekasih Allah).\n\nd. Pada hari Kiamat, Ibrahim dimasukkan dalam barisan orang-orang saleh. Maksudnya disempurnakan untuknya pahala kebaikan dan ketakwaan. Juga disempurnakan pahalanya dengan memberikan bermacam-macam kelebihan. Lebih dari itu, ia memperoleh kemenangan dengan mencapai beberapa derajat yang tinggi di sisi Tuhan semesta alam.\n\nRingkasnya Allah telah menganugerahkan kepada Ibrahim berbagai macam kebahagiaan dunia dan akhirat.",
      "text_translation": "Dan Kami anugerahkan kepada Ibrahim, Ishak dan Yakub, dan Kami jadikan kenabian dan kitab kepada keturunannya, dan Kami berikan kepadanya balasannya di dunia; dan sesungguhnya dia di akhirat, termasuk orang yang saleh. ",
      "text": "وَوَهَبْنَا لَهٗٓ اِسْحٰقَ وَيَعْقُوْبَ وَجَعَلْنَا فِيْ ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتٰبَ وَاٰتَيْنٰهُ اَجْرَهٗ فِى الدُّنْيَا ۚوَاِنَّهٗ فِى الْاٰخِرَةِ لَمِنَ الصّٰلِحِيْنَ ",
      "text_translation_en": "And [as for Abraham,] We bestowed upon him Isaac and [Isaac’s son] Jacob, and caused pro­phethood and revelation to continue among his offspring. And We vouchsafed him his reward in this world; and, verily, in the life to come [too] he shall find himself among the righteous.",
      "juz_number": 20
    },
    "28": {
      "text_tafsir_en": "Allah told the Prophet Muhammad to tell the story of the Prophet Lut. He was sent to a people who lived in the land of Sodom. Lut himself lived in the land. One of the daughters of the people he married, so Lut had an in-law relationship with them. Lut firmly told his people that what they had been doing had been seen as an act called fahisyah (evil and despicable act). The term sodomy that is popular today comes from the name of the city where the Lut did this despicable act. What they do has never been done by the people before as explained in the next verse about what kind of deeds they do.",
      "text_tafsir": "Allah menyuruh Nabi Muhammad menceritakan kisah Nabi Lut. Beliau diutus ke suatu kaum yang berdiam di negeri Sodom. Lut sendiri berdiam di negeri itu. Salah seorang dari putri kaum itu dikawininya, sehingga Lut punya hubungan besan dengan mereka. Dengan tegas Lut mengatakan kepada kaumnya bahwa apa yang mereka kerjakan selama ini dipandang sebagai perbuatan yang disebut fahisyah (perbuatan jahat dan tercela). Istilah sodomi yang populer saat ini berasal dari nama kota di mana kaum Lut melakukan perbuatan tercela itu. Apa yang mereka kerjakan belum pernah diperbuat oleh umat-umat sebelumnya seperti dijelaskan dalam ayat berikutnya tentang jenis perbuatan apa yang mereka kerjakan itu.",
      "text_translation": "Dan (ingatlah) ketika Lut berkata kepada kaumnya, “Kamu benar-benar melakukan perbuatan yang sangat keji (homoseksual) yang belum pernah dilakukan oleh seorang pun dari umat-umat sebelum kamu. ",
      "text": "وَلُوْطًا اِذْ قَالَ لِقَوْمِهٖٓ اِنَّكُمْ لَتَأْتُوْنَ الْفَاحِشَةَ ۖمَا سَبَقَكُمْ بِهَا مِنْ اَحَدٍ مِّنَ الْعٰلَمِيْنَ ",
      "text_translation_en": "And Lot, [too, was inspired by Us] when he said unto his people: “Verily, you commit abominations such as none in all the world has ever committed before you!",
      "juz_number": 20
    },
    "29": {
      "text_tafsir_en": "The Lutans love to pass on their orgasm to their fellow men. This behavior is clearly contrary to the biological needs of ordinary human beings. Normal sexual appetite instead stimulates men to unleash their lust on women. This act was greatly criticized by Lut and he advised his people to abandon the curse. Residents of the city of Sodom also enjoy robberies and murders on the streets of a caravan carrying merchandise. Their goods were confiscated, and the owner was killed. In addition, their words and actions in the meeting places are very disgusting, damaging the moral and moral joints of the noble and the healthy mind. The Messenger of Allah (may peace be upon him) recounted: 'Umm Hani bint Abu the bible, who asked the Messenger of Allah, \"O Messenger of Allah, what do you think about the meaning of the verse\" You are doing evil in the places of your assembly \"(al-'Ankabut \/ 29:29) do that? \" He explains that they enjoy mocking passersby and insulting him. (History of the judge) Lut does not sit idly by looking at the deficiencies in his community. He strives to prevent it by providing valuable advice and lessons. However, they all look down on them and never bother them. When Luth threatened his people that God would bring down their punishment if they would not change his disgusting behavior, they challenged. If it was true that God would bring His torment, they would challenge Lot to ask God to bring down the promised torment right now. \"We will prove the truth of what you say, Lut,\" they added. Because of deep hatred, they expelled Lut from their country. Because it is of no use to the saints like him to dwell with them. God explains: And the answer of his people is nothing but saying, \"Get them out of this land, they are those who consider themselves holy.\" (al-A'raf \/ 7: 82) The people of Lutha challenged to bring punishment. Prophet Lot finally begged God to help him. The above verse describes how stubborn and stubborn they were, so that they could expel the messenger of God from his own country.",
      "text_tafsir": "Kaum Lut senang melampiaskan syahwatnya kepada sesama pria. Kebiasaan ini jelas bertentangan dengan tujuan kebutuhan biologis manusia biasa. Nafsu seksual yang normal justru merangsang pria untuk melampiaskan nafsu syahwatnya kepada wanita. Perbuatan ini sangat dicela Lut dan ia menasihati kaumnya agar perbuatan terkutuk tersebut ditinggalkan. Penduduk kota Sodom juga senang melakukan perampokan dan pembunuhan di jalan yang dilalui oleh kafilah yang membawa barang dagangan. Barang-barang mereka dirampas, kemudian pemiliknya dibunuh. Di samping itu, perkataan dan perbuatan mereka di tempat-tempat perkumpulan sangat menjijikkan, merusak sendi-sendi akhlak dan moral yang mulia dan pikiran yang sehat. Rasulullah bersabda:\n\nDiriwayatkan dari Ummu Hani binti Abu thalib, yang bertanya kepada Rasulullah, \"Ya Rasulullah, apa pendapatmu tentang arti ayat \"Kamu mengerjakan kemungkaran di tempat-tempat pertemuanmu\" (al-'Ankabut\/29: 29), kemungkaran apa yang mereka lakukan itu?\" Beliau menjelaskan bahwa mereka senang mengejek orang yang lewat di jalan dan menghinanya. (Riwayat al-hakim)\n\nLut tidak tinggal diam melihat kepincangan-kepincangan yang terjadi dalam masyarakat kaumnya. Ia berusaha mencegahnya dengan memberikan nasihat dan pengajaran yang berharga. Akan tetapi, semua itu mereka pandang remeh dan tidak pernah mereka gubris.\n\nKetika Lut mengancam kaumnya bahwa Allah akan menurunkan azab kalau mereka tidak juga mau mengubah kelakuannya yang keji itu, mereka malah menantang. Kalau benar Tuhan itu akan mendatangkan siksaan-Nya, mereka menantang agar Lut mohon kepada Tuhan supaya diturunkan siksaan yang dijanjikan itu sekarang juga. \"Kami akan membuktikan sampai dimana kebenaran ucapanmu, hai Lut,\" tegas mereka pula. Karena kebencian yang mendalam, mereka mengusir Lut dari negeri mereka. Sebab tak ada gunanya orang-orang suci seperti beliau tinggal bersama mereka. Allah menjelaskan:\n\nDan jawaban kaumnya tidak lain hanya berkata, \"Usirlah mereka (Lut dan pengikutnya) dari negerimu ini, mereka adalah orang yang menganggap dirinya suci.\" (al-A'raf\/7: 82) \n\nUmat Lut menantang supaya didatangkan azab. Nabi Lut akhirnya mohon agar Allah menolongnya.\n\nAyat di atas menggambarkan betapa keras sikap kekafiran dan keras kepala mereka, sampai-sampai mereka tega mengusir rasul utusan Tuhan itu dari negerinya sendiri.",
      "text_translation": "Apakah pantas kamu mendatangi laki-laki, menyamun dan mengerjakan kemungkaran di tempat-tempat pertemuanmu?” Maka jawaban kaumnya tidak lain hanya mengatakan, “Datangkanlah kepada kami azab Allah, jika engkau termasuk orang-orang yang benar.” ",
      "text": "اَىِٕنَّكُمْ لَتَأْتُوْنَ الرِّجَالَ وَتَقْطَعُوْنَ السَّبِيْلَ ەۙ وَتَأْتُوْنَ فِيْ نَادِيْكُمُ الْمُنْكَرَ ۗفَمَا كَانَ جَوَابَ قَوْمِهٖٓ اِلَّآ اَنْ قَالُوا ائْتِنَا بِعَذَابِ اللّٰهِ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
      "text_translation_en": "Must you indeed approach men [with lust], and thus cut across the way [of nature]? and must you commit these shameful deeds in your open] assemblies?” But his people’s only answer was, “Bring down upon us God’s chastisement, if thou art a man of truth!”",
      "juz_number": 20
    },
    "30": {
      "text_tafsir_en": "Later he came to the conclusion that his people could no longer accept his cry. He did not expect that his people would receive guidance from God. At that time, Lut prayed to God to help him cope with and eradicate the evil and rotten things that had consumed the flesh in his people's life, as well as a hereditary culture. They regard Lut's threats as mere blasphemy. Therefore, God earnestly answered Lot's prayer. Allah sent them hail from heaven so that they would all perish. This resulted in their infidelity and disbelief.",
      "text_tafsir": "Lut kemudian sampai pada kesimpulan bahwa kaumnya tidak mungkin lagi menerima seruannya. Ia tidak berharap lagi bahwa kaumnya akan mendapatkan petunjuk dari Allah. Di saat itu, Lut berdoa kepada Allah agar membantunya menghadapi dan memberantas perbuatan-perbuatan jahat dan busuk yang sudah mendarah daging dalam kehidupan masyarakatnya, serta menjadi kebudayaan yang turun temurun. Mereka menganggap ancaman-ancaman Lut sebagai gertak sambal belaka. Oleh karena itu, Allah sungguh-sungguh mengabulkan doa Lut. Allah lalu mengirimkan kepada mereka hujan batu dari langit sehingga mereka binasa semua. Ini diakibatkan kefasikan dan kekufuran mereka.",
      "text_translation": "Dia (Lut) berdoa, “Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas golongan yang berbuat kerusakan itu.” ",
      "text": "قَالَ رَبِّ انْصُرْنِيْ عَلَى الْقَوْمِ الْمُفْسِدِيْنَ ࣖ",
      "text_translation_en": "[And] he prayed: “O my Sustainer! Succour Thou me against these people who spread corrup­tion!”",
      "juz_number": 20
    },
    "31": {
      "text_tafsir_en": "In this verse, God describes the coming of the angels who met Abraham. They announced that God would give him a son named Isaac. The son would later be appointed a prophet and the apostle replaced Abraham's office and office. Then he was told that the land of Sodom would be destroyed to punish the people who had rejected Lot and had done wrong.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan tentang kedatangan malaikat yang menemui Nabi Ibrahim. Mereka memberi kabar gembira bahwa Allah akan mengaruniakan kepadanya seorang anak bernama Ishak. Kelak putra itu akan diangkat menjadi nabi dan rasul menggantikan tugas dan jabatan Ibrahim. Kemudian diberitahukan kepadanya bahwa negeri Sodom akan dihancurkan untuk menghukum kaum yang mendustakan Lut dan berbuat zalim.",
      "text_translation": "Dan ketika utusan Kami (para malaikat) datang kepada Ibrahim dengan membawa kabar gembira, mereka mengatakan, “Sungguh, kami akan membinasakan penduduk kota (Sodom) ini karena penduduknya sungguh orang-orang zalim.” ",
      "text": "وَلَمَّا جَاۤءَتْ رُسُلُنَآ اِبْرٰهِيْمَ بِالْبُشْرٰىۙ قَالُوْٓا اِنَّا مُهْلِكُوْٓا اَهْلِ هٰذِهِ الْقَرْيَةِ ۚاِنَّ اَهْلَهَا كَانُوْا ظٰلِمِيْنَ ۚ",
      "text_translation_en": "And so, when Our [heavenly] messengers came to Abraham with the glad tiding [of the birth of Isaac], they [also] said, “Behold, we are about to destroy the people of that land, for its people are truly evildoers!”",
      "juz_number": 20
    },
    "32": {
      "text_tafsir_en": "Abraham was worried and worried about Lut's fate, because Lut might be ruined with them. Therefore, he reminds this to those whom God has assigned. Abraham said, \"O angel, there is a messenger of God called Lut. The angel answered, \"Yes, we have known him, and Lot is not among the wicked. But his wife is among those who will continue to be tormented, for she also tolerates the Luths for their disobedience, their cruelty, and their abominable deeds.",
      "text_tafsir": "Ibrahim merasa khawatir dan cemas akan nasib Lut, karena Lut mungkin akan turut hancur bersama mereka. Oleh karena itu, ia mengingatkan hal ini kepada mereka yang ditugaskan Allah itu. Ibrahim berkata, \"Hai malaikat, di sana ada seorang utusan Allah bernama Lut. Dia bukan termasuk orang yang aniaya kepada dirinya, bahkan ia seorang rasul yang beriman dan taat kepada-Nya.\" Malaikat itu menjawab, \"Ya kami sudah memakluminya, dan Lut bukan termasuk dalam golongan orang yang jahat itu. Akan tetapi, istrinya termasuk orang yang tetap akan disiksa, karena turut membenarkan kaum Lut atas kekafiran, kezaliman, dan perbuatan-perbuatan keji mereka.",
      "text_translation": "Ibrahim berkata, “Sesungguhnya di kota itu ada Lut.” Mereka (para malaikat) berkata, “Kami lebih mengetahui siapa yang ada di kota itu. Kami pasti akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia termasuk orang-orang yang tertinggal (dibinasakan).” ",
      "text": "قَالَ اِنَّ فِيْهَا لُوْطًا ۗقَالُوْا نَحْنُ اَعْلَمُ بِمَنْ فِيْهَا ۖ لَنُنَجِّيَنَّهٗ وَاَهْلَهٗٓ اِلَّا امْرَاَتَهٗ كَانَتْ مِنَ الْغٰبِرِيْنَ ",
      "text_translation_en": "[And when Abraham] exclaimed, “But Lot lives there!” - they answered: We know fully well who is there; most certainly we shall save him and his household - all but his wife: she will indeed be among those that stay behind.”",
      "juz_number": 20
    },
    "33": {
      "text_tafsir_en": "When the angels came to meet Lut and told him of his coming, Lut was in panic and suffocation. For, he feared that the people of Sodom would interrupt him when he found out that such a noble guest was present. Therefore, the coming of the angel was in secret. Lut couldn't resist their arrival. Seeing Lot's fears and anxieties over the coming of the people, the angels calmed him down, saying, \"O Lut, be still, and do not be anxious. the summit and the advice you have given them is enough. \" To ease Lut's feelings, the angel added, \"We will save you from the torment that will befall your people in the near future, as well as your faithful and faithful followers. No doubt, they will suffer severe torture. including those who will be punished. \" Lut's wife found out that a male guest was staying at her house, so she immediately reported the matter to her colleagues. Therefore, the news quickly spread that there was an unknown guest at Lut's house. Immediately a malicious intent arose in their hearts to disturb the guest. They then consulted and came up with a plan to carry out the plan. Thus, it became clear that Lut's wife was among the unions in the rotten plan. The above angelic expressions calmed Lut's feelings of fear. He was reminded again, \"We angels will surely bring suffering to them with our own hands, because of their inherent evils.\" Famous opinion says, at first, there was a great shaking, and the land where the wicked man lived was a turning point. After heavy rains and earthquakes, the country became a ruin and the earth was flat. Finally, the land of Sodom, the former home of the people of the Prophet Lot, became a dead sea (al-Bahrul Mayit).",
      "text_tafsir": "Ketika malaikat datang menemui Lut dan menyampaikan maksud kedatangannya, Lut menjadi panik dan sesak napas. Sebab, ia khawatir orang-orang Sodom itu akan mengganggunya kelak bila mengetahui ada tamu yang mulia itu. Oleh karena itu, kedatangan malaikat itu sengaja dirahasiakannya. Lut tidak sanggup menolak kedatangan mereka. Setelah melihat ketakutan dan kecemasan Lut atas kedatangan kaumnya, para malaikat itu menenteramkannya dengan berkata, \"Hai Lut hendaklah engkau tenang, jangan gusar. Engkau tak usah khawatir akan keselamatan kami dan apa yang dilakukan oleh kaummu terhadap kami. Sebab perbuatan jahat mereka telah sampai ke puncaknya dan nasihat sudah cukup banyak engkau sampaikan kepada mereka.\"\n\nUntuk menenteramkan perasaan Lut, malaikat itu berkata pula, \"Kami akan menyelamatkan engkau dari siksaan yang akan diturunkan kepada kaummu dalam waktu dekat ini, demikian pula para pengikutmu yang beriman dan setia. Tak dapat tidak, pastilah mereka itu akan mengalami siksaan berat. Dan istrimu termasuk golongan orang-orang yang akan dihukum\". \n\nIstri Lut mengetahui ada tamu lelaki menginap di rumahnya, maka dengan serta-merta ia memberitahukan hal itu kepada rekan-rekannya. Oleh karena itu, tersiarlah berita dengan cepat bahwa di rumah Lut ada tamu tak dikenal. Dengan segera timbullah niat jahat dalam hati mereka untuk mengganggu tamu itu. Mereka lalu berunding dan bermufakat untuk membuat suatu rencana supaya bisa melaksanakan niat tersebut. Dengan demikian, menjadi jelas bahwa istri Lut termasuk orang yang berserikat dalam rencana busuk itu. \n\nKeterangan malaikat di atas menenangkan perasaan Lut dari ketakutan. Kepada beliau diingatkan lagi, \"Kami para malaikat pasti akan mendatangkan siksaan kepada mereka dengan tangan kami sendiri, akibat kefasikan yang sudah berurat berakar dalam diri mereka.\"\n\nPendapat yang masyhur menyebutkan, mula-mula terjadi guncangan keras, dan tanah tempat kediaman manusia yang durhaka itu menjadi jungkir balik. Setelah diserang hujan batu dan gempa bumi yang dahsyat, negeri itu menjadi hancur berantakan dan rata dengan bumi. Akhirnya negeri Sodom, bekas kediaman umat Nabi Lut, menjadi lautan mati (al-Bahrul Mayit).",
      "text_translation": "Dan ketika para utusan Kami (para malaikat) datang kepada Lut, dia merasa bersedih hati karena (kedatangan) mereka, dan (merasa) tidak mempunyai kekuatan untuk melindungi mereka, dan mereka (para utusan) berkata, “Janganlah engkau takut dan jangan (pula) bersedih hati. Sesungguhnya Kami akan menyelamatkanmu dan pengikut-pengikutmu, kecuali istrimu, dia termasuk orang-orang yang tinggal (dibinasakan).” ",
      "text": "وَلَمَّآ اَنْ جَاۤءَتْ رُسُلُنَا لُوْطًا سِيْۤءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَّقَالُوْا لَا تَخَفْ وَلَا تَحْزَنْ ۗاِنَّا مُنَجُّوْكَ وَاَهْلَكَ اِلَّا امْرَاَتَكَ كَانَتْ مِنَ الْغٰبِرِيْنَ",
      "text_translation_en": "And when Our messengers came unto Lot, he was sorely grieved on their account, seeing that it was beyond his power to shield them; but they said: “Fear not, and grieve not! Behold, we shall save thee and thy household - all but thy wife: she will indeed be among those that stay behind.",
      "juz_number": 20
    },
    "34": {
      "text_tafsir_en": "When the angels came to meet Lut and told him of his coming, Lut was in panic and suffocation. For, he feared that the people of Sodom would interrupt him when he found out that such a noble guest was present. Therefore, the coming of the angel was in secret. Lut couldn't resist their arrival. Seeing Lot's fears and anxieties over the coming of the people, the angels calmed him down, saying, \"O Lut, be still, and do not be anxious. the summit and the advice you have given them is enough. \" To ease Lut's feelings, the angel added, \"We will save you from the torment that will befall your people in the near future, as well as your faithful and faithful followers. No doubt, they will suffer severe torture. including those who will be punished. \" Lut's wife found out that a male guest was staying at her house, so she immediately reported the matter to her colleagues. Therefore, the news quickly spread that there was an unknown guest at Lut's house. Immediately a malicious intent arose in their hearts to disturb the guest. They then consulted and came up with a plan to carry out the plan. Thus, it became clear that Lut's wife was among the unions in the rotten plan. The above angelic expressions calmed Lut's feelings of fear. He was reminded again, \"We angels will surely bring suffering to them with our own hands, because of their inherent evils.\" Famous opinion says, at first, there was a great shaking, and the land where the wicked man lived was a turning point. After heavy rains and earthquakes, the country became a ruin and the earth was flat. Finally, the land of Sodom, the former home of the people of the Prophet Lot, became a dead sea (al-Bahrul Mayit).",
      "text_tafsir": "Ketika malaikat datang menemui Lut dan menyampaikan maksud kedatangannya, Lut menjadi panik dan sesak napas. Sebab, ia khawatir orang-orang Sodom itu akan mengganggunya kelak bila mengetahui ada tamu yang mulia itu. Oleh karena itu, kedatangan malaikat itu sengaja dirahasiakannya. Lut tidak sanggup menolak kedatangan mereka. Setelah melihat ketakutan dan kecemasan Lut atas kedatangan kaumnya, para malaikat itu menenteramkannya dengan berkata, \"Hai Lut hendaklah engkau tenang, jangan gusar. Engkau tak usah khawatir akan keselamatan kami dan apa yang dilakukan oleh kaummu terhadap kami. Sebab perbuatan jahat mereka telah sampai ke puncaknya dan nasihat sudah cukup banyak engkau sampaikan kepada mereka.\"\n\nUntuk menenteramkan perasaan Lut, malaikat itu berkata pula, \"Kami akan menyelamatkan engkau dari siksaan yang akan diturunkan kepada kaummu dalam waktu dekat ini, demikian pula para pengikutmu yang beriman dan setia. Tak dapat tidak, pastilah mereka itu akan mengalami siksaan berat. Dan istrimu termasuk golongan orang-orang yang akan dihukum\". \n\nIstri Lut mengetahui ada tamu lelaki menginap di rumahnya, maka dengan serta-merta ia memberitahukan hal itu kepada rekan-rekannya. Oleh karena itu, tersiarlah berita dengan cepat bahwa di rumah Lut ada tamu tak dikenal. Dengan segera timbullah niat jahat dalam hati mereka untuk mengganggu tamu itu. Mereka lalu berunding dan bermufakat untuk membuat suatu rencana supaya bisa melaksanakan niat tersebut. Dengan demikian, menjadi jelas bahwa istri Lut termasuk orang yang berserikat dalam rencana busuk itu. \n\nKeterangan malaikat di atas menenangkan perasaan Lut dari ketakutan. Kepada beliau diingatkan lagi, \"Kami para malaikat pasti akan mendatangkan siksaan kepada mereka dengan tangan kami sendiri, akibat kefasikan yang sudah berurat berakar dalam diri mereka.\"\n\nPendapat yang masyhur menyebutkan, mula-mula terjadi guncangan keras, dan tanah tempat kediaman manusia yang durhaka itu menjadi jungkir balik. Setelah diserang hujan batu dan gempa bumi yang dahsyat, negeri itu menjadi hancur berantakan dan rata dengan bumi. Akhirnya negeri Sodom, bekas kediaman umat Nabi Lut, menjadi lautan mati (al-Bahrul Mayit).",
      "text_translation": "Sesungguhnya Kami akan menurunkan azab dari langit kepada penduduk kota ini karena mereka berbuat fasik. ",
      "text": "اِنَّا مُنْزِلُوْنَ عَلٰٓى اَهْلِ هٰذِهِ الْقَرْيَةِ رِجْزًا مِّنَ السَّمَاۤءِ بِمَا كَانُوْا يَفْسُقُوْنَ ",
      "text_translation_en": "Verily, we shall bring down upon the people of this land a horror from heaven in requital of all their iniquitous doings!”",
      "juz_number": 20
    },
    "35": {
      "text_tafsir_en": "Then it was explained that in addition to punishing the mistakes made by the Lut, the doom and disaster were also expected to be a warning to the generation that lived afterwards, namely those who used reason and wanted to learn from what had happened.",
      "text_tafsir": "Kemudian dijelaskan bahwa di samping untuk menghukum kesalahan-kesalahan yang telah diperbuat oleh kaum Lut, azab dan bala itu diturunkan juga diharapkan menjadi peringatan bagi generasi yang hidup sesudahnya, yaitu orang-orang yang menggunakan akal dan ingin mendapatkan pelajaran dari apa yang telah terjadi.",
      "text_translation": "Dan sungguh, tentang itu telah Kami tinggalkan suatu tanda yang nyata bagi orang-orang yang mengerti. ",
      "text": "وَلَقَدْ تَّرَكْنَا مِنْهَآ اٰيَةً ۢ بَيِّنَةً لِّقَوْمٍ يَّعْقِلُوْنَ ",
      "text_translation_en": "And [so it happened; and] thereof, indeed, We have left a clear sign for people who use their reason.",
      "juz_number": 20
    },
    "36": {
      "text_tafsir_en": "Allah sent Prophet Shuaib to the people living in the land of Mahayah, so that they could worship the One True God with all their heart. The worship will be beneficial to the happiness of living in the world and in the hereafter. In this verse it is said to \"hope (the reward) of the last day\", that you should fear the coming of that day and prepare yourself with as much charity as possible. In addition to the call to worship the One True God, and to increase the charity for the supplies in the Hereafter, Shuaib also urges them to abandon any acts that are destructive and destructive. Do not harm one another, such as reducing scales and scales, and robbing a caravan of the past. Then they were also instructed to increase their repentance to God while returning to Him by doing His commandments and abstaining from His prohibition.",
      "text_tafsir": "Allah mengutus Nabi Syuaib kepada kaum yang berdiam di negeri Madyan, supaya mereka beribadah kepada Allah Yang Maha Esa dengan ikhlas. Ibadah tersebut akan bermanfaat untuk kebahagiaan hidup di dunia dan di akhirat kelak. Dalam ayat ini dikatakan \"harapkanlah (pahala) hari akhir\", berarti hendaklah kamu merasa takut dengan kedatangan hari itu dan persiapkanlah dirimu dengan amal saleh sebanyak-banyaknya guna menghadapinya. Di samping seruan untuk menyembah Allah Yang Maha Esa, dan memperbanyak amal untuk perbekalan di kampung akhirat, Syuaib juga menganjurkan supaya meninggalkan segala perbuatan yang bersifat merusak dan membinasakan. Jangan saling merugikan antara sesama manusia, seperti mengurangi takaran dan timbangan, dan merampok kafilah yang sedang lalu. Kemudian mereka juga diperintahkan untuk memperbanyak tobat kepada Tuhan sambil mengembalikan diri kepada-Nya dengan jalan mengerjakan perintah-Nya dan menjauhi larangan-Nya",
      "text_translation": "Dan kepada penduduk Madyan, (Kami telah mengutus) saudara mereka Syuaib, dia berkata, “Wahai kaumku! Sembahlah Allah, harapkanlah (pahala) hari akhir, dan jangan kamu berkeliaran di bumi berbuat kerusakan.” ",
      "text": "وَاِلٰى مَدْيَنَ اَخَاهُمْ شُعَيْبًاۙ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ وَارْجُوا الْيَوْمَ الْاٰخِرَ وَلَا تَعْثَوْا فِى الْاَرْضِ مُفْسِدِيْنَ ۖ",
      "text_translation_en": "AND UNTO [the people of] Madyan [We sent] their brother Shu’ayb who thereupon said: “O my peo­ple! Worship God [alone], and look forward to the Last Day, and do not act wickedly on earth by spreading corruption!”",
      "juz_number": 20
    },
    "37": {
      "text_tafsir_en": "However, just like the people of Lut, the Prophet Shuaib was wicked and refused to accept the Prophet's advice. They even denied it. Therefore, the sunah of Allah is performed. When they openly reject Shuaib after being warned repeatedly, it is time for Allah to punish them. Their home soil was shaken by an earthquake that shook and destroyed their home. They fell backwards and swallowed the earth, without moving. More details about the Prophet Shuaib have been mentioned by God in other verses, namely in Surah Al-A'raf \/ 7: 88-93, Hud \/ 11: 87-94, and asy-Syu'ara '\/ 26: 176-190.",
      "text_tafsir": "Akan tetapi, sebagaimana halnya kaum Nabi Lut, umat Nabi Syuaib pun durhaka dan tidak mau menerima nasihat Nabi Syuaib. Mereka malah mendustakannya. Oleh karena itu, berlakulah sunah Allah. Ketika mereka dengan terang-terangan mengingkari Syuaib setelah diberi peringatan berulang-ulang, maka tibalah waktunya Allah mengazab mereka. Bumi tempat kediaman mereka diguncang oleh gempa yang menggetarkan dan menghancurkan tanah kediaman mereka. Mereka mati jungkir balik dan ditelan bumi, tanpa bergerak lagi. Cerita lebih lengkap tentang Nabi Syuaib telah disebutkan pula oleh Tuhan dalam ayat-ayat lain, yaitu pada Surah Al-A'raf\/7: 88-93, Hud\/11: 87-94, dan asy-Syu'ara'\/26: 176-190.",
      "text_translation": "Mereka mendustakannya (Syuaib), maka mereka ditimpa gempa yang dahsyat, lalu jadilah mereka mayat-mayat yang bergelimpangan di tempat-tempat tinggal mereka.",
      "text": "فَكَذَّبُوْهُ فَاَخَذَتْهُمُ الرَّجْفَةُ فَاَصْبَحُوْا فِيْ دَارِهِمْ جٰثِمِيْنَ ۙ",
      "text_translation_en": "But they gave him the lie. Thereupon an earthquake overtook them: and then they lay lifeless, in their very homes, on the ground.",
      "juz_number": 20
    },
    "38": {
      "text_tafsir_en": "However, just like the people of Lut, the Prophet Shuaib was wicked and refused to accept the Prophet's advice. They even denied it. Therefore, the sunah of Allah is performed. When they openly reject Shuaib after being warned repeatedly, it is time for Allah to punish them. Their home soil was shaken by an earthquake that shook and destroyed their home. They fell backwards and swallowed the earth, without moving. More details about the Prophet Shuaib have been mentioned by God in other verses, namely in Surah Al-A'raf \/ 7: 88-93, Hud \/ 11: 87-94, and asy-Syu'ara '\/ 26: 176-190.",
      "text_tafsir": "Akan tetapi, sebagaimana halnya kaum Nabi Lut, umat Nabi Syuaib pun durhaka dan tidak mau menerima nasihat Nabi Syuaib. Mereka malah mendustakannya. Oleh karena itu, berlakulah sunah Allah. Ketika mereka dengan terang-terangan mengingkari Syuaib setelah diberi peringatan berulang-ulang, maka tibalah waktunya Allah mengazab mereka. Bumi tempat kediaman mereka diguncang oleh gempa yang menggetarkan dan menghancurkan tanah kediaman mereka. Mereka mati jungkir balik dan ditelan bumi, tanpa bergerak lagi. Cerita lebih lengkap tentang Nabi Syuaib telah disebutkan pula oleh Tuhan dalam ayat-ayat lain, yaitu pada Surah Al-A'raf\/7: 88-93, Hud\/11: 87-94, dan asy-Syu'ara'\/26: 176-190.",
      "text_translation": "Juga (ingatlah) kaum ’Ad dan Samud, sungguh telah nyata bagi kamu (kehancuran mereka) dari (puing-puing) tempat tinggal mereka. Setan telah menjadikan terasa indah bagi mereka perbuatan (buruk) mereka, sehingga menghalangi mereka dari jalan (Allah), sedangkan mereka adalah orang-orang yang berpandangan tajam, ",
      "text": "وَعَادًا وَّثَمُوْدَا۟ وَقَدْ تَّبَيَّنَ لَكُمْ مِّنْ مَّسٰكِنِهِمْۗ وَزَيَّنَ لَهُمُ الشَّيْطٰنُ اَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيْلِ وَكَانُوْا مُسْتَبْصِرِيْنَ ۙ",
      "text_translation_en": "AND [the tribes of] Ad and Thamud [too, did We destroy -] as should have become obvious to you from [whatever there remains of] their dwellings. [They perished] because Satan had made their [sinful] doings seem goodly to them, and thus had barred them from the path [of God] despite their having been endowed with the ability to perceive the truth.",
      "juz_number": 20
    },
    "39": {
      "text_tafsir_en": "Moses explained to Karun, Pharaoh, and Haman the signs of the greatness of God's verse as a basis for strengthening the treatise they carried. However, they are arrogant or arrogant and do not believe. Pharaoh's arrogance has really crossed the line. He considered himself a god to be worshiped. Therefore, they were not spared from the torment of Allah in any form of torture.",
      "text_tafsir": "Musa telah menjelaskan kepada Karun, Fir'aun, dan Haman tanda-tanda kebesaran ayat Allah sebagai dasar untuk memperkuat risalah yang dibawanya. Namun demikian, mereka bersikap angkuh atau takabur dan tidak mau beriman. Kecongkakan Fir'aun sungguh telah melampaui batas. Ia menganggap dirinya sebagai tuhan yang harus disembah. Oleh karena itu, mereka semua tidak terlepas dari azab Allah dalam berbagai siksaan.",
      "text_translation": "dan (juga) Karun, Fir‘aun dan Haman. Sungguh, telah datang kepada mereka Musa dengan (membawa) keterangan-keterangan yang nyata. Tetapi mereka berlaku sombong di bumi, dan mereka orang-orang yang tidak luput (dari azab Allah). ",
      "text": "وَقَارُوْنَ وَفِرْعَوْنَ وَهَامٰنَۗ وَلَقَدْ جَاۤءَهُمْ مُّوْسٰى بِالْبَيِّنٰتِ فَاسْتَكْبَرُوْا فِى الْاَرْضِ وَمَا كَانُوْا سَابِقِيْنَ ۚ",
      "text_translation_en": "And [thus, too, did We deal with] Qarun and Pharaoh, and Haman: to them had come Moses with all evidence of the truth, but they behaved arrogantly on earth [and rejected him]; and withal, they could not escape [Us].",
      "juz_number": 20
    },
    "40": {
      "text_tafsir_en": "God destroyed the early Gentiles who had rejected the apostles by decreasing the various punishments, including: a. The wind was very strong and carried rocks, which brought to the Ad people. They challenged the prophet Hud, \"Who is stronger and more powerful than us?\" Their arrogance was answered by the Lord with a wind, and they died in vain. God says in another verse that describes the torment, that is: While the people of Ad, they were destroyed by a very cold wind, God caused them to blow for them seven nights and eight days continually; then you see the people of 'Ad at that time dying around like sticks of empty palm trees. Do you see anyone still left among them? (al-haqqah \/ 69: 6-8) b. A muttering voice breaks the ear. This torture was passed down to the Samuds. They still rebel, do not believe in Saleh. Suddenly they were stunned to death by a shocking sound. God explained again: As for the Samaritans, they were destroyed with a loud voice. (al-haqqah \/ 69: 5) c. Swallowing the earth, this is the story of Karun, a tycoon. At first, he was a believer and obedient to Moses. Then after becoming rich, he became arrogant and wicked. He made a mistake beyond the bounds. Moreover, he does not want to give up charity as an obligation of wealth to the rich. Because of this arrogance, God tormented him. The land around Karun trampled, collapsed, and gradually swallowed Karun's body completely disappearing from the surface of the earth. The Word of God: So We immersed him and his house into the earth. So there is no one who can help him except Allah, and he is not one who can defend himself. (al-Qasas \/ 28: 81) d. Immersed in water. This is the torment for the people of Noah and all his wealth. In addition to the people of Noah, Pharaoh, Haman and his army were also drowned in the Red Sea in response to the arrogance and torture they inflicted on Moses and his followers. God's Word about Noah in Surah al-Anbiya '\/ 21: 76-77: And (remember) Noah, before that, when he prayed. We granted his prayer, and We saved him and his followers from the great disaster. And We saved them from those who rejected Our Signs. Indeed, they are the wicked, so We drowned them all. (al-Anbiya '\/ 21: 76-77) The Word of God in Pharaoh in Surah al-Qasas \/ 28: 39-40: And he (Pharaoh) and his army were arrogant, on earth without a just cause, and they thought that they would not be returned to us. So We tortured him and his army, and threw them into the sea. So watch how the wicked end. All of this is a fair reward for their wrongdoing, not the injustice of God. He will not torture anyone except those who do evil deeds. Punishing someone without a fault is not in accordance with God's law. Those mentioned in the previous verses were tormented by their sins and disbelief in God. In addition, it is also because they worship idols and deny the favor given to them.",
      "text_tafsir": "Allah membinasakan umat-umat terdahulu yang mendustakan para rasul dengan menurunkan bermacam-macam azab, di antaranya:\n\na. Angin yang sangat kencang dan membawa batu, yang didatangkan kepada kaum 'Ad. Mereka menantang Nabi Hud, \"Siapakah gerangan yang lebih kuat dan berkuasa lagi dari kami?\" Kesombongan mereka dibalas Tuhan dengan mendatangkan angin, sehingga mereka mati bergelimpangan. Allah berfirman dalam ayat lain yang menjelaskan tentang siksaan itu, yakni:\n\nSedangkan kaum 'Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin, Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum 'Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk).Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka? (al-haqqah\/69: 6-8) \n\nb. Suara mengguntur yang memecahkan anak telinga. Siksaan ini diturunkan kepada kaum Samud. Mereka masih membangkang, tidak mau beriman kepada Nabi Saleh. Tiba-tiba mereka dipingsankan lalu mati oleh kejutan suara yang mengguntur yang dahsyat sekali. Allah menjelaskan lagi:\n\nMaka adapun kaum Samud, mereka telah dibinasakan dengan suara yang sangat keras. (al-haqqah\/69: 5)\n\nc. Ditelan bumi, inilah kisah buat Karun, seorang hartawan. Pada mulanya, ia adalah seorang yang beriman dan patuh kepada Musa. Kemudian setelah kaya, ia menjadi sombong dan durhaka. Ia berbuat kemungkaran melampaui batas. Lebih dari itu, ia tidak mau menyerahkan zakat sebagai kewajiban harta kekayaan bagi orang kaya. Karena kecongkakan ini, Allah menyiksanya. Tanah sekitar Karun berpijak berguncang, runtuh, dan secara berangsur menelan tubuh Karun sampai lenyap sama sekali dari permukaan bumi.\n\nFirman Allah : \n\nMaka Kami benamkan dia (Karun) bersama rumahnya ke dalam bumi. Maka tidak ada baginya satu golongan pun yang akan menolongnya selain Allah, dan dia tidak termasuk orang-orang yang dapat membela diri. (al-Qasas\/28: 81)\n\nd. Ditenggelamkan ke dalam air. Inilah siksaan buat umat Nabi Nuh bersama seluruh hartanya. Selain umat Nabi Nuh, Fir'aun, Haman beserta bala tentaranya juga tenggelam dalam Laut Merah sebagai balasan atas kesombongan dan siksaan yang mereka lakukan terhadap Musa dan pengikutnya. Firman Allah tentang Nuh dalam Surah al-Anbiya'\/21: 76-77:\n\nDan (ingatlah kisah) Nuh, sebelum itu, ketika dia berdoa. Kami perkenankan (doa)nya, lalu Kami selamatkan dia bersama pengikutnya dari bencana yang besar. Dan Kami menolongnya dari orang-orang yang telah mendustakan ayat-ayat Kami. Sesungguhnya mereka adalah orang-orang yang jahat, maka Kami tenggelamkan mereka semuanya. (al-Anbiya'\/21: 76-77)\n\nFirman Allah tentang Fir'aun dalam Surah al-Qasas\/28: 39-40:\n\nDan dia (Fir'aun) dan bala tentaranya berlaku sombong, di bumi tanpa alasan yang benar, dan mereka mengira bahwa mereka tidak akan dikembalikan kepada Kami. Maka Kami siksa dia (Fir'aun) dan bala tentaranya, lalu Kami lemparkan mereka ke dalam laut. Maka perhatikanlah bagaimana kesudahan orang yang zalim.\n\nSemua itu adalah balasan yang setimpal atas kesalahan yang mereka lakukan, bukan kezaliman dari Allah. Dia tidak akan menyiksa seseorang kecuali yang mengerjakan perbuatan tercela. Mengazab seseorang tanpa ada kesalahan tidak sesuai dengan sunah Allah yang berlaku. Mereka yang tersebut dalam ayat-ayat yang lalu disiksa karena dosa dan kekafiran mereka terhadap Allah. Di samping itu, juga karena mereka menyembah berhala dan mengingkari nikmat yang diberikan kepadanya.",
      "text_translation": "Maka masing-masing (mereka itu) Kami azab karena dosa-dosanya, di antara mereka ada yang Kami timpakan kepadanya hujan batu kerikil, ada yang ditimpa suara keras yang mengguntur, ada yang Kami benamkan ke dalam bumi, dan ada pula yang Kami tenggelamkan. Allah sama sekali tidak hendak menzalimi mereka, akan tetapi merekalah yang menzalimi diri mereka sendiri. ",
      "text": "فَكُلًّا اَخَذْنَا بِذَنْۢبِهٖۙ فَمِنْهُمْ مَّنْ اَرْسَلْنَا عَلَيْهِ حَاصِبًا ۚوَمِنْهُمْ مَّنْ اَخَذَتْهُ الصَّيْحَةُ ۚوَمِنْهُمْ مَّنْ خَسَفْنَا بِهِ الْاَرْضَۚ وَمِنْهُمْ مَّنْ اَغْرَقْنَاۚ وَمَا كَانَ اللّٰهُ لِيَظْلِمَهُمْ وَلٰكِنْ كَانُوْٓا اَنْفُسَهُمْ يَظْلِمُوْنَ",
      "text_translation_en": "For, every one of them, did We take to task for his sin: and so, upon some of them We let loose a deadly storm wind; and some of them were overtaken by a [sudden] blast; and some of them We caused to be swallowed by the earth: and some of them We caused to drown. And it was not God who wronged them, but it was they who had wronged themselves.",
      "juz_number": 20
    },
    "41": {
      "text_tafsir_en": "Idolaters who looked beyond God as their helper and always looked to him for help and rejection of danger, were like a spider that sheltered its nest so weak that it could not withstand the wind, and protected it from the cold and the heat. The nest cannot meet its basic needs when needed. Such is the case of unbelievers. They cannot save themselves when Allah brings His punishment. Their protector (other than Allah) will not be able to provide help. In fact, they themselves cannot prevent them from Allah's punishment. In short, the idolatrous monks were as unstable as the spider's nest, very fragile and weak. The spider's nest is like a very fragile house building. Likewise, a very weak religion is a religion that worships idols",
      "text_tafsir": "Kaum penyembah berhala yang memandang selain Allah sebagai penolong mereka dan selalu mengharapkan darinya pertolongan dan penolak bahaya, adalah bagaikan laba-laba yang berlindung pada sarangnya yang begitu lemah, sehingga tak kuat menahan tiupan angin, dan melindunginya dari dingin dan panas. Sarang tersebut tak dapat memenuhi kebutuhan utamanya apabila sedang diperlukan. Demikianlah halnya orang-orang kafir (musyrik). Mereka tak sanggup menyelamatkan diri bila Allah mendatangkan siksa-Nya. Pelindung mereka (selain dari Allah) tidak akan dapat memberikan pertolongan. Bahkan, diri mereka sendiri tidak dapat mengelakkan mereka dari azab Allah. \n\nRingkasnya, orang musyrik penyembah berhala itu tak ubahnya bagaikan laba-laba yang membuat sarang, sangat rapuh dan lemah. Sarang laba-laba itu adalah ibarat dari suatu bangunan rumah yang sangat rapuh. Demikian pula agama yang sangat lemah adalah agama yang menyembah berhala",
      "text_translation": "Perumpamaan orang-orang yang mengambil pelindung selain Allah adalah seperti laba-laba yang membuat rumah. Dan sesungguhnya rumah yang paling lemah ialah rumah laba-laba, sekiranya mereka mengetahui. ",
      "text": "مَثَلُ الَّذِيْنَ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اَوْلِيَاۤءَ كَمَثَلِ الْعَنْكَبُوْتِۚ اِتَّخَذَتْ بَيْتًاۗ وَاِنَّ اَوْهَنَ الْبُيُوْتِ لَبَيْتُ الْعَنْكَبُوْتِۘ لَوْ كَانُوْا يَعْلَمُوْنَ ",
      "text_translation_en": "The parable of those who take [beings or forces] other than God for their protectors is that of the spider which makes for itself a house: for, behold, the frailest of all houses is the spiders house. Could they but understand this!",
      "juz_number": 20
    },
    "42": {
      "text_tafsir_en": "Allah knows best what they ask of idols, statues, spirits, even humans. It would not be possible for anyone to benefit or bring harm to someone if God does not want it. So weak are their worship that they are just like spiders that can only afford a very fragile house. Allah has the power to punish those who disbelieve. Therefore, the unbelievers should fear God, and immediately believe in Him before His torment, just as He sent it to the ancients. When Allah's torment came, none of their helpers (idols) could save them. God is always powerful in destroying the things that are supposed to be destroyed, and it is Wise to withdraw the torment for those who are expected to change for good and to be steadfast in doing so.",
      "text_tafsir": "Allah Maha Mengetahui tentang apa yang mereka minta kepada berhala, patung, jin, bahkan manusia. Semuanya tak akan mungkin memberikan manfaat atau mendatangkan kecelakaan kepada seseorang bilamana Allah tidak menghendaki. Begitu lemahnya apa yang mereka sembah sehingga sama halnya dengan laba-laba yang hanya sanggup membuat rumah yang sangat rapuh sekali. \n\nAllah berkuasa menurunkan siksa kepada siapa yang kafir. Oleh karena itu, orang-orang musyrik hendaklah merasa takut kepada Allah, dan segera beriman kepada-Nya sebelum datang siksaan-Nya, seperti yang pernah dikirimkan-Nya kepada orang-orang dahulu kala. Bila siksaan Allah datang, tidak seorang pun di antara para penolong mereka itu (berhala-berhala) yang dapat menyelamatkan mereka. Allah selalu perkasa untuk menghancurkan barang siapa yang sepatutnya dibinasakan, dan Maha Bijaksana untuk mengundurkan siksa tersebut bagi orang yang diharapkan ada perubahan ke arah kebaikan dan dengan teguh melaksanakan kebaikan itu.",
      "text_translation": "Sungguh, Allah mengetahui apa saja yang mereka sembah selain Dia. Dan Dia Mahaperkasa, Mahabijaksana. ",
      "text": "اِنَّ اللّٰهَ يَعْلَمُ مَا يَدْعُوْنَ مِنْ دُوْنِهٖ مِنْ شَيْءٍۗ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ ",
      "text_translation_en": "Verily, God knows whatever it is that men invoke instead of Him for He alone is almighty, truly wise.",
      "juz_number": 20
    },
    "43": {
      "text_tafsir_en": "Thus Allah sets forth a parable for man. Only the sensible person can think of the parable. God purposely uses spiders as a metaphor, so it's probably easy for them to understand. In addition, it is also intended to explain all their doubts over the years. People who use their hearts and minds and knowledge experts will surely understand these parables and will be more aware of the secrets of God contained in His verses. It is reported from Jabir that the Messenger of Allah once said: \"He who is knowledgeable is the one who cares for the things of Allah, and practices in his obedience to him and abstains from all his anger.\" (History of al-Haitsami)",
      "text_tafsir": "Demikianlah Allah mengumpamakan sesuatu perumpamaan bagi manusia. Hanya orang berakal yang dapat memikirkan perumpamaan tersebut. Allah sengaja mengambil laba-laba sebagai perumpamaan, karena itu barangkali yang mudah mereka pahami. Selain dari itu, juga dimaksudkan untuk menerangkan segala keraguan mereka selama ini. Orang yang selalu menggunakan hati dan pikirannya dan ahli-ahli ilmu pengetahuan pasti dapat memahami perumpamaan tersebut dan akan semakin banyak mengetahui rahasia-rahasia Allah yang terkandung dalam ayat-ayat-Nya. Diriwayatkan dari Jabir bahwa Rasulullah pernah berkata:\n\n\"Orang yang berilmu itu ialah orang yang menjaga hal-hal yang dari Allah, dan beramal dalam rangka taat kepada-Nya serta menjauhi segala kemarahan-Nya.\" (Riwayat al-Haitsami)",
      "text_translation": "Dan perumpamaan-perumpamaan ini Kami buat untuk manusia; dan tidak ada yang akan memahaminya kecuali mereka yang berilmu. ",
      "text": "وَتِلْكَ الْاَمْثَالُ نَضْرِبُهَا لِلنَّاسِۚ وَمَا يَعْقِلُهَآ اِلَّا الْعَالِمُوْنَ ",
      "text_translation_en": "And so We propound these parables unto man: but none can grasp their innermost meaning save those who [of Us] are aware",
      "juz_number": 20
    },
    "44": {
      "text_tafsir_en": "The proposition about the greatness and majesty of God is seen in the creation of heaven and earth. For those who believe and use their minds, all of God's creations contain wisdom, and it is not useless. Thus the events of heaven and earth, enable humans to add and expand their knowledge horizons. In addition, their introduction will be more intensive to their Creator, namely Allah. According to scientific studies, in creating everything, God never plays around. He does it \"right\", with haq (among others, it can also be seen in Surah Ibrahim \/ 14: 19). The word haq indicates something that is lasting, steady, so that it will not change. It can be seen that the presence of all objects in the universe has a purpose. There is no one thing held by God without a purpose. This planet earth with its sky (atmosphere), has been created by Allah with haq. The word haq means \"correctly, correctly\". How is the truth and accuracy of His creation, can be seen from the following description. Earth's atmosphere is mainly composed of Nitrogen gas (N2 \"by 70%) which is not toxic to humans. This gas is very important in the process of growth of living things, especially plants. While the other 20% is filled with oxygen gas (O2) which provides energy for the metabolic processes of all creatures, through the process of breathing (respiration). The distance between the sun and the earth is about 139 million km. This distance is considered appropriate because at this distance the sun can function to help the ongoing process of life. If the distance changes, whether far or near, then the effects of light falling on earth will be very fatal for living things. Earth's temperature on the equator line is also considered to be very moderate, which is an average between 28-350C. In the description above it has been described that God created the earth not by playing games. Everything is so right for the start of life on this earth. How the comfort of the earth compared to several other planets that exist in the same solar system can be seen in the description below. In comparisons made, especially on the distance between the sun and each planet, it appears that the effect of distance with each planet.",
      "text_tafsir": "Dalil tentang kebesaran dan keagungan Allah itu terlihat pada ciptaan langit dan bumi. Bagi orang yang beriman dan menggunakan akal pikirannya, semua ciptaan Allah itu mengandung hikmah, dan tidak dijadikan percuma begitu saja. Dengan demikian kejadian langit dan bumi, memungkinkan manusia untuk menambah dan memperluas cakrawala pengetahuannya. Di samping itu, pengenalan mereka akan lebih intensif kepada Penciptanya, yakni Allah. \n\nMenurut kajian ilmiah, dalam menciptakan segala sesuatunya, Allah tidak pernah bermain-main. Dia melakukannya dengan \"benar\", dengan haq (antara lain juga dapat dilihat pada Surah Ibrahim\/14: 19). Kata haq mengindikasikan sesuatu yang langgeng, mantap, sehingga tidak akan berubah. Dapat dilihat bahwa kehadiran semua benda yang ada di alam semesta ini mempunyai tujuan. Tidak ada satu benda pun diadakan Tuhan tanpa mempunyai tujuan. \n\nPlanet bumi ini dengan langitnya (atmosfer), telah diciptakan Allah dengan haq. Kata haq ini mengandung arti \"dengan benar, dengan tepat\". Bagaimanakah kebenaran dan ketepatan ciptaan-Nya, dapat dilihat dari uraian berikut.\n\nAtmosfer bumi terutama terdiri atas gas Nitrogen (N2“ sebesar 70%) yang tidak bersifat racun terhadap manusia. Gas ini sangat penting dalam proses pertumbuhan makhluk hidup, terutama tumbuhan. Sedangkan 20% lainnya diisi oleh gas Oksigen (O2) yang memberikan energi untuk proses metabolisme semua makhluk, melalui proses pernafasan (respirasi).\n\nJarak antara matahari dan bumi adalah sekitar 139 juta km. Jarak ini dianggap tepat karena pada jarak ini sinar matahari dapat berfungsi membantu berlangsungnya proses kehidupan. Apabila jaraknya berubah, apakah menjauh atau mendekat, maka efek sinar yang jatuh di bumi akan sangat fatal bagi makhluk hidup. Suhu bumi pada garis equator juga dianggap sangat moderat, yaitu rata-rata antara 28-350C.\n\nDalam uraian di atas telah digambarkan bahwa Allah menciptakan bumi bukan dengan main-main. Semuanya begitu tepat untuk mulainya kehidupan di bumi ini. Bagaimana kenyamanan bumi dibandingkan dengan beberapa planet lain yang ada dalam tata surya yang sama dapat kita lihat pada uraian di bawah ini. Dalam perbandingan yang dilakukan, terutama pada jarak antara matahari dan masing-masing planet, tampak akan efek jarak dengan masing-masing planet.",
      "text_translation": "Allah menciptakan langit dan bumi dengan haq. Sungguh, pada yang demikian itu pasti terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang beriman. ",
      "text": "خَلَقَ اللّٰهُ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّۗ اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لِّلْمُؤْمِنِيْنَ ࣖ   ۔",
      "text_translation_en": "[and hence are certain that] God has created the heavens and the earth in accordance with [an inner] truth: for, behold, in this [very creation] there is a message indeed for all who believe [in Him].",
      "juz_number": 20
    },
    "45": {
      "text_tafsir_en": "This verse commands the Prophet Muhammad to always read and understand the Qur'an that was sent to him to draw closer to God. By understanding the Qur'anic messages, he can improve and build himself according to the demands of Allah. This command also applies to all Muslims. The appreciation of the Divine pen that is constantly read will influence the attitude, behavior, and behavior of those who read it. After ordering them to read, study, and practice the teachings of the Qur'an, Allah commanded the Muslims to perform the obligatory prayer, which is a five-hour prayer. Prayers should be performed in harmony with the terms and conditions, as well as in a rash. It is strongly recommended to perform the prayer in full with the prayers. If done properly, then prayer can prevent and prevent the person doing it from abominable and evil deeds. The practice of prayer is an embodiment of the belief that is embedded in the hearts of those who practice it, and it is evidence that they believe that they are highly dependent on God. Therefore, he tried his best to obey the commands of Allah and abstain from his prohibitions, according to al-Fatihah's letter in the prayer, \"Show us (O Allah) a straight path, the path of those who have You bestow favor on them, not in the way of wrath, nor in the way of those who go astray. \" It was a prayer he always remembered, so that he had no desire to do disgusting and evil deeds. Some scholars have interpreted it as a safeguard against a person who performs a prayer against abusive and malicious conduct. According to them, the prayer kept one as long as the person kept the prayer, as God said: Keep all prayers and prayers. And do it (Salat) for Allah with all devotion. (al-Baqarah \/ 2: 238) The Messenger of Allah (may peace be upon him) described the benefits and benefits of those who performed the prayers and the losses and torments that would befall those who did not do so, as it is said in the hadith: , then he says, \"He who keeps the prayer will receive light, guidance, and salvation on the Day of Judgment, and whoever does not keep it will not receive light, guidance, and salvation. , Pharaoh, Haman, and Ubai ibn Khalaf The time was fixed. Such a person, the Prophet said, was supposed to wash his sins five times a day, so that nothing was left behind. The Messenger of Allah (may peace be upon him) said: After all, suppose there was a river near the door of one of your houses, he bathed in the river five times a day. Is there still a bit of leftover stuff left behind? ”The companions replied,“ There is nothing left of the goods. ”The Messenger said,“ Thus the five-hour prayer, in which prayer God will erase all his mistakes. ”(History) at-Tirmidzi of Abu Hurairah) This is the parable that the Prophet (peace and blessings be upon him) said about the condition of the people who perform the fivefold prayer in earnest just because of Allah. those who practice prayer are: 1) the origin of sincerity; 2) the devotion to God; and 3) the constant remembering of Allah. Salat should be the cause of sincerity for those who do it for the sake of God alone, to purify obedience only to- As the embodiment of this sincerity in one's self is the desire in his heart to work of all that Allah has in mind. Obeying God means that the desire for the one who performs the prayer arises to carry out all that Allah commands and abstain from all that He prohibits. In prayer one will always remember God, because in the recitation of the salat there will be greetings, tahmid, and takbir. He can also feel the greatness and the greatness of God. Allah threatens those who do not perform the Prayer of Hell. God also threatens those who practice prayer because of joy and those who neglect to do it. Allah says: (4) Woe to those who pray, (5) those who neglect their prayers, (6) those who do wrong, (7) and who refuse to give. (al-Ma'un \/ 107: 4-7) According to the above verse, the Messenger of Allah (may peace be upon him) said: Whoever performs a prayer, but his prayer cannot prevent it from doing evil and doing wrong, it will not increase (except to him), unless he is further away from Allah. (History of Ibn Jarir of Isma'il bin Muslim bin al-hasan) Next this verse explains that remembering Allah is greater. The meaning of this statement is that prayer is the most important worship compared to other religions. Therefore, every Muslim should do so diligently. In other words, this sentence reiterates the previous sentence ordering the Muslims to perform the prayer and to explain the wisdom of doing so. Ibn 'Abbas and the Mujahid interpreted the phrase \"wa ladzikrullah akbar\" (remembering that Allah is greater) by explaining the Messenger that Allah remembers his servants more than they remember him by obeying him. The Prophet said: Allah remembers you more than you remember Him. (History of al-Baihaqi) This is in accordance with the hadith qudsi of the Holy Prophet: Whoever remembers me in him, then I will remember in myself, and whoever remembers me in a congregation of course I will remember better group than them. (History of al-Bukhari from Abu Hurairah)",
      "text_tafsir": "Ayat ini memerintahkan Nabi Muhammad agar selalu membaca dan memahami Al-Qur'an yang telah diturunkan kepadanya untuk mendekatkan diri kepada Allah. Dengan memahami pesan-pesan Al-Qur'an, ia dapat memperbaiki dan membina dirinya sesuai dengan tuntutan Allah. Perintah ini juga ditujukan kepada seluruh kaum Muslimin. Penghayatan terhadap kalam Ilahi yang terus dibaca akan mempengaruhi sikap, tingkah laku, dan budi pekerti orang yang membacanya.\n\nSetelah memerintahkan membaca, mempelajari, dan me-laksanakan ajaran-ajaran Al-Qur'an, maka Allah memerintahkan agar kaum Muslimin mengerjakan salat wajib, yaitu salat lima waktu. Salat hendaklah dikerjakan sesuai rukun dan syaratnya, serta penuh kekhusyukan. Sangat dianjurkan mengerjakan salat itu lengkap dengan sunah-sunahnya. Jika dikerjakan dengan sempurna, maka salat dapat mencegah dan menghalangi orang yang mengerjakannya dari perbuatan-perbuatan keji dan mungkar.\n\nMengerjakan salat adalah sebagai perwujudan dari keyakinan yang telah tertanam di dalam hati orang yang mengerjakannya, dan menjadi bukti bahwa ia meyakini bahwa dirinya sangat tergantung kepada Allah. Oleh karena itu, ia berusaha sekuat tenaga untuk melaksanakan perintah-perintah Allah dan menjauhi larangan-larangan-Nya, sesuai bacaan surat al-Fatihah dalam salat, \"Tunjukkanlah kepada kami (wahai Allah) jalan yang lurus, yaitu jalan orang-orang yang telah Engkau anugerahkan nikmat kepada mereka; bukan jalan yang dimurkai dan bukan pula jalan mereka yang sesat.\" Doa itu selalu diingatnya, sehingga ia tidak berkeinginan sedikit pun untuk mengerjakan perbuatan-perbuatan yang keji dan mungkar.\n\nBeberapa ulama tafsir berpendapat bahwa yang memelihara orang yang mengerjakan salat dari perbuatan keji dan mungkar itu ialah salat itu sendiri. Menurut mereka, salat itu memelihara seseorang selama orang itu memelihara salatnya, sebagaimana firman Allah:\n\nPeliharalah semua salat dan salat wustha. Dan laksanakanlah (salat) karena Allah dengan khusyuk. (al-Baqarah\/2: 238)\n\nRasulullah saw menerangkan keutamaan dan manfaat yang diperoleh orang yang mengerjakan salat serta kerugian dan siksaan yang akan menimpa orang yang tidak mengerjakannya, sebagaimana tersebut dalam hadis: \n\nDari Nabi saw, bahwasanya ia pada suatu hari menyebut tentang salat, maka ia berkata, \"Barang siapa yang memelihara salat, ia akan memperoleh cahaya, petunjuk, dan keselamatan pada hari Kiamat, dan barang siapa yang tidak memeliharanya, ia tidak akan memperoleh cahaya, petunjuk, dan keselamatan. Dan ia pada hari Kiamat bersama Karun, Fir'aun, Haman, dan Ubai bin Khalaf. (Riwayat Ahmad dan ath-thabrani dari 'Abdullah bin 'Umar) \n\nNabi saw menerangkan pula keadaan orang yang mengerjakan salat lima waktu dengan sungguh-sungguh, lengkap dengan rukun dan syaratnya, tetap pada waktu-waktu yang telah ditentukan. Orang yang demikian, kata Nabi, seakan-akan dosanya dicuci lima kali sehari, sehingga tidak sedikit pun yang tertinggal. Rasulullah saw bersabda:\n\n\"Bagaimanakah pendapatmu, andaikata ada sebuah sungai dekat pintu rumah salah seorang dari kamu, ia mandi di sungai itu lima kali setiap hari. Adakah masih ada dakinya yang tinggal barang sedikit pun?\" Para sahabat menjawab, \"Tidak ada daki yang tertinggal barang sedikit pun.\" Rasulullah bersabda, \"Maka demikianlah perumpamaan salat yang lima waktu, dengan salat itu Allah akan menghapus semua kesalahannya.\" (Riwayat at-Tirmidzi dari Abu Hurairah) \n\nDemikianlah perumpamaan yang diberikan Rasulullah saw tentang keadaan orang yang mengerjakan salat lima waktu dengan sungguh-sungguh hanya karena Allah.\n\nDari ayat dan hadis Rasulullah yang telah disebutkan di atas dapat diambil kesimpulan bahwa ada tiga sasaran yang hendak dituju oleh orang yang mengerjakan salat, yaitu: 1) timbulnya keikhlasan; 2) timbulnya sifat takwa kepada Allah; dan 3) selalu mengingat Allah.\n\nSalat hendaknya bisa menimbulkan keikhlasan bagi orang yang mengerjakannya karena dikerjakan semata-mata karena Allah, untuk memurnikan ketaatan hanya kepada-Nya. Sebagai perwujudan dari ikhlas ini pada diri seseorang ialah timbulnya keinginan di dalam hatinya untuk mengerjakan segala sesuatu yang diridai Allah. \n\nBertakwa kepada Allah maksudnya ialah timbulnya keinginan bagi orang yang mengerjakan salat itu untuk melaksanakan semua yang diperintahkan Allah dan menjauhi semua yang dilarang-Nya. Dengan salat seseorang juga akan selalu mengingat Allah, karena dalam bacaan salat itu terdapat ucapan-ucapan tasbih, tahmid, dan takbir. Ia juga dapat merasakan keagungan dan kebesaran Allah.\n\nAllah mengancam orang-orang yang tidak mengerjakan salat dengan azab neraka. Allah juga mengancam orang-orang yang mengerjakan salat karena ria dan orang-orang yang lalai dalam mengerjakannya. Allah berfirman:\n\n(4) Maka celakalah orang yang salat, (5) (yaitu) orang-orang yang lalai terhadap salatnya, (6) yang berbuat ria, (7) dan enggan (memberikan) bantuan. (al-Ma'un\/107: 4-7)\n\nSenada dengan ayat di atas, Rasulullah saw bersabda:\n\nBarang siapa yang telah mengerjakan salat, tetapi salatnya tidak dapat mencegahnya dari perbuatan keji dan perbuatan mungkar, maka salatnya itu tidak akan menambah sedikit pun (kepadanya), kecuali ia bertambah jauh dari Allah. (Riwayat Ibnu Jarir dari Isma'il bin Muslim bin al-hasan) \n\nSelanjutnya ayat ini menerangkan bahwa mengingat Allah itu adalah lebih besar. Maksud pernyataan ini ialah salat merupakan ibadah yang paling utama dibanding dengan ibadah-ibadah yang lain. Oleh karena itu, hendaklah setiap kaum Muslimin mengerjakannya dengan sungguh-sungguh. Dengan perkataan lain bahwa kalimat ini menegaskan kembali kalimat sebelumnya yang memerintahkan kaum Muslimin mengerjakan salat dan menerangkan hikmah mengerjakannya.\n\nIbnu 'Abbas dan Mujahid menafsirkan kalimat \"wa ladzikrullah akbar\" (mengingat Allah itu adalah lebih besar) dengan penjelasan Rasulullah bahwa Allah mengingat para hamba-Nya lebih banyak dibandingkan dengan mereka mengingat-Nya dengan cara menaati-Nya. Nabi saw bersabda:\n\nAllah lebih banyak mengingatmu daripada kamu mengingat-Nya. (Riwayat al-Baihaqi) \n\nHal ini sesuai dengan hadis qudsi Nabi saw: \n\nBarang siapa yang mengingat-Ku dalam dirinya, maka Aku akan mengingatnya dalam diri-Ku, dan siapa yang mengingat-Ku bersama-sama dengan suatu jamaah tentu Aku akan mengingatnya dalam kelompok yang lebih bagus daripada mereka. (Riwayat al-Bukhari dari Abu Hurairah)",
      "text_translation": "Bacalah Kitab (Al-Qur'an) yang telah diwahyukan kepadamu (Muhammad) dan laksanakanlah salat. Sesungguhnya salat itu mencegah dari (perbuatan) keji dan mungkar. Dan (ketahuilah) mengingat Allah (salat) itu lebih besar (keutamaannya dari ibadah yang lain). Allah mengetahui apa yang kamu kerjakan. ",
      "text": "اُتْلُ مَآ اُوْحِيَ اِلَيْكَ مِنَ الْكِتٰبِ وَاَقِمِ الصَّلٰوةَۗ اِنَّ الصَّلٰوةَ تَنْهٰى عَنِ الْفَحْشَاۤءِ وَالْمُنْكَرِ ۗوَلَذِكْرُ اللّٰهِ اَكْبَرُ ۗوَاللّٰهُ يَعْلَمُ مَا تَصْنَعُوْنَ",
      "text_translation_en": "CONVEY [unto others] whatever of this divine writ has been revealed unto thee, and be constant in prayer: for, behold, prayer restrains [man] from loathsome deeds and from all that runs counter to reason; and remembrance of God is indeed the greatest [good]. And God knows all that you do.",
      "juz_number": 20
    },
    "46": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad and the Muslims on the material of the Dawah and how to deal with the Book of the Scriptures, since most of them did not respond. When the Prophet conveyed the teachings of Islam, most of them rejected him. Very few of them accept it. But they have come to know Muhammad and his teachings, just as they know and know their own children. Allah says: Those to whom We have given the Scripture know it (Muhammad) as they know their own children. Indeed, some of them must conceal the truth, but they know it (al-Baqarah \/ 2: 146) In another verse, Allah explains and explains the good way of preaching, as He says: Call on the people of your Lord with wisdom. and good teaching, and argue with them in a good way. Indeed, your Lord is the One who knows more and more who are astray from His ways and He who knows the better. (an-Nahl \/ 16: 125) Call upon men in the way of God wisely and wisely, and debate them in a good way to those who do no wrong. As for those who do wrong, those whose hearts are locked up, do not want to receive the truth anymore, and seek to destroy Islam and its people, cannot be dealt with in the above ways. The abusive Scripture scholars are those whose hearts are envious of hatred, hatred, and envy of the Muslims, since the last apostles and prophets have not been taken from them. They fought against the Messenger and the Muslims by secretly and deceptively blaspheming. They always tried to counter the preaching of the Prophet and his companions, such as entering into an alliance with other infidels. There are many examples in history that relate to this. Therefore, they are called the wrongdoers, and they try to harm the Muslims. In the Hereafter, they will be the ones who suffer the loss by receiving a punishment equal to their deeds. Allah then warned that if the Scripture asked the Muslims to talk about their scriptures, and told them what was right and rejected, while they were aware of their situation, then the Muslims should say, \"We believe in the Qur'an revealed to us and also to believe in the Torah and the Gospel that was revealed to you: the God we worship and serve is the same God, the one and only God, so let us be submissive and obedient to Him and carry out all the commandments and stop the prohibitions. -Yes. \" In connection with the meaning of this verse, Abu Hurairah said, \"The scholars read the Torah in Hebrew and interpreted it in Arabic for the Muslims. Then the Prophet (saws) said: Do not condemn the Scripture nor deny them. they said, \"We believe in what was revealed to us and what was revealed to you. Our Lord and your God are one and we surrender to Him alone. (History of al-Bukhari and an-Nasa'i of Abu Hurairah)",
      "text_tafsir": "Dalam ayat ini, Allah memberi petunjuk kepada Nabi Muhammad dan kaum Muslimin tentang materi dakwah dan cara menghadapi Ahli Kitab, karena sebagian besar mereka ini tidak menerima seruannya. Ketika Rasulullah menyampaikan ajaran Islam, kebanyakan dari mereka mendustakannya. Hanya sedikit sekali di antara mereka yang menerimanya. Padahal mereka telah mengetahui Muhammad dan ajaran yang dibawanya, sebagaimana mereka mengetahui dan mengenal anak-anak mereka sendiri.\n\nAllah berfirman:\n\nOrang-orang yang telah Kami beri Kitab (Taurat dan Injil) mengenalnya (Muhammad) seperti mereka mengenal anak-anak mereka sendiri. Sesungguhnya sebagian mereka pasti menyembunyikan kebenaran, padahal mereka mengetahui(nya) (al-Baqarah\/2: 146) \n\nPada ayat yang lain, Allah menerangkan dan menjelaskan cara berdakwah yang baik, sebagaimana firman-Nya:\n\nSerulah (manusia) kepada jalan Tuhanmu dengan hikmah dan pengajaran yang baik, dan berdebatlah dengan mereka dengan cara yang baik. Sesungguhnya Tuhanmu, Dialah yang lebih mengetahui siapa yang sesat dari jalan-Nya dan Dialah yang lebih mengetahui siapa yang mendapat petunjuk. (an-Nahl\/16: 125) \n\nMenyeru manusia ke jalan Tuhan dengan hikmah dan bijaksana serta mendebat mereka dengan cara yang baik dilakukan kepada orang-orang yang tidak melakukan kezaliman. Adapun terhadap orang-orang yang melakukan kezaliman, yaitu orang-orang yang hatinya telah terkunci mati, tidak mau menerima kebenaran lagi, dan berusaha untuk melenyapkan Islam dan umatnya, tidak bisa dihadapi dengan cara-cara di atas.\n\nAhli Kitab yang zalim ialah mereka yang dalam hatinya ada penyakit iri, benci, dan dengki kepada kaum Muslimin, karena rasul dan nabi terakhir tidak diangkat dari kalangan mereka. Mereka memerangi Rasulullah dan kaum Muslimin dengan mengadakan tipu daya dan fitnah secara tersembunyi dan terang-terangan. Mereka selalu berusaha merintangi dakwah yang dilakukan Rasulullah dan para sahabatnya, seperti mengadakan perjanjian persekutuan dengan orang-orang kafir yang lain. Sangat banyak contoh-contoh yang terjadi dalam sejarah yang berhubungan dengan hal ini. Oleh karena itu, mereka dinamai orang-orang yang zalim, dan berusaha merugikan kaum Muslimin. Di akhirat nanti, mereka menjadi orang-orang yang merugi dengan menerima azab yang setimpal dengan perbuatan mereka.\n\nSelanjutnya Allah memperingatkan bahwa jika Ahli Kitab mengajak kaum Muslimin membicarakan kitab suci mereka, dan memberitahukan kepadanya apa yang patut dibenarkan dan ditolak, sedang mereka sendiri mengetahui keadaan mereka itu, maka seharusnya kaum Muslimin berkata, \"Kami percaya kepada Al-Qur'an yang diturunkan kepada kami dan juga percaya kepada Taurat dan Injil yang diturunkan kepadamu. Tuhan yang kami dan kamu sembah sebenarnya sama, yaitu Tuhan Yang Maha Esa. Oleh karena itu, marilah kita bersama-sama tunduk dan patuh kepada-Nya serta melaksanakan segala perintah dan menghentikan larangan-Nya.\"\n\nSehubungan dengan maksud ayat ini, Abu Hurairah berkata, \"Para Ahli Kitab itu membaca Taurat dengan bahasa Ibrani dan menafsirkan dengan bahasa Arab untuk orang-orang Islam. Lalu Nabi saw bersabda:\n\nJanganlah kamu membenarkan Ahli Kitab dan jangan pula kamu mendustakan mereka. Katakanlah kepada mereka, \"Kami beriman dengan apa yang telah diturunkan kepada kami dan yang telah diturunkan kepadamu. Tuhan kami dan Tuhan kamu adalah satu dan kami berserah diri hanya kepada Nya saja. (Riwayat al-Bukhari dan an-Nasa'i dari Abu Hurairah)",
      "text_translation": "Dan janganlah kamu berdebat dengan Ahli Kitab, melainkan dengan cara yang baik, kecuali dengan orang-orang yang zalim di antara mereka, dan katakanlah, ”Kami telah beriman kepada (kitab-kitab) yang diturunkan kepada kami dan yang diturunkan kepadamu; Tuhan kami dan Tuhan kamu satu; dan hanya kepada-Nya kami berserah diri.”",
      "text": "۞ وَلَا تُجَادِلُوْٓا اَهْلَ الْكِتٰبِ اِلَّا بِالَّتِيْ هِيَ اَحْسَنُۖ اِلَّا الَّذِيْنَ ظَلَمُوْا مِنْهُمْ وَقُوْلُوْٓا اٰمَنَّا بِالَّذِيْٓ اُنْزِلَ اِلَيْنَا وَاُنْزِلَ اِلَيْكُمْ وَاِلٰهُنَا وَاِلٰهُكُمْ وَاحِدٌ وَّنَحْنُ لَهٗ مُسْلِمُوْنَ",
      "text_translation_en": "And do not argue with the followers of earlier revelation otherwise than in a most kindly manner - unless it be such of them as are bent on evildoing and say: “We believe in that which has been be­stowed from on high upon us, as well as that which has been bestowed upon you: or our God and your God is one and the same, and it is unto Him that We [all] surrender ourselves.”",
      "juz_number": 21
    },
    "47": {
      "text_tafsir_en": "In this verse, God explains to the Prophet Muhammad that just as He had sent down the book to the apostles who were sent before, so did He send the Qur'an to him. In these books were announced the coming of the Prophet Muhammad. This later came true with the decision of Muhammad as the last prophet and apostle. The apostles of God were warned to convey to their people to believe and to follow the apostles who came later. For, if a man believes in one of the apostles whom God has sent, he is obliged to believe in the other apostles of God, whether first or last. Therefore, some of the Scripture scholars who were in the time of the Prophet Muhammad believed in him and the Qur'an, according to the orders of their prophets. They are more important to the hereafter than to the mortal world, and they are not greedy. Among those who did so were Abdullah bin Salam, Tamim al-Anshari, and others. As for those whose hearts are sick, such as envy because the apostles are waiting for them not from their ranks, or deceived by the pleasures of the world for following their passions, they will reject the Qur'an, especially the verses that proclaim it Muhammad | The people of the Bible should heed the call and guidance of their apostles to worship God, and believe that Muhammad is the last and the last prophet. No prophet or apostle was sent by God afterwards.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan kepada Nabi Muhammad bahwa sebagaimana Ia telah menurunkan kitab kepada para rasul yang diutus sebelumnya, demikian pula Ia menurunkan Al-Qur'an kepadanya. Dalam kitab-kitab itu telah diisyaratkan kedatangan Nabi Muhammad di kemudian hari. Hal ini kemudian benar-benar menjadi kenyataan dengan pengutusan Muhammad saw sebagai nabi dan rasul terakhir. Para rasul Allah diperingatkan agar menyampaikan kepada umatnya untuk beriman dan mengikuti para rasul yang datang kemudian. Sebab, jika seseorang beriman kepada salah seorang dari para rasul yang diutus Allah, maka ia wajib pula beriman kepada para rasul Allah yang lain, baik yang datang lebih dahulu, maupun yang kemudian.\n\nOleh karena itu, sebagian dari Ahli Kitab yang ada pada masa Nabi Muhammad beriman kepadanya dan kepada Al-Qur'an, sesuai dengan perintah para nabi mereka. Mereka itu lebih mementingkan akhirat daripada dunia yang fana ini, dan tidak memperturutkan hawa nafsu. Di antara mereka yang bersikap demikian adalah Abdullah bin Salam, Tamim al-Anshari, dan lain-lain.\n\nAdapun orang-orang yang di hatinya ada penyakit, seperti iri hati karena rasul yang ditunggu kedatangannya itu bukan dari golongan mereka, atau tertipu oleh kesenangan dunia karena memperturutkan hawa nafsu, mereka akan mengingkari Al-Qur'an, terutama ayat-ayat yang menyatakan kerasulan Muhammad. Seharusnya orang-orang Ahli Kitab memperhatikan seruan dan petunjuk para rasul mereka untuk menyembah kepada Allah, dan mempercayai bahwa Muhammad adalah rasul dan nabi terakhir. Tidak ada seorang nabi atau rasul pun yang diutus Allah sesudahnya.",
      "text_translation": "Dan demikianlah Kami turunkan Kitab (Al-Qur'an) kepadamu. Adapun orang-orang yang telah Kami berikan Kitab (Taurat dan Injil) mereka beriman kepadanya (Al-Qur'an), dan di antara mereka (orang-orang kafir Mekah) ada yang beriman kepadanya. Dan hanya orang-orang kafir yang mengingkari ayat-ayat Kami. ",
      "text": "وَكَذٰلِكَ اَنْزَلْنَآ اِلَيْكَ الْكِتٰبَۗ فَالَّذِيْنَ اٰتَيْنٰهُمُ الْكِتٰبَ يُؤْمِنُوْنَ بِهٖۚ وَمِنْ هٰٓؤُلَاۤءِ مَنْ يُّؤْمِنُ بِهٖۗ وَمَا يَجْحَدُ بِاٰيٰتِنَآ اِلَّا الْكٰفِرُوْنَ",
      "text_translation_en": "For it is thus that We have bestowed this divine writ from on high upon thee [O Muhammad]. And they to whom we have vouchsafed this divine writ believe in it just as among those [followers of earlier revelation] there are some who believe in it. And none could knowingly reject Our messages unless it be such as would deny [an obvious] truth:",
      "juz_number": 21
    },
    "48": {
      "text_tafsir_en": "This verse explains that before the Qur'an was revealed, the Prophet Muhammad was well known to the Arabs. He had lived among them long before he was ordained an apostle. All the Arabs at that time recognized that Muhammad was of high moral character, trustworthy, never lying, and respected by his friends. They knew full well that Muhammad was not good at reading and writing, let alone composing story books. In addition to the Arabs, Jews and Christians knew from their books that Muhammad was an illiterate man. Mujahid said, \"The scholars know from their books that the Prophet Muhammad was not good at writing and reading, so this verse came down.\" In another verse, Allah says: (That is) those who follow the Prophet, the prophet (who cannot read) whose (name) they find written in the Torah and the Gospel in them, who told them to do the preventing the evil, and the justifying all that is good for them, and forbidding all that is bad for them, and freeing their burdens and their burdens. (al-A'raf \/ 7: 157) In such a case, Allah sent the Qur'an to Muhammad. It contains a very high quality of faith and is accompanied by convincing evidence. The Qur'an also has a very beautiful style of language, so no one can compare it, although at that time among the Arabs there were many literary poets who were famous because literary art was at its peak. However, very few of them believe. If Muhammad saw he could read and write, he had studied the Bible, or he was not a believer, had no high moral character, nor was he respected, certainly the infidels of Mecca could easily accuse and claim that the Qur'an it's Muhammad's, not Kalamullah's. From this verse it can be understood that the hearts and minds of the infidels of Mecca, based on their knowledge of Muhammad's personality, and the elevated literary value of the Qur'an, have long believed in the Qur'an and the writings of Muhammad. However, because of their heart disease, and fear that their position among their people will fall, they are expressing something contrary to their own heart and mind. The meaning of the people in this verse is that they are not good at writing and reading. This does not mean that Muhammad was uneducated, for Allah had taught him a great deal of knowledge, perhaps even knowledge which he had never taught to ordinary mortals. Thus, he became a pious and wise man. Allah says: And (also) Allah hath sent unto you the Book (the Qur'an) and Wisdom (Sunnah), and taught you what you do not know. The gift of God bestowed upon you is immense. (Nisa '\/ 4: 113)",
      "text_tafsir": "Ayat ini menerangkan bahwa sebelum Al-Qur'an diturunkan, Nabi Muhammad telah dikenal dengan baik oleh orang-orang Arab. Ia telah lama hidup di tengah-tengah mereka sebelum diangkat menjadi rasul. Semua orang Arab waktu itu mengakui bahwa Muhammad mempunyai budi pekerti yang tinggi, dapat dipercaya, tidak pernah berdusta, dan disegani oleh kawan-kawannya. Mereka betul-betul mengetahui bahwa Muhammad tidak pandai membaca dan menulis, apalagi mengarang buku cerita.\n\nDi samping orang-orang Arab, orang-orang Yahudi dan Nasrani pun mengetahui dari kitab-kitab mereka bahwa Muhammad adalah orang yang tidak pandai menulis dan membaca. Mujahid berkata, \"Ahli Kitab mengetahui dari kitab-kitab mereka bahwa Nabi Muhammad tidak pandai menulis dan membaca, karena itu turunlah ayat ini.\" Dalam ayat lain, Allah berfirman:\n\n(Yaitu) orang-orang yang mengikuti Rasul, nabi yang ummi (tidak bisa baca tulis) yang (namanya) mereka dapati tertulis di dalam Taurat dan Injil yang ada pada mereka, yang menyuruh mereka berbuat yang makruf dan mencegah dari yang mungkar, dan yang menghalalkan segala yang baik bagi mereka dan mengharamkan segala yang buruk bagi mereka, dan membebaskan beban-beban dan belenggu-belenggu yang ada pada mereka. (al-A'raf\/7: 157) \n\nDalam keadaan yang demikian, Allah menurunkan Al-Qur'an kepada Muhammad. Di dalamnya termuat akidah yang sangat tinggi nilainya dan dilengkapi dengan bukti-bukti yang meyakinkan. Al-Qur'an juga mempunyai gaya bahasa yang sangat indah, sehingga tidak ada seorang pun yang dapat menandinginya, sekalipun pada waktu itu di kalangan bangsa Arab banyak terdapat pujangga-pujangga sastra yang kenamaan karena seni sastra sedang mencapai puncaknya. Akan tetapi, sedikit sekali dari mereka yang beriman.\n\nSeandainya Muhammad saw dapat membaca dan menulis, pernah belajar kepada Ahli Kitab, atau ia bukan seorang yang dipercaya, tidak memiliki budi pekerti yang luhur, dan tidak pula seorang yang disegani, tentu orang-orang kafir Mekah dengan mudah menuduh dan mengatakan bahwa Al-Qur'an itu adalah buatan Muhammad, bukan Kalamullah.\n\nDari ayat ini dapat dipahami bahwa hati dan pikiran orang-orang kafir Mekah, berdasarkan pengetahuan mereka tentang pribadi Muhammad, dan ketinggian nilai sastra Al-Qur'an, sejak semula telah mempercayai Al-Qur'an dan kerasulan Muhammad. Akan tetapi, karena dalam hati mereka ada penyakit, dan takut kedudukan mereka di antara kaumnya akan jatuh, maka mereka menyatakan sesuatu yang bertentangan dengan hati dan pikiran mereka sendiri.\n\nPengertian ummi dalam ayat ini ialah tidak pandai menulis dan membaca. Hal ini tidak berarti bahwa Muhammad tidak berilmu pengetahuan, karena Allah telah mengajarkan kepadanya ilmu pengetahuan yang tinggi, bahkan mungkin ilmu pengetahuan yang belum pernah diajarkan-Nya kepada manusia biasa. Dengan demikian, beliau menjadi orang yang alim dan bijaksana. Allah berfirman:\n\nDan (juga karena) Allah telah menurunkan Kitab (Al-Qur'an) dan Hikmah (Sunnah) kepadamu, dan telah mengajarkan kepadamu apa yang belum engkau ketahui. Karunia Allah yang dilimpahkan kepadamu itu sangat besar. (an-Nisa'\/4: 113)",
      "text_translation": "Dan engkau (Muhammad) tidak pernah membaca sesuatu kitab sebelum (Al-Qur'an) dan engkau tidak (pernah) menulis suatu kitab dengan tangan kananmu; sekiranya (engkau pernah membaca dan menulis), niscaya ragu orang-orang yang mengingkarinya. ",
      "text": "وَمَا كُنْتَ تَتْلُوْا مِنْ قَبْلِهٖ مِنْ كِتٰبٍ وَّلَا تَخُطُّهٗ بِيَمِيْنِكَ اِذًا لَّارْتَابَ الْمُبْطِلُوْنَ",
      "text_translation_en": "for, [O Muhammad,] thou hast never been able to recite any divine writ ere this one [was revealed], nor didst thou ever transcribe one with your own hand or else, they who try to disprove the truth [of thy revelation] might indeed have had cause to doubt [it].",
      "juz_number": 21
    },
    "49": {
      "text_tafsir_en": "This verse confirms that the verses of the Qur'an are the guidance of Allah, there is no slightest doubt about its meaning. Allah makes it easy for those who want to find the right truth. In another verse, Allah says: And verily, We have made the Qur'an easy for remembrance, so is anyone willing to learn it? (al-Qamar \/ 54: 17) Those who want to find the truth can easily understand the Qur'an. Thus, they would believe in him and believe that Muhammad was indeed an apostle. Allah told the Prophet Muhammad to say to the unbelievers who did not believe in his message: And the unbelievers said, \"You (Muhammad) are not a Messenger.\" Say, \"Enough is Allah and the man who has the knowledge of the Scripture is a witness between me, Aisah and you.\" (Ar-Ra'd \/ 13: 43) read in their books of his coming, so some of those who believe in the Prophet Muhammad, among those mentioned above, Allah reiterated that the Qur'an is preserved in the bosom of Muslims They have memorized it so much that no one can change it. ”This verse further explains that no one can disregard the Signs of God except those who do wrong. This verse is a signal to Scripture that they have learned from their scriptures. about the prophecies of Muhammad and the descent of the Qur'an, but many of them denied the truth after knowing it. no matter what they know, they deny it. So the curse of God is on those who refuse. (al-Baqarah \/ 2: 89) In addition to being a signal to the Book of Scripture, this verse is also an insult to God directed at the Meccans who ignore his verses. They do not believe in the Qur'an and the words of Muhammad saw which have become the truth. They are called by God to be unjust. This kind of cruelty is most appropriate for them because it hides the truth they already know. Allah says: And who is more unjust than he who conceals the testimony of God in him? (al-Baqarah \/ 2: 140)",
      "text_tafsir": "Ayat ini menegaskan bahwa ayat-ayat Al-Qur'an merupakan petunjuk Allah, tidak ada kesamaran sedikit pun tentang pengertiannya. Allah memudahkan penafsirannya bagi orang-orang yang ingin mencari kebenaran yang hakiki. Dalam ayat yang lain, Allah berfirman:\n\nDan sungguh, telah Kami mudahkan Al-Qur'an untuk peringatan, maka adakah orang yang mau mengambil pelajaran? (al-Qamar\/54: 17)\n\nPara Ahli Kitab yang ingin mencari kebenaran, dengan mudah dapat memahami Al-Qur'an. Dengan demikian, mereka mau beriman kepadanya dan meyakini bahwa Muhammad adalah benar-benar seorang rasul. Allah berfirman kepada Nabi Muhammad agar mengatakan kepada orang-orang kafir yang tidak percaya kepada kerasulan beliau:\n\nDan orang-orang kafir berkata, \"Engkau (Muhammad) bukanlah seorang Rasul.\" Katakanlah, \"Cukuplah Allah dan orang yang menguasai ilmu Al-Kitab menjadi saksi antara aku, Aisah dan kamu. (ar-Ra'd\/13: 43) \n\nMaksud ayat di atas adalah ulama-ulama Ahli Kitab menjadi saksi atas kerasulan Muhammad, karena telah membaca dalam kitab-kitab mereka akan kedatangannya. Dengan demikian, ada di antara Ahli Kitab yang beriman kepada Nabi Muhammad, di antaranya orang-orang yang telah disebutkan di atas.\n\nAllah menegaskan lagi bahwa Al-Qur'an itu terpelihara dalam dada kaum Muslimin. Mereka menghafalnya secara turun temurun sehingga tidak seorangpun dapat mengubahnya.\n\nSelanjutnya ayat ini menerangkan bahwa tidak ada seorang pun yang mengingkari ayat-ayat Allah, kecuali orang-orang yang zalim. Ayat ini merupakan isyarat bagi Ahli Kitab bahwa mereka telah mengetahui dari kitab suci mereka tentang kenabian Muhammad dan penurunan Al-Qur'an kepadanya. Namun demikian, banyak di antara mereka yang mengingkari kebenaran itu setelah mengetahuinya. Allah berfirman:\n\nTernyata setelah sampai kepada mereka apa yang telah mereka ketahui itu, mereka mengingkarinya. Maka laknat Allah bagi orang-orang yang ingkar. (al-Baqarah\/2: 89) \n\nSelain bermakna isyarat bagi Ahli Kitab, ayat ini juga merupakan cercaan Allah yang ditujukan kepada orang-orang musyrik Mekah yang mengingkari ayat-ayat-Nya. Mereka tidak percaya kepada Al-Qur'an dan kerasulan Muhammad saw yang sudah menjadi kebenaran yang nyata. Mereka ini disebut oleh Allah sebagai orang yang zalim. Sifat zalim ini adalah sifat yang paling tepat bagi mereka karena menyembunyikan kebenaran yang sebetulnya telah mereka ketahui. Allah berfirman:\n\nDan siapakah yang lebih zalim daripada orang yang menyembunyikan kesaksian dari Allah yang ada padanya? (al-Baqarah\/2: 140)",
      "text_translation": "Sebenarnya, (Al-Qur'an) itu adalah ayat-ayat yang jelas di dalam dada orang-orang yang berilmu. Hanya orang-orang yang zalim yang mengingkari ayat-ayat Kami. ",
      "text": "بَلْ هُوَ اٰيٰتٌۢ بَيِّنٰتٌ فِيْ صُدُوْرِ الَّذِيْنَ اُوْتُوا الْعِلْمَۗ وَمَا يَجْحَدُ بِاٰيٰتِنَآ اِلَّا الظّٰلِمُوْنَ",
      "text_translation_en": "Nay, but this [divine writ] consists of messages clear to the hearts of all who are gifted with [innate] knowledge and none could knowingly reject Our messages unless it be such as would do wrong [to themselves].",
      "juz_number": 21
    },
    "50": {
      "text_tafsir_en": "In this verse, God explains that the Muslims demanded that Muhammad perform such miraculous miracles as had been done to previous prophets, such as the female camel of Saleh, the stick of Moses, and others. Their request was answered by explaining that the question of miracles is God’s provision. They are also explained by their refusal to reject miracles that are higher in value and in their favor. They do not understand that the Qur'an is actually an eternal miracle, unmatched by anyone until the Day of Judgment. This verse implies that the disbelievers of Mecca disputed the Qur'an as a miracle revealed to the Prophet Muhammad. According to them, the Qur'an does not deserve to be miraculous, because miracles are necessarily real, and can be seen and felt as they were revealed to earlier apostles, such as Noah's typhoon, Moses' stick, and so on. They say that real miracles are easy to understand and can inspire confidence in those who see them. Allah ordered Prophet Muhammad to respond to the request of the Meccan monks by saying that the question of miracles was God's dealings. He is the one who determines what miracles will be given to an apostle whom He has sent, because they must be tailored to the level of ability of the people to witness. Regarding the confession of the Quraysh that they could not accept the Qur'an as a miracle, Allah is Knower of their hearts. In fact, their hearts have recognized the miracle of the Qur'an as a miracle, but because of their ignorance and illness, they do not want to say it. If they truly believe in the downfall of miracles according to their demands, surely God will bring them down. There is nothing difficult for God, everything is easy for him. Allah says: And none prevents us from sending signs, but because they have been denied by the former. (al-Isra '\/ 17: 59) After the request of the strange muslims was answered, Allah commanded the Prophet Muhammad to tell them that he was only warning those who did not heed it. His job was simply to deliver the brochure to them. It cannot turn them into believers. Only God can do that. Allah says: Whoever is guided by Allah, then he is the guide; and whom he deceives, you will not find a helper who can guide him. (al-Kahf \/ 18: 17) Other words of Allah: It is not your duty to give them guidance, but it is Allah who guides whom He wills. (al-Baqarah \/ 2: 272)",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa kaum musyrik menuntut agar Muhammad menunjukkan mukjizat yang nyata seperti yang pernah didatangkan kepada nabi-nabi terdahulu, misalnya unta betina Nabi Saleh, tongkat Nabi Musa, dan lain-lain. Permintaan mereka dijawab dengan menjelaskan bahwa persoalan mukjizat adalah ketentuan Allah. Kemudian dijelaskan pula kepicikan mereka karena menolak mukjizat yang lebih tinggi nilainya dan sesuai untuk mereka. Mereka tidak memahami bahwa Al-Qur'an itu sebenarnya adalah mukjizat yang abadi, tidak tertandingi oleh siapa pun sampai hari Kiamat. \n\nAyat ini mengisyaratkan bahwa orang-orang kafir Mekah mengingkari Al-Qur'an sebagai mukjizat yang diturunkan kepada Nabi Muhammad. Menurut mereka, Al-Qur'an tidak pantas dijadikan sebagai mukjizat, karena mukjizat semestinya adalah sesuatu yang nyata, dan langsung dapat dilihat dan dirasakan sebagaimana yang diturunkan kepada para rasul yang terdahulu, seperti topan Nabi Nuh, tongkat Nabi Musa, dan sebagainya. Mereka menyatakan bahwa mukjizat yang nyata itu mudah diterima akal pikiran dan dapat menimbulkan keyakinan bagi orang-orang yang melihatnya.\n\nAllah memerintahkan kepada Nabi Muhammad agar menjawab permintaan orang-orang musyrik Mekah itu dengan mengatakan bahwa persoalan mukjizat adalah urusan Tuhan. Dialah yang menetapkan mukjizat apa yang akan diberikan kepada seorang rasul yang diutus-Nya, karena harus disesuaikan dengan tingkat kemampuan umat yang akan menyaksikan. Mengenai pengakuan orang-orang Quraisy bahwa mereka tidak dapat menerima Al-Qur'an sebagai mukjizat, Allah Maha Mengetahui isi hati mereka. Sebenarnya hati mereka telah mengakui kemukjizatan Al-Qur'an sebagai mukjizat, tetapi karena keingkaran dan penyakit yang ada dalam hati, mereka tidak mau mengatakan yang demikian. Jika mereka benar-benar akan beriman dengan penurunan mukjizat sesuai dengan permintaan mereka, tentu Allah akan menurunkannya. Tidak ada sesuatu pun yang sukar bagi Allah, semua mudah bagi-Nya. Allah berfirman:\n\nDan tidak ada yang menghalangi Kami untuk mengirimkan (kepadamu) tanda-tanda (kekuasaan Kami), melainkan karena (tanda-tanda) itu telah didustakan oleh orang terdahulu. (al-Isra'\/17: 59) \n\nSetelah permintaan orang-orang musyrik yang aneh-aneh itu dijawab, Allah memerintahkan kepada Nabi Muhammad agar menyampaikan kepada mereka bahwa dia hanya sekedar memberi peringatan kepada orang-orang yang tidak mengindahkannya. Tugasnya hanya menyampaikan risalah kepada mereka. Ia tidak dapat mengubah mereka menjadi orang-orang yang beriman. Hanya Allah yang dapat melakukan hal itu. Allah berfirman:\n\nBarang siapa diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk; dan barang siapa disesatkan-Nya, maka engkau tidak akan mendapatkan seorang penolong yang dapat memberi petunjuk kepadanya. (al-Kahf\/18: 17) \n\nFirman Allah yang lain:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al- Baqarah\/2: 272)",
      "text_translation": "Dan mereka (orang-orang kafir Mekah) berkata, ”Mengapa tidak diturunkan mukjizat-mukjizat dari Tuhannya?” Katakanlah (Muhammad), ”Mukjizat-mukjizat itu terserah kepada Allah. Aku hanya seorang pemberi peringatan yang jelas.” ",
      "text": "وَقَالُوْا لَوْلَآ اُنْزِلَ عَلَيْهِ اٰيٰتٌ مِّنْ رَّبِّهٖ ۗ قُلْ اِنَّمَا الْاٰيٰتُ عِنْدَ اللّٰهِ ۗوَاِنَّمَآ اَنَا۠ نَذِيْرٌ مُّبِيْنٌ",
      "text_translation_en": "And yet they say, “Why have no miraculous signs ever been bestowed upon him from on high by his Sustainer?” Say: “Miracles are in the power of God alone; and as for me - I am but a plain warner.”",
      "juz_number": 21
    },
    "51": {
      "text_tafsir_en": "Ad-Darimi and Abu Dawud narrated that a group of Muslims had come to Prophet Muhammad with their own written stories, some of which were of Jewish origin. The Prophet (saws) said, \"Enough of the ignorance and error of a people who reject what their prophets bring, and want something brought by a prophet who is not their prophet for others. Then this verse is revealed by Allah. the Meccans of the Meccans demanded a real miracle, but the Qur'an was read to them, was it not sufficient for them to explain the facts of Muhammad's prophecy, contained in the ancient scriptures , and they themselves do not know it well. Do they not think that a person who is illiterate, and has never interacted with but learned from the Bible is able to present the Qur'an to them with true, great and noble content and with If they were to think and desire the truth, the Qur'an itself would have been sufficient proof for them to justify Muhammad's behavior. Then Allah explained the importance and advantages of the Qur'an by saying that his verses were a blessing to them, because in them there were no threats, as they had been given to the ancients. Because they are also disobedient, they should experience what the ancient people who had betrayed His apostles, such as the 'Ad, Samud, Pharaoh, and others, experienced. The absence of the threat of destruction for the Muslims in the Qur'an is a great mercy of the Muhammadans to come later. It is also explained that the Qur'anic verses are a lesson for believers. The point is that the verses of the Qur'an describe the events of the past, and how they react to the apostles sent to explain the powerful and complete proof of God's oneness. The Qur'an also describes the virtues that a good human being should have, explaining the laws and guidelines for achieving happiness, containing the knowledge that is most useful to mankind, and so on. If the people of the world and the rest of the world wanted to make these verses a lesson, think about them and practice them, they would find the right way, and be happy in this world and in the hereafter. However, if they are not willing and do not intend to get rid of the diseases of the heart, they will surely be the ones who will lose their lives in this world and the hereafter.",
      "text_tafsir": "Ad-Darimi dan Abu Dawud meriwayatkan bahwa telah datang serombongan kaum Muslimin kepada Nabi Muhammad dengan membawa kisah-kisah yang mereka tulis sendiri, yang sebagian isinya bersumber dari orang-orang Yahudi. Nabi saw berkata, \"Cukuplah kebodohan dan kesesatan suatu kaum yang menolak apa yang dibawa nabi mereka, dan menginginkan sesuatu yang dibawa oleh seorang nabi yang bukan nabi mereka untuk orang lain. Lalu ayat ini diturunkan oleh Allah. \n\nAyat ini juga merupakan jawaban yang menolak tuntutan orang-orang musyrik Mekah yang meminta mukjizat yang nyata. Padahal Al-Qur'an telah dibacakan kepada mereka. Apakah tidak cukup bagi mereka dalil-dalil yang menerangkan bukti-bukti ke-rasulan Muhammad saw, yang termuat dalam kitab-kitab suci yang terdahulu, sedang mereka sendiri tidak mengetahuinya dengan pasti. Apakah tidak terpikir oleh mereka bahwa seorang yang tidak pandai tulis baca, dan tidak pernah bergaul apalagi belajar kepada Ahli Kitab sanggup menyampaikan Al-Qur'an kepada mereka dengan isi yang benar, agung dan mulia serta dengan nilai sastra yang demikian tinggi. Seandainya mereka mau berpikir dan menginginkan kebenaran, Al-Qur'an saja sebenarnya telah cukup menjadi bukti bagi mereka untuk membenarkan ke-rasulan Muhammad.\n\nKemudian Allah menerangkan keutamaan dan kelebihan Al-Qur'an dengan mengatakan bahwa ayat-ayatnya merupakan rahmat bagi mereka, karena di dalamnya tidak terdapat ancaman-ancaman, seperti yang pernah diberikan kepada orang-orang terdahulu. Karena mereka juga mengingkari, seharusnya mereka mengalami apa yang pernah dialami oleh orang-orang dahulu yang pernah mengingkari rasul-Nya, seperti kaum 'Ad, Samud, Fir'aun, dan yang lain-lain. Tidak adanya ancaman kemusnahan bagi kaum musyrik di dalam Al-Qur'an merupakan suatu rahmat Allah yang besar bagi umat Muhammad yang datang kemudian.\n\nDiterangkan pula bahwa ayat-ayat Al-Qur'an adalah pelajaran bagi orang-orang yang beriman. Maksudnya ialah ayat-ayat Al-Qur'an itu menerangkan peristiwa yang dialami umat-umat dahulu, dan bagaimana sikap mereka terhadap para rasul yang diutus untuk menerangkan bukti-bukti keesaan Allah yang kuat dan lengkap. Al-Qur'an juga menerangkan akhlak mulia yang harus dipunyai oleh seorang manusia yang baik, menerangkan hukum-hukum dan petunjuk mencapai kebahagiaan hidup, memuat pengetahuan yang sangat berguna bagi manusia, dan sebagainya. Seandainya orang-orang musyrik dan manusia-manusia yang lain mau menjadikan ayat-ayat tersebut sebagai pelajaran, memikirkan serta mengamalkannya, tentulah mereka akan memperoleh jalan yang benar, dan berbahagia di dunia dan di akhirat. Akan tetapi, jika mereka tidak mau dan tidak berniat untuk menghilangkan penyakit yang ada dalam hati, mereka tentu akan menjadi orang yang merugi di dunia dan akhirat.",
      "text_translation": "Apakah tidak cukup bagi mereka bahwa Kami telah menurunkan kepadamu Kitab (Al-Qur'an) yang dibacakan kepada mereka? Sungguh, dalam (Al-Qur'an) itu terdapat rahmat yang besar dan pelajaran bagi orang-orang yang beriman. ",
      "text": "اَوَلَمْ يَكْفِهِمْ اَنَّآ اَنْزَلْنَا عَلَيْكَ الْكِتٰبَ يُتْلٰى عَلَيْهِمْ ۗاِنَّ فِيْ ذٰلِكَ لَرَحْمَةً وَّذِكْرٰى لِقَوْمٍ يُّؤْمِنُوْنَ ࣖ ",
      "text_translation_en": "Why - is it not enough for them that We have bestowed this divine writ on thee from on high, to be conveyed [by thee] to them? For, verily, in it is [manifested Our] grace, and a reminder to people who will believe.",
      "juz_number": 21
    },
    "52": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad to convey to the unbelievers of his faith that Allah knows and sees how he has done their duty. He sent forth threats and glad tidings to them, but they did not accept them. Allah knows their attitude towards the Prophet's call, even knowing their heart. He will reward every thing that His creatures do. If Muhammad had lied and had lied to Allah, he would have suffered a punishment. Allah said: And if he (Muhammad) had invented some of our words in our name, surely we would have held him in his right hand. Then we cut off the heart vessels. So none of you can hinder it. (al-haqqah \/ 69: 44-47) Allah explains that He knows everything in heaven and on earth. He knows the state of His creatures from the delicate and invisible to the great. He also knows the condition of the unbelievers and the believers. He also knew the accusations of the Muslims that the Qur'an was made by Muhammad, though none of them could match it. Those who believe in falsehood and reject Allah are the ones who lose their lives in this world and the hereafter.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad agar menyampaikan kepada orang-orang musyrik yang tetap tidak percaya kepada kerasulannya bahwa Allah mengetahui dan menyaksikan bagaimana ia telah melaksanakan tugas kepada mereka. Ia telah menyampaikan ancaman-ancaman dan kabar gembira kepada mereka, tetapi semua itu mereka ingkari. Allah mengetahui sikap mereka terhadap seruan Nabi saw, bahkan mengetahui isi hati mereka. Dia akan memberi ganjaran setiap sesuatu yang dikerjakan oleh makhluk-Nya. Seandainya Nabi Muhammad berdusta dan mengada-adakan kebohongan terhadap Allah, ia pasti akan ditimpa azab. Allah berfirman:\n\nDan sekiranya dia (Muhammad) mengada-adakan sebagian perkataan atas (nama) Kami, pasti Kami pegang dia pada tangan kanannya. Kemudian Kami potong pembuluh jantungnya. Maka tidak seorang pun dari kamu yang dapat menghalangi (Kami untuk menghukumnya). (al-haqqah\/69: 44-47)\n\nAllah menerangkan bahwa Dia mengetahui segala yang ada di langit dan di bumi. Dia mengetahui keadaan makhluk-Nya dari yang halus dan tidak kelihatan oleh mata sampai kepada yang besar. Dia juga mengetahui keadaan orang-orang musyrik dan orang-orang beriman. Dia mengetahui pula tuduhan-tuduhan orang-orang musyrik bahwa Al-Qur'an adalah buatan Muhammad, sekalipun tidak seorang pun dari mereka yang sanggup menandinginya. Orang-orang yang percaya kepada kebatilan dan mengingkari Allah itu adalah orang-orang yang merugi hidupnya di dunia dan akhirat.",
      "text_translation": "Katakanlah (Muhammad), ”Cukuplah Allah menjadi saksi antara aku dan kamu. Dia mengetahui apa yang di langit dan di bumi. Dan orang yang percaya kepada yang batil dan ingkar kepada Allah, mereka itulah orang-orang yang rugi.” ",
      "text": "قُلْ كَفٰى بِاللّٰهِ بَيْنِيْ وَبَيْنَكُمْ شَهِيْدًاۚ يَعْلَمُ مَا فِى السَّمٰوٰتِ وَالْاَرْضِۗ وَالَّذِيْنَ اٰمَنُوْا بِالْبَاطِلِ وَكَفَرُوْا بِاللّٰهِ اُولٰۤىِٕكَ هُمُ الْخٰسِرُوْنَ",
      "text_translation_en": "Say [unto those who will not believe]: “God is witness enough between me and you! He knows all that is in the heavens and on earth; and they who are bent on believing in what is false and vain, and thus on denying God - it is they, they who shall be the losers!”",
      "juz_number": 21
    },
    "53": {
      "text_tafsir_en": "This verse explains that the Gentiles had known the threat of God in the form of a punishment that would befall them. However, they do not believe in the coming of the torment until they challenge that it is true, and it must be borne to them immediately, as they say in the word of God: Then rain upon us a stone from heaven, or bring us a grievous torment. (al-Anfal \/ 8:32) The Word of God: And they say, \"When will the threat come if you are true men?\" (Jonah \/ 10:48) Allah makes clear that the condition of the coming torment is in His hands, and no one can know it. Allah has decreed that the punishment should be delayed until the appointed time. If God had appointed his time to bring about the torment, he would have suddenly come to the unbelievers, when they were on guard and did not realize it. The retreat of the torment to those who disbelieve is of course wise and purposeful. Among these is a test for humans, who among them is patient and who is not. For the patient, the test will strengthen their faith. As for those who are impatient, with that test they will return to their infidelity or their infidelity. The Word of God: And verily, We will surely test you until we find those who are truly fighting and patient among you; and we will test you. (Muhammad \/ 47: 31) Sometimes the postponement of the punishment is intended for the disobedient to increase. Thus, they will be punished with double punishment. Allah says: Those who disbelieve and hinder (men) from the way of Allah, We add to them torment for torture because they do harm. (an-Nahl \/ 16: 88) There is indeed a torment that has afflicted the pagans of Mecca, but they do not perceive it as the torment of God, their defeat in the battle of Badr. At that moment, they saw and felt how Allah had bestowed upon them. However, God did not destroy all the unbelievers in the war, as it did in the past. There are some who believe that Allah did not intentionally destroy all those disbelievers because some of them still had their faith after the war. They were expected to be experienced Muslim soldiers to carry the Islamic flags, and then carry on their descendants from generation to generation until the time appointed by God. All of this happened according to the plan and wisdom of God known to no one but Himself.",
      "text_tafsir": "Ayat ini menerangkan bahwa kaum musyrik telah mengetahui ancaman Tuhan berupa azab yang akan ditimpakan kepada mereka. Akan tetapi, mereka tidak percaya akan kedatangan azab itu sehingga mereka menantang kalau benar azab itu ada, maka hendaklah segera ditimpakan kepada mereka, seperti yang mereka katakan dalam firman Allah:\n\nMaka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih. (al-Anfal\/8: 32) \n\nFirman Allah:\n\nDan mereka mengatakan, \"Bilakah (datangnya) ancaman itu, jika kamu orang-orang yang benar?\" (Yunus\/10: 48) \n\nAllah menerangkan bahwa ketentuan datangnya azab itu seluruhnya berada di tangan-Nya, tidak seorangpun yang dapat mengetahuinya. Allah telah menetapkan untuk menangguhkan azab itu sampai waktu yang telah ditentukan-Nya. Seandainya Allah telah menetapkan waktunya untuk mendatangkan azab, tentu ia akan datang kepada orang-orang musyrik secara tiba-tiba, pada saat mereka lengah dan tidak menyadarinya.\n\nPengunduran azab kepada orang-orang kafir itu tentu ada hikmah dan tujuannya. Di antaranya ialah sebagai ujian bagi manusia, siapa di antara mereka yang sabar dan siapa yang tidak. Bagi orang yang sabar, ujian itu akan menambah kuat keimanannya. Sedangkan orang yang tidak sabar, maka dengan ujian itu ia akan kembali kafir atau bertambah kekafirannya. Firman Allah:\n\nDan sungguh, Kami benar-benar akan menguji kamu sehingga Kami mengetahui orang-orang yang benar-benar berjihad dan bersabar di antara kamu; dan akan Kami uji perihal kamu. (Muhammad\/47: 31) \n\nAdakalanya penangguhan azab itu bertujuan agar orang yang ingkar itu semakin bertambah keingkarannya. Dengan demikian, mereka akan ditimpa azab yang berlipat ganda.\n\nAllah berfirman:\n\nOrang yang kafir dan menghalangi (manusia) dari jalan Allah, Kami tambahkan kepada mereka siksaan demi siksaan disebabkan mereka selalu berbuat kerusakan. (an-Nahl\/16 : 88) \n\nSebenarnya ada azab yang telah menimpa orang-orang musyrik Mekah, tetapi mereka tidak menyadarinya sebagai azab Tuhan, yakni kekalahan mereka pada perang Badar. Ketika itu, mereka melihat dan merasakan bagaimana Allah telah menimpakan azab kepada mereka. Namun demikian, Allah tidak menghancurkan semua orang-orang kafir dalam peperangan itu, sebagaimana terjadi pada umat-umat yang dahulu. \n\nDi antara mufasir ada yang berpendapat bahwa Allah sengaja tidak menghancurkan orang-orang kafir itu semuanya karena di antara mereka masih ada yang diharapkan keimanannya sesudah peperangan itu. Mereka ini diharapkan akan menjadi tentara Islam yang berpengalaman untuk membawa panji-panji Islam, kemudian dilanjutkan keturunan-keturunan mereka dari suatu generasi ke generasi yang akan datang kemudian, sampai kepada waktu yang ditentukan Allah. Semuanya itu terjadi sesuai dengan rencana dan kebijaksanaan Allah yang tidak diketahui oleh seorang pun, selain Dia sendiri.",
      "text_translation": "Dan mereka meminta kepadamu agar segera diturunkan azab. Kalau bukan karena waktunya yang telah ditetapkan, niscaya datang azab kepada mereka, dan (azab itu) pasti akan datang kepada mereka dengan tiba-tiba, sedang mereka tidak menyadarinya. ",
      "text": "وَيَسْتَعْجِلُوْنَكَ بِالْعَذَابِۗ وَلَوْلَآ اَجَلٌ مُّسَمًّى لَّجَاۤءَهُمُ الْعَذَابُۗ وَلَيَأْتِيَنَّهُمْ بَغْتَةً وَّهُمْ لَا يَشْعُرُوْنَ",
      "text_translation_en": "Now they challenge thee to hasten the coming upon them of [God’s] chastisement: and indeed, had not a term been set [for it by God], that suffering would already have come upon them! But indeed, it will most certainly come upon them of a sudden, and they will be taken unawares.",
      "juz_number": 21
    },
    "54": {
      "text_tafsir_en": "This verse describes the consequences that the Muslims will experience because of their ignorance and ignorance. They will be put into hell that burns the whole body. This verse is a strong warning to the disbelievers by explaining the torment that will come upon them in the hereafter. This was due to their demand for haste to come.",
      "text_tafsir": "Pada ayat ini diterangkan akibat-akibat yang akan dialami oleh orang-orang musyrik karena keingkaran dan kebodohan mereka. Mereka akan dimasukkan ke dalam neraka yang apinya membakar seluruh tubuh. Ayat ini merupakan peringatan keras bagi orang-orang kafir dengan menerangkan azab yang akan menimpa mereka di akhirat nanti. Ini dikarenakan tuntutan mereka agar disegerakan datangnya azab itu.",
      "text_translation": "Mereka meminta kepadamu agar segera diturunkan azab. Dan sesungguhnya neraka Jahanam itu pasti meliputi orang-orang kafir, ",
      "text": "يَسْتَعْجِلُوْنَكَ بِالْعَذَابِۗ وَاِنَّ جَهَنَّمَ لَمُحِيْطَةٌ ۢ بِالْكٰفِرِيْنَۙ",
      "text_translation_en": "They challenge thee to hasten the coming upon them of [God’s] chastisement: but, verily, hell is bound to encompass all who deny the truth –",
      "juz_number": 21
    },
    "55": {
      "text_tafsir_en": "This verse explains how the fire of hell burns the infidels in the hereafter. Their whole body will feel torment, from the tiles to the tips of the toes, from the parts of the body to the invisible. They will be surrounded by torments from all sides, from above and below, as well as from the right and left. In that case, it is said to them, \"Feel the promise of this day, as a result of your former deeds.\" In the other verses it is explained how the fire of hell covers the unbelievers. Allah says: To them the mats sleep from the fire of hell and above them there is a blanket. (al-A'raf \/ 7: 41) His Word also: Above them there is a coating of fire and beneath it there is a coating prepared for them. (az-Zumar \/ 39: 16)",
      "text_tafsir": "Ayat ini menerangkan bagaimana api neraka itu membakar orang-orang kafir di akhirat nanti. Seluruh bagian tubuh mereka akan merasakan azab, sejak dari ubun-ubun sampai ke ujung-ujung jari kaki, sejak dari bagian-bagian tubuh yang kelihatan sampai ke yang tidak kelihatan. Mereka akan diselubungi oleh azab dari segala penjuru, dari atas dan dari bawah, serta dari samping kanan dan kiri. Dalam keadaan demikian, kepada mereka dikatakan, \"Rasakanlah olehmu pada hari ini azab yang dijanjikan itu, sebagai akibat perbuatan-perbuatanmu dahulu.\"\n\nPada ayat-ayat yang lain dijelaskan bagaimana api neraka itu meliputi orang-orang kafir. Allah berfirman:\n\nBagi mereka tikar tidur dari api neraka dan di atas mereka ada selimut (api neraka). (al-A'raf\/7: 41)\n\nFirman-Nya juga:\n\nDi atas mereka ada lapisan-lapisan dari api dan di bawahnya juga ada lapisan-lapisan yang disediakan bagi mereka. (az-Zumar\/39: 16)",
      "text_translation": "pada hari (ketika) azab menutup mereka dari atas dan dari bawah kaki mereka dan (Allah) berkata (kepada mereka), ”Rasakanlah (balasan dari) apa yang telah kamu kerjakan!”",
      "text": "يَوْمَ يَغْشٰىهُمُ الْعَذَابُ مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ اَرْجُلِهِمْ وَيَقُوْلُ ذُوْقُوْا مَا كُنْتُمْ تَعْمَلُوْنَ",
      "text_translation_en": "[encompass them] on the Day when suffering will overwhelm them from above them and from beneath their feet, whereupon He shall say: “Taste [now the fruit of] your own doings!”",
      "juz_number": 21
    },
    "56": {
      "text_tafsir_en": "In this verse, God instructs His faithful servants to leave their homes if they are unable to fulfill the conditions of religion, and live in oppression. This verse contains a universal principle that states that this earth of God was created for the benefit of man. One can stay wherever he wants when he is safe in that place. In the new place, Muslims will find new brothers and sisters in place of the relatives and families they have left behind, since basically all Muslims are siblings, siblings, siblings and fighters. Another principle contained in this verse is that Islam requires its followers not to be too fanatical in their hometown and place of birth. Homeland must be defended, built, and built, so must nations be developed. However, do not be overly concerned with your own country and nation, in the interests of other countries and nations. It is as if God is reminding us that this universe belongs to God and created for the benefit of man. Therefore, humans are commanded to use this nature in accordance with the purpose of God creating it. Let no one ever claim that something is his absolute. A person's ownership of something is temporary, and in time it will be taken back by Him. The above sentence phrase also reminds the Muslims of the vastness and grandeur of Allah, that they may reflect the vision of the future, and not be narrow-minded and limited. The phrase reminds Muslims not just to look at their own place of residence and to think that the earth is confined to their home. That assumption is wrong. The earth of God is wider than they ever imagined. If they came out of their own country and went to explore the countries of the world, they would have seen and gained valuable experience along the way. They will also be able to get relief after a shortage and so on. Allah says: Whoever emigrates in the way of Allah, they will find on this earth a great place of emigration and abundant sustenance. (an-Nisa '\/ 4: 100) Then in a hadith, the Messenger of Allah (may peace be upon him) said: All the states are God's people, and all the servants are the servants of Allah, so wherever you may find favor, stay where you are. (History of Ahmad from az-Zubair bin al-'Awwam) Allah has commanded that his emigrant servants leave their homeland, for he has guaranteed their lives on the earth where they migrated. Implementing a command to emigrate from home is a very difficult task for a person to do, as it means he or she is separated from family and relatives He also left behind a home and yard that he had long cared for, and his possessions and pets. He will be separated from the state and all its contents, which have always been as united with him as the body is with the other members of the body. Therefore, God delivered the order of the emigrants in a gentle and very delicate tone, as if they were commanded, \"O my servants who have believed in me, remember that I have created this vast earth for Therefore, take advantage and occupy the land. \" In the call also reflected the promise of the pilgrims, that Allah will repay their deeds for their obedience to His call. The reply was that the houses were better than the house they had left, and that the property was more blessing than the property they had left. In the same way, their brothers and relatives will be replaced by the better and more noble relatives and relatives they have left as long as they continue to serve Him and perform preaching to mankind. The Prophet and the Muslims fulfilled that sacred call. They migrated to God both individually and as a group. The first time they emigrated to Ethiopia (Ethiopia). *) There God placed them in a glorious place. Then they emigrated to Medinah, which eventually became a place of pilgrimage to the Muslims especially after the Messenger of Allah (may peace be upon him) also emigrated there. In Medina the Muhajirin (Muslims who came from Mecca) were welcomed openly and graciously by the Anshar (Medinah-born natives), as if the Muhajirin were the guests they were looking forward to all this while. Their homes and belongings were shared with the newly arrived Muhajirin, who brought nothing from Mecca. It is even apparent that the Anshar people have preferred the Muhajirin to themselves. Thus the relationship of the two groups was so close that the Prophet made them a close relative. Even at the beginning of the migration, the Muhajirin and Anshar groups could inherit between them. With the arrival of the Muhajirin, Medinah became more and more vibrant. The city then became the center of Islamic society, a gathering of Muslims from all over and eventually the center of Islamic rule. The close relationship between the Muhajirin and the Anshar was praised by Allah as the basis for the formation of the Muslim community. Allah exalted Muhajirin for sacrificing all that he had, for the sake of Allah's religion, while the Anshars were religious helpers. They are willing to sacrifice what they have for the sake of religion. Everything that the people of Muhajirin experienced after arriving and settling in Medinah and mingling with the original inhabitants of Medinah, the Anshar people, was proof of the truth of God's promise to them when they were ordered to emigrate to Medinah. This verse closes with the words, \"That is why you worship Him.\" This sentence means that the earth is vast and belongs to God. Wherever humans are and where they live, it belongs to God. Therefore, it is natural for humans to despair and desire for Him. The above verse is a universal preamble to man to free himself both physically and spiritually from all kinds of material or spiritual restraints that may interfere with his movements, and hinder his freedom. In life everywhere and in any situation, man would not have the freedom, liberty, survival and survival of his kind, as God had determined, if he had not worked hard in that direction. If they try, of course they will. On the contrary, if they do not make an effort, then they have persecuted themselves and will not get what they want. The preaching of Islam is to liberate humanity from oppression and error. Therefore, Muslims are obliged to fight against oppression and mismanagement by sacrificing their wealth and soul. The highest and most important jihad for a believer is jihad performed to free oneself from oppression and error, after which new jihad is passed on to others. A believer should free himself from all humiliation and humiliation of oppression, so he must eliminate both diseases. Allah said: Surely those who were taken away by angels in their own souls, they asked, \"What are you doing?\" They said, \"We are the oppressed on the earth (Mecca).\" They (the angels) asked, \"Is not the earth of God so broad that you may migrate?\" Then they will be in Hell, and (Hell) is a terrible place to return, (an-Nisa '\/ 4: 97) In the above verse, Allah promises a painful torment in the hereafter disgraceful and weak because they have demeaned religion and despised in front of unbelievers. They do not change like merchandise moving from one hand to the other. They are not able to express their desires and desires, let alone preach to the way of good. Therefore, the Islamic preaching is intended to liberate mankind, to develop intellect, and to remove all kinds of pressure on the heart and soul, just as it is intended to preserve human life, as beings created to worship Him.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan hamba-hamba-Nya yang beriman agar meninggalkan tempat tinggal mereka jika di sana mereka tidak dapat melaksanakan ketentuan-ketentuan agama, dan hidup dalam keadaan tertindas. Ayat ini mengandung suatu prinsip universal yang menyatakan bahwa bumi Allah ini diciptakan untuk kepentingan manusia. Seseorang boleh tinggal di mana saja ia inginkan apabila merasa aman di tempat itu. Di tempat yang baru itu, kaum Muslimin akan menemukan saudara-saudara dan keluarga-keluarga yang baru sebagai ganti dari saudara dan keluarga yang mereka tinggalkan, karena pada asasnya seluruh kaum Muslimin adalah bersaudara, saudara seiman, senasib dan seperjuangan.\n\nPrinsip lain yang terkandung dalam ayat ini ialah agama Islam menyuruh penganutnya agar jangan terlalu fanatik kepada kampung halaman dan tempat kelahirannya. Tanah air wajib dibela, dibina, dan dibangun, demikian pula bangsa wajib dimajukan. Akan tetapi, janganlah sekali-kali karena terlalu mementingkan tanah air dan bangsa sendiri, berakibat merugikan negara dan bangsa lain. Seakan-akan Allah mengingatkan bahwa alam semesta ini adalah milik Allah dan diciptakan untuk kepentingan manusia. Oleh karena itu, manusia diperintahkan untuk menggunakan alam ini sesuai dengan tujuan Allah menciptakannya. Jangan sekali-kali ada yang mengaku bahwa sesuatu adalah miliknya yang mutlak. Kepemilikan seseorang atas sesuatu hanyalah sementara, dan pada saatnya milik itu akan diambil oleh-Nya kembali.\n\nUngkapan kalimat ayat di atas juga mengingatkan kaum Muslimin akan luas dan banyaknya milik Allah, agar mereka melayangkan pandangan jauh ke depan, dan tidak berpandangan sempit dan terbatas. Ungkapan itu mengingatkan kaum Muslimin agar jangan hanya melihat tempat kediaman sendiri dan beranggapan bahwa bumi itu hanyalah terbatas pada tempat tinggal mereka saja. Anggapan yang demikian itu salah. Bumi Allah itu lebih luas dari yang mereka perkirakan semula. Kalau mereka keluar dari negeri sendiri pergi menjelajahi negeri-negeri yang ada di dunia ini, tentu mereka akan melihat dan memperoleh pengalaman yang berharga dalam perjalanan itu. Mereka juga akan memperoleh kelapangan sesudah kesempitan dan sebagainya.\n\nAllah berfirman:\n\nBarang siapa berhijrah di jalan Allah, niscaya mereka mendapati di muka bumi ini tempat hijrah yang luas dan rezeki yang banyak. (an-Nisa'\/4: 100)\n\nKemudian dalam sebuah hadis, Rasulullah saw bersabda: \n\nSemua negeri adalah negeri Allah, dan semua hamba adalah hamba Allah, maka di mana saja kamu mendapat kebaikan (rezeki) maka bertempat tinggallah . (Riwayat Ahmad dari az-Zubair bin al-'Awwam) \n\nAllah memerintahkan agar hamba-hamba-Nya yang beriman hijrah meninggalkan kampung halaman mereka, karena Ia menjamin kehidupan mereka di bumi tempat mereka hijrah itu. Melaksanakan perintah hijrah meninggalkan kampung halaman adalah suatu perintah yang sangat berat dilaksanakan oleh seseorang, karena hal itu berarti ia berpisah dan meninggalkan famili dan kaum kerabatnya. Ia juga meninggalkan rumah dan pekarangan yang telah lama dirawat dan dibinanya, serta harta benda dan binatang ternak kesayangannya. Ia akan berpisah dengan negeri dan segala isinya, yang selama ini seakan-akan telah menyatu dengan dirinya sebagaimana bersatunya tubuh dengan anggota-anggota tubuh lainnya. Oleh karena itu, Allah menyampaikan perintah hijrah itu dengan nada yang lemah lembut dan halus sekali, seakan-akan diperintahkan kepada mereka, \"Wahai hamba-hamba-Ku yang telah beriman kepada-Ku, ingatlah olehmu bahwa Aku telah menciptakan bumi yang luas ini untuk kamu semua. Oleh karena itu, manfaatkan dan tempatilah bumi itu olehmu.\"\n\nDalam seruan itu tergambar pula janji yang diharapkan oleh orang-orang yang hijrah itu, yaitu Allah akan membalas amal mereka karena kepatuhan mereka melaksanakan seruan-Nya. Balasan itu berupa rumah-rumah yang lebih baik dari rumah yang mereka tinggalkan, dan harta yang lebih banyak berkahnya dari harta yang mereka tinggalkan. Demikian pula saudara-saudara dan kerabat-kerabat mereka akan diganti dengan kerabat yang lebih baik dan luhur dari saudara dan kerabat yang mereka tinggalkan selama mereka tetap menghambakan diri kepada-Nya dan melaksanakan dakwah kepada manusia.\n\nNabi saw dan kaum Muslimin telah memenuhi panggilan suci itu. Mereka hijrah kepada Allah baik secara perorangan maupun secara rombongan. Pertama kali mereka hijrah ke Ethiopia (Habsyah).*) Di sana Allah menempatkan mereka di tempat yang mulia. Kemudian mereka hijrah ke Medinah, yang akhirnya menjadi tempat hijrah kaum Muslimin terutama setelah Rasulullah saw juga hijrah ke sana. Di Medinah orang-orang Muhajirin (kaum Muslimin yang datang dari Mekah) diterima dengan tangan terbuka dan senang hati oleh kaum Anshar (penduduk asli Medinah yang telah masuk Islam), seakan-akan kaum Muhajirin itu adalah tamu-tamu yang mereka nanti-nantikan kedatangannya selama ini. Rumah-rumah dan harta mereka dimanfaatkan bersama dengan orang Muhajirin yang baru datang, yang tidak membawa sesuatu apa pun dari Mekah. Bahkan terlihat kaum Anshar telah mengutamakan kaum Muhajirin dari diri mereka sendiri. Demikian eratnya hubungan kedua golongan itu sehingga Rasulullah menjadikan keduanya sebagai hubungan karib-kerabat. Bahkan pada permulaan hijrah, kelompok Muhajirin dan Anshar dapat saling mewarisi di antara mereka.\n\nDengan kedatangan kaum Muhajirin itu, kota Medinah menjadi semakin semarak dan berkembang. Kota itu kemudian menjadi pusat pembinaan masyarakat Islam, tempat berkumpul kaum Muslimin dari segala penjuru dan akhirnya menjadi pusat pemerintahan Islam. Hubungan erat antara golongan Muhajirin dan Anshar dipuji Allah sebagai hubungan yang menjadi dasar terbentuknya masyarakat Islam. Allah meninggikan kedudukan Muhajirin karena telah mengorbankan semua yang mereka miliki, untuk kepentingan agama Allah, sedangkan kaum Anshar adalah penolong-penolong agama. Mereka bersedia menginfakkan apa yang mereka miliki untuk kepentingan agama.\n\nSemua yang dialami oleh orang-orang Muhajirin setelah sampai dan menetap di Medinah serta membaur dengan penduduk asli Medinah, yaitu golongan Anshar, merupakan bukti kebenaran janji Allah kepada mereka ketika mereka diperintahkan hijrah ke Medinah.\n\nAyat ini ditutup dengan perkataan, \"Karena itu hanya kepada-Nyalah kamu menyembah.\" Kalimat ini berarti bahwa bumi ini luas sekali dan merupakan kepunyaan Allah. Di mana saja manusia berada dan bertempat tinggal, maka tempat itu adalah milik Allah. Oleh karena itu, sudah sepantasnya manusia mengesakan dan menghambakan diri kepada-Nya.\n\nAyat di atas merupakan dakwah samawiyah kepada manusia untuk membebaskan dirinya baik fisik maupun jiwa dari segala macam keterikatan dan belenggu materiil atau spiritual yang dapat mengganggu gerak-geriknya, dan menghalangi kebebasannya.\n\nDalam kehidupan di mana saja dan dalam situasi apa saja, manusia tidak akan mendapatkan kebebasan, kemerdekaan, kelangsungan hidup dan kelangsungan jenisnya yang hakiki, sebagaimana yang telah ditetapkan Allah, seandainya ia sendiri tidak berusaha dengan sungguh-sungguh ke arah itu. Jika mereka berusaha, tentu mereka akan memperolehnya. Sebaliknya jika mereka tidak berusaha, berarti mereka telah menganiaya diri sendiri dan tidak akan memperoleh apa yang mereka inginkan.\n\nDakwah Islam adalah untuk membebaskan manusia dari penindasan dan kesesatan. Oleh karena itu, kaum Muslimin diwajibkan berjihad menentang penindasan dan kesesatan itu dengan jalan mengorbankan harta dan jiwa mereka. Jihad yang paling tinggi nilainya dan paling utama bagi seorang mukmin ialah jihad yang dilakukan untuk membebaskan diri sendiri dari penindasan dan kesesatan, sesudah itu jihad baru dilanjutkan kepada orang lain. Seorang mukmin harus membebaskan diri dari segala penindasan yang bersifat merendahkan dan menghinakan, sehingga ia harus memberantas kedua penyakit itu. Allah berfirman:\n\nSesungguhnya orang-orang yang dicabut nyawanya oleh malaikat dalam keadaan menzalimi sendiri, mereka (para malaikat) bertanya, \"Bagaimana kamu ini?\" Mereka menjawab, \"Kami orang-orang yang tertindas di bumi (Mekah).\" Mereka (para malaikat) bertanya, \"Bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah (berpindah-pindah) di bumi itu?\" Maka orang-orang itu tempatnya di neraka Jahanam, dan (Jahanam) itu seburuk-buruk tempat kembali, (an-Nisa'\/4: 97)\n\nPada ayat di atas, Allah menjanjikan azab yang sangat pedih di akhirat nanti kepada orang-orang yang hina dan lemah itu karena telah merendahkan agama dan meremehkan diri di hadapan orang-orang kafir. Mereka tidak ubahnya seperti barang dagangan yang berpindah dari satu tangan ke tangan yang lain. Mereka tidak sanggup menyatakan kehendak dan keinginan mereka, apalagi berdakwah ke jalan kebaikan. Oleh karena itu, dakwah Islam ditujukan untuk membebaskan manusia, mengembangkan akal, dan menghilangkan segala macam tekanan pada hati dan jiwa, sebagaimana dakwah itu ditujukan untuk mempertahankan kelangsungan hidup manusia, sebagai makhluk yang diciptakan untuk beribadah kepada-Nya.",
      "text_translation": "Wahai hamba-hamba-Ku yang beriman! Sungguh, bumi-Ku luas, maka sembahlah Aku (saja). ",
      "text": "يٰعِبَادِيَ الَّذِيْنَ اٰمَنُوْٓا اِنَّ اَرْضِيْ وَاسِعَةٌ فَاِيَّايَ فَاعْبُدُوْنِ",
      "text_translation_en": "O YOU servants of Mine who have attained to faith! Behold, wide is Mine earth: worship Me, then, Me alone!",
      "juz_number": 21
    },
    "57": {
      "text_tafsir_en": "This verse reinforces the previous verse by explaining the essence of human life itself. It is said that every human being will surely die and that after death, he will return to his owner, the Lord of the universe. Ever since man was resurrected in the hereafter, he has since experienced eternal life. The actual form of life is determined by one's attitude and behavior throughout life. If he is a believer, then he will have eternal happiness, while he is a disbeliever, and will suffer a painful torment in hell. This verse is based on verse 185 surah ali 'Imran and has been explained there, but is repeated as a warning to Muslims not to be too captivated and enticed by this mortal life, for it is a temporary pleasure and will end. Human relations with all that they possess will soon end. Let not a person's love for something prevent him from obeying God and His Messenger, for it is temporary. Whereas eternal remains are the result of one's worship and piety. Through it all, he obtained the promise of God and the promised heaven.",
      "text_tafsir": "Ayat ini menguatkan ayat sebelumnya dengan menerangkan hakikat kehidupan manusia itu sendiri. Diterangkan bahwa tiap-tiap manusia pasti akan mati dan setelah mati, ia akan kembali kepada pemiliknya, yaitu Tuhan semesta alam. Sejak manusia dibangkitkan kembali di akhirat, sejak itu ia akan mengalami kehidupan yang sebenarnya dan selamanya. Bentuk kehidupan yang sebenarnya itu ditentukan oleh sikap dan tindak-tanduk seseorang selama hidup di dunia. Jika ia seorang mukmin, maka akan memperoleh kebahagiaan yang abadi, sedangkan jika ia kafir, akan mengalami azab yang pedih di neraka.\n\nAyat ini senada dengan ayat 185 surah ali 'Imran dan telah dijelaskan di sana, tetapi diulangi kembali sebagai peringatan bagi kaum Muslimin agar jangan terlalu terpikat dan terpesona oleh kehidupan dunia yang fana ini, karena semuanya itu merupakan kesenangan sementara dan akan berakhir. Hubungan manusia dengan semua yang dimilikinya itu lambat laun akan berakhir. Janganlah sampai kecintaan seseorang kepada sesuatu menghalanginya untuk taat kepada Allah dan Rasul-Nya, karena sesuatu itu bersifat sementara. Sedangkan yang kekal hanya hasil ibadah dan amal saleh seseorang. Dengan semua itu, ia memperoleh rida Allah dan surga yang dijanjikan-Nya.",
      "text_translation": "Setiap yang bernyawa akan merasakan mati. Kemudian hanya kepada Kami kamu dikembalikan. ",
      "text": "كُلُّ نَفْسٍ ذَاۤىِٕقَةُ الْمَوْتِۗ ثُمَّ اِلَيْنَا تُرْجَعُوْنَ",
      "text_translation_en": "Every human being is bound to taste death, [and] in the end unto Us shall all be brought back:",
      "juz_number": 21
    },
    "58": {
      "text_tafsir_en": "This verse describes the reward that those who believe in God will receive, for they have migrated for the sake of their religion. They break free from those who associate with Allah and dare to take any risk as a result of the pilgrimage. The promise of Allah is to reward those who believe and do good deeds of paradise. Inside are beautiful gardens with flowing streams beneath them. They remain in heaven forever. Regarding the image of heaven, it is narrated by the hadith of the Prophet (saws), in which he said: \"Indeed the inhabitants of heaven look upon the inhabitants of high places above them, as you see the glittering stars passing through the horizon, either from the east or the west, for the degree of difference they have. \" The companions said, \"O Messenger of Allah, that is the place of the prophets, other people will not get there.\" The Messenger of Allah (may peace be upon him) replied, \"It is possible, for the sake of Allah, that my soul is in His hands; (Muslim History of Sahl bin Sa'd) In another hadith the Prophet said: \"Indeed in heaven there are high places, behind him can be seen translucent before him and his front can be seen from behind.\" Then a Bedouin Arab stood up and asked, \"Who are these places, O Messenger of Allah?\" The Messenger of Allah (may peace be upon him) replied, \"These places are for those who are good in their word, feed (the poor), always fast and pray because Allah is at night while others sleep.\" (At-Tirmidzi History of 'Ali bin Abi bible) It is a paradise which Allah promises to those who believe, do good deeds, be patient, and trust in Him. In this verse it is explained that God promises to reward those who believe. The promise of God is reinforced by the vow. This is to pacify the hearts of the Muslims, so that they can take good steps in pursuing a straight and difficult path, such as migration and so on.",
      "text_tafsir": "Ayat ini menerangkan ganjaran yang akan diperoleh orang-orang yang beriman kepada Allah, karena telah hijrah untuk kepentingan agama-Nya. Mereka melepaskan diri dari orang-orang yang menyekutukan Allah dan berani menanggung segala resiko akibat dari hijrah itu.\n\nJanji Allah itu ialah memberi ganjaran orang-orang yang beriman dan beramal saleh surga yang penuh kenikmatan. Di dalamnya terdapat taman-taman yang indah dengan sungai-sungai yang mengalir di bawahnya. Mereka kekal di dalam surga itu selama-lamanya.\n\nMengenai gambaran surga itu, diterangkan oleh hadis Nabi saw, di mana beliau bersabda:\n\n\"Sesungguhnya penghuni surga saling melihat penghuni tempat yang tinggi di atas mereka, seperti kamu melihat bintang-bintang gemerlapan yang lewat di ufuk, baik dari timur maupun dari barat, karena perbedaan derajat yang ada pada mereka.\" Para sahabat berkata, \"Ya Rasulullah, itu adalah tempat-tempat para nabi, manusia yang lain tidak akan sampai ke sana.\" Rasulullah menjawab, \"Bisa saja, demi Allah yang jiwaku berada di tangan- Nya, itu adalah tempat-tempat yang beriman kepada Allah dan membenarkan para rasul.\" (Riwayat Muslim dari Sahl bin Sa'd) \n\nDalam hadis yang lain Nabi bersabda:\n\n\"Sesungguhnya di dalam surga ada tempat-tempat yang tinggi, di belakangnya dapat dilihat tembus dari hadapannya dan hadapannya dapat dilihat tembus dari belakangnya.\" Lalu seseorang Arab Badui berdiri dan bertanya, \"Untuk siapa tempat-tempat itu, ya Rasulullah?\" Rasulullah menjawab, \"Tempat-tempat itu untuk orang-orang yang baik perkataannya, memberi makan (orang miskin), selalu berpuasa dan salat karena Allah di malam hari sedang orang lain tidur.\" (Riwayat at-Tirmidzi dari 'Ali bin Abi thalib) \n\nDemikianlah surga yang dijanjikan Allah kepada orang-orang yang beriman, mengerjakan amal saleh, bersabar, dan bertawakal kepada-Nya.\n\nPada ayat ini diterangkan bahwa Allah berjanji akan memberikan ganjaran kepada orang-orang yang beriman. Janji Allah itu dikuatkan dengan kalimat sumpah. Hal ini adalah untuk menenteramkan hati kaum Muslimin, agar langkah mereka mantap dalam menempuh jalan yang lurus dan sulit, seperti hijrah dan sebagainya.",
      "text_translation": "Dan orang-orang yang beriman dan mengerjakan kebajikan, sungguh, mereka akan Kami tempatkan pada tempat-tempat yang tinggi (di dalam surga), yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Itulah sebaik-baik balasan bagi orang yang berbuat kebajikan, ",
      "text": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَنُبَوِّئَنَّهُمْ مِّنَ الْجَنَّةِ غُرَفًا تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَاۗ نِعْمَ اَجْرُ الْعٰمِلِيْنَۖ",
      "text_translation_en": "whereupon unto those who have attained to faith and wrought good works We shall most certainly assign mansions in that paradise through which run­ning waters flow, therein to abide: how excellent a reward for those who labour –",
      "juz_number": 21
    },
    "59": {
      "text_tafsir_en": "This verse describes the reward that those who believe in God will receive, for they have migrated for the sake of their religion. They break free from those who associate with Allah and dare to take any risk as a result of the pilgrimage. The promise of Allah is to reward those who believe and do good deeds of paradise. Inside are beautiful gardens with flowing streams beneath them. They remain in heaven forever. Regarding the image of heaven, it is narrated by the hadith of the Prophet (saws), in which he said: \"Indeed the inhabitants of heaven look upon the inhabitants of high places above them, as you see the glittering stars passing through the horizon, either from the east or the west, for the degree of difference they have. \" The companions said, \"O Messenger of Allah, that is the place of the prophets, other people will not get there.\" The Messenger of Allah (may peace be upon him) replied, \"It is possible, for the sake of Allah, that my soul is in His hands; (Muslim History of Sahl bin Sa'd) In another hadith the Prophet said: \"Indeed in heaven there are high places, behind him can be seen translucent before him and his front can be seen from behind.\" Then a Bedouin Arab stood up and asked, \"Who are these places, O Messenger of Allah?\" The Messenger of Allah (may peace be upon him) replied, \"These places are for those who are good in their word, feed (the poor), always fast and pray because Allah is at night while others sleep.\" (At-Tirmidzi History of 'Ali bin Abi bible) It is a paradise which Allah promises to those who believe, do good deeds, be patient, and trust in Him. In this verse it is explained that God promises to reward those who believe. The promise of God is reinforced by the vow. This is to pacify the hearts of the Muslims, so that they can take good steps in pursuing a straight and difficult path, such as migration and so on.",
      "text_tafsir": "Ayat ini menerangkan ganjaran yang akan diperoleh orang-orang yang beriman kepada Allah, karena telah hijrah untuk kepentingan agama-Nya. Mereka melepaskan diri dari orang-orang yang menyekutukan Allah dan berani menanggung segala resiko akibat dari hijrah itu.\n\nJanji Allah itu ialah memberi ganjaran orang-orang yang beriman dan beramal saleh surga yang penuh kenikmatan. Di dalamnya terdapat taman-taman yang indah dengan sungai-sungai yang mengalir di bawahnya. Mereka kekal di dalam surga itu selama-lamanya.\n\nMengenai gambaran surga itu, diterangkan oleh hadis Nabi saw, di mana beliau bersabda:\n\n\"Sesungguhnya penghuni surga saling melihat penghuni tempat yang tinggi di atas mereka, seperti kamu melihat bintang-bintang gemerlapan yang lewat di ufuk, baik dari timur maupun dari barat, karena perbedaan derajat yang ada pada mereka.\" Para sahabat berkata, \"Ya Rasulullah, itu adalah tempat-tempat para nabi, manusia yang lain tidak akan sampai ke sana.\" Rasulullah menjawab, \"Bisa saja, demi Allah yang jiwaku berada di tangan- Nya, itu adalah tempat-tempat yang beriman kepada Allah dan membenarkan para rasul.\" (Riwayat Muslim dari Sahl bin Sa'd) \n\nDalam hadis yang lain Nabi bersabda:\n\n\"Sesungguhnya di dalam surga ada tempat-tempat yang tinggi, di belakangnya dapat dilihat tembus dari hadapannya dan hadapannya dapat dilihat tembus dari belakangnya.\" Lalu seseorang Arab Badui berdiri dan bertanya, \"Untuk siapa tempat-tempat itu, ya Rasulullah?\" Rasulullah menjawab, \"Tempat-tempat itu untuk orang-orang yang baik perkataannya, memberi makan (orang miskin), selalu berpuasa dan salat karena Allah di malam hari sedang orang lain tidur.\" (Riwayat at-Tirmidzi dari 'Ali bin Abi thalib) \n\nDemikianlah surga yang dijanjikan Allah kepada orang-orang yang beriman, mengerjakan amal saleh, bersabar, dan bertawakal kepada-Nya.\n\nPada ayat ini diterangkan bahwa Allah berjanji akan memberikan ganjaran kepada orang-orang yang beriman. Janji Allah itu dikuatkan dengan kalimat sumpah. Hal ini adalah untuk menenteramkan hati kaum Muslimin, agar langkah mereka mantap dalam menempuh jalan yang lurus dan sulit, seperti hijrah dan sebagainya.",
      "text_translation": "(yaitu) orang-orang yang bersabar dan bertawakal kepada Tuhannya. ",
      "text": "الَّذِيْنَ صَبَرُوْا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُوْنَ",
      "text_translation_en": "those who are patient in adversity and in their Sustainer place their trust!",
      "juz_number": 21
    },
    "60": {
      "text_tafsir_en": "Because this verse is based on the story of Ibn 'Abbas, who says that Muhammad told the believers in Mecca, when the Muslims tortured them, \"Get out of the way and depart. Do not associate with the unjust.\" The believers replied, \"O Messenger of Allah, there we have no home, no property, no one to feed, and no one to drink.\" So this verse goes down in response to the concerns of the believers. This verse goes down to appease the believers who obey the Messenger of Allah (may peace be upon him) to emigrate, both those who have migrated, or the Muslims who are preparing to emigrate, as if Allah said, \"O believers, challenge the enemies of God. Do not be afraid of poverty and poverty because of the abundance of wild animals who cannot afford daily food for their needs, but Allah gives them sustenance. animals and are better able to feed, why worry about not getting food. Even if you migrate without bringing anything, God will surely give you sustenance. This verse warns Muslims that Allah will not waste any of His creatures. He presented an easy-to-understand metaphor for Muslims, such as the animals who couldn't afford to feed themselves. God made his mother love him, so they worked hard and worked hard to find food for her children. Then the mother feeds the food she receives into the mouths of her children, as we see the birds and so on. There are also animals that feed their babies with milk from their mothers, just as they do with mammals. These are all the provisions of God, so that every creature can maintain its survival. In the same way, human beings, some strong, some weak, some rich, some poor, some small, some big, some live in fertile places, and some live in barren areas, all of them are provided with sustenance by God, according to their needs. This is what this verse means. God provided sustenance for all His creatures, including the Muhajirin, even though their possessions were left in Mecca, and their livelihood was cut off. Allah says: And not one living thing on earth except all is guaranteed by Allah. He knows where he lives and where he lives. Everything (written) in the real Book (Far Mahfudh). (Hud \/ 11: 6) Then this verse closes with the assertion that Allah is All-Hearing of His servants and knows all His needs. From the above verses it is understood that man does not know exactly what he is doing. He knows only the needs and the needs of his being born, while the spiritual needs, and others, do not know much, such as the need for air that he must live all day, water, and so on. Nevertheless, every believer is required to strive and devote his life. God has given us the potential to desire and to strive until we are obliged to do so, as Allah says: Surely God will not change the condition of a nation before they change their own condition. (ar-Ra'd \/ 13: 11)",
      "text_tafsir": "Sabab nuzul ayat ini berdasarkan riwayat dari Ibnu 'Abbas yang menyebutkan bahwa Nabi Muhammad berkata kepada orang-orang yang beriman di Mekah, ketika orang-orang musyrik menyiksa mereka, \"Keluarlah kamu sekalian dan hijrahlah. Jangan bertetangga dengan orang yang zalim itu.\" Orang-orang mukmin menjawab, \"Ya Rasulullah, di sana kami tidak mempunyai rumah, tidak mempunyai harta, tidak ada orang yang akan memberi makan, dan tidak ada orang yang akan memberi minum.\" Maka turunlah ayat ini sebagai jawaban terhadap kekhawatiran orang-orang mukmin itu.\n\nAyat ini turun untuk menenteramkan hati orang-orang yang beriman yang memenuhi seruan Rasulullah saw untuk hijrah, baik mereka yang telah hijrah, maupun kaum Muslimin yang sedang bersiap-siap untuk hijrah, seakan-akan Allah mengatakan, \"Hai orang-orang yang beriman, tantanglah musuh-musuh Allah itu. Janganlah sekali-kali kamu takut kepada kepapaan dan kemiskinan karena betapa banyaknya binatang melata yang tidak sanggup mengumpulkan makanan setiap hari untuk keperluannya, tetapi Allah tetap memberinya rezeki. Kamu wahai orang-orang yang beriman, jauh lebih baik dari binatang dan lebih pandai mencari makan, kenapa kamu khawatir tidak akan mendapat makanan. Walaupun kamu hijrah tanpa membawa sesuatu, tetapi Allah pasti memberimu rezeki. Allah Maha Mendengar segala macam doa, mengetahui segala keadaan hamba-hamba-Nya.\"\n\nAyat ini mengisyaratkan kepada kaum Muslimin bahwa Allah tidak akan menyia-nyiakan makhluk-Nya sedikit pun. Dia mengemukakan suatu perumpamaan mudah dipahami pengertiannya oleh kaum Muslimin, seperti anak-anak binatang yang tidak sanggup mencari makan sendiri. Allah menjadikan induknya sayang kepadanya, sehingga mereka mau berusaha dan bersusah payah mencarikan makanan bagi anaknya. Kemudian induk itu menyuapkan makanan yang didapat ke dalam mulut anak-anaknya, sebagaimana kita saksikan pada burung dan sebagainya. Ada pula binatang yang memberi makan anaknya dengan air susu dari induknya, sebagaimana yang terdapat pada binatang menyusui. Semuanya itu merupakan ketentuan Allah, sehingga dengan demikian setiap makhluk bisa mempertahankan kelangsungan hidup jenisnya.\n\nDemikian pula halnya manusia, ada yang kuat, ada yang lemah, ada yang kaya, ada yang miskin, ada yang kecil, ada yang besar, ada yang tinggal di tempat yang subur, dan ada pula yang tinggal di tempat yang tandus, semuanya diberi rezeki oleh Allah, sesuai dengan kebutuhan mereka. Inilah yang dimaksud dengan ayat ini. Allah memberikan rezeki kepada semua makhluk-Nya, termasuk kaum Muhajirin, sekalipun harta benda mereka tertinggal di Mekah, dan mata pencahariannya terputus.\n\nAllah berfirman:\n\nDan tidak satupun makhluk bergerak (bernyawa) di bumi melainkan semua-nya dijamin Allah rezekinya. Dia mengetahui tempat kediamannya dan tempat penyimpanannya. Semua (tertulis) dalam Kitab yang nyata (Lauh Mahfudh). (Hud\/11: 6)\n\nKemudian ayat ini ditutup dengan menegaskan bahwa Allah Maha Mendengar apa yang diminta hamba-Nya dan Maha Mengetahui semua keperluannya.\n\nDari ayat-ayat di atas dipahami bahwa manusia tidak mengetahui dengan pasti apa-apa yang dilakukannya. Ia hanya mengetahui keperluan dan kebutuhan lahir saja, sedangkan keperluan-keperluan yang bersifat rohani, dan yang lainnya, banyak yang tidak diketahuinya, seperti keperluan akan udara yang harus ia hirup sepanjang hari, air, dan sebagainya. Meskipun begitu, setiap mukmin diwajibkan berusaha dan berikhtiar dalam hidupnya. Allah telah memberikan potensi untuk berkehendak dan berusaha sehingga kita tetap wajib berusaha, sebagaimana firman Allah:\n\nSesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri. (ar-Ra'd\/13: 11)",
      "text_translation": "Dan berapa banyak makhluk bergerak yang bernyawa yang tidak (dapat) membawa (mengurus) rezekinya sendiri. Allah-lah yang memberi rezeki kepadanya dan kepadamu. Dia Maha Mendengar, Maha Mengetahui. ",
      "text": "وَكَاَيِّنْ مِّنْ دَاۤبَّةٍ لَّا تَحْمِلُ رِزْقَهَاۖ اللّٰهُ يَرْزُقُهَا وَاِيَّاكُمْ وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
      "text_translation_en": "And how many a living creature is there that takes no thought of its own sustenance; [the while] God provides for it as [He provides] for you - since He alone is all-hearing, all-knowing.",
      "juz_number": 21
    },
    "61": {
      "text_tafsir_en": "This verse explains that the Muslims acknowledge that the creator of heaven and earth is the One True God. He subjugates the sun and the moon for the benefit of man. Their confession is a natural one because in the beginning their ancestors were monotheists, namely, Abraham and Ishmael. At first they were proud of the monotheistic religion, so they were not interested in Judaism and Christianity growing in the Arabian Peninsula. As time passed and the generations changed, without realizing that pure religion was gradually being absorbed by the elements of shirk. Because they have feelings and passions, they are gradually drifting away from the original. Finally, they worshiped statues, spirits, and other objects besides worshiping God. Even though the beliefs they profess have strayed far from the monotheistic religion, they still acknowledge that they belong to the religion of Abraham. When they were asked who created the heavens and the earth and subjected the sun and the moon, they replied, \"The Creator is God, and Allah is the Almighty.\"",
      "text_tafsir": "Ayat ini menerangkan bahwa kaum musyrik mengakui bahwa yang menciptakan langit dan bumi itu adalah Allah Yang Maha Esa. Dialah yang menundukkan matahari dan bulan untuk kepentingan manusia. Pengakuan mereka itu adalah suatu hal yang wajar karena pada mulanya nenek moyang mereka beragama tauhid, yaitu, Nabi Ibrahim dan Nabi Ismail. Pada mulanya mereka bangga dengan agama tauhid itu, sehingga mereka tidak tertarik dengan agama Yahudi dan Nasrani yang berkembang di Jazirah Arab. Seiring dengan berlalunya masa dan bergantinya generasi, tanpa mereka sadari agama tauhid yang murni itu sedikit demi sedikit telah dimasuki oleh unsur-unsur syirik. Karena memperturutkan perasaan dan hawa nafsu, mereka makin lama makin jauh menyimpang dari dasar semula. Akhirnya, mereka menyembah patung, jin, dan benda-benda lain di samping menyembah Allah.\n\nSekalipun kepercayaan yang mereka anut telah jauh menyimpang dari agama tauhid, namun mereka masih tetap mengakui bahwa mereka menganut agama Ibrahim. Kalau ditanyakan kepada mereka tentang siapakah yang menciptakan langit dan bumi serta menundukkan matahari dan bulan, mereka menjawab, \"Yang menciptakan ialah Allah dan Allah-lah yang menguasainya.\"",
      "text_translation": "Dan jika engkau bertanya kepada mereka, ”Siapakah yang menciptakan langit dan bumi dan menundukkan matahari dan bulan?” Pasti mereka akan menjawab, ”Allah.” Maka mengapa mereka bisa dipalingkan (dari kebenaran). ",
      "text": "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لَيَقُوْلُنَّ اللّٰهُ ۗفَاَنّٰى يُؤْفَكُوْنَ",
      "text_translation_en": "And thus it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth, and made the sun and the moon subservi­ent [to His laws]?” - they will surely answer, “God.” How perverted, then, are their minds!",
      "juz_number": 21
    },
    "62": {
      "text_tafsir_en": "In this verse, God states that it is He who provides the provision for whom He wills and narrows the provision for whom He wills. He alone has the power to make provisions, so that believers do not need to leave because they are afraid of the poor. God sustains them wherever they are, whether in their own country, or in their country or in their journey, even when they are taken captive. Allah says: Indeed Allah, He is the Provider of Power, Absolutely Powerful. (adz-dzariyat \/ 51: 58) This verse further states that Allah knows all the benefits of His creatures. He also knows those who do good deeds because they are given a lot of sustenance, and he knows those who do damage and mischief with the wealth that God has given them. \"This verse can also be related to the statements of the previous verses (verse 61) where Allah declares to the heathen, \"Who created and dominated this universe?\" They received no answer, except to submit to the Supreme Being who created and ruled all beings. Why, then, do they still doubt who sustains the whole being? If they say that it is Allah who extends it and narrows it down to His creatures, there is no one else, why do they still worship and ask for the idols? God further explains that He distinguishes His servants in the matter of providing sustenance because He is greater know what they are up to. The gifts should be tailored to their individual circumstances.",
      "text_tafsir": "Pada ayat ini, Allah menyatakan bahwa Dialah yang melapangkan rezeki bagi siapa yang dikehendaki-Nya dan menyempitkan rezeki bagi siapa yang dikehendaki-Nya. Dia sendiri yang berkuasa untuk menentukan rezeki, sehingga orang-orang yang beriman tidak perlu enggan berhijrah karena takut miskin. Allah memberi rezeki di mana saja mereka berada, baik di negeri sendiri, maupun di negeri orang atau dalam perjalanan, bahkan ketika mereka ditawan musuh.\n\nAllah berfirman:\n\nSungguh Allah, Dialah Pemberi rezeki Yang Mempunyai Kekuatan lagi Sangat Kokoh. (adz-dzariyat\/51: 58)\n\nAyat ini selanjutnya menyatakan bahwa Allah mengetahui segala kemaslahatan makhluk-Nya. Dia juga mengetahui orang-orang yang mengerjakan amal saleh karena banyak dianugerahi rezeki, dan mengetahui orang-orang yang membuat kerusakan dan kemungkaran dengan kekayaan yang telah dianugerahkan Allah kepada mereka.\"\n\nAyat ini dapat pula dihubungkan dengan pernyataan orang-orang musyrik pada ayat sebelum ini (ayat 61) di mana Allah menyatakan kepada orang-orang musyrik, \"Siapa yang menciptakan dan menguasai alam semesta ini?\" Mereka tidak mendapatkan jawaban, kecuali tunduk dengan menetapkan bahwa Allah Yang Maha Esa yang menciptakan dan menguasai seluruh makhluk. Jika mereka telah mengakui hal itu, mengapa mereka masih ragu siapa yang menanggung rezeki seluruh makhluk itu. Jika mereka mengatakan bahwa Allah-lah yang melapangkan dan menyempitkan rezeki kepada makhluk-Nya, tidak ada yang lain, kenapa mereka masih menyembah dan meminta rezeki itu kepada berhala-berhala? \n\nAllah selanjutnya menjelaskan bahwa Dia membedakan hamba-hamba-Nya dalam hal pemberian rezeki karena Ia lebih mengetahui kemaslahatan mereka. Pemberian itu harus disesuaikan dengan keadaan mereka masing-masing.",
      "text_translation": "Allah melapangkan rezeki bagi orang yang Dia kehendaki di antara hamba-hamba-Nya dan Dia (pula) yang membatasi baginya. Sungguh, Allah Maha Mengetahui segala sesuatu. ",
      "text": "اَللّٰهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ مِنْ عِبَادِهٖ وَيَقْدِرُ لَهٗ ۗاِنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ",
      "text_translation_en": "God grants abundant sustenance, or gives it in scant measure, to whichever He wills of His crea­tures: for, behold, God has full knowledge of every­thing.",
      "juz_number": 21
    },
    "63": {
      "text_tafsir_en": "In this verse, the question is still addressed to the Meccan monks. They were asked about who brought down rain from the sky, and then with that water was the land so barren and barren? What are their answers to this question? In verse 61 they have stated that it is God who created the heavens and the earth, and subdued the sun and the moon. This is something that does not need to be discussed anymore because it is in accordance with the right mindset and teachings of the religion of Abraham, the religion they claim to be. However, their actions are contrary to the statements they make. This is the weirdness they have. So in this 63 verse, God explains that when they are asked that question, they will also answer, \"Allah.\" Thus it is clear that they believe that God is the Owner of all things in heaven and on earth. It is he who controls everything that exists in them, such as the pouring rain from the sky, and then with the rain water the earth becomes fertile and plants grow. However, their faith is not based on the deeds they do on a daily basis, because they associate God with idols of no power or power. Although most of the monks declare the confession as above, most of them do not want to understand and practice it. They seem like fools who can't understand the reality of their confession. This is because of the misguidedness and injustice that have overcome the truth. When the truth is presented to them, even their minds and instincts accept it, but their hearts no longer accept it. They even accused the Prophet Muhammad of bewitching them, so they doubted the reality of their own eyes and minds. God said: Surely they say, \"Indeed we are blinded, even though we are sorcerers.\" (al-hijr \/ 15: 15) In this verse, Allah commands Prophet Muhammad to pronounce \"al-hamdulillah\". This word is pronounced as a thank-you note to God for the favor He has given, namely the disclosure of the truth by the confession and declaration of the Muslims regarding the oneness of God. However, even though they have acknowledged the power and generosity of God, their hearts are still dependent on the idols they worship.",
      "text_tafsir": "Dalam ayat ini, pertanyaan masih dihadapkan kepada orang-orang musyrik Mekah. Mereka ditanya tentang siapa yang menurunkan air hujan dari langit, kemudian dengan air itu suburlah tanah yang selama ini tandus dan gersang? Apa jawaban mereka terhadap pertanyaan ini?\n\nPada ayat 61 di atas mereka telah menyatakan bahwa Allah-lah yang menjadikan langit dan bumi, serta menundukkan matahari dan bulan. Hal ini adalah suatu yang tidak perlu diperbincangkan lagi karena sesuai dengan akal pikiran yang benar dan ajaran agama yang dibawa Nabi Ibrahim, agama yang diakui sebagai agama mereka. Namun demikian, perbuatan mereka berlawanan dengan pernyataan yang mereka ucapkan. Inilah keanehan yang ada pada mereka. Maka dalam ayat 63 ini, Allah menerangkan bahwa kalau dihadapkan kepada mereka pertanyaan tersebut, mereka juga akan menjawab, \"Allah.\" \n\nDengan demikian jelaslah bahwa mereka mempercayai bahwa Allah-lah Pemilik semua yang ada di langit dan di bumi. Dialah yang mengendalikan segala sesuatu yang ada pada keduanya, seperti menurunkan hujan dari langit, kemudian dengan air hujan itu bumi menjadi subur dan menumbuhkan tanam-tanaman. Akan tetapi, kepercayaan mereka ini tidak melandasi amal perbuatan yang mereka lakukan setiap hari, karena mereka mempersekutukan Tuhan dengan berhala-berhala yang tidak mempunyai kekuasaan atau kekuatan apa pun. \n\nSekalipun orang-orang musyrik menyatakan pengakuan seperti di atas, namun kebanyakan mereka tidak mau memahami dan mengamalkan pengakuan itu. Mereka seakan-akan seperti orang bodoh yang tidak dapat mengerti hakikat pengakuan mereka. Hal yang demikian itu disebabkan oleh kesesatan dan kezaliman yang telah mengalahkan kebenaran. Apabila kebenaran itu dikemukakan kepada mereka, sekalipun pikiran dan naluri mereka menerimanya, tetapi hati mereka tidak menerimanya lagi. Bahkan mereka menuduh Nabi Muhammad telah menyihir mereka, sehingga mereka ragu terhadap kenyataan yang dilihat oleh mata dan pikiran mereka sendiri. Allah berfirman:\n\nTentulah mereka berkata, \"Sesungguhnya pandangan kamilah yang dikaburkan, bahkan kami adalah orang yang terkena sihir.\" (al-hijr\/15: 15)\n\nPada ayat ini, Allah memerintahkan Nabi Muhammad supaya mengucapkan \"al-hamdulillah\". Perkataan ini diucapkan sebagai pernyataan syukur kepada Allah atas nikmat yang telah diberikan-Nya, yaitu tersingkapnya kebenaran dengan adanya pengakuan dan pernyataan kaum musyrik tentang keesaan Tuhan. Namun demikian, sekalipun mereka telah mengakui kekuasaan dan kemahapemurahan Allah, tetapi hati mereka masih tergantung pada berhala-berhala yang mereka sembah.",
      "text_translation": "Dan jika kamu bertanya kepada mereka, ”Siapakah yang menurunkan air dari langit lalu dengan (air) itu dihidupkannya bumi yang sudah mati?” Pasti mereka akan menjawab, ”Allah.” Katakanlah, ”Segala puji bagi Allah,” tetapi kebanyakan mereka tidak mengerti. ",
      "text": "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ نَّزَّلَ مِنَ السَّمَاۤءِ مَاۤءً فَاَحْيَا بِهِ الْاَرْضَ مِنْۢ بَعْدِ مَوْتِهَا لَيَقُوْلُنَّ اللّٰهُ ۙقُلِ الْحَمْدُ لِلّٰهِ ۗبَلْ اَكْثَرُهُمْ لَا يَعْقِلُوْنَ ࣖ",
      "text_translation_en": "And thus it is: if thou ask them, “Who is it that sends down water from the skies, giving life thereby to the earth after it had been lifeless?” - they will surely answer, “God.” Say thou: “[Since this is so,] all praise is due to God [alone]!” But most of them will not use their reason:",
      "juz_number": 21
    },
    "64": {
      "text_tafsir_en": "This verse explains the realities of worldly life, especially to the unbelievers who believe in worldly life. It is said that earth life is just a game and a joke, not a real life. The views and minds of the monks were closed, so that they were distracted by worldly affairs. They run around seeking the wealth, power, enjoyment, and enjoyment they have, as if life in the world is their real life. If they want to diminish their attention to earthly life a little, and look upon it as a preparation ground for a more eternal and eternal life, and to listen to the Scriptures of Allah, they will not be wicked and associate with God. If they listen to the call of the apostles using their ears, their intellect, and their hearts, they will not be led astray from the way of God. Then God explains that the true life is the afterlife, and that it is the other side of human life, that is, life covered by absolute truth. The life of the world is a life in which there is a mixture of truth and error, while in the hereafter, truth and falsehood are separated. The afterlife is largely determined by the life of the world in which one lives, and depends on charity and effort during his lifetime. The life of the world can be likened to childhood life, while the afterlife can be like adult life. If a person in his childhood earnestly prepares, such as studying and working diligently, his adult life will be bright. On the other hand, if he plays a lot and doesn't use his time well, then he will have a rough time. Such is the case with the afterlife, depending on one's charities and efforts while living in the world. If he lives in the world of faith and works righteously, then his life in the hereafter will be good and happy. On the other hand, if he disbelieves and commits forbidden acts, he will suffer a miserable life in the hereafter. At the end of this verse, Allah warns the Muslims to know the truth of life. If they knew and knew it, they would not be lost and deceived by this mortal life. Everyone who has knowledge and wants to use their reason easily can tell the difference between good and bad, between right and wrong, and so on.",
      "text_tafsir": "Ayat ini menerangkan hakikat kehidupan duniawi, terutama kepada orang-orang musyrik yang teperdaya dengan kehidupan duniawi. Diterangkan bahwa kehidupan duniawi itu hanyalah permainan dan senda gurau saja, bukan kehidupan yang sebenarnya. Pandangan dan pikiran orang-orang musyrik telah tertutup, sehingga mereka telah disibukkan oleh urusan duniawi. Mereka berlomba-lomba mencari harta kekayaan, kekuasaan, kesenangan, dan kelezatan yang ada padanya, seakan-akan kehidupan dunia ialah kehidupan yang sebenarnya bagi mereka. Andaikata mereka mau mengurangi perhatian mereka kepada kehidupan duniawi itu sedikit saja, dan memandangnya sebagai medan persiapan untuk bekal dalam kehidupan lain yang lebih kekal dan abadi, serta mau pula mendengarkan ayat-ayat Allah, tentulah mereka tidak akan durhaka dan mempersekutukan Allah. Andaikata mereka mendengarkan seruan rasul dengan menggunakan telinga, akal, dan hati, mereka tidak akan tersesat dari jalan Allah.\n\nKemudian Allah menerangkan bahwa kehidupan yang hakiki itu adalah kehidupan akhirat, dan ia merupakan sisi lain dari kehidupan manusia, yaitu kehidupan yang diliputi oleh kebenaran yang mutlak. Kehidupan dunia adalah kehidupan yang di dalamnya bercampur baur antara kebenaran dan kebatilan, sedangkan dalam kehidupan akhirat, kebenaran dan kebatilan telah dipisahkan. Kehidupan akhirat banyak ditentukan oleh kehidupan dunia yang dijalani seseorang, dan tergantung kepada amal dan usahanya sewaktu masih hidup. Kehidupan dunia dapat diibaratkan dengan kehidupan masa kanak-kanak, sedang kehidupan akhirat dapat diibaratkan dengan kehidupan masa dewasa. Jika seseorang pada masa kanak-kanak mempersiapkan diri dengan sungguh-sungguh, seperti belajar dan bekerja dengan tekun, maka kehidupan masa dewasanya akan menjadi kehidupan yang cerah. Sebaliknya jika ia banyak bermain-main dan tidak menggunakan waktu sebaik-baiknya, maka ia akan mempunyai masa dewasa yang suram.\n\nDemikianlah halnya dengan kehidupan akhirat, tergantung kepada amal dan usaha seseorang sewaktu masih hidup di dunia. Jika ia selama hidup di dunia beriman dan beramal saleh, maka kehidupannya di akhirat akan baik dan bahagia. Sebaliknya jika ia kafir dan mengerjakan perbuatan-perbuatan yang terlarang, ia akan mengalami kehidupan yang sengsara di akhirat nanti.\n\nPada akhir ayat ini, Allah memperingatkan kepada orang-orang musyrik agar mengetahui hakikat hidup. Andaikata mereka mendalami dan mengetahui hal itu, tentu mereka tidak akan tersesat dan teperdaya oleh kehidupan dunia yang fana ini. Setiap orang yang berilmu dan mau mempergunakan akalnya dengan mudah dapat membedakan antara yang baik dengan yang buruk, antara yang benar dan yang salah, dan sebagainya.",
      "text_translation": "Dan kehidupan dunia ini hanya senda gurau dan permainan. Dan sesungguhnya negeri akhirat itulah kehidupan yang sebenarnya, sekiranya mereka mengetahui. ",
      "text": "وَمَا هٰذِهِ الْحَيٰوةُ الدُّنْيَآ اِلَّا لَهْوٌ وَّلَعِبٌۗ وَاِنَّ الدَّارَ الْاٰخِرَةَ لَهِيَ الْحَيَوَانُۘ لَوْ كَانُوْا يَعْلَمُوْنَ",
      "text_translation_en": "for, [if they did, they would know that] the life of this world is nothing but a passing delight and a play - whereas, behold, the life in the hereafter is indeed the only [true] life: if they but knew this!",
      "juz_number": 21
    },
    "65": {
      "text_tafsir_en": "This verse paints a life of contradictions and contradictions. Their hearts believed in the power and oneness of God, but the influence of the world and their lust sealed their true hearts. Therefore, they cannot practice and remember God sincerely. They are like confused people in a life full of greed. They were likened to God by boatmen, sailing across the vast ocean. Suddenly, a strong hurricane followed the waves and waves that swirled until their boat crashed there. Then there was fear in their hearts, accompanied by the feeling that they would not survive and be swallowed up by the wave. At that moment, they remembered God, and believed that only the Almighty saved and protected them from the tide. They acknowledge the oneness of God, both in heart and in emotion and in speech. In short, in all behaviors, they return to the nature of nature, which is to acknowledge the oneness and power of God. They no longer believe that the gods they worship are capable of delivering and rescuing them from the threatening catastrophe. Therefore, they pray and ask Allah for help. So God answered their sincere prayers and prayers by saving them from all disasters. However, once they had escaped the scary catastrophe, and their hearts were at ease and at peace, they immediately returned to the God who had saved them. They forget that they once prayed to him for salvation and promised to remain obedient and obedient only to him. They returned to fellowship with God with the unworthy deities at least partnered with Him. So Allah will make them happy until the appointed time, and Allah will reward them in the hereafter. In another verse it describes the state of the Muslims in the hereafter. They will acknowledge the oneness and power of God as they suffer the painful torment of hell and pray for His help to be freed from that torture. Allah said: O our Lord, take us out of it, if we return (to disbelief), indeed, we are the wrongdoers. \"He said,\" Live in humility in it. , and do not talk with me. \"(al-Mu'minun \/ 23: 107-108) Muhammad bin Ishaq in the book of Sirah (the date of the Prophet Muhammad) records that 'Ikrimah bin Abi Jahal said,\" When the Prophet conquered Mecca, I run away from it. When I boarded a ship to Ethiopia, the ship sank. The passengers of the ship said, \"Men, pray earnestly for your Lord, for there is no one who can save us from this disaster, except for him.\" No one could save the land but Him. O my Lord, I promise you, if I come out of this sea, then I will go to Muhammad and I will reveal my faith to him, then I will find him a very loving and compassionate one, and fulfill my promise. \" Ignorance when they board the ship, their idols are also taken. When the storm came, the idols were cast into the sea, and they said, \"My God, my God.\" Ar-Razi says in his book, al-Lawami, \"This is a sign that the knowledge of God is human nature. Even though they neglected to remember Him when they were happy, they remembered Him in times of trouble.\"",
      "text_tafsir": "Ayat ini melukiskan kehidupan orang-orang musyrik yang penuh pertentangan dan kontradiksi. Hati mereka percaya kepada kekuasaan dan keesaan Allah, tetapi pengaruh dunia dan hawa nafsu menutup keyakinan hati mereka yang benar. Oleh karena itu, mereka tidak dapat beramal dan mengingat Allah secara ikhlas. Mereka seperti orang bingung di dalam kehidupan yang penuh kemusyrikan.\n\nMereka diibaratkan Allah dengan orang yang naik kapal, berlayar mengarungi lautan luas. Tiba-tiba datang angin topan yang kencang disertai gelombang dan ombak yang menggunung sehingga kapal mereka terhempas ke sana ke mari. Maka timbul ketakutan dalam hati mereka, diiringi perasaan bahwa mereka tidak akan selamat dan akan ditelan oleh gelombang itu. Di saat itu, mereka ingat kepada Allah, dan meyakini bahwa hanya Dia Yang Mahakuasa menyelamatkan dan melindungi mereka dari hempasan ombak itu. Mereka mengakui keesaan Allah, baik dalam hati dan perasaan maupun dalam ucapan. Singkatnya dalam semua tindak tanduk, mereka kembali kepada fitrah semula, yaitu mengakui keesaan dan kekuasaan Allah. Mereka tidak percaya lagi bahwa tuhan-tuhan yang selama ini disembah sanggup melepaskan dan menyelamatkan mereka dari malapetaka yang sedang mengancam itu. Oleh karena itu, mereka berdoa dan mohon pertolongan kepada Allah saja.\n\nMaka Allah mengabulkan permohonan dan doa mereka yang ikhlas itu dengan menyelamatkan mereka dari segala bencana. Akan tetapi, setelah mereka terlepas dari bencana yang menakutkan itu, dan hati mereka telah merasa aman dan tenteram, serta merta mereka kembali mengingkari Allah yang telah menyelamatkan mereka. Mereka lupa bahwa mereka pernah berdoa kepada-Nya untuk meminta keselamatan dan berjanji akan tetap tunduk dan patuh hanya kepada-Nya. Mereka kembali mempersekutukan Allah dengan tuhan-tuhan yang tidak layak sedikit pun dipersekutukan dengan-Nya. Maka Allah membiarkan mereka bersenang-senang sampai pada waktu yang ditentukan dan Allah akan memberi ganjaran yang setimpal di akhirat kelak.\n\nPada ayat yang lain diterangkan keadaan orang-orang musyrik di akhirat kelak. Mereka akan mengakui keesaan dan kekuasaan Allah di saat mereka mengalami siksaan yang pedih di dalam neraka dan berdoa meminta pertolongan-Nya agar dilepaskan dari siksaan itu. Allah berfirman:\n\nYa Tuhan kami, keluarkanlah kami darinya (kembalikanlah kami ke dunia), jika kami masih juga kembali (kepada kekafiran), sungguh, kami adalah orang-orang yang zalim.\" Dia (Allah) berfirman, \"Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.\" (al-Mu'minun\/23: 107-108)\n\nMuhammad bin Ishaq dalam kitab Sirah (tarikh Nabi Muhammad saw) meriwayatkan bahwa 'Ikrimah bin Abi Jahal berkata, \"Tatkala Rasulullah menaklukkan Mekah, aku lari daripadanya. Ketika aku naik kapal ke Habsyah, kapal itu terombang-ambing. Para penumpang kapal berkata, Hai teman-teman, berdoalah dengan ikhlas kepada Tuhanmu, sesungguhnya tidak ada yang dapat menyelamatkan kita dari bencana ini, kecuali dia.\" Selanjutnya 'Ikrimah berkata, \"Andaikata di laut tidak ada yang dapat menyelamatkan, kecuali Dia maka di darat pun tidak ada pula yang dapat menyelamatkan, kecuali Dia. Hai Tuhanku, aku berjanji kepadamu, jika aku keluar dari laut ini, maka aku akan pergi kepada Muhammad dan aku akan menyatakan keimananku kepadanya, maka akan kudapati dia seorang yang sangat pengasih dan penyayang, dan terlaksanalah janjiku itu.\"\n\nIkrimah juga berkata, \"Bangsa Jahiliah itu apabila menaiki kapal, berhala-berhala mereka juga ikut dibawa. Jika angin ribut datang, berhala-berhala itu dilemparkan ke laut, lalu mereka mengucapkan, \"Ya Tuhan, Ya Tuhan.\"\n\nAr-Razi mengatakan dalam bukunya, al-Lawami, \"Ini adalah suatu pertanda bahwa pengetahuan tentang Tuhan itu merupakan fitrah bagi manusia. Walaupun mereka lalai mengingat-Nya di waktu mereka bersuka ria, namun mereka mengingat-Nya di waktu kesusahan.\"",
      "text_translation": "Maka apabila mereka naik kapal, mereka berdoa kepada Allah dengan penuh rasa pengabdian (ikhlas) kepada-Nya, tetapi ketika Allah menyelamatkan mereka sampai ke darat, malah mereka (kembali) mempersekutukan (Allah), ",
      "text": "فَاِذَا رَكِبُوْا فِى الْفُلْكِ دَعَوُا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ ەۚ فَلَمَّا نَجّٰىهُمْ اِلَى الْبَرِّ اِذَا هُمْ يُشْرِكُوْنَۙ ",
      "text_translation_en": "And so, when they embark on a ship [and find themselves in danger], they call unto God, [at that moment] sincere in their faith in Him alone; but as soon as He has brought them safe ashore, they [begin to] ascribe to imaginary powers a share in His divinity:",
      "juz_number": 21
    },
    "66": {
      "text_tafsir_en": "This verse describes the consequences of the behavior of the monks in fellowship with God after being saved from disaster, and is a threat to their disbelief in His favor. In the last verse, God explains that after they were saved, they suddenly reunited with him, so the question arises why he saved them from the danger of drowning? Why was the ship and all its passengers not allowed to sink to the bottom of the sea, until their question was over? The answer is that it is only right that the Merciful, the Merciful respond to the prayer of His sincere, earnest prayer. They are saved as a test of their faith; whether they will remain in that faith or whether they will return to faith. It turned out that this test did not produce any results. After God saves them, they return. They do so because the horror has been rooted and rooted in their souls. This led them to disbelieve in the favor of God who had saved them from the drowning of the sea and made them live in disbelief. Therefore, God threatens them by saying that they will know the consequences of such actions. The phrase \"then they will know (the consequences of their actions)\" is a threat to the unbelievers, because the signs and power of God and the favor that has been bestowed upon them cannot convince them, even increase their ignorance. As if it were said to them, \"If they do not obey and do not change their behavior, they will know with certainty that the promised punishment will surely come to them.\" When that punishment had come upon them, all the gates of repentance were closed to them.",
      "text_tafsir": "Ayat ini menerangkan akibat dari perilaku kaum musyrik mempersekutukan Allah sesudah mereka diselamatkan dari bencana, dan merupakan ancaman atas kekafiran mereka kepada nikmat-Nya. Pada ayat yang lalu, Allah menerangkan bahwa setelah mereka selamat, tiba-tiba mereka kembali mempersekutukan-Nya, maka timbullah pertanyaan kenapa Ia menyelamatkan mereka dari bahaya tenggelam itu? Kenapa kapal itu beserta semua penumpangnya tidak dibiarkan tenggelam ke dasar laut, sehingga selesailah persoalan mereka?\n\nJawabannya adalah bahwa wajar kalau Allah Yang Maha Pengasih lagi Maha Penyayang itu memperkenankan doa dari hamba-Nya yang memohon dengan tulus ikhlas. Mereka diselamatkan adalah sebagai ujian bagi keimanan mereka; apakah mereka akan tetap dalam keimanan itu atau akan musyrik kembali.\n\nTernyata ujian ini tidak membawa hasil. Sesudah diselamatkan Allah, mereka musyrik kembali. Mereka bersikap demikian karena kemusyrikan telah berurat dan berakar dalam jiwa mereka. Hal itu mengakibatkan mereka kafir kepada nikmat Allah yang telah menyelamatkan mereka dari bencana tenggelam dalam laut dan membuat mereka hidup bersenang-senang dalam kekafiran. Oleh karena itu, Allah mengancam mereka dengan mengatakan bahwa kelak mereka akan mengetahui akibat dari perbuatan itu.\n\nKalimat \"maka kelak mereka akan mengetahui (akibat perbuatan mereka)\" ini mempunyai nada ancaman kepada orang-orang musyrik, karena tanda-tanda kekuasaan dan keesaan Allah serta nikmat yang telah dilimpahkan kepada mereka, tidak dapat meyakinkan mereka, bahkan menambah keingkaran mereka. Seakan-akan dikatakan kepada mereka, \"Apabila mereka lalai dan tidak mengubah tindak tanduk mereka, mereka akan mengetahui dengan yakin bahwa azab yang dijanjikan itu pasti menimpa mereka.\" Apabila azab itu telah menimpa mereka, maka semua pintu tobat telah tertutup bagi mereka.",
      "text_translation": "biarlah mereka mengingkari nikmat yang telah Kami berikan kepada mereka dan silakan mereka (hidup) bersenang-senang (dalam kekafiran). Maka kelak mereka akan mengetahui (akibat perbuatannya). ",
      "text": "لِيَكْفُرُوْا بِمَآ اٰتَيْنٰهُمْۙ وَلِيَتَمَتَّعُوْاۗ فَسَوْفَ يَعْلَمُوْنَ",
      "text_translation_en": "and thus they show utter ingratitude for all that We have vouchsafed them, and go on [thoughtlessly] enjoying their worldly life.",
      "juz_number": 21
    },
    "67": {
      "text_tafsir_en": "This verse reminds the Meccan monks of the blessings bestowed upon them. God distinguished them from the inhabitants of the surrounding countries by making the city of Mecca a peaceful, peaceful, and forbidden land for war there. God protected the country from enemies who would destroy and conquer it, just as it had been in the year of the birth of Prophet Muhammad. At that time, the army of Abraham's elephants was destroyed by God before they could touch the Ka'bah. Allah says: (1) Have you not observed how your Lord has acted upon the army? (2) Has He not made their deceit vain? (3) And He sent them birds of prey, (4) He cast them with stones from the clay; (al-Fil \/ 105: 1-5) In another verse he describes the state of Mecca and the life of the Quraysh. Allah says: (1) Because of the habits of the Quraysh, (2) (that is) their habit of traveling in winter and summer. (3) Then let them worship the Lord (owner) of this house (Ka'bah), (4) who has fed them to quench their hunger and secure them from fear. (Quraysh \/ 106: 1-4) On the other hand, the states around Mecca were insecure. There are so many robberies, murders, riots, and wars between nations, that people cannot feel the peace and security of their souls, their families, and their wealth. His people were always in a state of panic over the invasion. In this verse it is asked of the astrologers that they do not see the clear and obvious favor? Do they not feel a little that God has blessed them from the people around them. Why didn't they abandon the idolatry that defiled the Ka'bah? Indeed, the Meccans knew everything, but because of their disobedience, they believed in the falsehood and denied the favor of God. How low their minds are.",
      "text_tafsir": "Ayat ini mengingatkan orang-orang musyrik Mekah akan nikmat yang dilimpahkan kepada mereka. Allah mengistimewakan mereka dari penduduk negeri-negeri di sekitar mereka dengan menjadikan kota Mekah sebagai negeri yang aman, tenteram, dan diharamkan berperang di sana. Allah menjaga negeri itu dari musuh-musuh yang hendak menghancurkan dan menguasainya, seperti yang pernah terjadi pada tahun kelahiran Nabi Muhammad. Pada waktu itu, tentara Abrahah yang mengendarai gajah dihancurkan Allah sebelum mereka sempat menjamah Ka'bah.\n\nAllah berfirman:\n\n(1) Tidakkah engkau (Muhammad) perhatikan bagaimana Tuhanmu telah bertindak terhadap pasukan bergajah? (2) Bukankah Dia telah menjadikan tipu daya mereka itu sia-sia? (3) dan Dia mengirimkan kepada mereka burung yang berbondong-bondong, (4) yang melempari mereka dengan batu dari tanah liat yang dibakar, (5) sehingga mereka dijadikan-Nya seperti daun-daun yang dimakan (ulat). (al-Fil\/105: 1-5)\n\nDalam ayat yang lain diterangkan keadaan kota Mekah dan kehidupan orang-orang Quraisy. Allah berfirman:\n\n(1) Karena kebiasaan orang-orang Quraisy, (2) (yaitu) kebiasaan mereka bepergian pada musim dingin dan musim panas. (3) Maka hendaklah mereka menyembah Tuhan (pemilik) rumah ini (Ka'bah), (4) yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari rasa ketakutan. (Quraisy\/106: 1-4)\n\nDi sisi lain, negeri-negeri yang berada di sekitar Mekah dalam keadaan tidak aman. Sering terjadi perampokan, pembunuhan, kekacauan, dan peperangan antar kabilah, sehingga orang tidak dapat merasakan kedamaian dan keamanan atas jiwa, keluarga, dan hartanya. Setiap saat penduduknya selalu berada dalam keadaan khawatir diserbu musuh. Pada ayat ini dipertanyakan kepada orang-orang musyrik itu bahwa apakah mereka tidak melihat nikmat yang jelas dan nyata itu? Apakah mereka tidak merasakan sedikit juga bahwa Allah telah mengistimewakan mereka dari penduduk negeri di sekitar mereka. Kenapa mereka tidak meninggalkan penyembahan berhala yang mengotori Ka'bah itu? Sebenarnya orang Mekah telah mengetahui semuanya, tetapi karena keingkaran, mereka mempercayai yang batil dan mengingkari nikmat Allah. Alangkah rendahnya akal mereka.",
      "text_translation": "Tidakkah mereka memperhatikan, bahwa Kami telah menjadikan (negeri mereka) tanah suci yang aman, padahal manusia di sekitarnya saling merampok. Mengapa (setelah nyata kebenaran) mereka masih percaya kepada yang batil dan ingkar kepada nikmat Allah? ",
      "text": "اَوَلَمْ يَرَوْا اَنَّا جَعَلْنَا حَرَمًا اٰمِنًا وَّيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْۗ اَفَبِالْبَاطِلِ يُؤْمِنُوْنَ وَبِنِعْمَةِ اللّٰهِ يَكْفُرُوْنَ",
      "text_translation_en": "Are they, then, not aware that We have set up a sanctuary secure [for those who believe in Us], the while all around them men are being carried away [by fear and despair]? Will they, then, [continue to] believe in things false and vain, and thus deny God’s blessings.",
      "juz_number": 21
    },
    "68": {
      "text_tafsir_en": "This verse explains that the unbelievers were very cruel, for making allies for God and saying that He had children. They are the ones who make lies against Allah and become His enemies. They made statues, then worshiped them to draw near to God. God spoke of the faith of the unbelievers in his word: Remember! Only Allah's pure religion (from shirk). And those who take refuge besides Him (say), \"We do not worship them but hope that they may bring us closer to Allah.\" Indeed, Allah will decide between them what they disagree with. Truly, God does not give guidance to liars and people who are very rebellious. (az-Zumar \/ 39: 3) When there came to them an apostle of Allah, explaining their falsehoods and falsehoods, and showing them a straight path based on truth, they denied it and denied it all. They even denied all the favors of Allah that they had ever been given. Indeed, those unbelievers have committed the greatest sin of no equal in this world. There is no right answer for them except the torment of Hell in the hereafter and that is the proper place for them.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang musyrik itu adalah orang yang sangat zalim, karena mengada-adakan sekutu bagi Allah dan mengatakan bahwa Dia mempunyai anak. Mereka adalah orang-orang yang membuat-buat kedustaan terhadap Allah dan menjadi musuh-Nya. Mereka membuat patung-patung, kemudian menyembahnya untuk mendekatkan diri kepada Allah.\n\nAllah menceritakan kepercayaan kaum musyrik itu dalam firman-Nya:\n\nIngatlah! Hanya milik Allah agama yang murni (dari syirik). Dan orang-orang yang mengambil pelindung selain Dia (berkata), \"Kami tidak menyembah mereka melainkan (berharap) agar mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya.\" Sungguh, Allah akan memberi putusan di antara mereka tentang apa yang mereka perselisihkan. Sungguh, Allah tidak memberi petunjuk kepada pendusta dan orang yang sangat ingkar. (az-Zumar\/39: 3)\n\nSetelah datang kepada mereka seorang rasul Allah yang menerangkan kebatilan dan kepalsuan perbuatan mereka, dan menunjukkan jalan yang lurus berdasarkan kebenaran, mereka mengingkari dan mendustakan semuanya. Bahkan mereka mengingkari semua nikmat Allah yang pernah diberikan kepada mereka.\n\nSesungguhnya orang-orang musyrik itu telah berbuat dosa yang paling besar yang tidak ada tandingannya di dunia ini. Tiada balasan yang tepat bagi mereka kecuali azab neraka Jahanam di akhirat nanti dan itulah tempat yang wajar bagi mereka.",
      "text_translation": "Dan siapakah yang lebih zalim daripada orang yang mengada-adakan kebohongan kepada Allah atau orang yang mendustakan yang hak ketika (yang hak) itu datang kepadanya? Bukankah dalam neraka Jahanam ada tempat bagi orang-orang kafir? ",
      "text": "وَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰى عَلَى اللّٰهِ كَذِبًا اَوْ كَذَّبَ بِالْحَقِّ لَمَّا جَاۤءَهٗ ۗ اَلَيْسَ فِيْ جَهَنَّمَ مَثْوًى لِّلْكٰفِرِيْنَ",
      "text_translation_en": "And who could be more wicked than he who attributes his own lying inventions to God, or gives the lie to the truth when it comes unto him [through revelation]? Is not hell the [proper] abode for all who [thus] deny the truth?",
      "juz_number": 21
    },
    "69": {
      "text_tafsir_en": "This verse describes God's glorious promise to believers who fight in his path by sacrificing their souls and their wealth and suffering torture and resistance. Therefore, Allah will give them guidance, help them to unite their determination, and give them help, so that they may gain the victory of the world and happiness and glory in the hereafter. Allah says: (That is) those who were driven out of their hometown for no good reason, just because they said, \"Our Lord is God.\" If God had not rejected (violence) some people with others, it would have demolished the Christian monasteries, churches, Jewish houses of worship and mosques, many of which were called by the name of God. Allah will surely help those who help (His) religion. Indeed, Allah is Mighty, Mighty. (al-hajj \/ 22: 40) The meaning of jihad in verse 69 is to make every effort to uphold the religion of Allah and exalt His word, as well as to fight against the heathen who fight against the Muslims. According to Abu Sulaiman ad-Darani, jihad here is not just about fighting the unbelievers, but also defending the religion, and eradicating injustice. The main thing is to encourage the work of the court, forbid it from doing wrong, and fight against lust in order to obey God's command. Those who fight jihad are promised by Allah a free way. This promise is bound to be fulfilled, as He says: And verily We sent before thee (Muhammad) a people to his people, they came to him with (sufficient) evidence, and We executed vengeance on those who sinful. And it is Our right to help those who believe. (ar-Romans \/ 30: 47) In this verse it is explained that those who fight in the way of Allah are those who do good (muhsin). This means that all kinds of acts, as God has stated in the jihad, are good deeds. Named that because those who fight jihad always walk in the way of Allah. People who do not want to fight jihad are bad people, because they have rebelled against God's command to do jihad. That man is a pervert, because he does not want to see the straight path that he has laid down. In this verse it is stated that God is always with those who fight in His way, fight against lust, expel all evil whispers of his heart, and never waste his religious teachings. This statement can soften the hearts of believers in the face of unbelievers and arouse their fighting spirit in His way. This verse explains that those who fight for the will of Allah will surely show them His way. From this verse it is understood that a broad field of jihad can be implemented in a variety of ways, in the form of words, writings, and in certain situations can be done with weapons. Because the vastness of the jihadist field is huge and the path that a believer can take to reach the Messenger of Allah, the origin of all of these paths is to uphold the truth, justice, and goodness.",
      "text_tafsir": "Ayat ini menerangkan janji yang mulia dari Allah kepada orang-orang mukmin yang berjihad di jalan-Nya dengan mengorbankan jiwa dan hartanya serta menanggung siksaan dan rintangan. Oleh karena itu, Allah akan memberi mereka petunjuk, membantu mereka membulatkan tekad, dan memberikan bantuan, sehingga mereka memperoleh kemenangan di dunia serta kebahagiaan dan kemuliaan di akhirat kelak.\n\nAllah berfirman:\n\n(Yaitu) orang-orang yang diusir dari kampung halamannya tanpa alasan yang benar, hanya karena mereka berkata, \"Tuhan kami ialah Allah.\" Seandainya Allah tidak menolak (keganasan) sebagian manusia dengan sebagian yang lain, tentu telah dirobohkan biara-biara Nasrani, gereja-gereja, rumah-rumah ibadah orang Yahudi dan masjid-masjid, yang di dalamnya banyak disebut nama Allah. Allah pasti akan menolong orang yang menolong (agama)-Nya. Sungguh, Allah Mahakuat, Mahaperkasa. (al-hajj\/22: 40)\n\nMakna jihad dalam ayat 69 ini ialah melakukan segala macam usaha untuk menegakkan agama Allah dan meninggikan kalimat-Nya, termasuk juga memerangi orang-orang kafir yang memerangi umat Islam. Menurut Abu Sulaiman ad-Darani, jihad di sini bukan berarti memerangi orang-orang kafir saja, melainkan juga berarti mempertahankan agama, dan memberantas kezaliman. Adapun yang utama ialah menganjurkan perbuatan makruf, melarang dari perbuatan yang mungkar, dan memerangi hawa nafsu dalam rangka menaati perintah Allah.\n\nMereka yang berjihad itu dijanjikan Allah jalan yang lapang. Janji ini pasti akan terlaksana, sebagaimana firman-Nya:\n\nDan sungguh, Kami telah mengutus sebelum engkau (Muhammad) beberapa orang rasul kepada kaumnya, mereka datang kepadanya dengan membawa keterangan-keterangan (yang cukup), lalu Kami melakukan pembalasan terhadap orang-orang yang berdosa. Dan merupakan hak Kami untuk menolong orang-orang yang beriman. (ar-Rum\/30: 47)\n\nDalam ayat ini diterangkan bahwa orang-orang yang berjihad di jalan Allah itu adalah orang-orang yang berbuat baik (muhsin). Hal ini berarti bahwa segala macam perbuatan, sesuai dengan yang digariskan Allah dalam berjihad itu, adalah perbuatan baik. Dinamakan demikian karena orang-orang yang berjihad itu selalu berjalan di jalan Allah. Orang-orang yang tidak mau berjihad adalah orang yang tidak baik, sebab ia telah membangkang terhadap perintah Allah untuk melakukan jihad. Orang itu adalah orang yang sesat, karena tidak mau meniti jalan lurus yang telah dibentangkan-Nya.\n\nDalam ayat ini dinyatakan bahwa Allah selalu beserta orang-orang yang berperang di jalan-Nya, memerangi hawa nafsu, mengusir semua bisikan setan dari hatinya, dan tidak pernah menyia-nyiakan ajaran agama-Nya. Pernyataan ini dapat menenteramkan hati orang yang beriman dalam menghadapi orang-orang kafir dan membangkitkan semangat mereka berjuang di jalan-Nya.\n\nAyat ini menerangkan bahwa orang-orang yang berjihad untuk mencari keridaan Allah, pasti akan ditunjukkan kepada mereka jalan-Nya. Dari ayat ini dipahami bahwa lapangan jihad yang luas bisa dilaksanakan dengan berbagai cara, berupa perkataan, tulisan, dan pada situasi tertentu dapat dilakukan dengan senjata. Karena luas dan banyaknya lapangan jihad berarti banyak sekali jalan-jalan yang dapat ditempuh seorang mukmin untuk sampai kepada keridaan Allah, asal semua jalan itu diniatkan untuk menegakkan kebenaran, keadilan, dan kebaikan.",
      "text_translation": "Dan orang-orang yang berjihad untuk (mencari keridaan) Kami, Kami akan tunjukkan kepada mereka jalan-jalan Kami. Dan sungguh, Allah beserta orang-orang yang berbuat baik.",
      "text": "وَالَّذِيْنَ جَاهَدُوْا فِيْنَا لَنَهْدِيَنَّهُمْ سُبُلَنَاۗ وَاِنَّ اللّٰهَ لَمَعَ الْمُحْسِنِيْنَ ࣖ ",
      "text_translation_en": "But as for those who strive hard in Our cause -We shall most certainly guide them onto paths that lead unto Us: for, behold, God is indeed with the doers of good.",
      "juz_number": 21
    }
  },
  "name": "العنكبوت",
  "name_translation_en": "The Spider",
  "name_translation": "Laba-Laba",
  "name_latin": "Al-'Ankabut"
}