{
  "number": 31,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 34,
  "ayat": {
    "1": {
      "text_tafsir_en": "This Surah Luqman starts with the hijaiyah letters \"Alif Lam Mim\". Next look at Alif Lam Mim's interpretation in volume I.",
      "text_tafsir": "Surah Luqman ini dimulai dengan huruf-huruf hijaiyah \"Alif Lam Mim\". Selanjutnya lihat tafsir Alif Lam Mim pada jilid I.",
      "text_translation": "Alif Lam Mim.",
      "text": " الۤمّۤ ۗ ",
      "text_translation_en": "Alif. Lam. Mim.",
      "juz_number": 21
    },
    "2": {
      "text_tafsir_en": "This verse explains that the verses of the Qur'an are neatly and carefully arranged, in a language of high literary value, and with great purpose and dignity for the people who follow his instructions. It does not contain any defects, blemishes, and even minor deficiencies. Also none of his verses contradict each other. His commandments are easy to carry out by anyone, in any situation and wherever they may be.",
      "text_tafsir": "Ayat ini menerangkan bahwa ayat-ayat Al-Qur'an itu disusun dengan rapi dan teliti, dengan gaya bahasa yang tinggi nilai sastranya, dan dengan tujuan yang agung dan mulia bagi manusia yang mengikuti petunjuk-petunjuknya. Tidak terdapat di dalamnya cacat, cela, dan kekurangan walaupun sedikit. Juga tidak ada satu pun dari ayat-ayatnya yang bertentangan satu sama lain. Perintah-perintahnya mudah dilaksanakan oleh siapa pun, dalam keadaan bagaimanapun dan di mana pun ia berada.",
      "text_translation": "Inilah ayat-ayat Al-Qur'an yang mengandung hikmah, ",
      "text": "تِلْكَ اٰيٰتُ الْكِتٰبِ الْحَكِيْمِۙ ",
      "text_translation_en": "THESE ARE MESSAGES of the divine writ, full of wisdom,",
      "juz_number": 21
    },
    "3": {
      "text_tafsir_en": "These verses emphasize that the Qur'anic verses contain guidance for mankind in navigating all aspects of life in the world that lead and lead them to the happiness of living in the hereafter. If man opened the historical sheets from ancient times to the present, he would conclude that by ordering the Prophet Muhammad by bringing the Qur'an containing the various leaflets he brought, the doors of virtue were opened to the universe. With that in mind, it is constantly evolving with all its branches. Although there has been high culture as a result of human thought in earlier times, such as the culture of ancient Egypt, Babylon, Greece, etc., all of which do not yet have strong and solid fundamentals for further and perfect human development in the future. . In the realm of human life and life, the Qur'an provides guidance for human beings to maintain a balance between physical and spiritual life, as well as the balance in achieving earthly and secular life. Similarly, in community and national life, what is lawful and good is edible and what is bad is not edible. There is also a great way to talk and get along and so on. The Qur'an gives guidance and rules, and then man manipulates and adapts to his environment based on those rules and rules, which is best and right to do, and which should be avoided and abandoned. The people who think, ponder, practice, and practice the Qur'anic principles are the \"people of the muhsin\".",
      "text_tafsir": "Ayat-ayat ini menegaskan bahwa ayat-ayat Al-Qur'an berisi petunjuk-petunjuk bagi manusia dalam mengarungi semua sisi kehidupan di dunia yang mengantar dan memimpinnya mencapai kebahagiaan hidup di akhirat kelak.\n\nJika manusia membuka lembaran-lembaran sejarah dari zaman dahulu sampai sekarang, ia akan berkesimpulan bahwa dengan diutusnya Nabi Muhammad oleh Allah dengan membawa Al-Qur'an yang berisi pokok-pokok risalah yang dibawanya, maka terbukalah pintu-pintu kebajikan bagi semesta alam. Dengan hal itu, bertambah pulalah perkembangan ilmu pengetahuan dengan segala macam cabangnya.\n\nSekalipun telah ada kebudayaan yang tinggi sebagai hasil pemikiran manusia pada periode sebelum ini, seperti kebudayaan Mesir kuno, Babilonia, Yunani, dan sebagainya, namun semua itu belum mempunyai dasar-dasar yang kuat dan kukuh untuk mencapai perkembangan manusia lebih lanjut dan sempurna di kemudian hari.\n\nDalam bidang hidup dan kehidupan manusia, Al-Qur'an memberi petunjuk agar manusia menjaga keseimbangan antara kehidupan jasmani dan rohani, serta keseimbangan dalam mencapai kehidupan duniawi dan ukhrawi. Demikian pula dalam hidup bermasyarakat dan bernegara, apa yang halal dan baik untuk dimakan boleh dimakan dan apa yang tidak baik jangan dimakan. Juga terdapat tuntunan cara berbicara dan bergaul yang baik dan sebagainya. Al-Qur'an memberi petunjuk dan aturannya, kemudian manusia mengolah dan menyesuaikan dirinya dengan alam sekelilingnya berdasarkan petunjuk dan aturan itu, mana yang paling baik dan tepat untuk dilaksanakan, dan mana yang harus dijauhi dan ditinggalkan. Orang-orang yang memikirkan, merenungkan, mengolah, dan mengamalkan petunjuk-petunjuk Al-Qur'an dengan sebaik-baiknya adalah \"orang-orang yang muhsin\".",
      "text_translation": "sebagai petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan, ",
      "text": "هُدًى وَّرَحْمَةً لِّلْمُحْسِنِيْنَۙ ",
      "text_translation_en": "providing guidance and grace unto the doers of good",
      "juz_number": 21
    },
    "4": {
      "text_tafsir_en": "In these verses it is stated that among the signs of the righteous person are: 1. Always perform the five daily prayers which are required to him at any given time. He always tried to perform the prayer as well as possible complete with harmony and its conditions. 2. Always pay zakat if the required conditions have been fulfilled. He believes that the payment of zakat is an obligation because in his property there are other people's rights that must be immediately surrendered. 3. Confident that there is life after death, that is, in the afterlife. In the afterlife, every human will get perfect justice from God. Good works are rewarded with heaven and evil deeds are rewarded with the torments of hell.",
      "text_tafsir": "Pada ayat-ayat ini disebutkan bahwa di antara tanda-tanda orang yang muhsin itu adalah:\n\n1. Selalu mengerjakan salat lima waktu yang diwajibkan kepadanya pada setiap waktu yang telah ditentukan. Ia selalu berusaha untuk melaksanakan salat itu dengan sebaik-baiknya lengkap dengan rukun dan syaratnya.\n\n2. Selalu menunaikan zakat jika telah terpenuhi syarat-syarat wajibnya. Ia yakin bahwa menunaikan zakat itu adalah kewajiban karena dalam hartanya itu terdapat hak orang lain yang harus segera diserahkan.\n\n3. Yakin bahwa masih ada hidup sesudah mati, yaitu di akhirat. Pada kehidupan akhirat itu setiap manusia akan memperoleh keadilan yang sempurna dari Allah. Perbuatan baik di balas dengan surga dan perbuatan jahat dibalas dengan siksaan neraka.",
      "text_translation": "(yaitu) orang-orang yang melaksanakan salat, menunaikan zakat dan mereka meyakini adanya akhirat. ",
      "text": "الَّذِيْنَ يُقِيْمُوْنَ الصَّلٰوةَ وَيُؤْتُوْنَ الزَّكٰوةَ وَهُمْ بِالْاٰخِرَةِ هُمْ يُوْقِنُوْنَۗ ",
      "text_translation_en": "who are constant in prayer and dispense charity: for it is they, they who in their innermost are certain of the life to come!",
      "juz_number": 21
    },
    "5": {
      "text_tafsir_en": "The people who have the signs and attributes mentioned in the previous verses are those who follow the guidance of their God. He was fortunate to have a good and happy result, after working and trying to follow the Qur'anic guidelines. A virtuous person will have the good fortune of living in the world and in the hereafter, and that is achieved by doing good deeds.",
      "text_tafsir": "Orang-orang yang mempunyai tanda-tanda dan sifat-sifat yang disebutkan pada ayat-ayat yang lalu adalah orang-orang yang mengikuti petunjuk Tuhannya. Ia mendapatkan keberuntungan karena memperoleh hasil yang baik dan menyenangkan hatinya, setelah bekerja dan berusaha mengikuti petunjuk-petunjuk Al-Qur'an. Seorang yang beramal saleh akan mendapatkan keberuntungan hidup di dunia dan di akhirat nanti, dan hal itu diperoleh dengan melakukan perbuatan yang baik.",
      "text_translation": "Merekalah orang-orang yang tetap mendapat petunjuk dari Tuhannya dan mereka itulah orang-orang yang beruntung. ",
      "text": "اُولٰۤىِٕكَ عَلٰى هُدًى مِّنْ رَّبِّهِمْ وَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ",
      "text_translation_en": "It is they who follow the guidance [that comes to them] from their Sustainer; and it is they, they who shall attain to a happy state!",
      "juz_number": 21
    },
    "6": {
      "text_tafsir_en": "This verse explains that some people ignore the helpful words, which can increase people's confidence in religion and improve their morals. They would rather say words that are of no avail, tell tales, tell tales of people, past jokes, and meaningless jokes. Examples include Nadhar bin haris, buying Persian-language books containing stories, and then mocking them to the Quraysh. If necessary, they hire singers to make their voices heard. The content of the song and its voice were created in such a way that it would stimulate the listener to perform forbidden acts, and further away from religion. Nafi, may Allah be pleased with him, reported, \"I was traveling with 'Abdullah bin' Umar on a trip, and heard a flute. 'Abdullah put his finger in the earlobe, so as not to hear the sound of the flute and he turned the other way. he said, \"Do you hear the voice?\" I replied, 'No. Then he put his finger out of his ear and said,' This is what I saw when the Messenger of Allah (may peace be upon him) heard such a sound. ' In another story of 'Abdurrahman bin' Auf that the Messenger of Allah (may peace be upon him) said: I prohibited (listening) two kinds of meaningless (stirring) voices and causing evil acts, namely, the sound of a melodious song and demonic flutes and (two) voices when disaster strikes, it is slapping, ripping clothes, and demon singing. (History at-Tirmidzi) According to Ibn Mas'ud, the word lahw al-hadith is referred to in this verse as singing because it can cause hypocrisy in the heart. Some scholars say that all sounds, words, chants, sounds that can disrupt obedience to God and encourage those who hear it to do something forbidden, are called al-Hadith. From the above verses and hadiths it can be deduced that the prohibition is to listen to a song that can arouse one's passions and lead to adultery, such as a song containing dirty words. It also includes singing or music that causes the listener to perform illicit acts, such as drinking in the room and so on. Listening to songs or music intended to relax your mind during breaks or holidays is prohibited. They are even asked to listen if the song or music has good meaning, increase their faith, improve their morals, and increase their work and struggle. Qusyairi said, \"He was laid on a tambourine before the Prophet saw when he entered Medina, and then Abu Bakr wanted to stop it. The Messenger of Allah (may peace be upon him) said: 'Let them plant a tambourine, Abu Bakr, until the Jews know that our religion is not narrow. sang the tambourine accompanied by chants and hymns, among the verses that read: \"Nahnu banatun Najjar, habbadha Muhammadun min jar\" (we are the Bani Najjar girls, how fortunate we would be if Muhammad were our neighbors). \" In this verse, God describes the effects of hearing and listening to forbidden songs, music, and words. They will suffer the most humiliating torment on the Day of Judgment for their acts of disrespect for the right and for the sake of falsehood, and for changing the direction of sin.",
      "text_tafsir": "Ayat ini menerangkan bahwa di antara manusia ada yang tidak menghiraukan perkataan yang bermanfaat, yang dapat menambah keyakinan manusia kepada agama dan memperbaiki budi pekertinya. Mereka lebih suka mengatakan perkataan-perkataan yang tidak ada manfaatnya, menyampaikan khurafat-khurafat, dongengan-dongengan orang masa lalu, lelucon-lelucon yang tidak ada artinya. Di antara contohnya adalah seperti yang dilakukan Nadhar bin haris, dengan cara membeli buku-buku berbahasa Persia yang berisi cerita-cerita, kemudian dia mencemoohkannya kepada orang-orang Quraisy. Kalau perlu, mereka menggaji penyanyi-penyanyi untuk diperdengarkan suaranya kepada orang banyak. Isi nyanyian dan suaranya itu dibuat sedemikian rupa sehingga dapat merangsang orang yang mendengarkannya untuk melakukan perbuatan-perbuatan yang dilarang, dan makin menjauhkannya dari agama.\n\nDiriwayatkan dari Nafi', ia berkata, \"Aku berjalan bersama 'Abdullah bin 'Umar dalam suatu perjalanan, maka terdengar bunyi seruling. 'Abdullah lalu meletakkan jarinya ke lubang telinga, agar tidak mendengar bunyi seruling itu dan ia berbelok melalui jalan yang lain. Kemudian ia berkata, Nafi apakah engkau masih mendengar suara itu? Aku menjawab, 'Tidak. Maka ia mengeluarkan anak jarinya dari telinganya dan berkata, 'Beginilah aku melihat yang diperbuat Rasulullah saw jika mendengar bunyi semacam itu.\"\n\nPada riwayat yang lain dari 'Abdurrahman bin 'Auf bahwa Rasulullah saw bersabda:\n\nAku dilarang (mendengarkan) dua macam suara (bunyi) yang tidak ada artinya dan menimbulkan perbuatan jahat, yaitu suara lagu yang melalaikan dan seruling-seruling setan dan (kedua) suara ketika ditimpa musibah, yaitu yang menampar muka, mengoyak-ngoyak baju, dan nyanyian setan. (Riwayat at-Tirmidzi)\n\nMenurut Ibnu Mas'ud, yang dimaksud dengan perkataan lahw al-hadis dalam ayat ini ialah nyanyian karena ia dapat menimbulkan kemunafikan di dalam hati. Sebagian ulama mengatakan bahwa semua suara, perkataan, nyanyian, bunyi-bunyian yang dapat merusak ketaatan kepada Allah dan mendorong orang-orang yang mendengarnya melakukan perbuatan yang terlarang, disebut lahw al-hadis.\n\nDari ayat dan hadis-hadis di atas dapat diambil kesimpulan bahwa yang dilarang itu ialah mendengarkan nyanyian yang dapat membangkitkan nafsu birahi dan menjurus ke perbuatan zina, seperti nyanyian yang berisi kata-kata kotor. Termasuk juga nyanyian atau musik yang menyebabkan pendengarnya mengerjakan perbuatan-perbuatan terlarang, seperti minum khamar dan sebagainya.\n\nMendengar nyanyian atau musik yang tujuannya untuk melapangkan pikiran pada waktu istirahat atau hari raya tidak dilarang. Bahkan disuruh mendengarkannya jika nyanyian atau musik itu mempunyai arti yang baik, menambah iman, memperbaiki budi pekerti, dan menambah semangat bekerja dan berjuang.\n\nQusyairi berkata, \"Ditabuh rebana di hadapan Nabi saw ketika beliau memasuki kota Medinah, lalu Abu Bakar ingin menghentikannya, maka Rasulullah saw berkata, 'Biarkanlah mereka menabuh rebana, hai Abu Bakar, hingga orang-orang Yahudi mengetahui bahwa agama kita tidak sempit. Mereka menabuh rebana disertai dengan nyanyian-nyanyian dan syair-syair, di antara bait-baitnya berbunyi: \"Nahnu banatun Najjar, habbadha Muhammadun min jar\" (kami adalah perempuan-perempuan Bani Najjar, alangkah baiknya nasib kami jika Muhammad menjadi tetangga kami).\"\n\nPada ayat ini, Allah menerangkan akibat mendengar dan memperdengarkan nyanyian, musik, dan perkataan yang terlarang. Mereka akan memperoleh azab yang sangat menghinakan di hari Kiamat akibat perbuatan mereka yang tidak mengindahkan yang hak dan memilih kebatilan, serta menukar petunjuk dengan dosa.",
      "text_translation": "Dan di antara manusia (ada) orang yang mempergunakan percakapan kosong untuk menyesatkan (manusia) dari jalan Allah tanpa ilmu dan menjadikannya olok-olokan. Mereka itu akan memperoleh azab yang menghinakan.",
      "text": "وَمِنَ النَّاسِ مَنْ يَّشْتَرِيْ لَهْوَ الْحَدِيْثِ لِيُضِلَّ عَنْ سَبِيْلِ اللّٰهِ بِغَيْرِ عِلْمٍۖ وَّيَتَّخِذَهَا هُزُوًاۗ اُولٰۤىِٕكَ لَهُمْ عَذَابٌ مُّهِيْنٌ",
      "text_translation_en": "But among men there is many a one that prefers a mere play with words [to divine guidance], so as to lead [those] without knowledge astray from the path of God, and to turn it to ridicule: for such there is shameful suffering in store.",
      "juz_number": 21
    },
    "7": {
      "text_tafsir_en": "In this verse, God describes the nature of those who exchange the books of God with useless fables. When the verses of Allah were read to them, they turned their backs on the arrogant and arrogant, as if they had not heard them because their ears were clogged and deaf. In another verse Allah says: Say, \"The Qur'an is a guide and a healer for the believers. (Fushshilat \/ 41: 44) Because of that, they will have a painful torment in the hereafter, in return for their actions and actions.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan sifat-sifat orang-orang yang menukar kitab-kitab Allah dengan dongengan-dongengan yang tidak berguna. Apabila dibacakan kepada mereka ayat-ayat Allah, mereka membelakanginya dengan sikap angkuh dan sombong, seakan-akan mereka tidak mendengarnya karena telinga mereka telah tersumbat dan tuli.\n\nPada ayat yang lain Allah berfirman:\n\nKatakanlah, \"Al-Qur'an adalah petunjuk dan penyembuh bagi orang-orang yang beriman. Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan (Al-Qur'an) itu merupakan kegelapan bagi mereka. (Fushshilat\/41: 44) \n\nKarena perbuatan itu, mereka akan mendapat azab yang pedih di akhirat. Itu sebagai balasan dari perbuatan dan tindakan mereka.",
      "text_translation": "Dan apabila dibacakan kepadanya ayat-ayat Kami, dia berpaling dengan menyombongkan diri seolah-olah dia belum mendengarnya, seakan-akan ada sumbatan di kedua telinganya, maka gembirakanlah dia dengan azab yang pedih.",
      "text": "وَاِذَا تُتْلٰى عَلَيْهِ اٰيٰتُنَا وَلّٰى مُسْتَكْبِرًا كَاَنْ لَّمْ يَسْمَعْهَا كَاَنَّ فِيْٓ اُذُنَيْهِ وَقْرًاۚ فَبَشِّرْهُ بِعَذَابٍ اَلِيْمٍ",
      "text_translation_en": "For, whenever Our messages are conveyed to such a one, he turns away in his arrogance as though he had not heard them - as though there were deafness in his ears. Give him, then, the tiding of grievous suffering [in the life to come].",
      "juz_number": 21
    },
    "8": {
      "text_tafsir_en": "This verse explains that for those who believe in Allah, justify the apostles, and perform righteous deeds, either in the book of His revelation or the words of the apostles, stop all that He forbids, not listen to songs, , and all kinds of sounds that can destroy faith, diminish obedience, and lead to a path that leads to evil deeds, is a paradise full of pleasure. It contains all kinds of pleasures, such as food, drinks, clothes, rooms, and so on.",
      "text_tafsir": "Ayat ini menerangkan bahwa bagi orang-orang yang beriman kepada Allah, membenarkan para rasul, dan mengerjakan amal saleh, baik yang terdapat di dalam kitab yang diturunkan-Nya maupun yang disampaikan oleh rasul, menghentikan semua yang dilarang-Nya, tidak mendengarkan nyanyian, dongengan, dan segala macam bunyi-bunyian yang dapat merusak iman, me-ngurangi ketaatan, dan membawa ke jalan yang menjurus kepada perbuatan jahat, disediakan surga yang penuh kenikmatan. Di dalamnya terdapat segala macam kesenangan yang diinginkan, seperti makanan, minuman, pakaian, kamar-kamar, dan sebagai-nya.",
      "text_translation": "Sesungguhnya orang-orang yang beriman dan mengerjakan kebajikan, mereka akan mendapat surga-surga yang penuh kenikmatan, ",
      "text": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ جَنّٰتُ النَّعِيْمِۙ",
      "text_translation_en": "[As against this,] verily, those who attain to faith and do righteous deeds shall have gardens of bliss,",
      "juz_number": 21
    },
    "9": {
      "text_tafsir_en": "They remain in heaven forever. All of this is God's promise to His creatures, which is certain to happen, and will never be denied. On the other hand, the severity of the punishment He inflicts on those who are sinful and hinders mankind from following His way. Allah is Wise in managing and dealing with all of His creatures.",
      "text_tafsir": "Mereka kekal di dalam surga itu selama-lamanya. Semua itu adalah janji Allah kepada makhluk-Nya, yang pasti terjadi, dan tidak akan dimungkiri sedikit pun. Di sisi lain, sangat keras pula azab yang ditimpakan-Nya kepada orang-orang yang berdosa dan menghalangi manusia menempuh jalan-Nya. Allah Maha Bijaksana dalam mengurus dan menyelesaikan segala urusan makhluk-Nya.",
      "text_translation": "mereka kekal di dalamnya, sebagai janji Allah yang benar. Dan Dia Mahaperkasa, Mahabijaksana. ",
      "text": "خٰلِدِيْنَ فِيْهَاۗ وَعْدَ اللّٰهِ حَقًّاۗ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ",
      "text_translation_en": "to abide therein in accordance with God’s true promise: for He alone is almighty, truly wise.",
      "juz_number": 21
    },
    "10": {
      "text_tafsir_en": "This verse explains some of the signs and evidence of God's power found in this world, namely: 1. Creating the universe with all kinds of contents, in the form of countless planets. Many planets are big balls floating in the vast sky. In this verse it says \"without pillars as you see\". From these words it can be understood that the sky has a pillar, which is a force that supports it and functions as a pillar, so that the planets do not fall scattered. Only those who film can see the solid pillars with their inner knowledge. 2. God created mountains on the surface of the earth so that the earth is stable, not shaking, so that humans, animals and plants can live peacefully on it. The mountain seemed to be a peg that could strengthen the surface of the earth as well as the masts of a towering ship, which could stabilize the ship sailed and anchored in the middle of the ocean, so that he did not wry. In addition, mountains also have other benefits for humans, including regulating the distribution and distribution of rain water poured from the sky, so that water remains on the surface of the earth despite the dry season. Many more benefits of mountains for humans and other creatures of God. 3. God created an animal whose numbers and types, shapes and colors cannot be counted, from the large to the small so that they are invisible to the eye. All animals created have benefits and benefits. Sometimes humans, because they do not know the benefits and uses of these animals, they kill and crush them, so that without them realizing there arises damage in nature. However, Allah knows for certain the number, type, color, usefulness, and benefits of all the animals He has created. 4. God sends rain from the sky. The rain came from the clouds that He dispelled to a certain place, then turned into rain that wet the surface of the earth. With rain water, grow all kinds of diverse plants, with beautiful colors and many benefits. According to scientists, the sky is in reality, as wide as the eye can see, not a single pillar supports it. Human logic requires that there be a supporting pole so that it does not collapse. However, God with His power is able to do beyond the reach of human logic. Humans and all creatures that live on earth are under the earth's gravitational system. Thus, they can be stable doing their work on earth, not floating in the air. When out of the earth entered the world that does not gravitate, humans also know that there are all things to hover without weight, including humans themselves. It is really easy for God to make anything according to His will, including making the sky \"light\" without weight so that no pillars are needed to support it. But can it also be considered that the force fields that exist in the universe are \"virtual poles\" that are invisible to the eye?",
      "text_tafsir": "Ayat ini menerangkan beberapa tanda dan bukti kekuasaan Allah yang terdapat di alam ini, yaitu:\n\n1. Menciptakan alam semesta dengan segala macam isinya, berupa planet-planet yang tidak terhitung jumlahnya. Planet-planet yang banyak itu merupakan bola-bola besar yang terapung di angkasa luas. Dalam ayat ini disebutkan \"tanpa tiang sebagaimana kamu lihat\". Dari perkataan ini dapat dipahami bahwa langit itu mempunyai tiang, yakni satu kekuatan yang menopangnya dan berfungsi sebagai tiang, sehingga planet-planet itu tidak jatuh berserakan. Hanya orang-orang yang berilmulah yang dapat melihat tiang-tiang yang kukuh itu dengan ilmu batiniah mereka.\n\n2. Allah menciptakan gunung-gunung di permukaan bumi agar bumi itu stabil, tidak berguncang, sehingga manusia, binatang, dan tumbuh-tumbuhan dapat hidup tenang di atasnya. Gunung itu seakan-akan merupakan pasak yang dapat mengokohkan permukaan bumi seperti halnya tiang-tiang kapal yang menjulang, yang dapat menstabilkan kapal itu berlayar dan berlabuh di tengah lautan, sehingga ia tidak oleng. Di samping itu, gunung juga mempunyai manfaat lain bagi manusia, di antaranya untuk mengatur pembagian dan penyaluran air hujan yang dicurahkan dari langit, sehingga air itu tetap ada di permukaan bumi meskipun musim kemarau. Banyak lagi manfaat gunung bagi manusia dan makhluk Allah yang lain.\n\n3. Allah menciptakan binatang yang tidak dapat dihitung jumlah dan jenisnya, bentuk dan warnanya, sejak dari yang besar sampai ke yang kecil sehingga tidak kelihatan oleh mata. Semua binatang yang diciptakan itu ada manfaat dan faedahnya. Kadang-kadang manusia, karena tidak mengetahui faedah dan guna binatang-binatang itu, mereka membunuh dan menumpasnya, sehingga tanpa mereka sadari timbullah kerusakan di alam ini. Akan tetapi, Allah mengetahui dengan pasti jumlah, jenis, warna, kegunaan, dan faedah semua binatang-binatang yang diciptakan-Nya itu.\n\n4. Allah menurunkan hujan dari langit. Hujan itu berasal dari awan yang dihalau-Nya ke suatu tempat tertentu, kemudian berubah menjadi hujan yang membasahi permukaan bumi. Dengan air hujan itu, tumbuhlah segala macam tumbuh-tumbuhan yang beraneka ragam, dengan warna yang indah dan manfaat yang banyak.\n\nMenurut para saintis, langit dengan kenyataannya yang tampak, seluas mata memandang tidak sepotong tiang pun yang menyangganya. Logika manusia mengharuskan ada tiang penyangga agar tidak roboh. Akan tetapi, Allah dengan kekuasaan-Nya mampu berbuat di luar jangkauan logika manusia. Manusia dan semua makhluk yang hidup di bumi berada di bawah sistem gravitasi (gaya tarik) bumi. Dengan demikian, mereka bisa stabil mengerjakan pekerjaan mereka di bumi, tidak melayang-layang di udara.\n\nKetika keluar dari bumi memasuki alam yang tak bergravitasi, manusia pun tahu bahwa di sana semua benda menjadi melayang-layang tak berbobot, termasuk manusia sendiri. Sungguh mudah bagi Allah untuk membuat apa saja sesuai kehendak-Nya, termasuk membuat langit menjadi \"ringan\" tak berbobot sehingga tidak diperlukan tiang-tiang untuk menyangganya. Tapi dapat juga dianggap bahwa medan-medan gaya yang ada dalam alam semesta ini sebagai \"tiang maya\" yang tidak tampak oleh mata?",
      "text_translation": "Dia menciptakan langit tanpa tiang sebagaimana kamu melihatnya, dan Dia meletakkan gunung-gunung (di permukaan) bumi agar ia (bumi) tidak menggoyangkan kamu; dan memperkembangbiakkan segala macam jenis makhluk bergerak yang bernyawa di bumi. Dan Kami turunkan air hujan dari langit, lalu Kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik. ",
      "text": "خَلَقَ السَّمٰوٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا وَاَلْقٰى فِى الْاَرْضِ رَوَاسِيَ اَنْ تَمِيْدَ بِكُمْ وَبَثَّ فِيْهَا مِنْ كُلِّ دَاۤبَّةٍۗ وَاَنْزَلْنَا مِنَ السَّمَاۤءِ مَاۤءً فَاَنْۢبَتْنَا فِيْهَا مِنْ كُلِّ زَوْجٍ كَرِيْمٍ ",
      "text_translation_en": "He [it is who] has created the skies without any supports that you could see, and has placed firm mountains upon the earth, lest it sway with you, and has caused all manner of living creatures to multiply thereon. And We send down water from the skies, and thus We cause every noble kind [of life] to grow on earth.",
      "juz_number": 21
    },
    "11": {
      "text_tafsir_en": "In this verse, God emphasizes that what is mentioned in the above verse is God's creation, both in heaven and on earth. There is nothing that associates with Allah in the creation of all those beings, and nothing is in control of it except Allah. Every need for the survival of the creature, where it lives and where it dies, as well as the uses and dangers that it creates, are all known, regulated, and maintained by God. Then God challenged his associates, \"Try to show me what the idols and the idols you worship have been created. At the end of this verse it is explained that those who worship God other than God are ignorant, astray, and greedy. They were unjust to themselves, so they were punished for pursuing their desires.",
      "text_tafsir": "Pada ayat ini, Allah menegaskan bahwa yang disebutkan pada ayat di atas itu adalah ciptaan Allah, baik yang ada di langit maupun di bumi. Tidak ada sesuatu pun yang bersekutu dengan Allah dalam menciptakan semua makhluk itu, dan tidak sesuatu pun yang berkuasa atasnya selain Allah. Segala keperluan untuk kelangsungan hidup makhluk itu, di mana ia dapat hidup dan di tempat mana ia akan mati, demikian pula tentang kegunaan dan bahaya yang dapat ditimbulkan makhluk itu, semuanya diketahui, diatur, dan dipelihara oleh Allah.\n\nKemudian Allah menantang orang-orang yang mempersekutukan-Nya, \"Cobalah tunjukkan kepada-Ku apa yang telah diciptakan berhala-berhala dan patung-patung yang kamu sembah itu. Apakah patung-patung itu berbuat sesuatu sehingga dapat diyakini sebagai Tuhan selain Aku.\"\n\nPada akhir ayat ini diterangkan bahwa orang-orang yang menyembah Tuhan selain Allah adalah orang yang bodoh, sesat, dan memperturutkan hawa nafsunya. Mereka adalah orang yang zalim kepada dirinya sendiri, sehingga mereka ditimpa azab karena memperturutkan hawa nafsunya.",
      "text_translation": "Inilah ciptaan Allah, maka perlihatkanlah olehmu kepadaku apa yang telah diciptakan oleh (sesembahanmu) selain Allah. Sebenarnya orang-orang yang zalim itu berada di dalam kesesatan yang nyata. ",
      "text": "هٰذَا خَلْقُ اللّٰهِ فَاَرُوْنِيْ مَاذَا خَلَقَ الَّذِيْنَ مِنْ دُوْنِهٖۗ بَلِ الظّٰلِمُوْنَ فِيْ ضَلٰلٍ مُّبِيْنٍ ࣖ",
      "text_translation_en": "[All] this is God’s creation: show Me, then, what others than He may have created! Nay, but the evildoers are obviously lost in error!",
      "juz_number": 21
    },
    "12": {
      "text_tafsir_en": "This verse explains that God bestowed on Lukman wisdom, a delicate feeling, common sense, and wisdom that can convey it to true knowledge and the right path to eternal happiness. Therefore, he is grateful to the God who has given him such favor. It shows that the knowledge and teachings that Lukman imparted did not come from the revelation that God had revealed to him, but merely based on the knowledge and wisdom that God had bestowed on him. Based on the history of Ibn Abi Syaibah, Ahmad, Ibn Abi Dunya, Ibn Jarir ath-thabari, Ibn Mundzir, and Ibn Abi atim from Ibn 'Abbas that Lukman was a servant \/ slave and carpenter of Habasyah. Most scholars say that Lukman was a learned, wise, and not a prophet. Many histories describe Lukman's origins, and the histories of each other are incompatible. Said bin Musayyab says that Lukman is from Sudan, south of Egypt. Zamakhsyari and Ibn Ishaq say that Lukman was a descendant of the Children of Israel and one of Azar's grandchildren, Abraham's father. According to this opinion, Lukman lived before the coming of David. According to al-Waqidi, he was one of the qadhi of the Children of Israel. There is also a history that states that Lukman was only a righteous man, not a prophet. Regardless of all the historical points, whether Lukman was a prophet or not, whether he was a Sudanese or a descendant of the Children of Israel, it is clear that Lukman was a servant of God who was endowed with wisdom, true faith, understanding the basics the religion of God, and know the virtues. His name is mentioned in the Qur'an as one who always devoted himself to Him. As a sign that Lukman was a servant of God who was always obedient to him, feeling his greatness and power in the universe was his attitude of being grateful to God. He felt himself dependent on the favor of God and felt that he had obtained wisdom from him. According to Ibn 'Umar's story that he had heard the Prophet say, \"Lukman was not a prophet, but he was a devout slave, he loved God, and Allah loved him.\" At the end of this verse, God explains that the person who is grateful to God means that he is grateful for his own sake. For God will bestow upon him a great reward for his gratitude. Allah says: Whoever is grateful, then indeed he is grateful for (good) himself, and whoever is disobedient, verily my Lord is All-Powerful, Most Glorious. (an-Naml \/ 27: 40) Sufyan bin Uyainah said, \"He who prays five times means he is grateful to Allah, and he who prays to his parents every prayer, he is grateful to both.\" Those who disregard Allah's favor and are ungrateful to Him mean that he has done harm to himself, for Allah will not reward him with torture or torture. God Himself does not need the gratitude of His servants because it does not benefit Him at all, nor does He increase His glory. He is almighty, praiseworthy.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menganugerahkan kepada Lukman hikmah, yaitu perasaan yang halus, akal pikiran, dan kearifan yang dapat menyampaikannya kepada pengetahuan yang hakiki dan jalan yang benar menuju kebahagiaan abadi. Oleh karena itu, ia bersyukur kepada Allah yang telah memberinya nikmat itu. Hal itu menunjukkan bahwa pengetahuan dan ajaran-ajaran yang disampaikan Lukman itu bukanlah berasal dari wahyu yang diturunkan Allah kepadanya, tetapi semata-mata berdasarkan ilmu dan hikmah yang telah dianugerahkan Allah kepadanya.\n\nBerdasarkan riwayat Ibnu Abi Syaibah, Ahmad, Ibnu Abi Dunya, Ibnu Jarir ath-thabari, Ibnu Mundzir, dan Ibnu Abi hatim dari Ibnu 'Abbas bahwa Lukman adalah seorang hamba\/budak dan tukang kayu dari Habasyah. Kebanyakan ulama mengatakan bahwa Lukman adalah seorang yang arif, bijak, dan bukan nabi.\n\nBanyak riwayat yang menerangkan asal-usul Lukman ini, dan riwayat-riwayat itu antara yang satu dengan yang lain tidak ada kesesuaian. Said bin Musayyab mengatakan bahwa Lukman berasal dari Sudan, sebelah selatan Mesir. Zamakhsyari dan Ibnu Ishaq mengatakan bahwa Lukman termasuk keturunan Bani Israil dan salah seorang cucu Azar, ayah Ibrahim. Menurut pendapat ini, Lukman hidup sebelum kedatangan Nabi Daud. Sedang menurut al-Waqidi, ia salah seorang qadhi Bani Israil. Ada pula riwayat yang menerangkan bahwa Lukman hanyalah seorang yang sangat saleh (wali), bukan seorang nabi. \n\nTerlepas dari semua pendapat riwayat di atas, apakah Lukman itu seorang nabi atau bukan, apakah ia orang Sudan atau keturunan Bani Israil, maka yang jelas dan diyakini ialah Lukman adalah seorang hamba Allah yang telah dianugerahi hikmah, mempunyai akidah yang benar, memahami dasar-dasar agama Allah, dan mengetahui akhlak yang mulia. Namanya disebut dalam Al-Qur'an sebagai salah seorang yang selalu menghambakan diri kepada-Nya.\n\nSebagai tanda bahwa Lukman itu seorang hamba Allah yang selalu taat kepada-Nya, merasakan kebesaran dan kekuasaan-Nya di alam semesta ini adalah sikapnya yang selalu bersyukur kepada Allah. Ia merasa dirinya sangat tergantung kepada nikmat Allah itu dan merasa dia telah mendapat hikmah dari-Nya.\n\nMenurut riwayat dari Ibnu 'Umar bahwa ia pernah mendengar Rasulullah bersabda, \"Lukman bukanlah seorang nabi, tetapi ia adalah seorang hamba yang banyak melakukan tafakur, ia mencintai Allah, maka Allah mencintainya pula.\"\n\nPada akhir ayat ini, Allah menerangkan bahwa orang yang bersyukur kepada Allah, berarti ia bersyukur untuk kepentingan dirinya sendiri. Sebab, Allah akan menganugerahkan kepadanya pahala yang banyak karena syukurnya itu. Allah berfirman:\n\nBarang siapa bersyukur, maka sesungguhnya dia bersyukur untuk (kebaikan) dirinya sendiri, dan barang siapa ingkar, maka sesungguhnya Tuhanku Mahakaya, Mahamulia. (an-Naml\/27: 40) \n\nSufyan bin Uyainah berkata, \"Siapa yang melakukan salat lima waktu berarti ia bersyukur kepada Allah, dan orang yang berdoa untuk kedua orang tuanya setiap usai salat, ia telah bersyukur kepada keduanya.\"\n\nOrang-orang yang mengingkari nikmat Allah dan tidak bersyukur kepada-Nya berarti ia telah berbuat aniaya terhadap dirinya sendiri, karena Allah tidak akan memberinya pahala bahkan menyiksanya dengan siksaan yang pedih. Allah sendiri tidak memerlukan syukur hamba-Nya karena syukur hamba-Nya itu tidak akan memberikan keuntungan kepada-Nya sedikit pun, dan tidak pula akan menambah kemuliaan-Nya. Dia Mahakuasa lagi Maha Terpuji.",
      "text_translation": "Dan sungguh, telah Kami berikan hikmah kepada Lukman, yaitu,  ”Bersyukurlah kepada Allah! Dan barangsiapa bersyukur (kepada Allah), maka sesungguhnya dia bersyukur untuk dirinya sendiri; dan barangsiapa tidak bersyukur (kufur), maka sesungguhnya Allah Mahakaya, Maha Terpuji.” ",
      "text": "وَلَقَدْ اٰتَيْنَا لُقْمٰنَ الْحِكْمَةَ اَنِ اشْكُرْ لِلّٰهِ ۗوَمَنْ يَّشْكُرْ فَاِنَّمَا يَشْكُرُ لِنَفْسِهٖۚ وَمَنْ كَفَرَ فَاِنَّ اللّٰهَ غَنِيٌّ حَمِيْدٌ ",
      "text_translation_en": "and, indeed, we granted this wisdom unto Luq­man: “Be grateful unto God - for he who is grateful [unto Him] is but grateful for the good of his own self; whereas he who chooses to be ungrateful [ought to know that], verily, God is self-sufficient, ever to be praised!”",
      "juz_number": 21
    },
    "13": {
      "text_tafsir_en": "Allah reminded the Prophet of the advice Lukman had given to his son when he taught him. The admonition was, \"O my son, do not associate with God, for the fellowship of God is a great injustice.\" To associate with God is said to be cruel because that act means to put something out of place, namely to equate something that bestows favor and grace with something that is incapable of giving it all. To equate God as a source of grace and grace with statues that can do nothing is wrong. That act is considered a great injustice because it is equated with an incapable being that is the Creator and Ruler of the universe, who should be all beings who serve and worship Him. Al-Bukhari of Ibn Mas'ud recounts that when he recited the verse: Those who believe and do not mix their faith with shirk, they are the people who feel secure and they are guided. (al-An'am \/ 6: 82) Anxiety arose among the companions of the Messenger of Allah. They find it very difficult to keep the faith from being mixed with injustice. They then said to the Messenger of Allah (may peace be upon him), \"Who among us does not mix faith with injustice?\" The Messenger of Allah (may peace be upon him) replied, \"That is not the case. Do you not hear Lukman's words, 'My son, do not associate with Allah, for the sake of Allah is a great evil.' From this verse it is understood that one of the duties of a father to his children is to give advice and lessons, so that his children may walk the right path, and avoid the error. This is according to the word of Allah: O you who believe! Protect yourself and your family from the fire of hell whose fuel is man and stone. (at-Tahrim \/ 66: 6) Given the context of this verse, it can be concluded that Lukman forbade his son to associate with God. This prohibition is something that Lukman must pass on to his son because associating with God is the greatest sin. Children are the next generation of parents. A parent's unfulfilled goals in life are expected to be fulfilled by his or her children. In the same way, the parents' beliefs, in addition to their high moral values, are expected to inherit and have all the values that their father would later follow. Lukman has done a very important job for his son, delivering true religion and high moral character. The way Lukman delivered the message must be exemplified by every parent who claims to be a Muslim.",
      "text_tafsir": "Allah mengingatkan kepada Rasulullah nasihat yang pernah diberikan Lukman kepada putranya ketika ia memberi pelajaran kepadanya. Nasihat itu ialah, \"Wahai anakku, janganlah engkau mempersekutukan sesuatu dengan Allah, sesungguhnya mempersekutukan Allah itu adalah kezaliman yang sangat besar.\"\n\nMempersekutukan Allah dikatakan kezaliman karena perbuatan itu berarti menempatkan sesuatu tidak pada tempatnya, yaitu menyamakan sesuatu yang melimpahkan nikmat dan karunia dengan sesuatu yang tidak sanggup memberikan semua itu. Menyamakan Allah sebagai sumber nikmat dan karunia dengan patung-patung yang tidak dapat berbuat apa-apa adalah perbuatan zalim. Perbuatan itu dianggap sebagai kezaliman yang besar karena yang disamakan dengan makhluk yang tidak bisa berbuat apa-apa itu adalah Allah Pencipta dan Penguasa semesta alam, yang seharusnya semua makhluk mengabdi dan mengham-bakan diri kepada-Nya.\n\nDiriwayatkan oleh al-Bukhari dari Ibnu Mas'ud bahwa tatkala turun ayat:\n\nOrang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan syirik, mereka itulah orang-orang yang mendapat rasa aman dan mereka mendapat petunjuk. (al-An'am\/6: 82) \n\ntimbullah keresahan di antara para sahabat Rasulullah saw. Mereka berpendapat bahwa amat berat menjaga keimanan agar tidak bercampur dengan kezaliman. Mereka lalu berkata kepada Rasulullah saw, \"Siapakah di antara kami yang tidak mencampuradukkan keimanan dengan kezaliman?\" Maka Rasulullah menjawab, \"Maksudnya bukan demikian, apakah kamu tidak mendengar perkataan Lukman, 'Hai anakku, jangan kamu menyekutukan sesuatu dengan Allah, sesungguhnya memper-sekutukan Allah adalah kezaliman yang besar.\"\n\nDari ayat ini dipahami bahwa di antara kewajiban ayah kepada anak-anaknya ialah memberi nasihat dan pelajaran, sehingga anak-anaknya dapat menempuh jalan yang benar, dan terhindar dari kesesatan. Hal ini sesuai dengan firman Allah:\n\nWahai orang-orang yang beriman! Peliharalah dirimu dan keluargamu dari api neraka yang bahan bakarnya adalah manusia dan batu. (at-Tahrim\/66: 6) \n\nJika diperhatikan susunan kalimat ayat ini, maka dapat diambil kesimpulan bahwa Lukman melarang anaknya menyekutukan Tuhan. Larangan ini adalah sesuatu yang memang patut disampaikan Lukman kepada putranya karena menyekutukan Allah adalah perbuatan dosa yang paling besar.\n\nAnak adalah generasi penerus dari orang tuanya. Cita-cita yang belum dicapai orang tua selama hidup di dunia diharapkan dapat tercapai oleh anaknya. Demikian pula kepercayaan yang dianut orang tuanya, di samping budi pekerti yang luhur, anak-anak diharapkan mewarisi dan memiliki semua nilai-nilai yang diikuti ayahnya itu di kemudian hari. Lukman telah melakukan tugas yang sangat penting kepada anaknya, dengan menyampaikan agama yang benar dan budi pekerti yang luhur. Cara Lukman menyampaikan pesan itu wajib dicontoh oleh setiap orang tua yang mengaku dirinya muslim.",
      "text_translation": "Dan (ingatlah) ketika Lukman berkata kepada anaknya, ketika dia memberi pelajaran kepadanya, ”Wahai anakku! Janganlah engkau mempersekutukan Allah, sesungguhnya mempersekutukan (Allah) adalah benar-benar kezaliman yang besar.” ",
      "text": "وَاِذْ قَالَ لُقْمٰنُ لِابْنِهٖ وَهُوَ يَعِظُهٗ يٰبُنَيَّ لَا تُشْرِكْ بِاللّٰهِ ۗاِنَّ الشِّرْكَ لَظُلْمٌ عَظِيْمٌ ",
      "text_translation_en": "And, lo, Luqman spoke thus unto his son, admonishing him: “O my dear son! Do not ascribe divine powers to aught beside God: for, behold, such [a false] ascribing of divinity is indeed an awesome wrong!",
      "juz_number": 21
    },
    "14": {
      "text_tafsir_en": "In this verse, God commands man to serve both his parents by striving to fulfill his commandments and fulfill his desires. In other verses, God also commanded the same, saying: And your Lord commanded that ye should not worship except him, and that ye should do good to the fathers. (al-Isra '\/ 17: 23) The things that cause a child to be treated with kindness are: 1. A mother conceived a child until she was born. During the pregnancy, the patient endures a considerable amount of pain, beginning in the first months, then the pregnancy becomes heavier, and the mother becomes weaker, until she gives birth. His strength has only been restored after the loss of his teeth. 2. A mother breastfeeds her child until she is two years old. A lot of the pain and hardship a mother experiences during her breastfeeding. Only God knows all that suffering. In this verse the only reason why a child should obey and do good to his mother, not to mention why a child should obey and do good to his father. This indicates that the difficulties and hardships of a mother in conceiving, raising, and educating her child are much more severe than the suffering that a father experiences in raising his child. It was not only the sacrifice of a part of his life to care for his son, but also his physical and spiritual suffering. A mother also provides essential nutrients in her body for her baby's food as long as her child is in the womb. After being born into the world, the baby is breastfeeding for two years. Breast milk (ASI) is also made up of important substances in the mother's blood, which are served with the love for her to suck. In this ASI there are all kinds of substances necessary for the physical and spiritual growth of children, and for the prevention of all kinds of diseases. These substances are not found in cow's milk. Therefore, cow's milk and the like will not be as raw as the milk. All kinds of powdered milk or canned milk have nothing in common with ASI. A mother is very scared to breastfeed her baby with breastfeeding. Do not replace it with powdered milk, except in very demanding situations. Getting breastfeeding from a mother is a child's right, and breastfeeding is an obligation that God has placed on her mother. In this verse, God only mentions why people should obey and do good to their mother. The Prophet himself ordered that a child should first do good to his mother rather than to his father, as described in the hadith: From Bahz bin the judge, from his father, from his grandfather, he said, \"I ask the Messenger of Allah, to whom shall I serve?\" The Prophet said, \"To your mother.\" I asked, \"Then to whom?\" The Prophet said, \"To your mother.\" I asked, \"Then who else?\" The Prophet said, \"To your mother.\" I asked, \"Then who else?\" The Messenger of Allah (may peace be upon him) replied, \"To your father. Then to a closer relative, then a closer relative.\" (History of Abu Dawud and at-Tirmidzi) As for the length of the breastfeeding period, the Qur'an orders a mother to breastfeed her two-year-old child, as described in this verse, by her word, \"and weaned her for two years. . \" In another verse, God determines the time to nurse the child for two years. God says: And mothers should nurse their children for two full years, for those who want to be fully nourished. (al-Baqarah \/ 2: 233) His Word again: Her pregnancy lasted for thirty months. (al-Ahqaf \/ 46: 15) The meaning of the above verse is the time it takes for a mother to conceive a child for at least six months, and to have a twenty-four month or two-year breastfeeding. If they are combined, they will meet the number of 30 months. The Qur'an teaches that a mother should nurse her child for two years. In verse 233 surah al-Baqarah explains that the two-year breastfeeding is for a mother who wants to give birth to her child perfectly. That is, if something goes wrong, or the two years feel so heavy, it can be reduced. Breastfeeding two years contains another wisdom, which is to prevent birth. With this natural arrangement, a mother will give birth at least once in three years, or less. Because during pregnancy, a woman is generally difficult to conceive. Then God explained that the purpose of \"doing good\" in this verse is that people should always be grateful for the good that has been bestowed upon them, and also be grateful to the parents for both raising, nurturing, educating and taking responsibility for themselves. , from conception to adulthood and self-determination. Raising a child is a difficult time because a parent bears all kinds of hardships and hardships, both in the care and in the pursuit of raising his child. The fathers in this verse are generally mentioned, not distinguishing between Muslim and non-Muslim parents. Therefore, it can be understood that the child is obligated to do good to his parents, whether his parents are Muslim or infidels. In addition to the above, there are some things that require a child to respect and treat his parents, including: 1. A mother and father have poured their love into their children. Love and affection come in many forms, including raising, educating, nurturing, and meeting the needs of her children. These non-binding efforts were made without expecting any rewards from their children, except that they would later become useful children of religion, nusa, and the nation. 2. The child is the heart and the heart of the parent, as it is stated in the history that the Prophet said, \"Fatimah is the fruit of my heart.\" 3. From birth, born into the world to adulthood, the child's needs for food, drink, clothing, and other needs are borne by his parents. In other words it can be stated that the greatest favor a man receives is the favor of God, and then the favor received from his parents. That is why God placed a duty of good on both parents, after the duty of worshiping Him. At the end of this verse, God warns that man will return to him, not to anyone else. At that time, He will give His servants a just reward. Good deeds will be rewarded with double rewards in heaven, whereas evil will be rewarded with the torment of hell.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan kepada manusia agar berbakti kepada kedua orang tuanya dengan berusaha melaksanakan perintah-perintahnya dan mewujudkan keinginannya. Pada ayat-ayat lain, Allah juga memerintahkan yang demikian, firman-Nya:\n\nDan Tuhanmu telah memerintahkan agar kamu jangan menyembah selain Dia dan hendaklah berbuat baik kepada ibu bapak. (al-Isra'\/17: 23) \n\nHal-hal yang menyebabkan seorang anak diperintahkan berbuat baik kepada ibu adalah:\n\n1. Ibu mengandung seorang anak sampai ia dilahirkan. Selama masa mengandung itu, ibu menahan dengan sabar penderitaan yang cukup berat, mulai pada bulan-bulan pertama, kemudian kandungan itu semakin lama semakin berat, dan ibu semakin lemah, sampai ia melahirkan. Kekuatannya baru pulih setelah habis masa nifas.\n\n2. Ibu menyusui anaknya sampai usia dua tahun. Banyak penderitaan dan kesukaran yang dialami ibu dalam masa menyusukan anaknya. Hanya Allah yang mengetahui segala penderitaan itu.\n\nDalam ayat ini yang disebutkan hanya alasan mengapa seorang anak harus taat dan berbuat baik kepada ibunya, tidak disebutkan apa sebabnya seorang anak harus taat dan berbuat baik kepada bapaknya. Hal ini menunjukkan bahwa kesukaran dan penderitaan ibu dalam mengandung, memelihara, dan mendidik anaknya jauh lebih berat bila dibandingkan dengan penderitaan yang dialami bapak dalam memelihara anaknya. Penderitaan itu tidak hanya berupa pengorbanan sebagian dari waktu hidupnya untuk memelihara anaknya, tetapi juga penderitaan jasmani dan rohani. Seorang ibu juga menyediakan zat-zat penting dalam tubuhnya untuk makanan anaknya selama anaknya masih berupa janin di dalam kandungan. \n\nSesudah lahir ke dunia, sang anak itu lalu disusukannya dalam masa dua tahun (yang utama). Air susu ibu (ASI) juga terdiri dari zat-zat penting dalam darah ibu, yang disuguhkan dengan kasih sayang untuk dihisap oleh anaknya. Dalam ASI ini terdapat segala macam zat yang diperlukan untuk pertumbuhan jasmani dan rohani anak, dan untuk mencegah segala macam penyakit. Zat-zat ini tidak terdapat pada susu sapi. Oleh sebab itu, susu sapi dan yang sejenisnya tidak akan sama mutunya dengan ASI. Segala macam susu bubuk atau susu kaleng tidak ada yang sama mutunya dengan ASI.\n\nSeorang ibu sangat dihimbau untuk menyusui anaknya dengan ASI. Janganlah ia menggantinya dengan susu bubuk, kecuali dalam situasi yang sangat memaksa. Mendapatkan ASI dari ibunya adalah hak anak, dan menyusukan anak adalah suatu kewajiban yang telah dibebankan Allah kepada ibunya.\n\nDalam ayat ini, Allah hanya menyebutkan sebab-sebab manusia harus taat dan berbuat baik kepada ibunya. Nabi saw sendiri memerintahkan agar seorang anak lebih mendahulukan berbuat baik kepada ibunya daripada kepada bapaknya, sebagaimana diterangkan dalam hadis:\n\nDari Bahz bin hakim, dari bapaknya, dari kakeknya, ia berkata, \"Aku bertanya ya Rasulullah, kepada siapakah aku wajib berbakti?\" Rasulullah menjawab, \"Kepada ibumu.\" Aku bertanya, \"Kemudian kepada siapa?\" Rasulullah menjawab, \"Kepada ibumu.\" Aku bertanya, \"Kemudian kepada siapa lagi?\" Rasulullah menjawab, \"Kepada ibumu.\" Aku bertanya, \"Kemudian kepada siapa lagi?\" Rasulullah menjawab, \"Kepada bapakmu. Kemudian kepada kerabat yang lebih dekat, kemudian kerabat yang lebih dekat.\" (Riwayat Abu Dawud dan at-Tirmidzi) \n\nAdapun tentang lamanya menyusukan anak, Al-Qur'an memerintahkan agar seorang ibu menyusukan anaknya paling lama dua tahun, sebagaimana yang diterangkan dalam ayat ini, dengan firman-Nya, \"dan menyapihnya dalam masa dua tahun.\" Dalam ayat lain, Allah menentukan masa untuk menyusukan anak itu selama dua tahun. Allah berfirman:\n\nDan ibu-ibu hendaklah menyusui anak-anaknya selama dua tahun penuh, bagi yang ingin menyusui secara sempurna. (al-Baqarah\/2: 233) \n\nFirman-Nya lagi:\n\nMasa mengandung sampai menyapihnya selama tiga puluh bulan. (al-Ahqaf\/46: 15) \n\nPengertian ayat di atas adalah waktu yang dibutuhkan seorang ibu mengandung anaknya minimal enam bulan, dan masa menyusui dua puluh empat bulan atau dua tahun. Jika keduanya dijumlahkan akan ketemu bilangan 30 bulan.\n\nAl-Qur'an mengajarkan bahwa seorang ibu hendaknya menyusui anaknya dalam masa dua tahun. Pada ayat 233 surah al-Baqarah diterangkan bahwa masa menyusui dua tahun itu adalah bagi seorang ibu yang hendak menyusukan anaknya dengan sempurna. Maksudnya, bila ada sesuatu halangan, atau masa dua tahun itu dirasakan amat berat, maka boleh dikurangi.\n\nMasa menyusui dua tahun mengandung hikmah lainnya, yaitu untuk menjarangkan kelahiran. Dengan menjalankan pengaturan yang alami ini, seorang ibu hanya akan melahirkan paling cepat sekali dalam masa tiga tahun, atau kurang sedikit. Sebab dalam masa menyusui, seorang perempuan pada umumnya sukar untuk hamil kembali.\n\nKemudian Allah menjelaskan bahwa maksud dari \"berbuat baik\" dalam ayat ini adalah agar manusia selalu bersyukur setiap menerima nikmat-nikmat yang telah dilimpahkan kepada mereka, dan bersyukur pula kepada ibu bapak karena keduanya yang membesarkan, memelihara, dan mendidik serta bertanggung jawab atas diri mereka, sejak dalam kandungan sampai mereka dewasa dan sanggup berdiri sendiri. Masa membesarkan anak merupakan masa sulit karena ibu bapak menanggung segala macam kesusahan dan penderitaan, baik dalam menjaga maupun dalam usaha mencarikan nafkah anaknya. \n\nIbu-bapak dalam ayat ini disebut secara umum, tidak dibedakan antara ibu bapak yang muslim dengan yang kafir. Oleh karena itu, dapat dipahami bahwa anak wajib berbuat baik kepada ibu bapaknya, apakah ibu bapaknya itu muslim atau kafir.\n\nDi samping apa yang disebutkan di atas, masih ada beberapa hal yang mengharuskan anak menghormati dan berbuat baik kepada ibu bapak, antara lain:\n\n1. Ibu dan bapak telah mencurahkan kasih sayangnya kepada anak-anaknya. Cinta dan kasih sayang itu terwujud dalam berbagai bentuk, di antaranya ialah membesarkan, mendidik, menjaga, dan memenuhi keinginan-keinginan anaknya. Usaha-usaha yang tidak mengikat itu dilakukan tanpa mengharapkan balasan apa pun dari anak-anaknya, kecuali agar mereka di kemudian hari menjadi anak yang berguna bagi agama, nusa, dan bangsa.\n\n2. Anak adalah buah hati dan jantung dari ibu bapaknya, seperti yang disebutkan dalam suatu riwayat bahwa Rasulullah bersabda, \"Fatimah adalah buah hatiku.\"\n\n3. Sejak dalam kandungan, lalu dilahirkan ke dunia hingga dewasa, kebutuhan makan, minum, pakaian, dan keperluan lain anak-anak ditanggung oleh ibu bapaknya.\n\nDengan perkataan lain dapat diungkapkan bahwa nikmat yang paling besar yang diterima oleh seorang manusia adalah nikmat dari Allah, kemudian nikmat yang diterima dari ibu bapaknya. Itulah sebabnya, Allah meletakkan kewajiban berbuat baik kepada kedua ibu bapak, sesudah kewajiban beribadah kepada-Nya.\n\nPada akhir ayat ini, Allah memperingatkan bahwa manusia akan kembali kepada-Nya, bukan kepada orang lain. Pada saat itu, Dia akan memberikan pembalasan yang adil kepada hamba-hamba-Nya. Perbuatan baik akan dibalas pahala yang berlipat ganda berupa surga, sedangkan perbuatan jahat akan dibalas dengan azab neraka.",
      "text_translation": "Dan Kami perintahkan kepada manusia (agar berbuat baik) kepada kedua orang tuanya. Ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam usia dua tahun. Bersyukurlah kepada-Ku dan kepada kedua orang tuamu. Hanya kepada Aku kembalimu. ",
      "text": "وَوَصَّيْنَا الْاِنْسَانَ بِوَالِدَيْهِۚ حَمَلَتْهُ اُمُّهٗ وَهْنًا عَلٰى وَهْنٍ وَّفِصَالُهٗ فِيْ عَامَيْنِ اَنِ اشْكُرْ لِيْ وَلِوَالِدَيْكَۗ اِلَيَّ الْمَصِيْرُ",
      "text_translation_en": "“And [God says:] ‘We have enjoined upon man goodness towards his parents: his mother bore him by bearing strain upon strain, and his utter dependence on her lasted two years: [hence, O man,] be grateful towards Me and towards thy parents, [and remember that] with Me is all journeys’ end.",
      "juz_number": 21
    },
    "15": {
      "text_tafsir_en": "Narrated that this verse was passed in connection with Sa'ad bin Abi Waqqash, he said, \"When I entered Islam, my mother swore that she would not eat and drink before I left Islam. and on the second day I begged him that he would eat and drink, and on the third day I would ask him to eat and drink, and he would not do it. Therefore, I said to her, 'By Allah, if you had a hundred souls and went out one by one before me until death, I would not abandon this religion which I had embraced. want to eat. \" It is possible to deduce that Sa'ad is innocent because he did not follow his mother's will to return to the religion of shirk. This law also applies to all the people of Prophet Muhammad who would not obey his parents in the religion of shirk and other sins. This verse explains that in certain cases, a child is forbidden to obey his parents if they order him to associate with God, which he himself does not know that God has an ally, since he has no ally. Throughout human knowledge, God has no allies. Because according to instinct, man has to suppress God. God further commands that a child remain good to both parents in the affairs of the world, such as honoring, pleasing, and giving them appropriate clothing and shelter, even if they force them to associate with God or commit other sins. In another verse it is warned that a child is obliged to say good words to his or her parents. Never act or say words that offend her, even if only \"ah\". Allah says: Do not say the word \"ah\" at all. (al-Isra '\/ 17: 23) At the end of this verse the Muslims are ordered to follow the path of those who come to Allah, the One True God, and not to follow the path of those who associate with him. Then this verse closes with a warning from God that only to Him will man return, and He will tell them what they have done throughout their life.",
      "text_tafsir": "Diriwayatkan bahwa ayat ini diturunkan berhubungan dengan Sa'ad bin Abi Waqqash, ia berkata, \"Tatkala aku masuk Islam, ibuku bersumpah bahwa beliau tidak akan makan dan minum sebelum aku meninggalkan agama Islam itu. Untuk itu pada hari pertama aku mohon agar beliau mau makan dan minum, tetapi beliau menolaknya dan tetap bertahan pada pendiriannya. Pada hari kedua, aku juga mohon agar beliau mau makan dan minum, tetapi beliau masih tetap pada pendiriannya. Pada hari ketiga, aku mohon kepada beliau agar mau makan dan minum, tetapi tetap menolaknya. Oleh karena itu, aku berkata kepadanya, 'Demi Allah, seandainya ibu mempunyai seratus jiwa dan keluar satu persatu di hadapan saya sampai ibu mati, aku tidak akan meninggalkan agama yang aku peluk ini. Setelah ibuku melihat keyakinan dan kekuatan pendirianku, maka beliau pun mau makan.\"\n\nDari sebab turun ayat ini dapat diambil pengertian bahwa Sa'ad tidak berdosa karena tidak mengikuti kehendak ibunya untuk kembali kepada agama syirik. Hukum ini berlaku pula untuk seluruh umat Nabi Muhammad yang tidak boleh taat kepada orang tuanya mengikuti agama syirik dan perbuatan dosa yang lain.\n\nAyat ini menerangkan bahwa dalam hal tertentu, seorang anak dilarang menaati ibu bapaknya jika mereka memerintahkannya untuk menyekutukan Allah, yang dia sendiri memang tidak mengetahui bahwa Allah mempunyai sekutu, karena memang tidak ada sekutu bagi-Nya. Sepanjang pengetahuan manusia, Allah tidak mempunyai sekutu. Karena menurut naluri, manusia harus mengesakan Tuhan.\n\nSelanjutnya Allah memerintahkan agar seorang anak tetap bersikap baik kepada kedua ibu bapaknya dalam urusan dunia, seperti menghormati, menyenangkan hati, serta memberi pakaian dan tempat tinggal yang layak baginya, walaupun mereka memaksanya mempersekutukan Tuhan atau melakukan dosa yang lain.\n\nPada ayat lain diperingatkan bahwa seseorang anak wajib mengucapkan kata-kata yang baik kepada ibu bapaknya. Jangan sekali-kali bertindak atau mengucapkan kata-kata yang menyinggung hatinya, sekalipun hanya kata-kata \"ah\". Allah berfirman:\n\n¦maka sekali-kali janganlah engkau mengatakan kepada keduanya perkataan \"ah\". (al-Isra'\/17: 23) \n\nPada akhir ayat ini kaum Muslimin diperintahkan agar mengikuti jalan orang yang menuju kepada Allah, Tuhan Yang Maha Esa, dan tidak mengikuti jalan orang yang menyekutukan-Nya dengan makhluk. Kemudian ayat ini ditutup dengan peringatan dari Allah bahwa hanya kepada-Nya manusia kembali, dan Ia akan memberitahukan apa-apa yang telah mereka kerjakan selama hidup di dunia.",
      "text_translation": "Dan jika keduanya memaksamu untuk mempersekutukan Aku dengan sesuatu yang engkau tidak mempunyai ilmu tentang itu, maka janganlah engkau menaati keduanya, dan pergaulilah keduanya di dunia dengan baik, dan ikutilah jalan orang yang kembali kepada-Ku. Kemudian hanya kepada-Ku tempat kembalimu, maka akan Aku beritahukan kepadamu apa yang telah kamu kerjakan. ",
      "text": "وَاِنْ جَاهَدٰكَ عَلٰٓى اَنْ تُشْرِكَ بِيْ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ فَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِى الدُّنْيَا مَعْرُوْفًا ۖوَّاتَّبِعْ سَبِيْلَ مَنْ اَنَابَ اِلَيَّۚ  ثُمَّ اِلَيَّ مَرْجِعُكُمْ فَاُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
      "text_translation_en": "“‘[Revere thy parents;] yet should they endeavour to make thee ascribe divinity, side by side with Me, to something which thy mind cannot accept [as divine], obey them not; but [even then] bear them company in this world’s life with kindness, and follow the path of those who turn towards Me. In the end, unto Me you all must return; and thereupon I shall make you [truly] understand all that you were doing [in life].’",
      "juz_number": 21
    },
    "16": {
      "text_tafsir_en": "Lukman willed his children to do good deeds because what humans do, from the big to the smallest, the visible and the invisible, the visible and hidden, both in heaven and on earth, surely Allah knows. Therefore, Allah will surely give a reward commensurate with human actions. Good works will be rewarded with heaven, while bad deeds and sin will be rewarded with hell. Allah's knowledge encompasses all things and nothing escapes His knowledge. Allah then describes in His Word the weighing of human actions: And We will put up the right scales on the Day of Judgment, so that no one will be harmed even if a little. (al-Anbiya '\/ 21: 47)",
      "text_tafsir": "Lukman berwasiat kepada anaknya agar beramal dengan baik karena apa yang dilakukan manusia, dari yang besar sampai yang sekecil-kecilnya, yang tampak dan yang tidak tampak, yang terlihat dan yang tersembunyi, baik di langit maupun di bumi, pasti diketahui Allah. Oleh karena itu, Allah pasti akan memberikan balasan yang setimpal dengan perbuatan manusia itu. Perbuatan baik akan dibalas dengan surga, sedang perbuatan jahat dan dosa akan dibalas dengan neraka. Pengetahuan Allah meliputi segala sesuatu dan tidak ada yang luput sedikit pun dari pengetahuan-Nya. \n\nAllah kemudian melukiskan dalam firman-Nya tentang penimbangan perbuatan manusia:\n\nDan Kami akan memasang timbangan yang tepat pada hari Kiamat, maka tidak seorang pun dirugikan walau sedikit. (al-Anbiya'\/21: 47)",
      "text_translation": "(Lukman berkata), ”Wahai anakku! Sungguh, jika ada (sesuatu perbuatan) seberat biji sawi, dan berada dalam batu atau di langit atau di bumi, niscaya Allah akan memberinya (balasan). Sesungguhnya Allah Mahahalus, Mahateliti. ",
      "text": "يٰبُنَيَّ اِنَّهَآ اِنْ تَكُ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ فَتَكُنْ فِيْ صَخْرَةٍ اَوْ فِى السَّمٰوٰتِ اَوْ فِى الْاَرْضِ يَأْتِ بِهَا اللّٰهُ ۗاِنَّ اللّٰهَ لَطِيْفٌ خَبِيْرٌ",
      "text_translation_en": "“O my dear son,” [continued Luqman,] “verily, if there be but the weight of a mustard-seed, and though it be [hidden] in a rock, or in the skies, or in the earth, God will bring it to light: for, behold, God is unfathomable [in His wisdom], all-aware",
      "juz_number": 21
    },
    "17": {
      "text_tafsir_en": "In this verse, Lukman relates to his son the following: a.Always set up the best prayers, so that God may approve. If the prayer is performed by Allah, the evil deeds and deeds can be prevented, the soul becomes clean, there is no concern for the person, and they will not grieve if they are tested, and they feel closer to their Lord. The Prophet (saw) said: Worship Allah as you see him, and if you do not see him, He will surely see you. (History of al-Bukhari and Muslim) b.So encourage people to do good deeds that Allah has in mind, to try to cleanse their souls and achieve prosperity, and to prevent them from committing acts of sin. Allah says: Blessed are those who purify it (the soul), and the loss of those who profane it. (asy-Shams \/ 91: 9-10) c.Be patient and persevering in all kinds of adversity, as a result of inviting people to do good and to abandon evil acts, whether in the form of pleasure and splendor, misery and suffering. At the end of this verse it is explained that God commanded these three things because it is a work of great benefit to those who do it and benefit it in the world and in the hereafter.",
      "text_tafsir": "Pada ayat ini, Lukman mewasiatkan kepada anaknya hal-hal berikut:\n\na.Selalu mendirikan salat dengan sebaik-baiknya, sehingga diridai Allah. Jika salat yang dikerjakan itu diridai Allah, perbuatan keji dan perbuatan mungkar dapat dicegah, jiwa menjadi bersih, tidak ada kekhawatiran terhadap diri orang itu, dan mereka tidak akan bersedih hati jika ditimpa cobaan, dan merasa dirinya semakin dekat dengan Tuhannya.\n\nNabi saw bersabda:\n\nSembahlah Allah seakan-akan engkau melihat-Nya, maka jika engkau tidak melihat-Nya, maka sesungguhnya Dia melihat engkau. (Riwayat al-Bukhari dan Muslim) \n\nb.Berusaha mengajak manusia mengerjakan perbuatan-perbuatan baik yang diridai Allah, berusaha membersihkan jiwa dan mencapai keberuntungan, serta mencegah mereka agar tidak mengerjakan perbuatan-perbuatan dosa. Allah berfirman:\n\nSungguh beruntung orang yang menyucikannya (jiwa itu), dan sungguh rugi orang yang mengotorinya. (asy-Syams\/91: 9-10)\n\nc.Selalu bersabar dan tabah terhadap segala macam cobaan yang menimpa, akibat dari mengajak manusia berbuat baik dan meninggalkan perbuatan yang mungkar, baik cobaan itu dalam bentuk kesenangan dan kemegahan, maupun dalam bentuk ke-sengsaraan dan penderitaan.\n\nPada akhir ayat ini diterangkan bahwa Allah memerintahkan tiga hal tersebut di atas karena merupakan pekerjaan yang amat besar faedahnya bagi yang mengerjakannya dan memberi manfaat di dunia dan di akhirat.",
      "text_translation": "Wahai anakku! Laksanakanlah salat dan suruhlah (manusia) berbuat yang makruf dan cegahlah (mereka) dari yang mungkar dan bersabarlah terhadap apa yang menimpamu, sesungguhnya yang demikian itu termasuk perkara yang penting.",
      "text": "يٰبُنَيَّ اَقِمِ الصَّلٰوةَ وَأْمُرْ بِالْمَعْرُوْفِ وَانْهَ عَنِ الْمُنْكَرِ وَاصْبِرْ عَلٰى مَآ اَصَابَكَۗ اِنَّ ذٰلِكَ مِنْ عَزْمِ الْاُمُوْرِ",
      "text_translation_en": "“O my dear son! Be constant in prayer, and enjoin the doing of what is right and forbid the doing of what is wrong, and bear in patience whatever [ill] may befall thee: this, behold, is something to set one’s heart upon!",
      "juz_number": 21
    },
    "18": {
      "text_tafsir_en": "This verse explains the extension of Lukman's will to his son, that he should behave in a good way, by: 1. Never be arrogant and arrogant, boast and look down on others. The hallmarks of a proud and arrogant person are: - When walking and meeting another person, he turns his face, refuses to speak or shows a friendly attitude. - Walk with a proud attitude, as if he were the most powerful and the most honorable. The word of God: And do not walk on this earth proudly, for you will not pass through the earth, nor can you climb the mountains. (al-Isra '\/ 17: 37) In a hadith, the Messenger of Allah said: Do not hate one another, do not rebel against one another, and do not envy one another, and be the servants of God. It is not permissible for a Muslim to be away from his friend for more than three days. (History of Malik by Anas bin Malik) 2. To be fair, unpretentious and arrogant or arrogant, and to be gentle in speaking, so that those who see and hear him are happy and at peace. Talking loud, arrogant, and arrogant is forbidden by God because that kind of speech is unpleasant, heartbreaking and harsh. It is like God with a donkey's voice that is uncomfortable to hear. Yahya bin Jabir ath-tha'i narrated from Gudhaif bin haris, he said, \"I was sitting near 'Abdullah bin' Amr bin al-'ash, so I heard him say, 'Indeed the grave will speak to the people buried in it he said, \"Son of Adam, who has deceived you, that you have come into my bed? Do you not know that I am the house where you are? Do you not know that I am a dark place? Do you not know that I am the house of truth? who deceiveth thee, and enterest into my loins? surely thy life is proud. Simple or natural in walking and talking does not mean walking down your head and talking softly. However, the purpose is to walk and talk politely and gently, so that people will enjoy seeing it. As for walking in a courageous and reasonable manner, and saying strictly that a strong stand is not prohibited by religion. According to a story from 'Aisha, she saw a man walking low, as if he had lost his strength, so he asked, \"Why is that man so weak and slow?\" Someone replied, \"He is a very pious fuqaha.\" Hearing the answer, 'A'ishah said, \"Umar is the leader of the fuqaha, but when he walks, he walks with a stern attitude.",
      "text_tafsir": "Ayat ini menerangkan lanjutan wasiat Lukman kepada anaknya, yaitu agar anaknya berbudi pekerti yang baik, dengan cara:\n\n1. Jangan sekali-kali bersifat angkuh dan sombong, membanggakan diri dan memandang rendah orang lain. Tanda-tanda seseorang yang bersifat angkuh dan sombong itu ialah:\n\n-Bila berjalan dan bertemu dengan orang lain, ia memalingkan mukanya, tidak mau menegur atau memperlihatkan sikap ramah.\n\n-Berjalan dengan sikap angkuh, seakan-akan ia yang berkuasa dan yang paling terhormat. Firman Allah:\n\nDan janganlah engkau berjalan di bumi ini dengan sombong, karena sesungguhnya engkau tidak akan dapat menembus bumi dan tidak akan mampu menjulang setinggi gunung. (al-Isra'\/17: 37)\n\nDalam sebuah hadis, Rasulullah bersabda:\n\nJanganlah kamu saling membenci, janganlah kamu saling membelakangi dan janganlah kamu saling mendengki, dan jadilah kamu hamba Allah yang bersaudara. Tidak boleh bagi seorang muslim memencilkan (tidak berbaik) dengan temannya lebih dari tiga hari. (Riwayat Malik dari Anas bin Malik)\n\n2. Hendaklah berjalan secara wajar, tidak dibuat-buat dan kelihatan angkuh atau sombong, dan lemah lembut dalam berbicara, sehingga orang yang melihat dan mendengarnya merasa senang dan tenteram hatinya. Berbicara dengan sikap keras, angkuh, dan sombong dilarang Allah karena gaya bicara yang semacam itu tidak enak didengar, menyakitkan hati dan telinga. Hal itu diibaratkan Allah dengan suara keledai yang tidak nyaman didengar.\n\nYahya bin Jabir ath-tha'i meriwayatkan dari Gudhaif bin haris, ia berkata, \"Aku duduk dekat 'Abdullah bin 'Amr bin al-'ash, maka aku mendengar ia berkata, 'Sesungguhnya kubur itu akan berbicara dengan orang yang dikuburkan di dalamnya, ia berkata, 'Hai anak Adam apakah yang telah memperdayakan engkau, sehingga engkau masuk ke dalam liangku? Tidakkah engkau mengetahui bahwa aku rumah tempat engkau berada sendirian? Tidakkah engkau mengetahui bahwa aku tempat yang gelap? Tidakkah engkau mengetahui bahwa aku rumah kebenaran? Apakah yang memperdayakan engkau sehingga engkau masuk ke dalam liangku? Sesungguhnya engkau waktu hidup menyombongkan diri.\"\n\nSederhana atau wajar dalam berjalan dan berbicara bukan berarti berjalan dengan menundukkan kepala dan berbicara dengan lunak. Akan tetapi, maksudnya ialah berjalan dan berbicara dengan sopan dan lemah lembut, sehingga orang merasa senang melihatnya. Adapun berjalan dengan sikap gagah dan wajar, serta berkata dengan tegas yang menunjukkan suatu pendirian yang kuat, tidak dilarang oleh agama.\n\nMenurut suatu riwayat dari 'Aisyah r.a. bahwa beliau melihat seorang laki-laki berjalan menunduk lemah, seakan-akan telah kehilangan kekuatan tubuhnya, maka beliau pun bertanya, \"Mengapa orang itu berjalan terlalu lemah dan lambat?\" Seseorang menjawab, \"Dia adalah seorang fuqaha yang sangat alim.\" Mendengar jawaban itu 'Aisyah berkata, \"Umar adalah penghulu fuqaha, tetapi apabila berjalan, ia berjalan dengan sikap yang gagah, apabila berkata, ia bersuara sedikit keras, dan apabila memukul, maka pukulannya sangat keras.\"",
      "text_translation": "Dan janganlah kamu memalingkan wajah dari manusia (karena sombong) dan janganlah berjalan di bumi dengan angkuh. Sungguh, Allah tidak menyukai orang-orang yang sombong dan membanggakan diri.",
      "text": "وَلَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ وَلَا تَمْشِ فِى الْاَرْضِ مَرَحًاۗ اِنَّ اللّٰهَ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُوْرٍۚ",
      "text_translation_en": "“And turn not thy cheek away from people in [false] pride, and walk not haughtily on earth: for, behold, God does not love anyone who, out of self- conceit, acts in a boastful manner.",
      "juz_number": 21
    },
    "19": {
      "text_tafsir_en": "This verse explains the extension of Lukman's will to his son, that he should behave in a good way, by: 1. Never be arrogant and arrogant, boast and look down on others. The hallmarks of a proud and arrogant person are: - When walking and meeting another person, he turns his face, refuses to speak or shows a friendly attitude. - Walk with a proud attitude, as if he were the most powerful and the most honorable. The word of God: And do not walk on this earth proudly, for you will not pass through the earth, nor can you climb the mountains. (al-Isra '\/ 17: 37) In a hadith, the Messenger of Allah said: Do not hate one another, do not rebel against one another, and do not envy one another, and be the servants of God. It is not permissible for a Muslim to be away from his friend for more than three days. (History of Malik by Anas bin Malik) 2. To be fair, unpretentious and arrogant or arrogant, and to be gentle in speaking, so that those who see and hear him are happy and at peace. Talking loud, arrogant, and arrogant is forbidden by God because that kind of speech is unpleasant, heartbreaking and harsh. It is like God with a donkey's voice that is uncomfortable to hear. Yahya bin Jabir ath-tha'i narrated from Gudhaif bin haris, he said, \"I was sitting near 'Abdullah bin' Amr bin al-'ash, so I heard him say, 'Indeed the grave will speak to the people buried in it he said, \"Son of Adam, who has deceived you, that you have come into my bed? Do you not know that I am the house where you are? Do you not know that I am a dark place? Do you not know that I am the house of truth? who deceiveth thee, and enterest into my loins? surely thy life is proud. Simple or natural in walking and talking does not mean walking down your head and talking softly. However, the purpose is to walk and talk politely and gently, so that people will enjoy seeing it. As for walking in a courageous and reasonable manner, and saying strictly that a strong stand is not prohibited by religion. According to a story from 'Aisha, she saw a man walking low, as if he had lost his strength, so he asked, \"Why is that man so weak and slow?\" Someone replied, \"He is a very pious fuqaha.\" Hearing the answer, 'A'ishah said, \"Umar is the leader of the fuqaha, but when he walks, he walks with a stern attitude.",
      "text_tafsir": "Ayat ini menerangkan lanjutan wasiat Lukman kepada anaknya, yaitu agar anaknya berbudi pekerti yang baik, dengan cara:\n\n1. Jangan sekali-kali bersifat angkuh dan sombong, membanggakan diri dan memandang rendah orang lain. Tanda-tanda seseorang yang bersifat angkuh dan sombong itu ialah:\n\n-Bila berjalan dan bertemu dengan orang lain, ia memalingkan mukanya, tidak mau menegur atau memperlihatkan sikap ramah.\n\n-Berjalan dengan sikap angkuh, seakan-akan ia yang berkuasa dan yang paling terhormat. Firman Allah:\n\nDan janganlah engkau berjalan di bumi ini dengan sombong, karena sesungguhnya engkau tidak akan dapat menembus bumi dan tidak akan mampu menjulang setinggi gunung. (al-Isra'\/17: 37)\n\nDalam sebuah hadis, Rasulullah bersabda:\n\nJanganlah kamu saling membenci, janganlah kamu saling membelakangi dan janganlah kamu saling mendengki, dan jadilah kamu hamba Allah yang bersaudara. Tidak boleh bagi seorang muslim memencilkan (tidak berbaik) dengan temannya lebih dari tiga hari. (Riwayat Malik dari Anas bin Malik)\n\n2. Hendaklah berjalan secara wajar, tidak dibuat-buat dan kelihatan angkuh atau sombong, dan lemah lembut dalam berbicara, sehingga orang yang melihat dan mendengarnya merasa senang dan tenteram hatinya. Berbicara dengan sikap keras, angkuh, dan sombong dilarang Allah karena gaya bicara yang semacam itu tidak enak didengar, menyakitkan hati dan telinga. Hal itu diibaratkan Allah dengan suara keledai yang tidak nyaman didengar.\n\nYahya bin Jabir ath-tha'i meriwayatkan dari Gudhaif bin haris, ia berkata, \"Aku duduk dekat 'Abdullah bin 'Amr bin al-'ash, maka aku mendengar ia berkata, 'Sesungguhnya kubur itu akan berbicara dengan orang yang dikuburkan di dalamnya, ia berkata, 'Hai anak Adam apakah yang telah memperdayakan engkau, sehingga engkau masuk ke dalam liangku? Tidakkah engkau mengetahui bahwa aku rumah tempat engkau berada sendirian? Tidakkah engkau mengetahui bahwa aku tempat yang gelap? Tidakkah engkau mengetahui bahwa aku rumah kebenaran? Apakah yang memperdayakan engkau sehingga engkau masuk ke dalam liangku? Sesungguhnya engkau waktu hidup menyombongkan diri.\"\n\nSederhana atau wajar dalam berjalan dan berbicara bukan berarti berjalan dengan menundukkan kepala dan berbicara dengan lunak. Akan tetapi, maksudnya ialah berjalan dan berbicara dengan sopan dan lemah lembut, sehingga orang merasa senang melihatnya. Adapun berjalan dengan sikap gagah dan wajar, serta berkata dengan tegas yang menunjukkan suatu pendirian yang kuat, tidak dilarang oleh agama.\n\nMenurut suatu riwayat dari 'Aisyah r.a. bahwa beliau melihat seorang laki-laki berjalan menunduk lemah, seakan-akan telah kehilangan kekuatan tubuhnya, maka beliau pun bertanya, \"Mengapa orang itu berjalan terlalu lemah dan lambat?\" Seseorang menjawab, \"Dia adalah seorang fuqaha yang sangat alim.\" Mendengar jawaban itu 'Aisyah berkata, \"Umar adalah penghulu fuqaha, tetapi apabila berjalan, ia berjalan dengan sikap yang gagah, apabila berkata, ia bersuara sedikit keras, dan apabila memukul, maka pukulannya sangat keras.\"",
      "text_translation": "Dan sederhanakanlah dalam berjalan dan lunakkanlah suaramu. Sesungguhnya seburuk-buruk suara ialah suara keledai.”",
      "text": "وَاقْصِدْ فِيْ مَشْيِكَ وَاغْضُضْ مِنْ صَوْتِكَۗ اِنَّ اَنْكَرَ الْاَصْوَاتِ لَصَوْتُ الْحَمِيْرِ ࣖ",
      "text_translation_en": "“Hence, be modest in thy bearing, and lower thy voice: for, behold, the ugliest of all voices is the [loud] voice of asses…”",
      "juz_number": 21
    },
    "20": {
      "text_tafsir_en": "This verse reminds people to ask if they ignore the signs of God's oneness and power in this vast universe. Do they not realize that it is Allah who has subdued them all in this world, that they may benefit from it. He made the sun to shine, and the light became bright. The sun's rays can grow plants that will serve as food for humans. He made the moon and stars shine, which could illuminate the dark night and be a guide for ships passing through the oceans. He brought down rain that watered the earth and nourished plants, and water for human and animal drinks, and some of that water was stored in the soil in preparation for the drought. He made various mines, natural gas, and so on, all of which could be of great benefit to mankind. No one can count the favors of Allah that He has bestowed on man. From Ibn 'Abbas, \"I asked the Prophet (peace be upon him),' O Messenger of Allah, what is the meaning of the external favor? He replied, 'The good of one. (History of al-Baihaqi) There are those who think that adh-dhahirah is the highest health and virtue, and al-bathinah is knowledge and intellect. Some mean adh-dhirah with all the visible benefits of God, such as wealth, grandeur, beauty, and obedience, while al-bathinah is knowledge of God, good faith, knowledge of real life, and so on. Although there are differences in the meaning of adh-dhahirah and al-bathinah, it can be deduced that both are the favors that Allah bestows upon mankind and can sense. At the end of this verse, Allah warns that even though He has bestowed infinite favors on mankind, there are still many people who disobey and deny such favors, such as Nadhar bin haris, Ubay bin Khalaf, and others. They contradict the evidence presented by the Qur'an and the Prophet's call on the basis of science, correct argument, and revelation and the revelation which Allah has revealed.",
      "text_tafsir": "Ayat ini mengingatkan manusia dengan menanyakan apakah mereka tidak memperhatikan tanda-tanda keesaan dan kekuasaan Allah di alam yang luas ini? Apakah mereka tidak memperhatikan bahwa Allah-lah yang menundukkan untuk mereka semua yang ada di alam ini, sehingga mereka dapat mengambil manfaat daripadanya. Dialah yang menjadikan matahari bersinar, sehingga siang menjadi terang benderang. Sinar matahari itu dapat menumbuhkan tumbuh-tumbuhan yang akan menjadi bahan makanan bagi manusia. \n\nBulan dan bintang dijadikan-Nya bercahaya, yang dapat menerangi malam yang gelap dan menjadi petunjuk bagi kapal yang mengarungi lautan. Diturunkannya hujan yang membasahi bumi dan menyuburkan tumbuh-tumbuhan, dan airnya untuk minuman manusia dan binatang, dan sebagian air itu disimpan dalam tanah sebagai persiapan musim kemarau. Dia menjadikan aneka ragam barang tambang, gas alam, dan sebagainya, yang semuanya itu dapat diambil manfaatnya oleh manusia. Tidaklah ada yang sanggup menghitung nikmat Allah yang telah dilimpahkan-Nya kepada manusia. \n\nDari Ibnu 'Abbas r.a., \"Saya bertanya kepada Nabi saw, 'Hai Rasulullah, apa makna nikmat lahiriah? Beliau menjawab, 'Budi baik seseorang. Dan nikmat batiniah adalah dia diberi hidayah beragama Islam.\" (Riwayat al-Baihaqi)\n\nAda orang yang berpendapat bahwa adh-dhahirah ialah kesehatan dan budi pekerti yang luhur, dan al-bathinah ialah pengetahuan dan akal pikiran. Ada pula yang mengartikan adh-dhahirah dengan semua nikmat Allah yang tampak, seperti harta kekayaan, kemegahan, kecantikan, dan ketaatan, sedang al-bathinah ialah pengetahuan tentang Allah, keyakinan yang baik, pengetahuan tentang hakikat hidup yang sebenarnya, dan sebagainya. Sekalipun terdapat perbedaan tentang arti adh-dhahirah dan al-bathinah itu, namun dapat diambil kesimpulan bahwa keduanya merupakan nikmat-nikmat yang dilimpahkan Allah kepada manusia dan dapat dirasakannya.\n\nPada akhir ayat ini, Allah memperingatkan bahwa sekalipun Ia telah melimpahkan nikmat yang tidak terhingga kepada manusia, namun masih banyak manusia yang membantah dan mengingkari nikmat-nikmat itu, seperti Nadhar bin haris, Ubay bin Khalaf, dan lain-lain. Mereka membantah bukti yang dikemukakan Al-Qur'an dan seruan Nabi dengan tidak berdasarkan pada ilmu pengetahuan, hujah yang benar, dan wahyu dan kitab yang diturunkan Allah.",
      "text_translation": "Tidakkah kamu memperhatikan bahwa Allah telah menundukkan apa yang ada di langit dan apa yang ada di bumi untuk (kepentingan)mu dan menyempurnakan nikmat-Nya untukmu lahir dan batin. Tetapi di antara manusia ada yang membantah tentang (keesaan) Allah tanpa ilmu atau petunjuk dan tanpa Kitab yang memberi penerangan.",
      "text": "اَلَمْ تَرَوْا اَنَّ اللّٰهَ سَخَّرَ لَكُمْ مَّا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِ وَاَسْبَغَ عَلَيْكُمْ نِعَمَهٗ ظَاهِرَةً وَّبَاطِنَةً ۗوَمِنَ النَّاسِ مَنْ يُّجَادِلُ فِى اللّٰهِ بِغَيْرِ عِلْمٍ وَّلَا هُدًى وَّلَا كِتٰبٍ مُّنِيْرٍ",
      "text_translation_en": "ARE YOU NOT aware that God has made subservient to you all that is in the heavens and all that is on earth, and has lavished upon you His blessings, both outward and inward? And yet, among men there is many a one that argues about God without having any knowledge [of Him], without any guidance, and without any light-giving revelation;",
      "juz_number": 21
    },
    "21": {
      "text_tafsir_en": "This verse explains that the disbelievers as mentioned above cannot be expected to believe anymore because they are very ignorant and their minds have been covered by blind imitation of their ancestors. Therefore, they no longer ignore the arguments that were put forward. Their nature and attitude are described by Allah in this verse by saying, \"When it is said to those who deny the oneness of Allah, 'Follow what Allah revealed to His Messenger, they answered,' We follow what was taught to us by the father our fathers, and they have taught the true religion and good provisions for us. \" At the end of this verse it is explained that the polytheists continued to follow the religion of their ancestors, even though their parents were not knowledgeable and had never been guided. It shows that in terms of belief, they no longer use the mind, but have been enslaved by lust. Such lust is exhaled and implanted by Satan into the hearts of the infidels, so that they will not be able to see the truth. As a result of that action, they will fall into the punishment of Hell in the hereafter.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang kafir seperti yang disebutkan ayat di atas tidak dapat diharapkan lagi untuk beriman karena mereka sangat ingkar dan pikiran mereka telah ditutupi oleh taklid buta kepada nenek moyang mereka. Oleh karena itu, mereka tidak lagi menghiraukan dalil-dalil yang dike-mukakan. Sifat dan sikap mereka digambarkan Allah dalam ayat ini dengan mengatakan, \"Apabila dikatakan kepada orang-orang yang membantah keesaan Allah itu, 'Ikutilah apa yang diturunkan Allah kepada Rasul-Nya, mereka menjawab, 'Kami mengikuti apa yang telah diajarkan kepada kami oleh bapak-bapak kami, dan mereka telah mengajarkan agama yang benar dan ketentuan-ketentuan yang baik bagi kami.\"\n\nPada akhir ayat ini diterangkan bahwa orang-orang musyrik itu tetap mengikuti agama nenek moyang mereka, walaupun orang-orang tua mereka itu tidak berpengetahuan dan tidak pernah mendapat petunjuk. Hal itu menunjukkan bahwa dalam hal kepercayaan, mereka tidak lagi menggunakan akal pikiran, tetapi telah diperbudak oleh hawa nafsu. Hawa nafsu yang demikian itu diembuskan dan ditanamkan oleh setan ke dalam hati orang-orang kafir, sehingga mereka tidak akan dapat melihat kebenaran. Akibat dari tindakan itu, mereka akan terjerumus ke dalam azab neraka Jahanam di akhirat nanti.",
      "text_translation": "Dan apabila dikatakan kepada mereka, ”Ikutilah apa yang diturunkan Allah!” Mereka menjawab, ”(Tidak), tetapi kami (hanya) mengikuti kebiasaan yang kami dapati dari nenek moyang kami.” Apakah mereka (akan mengikuti nenek moyang mereka) walaupun sebenarnya setan menyeru mereka ke dalam azab api yang menyala-nyala (neraka)?",
      "text": "وَاِذَا قِيْلَ لَهُمُ اتَّبِعُوْا مَآ اَنْزَلَ اللّٰهُ قَالُوْا بَلْ نَتَّبِعُ مَا وَجَدْنَا عَلَيْهِ اٰبَاۤءَنَاۗ اَوَلَوْ كَانَ الشَّيْطٰنُ يَدْعُوْهُمْ اِلٰى عَذَابِ السَّعِيْرِ",
      "text_translation_en": "and when such [people] are told to follow that which God has bestowed from on high, they answer, “Nay, we shall follow that which we found our forefathers believing in and doing!” Why - [would you follow your forefathers] even if Satan had invited them unto the suffering of the blazing flame?",
      "juz_number": 21
    },
    "22": {
      "text_tafsir_en": "This verse explains that those who worship God, bow down to Him, sincerely and earnestly obey His commandments, and forsake all unrighteousness and unrighteousness, have fastened on the knot. The meaning of the word \"mercy\" in this verse is to worship God so earnestly that it is as if confronting him directly, as described in the hadith, that the Prophet saw Gabriel: Tell me about mercy, the Prophet (saw) replied, \" You worship God, as you see him; if you do not see him, he will surely see you. \" (Muslim History of 'Umar) Allah likens those who \"do good\" to those who truly believe in Him, obey His commandments, and stop His prohibitions as mountain climbers, who use ropes tied to a hold. He didn't have to worry because he used a rope with a strong knot and a firm grip. No worries in his heart will fall. At the end of this verse it is explained that all beings return to God alone. Therefore, He is the only one who gives good credit to those who stand firm by giving good rewards.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang menyembah Allah, tunduk dan merendahkan diri kepada-Nya, ikhlas dan sungguh-sungguh dalam melaksanakan perintah-perintah-Nya, dan meninggalkan semua perbuatan maksiat dan mungkar, berarti telah berpegang pada buhul tali yang kukuh.\n\nMaksud perkataan \"ihsan\" dalam ayat ini ialah beribadah kepada Allah dengan sungguh-sungguh, sehingga merasakan seolah-olah berhadapan langsung dengan-Nya, sebagaimana yang diterangkan oleh hadis, bahwa Nabi saw ditanya Jibril:\n\nTerangkanlah kepadaku tentang ihsan, Nabi saw menjawab, \"Bahwa engkau menyembah Allah, seakan-akan engkau melihat-Nya, maka jika engkau tidak melihat-Nya, sesungguhnya Dia melihat engkau.\" (Riwayat Muslim dari 'Umar) \n\nAllah mengibaratkan orang yang melakukan \"ihsan\" yang benar-benar beriman kepada-Nya, taat melaksanakan perintah-perintah-Nya, dan menghentikan larangan-larangan-Nya adalah sebagai pendaki gunung, yang menggunakan tali yang dibundelkan pada tempat berpegang. Ia tidak usah khawatir karena ia menggunakan tali dengan buhul-buhul yang kuat dan kukuh tempat berpegang. Tidak ada kekhawatiran sedikit pun dalam hatinya akan jatuh.\n\nPada akhir ayat ini diterangkan bahwa semua makhluk kembali kepada Allah saja. Oleh karena itu, hanya Dialah yang memberikan penghargaan yang baik kepada orang yang bertawakal dengan memberikan pembalasan yang baik pula.",
      "text_translation": "Dan barangsiapa berserah diri kepada Allah, sedang dia orang yang berbuat kebaikan, maka sesungguhnya dia telah berpegang kepada buhul (tali) yang kokoh. Hanya kepada Allah kesudahan segala urusan.",
      "text": "۞ وَمَنْ يُّسْلِمْ وَجْهَهٗٓ اِلَى اللّٰهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقٰىۗ وَاِلَى اللّٰهِ عَاقِبَةُ الْاُمُوْرِ",
      "text_translation_en": "Now whoever surrenders his whole being unto God, and is a doer of good withal, has indeed taken hold of a support most unfailing: for with God rests the final outcome of all events.",
      "juz_number": 21
    },
    "23": {
      "text_tafsir_en": "This verse is an entertainment to the Prophet and his companions who are saddened by the attitude and behavior of the Muslims. It is as if God said, \"O Prophet, do not grieve over their disbelief, for your mission is only to convey my religion, not to make them believe. They will all return to Me on the Day of Judgment, and it will be proclaimed to them.\" all that they have done in their lives in the world, I will judge them justly, for I know all that is in their hearts. \"",
      "text_tafsir": "Ayat ini merupakan hiburan kepada Nabi saw dan para sahabat yang merasa sedih oleh sikap dan tingkah laku orang-orang musyrik kepada mereka. Seakan-akan Allah mengatakan, \"Hai Nabi, janganlah engkau bersedih hati lantaran kekafiran mereka. Sebab, tugasmu hanya menyampaikan agama-Ku kepada mereka, bukan untuk menjadikan mereka beriman. Mereka semua akan kembali kepada-Ku pada hari Kiamat, lalu dikabarkan kepada mereka segala yang pernah mereka perbuat selama hidup di dunia. Aku akan mengadakan penilaian yang adil terhadapnya karena Aku mengetahui semua yang terkandung di dalam hati mereka.\"",
      "text_translation": "Dan barangsiapa kafir maka kekafirannya itu janganlah menyedihkanmu (Muhammad). Hanya kepada Kami tempat kembali mereka, lalu Kami beritakan kepada mereka apa yang telah mereka kerjakan. Sesungguhnya Allah Maha Mengetahui segala isi hati.",
      "text": "وَمَنْ كَفَرَ فَلَا يَحْزُنْكَ كُفْرُهٗۗ اِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُمْ بِمَا عَمِلُوْاۗ اِنَّ اللّٰهَ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
      "text_translation_en": "But as for him who is bent on denying the truth - let not his denial grieve thee: unto Us they must return, and then We shall make them [truly] understand all that they were doing [in life]: for, verily, God has full knowledge of what is in the hearts [of men].",
      "juz_number": 21
    },
    "24": {
      "text_tafsir_en": "This verse explains to unbelievers that they are only given temporary and temporary pleasures. During that little time, they could use the favors provided by God and enjoy the pleasures of life. However, temporary pleasure is of no use in comparison to ukhrawi pleasure. The temporary enjoyment will be lost, as if they had never experienced it, when they encountered a painful torment in hell. This is reinforced by another word of God: Say, \"Those who make lies against Allah will not prosper.\" (For them) the pleasure (of the moment) in the world, and then to us they return, and then We feel upon them a heavy torment, for their disbelief. (Jonah \/ 10: 69-70)",
      "text_tafsir": "Ayat ini menerangkan kepada orang-orang kafir bahwa mereka hanya diberi kesenangan hidup yang sebentar dan bersifat sementara. Selama waktu yang sedikit itu, mereka dapat mempergunakan nikmat-nikmat yang disediakan Allah dan mengecap kesenangan hidup. Akan tetapi, kesenangan sementara itu tidak ada artinya sama sekali jika dibandingkan dengan kesenangan ukhrawi. Kesenangan sementara itu akan hilang, seakan-akan tidak pernah mereka alami, di saat mereka menemui azab yang pedih di alam neraka nanti. Hal ini dikuatkan oleh firman Allah yang lain:\n\nKatakanlah, \"Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tidak akan beruntung.\" (Bagi mereka) kesenangan (sesaat) ketika di dunia, selanjutnya kepada Kamilah mereka kembali, kemudian Kami rasakan kepada mereka azab yang berat, karena kekafiran mereka. (Yunus\/10: 69-70)",
      "text_translation": "Kami biarkan mereka bersenang-senang sebentar, kemudian Kami paksa mereka (masuk) ke dalam azab yang keras.",
      "text": "نُمَتِّعُهُمْ قَلِيْلًا ثُمَّ نَضْطَرُّهُمْ اِلٰى عَذَابٍ غَلِيْظٍ",
      "text_translation_en": "We will let them enjoy them­selves for a short while - but in the end We shall drive them into suffering severe.",
      "juz_number": 21
    },
    "25": {
      "text_tafsir_en": "This verse expresses the ignorance and paganism of the Muslims towards the religion of their ancestors. The proof of their ignorance is that Allah declares, \"And if you ask those who disbelieve, O Muhammad, concerning the One who created the heavens and the earth, they will answer that He who created both them and what is in them is Allah.\" Their confession is the true confession, and they will have to answer for it, because it is very clear that this nature is God. According to that confession they should worship and dedicate themselves to God alone, for He is the rightful God. However, their actions and attitudes are contrary to their acknowledgment of associating God with something that is neither beneficial nor harmful. Then Allah taught His Messenger that when the Muslims answered, then say, \"Praise be to Allah.\" Because with such an answer, they have acknowledged their mistake in worshiping what should not be worshiped. Allah also warns that if they do an act contrary to their own confession, it is because most of the Muslims do not know who deserves the praise and expressions of gratitude of man. In the confession of the unbelievers there is a statement that although they rejected the Prophet Muhammad, but because they believed that the universe was God's creation, they were in fact acknowledging the apostasy. According to logic and reason, God has created this world, including human beings, of course He will not let it go. God, of course, sends his apostles to give his people advice and guidance.",
      "text_tafsir": "Ayat ini menyatakan kebodohan dan kefanatikan orang-orang musyrik terhadap agama nenek moyang mereka. Bukti kebodohan mereka itu dinyatakan Allah, \"Dan jika engkau tanyakan kepada orang-orang musyrik itu, hai Muhammad, tentang siapa yang menciptakan langit dan bumi, mereka akan menjawab bahwa yang menciptakan keduanya itu dan apa yang terdapat di dalamnya adalah Allah.\"\n\nPengakuan mereka ini adalah pengakuan yang benar, dan mereka akan terpaksa menjawab demikian, karena memang sudah amat jelas bahwa yang menjadikan alam ini adalah Allah. Berdasarkan pengakuan itu seharusnya mereka menyembah dan menghambakan diri kepada Allah saja, karena Dialah Tuhan yang berhak disembah. Akan tetapi, perbuatan dan sikap mereka itu berlawanan dengan pengakuan mereka karena mempersekutukan Allah dengan sesuatu yang tidak memberi manfaat dan tidak pula memberi mudarat.\n\nKemudian Allah mengajarkan kepada Rasul-Nya bahwa di kala orang-orang musyrik itu menjawab demikian, maka ucapkanlah, \"Segala puji bagi Allah.\" Karena dengan jawaban semacam itu, mereka telah mengakui kesalahan mereka menyembah apa yang sepatutnya tidak disembah. \n\nAllah memperingatkan pula bahwa jika mereka melakukan perbuatan yang berlawanan dengan pengakuan mereka sendiri, maka hal itu disebabkan karena kebanyakan dari orang-orang musyrik itu tidak mengetahui siapa yang berhak mendapat pujian dan ungkapan syukur manusia. Pada pengakuan kaum musyrik itu terdapat suatu kenyataan bahwa walaupun mereka mendustakan Nabi Muhammad, tetapi karena mereka percaya bahwa alam semesta ini adalah ciptaan Tuhan, maka pada hakikatnya mereka mengakui kerasulan. Menurut logika dan pikiran, Allah telah menciptakan alam ini, termasuk manusia, tentu Ia tidak akan melepaskannya begitu saja. Tuhan tentu mengirim rasul-rasul untuk memberi taufik dan hidayah-Nya kepada manusia.",
      "text_translation": "Dan sungguh, jika engkau (Muhammad) tanyakan kepada mereka, ”Siapakah yang menciptakan langit dan bumi?” Tentu mereka akan menjawab, ”Allah.” Katakanlah, ”Segala puji bagi Allah,” tetapi kebanyakan mereka tidak mengetahui.",
      "text": "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ لَيَقُوْلُنَّ اللّٰهُ ۗقُلِ الْحَمْدُ لِلّٰهِ ۗبَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ",
      "text_translation_en": "AND THUS it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth?” - they will surely answer, “God.” Say: “[Then you ought to know that] all praise is due to God!”- for most of them do not know [what this implies].",
      "juz_number": 21
    },
    "26": {
      "text_tafsir_en": "Only God has the heavens and the earth and everything in it, nothing else because He created it. He is the one who arranges, maintains, maintains, and determines the ending. He does according to His will. Therefore, it is proper to be praised and praised, and also deserves to be thanked. He does not need anything from His creatures. From this verse it can be understood that according to Islam, this treasure belongs to Allah. Humans are only loaned and allowed to use them, according to religious provisions. Therefore, Allah could forcibly take all of human possessions. However, because God knows that human beings are stingy, He does not do that. God only takes part of the property that must be tasted. In this case, the waliyyul-amri (government) has the right to take, if necessary by force, the wealth of zakat that is available to Muslims, to be distributed in the way of Allah.",
      "text_tafsir": "Hanya Allah yang memiliki langit dan bumi beserta segala sesuatu yang ada di dalamnya, tidak ada yang lain karena Dialah yang menciptakannya. Dialah yang mengatur, menjaga, memelihara, dan menentukan akhir kejadiannya. Dia berbuat menurut apa yang dikehendaki-Nya. Oleh karena itu, pantaslah ia dipuji dan disanjung, serta pantas pula dipanjatkan syukur kepada-Nya. Dia tidak memerlukan sesuatu apa pun dari makhluk-Nya.\n\nDari ayat ini dapat dipahami bahwa menurut agama Islam, harta ini adalah milik Allah. Manusia hanya dipinjamkan dan diperbolehkan untuk memanfaatkannya, sesuai dengan ketentuan-ketentuan agama. Oleh karena itu, Allah bisa saja mengambil secara paksa seluruh milik manusia. Namun demikian, karena Allah tahu bahwa manusia mempunyai sifat kikir, maka Ia tidak melakukan hal itu. Allah hanya mengambil sebagian dari harta yang wajib dizakati. Dalam hal ini, waliyyul-amri (pemerintah) berhak mengambil, kalau perlu secara paksa, harta zakat yang ada pada kaum Muslimin, untuk disalurkan pada jalan Allah.",
      "text_translation": "Milik Allah-lah apa yang di langit dan di bumi. Sesungguhnya Allah, Dialah Yang Mahakaya, Maha Terpuji.",
      "text": "لِلّٰهِ مَا فِى السَّمٰوٰتِ وَالْاَرْضِۗ اِنَّ اللّٰهَ هُوَ الْغَنِيُّ الْحَمِيْدُ",
      "text_translation_en": "Unto God belongs all that is in the heavens and on earth. Verily, God alone is self-sufficient, the One to whom all praise is due!",
      "juz_number": 21
    },
    "27": {
      "text_tafsir_en": "It is reported that when the Prophet was still in Mecca, the verse came down: And they ask you about the Spirit. Say, \"The Spirit belongs to the business of my Lord, but you are given a little knowledge.\" (al-Isra '\/ 17: 85) When they emigrated to Medina, the Prophet came to the Jewish monks. They said, \"O Muhammad, it is upon us that you say, 'and you are not given the knowledge but a little. Do you mean us by that word, or your people?\" The Prophet replied, \"All that I mean.\" They said, \"Have you not read in the book which was revealed to you that the law was revealed to us, and in it is knowledge of all things?\" The Messenger of Allah said, \"The knowledge of the Torah is small, compared to the knowledge of Allah, and verily Allah has revealed to me something which, if you practice, will surely benefit you.\" They said, \"O Muhammad, why are you saying this, while you are saying, 'and to whom is wisdom given so much good? How is it possible to gather in something, little knowledge and much good?\" So Allah sent down this verse in answer. This verse describes the breadth of God's knowledge. It is said that if all the trees on the earth were made into a pen to record the knowledge of God, and all the waters of the sea were made into ink, and then added seven times as much, then the word of God was not yet written. In another verse, Allah says: Say (Muhammad), \"If the sea becomes ink to (write) the words of my Lord, then the sea must be consumed before the completion of my Lord's words, though We bring forth such (more) . \" (al-Kahf \/ 18: 109) The meaning of \"the word of God\" in this verse abounds, including the power of God, the essence of all things, the provisions and the words of God, the knowledge and all of His creation. In addition, it also includes the creation of heaven and earth with everything in it, from the great to the smallest, from the largest of animals to the thousands of the most delicate bacteria. Various plants, animals on the horizon with all the rules and many more, all included in the word of God. In this verse it is affirmed that Allah Almighty demands his claim. All His wishes and decisions must be fulfilled and He is wise in all His actions.",
      "text_tafsir": "Diriwayatkan bahwa tatkala Rasulullah masih berada di Mekah turunlah ayat:\n\nDan mereka bertanya kepadamu (Muhammad) tentang ruh. Katakanlah, \"Ruh itu termasuk urusan Tuhanku, sedangkan kamu diberi pengetahuan hanya sedikit.\" (al- Isra'\/17: 85)\n\nTatkala berhijrah ke Medinah, Rasulullah datang kepada rahib-rahib Yahudi. Mereka berkata, \"Ya Muhammad, telah sampai kepada kami bahwa engkau berkata, 'dan tidaklah kamu diberi pengetahuan melainkan sedikit. Apakah kami yang kamu maksudkan dengan perkataan itu, atau kaummu?\" Rasulullah menjawab, \"Semuanya yang aku maksudkan.\" Mereka berkata, \"Bukankah telah engkau baca dalam kitab yang diturunkan kepadamu bahwa kepada kami telah diturunkan Taurat dan di dalamnya terdapat ilmu tentang segala sesuatu.\" Rasulullah berkata, \"Ilmu dalam Taurat itu sedikit, jika dibandingkan dengan ilmu Allah, dan sesungguhnya Allah menurunkan kepadaku sesuatu, yang jika kamu amalkan, niscaya akan memberi manfaat kepadamu.\" Mereka berkata, \"Ya Muhammad, kenapa kamu mengatakan demikian, sedang engkau mengatakan, 'dan barang siapa yang diberi hikmah, sungguh telah diberikan kebajikan yang banyak. Bagaimana mungkin berkumpul pada sesuatu, ilmu yang sedikit dan kebaikan yang banyak?\" Maka Allah menurunkan ayat ini sebagai jawaban.\n\nAyat ini menerangkan tentang keluasan ilmu Allah. Hal ini diibaratkan bahwa seandainya seluruh pohon-pohon yang di muka bumi dijadikan pena untuk mencatat ilmu Allah itu, dan seluruh air laut dijadikan tintanya, kemudian ditambah dengan tujuh kali sebanyak itu, maka kalimat Allah itu belum juga habis tertulis. Dalam ayat lain, Allah berfirman:\n\nKatakanlah (Muhammad), \"Seandainya lautan menjadi tinta untuk (menulis) kalimat-kalimat Tuhanku, maka pasti habislah lautan itu sebelum selesai (penulisan) kalimat-kalimat Tuhanku, meskipun Kami datangkan tambahan sebanyak itu (pula).\" (al- Kahf\/18: 109)\n\nArti \"kalimat Allah\" dalam ayat ini banyak sekali, termasuk di dalamnya kekuasaan Allah, hakikat segala sesuatu, ketentuan dan perkataan Allah, ilmu dan segala macam ciptaan-Nya. Di samping itu, juga termasuk ke dalamnya penciptaan langit dan bumi dengan segala macam yang ada di dalamnya, sejak dari yang besar sampai kepada yang halus, sejak dari binatang yang paling besar sampai kepada ribuan bakteri yang paling halus. Tumbuh-tumbuhan yang beraneka ragam, binatang-binatang yang ada di cakrawala dengan segala aturan-aturan dan banyak lagi yang lain yang tidak terhitung jumlahnya, semuanya termasuk dalam kalimat Allah.\n\nPada ayat ini ditegaskan bahwa Allah Mahakeras tuntutan-Nya. Segala kehendak dan keputusan-Nya pasti terlaksana dan Dia Maha Bijaksana dalam segala tindakan-Nya.",
      "text_translation": "Dan seandainya pohon-pohon di bumi menjadi pena dan lautan (menjadi tinta), ditambahkan kepadanya tujuh lautan (lagi) setelah (kering)nya, niscaya tidak akan habis-habisnya (dituliskan) kalimat-kalimat Allah. Sesungguhnya Allah Mahaperkasa, Mahabijaksana.",
      "text": "وَلَوْ اَنَّ مَا فِى الْاَرْضِ مِنْ شَجَرَةٍ اَقْلَامٌ وَّالْبَحْرُ يَمُدُّهٗ مِنْۢ بَعْدِهٖ سَبْعَةُ اَبْحُرٍ مَّا نَفِدَتْ كَلِمٰتُ اللّٰهِ ۗاِنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ",
      "text_translation_en": "And if all the trees on earth were pens, and the sea [were] ink, with seven [morel seas yet added to it, the words of God would not be exhausted: for, verily, God is almighty, wise.",
      "juz_number": 21
    },
    "28": {
      "text_tafsir_en": "This verse explains that making things easy for God. Whether making something big, small, complicated, or making something in small amounts, everything is the same for God. Likewise raising people from their graves on the Day of Judgment is easy for Allah. Raising up all humanity for God is no different than raising a person. Nothing is difficult for Him. If God wants something to happen, it is enough that He says, \"Kun\" (be), then be what He wants it to be. Allah says: Surely His business when He wants something He only says to him, \"Be!\" Then be something. (Yasin \/ 36: 82) And the word of God: And Our commands are only (with) one word like the blink of an eye. (al-Qamar \/ 54: 50) At the end of this verse, Allah states that He hears all the words of His servants and See All their deeds.",
      "text_tafsir": "Ayat ini menerangkan bahwa menjadikan segala sesuatu merupakan hal yang mudah bagi Allah. Apakah menjadikan sesuatu yang besar, kecil, ruwet, atau menjadikan sesuatu dalam jumlah yang sedikit, semuanya sama saja bagi Allah. Begitu pula membangkitkan manusia dari dalam kuburnya di hari Kiamat adalah mudah bagi Allah. Membangkitkan seluruh manusia bagi Allah tidak ubahnya seperti membangkitkan seorang saja. Tidak ada sesuatu pun yang sukar bagi-Nya. Jika Allah berkehendak terjadinya sesuatu, cukuplah Dia mengucapkan, \"Kun\" (jadilah), maka jadilah yang dikehendaki-Nya itu. Allah berfirman:\n\nSesungguhnya urusan-Nya apabila Dia menghendaki sesuatu Dia hanya berkata kepadanya, \"Jadilah!\" Maka jadilah sesuatu itu. (Yasin\/36: 82) \n\nDan firman Allah:\n\nDan perintah Kami hanyalah (dengan) satu perkataan seperti kejapan mata. (al-Qamar\/54: 50)\n\nPada akhir ayat ini, Allah menyatakan bahwa Dia mendengar segala perkataan hamba-Nya dan Maha Melihat segala perbuatan mereka.",
      "text_translation": "Menciptakan dan membangkitkan kamu (bagi Allah) hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja (mudah). Sesungguhnya Allah Maha Mendengar, Maha Melihat.",
      "text": "مَا خَلْقُكُمْ وَلَا بَعْثُكُمْ اِلَّا كَنَفْسٍ وَّاحِدَةٍ ۗاِنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ",
      "text_translation_en": "[For Him,] the creation of you all and the resurrection of you all is but like [the creation and resurrection of] a single soul: for, verily, God is all-hearing, all-seeing.",
      "juz_number": 21
    },
    "29": {
      "text_tafsir_en": "In this verse, God tells people to pay attention to His power. He enters the night into the day, and the day into the night. The point is that God takes part of the night, and then he adds it to the daytime, and then the extension of the day, instead of the night, is short, but the night remains 24 hours. It happens in the summer. Meanwhile, God also took part of the day, and then he put in the night, so that the night would be longer, and the day also shorter. It happens in winter. The above incidents are very apparent and are experienced by the people of the states located in the districts that have four seasons of the year, namely summer, autumn, winter, and spring, namely the Northern and Southern regions. As for the states in the equator, there are only two seasons, the dry season and the rainy season. While at night times are longer than day, or day longer than night, the difference is not felt because the difference in short length of night or daytime is not significant. Occurs four different seasons a year, and occurs longer than that night or vice versa in the North and South Midlands, because God tilted the earth at a latitude of 22 ½ degrees, as it is known in Astronomy. They all contain great wisdom. God also subjugates the sun and the moon for the benefit of man. Sunlight is a light that illuminates people during the day, so that they can work and work. Sunlight also nourishes plants, creates wind and clouds, and many other uses. Similarly, the moon, its light and its various shapes, are of great use to mankind, but only a small portion of them are known. The moon and the sun circulate in their orbits, in accordance with the decrees that God has decreed, until the time appointed by Him. When the appointed time comes, the heavens and the earth will be rolled up, as God says: (Remember) in the day of Heaven We roll like rolls of sheets. (al-Anbiya '\/ 21: 104) At the end of this verse it is stated that Allah knows all that His servant has done, whether it is good or bad. Nothing escapes His knowledge. Allah will give him a just retribution.",
      "text_tafsir": "Dalam ayat ini, Allah menyuruh manusia memperhatikan dan memikirkan kekuasaan-Nya. Dia memasukkan malam kepada siang, dan memasukkan siang kepada malam. Maksudnya ialah bahwa Allah mengambil sebagian dari waktu malam, lalu ditambahkannya kepada waktu siang, maka terjadilah perpanjangan waktu siang itu, sebaliknya malam menjadi pendek, akan tetapi sehari semalam tetap 24 jam. Hal ini terjadi pada musim panas. Sementara itu, Allah juga mengambil sebagian dari waktu siang, lalu dimasukkan-Nya kepada waktu malam, maka menjadi panjanglah waktu malam itu, dan sebaliknya waktu siang menjadi pendek. Hal ini terjadi di musim dingin.\n\nKejadian seperti di atas amat jelas kelihatannya dan dialami oleh penduduk negeri-negeri yang terletak di daerah-daerah yang mempunyai empat macam musim dalam setahun, yaitu musim panas, musim gugur, musim dingin, dan musim semi, yaitu daerah Sedang Utara dan Sedang Selatan. Adapun di negeri-negeri yang berada di daerah khatulistiwa, maka dalam setahun hanya ada dua musim, yaitu musim kemarau dan musim hujan. Sedang pada saat-saat malam lebih panjang dari siang, atau siang lebih panjang dari malam, perbedaan itu tidak terasa karena perbedaan panjang pendeknya malam atau siang itu tidak seberapa.\n\nTerjadinya empat macam musim dalam setahun, dan terjadinya siang lebih panjang dari malam itu atau sebaliknya di daerah Sedang Utara dan Sedang Selatan, adalah karena Allah memiringkan letak bumi di garis lintang 22 Â½ derajat, sebagaimana yang dikenal dalam Ilmu Falak. Semua itu mengandung hikmah-hikmah yang sangat besar.\n\nAllah juga menundukkan matahari dan bulan untuk kepentingan manusia. Sinar matahari merupakan lampu yang menerangi manusia di siang hari, sehingga mereka dapat bekerja dan berusaha. Sinar matahari juga menyuburkan tumbuh-tumbuhan, menimbulkan angin dan awan, serta berbagai kegunaan lainnya. Demikian pula bulan dan cahayanya serta berlainan bentuknya, amat banyak kegunaannya bagi manusia, tetapi sebagian kecil saja dari kegunaan itu yang diketahuinya.\n\nBulan dan matahari beredar di garis orbitnya masing-masing, sesuai dengan ketentuan yang telah ditentukan Allah, sampai kepada waktu yang telah ditentukan-Nya. Apabila waktu yang telah ditentukan itu datang, maka langit dan bumi akan digulung, sebagaimana firman Allah:\n\n(Ingatlah) pada hari langit Kami gulung seperti menggulung lembaran-lembaran kertas. (al-Anbiya'\/21: 104) \n\nPada akhir ayat ini dinyatakan bahwa Allah mengetahui segala perbuatan yang telah dikerjakan hamba-Nya, apakah itu perbuatan baik ataupun perbuatan buruk. Tidak ada yang luput dari pengetahuan-Nya. Allah akan memberinya pembalasan yang adil.",
      "text_translation": "Tidakkah engkau memperhatikan, bahwa Allah memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan Dia menundukkan matahari dan bulan, masing-masing beredar sampai kepada waktu yang ditentukan. Sungguh, Allah Mahateliti apa yang kamu kerjakan.",
      "text": "اَلَمْ تَرَ اَنَّ اللّٰهَ يُوْلِجُ الَّيْلَ فِى النَّهَارِ وَيُوْلِجُ النَّهَارَ فِى الَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَۖ  كُلٌّ يَّجْرِيْٓ اِلٰٓى اَجَلٍ مُّسَمًّى وَّاَنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
      "text_translation_en": "Art thou not aware that it is God who makes the night grow longer by shortening the day, and makes the day grow longer by shortening the night, and that He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him] and that God is fully aware of all that you do?",
      "juz_number": 21
    },
    "30": {
      "text_tafsir_en": "This verse explains that the purpose of God to show His signs of His power to man is to be a strong proposition and proof to them that man is obligated to worship Him and that He alone is worthy of worship. Worshiping or worshiping other than God is an act of futility because everything besides Him is mortal, not eternal. He is omnipotent and needs no other, while all beings are highly dependent on His favor. Finally, this verse confirms that God is all-powerful, all-powerful, all-powerful, and all-powerful. All submit to and obey Him. (31) In this verse, God commands man to see the signs of his power and greatness on earth by saying, \"Do you not see, O Muhammad, the ark that sailed across the ocean connecting the distant lands. \" With that connection, the people of one state will know the people of another state. The needs and needs of the natives can be taken and transported by ships from other countries, such as food, clothing, medicines, jewelry, machinery, and so on. With the existence of these ships, it is as if the relations between these nations and the nations of the world are drawing closer. The ship was first built by Noah in accordance with the command of God in the mission of human salvation plus a number of animals (more on Surah Hud \/ 40: 40). However, with human reasoning, ship technology has evolved. The ship is not only made of wood but is also developed using metal. Although in recent times with the development of materials technology, humans have been able to \"formulate\" the materials available to be lightweight, compact, easy to form, strong, weatherproof, and resistant. Iron should be submerged, since the mass of the metal is much higher than the mass of the water, but with the use of science and technology (iptek), by applying the law of Archimides (physics), the iron can float on the surface of the water. The fact is that the law of physics is the decree of God. It is the decree of God that can feel its benefits in human life. That is the true favor of God. All that God has described is evidence of His great power and greatness for those who endure all kinds of trials and tribulations, and for those who are grateful for the gifts of God bestowed upon them. The mark of a person who is grateful to God is by expressing gratitude in the form of words or deeds when receiving the favor. As-Sya'bi says, \"Patience is part of faith, gratitude is part of faith, and belief is faith in the whole. Do you not notice the word of God found at the end of this verse and his words:\" wa fi al-ardhi ayatun li al-muqinin \"(and on the earth there are signs of the power of Allah for those who believe) and the Messenger of Allah (may peace be upon him) said: Faith is of two parts, some in patience and some in gratitude. )",
      "text_tafsir": "Ayat ini menerangkan bahwa tujuan Allah memperlihatkan tanda-tanda kekuasaan-Nya kepada manusia adalah untuk menjadi dalil dan bukti yang kuat bagi mereka bahwa manusia wajib beribadah kepada-Nya dan hanyalah Dia yang berhak disembah. Menyembah atau beribadah kepada selain Allah adalah tindakan yang batil karena semua yang selain Dia adalah fana, tidak kekal. Dia Mahakaya dan tidak memerlukan yang lain, sedangkan semua makhluk sangat tergantung kepada nikmat-Nya.\n\nAkhirnya ayat ini menegaskan bahwa Allah Mahatinggi, mengatasi segala sesuatu, Mahabesar, dan menguasai segala sesuatu. Semua tunduk dan patuh kepada-Nya.\n\n(31) Pada ayat ini, Allah memerintahkan agar manusia melihat tanda-tanda kekuasaan dan kebesaran-Nya yang ada di bumi dengan mengatakan, \"Apakah tidak engkau perhatikan, hai Muhammad, bahtera yang berlayar di lautan yang menghubungkan negeri-negeri yang berjauhan letaknya.\" Dengan adanya hubungan itu, penduduk suatu negeri akan mengenal penduduk negeri lain. Keperluan dan kebutuhan rakyat yang tidak ada di negerinya dapat diambil dan diangkut oleh kapal-kapal dari negeri-negeri yang lain, seperti bahan makanan, pakaian, obat-obatan, perhiasan, mesin-mesin, dan sebagainya. Dengan adanya kapal-kapal itu, seakan-akan hubungan antara bangsa-bangsa dan negara-negara dewasa ini semakin dekat.\n\nKapal dibuat pertama kali oleh Nabi Nuh sesuai dengan perintah Allah dalam misi penyelamatan manusia beriman ditambah dengan sejumlah pasangan hewan (lebih lanjut baca Surah Hud\/11: 40). Namun demikian, dengan kemampuan berpikir manusia, maka teknologi kapal berkembang. Kapal tidak saja dibuat dari bahan kayu saja bahkan sudah berkembang dengan menggunakan logam. Walaupun akhir-akhir ini dengan berkembangnya teknologi bahan, manusia telah mampu \"meramu\" dari bahan yang tersedia menjadi bahan yang lebih ringan, kompak, mudah dibentuk, kuat, tahan cuaca, dan tahan benturan. Besi yang mestinya tenggelam, karena massa jenis logam jauh lebih besar di atas massa jenis air, tetapi dengan pemanfaatan ilmu pengetahuan dan teknologi (iptek), yakni dengan menerapkan hukum Archimides (fisika), maka besi tadi dapat mengapung di permukaan air. Hakikatnya hukum fisika itu adalah ketetapan Allah. Ketetapan Allah yang dapat dirasakan manfaatnya dalam kehidupan manusia. Itulah nikmat Allah yang sesungguhnya.\n\nSemua yang diterangkan Allah itu adalah bukti-bukti atas kekuasaan dan kebesaran-Nya yang nyata bagi orang-orang yang sabar dalam menghadapi segala macam cobaan dan kesukaran, serta bagi orang-orang yang mensyukuri nikmat-nikmat Allah yang telah dilimpahkan kepadanya. Tanda orang bersyukur kepada Allah itu ialah dengan menyatakan ungkapan syukur dalam bentuk perkataan atau perbuatan ketika menerima nikmat itu.\n\nAsy-Sya'bi berkata, \"Sabar itu adalah sebagian dari iman, syukur itu adalah sebagian iman, dan yakin adalah iman seluruhnya. Tidakkah engkau perhatikan firman Allah yang terdapat pada akhir ayat ini dan firman-Nya: \"wa fi al-ardhi ayatun li al-muqinin\" (dan pada bumi itu terdapat tanda-tanda kekuasaan Allah bagi orang-orang yang yakin) dan sabda Rasulullah saw:\n\nIman itu ada dua bagian, yaitu sebagian dalam sabar dan sebagian dalam syukur. (Riwayat al-Baihaqi dari Anas)",
      "text_translation": "Demikianlah, karena sesungguhnya Allah, Dialah (Tuhan) yang sebenarnya dan apa saja yang mereka seru selain Allah adalah batil. Dan sesungguhnya Allah, Dialah Yang Mahatinggi, Mahabesar.",
      "text": "ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ وَاَنَّ مَا يَدْعُوْنَ مِنْ دُوْنِهِ الْبَاطِلُۙ وَاَنَّ اللّٰهَ هُوَ الْعَلِيُّ الْكَبِيْرُ ࣖ",
      "text_translation_en": "Thus it is, because God alone is the Ultimate Truth, so that all that men invoke instead of Him is sheer falsehood; and because God alone is exalted, truly great!",
      "juz_number": 21
    },
    "31": {
      "text_tafsir_en": "This verse explains that the purpose of God to show His signs of His power to man is to be a strong proposition and proof to them that man is obligated to worship Him and that He alone is worthy of worship. Worshiping or worshiping other than God is an act of futility because everything besides Him is mortal, not eternal. He is omnipotent and needs no other, while all beings are highly dependent on His favor. Finally, this verse confirms that God is all-powerful, all-powerful, all-powerful, and all-powerful. All submit to and obey Him.",
      "text_tafsir": "Ayat ini menerangkan bahwa tujuan Allah memperlihatkan tanda-tanda kekuasaan-Nya kepada manusia adalah untuk menjadi dalil dan bukti yang kuat bagi mereka bahwa manusia wajib beribadah kepada-Nya dan hanyalah Dia yang berhak disembah. Menyembah atau beribadah kepada selain Allah adalah tindakan yang batil karena semua yang selain Dia adalah fana, tidak kekal. Dia Mahakaya dan tidak memerlukan yang lain, sedangkan semua makhluk sangat tergantung kepada nikmat-Nya.\n\nAkhirnya ayat ini menegaskan bahwa Allah Mahatinggi, mengatasi segala sesuatu, Mahabesar, dan menguasai segala sesuatu. Semua tunduk dan patuh kepada-Nya.",
      "text_translation": "Tidakkah engkau memperhatikan bahwa sesungguhnya kapal itu berlayar di laut dengan nikmat Allah, agar diperlihatkan-Nya kepadamu sebagian dari tanda-tanda (kebesaran)-Nya. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran)-Nya bagi setiap orang yang sangat sabar dan banyak bersyukur.",
      "text": "اَلَمْ تَرَ اَنَّ الْفُلْكَ تَجْرِيْ فِى الْبَحْرِ بِنِعْمَتِ اللّٰهِ لِيُرِيَكُمْ مِّنْ اٰيٰتِهٖۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ",
      "text_translation_en": "Art thou not aware how the ships speed through the sea by God’s favour, so that He might show you some of His wonders? Herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grate­ful [to God].",
      "juz_number": 21
    },
    "32": {
      "text_tafsir_en": "In this verse, Allah instructs people to see the signs of His power and greatness on earth by saying, \"Do you not pay attention, O Muhammad, the ark that sails in the ocean that connects the distant lands.\" With this connection, residents of one country will get to know the residents of another country. The needs and needs of people who are not in their country can be taken and transported by ships from other countries, such as food, clothing, medicines, jewelry, machinery, and so on. With the existence of these ships, it is as if the relationship between nations and countries is now getting closer. The ship was first made by the Prophet Noah in accordance with Allah's command in the mission of saving believers plus a number of pairs of animals (more read Surah Hud \/ 11: 40). However, with the ability to think humans, ship technology developed. The ship is not only made from wood, it has even been developed using metal. Although lately with the development of materials technology, humans have been able to \"mix\" from available materials into materials that are lighter, compact, malleable, strong, weather resistant, and impact resistant. Iron that should sink, because the density of metals is much greater than the density of water, but with the use of science and technology (science and technology), namely by applying the law of Archimides (physics), the iron can float on the surface of water. The essence of the laws of physics is the decree of God. The provision of God that can be felt the benefits in human life. That is the real favor of Allah. All that is explained by God is the evidence of His power and greatness that is evident for those who are patient in facing all kinds of trials and hardships, and for those who are grateful for the blessings of God that has been bestowed on him. The sign of people thanking God is by expressing expressions of gratitude in the form of words or deeds when receiving the favor. Asy-Shay'bi said, \"Patience is part of faith, gratitude is part of faith, and sure is total faith. Don't you notice the word of God contained at the end of this verse and his words:\" wa fi al-ardhi ayatun li al-muqinin \"(and on that earth there are signs of Allah's power for those who are sure) and the words of the Messenger of Allah: The faith is divided into two parts, namely a part in patience and part in gratitude. (Al-Baihaqi's history from Anas )",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan agar manusia melihat tanda-tanda kekuasaan dan kebesaran-Nya yang ada di bumi dengan mengatakan, \"Apakah tidak engkau perhatikan, hai Muhammad, bahtera yang berlayar di lautan yang menghubungkan negeri-negeri yang berjauhan letaknya.\" Dengan adanya hubungan itu, penduduk suatu negeri akan mengenal penduduk negeri lain. Keperluan dan kebutuhan rakyat yang tidak ada di negerinya dapat diambil dan diangkut oleh kapal-kapal dari negeri-negeri yang lain, seperti bahan makanan, pakaian, obat-obatan, perhiasan, mesin-mesin, dan sebagainya. Dengan adanya kapal-kapal itu, seakan-akan hubungan antara bangsa-bangsa dan negara-negara dewasa ini semakin dekat.\n\nKapal dibuat pertama kali oleh Nabi Nuh sesuai dengan perintah Allah dalam misi penyelamatan manusia beriman ditambah dengan sejumlah pasangan hewan (lebih lanjut baca Surah Hud\/11: 40). Namun demikian, dengan kemampuan berpikir manusia, maka teknologi kapal berkembang. Kapal tidak saja dibuat dari bahan kayu saja bahkan sudah berkembang dengan menggunakan logam. Walaupun akhir-akhir ini dengan berkembangnya teknologi bahan, manusia telah mampu \"meramu\" dari bahan yang tersedia menjadi bahan yang lebih ringan, kompak, mudah dibentuk, kuat, tahan cuaca, dan tahan benturan. Besi yang mestinya tenggelam, karena massa jenis logam jauh lebih besar di atas massa jenis air, tetapi dengan pemanfaatan ilmu pengetahuan dan teknologi (iptek), yakni dengan menerapkan hukum Archimides (fisika), maka besi tadi dapat mengapung di permukaan air. Hakikatnya hukum fisika itu adalah ketetapan Allah. Ketetapan Allah yang dapat dirasakan manfaatnya dalam kehidupan manusia. Itulah nikmat Allah yang sesungguhnya.\n\nSemua yang diterangkan Allah itu adalah bukti-bukti atas kekuasaan dan kebesaran-Nya yang nyata bagi orang-orang yang sabar dalam menghadapi segala macam cobaan dan kesukaran, serta bagi orang-orang yang mensyukuri nikmat-nikmat Allah yang telah dilimpahkan kepadanya. Tanda orang bersyukur kepada Allah itu ialah dengan menyatakan ungkapan syukur dalam bentuk perkataan atau perbuatan ketika menerima nikmat itu.\n\nAsy-Sya'bi berkata, \"Sabar itu adalah sebagian dari iman, syukur itu adalah sebagian iman, dan yakin adalah iman seluruhnya. Tidakkah engkau perhatikan firman Allah yang terdapat pada akhir ayat ini dan firman-Nya: \"wa fi al-ardhi ayatun li al-muqinin\" (dan pada bumi itu terdapat tanda-tanda kekuasaan Allah bagi orang-orang yang yakin) dan sabda Rasulullah saw:\n\nIman itu ada dua bagian, yaitu sebagian dalam sabar dan sebagian dalam syukur. (Riwayat al-Baihaqi dari Anas)",
      "text_translation": "Dan apabila mereka digulung ombak yang besar seperti gunung, mereka menyeru Allah dengan tulus ikhlas beragama kepada-Nya. Tetapi ketika Allah menyelamatkan mereka sampai di daratan, lalu sebagian mereka tetap menempuh jalan yang lurus. Adapun yang mengingkari ayat-ayat Kami hanyalah pengkhianat yang tidak berterima kasih.",
      "text": "وَاِذَا غَشِيَهُمْ مَّوْجٌ كَالظُّلَلِ دَعَوُا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ ەۚ فَلَمَّا نَجّٰىهُمْ اِلَى الْبَرِّ فَمِنْهُمْ مُّقْتَصِدٌۗ وَمَا يَجْحَدُ بِاٰيٰتِنَآ اِلَّا كُلُّ خَتَّارٍ كَفُوْرٍ",
      "text_translation_en": "For [thus it is with most men:] when the waves engulf them like shadows [of death], they call unto God, sincere [at that moment] in their faith in Him alone: but as soon as He has brought them safe ashore, some of them stop half-way [between belief and unbelief] Yet none could knowingly reject Our messages unless he be utterly perfidious, ingrate.",
      "juz_number": 21
    },
    "33": {
      "text_tafsir_en": "This verse describes the nature of the monks by drawing them, \"When the idolaters and worshipers of the gods sailed into the sea, suddenly a great wave came and swept their ships left and right, and felt that they will not be saved, they will die by the waves, and then they will return to their nature, praying earnestly to the Almighty God at the same time they are convinced that there is nothing that can save them except God alone, just as Pharaoh had done when he was about to drown in the sea. At the end of this verse, God asserts that those who disregard His revelations and return to the fellowship of God are the ones who his life is full of deception and decay, and disregards the favor of God. (33) In this verse, God commands men to carry out the commandments and keep away from the forbidden. God who created man and created heaven and earth with all its contents for his sake. Humans must fear on the day of a terrible catastrophe, and no one will be able to rescue them. At that time, a father could not help his son, nor could a son help his father, because all things were in the hand of God. Every person is responsible for everything he or she does. They bear their own sins. Only the good deeds that he has done during his life on earth can save humanity from such tragedy. God warns that His promise to raise people from the grave is something that will surely happen and a truth that cannot be doubted. Therefore, let men never be deceived by the pleasures of life in the world and all the pleasures of it, so that they strive and spend all their time to obtain and enjoy worldly pleasures. As a result, there is no more time to worship God, and to do good deeds and charity. Whereas the hereafter is the real life, the eternal and the better. In the same way God warns people of the deception of the devil, who is always looking for opportunities to deceive mankind. The devil makes the life of the world beautiful in his eyes, so that they forget the task that God has given them as the caliphate of fil-ardh.",
      "text_tafsir": "Ayat ini menerangkan sifat-sifat orang-orang musyrik dengan melukiskan mereka, \"Apabila orang-orang musyrik penyembah patung dan pemuja dewa itu berlayar ke tengah lautan, tiba-tiba datang gelombang besar dan menghempaskan bahtera mereka ke kiri dan ke kanan, dan merasa bahwa mereka tidak akan selamat, bahkan akan mati ditelan gelombang, maka di saat itulah mereka kembali kepada fitrahnya, dengan berdoa kepada Tuhan Yang Maha Esa dengan setulus-tulusnya. Pada saat serupa itu mereka berkeyakinan bahwa tidak ada sesuatupun yang dapat menyelamatkan mereka kecuali Allah semata, seperti yang pernah dilakukan Fir'aun di saat-saat ia akan tenggelam di laut.\n\nSetelah Allah menerima doa dan menyelamatkan mereka dari amukan gelombang itu, maka di antara mereka hanya sebagian saja yang tetap mengakui keesaan Allah, adapun yang lainnya kembali menyekutukan Tuhan. \n\nPada akhir ayat ini, Allah menegaskan bahwa yang mengingkari ayat-ayat-Nya itu dan kembali mempersekutukan Tuhan ialah orang-orang yang dalam hidupnya penuh dengan tipu daya dan kebusukan, serta mengingkari nikmat Allah.\n\n(33) Pada ayat ini, Allah memerintahkan kepada manusia untuk melaksanakan perintah-perintah dan menjauhkan diri dari hal-hal yang dilarang. Tuhan yang telah menciptakan manusia dan menciptakan langit dan bumi dengan segala isinya untuk kepentingannya. Manusia hendaklah takut pada hari dimana terjadi malapetaka yang dahsyat, tidak seorang pun yang dapat menyelamatkan dirinya dari malapetaka itu. Pada waktu itu, seorang ayah tidak kuasa menolong anaknya, demikian pula seorang anak tidak dapat menolong bapaknya, karena segala urusan waktu itu berada di tangan Allah. Tiap-tiap orang bertanggung jawab terhadap segala perbuatan yang telah dilakukannya. Mereka memikul dosanya masing-masing. Hanya perbuatan baik yang telah dilakukannya selama hidup di dunia yang dapat menolong manusia dari malapetaka itu.\n\nAllah memperingatkan bahwa janji-Nya membangkitkan manusia dari kubur adalah sesuatu yang benar-benar akan terjadi dan suatu kebenaran yang tidak dapat diragukan sedikit pun. Oleh karena itu, janganlah sekali-kali manusia tertipu oleh kesenangan hidup di dunia dan segala kenikmatan yang ada padanya, sehingga mereka berusaha dan menghabiskan seluruh waktu yang ada untuk memperoleh dan menikmati kesenangan-kesenangan duniawi. Akibatnya, tidak ada waktu lagi untuk beribadah kepada Allah, serta mengerjakan kebajikan dan amal saleh. Padahal kehidupan akhirat itulah kehidupan yang sebenarnya, kehidupan yang kekal dan lebih baik.\n\nDemikian pula Allah memperingatkan manusia akan tipu daya setan, yang selalu mencari-cari kesempatan untuk memperdaya manusia. Setan itu menjadikan kehidupan dunia itu indah dalam pandangan matanya, sehingga mereka lupa kepada tugas yang dipikulkan Allah kepada mereka sebagai khalifatullah fil ardh (makhluk yang diberi-Nya tugas memakmurkan bumi).",
      "text_translation": "Wahai manusia! Bertakwalah kepada Tuhanmu dan takutlah pada hari yang (ketika itu) seorang bapak tidak dapat menolong anaknya, dan seorang anak tidak dapat (pula) menolong bapaknya sedikit pun. Sungguh, janji Allah pasti benar, maka janganlah sekali-kali kamu teperdaya oleh kehidupan dunia, dan jangan sampai kamu teperdaya oleh penipu dalam (menaati) Allah.",
      "text": "يٰٓاَيُّهَا النَّاسُ اتَّقُوْا رَبَّكُمْ وَاخْشَوْا يَوْمًا لَّا يَجْزِيْ وَالِدٌ عَنْ وَّلَدِهٖۖ وَلَا مَوْلُوْدٌ هُوَ جَازٍ عَنْ وَّالِدِهٖ شَيْـًٔاۗ اِنَّ وَعْدَ اللّٰهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيٰوةُ الدُّنْيَاۗ وَلَا يَغُرَّنَّكُمْ بِاللّٰهِ الْغَرُوْرُ",
      "text_translation_en": "O MEN! Be conscious of your Sustainer, and stand in awe of the Day on which no parent will be of any avail to his child, nor a child will in the least avail his parent! Verily, God’s promise [of resurrection] is true in­deed: let not, then, the life of this world deludes you, and let not [your own] deceptive thoughts about God delude you!",
      "juz_number": 21
    },
    "34": {
      "text_tafsir_en": "In this verse, God describes five supernatural things that only He knows: 1. Only God knows when the Day of Resurrection will come. Not one creature knows even though it is an angel, but the angel is the one closest to him. This is also unknown to the prophets sent. No one (of them) can explain the time of his existence other than Him. (al-A'raf \/ 7: 187) 2. Only Allah sends rain. He determines when, where, and how much water he will pour. This ruling no one knows about. 3. Only God can know exactly what is in a woman's womb, whether it is defective or perfect, and when she will be born. 4. Only He knows exactly what someone will do tomorrow. Even though humans can plan what they are going to do, it is all just a matter of plan. If God wills, the work will be done. However, if He does not want to, it will not be difficult for Him to prevent it. 5. Someone doesn't know where he will die later. Whether on land, in the ocean, or in the air. Whether in this country, or in another country. Only God can know for sure. Ibn Mundzir, from 'Ikrimah, tells us that a man named al-Waris bin' Amr bin came to the Prophet (peace be upon him) and asked, \"O Muhammad, when will the Day of Judgment come? Our earth is dry, when will it be fertile? I left my wife in childbirth, when will she give birth? I know what I am doing now, so what will I do tomorrow? I know where I was born, so where will I die? According to al-Bukhari and Muslim from Ibn 'Umar, the Messenger of Allah (may peace be upon him) said: There are five keys to the supernatural, \"Only in Allah is knowledge of the Day of Judgment. It is He Who sends rain, He knows what is in the womb, One does not know what He will do tomorrow, Nor does He know on earth where He will die. Verily, Allah is All-Knowing, All-Merciful. \"(Ibn 'Umar's al-Bukhari and Muslim History)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan lima perkara gaib yang hanya Dia yang mengetahuinya, yaitu:\n\n1. Hanya Allah yang mengetahui kapan datangnya Hari Kiamat. Tidak ada satu makhluk pun yang mengetahui meskipun itu malaikat, padahal malaikat adalah makhluk yang paling dekat dengan-Nya. Hal ini juga tidak diketahui oleh para nabi yang diutus.\n\nTidak ada (seorang pun) yang dapat menjelaskan waktu terjadinya selain Dia. (al-A'raf\/7: 187) \n\n2. Hanya Allah yang menurunkan hujan. Dia yang menetapkan kapan, dimana, dan berapa banyak kadar air yang akan dicurahkan-Nya. Ketetapan ini tidak seorang pun yang dapat mengetahuinya. \n\n3. Hanya Allah yang dapat mengetahui dengan pasti apa yang ada dalam kandungan seorang perempuan, apakah cacat atau sempurna, dan kapan ia akan dilahirkan.\n\n4. Hanya Dia pula yang mengetahui dengan pasti apa yang akan dikerjakan oleh seseorang esok harinya. Sekalipun manusia dapat merencanakan apa yang akan dikerjakannya itu, namun semuanya itu hanyalah bersifat rencana saja. Jika Allah menghendaki, pekerjaan itu akan terlaksana. Akan tetapi, jika Ia tidak menghendaki, tidak sukar bagi-Nya untuk menghalangi terlaksananya.\n\n5. Seseorang tidak mengetahui di mana ia akan meninggal dunia nanti. Apakah di daratan, di lautan, ataupun di udara. Apakah di negeri ini, atau di negeri yang lain. Hanya Allah saja yang dapat mengetahuinya dengan pasti.\n\nDiriwayatkan dari Ibnu Mundzir dari 'Ikrimah bahwa seorang laki-laki bernama al-Waris bin 'Amr bin harisah datang kepada Nabi saw, ia bertanya, \"Ya Muhammad, kapan akan datang hari Kiamat? Bumi kita telah kering, kapan akan menjadi subur? Sesungguhnya aku meninggalkan istriku dalam keadaan hamil, kapan ia akan melahirkan? Aku mengetahui apa yang aku kerjakan sekarang, maka apakah yang akan aku kerjakan esok harinya? Aku mengetahui tempat aku dilahirkan, maka di tempat manakah aku akan meninggal? Sebagai jawabannya, turunlah ayat ini.\n\nDiriwayatkan oleh al-Bukhari dan Muslim dari Ibnu 'Umar bahwa Rasulullah saw bersabda:\n\nKunci masalah yang gaib itu ada lima, \"Sesungguhnya hanya pada Allah sajalah pengetahuan tentang Hari Kiamat. Dialah yang menurunkan hujan, Dia mengetahui apa yang dalam rahim, seseorang tidak mengetahui apa yang akan dikerjakannya esok harinya, dan ia juga tidak mengetahui di bumi mana ia akan meninggal dunia. Sesungguhnya Allah Maha Mengetahui lagi Maha Penyayang.\" (Riwayat al-Bukhari dan Muslim dari Ibnu 'Umar)",
      "text_translation": "Sesungguhnya hanya di sisi Allah ilmu tentang hari Kiamat; dan Dia yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. Dan tidak ada seorang pun yang dapat mengetahui (dengan pasti) apa yang akan dikerjakannya besok. Dan tidak ada seorang pun yang dapat mengetahui di bumi mana dia akan mati. Sungguh, Allah Maha Mengetahui, Maha Mengenal.",
      "text": "اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِۚ وَيُنَزِّلُ الْغَيْثَۚ وَيَعْلَمُ مَا فِى الْاَرْحَامِۗ وَمَا تَدْرِيْ نَفْسٌ مَّاذَا تَكْسِبُ غَدًاۗ وَمَا تَدْرِيْ نَفْسٌۢ بِاَيِّ اَرْضٍ تَمُوْتُۗ اِنَّ اللّٰهَ عَلِيْمٌ خَبِيْرٌ ࣖ",
      "text_translation_en": "Verily, with God alone rests the knowledge of when the Last Hour will come: and He [it is who] sends down rain; and He [alone] knows what is in the wombs: whereas no one knows what he will reap tomorrow, and no one knows in what land he will die, Verily. God [alone] is all-knowing, all-aware.",
      "juz_number": 21
    }
  },
  "name": "لقمٰن",
  "name_translation_en": "Luqman",
  "name_translation": "Luqman",
  "name_latin": "Luqman"
}