{
  "number": 32,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 30,
  "ayat": {
    "1": {
      "text_tafsir_en": "See Alif Lam Mim's Interpretation of Surah al-Baqarah \/ 2: 1 (Volume I).",
      "text_tafsir": "Lihat Tafsir Alif Lam Mim pada Surah al-Baqarah\/2: 1 (Jilid I).",
      "text_translation": "Alif Lam Mim.",
      "text": " الۤمّۤ ۗ ",
      "text_translation_en": "Alif. Lam. Mim.",
      "juz_number": 21
    },
    "2": {
      "text_tafsir_en": "This verse explains that the Qur'an given to Muhammad is a revelation from Allah, the Lord of the universe. This Qur'an is not a sorcerer, it is not a magic spell, nor is it Muhammad's, no doubt about it. This verse is an objection to the claim of unbelievers that the Qur'an is a poem composed by a poet, and some say the composition of a magician. Some say that the Qur'an is only ancient myths, and some say that it was made by Muhammad. Allah said: And they said, \"(That is) the tales of the ancients, who were asked to write them, and recited them every morning and evening.\" (al-Furqan \/ 25: 5)",
      "text_tafsir": "Ayat ini menerangkan bahwa Al-Qur'an yang diturunkan kepada Muhammad ini benar-benar wahyu dari Allah, Tuhan semesta alam. Al- Qur'an ini bukanlah buatan tukang sihir, bukan mantra-mantra tukang tenung, dan bukan pula buatan Muhammad, tidak ada keraguan padanya sedikit pun.\n\nAyat ini merupakan bantahan bagi dakwaan orang-orang kafir yang menyatakan bahwa Al-Qur'an ini adalah syair yang digubah oleh penyair, dan ada yang mengatakan gubahan tukang tenung. Ada juga yang mengatakan bahwa Al-Qur'an itu hanyalah dongengan-dongengan purbakala saja, serta ada pula yang mengatakan bahwa dia adalah buatan Muhammad.\n\nAllah berfirman:\n\nDan mereka berkata, \"(Itu hanya) dongeng-dongeng orang-orang terdahulu, yang diminta agar dituliskan, lalu dibacakanlah dongeng itu kepadanya setiap pagi dan petang.\" (al-Furqan\/25: 5)",
      "text_translation": "Turunnya Al-Qur'an itu tidak ada keraguan padanya, (yaitu) dari Tuhan seluruh alam. ",
      "text": "تَنْزِيْلُ الْكِتٰبِ لَا رَيْبَ فِيْهِ مِنْ رَّبِّ الْعٰلَمِيْنَۗ ",
      "text_translation_en": "The bestowal from on high of this divine writ issues, beyond any doubt, from the Sustainer of all the worlds:",
      "juz_number": 21
    },
    "3": {
      "text_tafsir_en": "This verse explains that the attitude of the unbelievers as described in the above verse is inappropriate. It is not fitting that they accuse Muhammad of lying by saying that he had fabricated the Qur'an, but they did indeed know Muhammad's circumstances, from his childhood until he was an adult and was appointed an apostle. They even gave it a title of \"Al-Amin\" (people of faith) because they believed in Muhammad. However, they suddenly accuse him of lying. Therefore, Allah affirms that everything Muhammad said was true. The Qur'an really came from Allah and was revealed to him to warn the unbelievers of the Hereafter to be given to those who disobey the Messenger sent to them. The Qur'an contains lessons and instructions that lead them to the path of eternal happiness. In another verse the attitude of the Muslims towards the Qur'an is also mentioned. Allah says: And the disbelievers say, \"(The Qur'an) is nothing but a lie that he (Muhammad) has created, assisted by others,\" big. (al-Furqan \/ 25: 4)",
      "text_tafsir": "Ayat ini menerangkan bahwa sikap orang-orang musyrik seperti yang diterangkan ayat di atas adalah sikap yang tidak layak. Tidak pantas mereka menuduh Muhammad telah melakukan kedustaan dengan mengatakan bahwa ia telah membuat-buat Al-Qur'an, padahal mereka benar-benar telah mengetahui keadaan Muhammad, sejak ia masih kecil sampai ia dewasa dan diangkat menjadi rasul. Bahkan mereka memberi gelar dengan \"Al-Amin\" (orang kepercayaan) karena mereka sangat percaya kepada Muhammad. Akan tetapi, tiba-tiba mereka menuduhnya sebagai pendusta.\n\nOleh karena itu, Allah menegaskan bahwa semua yang disampaikan Muhammad itu adalah benar. Al-Qur'an benar-benar berasal dari Allah dan diturunkan kepadanya untuk memperingatkan orang-orang musyrik pada azab akhirat yang akan ditimpakan kepada orang-orang yang mengingkari rasul yang diutus kepada mereka. Al-Qur'an berisi pelajaran dan petunjuk yang mengantar mereka menuju jalan kebahagiaan abadi.\n\nPada ayat yang lain dinyatakan pula sikap orang-orang musyrik itu terhadap Al-Qur'an. Allah berfirman:\n\nDan orang-orang kafir berkata, \"(Al-Qur'an) ini tidak lain hanyalah kebohongan yang diada-adakan oleh dia (Muhammad), dibantu oleh orang-orang lain,\" Sungguh, mereka telah berbuat zalim dan dusta yang besar. (al-Furqan\/25: 4)",
      "text_translation": "Tetapi mengapa mereka (orang kafir) mengatakan, “Dia (Muhammad) telah mengada-adakannya.” Tidak, Al-Qur'an itu kebenaran (yang datang) dari Tuhanmu, agar engkau memberi peringatan kepada kaum yang belum pernah didatangi orang yang memberi peringatan sebelum engkau; agar mereka mendapat petunjuk.",
      "text": "اَمْ يَقُوْلُوْنَ افْتَرٰىهُ ۚ بَلْ هُوَ الْحَقُّ مِنْ رَّبِّكَ لِتُنْذِرَ قَوْمًا مَّآ اَتٰىهُمْ مِّنْ نَّذِيْرٍ مِّنْ قَبْلِكَ لَعَلَّهُمْ يَهْتَدُوْنَ",
      "text_translation_en": "and yet, they [who are bent on denying the truth] assert, “[Muhammad] has invented it!” Nay, but it is the truth from thy Sustainer, enabling thee to warn [this] people to whom no warner has come before thee, so that they might follow the right path.",
      "juz_number": 21
    },
    "4": {
      "text_tafsir_en": "This verse explains that the God who revealed the Qur'an to Muhammad saw was the Creator of heaven and earth and everything between them in six times. The meaning of the six times in this verse is not the day (time) known today, but the day before heaven and earth. The present day is after the existence of heaven and earth, and after the existence of the earth around the sun and so on. After creating the heavens and the earth, God rested upon the Throne, according to His power and greatness. (see al-A'raf \/ 7: 54) Allah asserts that no one can take care of all his affairs, reject danger, disaster, and torment. No one can intercede when the punishment is upon him, except Allah, for He is the Almighty. Then Allah warned, \"Do you people not learn and think what you always see? Why do you still worship other than Allah?\"",
      "text_tafsir": "Ayat ini menerangkan bahwa Tuhan yang telah menurunkan Al-Qur'an kepada Muhammad saw itu adalah Tuhan Pencipta langit dan bumi dan segala sesuatu yang ada di antara keduanya dalam enam masa. Maksud enam masa dalam ayat ini bukanlah hari (masa) yang dikenal seperti sekarang ini, tetapi adalah hari sebelum adanya langit dan bumi. Hari pada waktu sekarang ini adalah setelah adanya langit dan bumi, serta setelah adanya peredaran bumi mengelilingi matahari dan sebagainya.\n\nSetelah menciptakan langit dan bumi, Allah pun bersemayam di atas 'Arasy, sesuai dengan kekuasaan dan kebesaran-Nya. (lihat al-A'raf\/7: 54) Allah menegaskan bahwa tidak seorang pun yang dapat mengurus segala urusannya, menolak bahaya, malapetaka, dan siksa. Tidak seorang pun yang dapat memberi syafaat ketika azab menimpanya, kecuali Allah semata, karena Dialah Yang Mahakuasa menentukan segala sesuatu.\n\nKemudian Allah memperingatkan, \"Apakah kamu hai manusia tidak dapat mengambil pelajaran dan memikirkan apa yang selalu kamu lihat itu? Kenapa kamu masih juga menyembah selain Allah?\"",
      "text_translation": "Allah yang menciptakan langit dan bumi dan apa yang ada di antara keduanya dalam enam masa, kemudian Dia bersemayam di atas ‘Arsy. Bagimu tidak ada seorang pun penolong maupun pemberi syafaat selain Dia. Maka apakah kamu tidak memperhatikan?",
      "text": "اَللّٰهُ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَيْنَهُمَا فِيْ سِتَّةِ اَيَّامٍ ثُمَّ اسْتَوٰى عَلَى الْعَرْشِۗ مَا لَكُمْ مِّنْ دُوْنِهٖ مِنْ وَّلِيٍّ وَّلَا شَفِيْعٍۗ  اَفَلَا تَتَذَكَّرُوْنَ",
      "text_translation_en": "IT IS GOD who has created the heavens and the earth and all that is between them in six aeons, and is established on the throne of His almightiness. You have none to protect you from God, and none to intercede for you [on Judgment Day]: will you not, then, bethink yourselves?",
      "juz_number": 21
    },
    "5": {
      "text_tafsir_en": "Only God controls, organizes, organizes, and consumes everything in this world. Everything that happened was in accordance with His will and determination, there was nothing that deviated from His will. The arrangement of God began from heaven to earth, and the affair returned to Him. Everything mentioned in this verse is a reflection of the greatness and power of God, so that people can easily understand it. Then He also describes the time God used to manage, organize, and complete the affairs of this universe, that is, for one day. However, the size of a day is about 1000 years the size of a human being known in the world. The word millennium in Arabic does not always mean 1000 in the true sense, but it is sometimes used to describe how much or how much time it takes. In this verse the number of a thousand is used to denote the length of time of the life of this universe from the first creation of God to its destruction on the Day of Judgment, and then the return of all matters into the hands of God, the day of vengeance. It all took a very long time, making it difficult for humans to calculate. In another verse, the words of thousands are used to describe the length of time it would take for humans to ascend to God, even though the angels need only one day. God said: The angels and Gabriel ascended to God, in a day, equivalent to fifty thousand years. (al-Ma'arij \/ 70: 4) Some think that the meaning of this verse is that all matters of this world return to God on the Day of Judgment in a single day, the same as 1000 years of time in this world. Some disbelievers interpret this verse, \"The angels ascended to God in heaven one day. If it were to be traveled by none other than the angels, it would take 1000 years.\" The Messenger of Allah (may peace be upon him) during the night mi'raj ascended to heaven with the angel Gabriel before Allah. The distance was approximately half a night.",
      "text_tafsir": "Hanya Allah-lah yang mengurus, mengatur, mengadakan, dan melenyapkan segala yang ada di dunia ini. Segala yang terjadi itu adalah sesuai dengan kehendak dan ketetapan-Nya, tidak ada sesuatu pun yang menyimpang dari kehendak-Nya itu. Pengaturan Allah dimulai dari langit hingga sampai ke bumi, kemudian urusan itu naik kembali kepada-Nya.\n\nSemua yang tersebut pada ayat ini merupakan gambaran dari kebesaran dan kekuasaan Allah, agar manusia mudah memahaminya. Kemudian Dia menggambarkan pula waktu yang digunakan Allah mengurus, mengatur, dan menyelesaikan segala urusan alam semesta ini, yaitu selama sehari. Akan tetapi, ukuran sehari itu sama lamanya dengan 1000 tahun dari ukuran tahun yang dikenal manusia di dunia ini.\n\nPerkataan seribu tahun dalam bahasa Arab tidak selamanya berarti 1000 dalam arti sebenarnya, tetapi kadang-kadang digunakan untuk menerangkan banyaknya sesuatu jumlah atau lamanya waktu yang diperlukan. Dalam ayat ini bilangan seribu itu digunakan untuk menyatakan lamanya waktu kehidupan alam semesta ini sejak diciptakan Allah pertama kali sampai kehancurannya di hari Kiamat, kemudian kembalinya segala urusan ke tangan Allah, yaitu hari berhisab. Semua itu menempuh waktu yang lama sekali, sehingga sukar bagi manusia menghitungnya.\n\nDalam ayat yang lain digunakan perkataan ribuan itu untuk menerangkan lamanya waktu yang dibutuhkan seandainya manusia ingin naik menghadap Allah, sekalipun para malaikat hanya perlu sehari saja. Allah berfirman:\n\nPara malaikat dan Jibril naik (menghadap) kepada Tuhan, dalam sehari setara dengan lima puluh ribu tahun. (al-Ma'arij\/70: 4)\n\nAda pula yang berpendapat bahwa maksud ayat ini ialah segala urusan dunia ini kembali kepada Allah di hari Kiamat dalam waktu satu hari, yang sama lamanya dengan 1000 tahun waktu di dunia ini. Sebagian mufasir menafsirkan ayat ini, \"Para malaikat naik kepada Allah ke langit dalam satu hari. Jika jarak itu ditempuh oleh selain malaikat, maka ia memerlukan waktu 1000 tahun.\"\n\nRasulullah saw dalam malam mi'raj pernah naik ke langit bersama malaikat Jibril menghadap Allah. Jarak itu ditempuh dalam waktu kurang lebih setengah malam.",
      "text_translation": "Dia mengatur segala urusan dari langit ke bumi, kemudian (urusan) itu naik kepada-Nya dalam satu hari yang kadarnya (lamanya) adalah seribu tahun menurut perhitunganmu.",
      "text": "يُدَبِّرُ الْاَمْرَ مِنَ السَّمَاۤءِ اِلَى الْاَرْضِ ثُمَّ يَعْرُجُ اِلَيْهِ فِيْ يَوْمٍ كَانَ مِقْدَارُهٗٓ اَلْفَ سَنَةٍ مِّمَّا تَعُدُّوْنَ",
      "text_translation_en": "He governs all that exists, from the celestial space to the earth; and in the end all shall ascend unto Him [for judgment] on a Day the length whereof will be [like] a thousand years of your reckoning.",
      "juz_number": 21
    },
    "6": {
      "text_tafsir_en": "This verse explains that the God who created, arranged, and administered the heavens and the earth and everything in it is the All-Knowing God. He is All-Knowing everything that is unseen, hidden in the heart, what will happen, and what has happened. He also knows all that can be seen and what cannot be seen by the eye. He is the Almighty God, His Eternal Grace and He also Who created all creatures in good form, in harmony with the benefits and uses that only He knows. If we pay attention to all creatures in this world from the big to the smallest, there will be an allegation that there are some creatures that have great benefits and some that are considered to be useless or not useful at all, can even cause danger to humans , like poisonous snakes, pests of infectious diseases, plants that contain poisons, and so on. This conjecture will arise if each creature is seen separately, not in a single universe. If the creatures are seen in a single universe, where between one and another have a close relationship, it will be seen that all creatures have benefits and their usefulness in maintaining the balance and preservation of this nature. It is even apparent that the efforts of some humans, intentionally or unintentionally, to destroy and kill some living things, cause pollution in nature, so that its sustainability is disrupted. One example is the presence of pesticides, many worms and bacteria are destroyed. As a result, the process of spoilage becomes disrupted. Though bacteria and worms are considered animals that have no use at all. Deforestation results in deforested land, resulting in many floods and landslides in the rainy season, and drought in the dry season. All of that is due to human greed. That can be categorized as a destructive act on earth. The consequences can be broad and give a domino effect (streak). Based on the above explanation, it is evident that everything created by God has its benefits, but many people do not want to pay attention to it. Then this verse explains that He created man from the ground. The point is that God created Adam from the ground and then created the children of Adam's grandchildren from the starch extract which was obtained by the father and mother from food in the form of animals and plants that all came from the ground. In verse 7 it is stated that man was created from the ground, but in this verse it is stressed that only in the beginning was man created from the ground. With this verse it can also be interpreted that there is another phase after the beginning of creation before the creation becomes human. If this indeed happens, many other questions remain, including (1) whether the beginning of human creation is the same as and the beginning of the creation of other living creatures of the earth (see interpretation of Surah al-An'am verse 2), (2) whether phase after the initial creation of human beings develop through intermediate forms as well as the evolutionary process of other living things that are now widely believed (see Surah ar-Rum \/ 30 verse 20), or (3) humans are created through a special process that is different from other living things (al -Ahzab \/ 33 verse 33).",
      "text_tafsir": "Ayat ini menerangkan bahwa Tuhan yang menciptakan, mengatur, dan mengurus langit dan bumi serta segala yang ada padanya itu adalah Tuhan Yang Maha Mengetahui. Dia Maha Mengetahui segala yang gaib, yang tersembunyi dalam hati, yang akan terjadi, dan yang telah terjadi. Dia juga Maha Mengetahui segala yang dapat dilihat dan yang tidak dapat dilihat oleh mata. Dialah Tuhan Yang Mahakuasa, Mahakekal Rahmat-Nya dan Dia pulalah Yang menciptakan seluruh makhluk dengan bentuk yang baik, serasi serta dengan faedah dan kegunaan yang hanya Dia saja yang mengetahuinya.\n\nJika diperhatikan seluruh makhluk yang ada di alam ini sejak dari yang besar sampai kepada yang sekecil-kecilnya akan timbul dugaan bahwa di antara makhluk itu ada yang besar faedahnya dan ada pula yang dirasa tidak berfaedah atau tidak berguna sama sekali, bahkan dapat menimbulkan bahaya bagi manusia, seperti ular berbisa, hama-hama penyakit menular, tanaman yang mengandung racun, dan sebagainya. Dugaan ini akan timbul jika masing-masing makhluk itu dilihat secara terpisah, tidak dalam satu kesatuan alam semesta ini.\n\nJika makhluk-makhluk itu dilihat dalam satu kesatuan alam semesta, dimana antara yang satu dengan yang lain mempunyai hubungan erat, akan terlihat bahwa semua makhluk itu ada faedah dan kegunaannya dalam menjaga keseimbangan dan kelestarian alam ini. Bahkan terlihat dengan nyata bahwa usaha-usaha sebagian manusia, baik secara sengaja atau tidak, merusak dan membunuh sebagian makhluk hidup, menimbulkan pencemar-an di alam ini, sehingga kelestariannya terganggu. Salah satu contoh ialah dengan adanya obat pembasmi hama, banyak cacing dan bakteri yang musnah. Akibatnya, proses pembusukan sampah menjadi terganggu. Padahal bakteri dan cacing itu dianggap binatang yang tidak ada gunanya sama sekali. Penebangan hutan mengakibatkan tanah menjadi gundul, sehingga banyak terjadi banjir dan tanah longsor di musim hujan, serta kekeringan pada musim kemarau. \n\nSemua itu akibat keserakahan manusia. Hal itu bisa dikategorikan sebagai perbuatan merusak di bumi. Akibat yang ditimbulkannya bisa luas dan memberi efek domino (beruntun).\n\nBerdasarkan paparan di atas nyatalah bahwa segala sesuatu yang diciptakan Allah, ada faedahnya, tetapi banyak manusia yang tidak mau memperhatikannya.\n\nKemudian ayat ini menerangkan bahwa Dia menciptakan manusia dari tanah. Maksudnya ialah Allah menciptakan Adam dari tanah kemudian menciptakan anak cucu Adam dari sari pati tanah yang diperoleh oleh ayah dan ibu dari makanan berupa hewan dan tumbuh-tumbuhan yang semuanya berasal dari tanah.\n\nDalam ayat 7 dinyatakan bahwa manusia diciptakan dari tanah, tetapi pada ayat ini ditegaskan bahwa hanya pada permulaannya saja manusia diciptakan dari tanah. Dengan ayat ini dapat pula ditafsirkan bahwa ada fase lain setelah awal penciptaan sebelum ciptaan tersebut menjadi manusia. Jika hal tersebut memang terjadi demikian, banyak pertanyaan lain yang masih tersisa, antara lain (1) apakah awal penciptaan manusia sama dan bersamaan dengan awal penciptaan makhluk hidup bumi lainnya (lihat tafsir Surah al- An'am ayat 2), (2) apakah fase setelah penciptaan awal tersebut manusia berkembang melalui bentuk antara seperti halnya proses evolusi makhluk hidup lainnya yang kini banyak dipercayai (lihat Surah ar-Rum\/30 ayat 20), atau (3) manusia tercipta melalui proses khusus yang berbeda dari makhluk hidup lainnya (al-Ahzab\/33 ayat 33).",
      "text_translation": "Yang demikian itu, ialah Tuhan yang mengetahui yang gaib dan yang nyata, Yang Mahaperkasa, Maha Penyayang.",
      "text": "ذٰلِكَ عٰلِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيْزُ الرَّحِيْمُۙ ",
      "text_translation_en": "Such is He who knows all that is beyond the reach of a created being’s perception, as well as all that can be witnessed by a creature’s senses or mind: the Almighty, the Dispenser of Grace,",
      "juz_number": 21
    },
    "7": {
      "text_tafsir_en": "This verse explains that the God who created, arranged, and administered the heavens and the earth and everything in it is the All-Knowing God. He is All-Knowing everything that is unseen, hidden in the heart, what will happen, and what has happened. He also knows all that can be seen and what cannot be seen by the eye. He is the Almighty God, His Eternal Grace and He also Who created all creatures in good form, in harmony with the benefits and uses that only He knows. If we pay attention to all creatures in this world from the big to the smallest, there will be an allegation that there are some creatures that have great benefits and some that are considered to be useless or not useful at all, can even cause danger to humans , like poisonous snakes, pests of infectious diseases, plants that contain poisons, and so on. This conjecture will arise if each creature is seen separately, not in a single universe. If the creatures are seen in a single universe, where between one and another have a close relationship, it will be seen that all creatures have benefits and their usefulness in maintaining the balance and preservation of this nature. It is even apparent that the efforts of some humans, intentionally or unintentionally, to destroy and kill some living things, cause pollution in nature, so that its sustainability is disrupted. One example is the presence of pesticides, many worms and bacteria are destroyed. As a result, the process of spoilage becomes disrupted. Though bacteria and worms are considered animals that have no use at all. Deforestation results in deforested land, resulting in many floods and landslides in the rainy season, and drought in the dry season. All of that is due to human greed. That can be categorized as a destructive act on earth. The consequences can be broad and give a domino effect (streak). Based on the above explanation, it is evident that everything created by God has its benefits, but many people do not want to pay attention to it. Then this verse explains that He created man from the ground. The point is that God created Adam from the ground and then created the children of Adam's grandchildren from the starch extract which was obtained by the father and mother from food in the form of animals and plants that all came from the ground. In verse 7 it is stated that man was created from the ground, but in this verse it is stressed that only in the beginning was man created from the ground. With this verse it can also be interpreted that there is another phase after the beginning of creation before the creation becomes human. If this indeed happens, many other questions remain, including (1) whether the beginning of human creation is the same as and the beginning of the creation of other living creatures of the earth (see interpretation of Surah al-An'am verse 2), (2) whether phase after the initial creation of human beings develop through intermediate forms as well as the evolutionary process of other living things that are now widely believed (see Surah ar-Rum \/ 30 verse 20), or (3) humans are created through a special process that is different from other living things (al -Ahzab \/ 33 verse 33).",
      "text_tafsir": "Ayat ini menerangkan bahwa Tuhan yang menciptakan, mengatur, dan mengurus langit dan bumi serta segala yang ada padanya itu adalah Tuhan Yang Maha Mengetahui. Dia Maha Mengetahui segala yang gaib, yang tersembunyi dalam hati, yang akan terjadi, dan yang telah terjadi. Dia juga Maha Mengetahui segala yang dapat dilihat dan yang tidak dapat dilihat oleh mata. Dialah Tuhan Yang Mahakuasa, Mahakekal Rahmat-Nya dan Dia pulalah Yang menciptakan seluruh makhluk dengan bentuk yang baik, serasi serta dengan faedah dan kegunaan yang hanya Dia saja yang mengetahuinya.\n\nJika diperhatikan seluruh makhluk yang ada di alam ini sejak dari yang besar sampai kepada yang sekecil-kecilnya akan timbul dugaan bahwa di antara makhluk itu ada yang besar faedahnya dan ada pula yang dirasa tidak berfaedah atau tidak berguna sama sekali, bahkan dapat menimbulkan bahaya bagi manusia, seperti ular berbisa, hama-hama penyakit menular, tanaman yang mengandung racun, dan sebagainya. Dugaan ini akan timbul jika masing-masing makhluk itu dilihat secara terpisah, tidak dalam satu kesatuan alam semesta ini.\n\nJika makhluk-makhluk itu dilihat dalam satu kesatuan alam semesta, dimana antara yang satu dengan yang lain mempunyai hubungan erat, akan terlihat bahwa semua makhluk itu ada faedah dan kegunaannya dalam menjaga keseimbangan dan kelestarian alam ini. Bahkan terlihat dengan nyata bahwa usaha-usaha sebagian manusia, baik secara sengaja atau tidak, merusak dan membunuh sebagian makhluk hidup, menimbulkan pencemar-an di alam ini, sehingga kelestariannya terganggu. Salah satu contoh ialah dengan adanya obat pembasmi hama, banyak cacing dan bakteri yang musnah. Akibatnya, proses pembusukan sampah menjadi terganggu. Padahal bakteri dan cacing itu dianggap binatang yang tidak ada gunanya sama sekali. Penebangan hutan mengakibatkan tanah menjadi gundul, sehingga banyak terjadi banjir dan tanah longsor di musim hujan, serta kekeringan pada musim kemarau. \n\nSemua itu akibat keserakahan manusia. Hal itu bisa dikategorikan sebagai perbuatan merusak di bumi. Akibat yang ditimbulkannya bisa luas dan memberi efek domino (beruntun).\n\nBerdasarkan paparan di atas nyatalah bahwa segala sesuatu yang diciptakan Allah, ada faedahnya, tetapi banyak manusia yang tidak mau memperhatikannya.\n\nKemudian ayat ini menerangkan bahwa Dia menciptakan manusia dari tanah. Maksudnya ialah Allah menciptakan Adam dari tanah kemudian menciptakan anak cucu Adam dari sari pati tanah yang diperoleh oleh ayah dan ibu dari makanan berupa hewan dan tumbuh-tumbuhan yang semuanya berasal dari tanah.\n\nDalam ayat 7 dinyatakan bahwa manusia diciptakan dari tanah, tetapi pada ayat ini ditegaskan bahwa hanya pada permulaannya saja manusia diciptakan dari tanah. Dengan ayat ini dapat pula ditafsirkan bahwa ada fase lain setelah awal penciptaan sebelum ciptaan tersebut menjadi manusia. Jika hal tersebut memang terjadi demikian, banyak pertanyaan lain yang masih tersisa, antara lain (1) apakah awal penciptaan manusia sama dan bersamaan dengan awal penciptaan makhluk hidup bumi lainnya (lihat tafsir Surah al- An'am ayat 2), (2) apakah fase setelah penciptaan awal tersebut manusia berkembang melalui bentuk antara seperti halnya proses evolusi makhluk hidup lainnya yang kini banyak dipercayai (lihat Surah ar-Rum\/30 ayat 20), atau (3) manusia tercipta melalui proses khusus yang berbeda dari makhluk hidup lainnya (al-Ahzab\/33 ayat 33).",
      "text_translation": "Yang memperindah segala sesuatu yang Dia ciptakan dan yang memulai penciptaan manusia dari tanah,",
      "text": "الَّذِيْٓ اَحْسَنَ كُلَّ شَيْءٍ خَلَقَهٗ وَبَدَاَ خَلْقَ الْاِنْسَانِ مِنْ طِيْنٍ",
      "text_translation_en": "who makes most excellent everything that He creates. Thus, He begins the creation of man out of clay;",
      "juz_number": 21
    },
    "8": {
      "text_tafsir_en": "This verse explains that God created the human offspring from the sperm, that is, the tiny, emitting water, which meets the egg cell. The result of this meeting is called nuthfah.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menciptakan keturunan manusia dari sperma, yaitu air yang sedikit dan memancar, yang bertemu dengan sel telur. Hasil pertemuan ini disebut dengan nuthfah.",
      "text_translation": "kemudian Dia menjadikan keturunannya dari sari pati air yang hina (air mani).",
      "text": "ثُمَّ جَعَلَ نَسْلَهٗ مِنْ سُلٰلَةٍ مِّنْ مَّاۤءٍ مَّهِيْنٍ ۚ ",
      "text_translation_en": "then He causes him to be begotten out of the essence of a humble fluid;",
      "juz_number": 21
    },
    "9": {
      "text_tafsir_en": "Then in the womb of the woman, God perfected the creation of the nuthfah, so that it was human form. Then the spirit was blown into it. Thus the little fetus moves. Once the signs of life were revealed to him, God bestowed on him hearing, sight, reason, feeling, and so on. Man at the beginning of his life in the womb of the mother, though gifted with eyes, ears, and brain, yet could not see, hear, and think. It was newly acquired after his birth, and the longer his senses work, the better. At the end of this verse, God says that only a few people are grateful for the favor God has bestowed on him.",
      "text_tafsir": "Kemudian di dalam rahim perempuan, Allah menyempurnakan kejadian nuthfah itu, sehingga berbentuk manusia. Kemudian ditiupkan roh ke dalamnya. Dengan demikian bergeraklah janin yang kecil itu. Setelah nyata kepadanya tanda-tanda kehidupan, Allah menganugerahkan kepadanya pen-dengaran, penglihatan, akal, perasaan, dan sebagainya.\n\nManusia pada permulaan hidupnya di dalam rahim ibu, sekalipun telah dianugerahi mata, telinga, dan otak, tetapi ia belum dapat melihat, mendengar, dan berpikir. Hal itu baru diperolehnya setelah ia lahir, dan semakin lama panca inderanya itu dapat berfungsi dengan sempurna.\n\nPada akhir ayat ini, Allah mengatakan bahwa hanya sedikit manusia yang mau mensyukuri nikmat Allah yang telah dilimpahkan kepadanya.",
      "text_translation": "Kemudian Dia menyempurnakannya dan meniupkan roh (ciptaan)-Nya ke dalam (tubuh)nya dan Dia menjadikan pendengaran, penglihatan dan hati bagimu, (tetapi) sedikit sekali kamu bersyukur.",
      "text": "ثُمَّ سَوّٰىهُ وَنَفَخَ فِيْهِ مِنْ رُّوْحِهٖ وَجَعَلَ لَكُمُ السَّمْعَ وَالْاَبْصَارَ وَالْاَفْـِٕدَةَۗ قَلِيْلًا مَّا تَشْكُرُوْنَ ",
      "text_translation_en": "and then He forms him in accordance with what he is meant to be, and breathes into him of His spirit: and [thus, O men,] He endows you with hearing, and sight, and feelings as well as minds: [yet] how seldom are you grateful!",
      "juz_number": 21
    },
    "10": {
      "text_tafsir_en": "This verse describes the questions of the Muslims to the Messenger of Allah (may peace be upon him), which shows their disobedience and arrogance. They say, \"What if our flesh and bones were destroyed to the ground, could we be revived as we were?\" From the above question it is said that they think it is impossible for humans to come back to life after their bodies are destroyed. They cannot imagine in his mind how great the power of God is. If they want to reach the truth, they can look for evidence of God's power and greatness in human creation. They didn't exist before, and then they did. Of course recreating what has never been easier for Allah. Indeed, if they were to think that they had come to the conclusion that all things were easy for God, nothing would be difficult for him. Those monks not only denied the power of God, but also denied the day of resurrection, which is the day when all men are brought to the Supreme Court of Divine Judgment.",
      "text_tafsir": "Ayat ini menerangkan tentang pertanyaan orang-orang musyrik kepada Rasulullah saw, yang menunjukkan keingkaran dan kesombongan mereka. Mereka berkata, \"Apakah apabila daging dan tulang belulang kami telah hancur menjadi tanah, mungkinkah kami dihidupkan lagi seperti semula?\"\n\nDari pertanyaan di atas tergambar bahwa menurut mereka mustahil manusia dapat hidup kembali setelah mati dan tubuhnya hancur menjadi tanah. Mereka tidak dapat menggambarkan dalam pikirannya bagaimana besarnya kekuasaan Allah. Jika mereka ingin mencapai kebenaran, mereka dapat mencari bukti-bukti kekuasaan dan kebesaran Allah pada penciptaan manusia. Mereka dahulu tidak ada, kemudian menjadi ada. Tentu menciptakan kembali yang pernah ada lebih mudah bagi Allah. Sebenarnya jika mereka mau berpikir tentu mereka sampai kepada kesimpulan bahwa segala sesuatu itu adalah sama mudahnya bagi Allah, tidak ada yang sukar bagi-Nya.\n\nOrang-orang musyrik itu bukan hanya mengingkari kekuasaan Allah, tetapi juga mengingkari adanya hari kebangkitan, yaitu hari semua manusia dihadapkan di Mahkamah Agung Ilahiah.",
      "text_translation": "Dan mereka berkata, “Apakah apabila kami telah lenyap (hancur) di dalam tanah, kami akan berada dalam ciptaan yang baru?” Bahkan mereka mengingkari pertemuan dengan Tuhannya.",
      "text": "وَقَالُوْٓا ءَاِذَا ضَلَلْنَا فِى الْاَرْضِ ءَاِنَّا لَفِيْ خَلْقٍ جَدِيْدٍ ەۗ بَلْ هُمْ بِلِقَاۤءِ رَبِّهِمْ كٰفِرُوْنَ ",
      "text_translation_en": "For, [many are] they [who] say, “What! After we have been [dead and] lost in the earth, shall we indeed be [restored to life] in a new act of crea­tion?” Nay, but [by saying this] they deny the truth that they are destined to meet their Sustainer!",
      "juz_number": 21
    },
    "11": {
      "text_tafsir_en": "This verse rejects the opinion of the polytheists who claim that Judgment Day does not exist. In this verse it says, \"O polytheists, verily the angel in charge of taking a life of man, truly keeps time, so they take the life of that person on time, do not retreat even for a moment, nor be accelerated even for a moment.\" This applies to all the polytheists, and they cannot run from the decree of God. Then they are resurrected on the Day of Judgment and are held accountable for all their actions fairly.",
      "text_tafsir": "Ayat ini menolak anggapan orang-orang musyrik yang menyatakan bahwa hari Kiamat itu tidak ada. Dalam ayat ini dikatakan, \"Hai orang-orang musyrik, sesungguhnya malaikat yang bertugas mencabut nyawa manusia, benar-benar menjaga waktu, maka mereka mencabut nyawa orang itu tepat pada waktunya, tidak mundur sesaat pun, dan tidak pula dipercepat walau sesaat.\" Hal ini berlaku bagi semua orang-orang musyrik itu, dan mereka tidak dapat lari dari ketetapan Allah ini. Kemudian mereka dibangkitkan kembali di hari Kiamat dan diminta pertanggungjawaban semua perbuatannya dengan adil.",
      "text_translation": "Katakanlah, “Malaikat maut yang diserahi untuk (mencabut nyawa)mu akan mematikan kamu, kemudian kepada Tuhanmu, kamu akan dikembalikan.”",
      "text": "۞ قُلْ يَتَوَفّٰىكُمْ مَّلَكُ الْمَوْتِ الَّذِيْ وُكِّلَ بِكُمْ ثُمَّ اِلٰى رَبِّكُمْ تُرْجَعُوْنَ ࣖ ",
      "text_translation_en": "Say: “[One day,] the angel of death who has been given charge of you will gather you, and then unto your Sustainer you will be brought back.”",
      "juz_number": 21
    },
    "12": {
      "text_tafsir_en": "God told His Messenger that he would be horrified to see the condition of those who have turned their backs on the Day of Judgment when they have bowed their heads before God because of their shame and fear for all their actions and actions in life on earth. They told God that they had seen the reality of the Day of Judgment actually happening, and that they had also felt the calamity that had overtaken them that day. They then begged for the opportunity to return to the world so that they could follow all the instructions of the apostles. Back then, they claimed to have really believed what they had been lied to. They also acknowledge that only God has the right to worship, to revive and to kill, and to resurrect, as at that time. In another verse, Allah says: And if you (Muhammad) saw them when they were brought to hell, they said, \"Had we been restored (to the world), we would not have rejected the revelations of our Lord, and be believers.\" . \" (al-An'am \/ 6: 27)",
      "text_tafsir": "Allah memberitahukan kepada Rasul-Nya bahwa ia akan merasa ngeri jika melihat keadaan orang-orang yang mengingkari hari Kiamat ketika mereka menundukkan kepala di hadapan Allah karena malu dan takut atas segala tindakan dan perbuatan mereka dalam hidup di dunia. Mereka menyatakan kepada Allah bahwa mereka telah melihat kenyataan hari Kiamat itu benar-benar terjadi, dan telah merasakan pula malapetaka yang menimpa mereka pada hari itu. Mereka kemudian memohon agar diberi kesempatan untuk kembali ke dunia sehingga dapat mengikuti semua petunjuk rasul. Ketika itu, mereka mengaku benar-benar telah meyakini apa yang dahulu mereka dustakan. Mereka juga mengakui bahwa hanya Allah yang berhak disembah, yang menghidupkan dan mematikan, serta yang membangkitkan kembali, seperti saat itu.\n\nDalam ayat lain, Allah berfirman:\n\nDan seandainya engkau (Muhammad) melihat ketika mereka dihadapkan ke neraka, mereka berkata, \"Seandainya kami dikembalikan (ke dunia), tentu kami tidak akan mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman.\" (al-An'am\/6: 27)",
      "text_translation": "Dan (alangkah ngerinya), jika sekiranya kamu melihat orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhannya, (mereka berkata), “Ya Tuhan kami, kami telah melihat dan mendengar, maka kembalikanlah kami (ke dunia), niscaya kami akan mengerjakan kebajikan. Sungguh, kami adalah orang-orang yang yakin.”",
      "text": "وَلَوْ تَرٰىٓ اِذِ الْمُجْرِمُوْنَ نَاكِسُوْا رُءُوْسِهِمْ عِنْدَ رَبِّهِمْۗ رَبَّنَآ اَبْصَرْنَا وَسَمِعْنَا فَارْجِعْنَا نَعْمَلْ صَالِحًا اِنَّا مُوْقِنُوْنَ ",
      "text_translation_en": "If thou couldst but see [how it will be on Judgment Day], when those who are lost in sin will hang their heads before their Sustainer, [saying:] “O our Sustainer! [Now] we have seen, and we have heard! Return us, then, [to our earthly life] that we may do good deeds: for [now], behold, we are certain [of the truth]!”",
      "juz_number": 21
    },
    "13": {
      "text_tafsir_en": "If God wanted all humans to have faith and guidance to believe and practice righteousness, that would not be difficult for him. However, it is not in accordance with the ancient precepts in this world. The rules and laws of God in this world are the most perfect rules and laws. According to the rules and laws it is to put everything in its place, such as placing the eyes, ears, hearts, hands, feet, etc. in a proper and proper place, according to its beauty and function. Among the supplications is that God will fill Hell with the spirits and human beings who are worthy to live there and become their inhabitants, just as He will fill heaven with those who are worthy to dwell there. If people were to observe the superstition that was taking place in this world, there would be harmony and serenity in it. The fish that live in the water have fins, gills, and cold blood. So are flies, snakes, birds, and so on. If the eyes look to the horizon, then there is also a very fine sunnah, so that the planets do not collide with each other.",
      "text_tafsir": "Jika Allah menghendaki semua manusia mendapat taufik dan hidayah untuk beriman dan beramal saleh, tentu hal itu tidak sukar bagi-Nya. Akan tetapi, hal itu tidak sesuai dengan sunatullah yang dahulu berlaku di alam ini. Aturan dan hukum Allah yang berlaku di alam ini adalah aturan dan hukum yang paling sempurna. Menurut aturan dan hukum itu ialah menempatkan segala sesuatu di tempatnya, seperti menempatkan mata, telinga, hati, tangan, kaki, dan sebagainya berada di tempat yang layak dan wajar, sesuai dengan keindahan dan fungsinya. Di antara sunatullah itu ialah Allah akan mengisi neraka Jahanam dengan jin dan manusia yang layak bertempat tinggal di sana dan menjadi penghuninya, sebagaimana Dia akan memenuhi surga dengan orang-orang yang layak pula bertempat tinggal di sana.\n\nJika manusia memperhatikan sunatullah yang berlaku di alam ini, akan tampak suatu keserasian dan kerapian di dalamnya. Ikan yang hidup di dalam air mempunyai sirip, insang, dan berdarah dingin. Demikian pula lalat, ular, burung, dan sebagainya. Jika mata memandang ke cakrawala luas, maka di dalamnya terdapat pula sunatullah yang juga sangat rapi, sehingga planet-planet itu tidak berbenturan antara yang satu dengan yang lain.",
      "text_translation": "Dan jika Kami menghendaki niscaya Kami berikan kepada setiap jiwa petunjuk (bagi)nya, tetapi telah ditetapkan perkataan (ketetapan) dari-Ku, “Pasti akan Aku penuhi neraka Jahanam dengan jin dan manusia bersama-sama.",
      "text": "وَلَوْ شِئْنَا لَاٰتَيْنَا كُلَّ نَفْسٍ هُدٰىهَا وَلٰكِنْ حَقَّ الْقَوْلُ مِنِّيْ لَاَمْلَـَٔنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ اَجْمَعِيْنَ ",
      "text_translation_en": "Yet had We so willed, We could indeed have imposed Our guidance upon every human being: but [We have not willed it thus - and so] that word of Mine has come true: “Most certainly will I fill hell with invisible beings as well as with humans, all together!”",
      "juz_number": 21
    },
    "14": {
      "text_tafsir_en": "Because the unbelievers rejected the Day of Judgment, viewing it as an impossible thing, and believing that they would not meet God on the Day of Judgment, they felt that fate. When the door of repentance was closed, God declared that He would no longer listen to their requests. At the end of this verse, Allah mentions the form of the punishment inflicted on the disbelievers is the eternal torment in hell, as a result of their actions and actions.",
      "text_tafsir": "Karena orang-orang musyrik mendustakan hari Kiamat, dan memandangnya sebagai suatu hal yang mustahil terjadi, serta meyakini bahwa mereka tidak akan bertemu dengan Tuhan pada hari Kiamat, mereka merasakan azab yang ditimpakan itu. Pada waktu pintu tobat telah tertutup, Allah menyatakan bahwa Ia tidak akan memperhatikan lagi permintaan mereka.\n\nPada akhir ayat ini, Allah menyebutkan bentuk azab yang ditimpakan kepada orang-orang kafir adalah azab yang kekal di dalam neraka, akibat tindakan dan perbuatan mereka itu.",
      "text_translation": "Maka rasakanlah olehmu (azab ini) disebabkan kamu melalaikan pertemuan dengan harimu ini (hari Kiamat), sesungguhnya Kami pun melalaikan kamu dan rasakanlah azab yang kekal, atas apa yang telah kamu kerjakan.”",
      "text": "فَذُوْقُوْا بِمَا نَسِيْتُمْ لِقَاۤءَ يَوْمِكُمْ هٰذَاۚ اِنَّا نَسِيْنٰكُمْ وَذُوْقُوْا عَذَابَ الْخُلْدِ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
      "text_translation_en": "[And He will say unto the sinners:] “Taste, then, [the recompense] for your having been obli­vious of the coming of this your Day [of Judgment] - for, verily, We are [now] oblivious of you: taste, then, [this] abiding suffering for all [the evil] that you were wont to do!”",
      "juz_number": 21
    },
    "15": {
      "text_tafsir_en": "This verse explains that those who believe in the Qur'anic verses and acknowledge that Muhammad is the Messenger of Allah are those who, when reminded of the verses of Allah and read before them, Her. They also praised Him as they read, \"Subhanallahi wa bihamdihi, subhanallahil 'adhim.\" Such worship is called prostration. The law is holy, both in prayer and in prayer. Their actions are a sign of their obedience and obedience. It is also a sign that they truly appreciate the teachings and instructions of the verses that are read to them. There is not a single, arrogant and arrogant attitude in the worship of God. They are also happy and devoted to worship.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang beriman kepada ayat-ayat Al-Qur'an dan mengakui bahwa Muhammad itu adalah rasul Allah adalah orang-orang yang apabila diperingatkan kepada mereka ayat-ayat Allah dan dibacakan di hadapan mereka, mereka lalu bersujud kepada-Nya. Mereka juga bertasbih memuji-Nya seraya membaca, \"Subhanallahi wa bihamdihi, subhanallahil 'adhim.\" Sujud yang demikian dinamakan sujud tilawah. Hukumnya sunah, baik dalam salat maupun di luar salat.\n\nTindakan mereka itu adalah tanda ketaatan dan ketundukan mereka. Hal itu juga sebagai tanda bahwa mereka benar-benar menghayati ajaran dan petunjuk ayat-ayat yang dibacakan kepada mereka. Tidak sedikit pun terdapat sikap angkuh dan sombong dalam menghambakan diri kepada Allah. Mereka juga senang dan khusyuk dalam beribadah.",
      "text_translation": "Orang-orang yang beriman dengan ayat-ayat Kami, hanyalah orang-orang yang apabila diperingatkan dengannya (ayat-ayat Kami), mereka menyungkur sujud dan bertasbih serta memuji Tuhannya, dan mereka tidak menyombongkan diri.",
      "text": "اِنَّمَا يُؤْمِنُ بِاٰيٰتِنَا الَّذِيْنَ اِذَا ذُكِّرُوْا بِهَا خَرُّوْا سُجَّدًا وَّسَبَّحُوْا بِحَمْدِ رَبِّهِمْ وَهُمْ لَا يَسْتَكْبِرُوْنَ ۩ ",
      "text_translation_en": "ONLY THEY [truly] believe in Our messages who, whenever they are conveyed to them, fall down, prostrating themselves in adoration, and extol their Sustainer’s limitless glory and praise; and who are never filled with false pride;",
      "juz_number": 21
    },
    "16": {
      "text_tafsir_en": "In this verse, God explains yet another sign for believers. Among them are sleep deprivation, and often wake up in the middle of the night to pray and pray to God to be spared from His torment. They also make some of their sustenance from Allah. Many Qur'anic verses and hadiths of the Prophet saw explain the importance and benefits of night prayers, especially to draw closer to God to increase the strength of faith in the chest. The Prayer of Tahajud can lift people to a place of praise, as Allah says: And in the night, perform an extra Tahajud prayer (as a worship) for you: may your Lord lift you to a place of praise. (al-Isra '\/ 17: 79) In another verse, God explains that prayer and reading the Qur'an at night can strengthen the soul. Thus, the soul will be able to accept the heavier and greater obligations of God, as it is said in His word: O blanket (Muhammad)! Wake up (for prayer) at night, except for a few, (that is) half or less of it, or more than that, and read the Qur'an slowly. Verily We will send you heavy words. Indeed, waking up that night is stronger (filling the soul); and (reading at that time) was more effective. (al-Muzzammil \/ 73: 1-6) At-Tirmidzi, Ibn Majah, Ahmad, Abu Dawud, and ath-thabrani, reported that Mu'adz bin Jabal asked the Messenger of Allah (may peace be upon him): O Messenger of Allah! into heaven and keep me from the fire of hell. The Messenger of Allah (may peace be upon him) said: \"Surely you have asked a great thing, surely it is easy to do for those whom Allah has made easy for him, you worship Allah, do not associate with him at all, offer prayers, perform alms, fast in the month of Ramadan, House. \" Then the Messenger of Allah (may peace be upon him) said, \"Shall I show you the gates of goodness? Fasting is a shield; Then he read Tatajafa. . . until the end of the sentence. (History of at-Tirmidzi, Ibn Majah, Ahmad, Abu Dawud, and ath-thabrani) Narrated by Ibn Jarir ath-thabari of Ibn 'Abbas, he said, \"The purpose of\" their bed away from their beds \"is to worship Allah, remembering, praying, standing, sitting or lying down, they always remembered God. \"",
      "text_tafsir": "Pada ayat ini, Allah menerangkan tanda-tanda lain lagi bagi orang-orang yang beriman. Di antaranya adalah mereka mengurangi tidur, dan sering bangun di pertengahan malam untuk melakukan salat dan berdoa kepada Allah agar dihindarkan dari siksaan-Nya. Mereka juga menginfakkan sebagian dari rezeki yang telah mereka peroleh dari Allah.\n\nBanyak ayat-ayat Al-Qur'an dan hadis-hadis Nabi saw yang menerangkan keutamaan dan manfaat salat malam, terutama untuk mendekatkan diri kepada Allah untuk menambah kekuatan iman di dalam dada.\n\nSalat Tahajud dapat mengangkat manusia ke tempat yang terpuji, sebagaimana Allah berfirman:\n\nDan pada sebagian malam, lakukanlah salat Tahajud (sebagai suatu ibadah) tambahan bagimu: mudah-mudahan Tuhanmu mengangkatmu ke tempat yang terpuji. (al-Isra'\/17: 79)\n\nPada ayat yang lain, Allah menerangkan bahwa salat dan membaca Al- Qur'an di malam hari dapat menguatkan jiwa. Dengan demikian, jiwa itu akan dapat menerima kewajiban yang lebih berat dan besar dari Allah, sebagaimana disebutkan dalam firman-Nya:\n\nWahai orang yang berselimut (Muhammad)! Bangunlah (untuk salat) pada malam hari, kecuali sebagian kecil, (yaitu) separuhnya atau kurang sedikit dari itu, atau lebih dari (seperdua) itu, dan bacalah Al-Qur'an itu dengan perlahan-lahan. Sesungguhnya Kami akan menurunkan perkataan yang berat kepadamu. Sungguh, bangun malam itu lebih kuat (mengisi jiwa); dan (bacaan pada waktu itu) lebih berkesan. (al-Muzzammil\/73: 1-6)\n\nDiriwayatkan oleh at-Tirmidzi, Ibnu Majah, Ahmad, Abu Dawud, dan ath-thabrani bahwa Mu'adz bin Jabal bertanya kepada Rasulullah saw:\n\nYa Rasulullah, beritahukanlah kepadaku perbuatan yang dapat memasukkan aku ke dalam surga dan menjauhkan aku dari api neraka. Rasulullah bersabda, \"Sesungguhnya engkau benar-benar telah menanyakan sesuatu yang besar, sesungguhnya perbuatan itu mudah dilakukan oleh orang yang dimudahkan Allah baginya, Engkau menyembah Allah, tidak menyekutukan Nya dengan sesuatupun, mendirikan salat, menunaikan zakat, puasa pada bulan Ramadhan, berhaji ke Baitullah.\" Kemudian Rasulullah meneruskan sabdanya, \"Maukah engkau aku tunjukkan kepadamu pintu-pintu kebaikan? Puasa itu adalah perisai, sedekah menghapuskan kesalahan seperti air memadamkan api, dan salat pada pertengahan malam.\" Kemudian beliau membaca Tatajafa . . . sampai akhir ayat. (Riwayat at-Tirmidzi, Ibnu Majah, Ahmad, Abu Dawud, dan ath-thabrani)\n\nDiriwayatkan oleh Ibnu Jarir ath-thabari dari Ibnu 'Abbas, beliau berkata, \"Maksud \"lambung mereka jauh dari tempat tidur mereka\" ialah beribadah kepada Allah, zikir, salat, berdiri, duduk atau berbaring, mereka selalu mengingat Allah.\"",
      "text_translation": "Lambung mereka jauh dari tempat tidurnya, mereka berdoa kepada Tuhannya dengan rasa takut dan penuh harap, dan mereka menginfakkan sebagian dari rezeki yang Kami berikan kepada mereka.",
      "text": "تَتَجَافٰى جُنُوْبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُوْنَ رَبَّهُمْ خَوْفًا وَّطَمَعًاۖ وَّمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ",
      "text_translation_en": "[and] who are im­pelled to rise from their beds [at night] to call out to their Sustainer in fear and hope; and who spend on others out of what We provide for them as sus­tenance.",
      "juz_number": 21
    },
    "17": {
      "text_tafsir_en": "This verse explains that one cannot know how much happiness and happiness God will give him in the hereafter, and how good and comfortable he is to live in heaven. All of this is a reward for the good that has been done throughout life. Narrated by al-Bukhari and Muslims and other hadith priests of Abu Hurairah, the Messenger of Allah (may peace be upon him) said: Allah says, \"I have prepared for my righteous servants what they have never seen, never heard, and never heard.\" have been scratched in the heart of man, except what I have told you. Read, if you will. \"Fala talamu nafs. . . to the end. \"Narrated by al-Firyabi, Ibn Abi Syaibah, Ibn Jarir ath-thabari, ath-thabrani, al-judges and declared as authentic hadith of Ibn Mas'ud, he said,\" Indeed, it is contained in the Torah that Allah promises to those who are far from their beds, what the eyes have not seen, their ears have not heard, they have not been scratched in the human heart. The angel close to God did not know it, nor did the apostles he sent. Indeed, it is also found in the Qur'an, as stated in this verse. \"",
      "text_tafsir": "Ayat ini menerangkan bahwa seseorang tidak dapat mengetahui betapa besar kebahagiaan dan kesenangan yang akan diberikan Allah kepadanya di akhirat nanti, dan betapa enak dan nyamannya tinggal di dalam surga itu. Semua itu adalah balasan perbuatan baik yang telah dikerjakan selama hidup di dunia.\n\nDiriwayatkan oleh al-Bukhari dan Muslim dan imam-imam hadis yang lain dari Abu Hurairah, Rasulullah saw bersabda: \n\nAllah berfirman, \"Aku telah menyediakan untuk hamba-hamba-Ku yang saleh apa yang belum pernah mata melihatnya, belum pernah telinga mendengarnya dan belum pernah tergores di dalam hati manusia, kecuali apa yang telah Aku kemukakan kepadamu. Bacalah, jika kamu menghendakinya \"Fala talamu nafs . . . sampai akhir.\"\n\nDiriwayatkan oleh al-Firyabi, Ibnu Abi Syaibah, Ibnu Jarir ath-thabari, ath-thabrani, al-hakim dan dinyatakan sebagai hadis sahih dari Ibnu Mas'ud, ia berkata, \"Sesungguhnya termaktub dalam Taurat bahwa Allah menjanjikan kepada orang-orang yang jauh lambung mereka dari tempat tidurnya, apa yang belum dilihat mata, belum didengar telinga, belum tergores dalam hati manusia. Malaikat yang dekat kepada Tuhan tidak mengetahuinya demikian pula para rasul yang diutusnya. Sesungguhnya itu terdapat pula di dalam Al-Qur'an, sebagaimana tersebut dalam ayat ini.\"",
      "text_translation": "Maka tidak seorang pun mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam nikmat) yang menyenangkan hati sebagai balasan terhadap apa yang mereka kerjakan.",
      "text": "فَلَا تَعْلَمُ نَفْسٌ مَّآ اُخْفِيَ لَهُمْ مِّنْ قُرَّةِ اَعْيُنٍۚ جَزَاۤءًۢ بِمَا كَانُوْا يَعْمَلُوْنَ",
      "text_translation_en": "And [as for all such believers,] no human being can imagine what blissful delights, as yet hidden, await them [in the life to come] as a reward for all that they did.",
      "juz_number": 21
    },
    "18": {
      "text_tafsir_en": "In this verse it is explained that after describing the attributes of the unbelievers and the attributes of the believers, God has asked to compare the two attributes, whether those who reject God's revelations, do not believe in His promises and threats, disobey His commands. - His commands and prohibitions are the same as those who follow the precepts of God, acknowledge the truth of His promises and threaten to obey His commands and put an end to His prohibitions? Allah emphasizes that the two groups are never the same, so the difference between them is great. Only the ignorant and the sharp-eyed can distinguish the two groups. The other word of God in the context of this verse is: Do those who do evil think that We will treat them as believers and do good, the same in their life and death? What a waste of their judgment. (al-Jasiyah \/ 45: 21) The Word of God: Do We treat those who believe and do good deeds like those who do evil on earth? Or do We consider the righteous to be the same as the wicked? (sad \/ 38: 28)",
      "text_tafsir": "Pada ayat ini diterangkan bahwa setelah menerangkan sifat-sifat orang kafir dan sifat-sifat orang-orang mukmin, Allah menyuruh membandingkan kedua sifat itu, apakah orang-orang yang mendustakan ayat-ayat Allah, tidak percaya kepada janji dan ancaman-Nya, mengingkari perintah-perintah dan larangan-larangan-Nya itu sama dengan orang-orang yang mengikuti ayat-ayat Allah, mengakui kebenaran janji dan ancaman-Nya mengikuti perintah-perintah-Nya dan menghentikan larangan-larangan-Nya? Allah menegaskan bahwa kedua golongan itu sama sekali tidak sama, amat besar perbedaannya di sisi-Nya. Orang yang tidak berpengetahuan dan tidak mempunyai pandangan yang tajam saja dapat membedakan kedua macam golongan itu. Firman Allah yang lain yang sama isinya dengan ayat ini, ialah:\n\nApakah orang-orang yang melakukan kejahatan itu mengira bahwa Kami akan memperlakukan mereka seperti orang-orang yang beriman dan yang mengerjakan kebajikan, yaitu sama dalam kehidupan dan kematian mereka? Alangkah buruknya penilaian mereka itu. (al-Jasiyah\/45: 21) \n\nFirman Allah:\n\nPantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan sama dengan orang-orang yang berbuat kerusakan di bumi? Atau pantaskah Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang jahat? (sad\/38: 28)",
      "text_translation": "Maka apakah orang yang beriman seperti orang yang fasik (kafir)?  Mereka tidak sama.",
      "text": "اَفَمَنْ كَانَ مُؤْمِنًا كَمَنْ كَانَ فَاسِقًاۗ  لَا يَسْتَوٗنَ",
      "text_translation_en": "Is, then, he who [in his earthly life] was a believer to be compared with one who was in­iquitous? [Nay,] these two are not equal!",
      "juz_number": 21
    },
    "19": {
      "text_tafsir_en": "This verse explains the differences between the two groups and their differences in the hereafter. Those who believe in Allah and His Messenger and do good deeds will be rewarded with double rewards in the hereafter. They will live in magnificent homes with beautiful gardens, in return for their faith and the righteous deeds they have done throughout their lives. The Word of God: May Allah forgive your sins and bring you into the streams that flow beneath the rivers, and into good dwellings in heaven 'Adn. That's a great victory. (ash-saff \/ 61: 12)",
      "text_tafsir": "Pada ayat ini dijelaskan perbedaan kedua golongan itu dan perbedaan keadaan mereka di akhirat nanti. Orang-orang yang beriman kepada Allah dan rasul-Nya, serta mengerjakan amal saleh akan diberi ganjaran pahala yang berlipat ganda di akhirat nanti. Mereka akan tinggal di rumah-rumah yang megah dengan taman-taman yang indah, sebagai balasan keimanan dan amal saleh yang mereka perbuat selama hidup di dunia. Firman Allah:\n\nNiscaya Allah mengampuni dosa-dosamu dan memasukkan kamu ke dalam surga yang mengalir di bawahnya sungai-sungai, dan ke tempat-tempat tinggal yang baik di dalam surga 'Adn. Itulah kemenangan yang agung. (ash-saff\/61: 12)",
      "text_translation": "Adapun orang-orang yang beriman dan mengerjakan kebajikan, maka mereka akan mendapat surga-surga tempat kediaman, sebagai pahala atas apa yang telah mereka kerjakan.",
      "text": "اَمَّا الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فَلَهُمْ جَنّٰتُ الْمَأْوٰىۖ  نُزُلًا ۢبِمَا كَانُوْا يَعْمَلُوْنَ",
      "text_translation_en": "As for those who attain to faith and do right­eous deeds - gardens of rest await them, as a wel­come [from God], in result of what they did;",
      "juz_number": 21
    },
    "20": {
      "text_tafsir_en": "But those who disbelieve, disobey God and His Messenger, and do evil deeds will be punished with the torment of hell in the hereafter. Whenever they approach the door of hell to come out, they are brought back in again. If the hell is like a crater or a volcano, then the infidels are in it. The flames from the crater are so dangerous that they fire at every turn. In the picture the infidels were being carried away, they were thrown into the mouth of the crater, and then they were immersed again, so that they had no chance of getting out of the fire. When they were put back into hell, it was said to them, \"Feel the torment of hell you did not believe in a little while in the world.\"",
      "text_tafsir": "Adapun orang-orang yang kafir, mengingkari Allah dan rasul-Nya, serta mengerjakan perbuatan-perbuatan jahat akan dibalas dengan azab neraka di akhirat nanti. Setiap mereka mendekati pintu neraka untuk keluar, mereka dikembalikan ke dalamnya lagi.\n\nJika neraka itu diibaratkan dengan kawah atau kepundan gunung berapi, maka orang-orang kafir berada di dalamnya. Nyala api dari kawah itu sedemikian berbahaya dan setiap saat menyemburkan bunga api. Dalam gambaran itu terbawa pula orang-orang kafir yang sedang diazab, mereka terlempar ke mulut kawah itu, kemudian mereka dibenamkan lagi ke dasarnya, sehingga tidak mempunyai kesempatan sedikit pun untuk keluar dari neraka itu. Di saat mereka dibenamkan kembali ke dalam neraka, kepada mereka dikatakan, \"Rasakanlah olehmu azab neraka yang dahulu kamu tidak mempercayainya sedikit pun sewaktu hidup di dunia.\"",
      "text_translation": "Dan adapun orang-orang yang fasik (kafir), maka tempat kediaman mereka adalah neraka. Setiap kali mereka hendak keluar darinya, mereka dikembalikan (lagi) ke dalamnya dan dikatakan kepada mereka, “Rasakanlah azab neraka yang dahulu kamu dustakan.”",
      "text": "وَاَمَّا الَّذِيْنَ فَسَقُوْا فَمَأْوٰىهُمُ النَّارُ كُلَّمَآ اَرَادُوْٓا اَنْ يَّخْرُجُوْا مِنْهَآ اُعِيْدُوْا فِيْهَا وَقِيْلَ لَهُمْ ذُوْقُوْا عَذَابَ النَّارِ الَّذِيْ كُنْتُمْ بِهٖ تُكَذِّبُوْنَ",
      "text_translation_en": "but as for those who are lost in iniquity - their goal is the fire: as oft as they will try to come out of it, they will be thrown back into it; and they will be told, “Taste [now] this suffering through fire which you were wont to call a lie!”",
      "juz_number": 21
    },
    "21": {
      "text_tafsir_en": "In this verse, Allah explains that those disbelievers while living in the world were punished by Allah with all kinds of torments, both visible and invisible to them. The torment for those in the world is called al-'adzab al-adna (near torment), while the torment in the hereafter is called al-'adzab al-akbar (the greater torment). There are many trials that God has given to mankind throughout life, from the smallest trials to the greatest. It can also be in the form of outward luxury to poverty and misery. A rich man but not based on faith in God, his heart is always on the alert and anxious, maybe someone will rob him of his wealth, or some heir will kill him in order to gain it. An unbelieving ruler is always worried that his power will be transferred to others. If necessary, that power is maintained by iron hands and violence. This same concern had occurred to Pharaoh when his magicians were defeated by Moses. Allah says: He (Pharaoh) said, \"Have you believed in him (Moses) before I gave you permission? Indeed, he is your leader who taught you magic. I crucified you at the base of the palm tree and indeed, you will surely find out which of us is more painful and more abusive. \" (thaha \/ 20: 71) Many rulers act like this Pharaoh. They think they are the ones who have it all and they are the most powerful. In fact, Allah has given the temptations of this worldly punishment so that all may be a lesson to those who disbelieve. This is to make them want to believe, do good, and hopefully return to the right path. Let them bear the light torments of this world, and in the Hereafter they will be spared from the great torment.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa sebenarnya orang-orang kafir itu sewaktu masih hidup di dunia telah diazab oleh Allah dengan berbagai macam azab, baik yang tampak maupun yang hanya dapat dirasakan oleh mereka. Siksaan bagi mereka di dunia disebut dengan al-'adzab al-adna (azab yang dekat), sedangkan siksaan di akhirat disebut al-'adzab al-akbar (azab yang lebih besar).\n\nBanyak cobaan-cobaan yang diberikan Allah kepada manusia selama hidup di dunia, sejak dari cobaan yang kecil sampai kepada cobaan yang paling besar. Bisa juga dalam bentuk kemewahan lahiriah sampai kepada kemiskinan dan kesengsaraan. Seorang yang kaya tetapi tidak dilandasi dengan iman kepada Allah, hatinya selalu was-was dan khawatir, mungkin ada orang yang akan merampas kekayaannya itu, atau ada ahli waris yang hendak membunuhnya agar memperoleh kekayaan itu.\n\nSeorang penguasa yang tidak beriman selalu khawatir kekuasaannya akan pindah kepada orang lain. Kalau perlu, kekuasaan itu dipertahankan dengan tangan besi dan kekerasan. Kekhawatiran seperti ini pernah terjadi pada Fir'aun di kala tukang-tukang sihirnya dikalahkan oleh Nabi Musa.\n\nAllah berfirman:\n\nDia (Fir'aun) berkata, \"Apakah kamu telah beriman kepadanya (Musa) sebelum aku memberi izin kepadamu? Sesungguhnya dia itu pemimpinmu yang mengajarkan sihir kepadamu. Maka sungguh, akan kupotong tangan dan kakimu secara bersilang, dan sungguh, akan aku salib kamu pada pangkal pohon kurma dan sungguh, kamu pasti akan mengetahui siapa di antara kita yang lebih pedih dan lebih kekal siksaannya.\" (thaha\/20: 71)\n\nBanyak penguasa-penguasa yang bersikap seperti Fir'aun ini. Mereka mengira bahwa merekalah yang memiliki semuanya dan merekalah yang paling berkuasa.\n\nSebenarnya Allah memberikan cobaan-cobaan dari azab duniawi itu agar semuanya menjadi pelajaran bagi orang-orang kafir itu. Hal ini bertujuan agar mereka mau beriman, beramal saleh, dan mudah-mudahan kembali ke jalan yang benar. Biarlah mereka menanggung siksa yang ringan di dunia ini asal di akhirat nanti mereka terhindar dari siksa yang amat berat.",
      "text_translation": "Dan pasti Kami timpakan kepada mereka sebagian siksa yang dekat (di dunia) sebelum azab yang lebih besar (di akhirat); agar mereka kembali (ke jalan yang benar).",
      "text": "وَلَنُذِيْقَنَّهُمْ مِّنَ الْعَذَابِ الْاَدْنٰى دُوْنَ الْعَذَابِ الْاَكْبَرِ لَعَلَّهُمْ يَرْجِعُوْنَ",
      "text_translation_en": "However, ere [We condemn them to] that supreme suffering, We shall most certainly let them taste of a suffering closer at hand, so that they might [repent and] mend their ways.",
      "juz_number": 21
    },
    "22": {
      "text_tafsir_en": "God explained that the most perverted of his people were those who had reached him the warnings of Allah, the Qur'anic verses, and the instructions of the apostles, but they turned away from those teachings and instructions because of the arrogance and malice contained within his heart. At the end of this verse it is stated that God will torment with the painful torment of every sinner and sinner. Ibn Jarir ath-thabari of Mu'adz bin Jabal said, \"I heard the Messenger of Allah (may peace be upon him) say: Three things, whoever does it, then he has committed a sin: he who has determined to fight in a way that is not righteous or disobeying both his parents or those who walk with the wrongdoers and he helps the wrongdoer. Allah says, \"We will surely repay the guilty.\" (Ibn Jarir ath-thabari's History of Mu'adz bin Jabal)",
      "text_tafsir": "Allah menerangkan bahwa orang yang paling zalim di sisi-Nya ialah orang yang telah sampai kepadanya peringatan Allah, ayat-ayat Al-Qur'an, dan petunjuk rasul, tetapi mereka berpaling dari ajaran dan petunjuk itu karena angkuh dan penyakit dengki yang ada di dalam hatinya.\n\nPada akhir ayat ini ditegaskan bahwa Allah akan menyiksa dengan azab yang pedih setiap orang yang berbuat dosa dan maksiat.\n\nDiriwayatkan oleh Ibnu Jarir ath-thabari dari Mu'adz bin Jabal, ia berkata, \"Aku mendengar Rasulullah bersabda:\n\nTiga perkara, barang siapa yang mengerjakannya, maka sesungguhnya ia telah mengerjakan perbuatan dosa: barang siapa yang telah bertekad ikut berperang di jalan yang tidak benar atau mendurhakai kedua orang ibu bapaknya atau orang yang berjalan beserta orang-orang yang zalim lalu ia menolong orang yang zalim itu. Allah berfirman, \"Sesungguhnya Kami akan memberikan pembalasan kepada orang-orang yang berdosa.\" (Riwayat Ibnu Jarir ath-thabari dari Mu'adz bin Jabal)",
      "text_translation": "Dan siapakah yang lebih zalim daripada orang yang telah diperingatkan dengan ayat-ayat Tuhannya, kemudian dia berpaling darinya? Sungguh, Kami akan memberikan balasan kepada orang-orang yang berdosa.",
      "text": "وَمَنْ اَظْلَمُ مِمَّنْ ذُكِّرَ بِاٰيٰتِ رَبِّهٖ ثُمَّ اَعْرَضَ عَنْهَا ۗاِنَّا مِنَ الْمُجْرِمِيْنَ مُنْتَقِمُوْنَ ࣖ",
      "text_translation_en": "And who could be more wicked than he to whom his Sustainer’s messages are conveyed and who thereupon turns away from them? Verily, We shall inflict Our retribution on those who are [thus] lost in sin!",
      "juz_number": 21
    },
    "23": {
      "text_tafsir_en": "This verse explains that God passed down the book to Moses just as He passed the Qur'an to the Prophet Muhammad. However, the revelation passed down to Moses was rejected by his people. Moses and his followers were persecuted by Pharaoh and his people, and they fled to Palestine. Similarly, Muhammad saw his people being rejected, hurt, and opposed until he and his companions emigrated to Medinah. That is what circumcision is going on in this world, there is always a fight between the right and the wrong, and between good and evil. All of this is a trial for believers. In this verse the name of Moses among the prophets and apostles of Allah is due to many similarities with his struggle with the Prophet Muhammad. This verse is intended for the entertainment of the Prophet Muhammad and his companions who are presenting the religion of Allah to mankind. In delivering the brochure, he received threats and persecution from his people. As if it were said to them: \"O Muhammad, do not you and your followers grieve over the attitudes and actions of the Muslims. This is a just and proper thing. Remember Moses and his followers. They were persecuted and hunted down. by Pharaoh and his people, as they fled across the Red Sea, through the barren and hot desert, and many of his followers betrayed him, but he persevered and persevered. \"I must love you and your followers just as much as I did to protect Moses and his followers.\"",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah menurunkan kitab Taurat kepada Nabi Musa sebagaimana Dia telah menurunkan Al-Qur'an kepada Nabi Muhammad. Namun demikian, wahyu yang diturunkan kepada Nabi Musa itu didustakan oleh kaumnya. Musa bersama pengikutnya disiksa oleh Fir'aun dan kaumnya, sehingga mereka lari ke daerah Palestina. Demikian pula Muhammad saw telah didustakan pula oleh kaumnya, disakiti, dan ditentang sehingga beliau dan para sahabatnya hijrah ke Medinah. Itulah sunatullah yang berlaku di alam ini, selalu terjadi pertarungan antara yang hak dengan yang batil, dan antara kebaikan dan kejahatan. Semua itu merupakan cobaan bagi orang-orang yang beriman.\n\nDalam ayat ini disebut-sebut nama Musa di antara para nabi dan rasul Allah adalah karena banyak persamaan perjuangannya dengan Nabi Muhammad.\n\nAyat ini diturunkan untuk hiburan bagi Nabi Muhammad dan para sahabat yang sedang menyampaikan agama Allah kepada manusia. Dalam menyampaikan risalah itu, dia mendapat ancaman dan penganiayaan dari kaumnya. Seakan-akan dikatakan kepada mereka, \"Hai Muhammad, janganlah kamu dan pengikut-pengikutmu bersedih hati menghadapi sikap dan tindakan orang-orang musyrik itu. Hal yang demikian itu adalah wajar dan merupakan sunatullah. Ingatlah Musa dan pengikut-pengikutnya. Mereka dianiaya dan diburu oleh Fir'aun dan kaumnya, sampai mereka lari menyeberangi Laut Merah, dan mengarungi padang pasir yang tandus dan panas. Dalam keadaan demikian, banyak pula di antara pengikut-pengikutnya yang berkhianat, tetapi ia tetap tabah dan sabar. Semakin kuat tantangan dan penganiayaan yang diterimanya, semakin kuat pula usaha dan kesabarannya. Aku pasti menyayangimu dan para pengikutmu sebagaimana Aku telah menjaga pula Musa dan para pengikutnya.\"",
      "text_translation": "Dan sungguh, telah Kami anugerahkan Kitab (Taurat) kepada Musa, maka janganlah engkau (Muhammad) ragu-ragu menerimanya (Al-Qur'an) dan Kami jadikan Kitab (Taurat) itu petunjuk bagi Bani Israil.",
      "text": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ فَلَا تَكُنْ فِيْ مِرْيَةٍ مِّنْ لِّقَاۤىِٕهٖ وَجَعَلْنٰهُ هُدًى لِّبَنِيْٓ اِسْرَاۤءِيْلَۚ",
      "text_translation_en": "AND, INDEED, [O Muhammad,] We did vouchsafe revelation unto Moses [as well]: so be not in doubt of [thy] having met with the same [truth in the revelation vouchsafed to thee]. And [just as] We caused that [earlier revelation] to be a guidance for the children of Israel,",
      "juz_number": 21
    },
    "24": {
      "text_tafsir_en": "This verse explains that God has made it possible among the Children of Israel who followed His instructions to be the leader of the people. Among them were appointed prophets and apostles who gave the true guidance to their people, and some of them were leaders of their people to the right path. This is given because they are believers and patiently carry out the laws of God. They also patiently accept every trial they face, and they are convinced of God's guidance. God said: And We gave unto Moses the Book (the Torah) and We made it a guide for the Children of Israel, saying, \"Take no protector except me.\" (al-Isra '\/ 17",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah menjadikan di antara Bani Israil yang mengikuti petunjuk-petunjuk-Nya menjadi pemuka masyarakat. Di antara mereka ada yang diangkat menjadi nabi dan rasul yang menyampaikan petunjuk yang benar kepada kaumnya, dan ada pula di antara mereka yang dijadikan pemimpin bagi kaumnya menuju ke jalan yang benar. Hal itu diberikan karena mereka adalah orang-orang yang beriman dan sabar melaksanakan hukum-hukum Allah. Mereka juga sabar menerima setiap cobaan yang menimpa mereka, dan mereka yakin benar akan petunjuk Allah.\n\nAllah berfirman:\n\nDan Kami berikan kepada Musa Kitab (Taurat) dan Kami menjadikannya sebagai petunjuk bagi Bani Israil (dengan firman), \"Janganlah kamu mengambil (pelindung) selain Aku.\" (al-Isra'\/17",
      "text_translation": "Dan Kami jadikan di antara mereka itu pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami selama mereka sabar. Mereka meyakini ayat-ayat Kami.",
      "text": "وَجَعَلْنَا مِنْهُمْ اَىِٕمَّةً يَّهْدُوْنَ بِاَمْرِنَا لَمَّا صَبَرُوْاۗ وَكَانُوْا بِاٰيٰتِنَا يُوْقِنُوْنَ",
      "text_translation_en": "and [as] We raised among them leaders who, so long as they bore themselves with patience and had sure faith in Our messages, guided [their people] in accordance with Our behest [so, too, shall it be with the divine writ revealed unto thee, O Muhammad.]",
      "juz_number": 21
    },
    "25": {
      "text_tafsir_en": "This verse explains that Allah is the only one who solves and resolves all disputes and conflicts regarding religion between them on the Day of Resurrection. Allah will reward those who disobey the Prophet's call and reward those who obey him. Some interpreters believe that the one who solved the conflict of religion was the Prophet Muhammad. He made a fair decision on the controversy of the apostles and his people on the Day of Judgment.",
      "text_tafsir": "Ayat ini menjelaskan bahwa sesungguhnya hanya Allah yang menyelesaikan dan memberi keputusan segala perselisihan dan pertentangan soal agama antara mereka di hari Kiamat. Allah akan memberikan balasan yang setimpal kepada orang-orang yang mengingkari seruan Nabi dan memberi pahala kepada orang-orang yang mengikutinya.\n\nSebagian ahli tafsir berpendapat bahwa yang menyelesaikan pertentangan soal agama adalah Nabi Muhammad. Ia memberikan keputusan dengan adil terhadap perselisihan para rasul dengan umatnya di hari Kiamat nanti.",
      "text_translation": "Sungguh Tuhanmu, Dia yang memberikan keputusan di antara mereka pada hari Kiamat tentang apa yang dahulu mereka perselisihkan padanya.",
      "text": "اِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ",
      "text_translation_en": "VERILY, it is God alone who will decide between men on Resurrection Day with regard to all on which they were wont to differ.",
      "juz_number": 21
    },
    "26": {
      "text_tafsir_en": "In this verse, Allah warns the Meccan monks who constantly oppose and reject Muhammad's call. Is it not clear to them the true path they have been shown. Do they forget and ignore the consequences that the early Gentiles had rejected the apostles sent to them. Didn't the Meccan monks often trade in Syria and Yemen. Along the way, they saw and saw the former states of 'Ad, Samud, Lut, the people of Aikah, and others who had been destroyed by their acts of denouncing the apostles. Another verse that speaks to this verse is the word of Allah: So how many lands have we destroyed because of (the inhabitants) of the unrighteous, so that their buildings are destroyed and (how many) abandoned wells and high palaces? its inhabitants). (al-hajj \/ 22: 45) Another word of God: That is their houses which have fallen because of their iniquity. Indeed, there is indeed a sign for those who know. (an-Naml \/ 27: 52) Allah says that in the former ruins and dwelling places of those who deny and reject the call of the apostles there is a lesson for those who want to learn. The incident shows that circumcision applies to all wrongdoers.",
      "text_tafsir": "Pada ayat ini, Allah memperingatkan orang-orang musyrik Mekah yang selalu menentang dan mengingkari seruan Nabi Muhammad. Apakah belum jelas bagi mereka jalan benar yang telah ditunjukkan kepada mereka. Apakah mereka lupa dan tidak memperhatikan akibat yang diterima umat-umat dahulu yang mendustakan para rasul yang diutus kepada mereka. Bukankah orang-orang musyrik Mekah sering melakukan perdagangan ke Syiria dan Yaman. Dalam perjalanan itu, mereka menyaksikan dan melihat bekas negeri kaum 'Ad, Samud, Lut, penduduk Aikah, dan sebagainya yang telah hancur akibat tindakan mereka yang mendustakan para rasul.\n\nAyat lain yang senada dengan ayat ini ialah firman Allah:\n\nMaka betapa banyak negeri yang telah Kami binasakan karena (penduduk)nya dalam keadaan zalim, sehingga runtuh bangunan-bangunannya dan (betapa banyak pula) sumur yang telah ditinggalkan dan istana yang tinggi (tidak ada penghuninya). (al-hajj\/22: 45)\n\nFirman Allah lainnya:\n\nMaka itulah rumah-rumah mereka yang runtuh karena kezaliman mereka. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah) bagi orang-orang yang mengetahui. (an-Naml\/27: 52)\n\nAllah mengatakan bahwa sebenarnya pada bekas reruntuhan dan tempat kediaman orang-orang yang mendustakan dan mengingkari seruan rasul itu terdapat pelajaran bagi orang-orang yang mau mengambil pelajaran. Kejadian itu menunjukkan bahwa sunatullah berlaku bagi semua orang yang zalim.",
      "text_translation": "Dan tidakkah menjadi petunjuk bagi mereka, betapa banyak umat-umat sebelum mereka yang telah Kami binasakan, sedangkan mereka sendiri berjalan di tempat-tempat kediaman mereka itu. Sungguh, pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah). Apakah mereka tidak mendengarkan (memperhatikan)?",
      "text": "اَوَلَمْ يَهْدِ لَهُمْ كَمْ اَهْلَكْنَا مِنْ قَبْلِهِمْ مِّنَ الْقُرُوْنِ يَمْشُوْنَ فِيْ مَسٰكِنِهِمْ ۗاِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍۗ اَفَلَا يَسْمَعُوْنَ",
      "text_translation_en": "[But] can, then, they [who deny the truth] learn no lesson by recalling how many a generation We have destroyed before their time? [people] in whose dwelling-places they [themselves now] walk about? In this, behold, there are messages indeed: will they not, then, listen?",
      "juz_number": 21
    },
    "27": {
      "text_tafsir_en": "This verse asks whether the infidels are blind, so that they cannot see the evidence of God's greatness and power. Is it not God who drives the clouds into dry, barren places with no vegetation? The cloud turns into rainwater that floods the land and allows humans to flow into dry lands. The soil then becomes fertile and is nourished by a variety of plants and plants. Some of them are eaten by humans and others by their livestock. Do they not see such evidence that they can acknowledge the greatness and power of God in raising the dead and raising them from their graves? If they were to pay attention, they would have come to the belief that Almighty God had nothing difficult for him. If He wills, He will simply say \"kun\" (so be it).",
      "text_tafsir": "Ayat ini mempertanyakan apakah orang-orang kafir itu buta, sehingga tidak dapat melihat bukti-bukti kebesaran dan kekuasaan Allah? Bukankah Allah yang menghalau awan ke tempat yang kering dan tandus serta tidak mempunyai tumbuh-tumbuhan? Awan itu berubah menjadi air hujan yang menyirami tanah itu sehingga memungkinkan manusia mengalirkannya ke tanah-tanah yang kering. Tanah itu lalu menjadi subur dan ditumbuhi oleh bermacam-macam tumbuh-tumbuhan dan tanam-tanaman. Sebagian tanaman itu dimakan oleh manusia dan sebagian lagi oleh binatang ternak piaraan mereka.\n\nApakah mereka tidak melihat bukti-bukti yang demikian itu sehingga mereka dapat mengakui kebesaran dan kekuasaan Allah dalam menghidupkan manusia yang telah mati dan membangkitkan mereka dari kuburnya? Jika mau memperhatikan, mereka tentu akan sampai kepada keyakinan bahwa Allah Mahakuasa, tidak ada yang sukar bagi-Nya. Jika Dia meng-hendaki, cukuplah Dia mengatakan \"kun\" (jadilah), maka jadilah yang dikehendaki-Nya itu.",
      "text_translation": "Dan tidakkah mereka memperhatikan, bahwa Kami mengarahkan (awan yang mengandung) air ke bumi yang tandus, lalu Kami tumbuhkan (dengan air hujan itu) tanam-tanaman sehingga hewan-hewan ternak mereka dan mereka sendiri dapat makan darinya. Maka mengapa mereka tidak memperhatikan?",
      "text": "اَوَلَمْ يَرَوْا اَنَّا نَسُوْقُ الْمَاۤءَ اِلَى الْاَرْضِ الْجُرُزِ فَنُخْرِجُ بِهٖ زَرْعًا تَأْكُلُ مِنْهُ اَنْعَامُهُمْ وَاَنْفُسُهُمْۗ اَفَلَا يُبْصِرُوْنَ",
      "text_translation_en": "Are they not aware that it is We who drive the rain onto dry land devoid of herbage, and thereby bring forth herbage of which their cattle and they themselves do eat? Can they not, then, see [the truth of resurrection]?",
      "juz_number": 21
    },
    "28": {
      "text_tafsir_en": "In this verse it is explained that because of their belief in Islam, Muslims often say that God will give them victory. At that time a fair decision will be made between men, including those with unbelievers. The infidels, especially the Meccans, after listening to the speech of the Muslims, questioned it with the intention of ridiculing and mocking them. Those disbelievers say, \"O Muslims, you always say that victory will come to you soon, while you are all useless and humble among us. what exactly are you saying, tell us when it happened? \"",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa karena keyakinan kepada agama Islam yang mereka anut, kaum Muslimin sering mengatakan nanti Allah akan memberi kemenangan kepada mereka. Pada waktu itu akan diputuskan keputusan yang adil antara manusia, termasuk antara mereka dengan orang-orang kafir.\n\nOrang-orang kafir, terutama kaum musyrik Mekah, setelah mendengarkan ucapan-ucapan kaum Muslimin itu, menanyakan hal tersebut dengan maksud untuk mengejek dan memperolok-olokkan mereka. Orang-orang kafir itu mengatakan, \"Wahai kaum Muslimin, kamu sekalian selalu mengatakan bahwa kemenangan itu akan segera kamu peroleh, padahal kamu sekalian adalah orang-orang yang tak ada gunanya dan orang-orang rendah di antara kita. Mungkinkah dakwaan kamu terwujud? Jika benar apa yang kamu katakan itu, terangkanlah kepada kami kapan terjadinya?\"",
      "text_translation": "Dan mereka bertanya, “Kapankah kemenangan itu (datang) jika engkau orang yang benar?”",
      "text": "وَيَقُوْلُوْنَ مَتٰى هٰذَا الْفَتْحُ اِنْ كُنْتُمْ صٰدِقِيْنَ",
      "text_translation_en": "But they answer: “When will that final decision take place, if what you [believers] say is true?”",
      "juz_number": 21
    },
    "29": {
      "text_tafsir_en": "This verse explains that Muhammad told the Meccans, including the unbelievers, that the day of victory and the Day of Judgment was the Day of Resurrection. In that day it was no longer helpful to the faith of someone who was only spoken at that time, when in the world he was a heathen. They were not given the opportunity to repent. Not giving repentance to those who disbelieved on that day was justified because they had been warned by the apostles that they had lived all their life. The Apostle showed the path of eternal happiness to those contained in the Qur'an and the hadith, but they still refused and rebelled. God will establish justice among men on the Day of Judgment. Those who do good will be rewarded with good rewards, while those who do evil will be punished with painful torments. This is in accordance with the word of God: \"O our Lord, make a decision between us and our people with justice. You are the best decision-maker.\" (al-A'raf \/ 7: 89)",
      "text_tafsir": "Ayat ini menjelaskan bahwa Muhammad mengatakan kepada orang-orang musyrik Mekah itu, termasuk juga di dalamnya orang-orang kafir, bahwa hari kemenangan dan hari penyelesaian yang adil itu ialah hari Kiamat. Pada hari itu tidak bermanfaat lagi iman seseorang yang hanya diucapkan ketika itu, padahal waktu di dunia, dia adalah orang kafir. Mereka pada hari itu tidak diberi kesempatan untuk bertobat. Tidak memberi kesempatan bertobat kepada orang-orang kafir pada hari itu adalah wajar karena mereka selama hidup di dunia telah diberi peringatan oleh rasul yang diutus kepada mereka. Rasul itu telah menunjukkan jalan kebahagiaan yang abadi kepada mereka yang termuat di dalam Al-Qur'an dan hadis, tetapi mereka tetap ingkar dan membangkang.\n\nAllah akan menetapkan hukum di antara manusia dengan adil pada hari Kiamat. Orang-orang yang berbuat baik akan dibalas dengan pahala yang baik, sedangkan orang-orang yang berbuat buruk akan diazab dengan siksaan yang pedih. Hal ini sesuai dengan firman Allah:\n\n\"Ya Tuhan kami, berilah keputusan antara kami dan kaum kami dengan hak (adil). Engkaulah pemberi keputusan terbaik.\" (al-A'raf\/7: 89)",
      "text_translation": "Katakanlah, “Pada hari kemenangan itu, tidak berguna lagi bagi orang-orang kafir keimanan mereka dan mereka tidak diberi penangguhan.”",
      "text": "قُلْ يَوْمَ الْفَتْحِ لَا يَنْفَعُ الَّذِيْنَ كَفَرُوْٓا اِيْمَانُهُمْ وَلَا هُمْ يُنْظَرُوْنَ",
      "text_translation_en": "Say: “On the Day of the Final Decision, their [newly-found] faith will be of no use to those who [in their lifetime] were bent on denying the truth, nor will they be granted respite!” –",
      "juz_number": 21
    },
    "30": {
      "text_tafsir_en": "As the Muslims continued to reject, even beginning to challenge and hurt the Muslims, Allah commanded the Messenger of Allah and the Muslims to turn away from them, and to ignore them. Allah's Messenger (may peace be upon him) ordered all the people to receive the revelation that was given to him, according to the task he had received from Allah. Let the unbelievers wait for the punishment that Allah will inflict upon them both in this world and in the Hereafter, in return for the evil they have done to the Prophet and all the Muslims. God will truly keep His promise. At the end of this verse, Allah explains that the Prophet Muhammad will see the consequences of his great heart and the response of his efforts to deliver the Book of Allah. He will protect and protect the Prophet (saws) from all the dangers that come from the Muslims. According to a history, after this verse, let down the verses that enabled the Prophet and his companions to fight the infidels.",
      "text_tafsir": "Karena orang-orang musyrik tetap ingkar, bahkan telah mulai menantang dan menyakiti kaum Muslimin, maka Allah memerintahkan agar Rasulullah dan kaum Muslimin berpaling dari mereka, serta tidak mengindahkan mereka lagi. Rasulullah juga diperintahkan untuk menyeru seluruh manusia agar menerima wahyu yang telah disampaikan kepadanya, sesuai dengan tugas yang diterimanya dari Allah. Hendaklah orang-orang musyrik itu menunggu azab yang akan ditimpakan Allah kepada mereka baik di dunia maupun di akhirat, sebagai balasan perbuatan jahat yang telah mereka lakukan kepada Nabi saw dan seluruh kaum Muslimin. Allah benar-benar akan menepati janji-Nya.\n\nPada akhir ayat ini, Allah menerangkan bahwa Nabi Muhammad akan melihat akibat dari sikap kebesaran hatinya dan balasan dari usahanya menyampaikan risalah Allah. Dia akan menjaga dan memelihara Nabi saw dari segala macam bahaya yang datang dari kaum musyrik itu.\n\nMenurut suatu riwayat, setelah ayat ini, turunlah ayat-ayat yang membolehkan Rasulullah saw dan para sahabat memerangi orang-orang kafir.",
      "text_translation": "Maka berpalinglah engkau dari mereka dan tunggulah, sesungguhnya mereka (juga) menunggu.",
      "text": "فَاَعْرِضْ عَنْهُمْ وَانْتَظِرْ اِنَّهُمْ مُّنْتَظِرُوْنَ ࣖ",
      "text_translation_en": "and then leave them alone, and wait [for the truth to unfold as] they, behold, are waiting.",
      "juz_number": 21
    }
  },
  "name": "السّجدة",
  "name_translation_en": "The Prostration",
  "name_translation": "Sajdah",
  "name_latin": "As-Sajdah"
}