{
  "number": 34,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 54,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse confirms that it is Allah who has the right to receive all praise because He created all things in heaven and on earth. He is the true owner, and no one associates with God in creating and possessing it. It is God who controls and manages it and bestows His grace so that everything goes in order and order. Therefore, no one should receive praise except Allah, no one should worship and pray except Allah. As for those who worship and adore the statues or other things, they are the ones who do not use their senses. There is abundant evidence that shows the existence and oneness of God both on earth and in heaven. If humans were to pay attention, he would have come to the conclusion that the Creator of this universe is the One, Almighty, and Creator. Only God is worthy of worship and praise, though He does not require praise from His servants and creatures. Only His creatures should worship and praise Him, for so great and abundant is His gift. If no one worships and praises Him or all His creatures disbelieving and disobeys His grace and grace, then it will not harm Him as it says in His Word: \"If you and those on earth they are all disbelievers, so surely Allah is All-Powerful, All-Glorious. \" (Ibrahim \/ 14: 8) To awaken man to his senses, God explained that all His creatures in heaven and on earth glorified Him, including the birds that fly in the air. Allah says: Do you not know that to Allah is the glory of the heavens and the earth, and the birds that spread their wings? Each one really, has learned how to pray and praise. Allah knows best what they do. . No one is harmed in the reckoning of their deeds, good is rewarded with good, and evil is repaid with equal punishment, even by His grace and grace a good deed is multiplied. In another verse is described how great is the praise of His faithful servants for the grace bestowed upon them in return for His life's work in His Word: And they say, \"All praise be to Allah who has kept His promise.\" and have given us this place while we (are) allowed to live in heaven wherever we please. \" So it is best for those who do good. (az-Zumar \/ 39: 74) And his word: And they say, \"Praise be to Allah, who has taken away our grief. Indeed, our Lord is Most Forgiving, Most Merciful, who by His grace has placed us in the eternal (paradise); in it we do not tire nor weary. \" (Fathir \/ 35: 34-35) Then Allah declares that He is the Mighty, the All-Powerful, the Controller of the world and the Hereafter and the whole of nature. He is the All-knowing and all-knowing. He knows everything by his infinite knowledge.",
      "text_tafsir": "Ayat ini menegaskan bahwa Allah-lah yang berhak menerima segala pujian karena Dia yang menciptakan semua yang ada di langit dan di bumi. Dialah pemilik yang sebenarnya, tidak ada seorang pun yang bersekutu dengan Allah dalam menciptakan dan memilikinya.\n\nAllah pula yang mengatur dan mengurusnya serta melimpahkan karunia-Nya agar semuanya berjalan dengan tertib dan teratur. Oleh sebab itu, tidak ada yang patut memperoleh pujian kecuali Allah, tidak ada yang patut disembah dan dipanjatkan doa kecuali kepada Allah. Adapun orang-orang yang menyembah dan memuja patung-patung atau yang lainnya adalah orang-orang yang tidak mempergunakan akal. \n\nBanyak sekali bukti yang menunjukkan wujud dan keesaan Allah yang terdapat di bumi dan di langit. Bila manusia mau memperhatikan, tentu dia akan sampai kepada kesimpulan bahwa Pencipta semua alam ini adalah Allah Yang Maha Esa, Mahakuasa, dan Maha Pencipta. Hanya Allah yang berhak disembah dan dipuji, walaupun Dia sendiri tidak memerlukan pujian dari hamba dan makhluk-Nya. Hanya makhluk-makhluk-Nya yang harus memuja dan memuji-Nya, karena begitu besar dan banyaknya karunia yang dilimpahkan kepadanya. Sekiranya tidak ada yang menyembah dan memuji-Nya atau semua makhluk-Nya kafir dan ingkar terhadap nikmat dan karunia-Nya, maka hal itu tidak akan merugikan-Nya sedikit pun sebagaimana tersebut dalam firman-Nya:\n\n\"Jika kamu dan orang yang ada di bumi semuanya mengingkari (nikmat Allah), maka sesungguhnya Allah Mahakaya, Maha Terpuji.\" (Ibrahim\/14: 8)\n\nUntuk menyadarkan manusia agar mau menggunakan akalnya, Allah menerangkan bahwa semua makhluk-Nya di langit dan di bumi bertasbih memuji-Nya, termasuk burung-burung yang terbang di udara. Allah berfirman:\n\nTidakkah engkau (Muhammad) tahu bahwa kepada Allah-lah bertasbih apa yang di langit dan di bumi, dan juga burung yang mengembangkan sayapnya. Masing-masing sungguh, telah mengetahui (cara) berdoa dan bertasbih. Allah Maha Mengetahui apa yang mereka kerjakan. (an-Nur\/24: 41)\n\nAyat selanjutnya menegaskan bahwa Allah yang berhak dipuji di akhirat nanti, karena Dia yang mempunyai kekuasaan di sana, dan bertindak dengan adil dan bijaksana dalam memperhitungkan dan membalas perbuatan hamba-Nya. Tidak ada seorang pun yang dirugikan dalam perhitungan perbuatannya, yang baik dibalas dengan kebaikan, dan yang jahat dibalas dengan siksa yang setimpal, bahkan dengan rahmat dan karunia-Nya satu perbuatan yang baik dibalas dengan berlipat ganda. Di dalam ayat lain diterangkan bagaimana besarnya pujian hamba-hamba-Nya yang beriman terhadap nikmat yang dikaruniakan kepada mereka sebagai balasan atas perbuatannya selama hidup di dunia dengan firman-Nya:\n\nDan mereka berkata, \"Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami dan telah memberikan tempat ini kepada kami sedang kami (diperkenankan) menempati surga di mana saja yang kami kehendaki.\" Maka (surga itulah) sebaik-baik balasan bagi orang-orang yang beramal. (az-Zumar\/39: 74)\n\nDan firman-Nya:\n\nDan mereka berkata, \"Segala puji bagi Allah yang telah menghilangkan kesedihan dari kami. Sungguh, Tuhan kami benar-benar Maha Pengampun, Maha Mensyukuri, yang dengan karunia-Nya menempatkan kami dalam tempat yang kekal (surga); di dalamnya kami tidak merasa lelah dan tidak pula merasa lesu.\" (Fathir\/35: 34-35)\n\nKemudian Allah menegaskan bahwa Dialah Yang Mahabijaksana, berbuat dan bertindak, serta mengatur dan mengendalikan urusan dunia dan akhirat serta alam seluruhnya. Dialah Yang Maha Mengetahui segala sesuatu dan segala urusan. Dia Mengetahui segala-galanya dengan ilmu-Nya Yang Mahaluas.",
      "text_translation": "Segala puji bagi Allah yang memiliki apa yang ada di langit dan apa yang ada di bumi dan segala puji di akhirat bagi Allah. Dan Dialah Yang Mahabijaksana, Mahateliti. ",
      "text": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِ وَلَهُ الْحَمْدُ فِى الْاٰخِرَةِۗ وَهُوَ الْحَكِيْمُ الْخَبِيْرُ",
      "text_translation_en": "ALL PRAISE is due to God, to whom all that is in the heavens and all that is on earth belongs; and to Him will be due all praise in the life to come. For He alone is truly wise, all-aware:",
      "juz_number": 22
    },
    "2": {
      "text_tafsir_en": "In this verse, Allah explains how broad and deep His knowledge is. He knows everything that enters the earth, everything that comes out of it, everything that comes down from heaven and everything that rises on it. With these concise and short words, Allah illustrates how vast His knowledge is. If all the inhabitants of this earth spent their time to know what happened in heaven and earth in one moment, surely they would not be able to record to make statistics. How many seeds and seeds of plants that enter and hide in the ground. How many small animals such as caterpillars, worms, and various types of insects in the bowels of this vast earth. How many mining materials are always processing and developing in the bowels of the earth such as gold, silver, oil, gas, and so forth. How many also come out of the earth like plants that appear, springs that emanate, soaring gases, animals and insects that want to enjoy the sunlight and free air and so forth. How much falls from the sky like an unpredictable rain, how much is a blessing from Allah for His servants, the light that radiates as hot as the sun, and the light that emits calmly like the moonlight. Then how much will rise to the sky like steam from rivers and seas, gas molecules from plants, humans and animals and the earth itself. How many dead human spirits and angels who ascended to heaven obeyed the commands of their Lord. All this will not be recorded by humans let alone to find out one by one. However, Allah knows best that nothing is hidden from Him, all of which are included in His knowledge. What is true is said by Allah: Whereas you are given only a little knowledge. (al-Isra '\/ 17: 85) Such is the breadth of Allah's knowledge and His grace and gifts to His servants, because all that is on earth and in the sky He created for the benefit of humans. In addition, Allah, the Most Merciful, gives infinite gifts, and Forgives those who are guilty when they are converted and repent of their mistakes.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan bagaimana luas dan dalamnya ilmu-Nya. Dia mengetahui semua yang masuk ke dalam bumi, semua yang keluar daripadanya, semua yang turun dari langit dan semua yang naik ke atasnya. Dengan kata-kata yang ringkas dan pendek ini, Allah menggambarkan betapa luas ilmu-Nya. Andaikata semua penghuni bumi ini menghabiskan waktunya untuk mengetahui apa yang terjadi di langit dan bumi dalam satu saat saja, niscaya mereka tidak akan sanggup mencatat untuk membuat statistiknya. Betapa banyaknya bibit dan benih tumbuh-tumbuhan yang masuk dan bersembunyi di dalam tanah. Betapa banyaknya binatang kecil seperti ulat, cacing, dan berbagai jenis serangga di dalam perut bumi yang amat luas ini. Betapa banyaknya bahan-bahan tambang yang selalu berproses dan berkembang di perut bumi seperti emas, perak, tambang minyak, gas, dan lain sebagainya.\n\nBetapa banyak pula yang keluar dari bumi seperti tanaman yang bermunculan, mata air yang memancar, gas yang naik menjulang, binatang dan serangga yang ingin menikmati cahaya matahari dan udara bebas dan lain sebagainya. Betapa banyaknya yang turun dari langit seperti hujan yang tak dapat diperkirakan berapa banyaknya yang merupakan rahmat dari Allah bagi hamba-Nya, cahaya yang memancar dengan panasnya seperti cahaya matahari, dan cahaya yang memancar dengan tenang seperti cahaya bulan. Kemudian betapa pula banyaknya yang naik ke langit seperti uap dari sungai dan laut, molekul-molekul gas dari tumbuh-tumbuhan, manusia dan binatang serta bumi sendiri. Betapa banyaknya roh manusia yang meninggal dan malaikat yang naik ke langit taat melaksanakan perintah Tuhannya. Semua ini tidak akan dapat dicatat oleh manusia apalagi untuk mengetahuinya satu per satu. Tetapi, Allah Yang Maha Mengetahui tidak ada satu pun yang tersembunyi bagi-Nya, semuanya telah tercakup dalam ilmu-Nya. Benarlah apa yang difirmankan oleh Allah:\n\nSedangkan kamu diberi pengetahuan hanya sedikit. (al-Isra'\/17: 85)\n\nDemikian luasnya ilmu Allah dan rahmat serta karunia-Nya kepada hamba-Nya, karena semua yang ada di bumi dan di langit itu diciptakan-Nya untuk kepentingan manusia. Di samping itu, Allah Yang Maha Penyayang memberikan karunia yang tidak terhingga, dan Maha Pengampun terhadap orang yang bersalah bila ia insaf dan tobat dari kesalahannya.",
      "text_translation": "Dia mengetahui apa yang masuk ke dalam bumi, apa yang keluar darinya, apa yang turun dari langit dan apa yang naik kepadanya. Dan Dialah Yang Maha Penyayang, Maha Pengampun.",
      "text": "يَعْلَمُ مَا يَلِجُ فِى الْاَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاۤءِ وَمَا يَعْرُجُ فِيْهَاۗ وَهُوَ الرَّحِيْمُ الْغَفُوْرُ",
      "text_translation_en": "He knows all that enters the earth, and all that comes out of it, as well as all that descends from the skies, and all that ascends to them. And He alone is a dispenser of grace, truly-forgiving.",
      "juz_number": 22
    },
    "3": {
      "text_tafsir_en": "In this verse, God explains how the disbelievers who deny the Day of Resurrection and say that this life is only in the world. They say that the afterlife that Muhammad saw was a mere nonsense, something that would not have happened since the human body after entering the grave would have been devastated, even after a long time. Allah ordered the Prophet Muhammad to reject strongly the notion of the disbelievers. Allah commanded the Prophet to swear by mentioning the name of Allah that the Day of Resurrection must come. This verse is one of the three verses that ask the Prophet Muhammad to swear by mentioning the name of Allah as a protest against the disbelievers, as Allah declares in His Word: And they ask you (Muhammad) that? \" Say, \"Yes, for the sake of my Lord, verily (the torment) must be true and you will never be able to avoid it.\" (Jonah \/ 10: 53) Second in Surah at-Tagabun: Those who disbelieve think that they will not be raised. Say (Muhammad), \"Not so, for the sake of my Lord, you must be raised, and then declare all that you have done.\" And that is easy for Allah. (at-Tagabun \/ 64: 7) Such is the stark rebuke that Prophet Muhammad must speak against the disbelief of the Day of Resurrection, for it is the wisdom and wisdom of God to His servants. It is a wisdom and wisdom that the infidels do not understand or do not understand. That wisdom and wisdom is that God will not allow his servants to do what he wants them to do. God has made clear through His apostles that whoever commits evil or injustice will be rewarded with a just and righteous reward in this world and in the hereafter. If a servant has not been rewarded in the world for his crime or his cleverness conceals the crime, then his reward will surely be received in the hereafter. So are the servants of God who do good. This is the wisdom and wisdom of God the All-Knowing, the All-Knowing of all His servants. On the day of the resurrection all human acts have a fair reward even in the world of suffering, let alone the servant of God who has not received his reward. To deny the Day of Judgment and the Day of Judgment means to deny the wisdom of the All-Powerful and Almighty God. Then Allah explained that He knows all that is in the heavens and the earth, that there is nothing hidden for him, not even the size of a zarrah (atoms) because they are all contained in the Far Mahfudh. Let no servant think that his deeds are so small or so veiled that they are hidden from the knowledge of God. He must know it and will repay it, both in this world and in the Hereafter, according to the wisdom and justice of His cause.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bagaimana kesesatan orang-orang kafir yang mengingkari hari Kiamat dan mengatakan bahwa hidup ini hanya sebatas di dunia saja. Mereka mengatakan bahwa kehidupan akhirat yang diberitakan Muhammad saw adalah omong kosong belaka, sesuatu yang tidak mungkin terjadi karena tubuh manusia setelah masuk kubur akan hancur luluh tidak berbekas apalagi setelah melalui masa yang panjang. \n\nAllah memerintahkan kepada Nabi Muhammad supaya menolak dengan keras anggapan orang-orang kafir yang sesat itu. Allah memerintahkan supaya Nabi bersumpah dengan menyebut nama Allah bahwa hari Kiamat itu pasti datang. Ayat ini adalah salah satu dari tiga ayat yang menyuruh Nabi Muhammad supaya bersumpah dengan menyebut nama Allah sebagai bantahan terhadap keingkaran orang-orang kafir, seperti ditegaskan Allah dalam firman-Nya:\n\nDan mereka menanyakan kepadamu (Muhammad), \"Benarkah (azab yang dijanjikan) itu?\" Katakanlah, \"Ya, demi Tuhanku, sesungguhnya (azab) itu pasti benar dan kamu sekali-kali tidak dapat menghindar.\" (Yunus\/10: 53)\n\nYang kedua dalam Surah at-Tagabun:\n\nOrang-orang yang kafir mengira, bahwa mereka tidak akan dibangkitkan. Katakanlah (Muhammad), \"Tidak demikian, demi Tuhanku, kamu pasti dibangkitkan, kemudian diberitakan semua yang telah kamu kerjakan.\" Dan yang demikian itu mudah bagi Allah. (at-Tagabun\/64: 7)\n\nDemikian kerasnya bantahan yang harus diucapkan oleh Nabi Muhammad terhadap keingkaran orang kafir tentang hari kebangkitan, karena hal itu adalah suatu hikmah dan kebijaksanaan Allah terhadap hamba-hamba-Nya. Suatu hikmah dan kebijaksanaan yang tidak dipahami oleh orang-orang kafir atau mereka tidak mau memahaminya. Hikmah dan kebijaksanaan itu ialah Allah tidak akan membenarkan hamba-hamba-Nya untuk berbuat sekehendak hatinya. Allah telah menjelaskan dengan perantaraan para rasul-Nya bahwa barang siapa yang berbuat kejahatan atau kezaliman akan dibalas dengan balasan yang setimpal baik di dunia maupun di akhirat. Kalau seorang hamba belum mendapat balasan di dunia atas kejahatannya karena kedudukan atau kepintarannya menyembunyikan kejahatan itu, maka balasannya pasti akan diterimanya di akhirat nanti. \n\nDemikian pula halnya hamba-hamba Allah yang berbuat kebaikan. Ini adalah hikmat dan kebijaksanaan Allah Yang Mahaadil, Maha Mengetahui segala perbuatan hamba-Nya. Pada hari kebangkitan semua perbuatan manusia mendapat balasan yang wajar walaupun di dunia sudah mendapat siksaan, apalagi bagi hamba Allah yang belum menerima balasannya. Mengingkari hari Kiamat dan hari pembalasan berarti mengingkari hikmah kebijaksanaan Allah Yang Mahaadil dan Mahakuasa.\n\nKemudian Allah menerangkan bahwa Dia mengetahui semua yang ada dan yang terjadi di langit dan di bumi, tidak ada suatu pun yang tersembunyi bagi-Nya, sekalipun sebesar zarrah (atom) karena semua itu telah termaktub dalam Lauh Mahfudh. Janganlah seorang hamba mengira bahwa perbuatannya yang sangat kecil atau yang telah ditutupi rapat dan disembunyikan luput dari pengetahuan Allah. Dia pasti mengetahuinya dan akan membalas perbuatan itu, baik di dunia maupun akhirat, sesuai dengan hikmah kebijaksanaan dan keadilan-Nya.",
      "text_translation": "Dan orang-orang yang kafir berkata, “Hari Kiamat itu tidak akan datang kepada kami.” Katakanlah, “Pasti datang, demi Tuhanku yang mengetahui yang gaib, Kiamat itu pasti akan datang kepadamu. Tidak ada yang tersembunyi bagi-Nya sekalipun seberat zarrah baik yang di langit maupun yang di bumi, yang lebih kecil dari itu atau yang lebih besar, semuanya (tertulis) dalam Kitab yang jelas (Lauh Mahfuzh),”",
      "text": "وَقَالَ الَّذِيْنَ كَفَرُوْا لَا تَأْتِيْنَا السَّاعَةُ ۗقُلْ بَلٰى وَرَبِّيْ لَتَأْتِيَنَّكُمْۙ عٰلِمِ الْغَيْبِۙ لَا يَعْزُبُ عَنْهُ مِثْقَالُ ذَرَّةٍ فِى السَّمٰوٰتِ وَلَا فِى الْاَرْضِ وَلَآ اَصْغَرُ مِنْ ذٰلِكَ وَلَآ اَكْبَرُ اِلَّا فِيْ كِتٰبٍ مُّبِيْنٍۙ  ",
      "text_translation_en": "And yet, they who are bent on denying the truth assert, “Never will the Last Hour come upon us!” Say: “Nay, by my Sustainer! By Him who knows all that is beyond the reach of a created being’s perception: it will most certainly come upon you!” Not an atom’s weight [of whatever there is] in the heavens or on earth escapes His knowledge; and neither is there anything smaller than that, or larger, but is recorded in [His] clear decree,",
      "juz_number": 22
    },
    "4": {
      "text_tafsir_en": "But believers believe in the Day of Resurrection and prove their faith by doing righteous deeds and abstaining from the prohibitions of God. They will obtain forgiveness from the Most Forgiving God. God will forgive their sins and blot out their sins according to His word: Good works will erase their sins. It is a warning to those who always remember (Allah). (Hud \/ 11: 114)",
      "text_tafsir": "Adapun orang-orang yang beriman percaya kepada hari kebangkitan dan membuktikan keimanan mereka dengan mengerjakan amal saleh serta menjauhi perbuatan yang dilarang Allah. Mereka akan memperoleh ampunan dari Allah Yang Maha Pengampun. Allah akan mengampuni kesalahan mereka dan menghapuskan dosa mereka sesuai dengan firman-Nya:\n\nPerbuatan-perbuatan baik itu menghapus kesalahan-kesalahan. Itulah peringatan bagi orang-orang yang selalu mengingat (Allah). (Hud\/11: 114)",
      "text_translation": "agar Dia (Allah) memberi balasan kepada orang-orang yang beriman dan mengerjakan kebajikan. Mereka memperoleh ampunan dan rezeki yang mulia (surga).",
      "text": "لِّيَجْزِيَ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِۗ اُولٰۤىِٕكَ لَهُمْ مَّغْفِرَةٌ وَّرِزْقٌ كَرِيْمٌ ",
      "text_translation_en": "to the end that He may reward those who believe and do right­eous deeds: [for] it is they whom forgiveness of sins awaits, and a most excellent sustenance",
      "juz_number": 22
    },
    "5": {
      "text_tafsir_en": "Instead, those who disregard God's revelations, try to prevent others from believing in God and His Messenger, and denying the Day of Resurrection and mocking those who believe in it, think that they will escape the punishment of Allah. Because of their arrogance and disobedience, they will receive a very painful torment and will be thrown into Hell. Thus the wisdom of wisdom and justice of God provided a day of resurrection for man to receive according to his deeds. It is impossible for God to equate his good servant with his evil servant. God says in the verse below: Should we treat those who believe and do good deeds as those who do evil on earth? Or do We consider the righteous to be the same as the wicked? (shad \/ 38: 28) And his word: The dwellers of hell are not like the dwellers of heaven; the inhabitants of heaven are the ones who win. (al-hasyr \/ 59: 20)",
      "text_tafsir": "Sebaliknya orang-orang yang mengingkari ayat-ayat Allah, berusaha menghalang-halangi orang lain untuk beriman kepada Allah dan Rasul-Nya, dan mendustakan hari kebangkitan serta memperolok-olokkan orang yang memercayainya, menyangka bahwa mereka akan luput dari azab Allah. Karena kesombongan dan keingkaran, mereka akan memperoleh azab yang sangat pedih dan akan dilemparkan ke dalam neraka Jahim. Demikianlah hikmah kebijaksanaan dan keadilan Allah menyediakan hari kebangkitan supaya manusia menerima balasan sesuai dengan perbuatannya. Mustahil Allah akan menyamakan hamba-Nya yang berbuat baik dengan hamba-Nya yang berbuat jahat. Allah berfirman pada ayat di bawah ini:\n\nPantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan sama dengan orang-orang yang berbuat kerusakan di bumi? Atau pantaskah Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang jahat? (shad\/38: 28) \n\nDan firman-Nya:\n\nTidak sama para penghuni neraka dengan para penghuni-penghuni surga; penghuni-penghuni surga itulah orang-orang yang memperoleh kemenangan. (al-hasyr\/59: 20)",
      "text_translation": "Dan orang-orang yang berusaha untuk (menentang) ayat-ayat Kami dengan anggapan mereka dapat melemahkan (menggagalkan azab Kami), mereka itu akan memperoleh azab, yaitu azab yang sangat pedih.",
      "text": "وَالَّذِيْنَ سَعَوْ فِيْٓ اٰيٰتِنَا مُعٰجِزِيْنَ اُولٰۤىِٕكَ لَهُمْ عَذَابٌ مِّنْ رِّجْزٍ اَلِيْمٌ ",
      "text_translation_en": "whereas for those who strive against Our messages, seeking to defeat their purpose, there is grievous suffering in store as an outcome of [their] vileness.",
      "juz_number": 22
    },
    "6": {
      "text_tafsir_en": "Allah explains that unlike the disbelievers who do not want to use their intellect and mind and a priori reject what the Qur'an preaches, some People of the Book, such as' Abdullah bin Salam, Ka'ab, and others, admit that what is reported in The Qur'an about the coming of doom is true and cannot be doubted. They also recognize that the Qur'an is a guide from Allah to the right path which must be followed by humans to achieve world and hereafter happiness. In the Qur'an there are laws, regulations and laws that are in accordance with human nature and the environment and will surely bring happiness.",
      "text_tafsir": "Allah menjelaskan bahwa berbeda dengan orang kafir yang tidak mau mempergunakan akal dan pikirannya dan secara apriori menolak apa yang diberitakan Al-Qur'an, sebagian Ahli Kitab, seperti 'Abdullah bin Salam, Ka'ab, dan lainnya, mengakui bahwa apa yang diberitakan dalam Al-Qur'an tentang akan datangnya hari kiamat adalah benar dan tidak dapat diragukan lagi. Mereka juga mengakui bahwa Al-Qur'an adalah petunjuk dari Allah kepada jalan lurus yang harus dipedomani oleh manusia untuk mencapai kebahagiaan dunia dan akhirat. Di dalam Al-Qur'an itu terdapat undang-undang, peraturan, dan hukum yang sesuai dengan fitrah manusia dan lingkungan hidupnya serta pasti akan membawa kebahagiaan.",
      "text_translation": "Dan orang-orang yang diberi ilmu (Ahli Kitab) berpendapat bahwa (wahyu) yang diturunkan kepadamu (Muhammad) dari Tuhanmu itulah yang benar dan memberi petunjuk (bagi manusia) kepada jalan (Allah) Yang Mahaperkasa, Maha Terpuji.",
      "text": "وَيَرَى الَّذِيْنَ اُوْتُوا الْعِلْمَ الَّذِيْٓ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ هُوَ الْحَقَّۙ وَيَهْدِيْٓ اِلٰى صِرَاطِ الْعَزِيْزِ الْحَمِيْدِ ",
      "text_translation_en": "NOW THEY who are endowed with [innate] knowl­edge are well aware that whatever has been be­stowed upon thee from on high by thy Sustainer is indeed the truth, and that it guides onto the way that leads to the Almighty, the One to whom all praise is due!",
      "juz_number": 22
    },
    "7": {
      "text_tafsir_en": "In this verse, Allah describes the disbelief of the disbelievers on the day of the Resurrection and how great their ridicule and mockery of the Prophet Muhammad was. They asked each other about a man who said that if they had died and were buried then their bodies and bones would have been destroyed, and then they would come back to take responsibility for their actions. The one who said it was Muhammad who declared that he had received a revelation from his Lord. They thought this was a great opportunity for them to influence public opinion and discredit the Prophet and say that he had gone mad or made a big lie to God by saying that the news was a revelation that was revealed to him. It is likely that most of the common people will be influenced by such ridicule and ridicule so that they will look down on the Prophet. Therefore, God emphasizes in this verse that those who do not believe in the hereafter will be tormented and will be in real error. They will be tormented both in the world and in the hereafter. In the world they will be straying in the middle of their journey, not knowing where to go, and always in doubt and doubt. People who have no faith and do not believe in the justice of God and in the hereafter will always be in a state of confusion. He has no hope for the justice of God because what he has seen and seen in this world is full of mischief and injustice. The weak are the victims of the strong. As believers who fully believe in the justice of God and the calculation of human deeds in the hereafter, they will be fully convinced that when they are persecuted, God will reward those who persecute them in return. If not in this world, then there will be retribution. Even in the hereafter God will reward you twice for his patience and patience. The belief in the existence of the Hereafter is a mercy to a servant of God.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan keingkaran orang-orang kafir terhadap terjadinya hari kebangkitan dan bagaimana hebatnya cemoohan dan olok-olok mereka terhadap Nabi Muhammad yang memberitakannya. Mereka saling bertanya tentang seorang laki-laki yang mengatakan bahwa apabila mereka telah mati dan dikuburkan kemudian tubuh dan tulang-belulang mereka telah hancur luluh, sesudah itu akan hidup kembali untuk mempertanggungjawabkan perbuatan mereka. Orang yang mengatakan hal itu adalah Muhammad yang mendakwahkan bahwa dia menerima wahyu dari Tuhannya. Mereka menganggap bahwa ini adalah suatu peluang besar bagi mereka untuk mempengaruhi pendapat umum dan mendiskreditkan Nabi serta mengatakan bahwa dia telah gila atau mengada-adakan suatu kebohongan besar terhadap Allah dengan mengatakan bahwa berita itu adalah wahyu yang diturunkan kepadanya. Mungkin kebanyakan orang awam akan terpengaruh oleh cemoohan dan olok-olok itu sehingga mereka memandang rendah dan hina terhadap Nabi. \n\nOleh sebab itu, Allah menegaskan dalam ayat ini bahwa orang-orang yang tidak percaya akan adanya hari akhirat akan mendapat siksaan dan berada dalam kesesatan yang nyata. Mereka akan mendapat siksaan baik di dunia maupun di akhirat. Di dunia mereka akan menjadi orang-orang yang sesat di tengah perjalanan hidupnya, tidak mengetahui arah yang akan dituju, serta selalu dalam kegelisahan dan keragu-raguan. Orang-orang yang tidak mempunyai akidah dan tidak percaya kepada keadilan Allah dan hari akhirat akan selalu terombang-ambing dalam kebingungan. Ia tidak mempunyai harapan untuk mendapat keadilan Allah karena apa yang ditemui dan dilihatnya di dunia ini penuh dengan kepincangan dan kezaliman. Orang yang lemah menjadi mangsa bagi yang kuat. Sedangkan orang-orang yang beriman yang percaya sepenuhnya akan keadilan Allah dan adanya perhitungan perbuatan manusia di akhirat nanti, tentu akan yakin sepenuhnya bahwa bila ia teraniaya, Allah akan membalas orang yang menganiayanya dengan balasan yang setimpal. Kalau tidak di dunia ini, di akhirat nanti pasti pembalasan itu akan terlaksana. Bahkan di akhirat nanti Allah akan memberi balasan yang berlipat ganda atas kesabaran dan ketawakalannya. Kepercayaan kepada adanya hari akhirat adalah suatu rahmat bagi seorang hamba Allah.",
      "text_translation": "Dan orang-orang kafir berkata (kepada teman-temannya), “Maukah kami tunjukkan kepadamu seorang laki-laki yang memberitakan kepadamu bahwa apabila badanmu telah hancur sehancur-hancurnya, kamu pasti (akan dibangkitkan kembali) dalam ciptaan yang baru.",
      "text": "وَقَالَ الَّذِيْنَ كَفَرُوْا هَلْ نَدُلُّكُمْ عَلٰى رَجُلٍ يُّنَبِّئُكُمْ اِذَا مُزِّقْتُمْ كُلَّ مُمَزَّقٍۙ اِنَّكُمْ لَفِيْ خَلْقٍ جَدِيْدٍۚ ",
      "text_translation_en": "As against this, they who are bent on denying the truth say [unto all who are of like mind]: “Shall we point out to you a man who will tell you that [after your death,] when you will have been scattered in countless fragments, you shall - lo and behold! - be [restored to life] in a new act of creation?",
      "juz_number": 22
    },
    "8": {
      "text_tafsir_en": "In this verse, Allah describes the disbelief of the disbelievers on the day of the Resurrection and how great their ridicule and mockery of the Prophet Muhammad was. They asked each other about a man who said that if they had died and were buried then their bodies and bones would have been destroyed, and then they would come back to take responsibility for their actions. The one who said it was Muhammad who declared that he had received a revelation from his Lord. They thought this was a great opportunity for them to influence public opinion and discredit the Prophet and say that he had gone mad or made a big lie to God by saying that the news was a revelation that was revealed to him. It is likely that most of the common people will be influenced by such ridicule and ridicule so that they will look down on the Prophet. Therefore, God emphasizes in this verse that those who do not believe in the hereafter will be tormented and will be in real error. They will be tormented both in the world and in the hereafter. In the world they will be straying in the middle of their journey, not knowing where to go, and always in doubt and doubt. People who have no faith and do not believe in the justice of God and in the hereafter will always be in a state of confusion. He has no hope for the justice of God because what he has seen and seen in this world is full of mischief and injustice. The weak are the victims of the strong. As believers who fully believe in the justice of God and the calculation of human deeds in the hereafter, they will be fully convinced that when they are persecuted, God will reward those who persecute them in return. If not in this world, then there will be retribution. Even in the hereafter God will reward you twice for his patience and patience. The belief in the existence of the Hereafter is a mercy to a servant of God.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan keingkaran orang-orang kafir terhadap terjadinya hari kebangkitan dan bagaimana hebatnya cemoohan dan olok-olok mereka terhadap Nabi Muhammad yang memberitakannya. Mereka saling bertanya tentang seorang laki-laki yang mengatakan bahwa apabila mereka telah mati dan dikuburkan kemudian tubuh dan tulang-belulang mereka telah hancur luluh, sesudah itu akan hidup kembali untuk mempertanggungjawabkan perbuatan mereka. Orang yang mengatakan hal itu adalah Muhammad yang mendakwahkan bahwa dia menerima wahyu dari Tuhannya. Mereka menganggap bahwa ini adalah suatu peluang besar bagi mereka untuk mempengaruhi pendapat umum dan mendiskreditkan Nabi serta mengatakan bahwa dia telah gila atau mengada-adakan suatu kebohongan besar terhadap Allah dengan mengatakan bahwa berita itu adalah wahyu yang diturunkan kepadanya. Mungkin kebanyakan orang awam akan terpengaruh oleh cemoohan dan olok-olok itu sehingga mereka memandang rendah dan hina terhadap Nabi. \n\nOleh sebab itu, Allah menegaskan dalam ayat ini bahwa orang-orang yang tidak percaya akan adanya hari akhirat akan mendapat siksaan dan berada dalam kesesatan yang nyata. Mereka akan mendapat siksaan baik di dunia maupun di akhirat. Di dunia mereka akan menjadi orang-orang yang sesat di tengah perjalanan hidupnya, tidak mengetahui arah yang akan dituju, serta selalu dalam kegelisahan dan keragu-raguan. Orang-orang yang tidak mempunyai akidah dan tidak percaya kepada keadilan Allah dan hari akhirat akan selalu terombang-ambing dalam kebingungan. Ia tidak mempunyai harapan untuk mendapat keadilan Allah karena apa yang ditemui dan dilihatnya di dunia ini penuh dengan kepincangan dan kezaliman. Orang yang lemah menjadi mangsa bagi yang kuat. Sedangkan orang-orang yang beriman yang percaya sepenuhnya akan keadilan Allah dan adanya perhitungan perbuatan manusia di akhirat nanti, tentu akan yakin sepenuhnya bahwa bila ia teraniaya, Allah akan membalas orang yang menganiayanya dengan balasan yang setimpal. Kalau tidak di dunia ini, di akhirat nanti pasti pembalasan itu akan terlaksana. Bahkan di akhirat nanti Allah akan memberi balasan yang berlipat ganda atas kesabaran dan ketawakalannya. Kepercayaan kepada adanya hari akhirat adalah suatu rahmat bagi seorang hamba Allah.",
      "text_translation": "Apakah dia mengada-adakan kebohongan terhadap Allah atau sakit gila?” (Tidak), tetapi orang-orang yang tidak beriman kepada akhirat itu berada dalam siksaan dan kesesatan yang jauh.",
      "text": "اَفْتَرٰى عَلَى اللّٰهِ كَذِبًا اَمْ بِهٖ جِنَّةٌ  ۗبَلِ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ فِى الْعَذَابِ وَالضَّلٰلِ الْبَعِيْدِ ",
      "text_translation_en": "Does he [knowingly] attribute his own lying inventions to God - or is he a madman?” Nay, [there is no madness in this Prophet -] but they who will not believe in the life to come are [bound to lose themselves] in suffering and in a profound aberration.",
      "juz_number": 22
    },
    "9": {
      "text_tafsir_en": "In this verse, Allah gives a warning to those who do not believe that the Day of Judgment will occur and tells them to pay attention to natural events which they witnessed themselves. How many natural disasters that occurred in several countries such as a devastating earthquake that destroyed buildings, causing loss of life and priceless property, a large flood that washed away homes, humans, animals and plants. According to scientific studies, because the sky is spherical, then wherever humans step on the earth, the sky will always be in front of and behind it, as well as above and below it. This part of the verse also shows that the shape of the earth is round. Clumps from the sky can be interpreted as fragments of celestial bodies (planets, stars, comets, etc.) after experiencing collision with each other. These fragments are known as asteroids, meteorites, and so on. Every day the surface of the earth is bombarded with broken rock bombs, which can cause damage to the earth and its inhabitants. Because Allah is All-Compassionate and Merciful, He protects the earth with a protective layer of air called the atmosphere. The air layer is like a brake that dampens the movement of these bombs with friction that occurs when it comes in contact with an asteroid or meteorite. It could even be destroyed immediately because an asteroid or meteorite was destroyed or burned down due to heat caused by friction with the Earth's atmosphere. Another protective shield is the ozone layer, the magnetic field of the earth which brakes the shards that are loaded. If the ozone layer is torn apart by air pollution, fragments of celestial bodies that will plunge into the earth, and could have hit humans or buried it into the surface of the earth. History records how God destroyed several previous peoples, and the remains of their legacy can still be seen today. Does all this not convince them that if God wills, He can sink their land into the ground, and can also send celestial bodies such as meteors or planets, to hit the earth, and thus there will be a catastrophe that cannot be imagined how terrible. Did they not learn from these natural events or from events written in history and the remnants they can still see for themselves? For people whose hearts are illuminated by the light of faith, these events add to their faith and make them believe that God is almighty, and that they will in essence return to God the Almighty and Most Reverent Heaven and earth Owner and Lord.",
      "text_tafsir": "Pada ayat ini, Allah memberikan peringatan kepada orang-orang yang tidak percaya akan terjadinya hari Kiamat dan menyuruh mereka memperhatikan kejadian-kejadian alam yang mereka saksikan sendiri. Betapa banyaknya bencana alam yang terjadi di beberapa negeri seperti gempa dahsyat yang menghancurkan bangunan, menimbulkan korban jiwa dan harta benda yang tak ternilai, banjir besar yang menghanyutkan rumah, manusia, binatang, dan tanaman.\n\nMenurut kajian ilmiah, karena langit berbentuk bola, maka di mana pun manusia menginjak bumi maka langit akan selalu berada di depan dan di belakangnya, serta di atas dan di bawahnya. Penggalan ayat ini juga menunjukkan bahwa bentuk bumi adalah bulat.\n\nGumpalan dari langit dapat ditafsirkan sebagai pecahan benda langit (planet, bintang, komet, dan lain-lain) setelah mengalami benturan satu sama lain. Pecahan-pecahan ini dikenal dengan nama asteroid, meteorit, dan lain sebagainya. Setiap hari permukaan bumi dihujani oleh bom-bom batuan pecahan, yang bisa mengakibatkan kerusakan bumi dan penghuninya. Karena Allah Maha Pengasih dan Penyayang, Ia melindungi bumi dengan pelindung berupa lapisan udara yang disebut atmosfer. Lapisan udara itu bagaikan rem yang meredam gerakan bom-bom ini dengan gesekan yang terjadi pada saat bersinggungan dengan asteroid atau meteorit. Bahkan bisa langsung memusnahkannya karena asteroid atau meteorit hancur atau terbakar habis akibat panas yang ditimbulkan oleh gesekan dengan atmosfer bumi.\n\nPerisai pelindung lain adalah lapisan ozon, medan magnit bumi yang mengerem pecahan-pecahan yang bermuatan. Jika lapisan ozon ini terkoyak karena pencemaran udara, pecahan benda langit itu akan jatuh menghunjam ke bumi, dan bisa saja menimpa manusia atau membenamkannya ke permukaan bumi.\n\nSejarah mencatat bagaimana Allah menghancurkan beberapa umat terdahulu, dan sisa peninggalan mereka masih dapat dilihat sampai sekarang. Apakah semua ini tidak menginsafkan mereka bahwa bila Allah menghendaki, Ia dapat membenamkan negeri mereka ke dalam tanah, dan dapat pula mengirimkan benda langit seperti meteor atau planet, untuk membentur bumi, dan dengan demikian terjadilah malapetaka yang tidak dapat dibayangkan bagaimana dahsyatnya. Tidakkah mereka mengambil pelajaran dari kejadian-kejadian alam itu atau dari kejadian yang tertulis dalam sejarah dan sisa-sisa peninggalan yang masih dapat mereka saksikan sendiri? Bagi orang yang hatinya disinari cahaya iman, berbagai kejadian itu menambah keimanan mereka dan menjadikan mereka meyakini bahwa Allah Mahakuasa, dan bahwa mereka pada hakikatnya akan kembali kepada Allah Pemilik dan Penguasa langit dan bumi Yang Mahabijaksana dan Mahaadil.",
      "text_translation": "Maka apakah mereka tidak memperhatikan langit dan bumi yang ada di hadapan dan di belakang mereka? Jika Kami menghendaki, niscaya Kami benamkan mereka di bumi atau Kami jatuhkan kepada mereka kepingan-kepingan dari langit. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah) bagi setiap hamba yang kembali (kepada-Nya).",
      "text": "اَفَلَمْ يَرَوْا اِلٰى مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْ مِّنَ السَّمَاۤءِ وَالْاَرْضِۗ اِنْ نَّشَأْ نَخْسِفْ بِهِمُ الْاَرْضَ اَوْ نُسْقِطْ عَلَيْهِمْ كِسَفًا مِّنَ السَّمَاۤءِۗ اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لِّكُلِّ عَبْدٍ مُّنِيْبٍ ࣖ ",
      "text_translation_en": "Are they, then, not aware of how little of the sky and the earth lies open before them, and how much is hidden from them? [or that,] if We so willed, We could cause the earth to swallow them, or cause fragments of the sky to fall down upon them? In all this, behold, there is a message indeed for every servant [of God] who is wont to turn unto Him [in repentance].",
      "juz_number": 22
    },
    "10": {
      "text_tafsir_en": "Among the gifts God gave to David was his beautiful voice. It is reported that David was a composer or composer of religious songs. As David praises his beautiful voice, especially as the songs reflect the greatness, glory, and majesty of God, his environment reverberates as if his rhythm. We do not know how his surroundings glorified and sang with David as God commanded him. It is impossible for man to know it in his word: The seven heavens, the earth, and all things therein, are to Allah. And there is nothing but praise in His praise, but you do not understand them. Truly, He is Oft-Forgiving, Most Forgiving. (al-Isra '\/ 17: 44) Concerning the beauty and sophistication of David's voice in a authentic hadith: From' Aisha, he says: The Messenger of Allah (may peace be upon him) heard the recitation of Abu Musa. al-Ash'ari, then he said, \"Truly this man was blessed of God with a beautiful voice like the house of David.\" (Nasa'i history) Another favor God gave to David was that he could make hard iron as soft as wax so that it could be made into tools, especially warfare. By the miraculous gift of God, David did it without being as hot as fire.",
      "text_tafsir": "Di antara karunia Allah yang dianugerahkan kepada Nabi Daud ialah suaranya yang sangat merdu. Diriwayatkan bahwa Nabi Daud adalah seorang komponis atau pencipta nyanyian yang bersifat keagamaan. Ketika Daud bertasbih memuja dengan suaranya yang merdu, apalagi lagu-lagu itu menggambarkan pula kebesaran, kemuliaan, dan keagungan Tuhan, maka alam sekitarnya bergema seakan-akan turut bertasbih mengikuti irama suaranya. Kita tidak mengetahui bagaimana alam sekitarnya bertasbih dan bernyanyi bersama Daud sebagaimana diperintahkan Allah kepadanya. Hal itu memang tidak dapat diketahui oleh manusia sebagai tersebut dalam firman-Nya:\n\nLangit yang tujuh, bumi dan semua yang ada di dalamnya bertasbih kepada Allah. Dan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. Sungguh, Dia Maha Penyantun, Maha Pengampun. (al-Isra'\/17: 44) \n\nMengenai keindahan dan kemerduan suara Daud diriwayatkan dalam sebuah hadis sahih:\n\nDari 'aisyah, dia berkata: Rasulullah saw mendengar bacaan Abu Musa. al-Asy'ari, kemudian beliau berkata, \"Sesungguhnya orang ini telah dikaruniai Allah suara merdu seperti keluarga Daud.\" (Riwayat an-Nasa'i)\n\nNikmat lain yang dikaruniakan Allah kepada Daud ialah dia dapat menjadikan besi yang keras menjadi lunak seperti lilin sehingga dapat dibentuk menjadi alat-alat, terutama alat peperangan. Dengan mukjizat yang dikaruniakan Allah, Daud melakukannya tanpa dipanaskan dengan api sebagaimana yang bisa dilakukan orang.",
      "text_translation": "Dan sungguh, Telah Kami berikan kepada Dawud karunia dari Kami. (Kami berfirman), “Wahai gunung-gunung dan burung-burung! Bertasbihlah berulang-ulang bersama Dawud,” dan Kami telah melunakkan besi untuknya,",
      "text": "۞ وَلَقَدْ اٰتَيْنَا دَاوٗدَ مِنَّا فَضْلًاۗ يٰجِبَالُ اَوِّبِيْ مَعَهٗ وَالطَّيْرَ ۚوَاَلَنَّا لَهُ الْحَدِيْدَۙ ",
      "text_translation_en": "AND [thus], indeed, did We grace David with Our favour: “O you mountains! Sing with him the praise of God! And [likewise] you birds!” And We softened all sharpness in him,",
      "juz_number": 22
    },
    "11": {
      "text_tafsir_en": "Then God ordered the Prophet David to make special armor out of soft iron instead of the clothes known at that time. Usually armor at that time was made from thin pieces of iron arranged like clothes, but the armor was very disturbing to the wearer besides causing heat to the body and restricting motion. However, the armor that David made, because the iron had become soft, was far different from ordinary armor. The armor was made like neatly arranged chain spools so that the armor followed bodybuilding. Thus, the wearer can move freely without feeling any disturbance. With the soft armor, David could make new weapons to defend his kingdom from enemy attacks. Then to give thanks for the gift he gave, God also ordered that David and his people always do good deeds and use all the blessings that God gave him to achieve his pleasure. He always sees and knows what His servants are doing.",
      "text_tafsir": "Lalu Allah memerintahkan kepada Nabi Daud supaya membuat baju besi istimewa dari bahan besi yang lunak bukan seperti baju yang dikenal pada masa itu. Biasanya baju besi pada masa itu dibuat dari kepingan-kepingan besi yang tipis disusun seperti baju, tetapi baju besi itu sangat mengganggu pemakainya selain menimbulkan panas pada badan dan membatasi gerak. Tetapi, baju besi yang dibuat Daud, karena besinya telah menjadi lunak, jauh berbeda dengan baju besi biasa. Baju besi itu dibuat seperti gulungan-gulungan rantai yang disusun rapi sehingga baju besi itu mengikuti gerak badan. Dengan demikian, pemakainya dapat bergerak dengan bebas tanpa merasakan gangguan apa pun. Dengan baju besi yang lunak itu, Daud dapat membuat alat senjata yang baru untuk mempertahankan kerajaannya dari serangan musuh.\n\nKemudian untuk mensyukuri karunia yang diberikan-Nya, Allah memerintahkan pula supaya Daud dan kaumnya selalu mengerjakan amal saleh dan mempergunakan segala nikmat yang dikaruniakan Allah itu untuk mencapai keridaan-Nya. Dia selalu melihat dan mengetahui apa yang dikerjakan oleh hamba-Nya.",
      "text_translation": "yaitu) buatlah baju besi yang besar-besar dan ukurlah anyamannya; dan kerjakanlah kebajikan. Sungguh, Aku Maha Melihat apa yang kamu kerjakan.",
      "text": "اَنِ اعْمَلْ سٰبِغٰتٍ وَّقَدِّرْ فِى السَّرْدِ وَاعْمَلُوْا صَالِحًاۗ اِنِّيْ بِمَا تَعْمَلُوْنَ بَصِيْرٌ ",
      "text_translation_en": "[and inspired him thus:] “Do good deeds lavishly, without stint, and give deep thought to their steady flow.” And [thus should you all, O believers,] do righteous deeds: for, verily, I see all that you do!",
      "juz_number": 22
    },
    "12": {
      "text_tafsir_en": "In this verse it is explained that God caused the wind to come to Solomon so that he could bring it to the place he wanted very quickly. In just half a day the wind can carry it to a distance of one month's journey, whether it be in the morning to midday or during the day from noon to sunset. The Qatadah in interpreting this verse states, \"The wind can take Solomon from morning till sunset for a month and from sunset to sunset for a month. , from Damascus to Isthakhr and then down there for lunch, and then he left for Kabul again to spend the night there. Whereas the distance between Damascus and Isthakhr is one month's travel time and the distance between Isthakhr and Kabul is one month's journey. The other gift that God gave Solomon was to soften the bronze like a candle so that it could easily be shaped by the desire of those who cultivated it. This is the same as the gift given to David that is to cast iron. Among the gifts was the subjection of the genie to work to do whatever Solomon wanted. Jin-jin was always obedient and obedient to his command, because they were threatened by God with a painful punishment if they did not obey Solomon's commands.",
      "text_tafsir": "Pada ayat ini diterangkan bahwa Allah menundukkan angin untuk Nabi Sulaiman sehingga dapat membawanya ke tempat-tempat yang diingininya dengan cepat sekali. Dalam waktu setengah hari saja angin dapat membawanya ke tempat yang jaraknya sebulan perjalanan, baik perjalanan itu pada waktu pagi sampai zuhur maupun pada waktu siang mulai dari zuhur sampai terbenamnya matahari.\n\nQatadah dalam menafsirkan ayat ini menyatakan, \"Angin dapat membawa Sulaiman dari pagi sampai tergelincirnya matahari sejauh sebulan perjalanan dan dari tergelincirnya matahari sampai terbenamnya sejauh sebulan perjalanan pula. Dalam hal ini, al-hasan al-Bashri berkata, \"Sulaiman pernah berangkat dengan mengendarai angin, dari Damaskus ke Isthakhr lalu dia turun di sana untuk makan siang, kemudian dia berangkat lagi ke Kabul untuk bermalam di sana. Padahal jarak antara Damaskus dan Isthakhr adalah sebulan perjalanan bagi orang yang berjalan cepat dan jarak antara Isthakhr dan Kabul adalah sebulan perjalanan pula. \n\nKarunia lainnya yang diberikan Allah kepada Sulaiman ialah melunakkan tembaga seperti lilin sehingga mudah dibentuk menurut keinginan orang yang mengolahnya. Hal ini sama dengan karunia yang diberikan kepada Nabi Daud yaitu melunakkan besi. \n\nDi antara karunia itu pula ialah menundukkan jin untuk bekerja membuat apa saja yang diingini Sulaiman. Jin-jin itu selalu taat dan patuh mengikuti perintahnya, karena mereka diancam oleh Allah dengan azab yang pedih apabila tidak memenuhi perintah Sulaiman.",
      "text_translation": "Dan Kami (tundukkan) angin bagi Sulaiman, yang perjalanannya pada waktu pagi sama dengan perjalanan sebulan dan perjalanannya pada waktu sore sama dengan perjalanan sebulan (pula) dan Kami alirkan cairan tembaga baginya. Dan sebagian dari jin ada yang bekerja di hadapannya (di bawah kekuasaannya) dengan izin Tuhannya. Dan siapa yang menyimpang di antara mereka dari perintah Kami, Kami rasakan kepadanya azab neraka yang apinya menyala-nyala.",
      "text": "وَلِسُلَيْمٰنَ الرِّيْحَ غُدُوُّهَا شَهْرٌ وَّرَوَاحُهَا شَهْرٌۚ وَاَسَلْنَا لَهٗ عَيْنَ الْقِطْرِۗ وَمِنَ الْجِنِّ مَنْ يَّعْمَلُ بَيْنَ يَدَيْهِ بِاِذْنِ رَبِّهٖۗ وَمَنْ يَّزِغْ مِنْهُمْ عَنْ اَمْرِنَا نُذِقْهُ مِنْ عَذَابِ السَّعِيْرِ ",
      "text_translation_en": "AND UNTO Solomon [We made subservient] the wind: its morning course [covered the distance of] a month’s journey, and its evening course, a month’s journey. And We caused a fountain of molten copper to flow at his behest; and [even] among the invisible beings there were some that had [been constrained] to labour for him by his Sustainer’s leave and whichever of them deviated from Our command, him would We let taste suffering through a blazing flame -:",
      "juz_number": 22
    },
    "13": {
      "text_tafsir_en": "Therefore, they did their utmost to do what Solomon commanded, such as building places of worship, magnificent statues made of wood, bronze, glass, and paving stones, as well as large masses of cooking food sufficient for dozens of people. Because of its size and size, the jars look like pools of water. They also made for Solomon a large pot that could not be lifted and moved. Because the jinn had tremendous power, they could easily do all that Solomon wanted, such as building a magnificent palace, and digging ditches for irrigation so that the kingdom of Solomon became famous as a great and prosperous kingdom, not one kingdom at a time. that can match it. This is as a realization of the prayer that God answers in his word. He said, \"My Lord, forgive me and grant me a kingdom that no one else has after me. Surely You are the Giver.\" Then We subjected him to a breeze blowing in accordance with his command wherever he wished, and (We subjected him) demons, all builders and divers. (shad \/ 38: 35-37) Then God commanded Solomon as David's family to be grateful for the favor God had bestowed on him. Thanking God is not just a saying, but it should be accompanied by righteousness and using it for what He pleases. At-Tirmidzi reported that the Prophet Muhammad climbed to the pulpit and read this verse. Then he said, \"There are three qualities when a person possesses that he is given as much as the gift given to the family of David.\" We asked him, \"What are those qualities?\" The Messenger of Allah (may peace be upon him) replied: \"First: Be fair, whether in anger or in pleasure. Second: Always live modestly whether you are poor or rich. Third: Always fear God either alone or in public. So that Solomon was grateful for the favor he had received by explaining that very few of his servants were truly grateful to him. How could a servant be thankful to his Lord in the way of the Prophet's gratitude to Allah? at night until the soles of his feet were swollen, so I ('A'isha) said to him, \"Why are you doing this when God has forgiven you your sins and your future sins?\" The Messenger of Allah (may peace be upon him) said: grateful? \"(Muslim history)",
      "text_tafsir": "Oleh sebab itu, mereka dengan giat sekali melaksanakan apa yang diperintahkan Sulaiman, seperti membangun tempat-tempat beribadah, arca-arca yang indah yang terbuat dari kayu, tembaga, kaca, dan batu pualam, serta belanga-belanga besar untuk memasak makanan yang cukup untuk berpuluh-puluh orang. Karena besar dan luasnya, bejana-bejana itu kelihatan seperti kolam-kolam air. Mereka juga membuatkan untuk Sulaiman periuk yang besar pula yang karena besarnya tidak dapat diangkat dan dipindahkan. Karena jin mempunyai kekuatan yang dahsyat, dengan mudah mereka membuat semua yang dikehendaki Sulaiman seperti membangun istana yang megah dan mewah, serta menggali selokan-selokan untuk irigasi sehingga kerajaan Sulaiman menjadi masyhur sebagai suatu kerajaan besar dan paling makmur, tidak ada suatu kerajaan pun di waktu itu yang dapat menandinginya. Hal ini ialah sebagai realisasi dari doanya yang dikabulkan Tuhan seperti tersebut dalam firman-Nya.\n\nDia berkata, \"Ya Tuhanku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak dimiliki oleh siapa pun setelahku. Sungguh, Engkaulah Yang Maha Pemberi.\" Kemudian Kami tundukkan kepadanya angin yang berhembus dengan baik menurut perintahnya ke mana saja yang dikehendakinya, dan (Kami tundukkan pula kepadanya) setan-setan, semuanya ahli bangunan dan penyelam. (shad\/38: 35-37)\n\nKemudian Allah memerintahkan kepada Sulaiman sebagai keluarga Daud supaya bersyukur atas nikmat yang dilimpahkan Allah kepadanya. Mensyukuri nikmat Allah itu bukanlah sekadar mengucapkan, tetapi harus diiringi dengan amal saleh dan mempergunakan nikmat itu untuk hal-hal yang diridai-Nya.\n\nDiriwayatkan oleh at-Tirmidzi bahwa Nabi Muhammad naik ke atas mimbar lalu membaca ayat ini. Lalu beliau bersabda, \"Ada tiga sifat bila dipunyai oleh seseorang berarti dia telah diberi karunia seperti karunia yang diberikan kepada keluarga Daud.\" Kami bertanya kepada beliau, \"Sifat-sifat apakah itu?\" Rasulullah menjawab, \"Pertama: Berlaku adil, baik dalam keadaan marah maupun dalam keadaan senang. Kedua: Selalu hidup sederhana baik di waktu miskin maupun kaya. Ketiga: Selalu takut kepada Allah baik di waktu sendirian maupun di hadapan orang banyak. \n\nAllah mengiringi perintah-Nya supaya Sulaiman bersyukur atas nikmat yang diterimanya dengan menjelaskan bahwa sedikit sekali di antara hamba-hamba-Nya yang benar-benar bersyukur kepada-Nya. Bagaimana seorang hamba bersyukur kepada Tuhannya dapat dilihat dari cara bersyukur Nabi saw kepada Allah. \n\nDari 'aisyah bahwa Rasulullah salat di malam hari sampai kedua telapak kakinya bengkak, maka aku ('Aisyah), berkata kepadanya, \"Mengapa engkau berbuat seperti ini padahal Allah telah mengampuni dosamu yang sekarang dan dosamu yang akan datang?\" Rasulullah menjawab, \"Bukankah aku ini seorang hamba yang bersyukur?\" (Riwayat Muslim)",
      "text_translation": "Mereka (para jin itu) bekerja untuk Sulaiman sesuai dengan apa yang dikehendakinya di antaranya (membuat) gedung-gedung yang tinggi, patung-patung, piring-piring yang (besarnya) seperti kolam dan periuk-periuk yang tetap (berada di atas tungku). Bekerjalah wahai keluarga Dawud untuk bersyukur (kepada Allah). Dan sedikit sekali dari hamba-hamba-Ku yang bersyukur.",
      "text": "يَعْمَلُوْنَ لَهٗ مَا يَشَاۤءُ مِنْ مَّحَارِيْبَ وَتَمَاثِيْلَ وَجِفَانٍ كَالْجَوَابِ وَقُدُوْرٍ رّٰسِيٰتٍۗ اِعْمَلُوْٓا اٰلَ دَاوٗدَ شُكْرًا ۗوَقَلِيْلٌ مِّنْ عِبَادِيَ الشَّكُوْرُ ",
      "text_translation_en": "they made for him whatever he wished of sanctuaries, and statues, and basins as [large as] great watering - troughs, and cauldrons firmly anchored. [And We said:] “Labour, O David’s people, in gratitude [towards Me] and [remember that] few are the truly grateful [even] among My servants!”",
      "juz_number": 22
    },
    "14": {
      "text_tafsir_en": "This verse explains that when his death drew near, Solomon sat on his throne resting on his stick. At that time Solomon died and no one knew that he had died for either his bodyguard, the courtiers, or the jinn who had been working hard to carry out his orders. He fell down because his stick was eaten by the crevice, so he couldn't bear his weight. Only then did the people realize that Solomon was dead, so did the jinn-jin who kept working hard to carry out his orders. At that time they acknowledged their weakness, for they could not know that Solomon had died. If they had known that Solomon had died, they would not have worked hard, for they were commanded by God only to obey Solomon, not to the nobles of his palace. God does not describe in this verse how long Solomon stays on his stick until he falls. Some disbelievers say that Solomon had a stick on his stick until he died for a year. They say that David had begun building Jerusalem but could not finish it. As he neared his end, he watched Prophet Solomon finish the construction. Solomon ordered the subordinate spirits under his authority to finish the building. When Solomon felt his end was near, he wanted to hide his death to the hard-working jinn who completed his work. Then Solomon would lie on his stick so that when he died, people would think he was alive because he was still sitting on his stick. At last the stick was eaten and it was broken. At that time, it was only known that Solomon had died. They wanted to know how long Solomon had been on the stick after he died, taking the rest. After calculating, it turned out that the creepy one-day meal only consumed a small portion of the stick, so it would take a year to break down. Some interpreters believe that Solomon had a stick on his stick until he died. Indeed, the stick had been eaten for many years without Solomon's knowledge. By the time Solomon reached the top of the scepter when his death occurred, it was too old. It is impossible for a king to be left alone by his family and bodyguard without eating and drinking, without asking him the important things he should ask. What is the truth between these two opinions is unknown. In the stories of the prophets there are many things that are beyond the reach of the human mind because they are miraculously given by God. If Solomon had only been around for a while and had collapsed, the jinn would not have regretted it as they had worked hard to complete the Jerusalem Temple.",
      "text_tafsir": "Ayat ini menerangkan bahwa ketika ajalnya telah dekat, Nabi Sulaiman duduk di atas singgasananya bertelekan pada tongkatnya. Pada waktu itulah Sulaiman meninggal dunia dan tidak seorang pun yang tahu bahwa dia sudah meninggal baik para pengawalnya, penghuni istana, maupun jin-jin yang selalu bekerja keras melaksanakan perintahnya. Dia jatuh tersungkur karena tongkatnya dimakan rayap, sehingga tidak dapat menahan berat tubuhnya. Ketika itu, barulah orang sadar bahwa Sulaiman sudah meninggal, demikian pula jin-jin yang tetap bekerja keras melaksanakan perintahnya. Pada waktu itulah mereka mengakui kelemahan diri mereka, karena tidak dapat mengetahui bahwa Sulaiman telah meninggal. Kalau mereka tahu bahwa Sulaiman telah meninggal, tentulah mereka tidak akan tetap bekerja keras, karena mereka hanya diperintahkan Allah patuh kepada Nabi Sulaiman saja, tidak kepada pembesar-pembesar di istananya. Allah tidak menerangkan dalam ayat ini berapa lama Sulaiman bertelekan di atas tongkatnya sampai ia jatuh tersungkur.\n\nSebagian mufasir mengatakan bahwa Nabi Sulaiman bertelekan pada tongkatnya sampai ia mati selama satu tahun. Mereka mengatakan bahwa Nabi Daud telah mulai membangun Baitul Makdis tetapi tidak dapat menyelesaikan pembangunannya. Ketika sudah dekat ajalnya, ia berwasiat kepada Nabi Sulaiman agar menyelesaikan pembangunannya. Nabi Sulaiman memerintahkan jin yang tunduk di bawah kekuasaannya supaya menyelesaikan bangunan itu. Tatkala Sulaiman merasa ajalnya sudah dekat, dia ingin menyembunyikan kematiannya kepada jin-jin yang bekerja keras menyelesaikan pekerjaannya. Lalu Nabi Sulaiman bertelekan di atas tongkatnya agar kalau ia mati, orang akan menyangka ia masih hidup karena masih duduk bertelekan di atas tongkatnya. Akhirnya tongkatnya itu dimakan rayap dan patah. Pada waktu itu, barulah diketahui bahwa Nabi Sulaiman telah meninggal. \n\nMereka ingin mengetahui berapa lama Sulaiman bertelekan pada tongkat itu setelah ia meninggal, dengan mengambil sisanya. Setelah mereka perhitungkan, ternyata rayap itu dalam sehari semalam hanya memakan sebagian kecil saja dari tongkat itu, sehingga dibutuhkan waktu satu tahun untuk dapat merusaknya.\n\nSebagian ahli tafsir berpendapat bahwa Sulaiman bertelekan pada tongkatnya sampai ia meninggal. Memang tongkat itu telah lama dimakan rayap tanpa diketahui oleh Sulaiman. Pada waktu Sulaiman bertelekan di atas tongkat ketika ajalnya tiba, tongkat itu sudah lapuk juga. Tidak mungkin seorang raja akan dibiarkan saja oleh keluarga dan pengawalnya tanpa makan dan minum, tanpa menanyakan kepadanya hal-hal penting yang harus dimintakan pendapatnya.\n\nMana yang benar di antara kedua pendapat ini tidak dapat kita ketahui. Dalam kisah-kisah para nabi banyak sekali terjadi hal-hal yang tidak dapat dijangkau oleh pikiran manusia karena mereka diberi mukjizat oleh Allah. Kalau Nabi Sulaiman bertelekan hanya sebentar saja lalu roboh tersungkur, tentu para jin tidak akan menyesal demikian hebatnya karena mereka telah telanjur bekerja menyelesaikan Baitul Makdis.",
      "text_translation": "Maka ketika Kami telah menetapkan kematian atasnya (Sulaiman), tidak ada yang menunjukkan kepada mereka kematiannya itu kecuali rayap yang memakan tongkatnya. Maka ketika dia telah tersungkur, tahulah jin itu bahwa sekiranya mereka mengetahui yang gaib tentu mereka tidak tetap dalam siksa yang menghinakan.",
      "text": "فَلَمَّا قَضَيْنَا عَلَيْهِ الْمَوْتَ مَا دَلَّهُمْ عَلٰى مَوْتِهٖٓ اِلَّا دَاۤبَّةُ الْاَرْضِ تَأْكُلُ مِنْسَاَتَهٗ ۚفَلَمَّا خَرَّ تَبَيَّنَتِ الْجِنُّ اَنْ لَّوْ كَانُوْا يَعْلَمُوْنَ الْغَيْبَ مَا لَبِثُوْا فِى الْعَذَابِ الْمُهِيْنِۗ ",
      "text_translation_en": "Yet [even Solomon had to die; but] when We decreed that he should die, nothing showed them that he was dead except an earthworm that gnawed away his staff. And when he fell to the ground, those invisible beings [subservient to him] saw clearly that, had they but understood the reality which was be­yond the reach of their perception, they would not have continued [to toil] in the shameful suffering [of servitude]",
      "juz_number": 22
    },
    "15": {
      "text_tafsir_en": "In the south of the country Yemen resides a people called Saba '. They occupy a very fertile area so that they live prosperously and have achieved high culture. They can control the heavy rain in a particular season by building a giant dam that can store water for the dry season. The dam is arguably a natural dam because it is located between two hills and at the end of it is erected a tall building to prevent water flowing in vain into the desert. They make water gates that when opened can drain water to the area they want. This dam is famous for the Ma'rib Dam or the al-'Arim Dam. Many historians and researchers in the west doubted the existence of the Ma'rib Dam. Finally, a researcher from France came alone to the south of Yemen to investigate the remains of the dam in 1843. He could prove the existence of the dam by finding traces of it, then taking photographs and sending the pictures to a magazine in France. Other researchers also found some slate between the ruins of the dam. As such, they became increasingly convinced that a long time ago in the south of Yemen there had stood a kingdom that was advanced, prosperous, and highly cultured. In this verse, Allah explains a little about the Saba'ites who inhabit the area south of Yemen. They occupy a wide and fertile valley thanks to regular irrigation from the Ma'rib Dam. On the left and right of their area lay vast, fertile gardens that produce abundant food and fruit. The Saba 'initially worshiped the sun, but after the leadership of the kingdom was held by Queen Balqis, they became a people of faith by following the teachings brought by Solomon. This is told in the Qur'an as follows: Then not long after (came Hud-hud), then he said, \"I have known something that you do not yet know. I came to you from the land of Saba 'with a convincing message. Indeed, I found that there was a woman who ruled over them, and she was blessed with everything and had a great throne, I (Hud's bird) found her and her people worshiping the sun, not to God, and Satan had made them feel good for (bad) deeds ) they, thus blocking them from the path (of Allah), then they did not get a clue. (an-Naml \/ 27: 22-24) However, over time the Sabaites became arrogant and forgot that the prosperity they had was a gift from the One Almighty and Most Gracious, Allah interceded by His Apostles to give thanks to them for all the blessings and gifts bestowed upon them. Allah, the Forgiving, protects them from all kinds of dangers and calamities.",
      "text_tafsir": "Di sebelah selatan negeri Yaman berdiam suatu kaum bernama Saba'. Mereka menempati suatu daerah yang amat subur sehingga mereka hidup makmur dan telah mencapai kebudayaan yang tinggi. Mereka dapat menguasai air hujan yang turun lebat pada musim tertentu dengan membangun sebuah bendungan raksasa yang dapat menyimpan air untuk musim kemarau. Bendungan itu boleh dikatakan bendungan alami karena terletak di antara dua buah bukit dan di ujungnya didirikan bangunan yang tinggi untuk mencegah air mengalir sia-sia ke padang pasir. Mereka membuat pintu-pintu air yang bila dibuka dapat mengalirkan air ke daerah yang mereka kehendaki. Bendungan ini terkenal dengan Bendungan Ma'rib atau Bendungan al-'Arim. \n\nBanyak di antara ahli sejarah dan peneliti di barat meragukan tentang adanya Bendungan Ma'rib ini. Akhirnya seorang peneliti dari Perancis datang sendiri ke selatan Yaman untuk menyelidiki sisa-sisa bendungan itu pada tahun 1843. Dia dapat membuktikan adanya bendungan itu dengan menemukan bekas-bekasnya, lalu memotret dan mengirimkan gambar-gambarnya ke suatu majalah di Perancis. Para peneliti lainnya menemukan pula beberapa batu tulis di antara reruntuhan bendungan itu. Dengan demikian, mereka bertambah yakin bahwa dahulu kala di sebelah selatan Yaman telah berdiri sebuah kerajaan yang maju, makmur, dan tinggi kebudayaannya. \n\nPada ayat ini, Allah menerangkan sekelumit tentang kaum Saba' yang mendiami daerah sebelah selatan Yaman itu. Mereka menempati sebuah lembah yang luas dan subur berkat pengairan yang teratur dari Bendungan Ma'rib. Di kiri dan kanan daerah mereka terbentang kebun-kebun yang amat luas dan subur yang menghasilkan bahan makanan dan buah-buahan yang melimpah ruah. \n\nKaum Saba' pada mulanya menyembah matahari, namun setelah pimpinan kerajaan dipegang Ratu Balqis, mereka menjadi kaum yang beriman dengan mengikuti ajaran yang dibawa Nabi Sulaiman. Hal ini diceritakan dalam Al-Qur'an sebagai berikut:\n\nMaka tidak lama kemudian (datanglah Hud-hud), lalu ia berkata, \"Aku telah mengetahui sesuatu yang belum engkau ketahui. Aku datang kepadamu dari negeri Saba' membawa suatu berita yang meyakinkan. Sungguh, kudapati ada seorang perempuan yang memerintah mereka, dan dia dianugerahi segala sesuatu serta memiliki singgasana yang besar. Aku (burung Hud) dapati dia dan kaumnya menyembah matahari, bukan kepada Allah; dan setan telah menjadikan terasa indah bagi mereka perbuatan-perbuatan (buruk) mereka, sehingga menghalangi mereka dari jalan (Allah), maka mereka tidak mendapat petunjuk. (an-Naml\/27: 22-24)\n\nTetapi, lama-kelamaan kaum Saba' menjadi sombong dan lupa bahwa kemakmuran yang mereka miliki adalah anugerah dari Yang Mahakuasa dan Maha Pemurah. Allah dengan perantaraan rasul-Nya memerintahkan agar mereka mensyukuri-Nya atas segala nikmat dan karunia yang dilimpahkan kepada mereka. Negeri mereka menjadi subur dan makmur berkat karunia Allah Yang Maha Pengampun, melindungi mereka dari segala macam bahaya dan malapetaka.",
      "text_translation": "Sungguh, bagi kaum Saba’ ada tanda (kebesaran Tuhan) di tempat kediaman mereka yaitu dua buah kebun di sebelah kanan dan di sebelah kiri, (kepada mereka dikatakan), “Makanlah olehmu dari rezeki yang (dianugerahkan) Tuhanmu dan bersyukurlah kepada-Nya. (Negerimu) adalah negeri yang baik (nyaman) sedang (Tuhanmu) adalah Tuhan Yang Maha Pengampun.”",
      "text": "لَقَدْ كَانَ لِسَبَاٍ فِيْ مَسْكَنِهِمْ اٰيَةٌ  ۚجَنَّتٰنِ عَنْ يَّمِيْنٍ وَّشِمَالٍ ەۗ كُلُوْا مِنْ رِّزْقِ رَبِّكُمْ وَاشْكُرُوْا لَهٗ  ۗبَلْدَةٌ طَيِّبَةٌ وَّرَبٌّ غَفُوْرٌ",
      "text_translation_en": "INDEED, in [the luxuriant beauty of] their homeland, the people of Sheba had an evidence [of God’s grace] two [vast expanses of] gardens, to the right and to the left, [calling out to them, as it were:] “Eat of what your Sustainer has provided for you, and render thanks unto Him: a land most goodly, and a Sustainer much-forgiving!”",
      "juz_number": 22
    },
    "16": {
      "text_tafsir_en": "They reject and turn away from the call of God, even blocking those who are converted from faith in Him. Allah then inflicted torment upon them by breaking into the Ma'rib Dam and there was a great disaster. Their country was hit by heavy floods, and washed away all those who were blocking the current. The gardens on the left and right side of the country were destroyed, and all their livestock were washed away. Even human victims are innumerable, so that only a few people are still alive. Only a few small groups of them survived the terrible catastrophe. Even those who survived were unable to live happily in their original places. Some of them then migrated to other fertile places because there were no more gardens that they could plant properly and there were not many livestock animals that they would keep. Formerly fertile soils have become barren because all the water stored in the dam has spilled into the desert that can swallow any amount of water. What grows in their former gardens are only plants that are of little use, the fruit is bitter. If they want to grow crops, they only expect rainwater to fall from the sky.",
      "text_tafsir": "Mereka menolak dan berpaling dari seruan Allah, bahkan menghalangi orang-orang yang insaf beriman kepada-Nya. Allah lalu menimpakan siksaan kepada mereka dengan membobolkan Bendungan Ma'rib dan terjadilah malapetaka yang hebat. Negeri mereka dilanda banjir yang deras, dan menghanyutkan semua yang menghalangi arusnya. Kebun-kebun yang berada di kiri dan kanan negeri itu menjadi musnah, dan semua binatang ternak mereka hanyut. Korban manusia pun tidak terhitung banyaknya, sehingga hanya sedikit orang yang masih hidup. Hanya beberapa kelompok kecil dari mereka yang selamat dari malapetaka yang dahsyat itu. \n\nMereka yang selamat ini pun tidak dapat tinggal dengan senang di tempat mereka semula. Sebagian dari mereka lalu hijrah ke tempat lain yang subur karena tidak ada lagi kebun-kebun yang bisa mereka tanami dengan baik dan tidak banyak lagi binatang-binatang ternak yang akan mereka pelihara. Tanah-tanah yang dahulu subur telah menjadi tandus karena semua air yang tersimpan di dalam bendungan telah tumpah ke padang pasir yang dapat menelan air berapa pun banyaknya. Yang tumbuh di bekas kebun-kebun mereka hanya tumbuhan yang tidak banyak gunanya, buahnya pun pahit. Bila mereka ingin bercocok tanam yang mereka harapkan hanya air hujan yang turun dari langit saja.",
      "text_translation": "Tetapi mereka berpaling, maka Kami kirim kepada mereka banjir yang besar dan Kami ganti kedua kebun mereka dengan dua kebun yang ditumbuhi (pohon-pohon) yang berbuah pahit, pohon Atsl dan sedikit pohon Sidr.",
      "text": "فَاَعْرَضُوْا فَاَرْسَلْنَا عَلَيْهِمْ سَيْلَ الْعَرِمِ وَبَدَّلْنٰهُمْ بِجَنَّتَيْهِمْ جَنَّتَيْنِ ذَوَاتَيْ اُكُلٍ خَمْطٍ وَّاَثْلٍ وَّشَيْءٍ مِّنْ سِدْرٍ قَلِيْلٍ ",
      "text_translation_en": "But they turned away [from Us], and so We let loose upon them a flood that overwhelmed the dams, and changed their two [expanses of luxuriant] gardens into a couple of gardens yielding bitter fruit, and tamarisks, and some few [wild] lote-trees:",
      "juz_number": 22
    },
    "17": {
      "text_tafsir_en": "Thus the circumcision has taken place against the people of Saba 'as it did for the arrogant and ungodly people, refusing to accept the truth, and constantly rejecting and rejecting the teachings of God brought by His apostles. Thus Allah inflicts punishment and disasters upon the disbelievers who are disobedient and ungrateful in the favor bestowed upon them.",
      "text_tafsir": "Demikianlah sunatullah telah berlaku terhadap kaum Saba' sebagaimana yang berlaku bagi umat-umat yang sombong dan durhaka sebelumnya, tidak mau menerima kebenaran, serta selalu menolak dan membangkang terhadap ajaran Allah yang dibawa oleh para rasul-Nya. Demikianlah Allah menimpakan azab dan malapetaka kepada kaum kafir yang mengingkari dan tidak bersyukur atas nikmat yang dikaruniakan kepada mereka.",
      "text_translation": "Demikianlah Kami memberi balasan kepada mereka karena kekafiran mereka. Dan Kami tidak menjatuhkan azab (yang demikian itu), melainkan hanya kepada orang-orang yang sangat kafir.",
      "text": "ذٰلِكَ جَزَيْنٰهُمْ بِمَا كَفَرُوْاۗ وَهَلْ نُجٰزِيْٓ اِلَّا الْكَفُوْرَ ",
      "text_translation_en": "thus We requited them for their having denied the truth. But do We ever requite [thus] any but the utterly ingrate?",
      "juz_number": 22
    },
    "18": {
      "text_tafsir_en": "The Sabae 'who still lived in their country, despite the difficulties of life because their country had become hollow and barren, traveled to trade from one country to another, especially to rather large countries, such as Mecca and Sham in the north and Northwest. These countries at that time were among the prosperous countries which were the centers of trade. Traveling between countries is easy and safe because of the existence of villages where the travelers stop when the overnight and out of stock or feel tired. They can survive and can also plant crops in modest during the rainy season. They also raise livestock when there is still a lot of pasture. This is a blessing from Allah to them even though it is not as big as the favor He was bestowed when the Ma'rib Dam has not been destroyed and destroyed. God told them to make the best use of the favor and to carry the merchandise among the countries safely, even though the distance they traveled was sometimes very far. They can stop in the villages around the big cities if they feel tired. If they are late they can stop at the nearest village and so on.",
      "text_tafsir": "Kaum Saba' yang masih tinggal di negerinya, walaupun mengalami kesulitan hidup karena negeri mereka telah menjadi lekang dan tandus, mengadakan perjalanan untuk berdagang dari suatu negeri ke negeri yang lain, terutama ke negeri-negeri yang agak besar, seperti Mekah dan Syam di utara dan barat laut. Negeri-negeri tersebut pada waktu itu termasuk negeri yang makmur yang menjadi pusat perdagangan. Perjalanan di antara negeri-negeri itu mudah dan aman karena adanya kampung-kampung tempat singgah para musafir bila kemalaman dan kehabisan bekal atau merasa letih. \n\nMereka dapat bertahan hidup dan dapat pula bercocok tanam sekadarnya pada waktu musim hujan. Mereka juga memelihara binatang ternak ketika di sana masih banyak padang rumput. Ini adalah suatu nikmat dari Allah kepada mereka walaupun tidak sebesar nikmat yang dianugerahkan-Nya ketika Bendungan Ma'rib belum hancur dan musnah. Allah menyuruh mereka mempergunakan nikmat itu dengan sebaik-baiknya dan berjalan dengan membawa barang dagangan di antara negeri-negeri dengan aman, walaupun jarak yang ditempuh mereka kadang-kadang amat jauh. Mereka dapat singgah di kampung-kampung yang ada di sekitar kota-kota besar itu bila merasa lelah. Bila mereka kemalaman mereka dapat berhenti di kampung yang terdekat dan demikianlah seterusnya.",
      "text_translation": "Dan Kami jadikan antara mereka (penduduk Saba’) dan negeri-negeri yang Kami berkahi (Syam), beberapa negeri yang berdekatan dan Kami tetapkan antara negeri-negeri itu (jarak-jarak) perjalanan. Berjalanlah kamu di negeri-negeri itu pada malam dan siang hari dengan aman.",
      "text": "وَجَعَلْنَا بَيْنَهُمْ وَبَيْنَ الْقُرَى الَّتِيْ بٰرَكْنَا فِيْهَا قُرًى ظَاهِرَةً وَّقَدَّرْنَا فِيْهَا السَّيْرَۗ سِيْرُوْا فِيْهَا لَيَالِيَ وَاَيَّامًا اٰمِنِيْنَ ",
      "text_translation_en": "Now [before their downfall,] We had placed between them and the cities which We had blessed [many] towns within sight of one another; and thus We had made traveling easy [for them, as if to say]: “Travel safely in this [land], by night or by day!”",
      "juz_number": 22
    },
    "19": {
      "text_tafsir_en": "Therefore, they ask Allah that on the journey between one country and another there is no place to rest, so the journey must continue despite suffering all kinds of difficulties. This is how their characters and the arrogant people have come to their relief, but they want hardship and suffering. He did not change it like the Children of Israel had given them good food, Manna and Salwa, so they asked for ordinary food, as it is said in his Word: And (remember), when you say, \"O Moses! with only one kind of food, then ask your Lord for us, that He may give us what is grown on the earth, such as: vegetables, cucumbers, garlic, peas and red onions. \" He (Moses) said, \"Do you ask for a bad thing instead of a good one? Go to a city, and you will get what you ask for.\" Then they were plagued with poverty and poverty, and they (Allah) became angry with Allah. (al-Baqarah \/ 2: 61) In fact, at the request, the Saba people persecuted themselves and were not satisfied with the gift God bestowed on them. They have forgotten that God is destroying their fertile and prosperous land because they do not believe and are grateful for the grace of God. Therefore, God fulfills their demands by eliminating stops in their travels, making it difficult for them to trade, and their lives difficult. They had to migrate to other countries leaving their country and dispersing there. The Jafnah bin Amr's family had to live in Sham, Aus and Khazraj in Medinah, and Azad (Uman) lived in Oman. So are the other races. They will disappear as a people who were once highly regarded as a noble people of high civilization and culture. The only survivors are the stories that are told from mouth to mouth and their fame is merely an amusement, spoken of as they stay awake at night. Indeed, this experience of the people of Saba 'should be a lesson to all who are patient and know how grateful they are for all the favors they have received from Allah. Every servant should thank God for his favors and be patient with his trials. In fact, he should be grateful to God despite his trials. Sa'ad bin Abi Waqqash narrated that the Prophet said: I admire Allah's provision for a believer. When he did good he praised and thanked him. When tragedy struck, he praised and thanked Him. A believer is rewarded in all things even for the food he gives his wife. (Ahmad's History",
      "text_tafsir": "Oleh karena itu, mereka meminta kepada Allah supaya di sepanjang perjalanan antara suatu negeri dengan negeri lain tidak ada tempat singgah untuk beristirahat, sehingga perjalanan harus dilanjutkan walaupun akan menderita berbagai macam kesulitan. Beginilah watak mereka dan watak orang-orang sombong, sudah mendapat kemudahan, justru mereka menginginkan kesulitan dan penderitaan. Tidak ubahnya seperti Bani Israil yang telah diberi Allah makanan yang baik yaitu Manna dan Salwa, lalu mereka meminta makanan biasa, sebagaimana tersebut dalam firman-Nya:\n\nDan (ingatlah), ketika kamu berkata, \"Wahai Musa! Kami tidak tahan hanya (makan) dengan satu macam makanan saja, maka mohonkanlah kepada Tuhanmu untuk kami, agar Dia memberi kami apa yang ditumbuhkan bumi, seperti: sayur-mayur, mentimun, bawang putih, kacang adas dan bawang merah.\" Dia (Musa) menjawab, \"Apakah kamu meminta sesuatu yang buruk sebagai ganti dari sesuatu yang baik? Pergilah ke suatu kota, pasti kamu akan memperoleh apa yang kamu minta.\" Kemudian mereka ditimpa kenistaan dan kemiskinan, dan mereka (kembali) mendapat kemurkaan dari Allah. (al-Baqarah\/2: 61) \n\nSebenarnya dengan permintaan itu, kaum Saba' telah menganiaya diri sendiri dan tidak puas dengan karunia yang dianugerahkan Allah kepada mereka. Mereka telah lupa bahwa Allah menghancurkan negeri mereka yang subur dan makmur tiada lain karena mereka tidak mau beriman dan bersyukur atas karunia Allah. Oleh sebab itu, Allah memenuhi permintaan mereka dengan meniadakan tempat singgah dalam perjalanan mereka, sehingga mereka kesulitan melakukan perdagangan, dan kehidupan mereka menjadi susah.\n\nMereka harus hijrah ke negeri lain meninggalkan negeri mereka dan berpencar-pencar ke sana kemari. Kabilah Jafnah bin Amr terpaksa tinggal di negeri Syam, Aus dan Khazraj di Medinah, dan Azad (Uman) tinggal di Oman. Demikian pula kabilah-kabilah yang lain. Hilanglah wujud mereka sebagai suatu umat yang dahulunya sangat masyhur sebagai suatu umat yang mulia yang mempunyai peradaban dan kebudayaan yang tinggi. Yang tinggal hanya cerita-cerita yang diriwayatkan dari mulut ke mulut dan kemasyhuran mereka hanya menjadi bahan penghibur, dibicarakan pada waktu mereka berjaga di malam hari.\n\nSesungguhnya yang dialami kaum Saba' ini patut menjadi pelajaran bagi setiap orang yang sabar dan tahu bersyukur atas setiap nikmat yang diterimanya dari Allah. Setiap hamba harus bersyukur kepada Allah atas segala nikmat-Nya dan bersabar menerima cobaan-Nya. Bahkan ia harus bersyukur kepada Allah walaupun mendapat cobaan dari-Nya.\n\nDiriwayatkan oleh Sa'ad bin Abi Waqqash bahwa Rasulullah bersabda: \n\nAku mengagumi ketetapan Allah untuk seorang mukmin. Bila ia mendapat kebaikan ia memuji dan bersyukur kepada-Nya. Bila ia ditimpa musibah ia memuji dan bersyukur kepada-Nya. Orang mukmin mendapat pahala dalam segala hal walaupun hanya sesuap makanan yang ia berikan untuk istrinya. (Riwayat Ahmad)",
      "text_translation": "Maka mereka berkata, “Ya Tuhan kami, jauhkanlah jarak perjalanan kami,” dan (berarti mereka) menzalimi diri mereka sendiri; maka Kami jadikan mereka bahan pembicaraan dan Kami hancurkan mereka sehancur-hancurnya. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi setiap orang yang sabar dan bersyukur.",
      "text": "فَقَالُوْا رَبَّنَا بٰعِدْ بَيْنَ اَسْفَارِنَا وَظَلَمُوْٓا اَنْفُسَهُمْ فَجَعَلْنٰهُمْ اَحَادِيْثَ وَمَزَّقْنٰهُمْ كُلَّ مُمَزَّقٍۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ ",
      "text_translation_en": "But now they would say, “Long has our Sus­tainer made the distance between our journey- stages!” - for they had sinned against themselves. And in the end We caused them to become [one of those] tales [of things long past], and scattered them in countless fragments. Herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grate­ful [to God].",
      "juz_number": 22
    },
    "20": {
      "text_tafsir_en": "In this verse, God explains that Satan thinks the people of Saba 'who have been destroyed by God and their country have followed him and have faithfully carried out his deception. He thought they had disobeyed God and were not grateful for all the favors they were given, except for some who believed in their faith and did not accept the deception. Thus, Satan thought that he could conquer mankind and lead them into a path of error, as they were declared before God. It is said in His Word: (Satan), \"For Your glory I will surely mislead them all, except Your chosen servants among them.\" (shad \/ 38: 82-83)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Iblis menyangka kaum Saba' yang telah dibinasakan Allah beserta negeri mereka telah mengikutinya dan dengan penuh kepatuhan melaksanakan tipu dayanya. Ia menyangka mereka telah mendurhakai Allah dan tidak bersyukur atas segala nikmat yang dikaruniakan kepada mereka, kecuali sebagian orang yang beriman yang tetap imannya dan tidak menerima tipu daya itu. Dengan demikian, Iblis menyangka bahwa dia dapat menguasai manusia dan membawa mereka ke jalan kesesatan, sebagaimana diikrarkan di hadapan Allah. Hal ini tersebut dalam firman-Nya:\n\n(Iblis) menjawab, \"Demi kemuliaan-Mu, pasti aku akan menyesatkan mereka semuanya, kecuali hamba-hamba-Mu yang terpilih di antara mereka.\" (shad\/38: 82-83)",
      "text_translation": "Dan sungguh, Iblis telah dapat meyakinkan terhadap mereka kebenaran sangkaannya, lalu mereka mengikutinya, kecuali sebagian dari orang-orang mukmin.",
      "text": "وَلَقَدْ صَدَّقَ عَلَيْهِمْ اِبْلِيْسُ ظَنَّهٗ فَاتَّبَعُوْهُ اِلَّا فَرِيْقًا مِّنَ الْمُؤْمِنِيْنَ ",
      "text_translation_en": "Now, indeed, Iblis did prove that his opinion of them had been right: for [when he called them,] they followed him - all but some of the believers [among them].",
      "juz_number": 22
    },
    "21": {
      "text_tafsir_en": "God rejects and nullifies the false notion of Satan. God asserts that there is not the slightest power for the devil against man to deceive them, so that they are unfaithful to him. The deception of the devil is only a test of God to His servants, whether they are being deceived by the persuasion of the devil or whether they reject it altogether so as not to affect their faith and piety. Al-hasan al-Bashri argues that the devil has never hit a human with a stick and never forced them to do anything. The devil's actions are nothing but deception, persuasion and emptiness, and man receives it. The demonic force is just that, unchanged as the bacteria that invaded the human race during the outbreak of the disease. Whoever does not have the strength in his body to withstand the attack, he is the victim. However, the disease will not be able to control the person in his body who has strong elements of endurance. He will remain healthy despite the fact that many people have fallen ill or died because of it. If a person is caught in a trap of a demon then he should not regret others, who is wrong and weak in this regard. Therefore, every human being should stand firm in his faith with strong faith and always do good deeds. The Word of God: I have no power over you, but I only call upon you and you obey my voice, therefore do not despise me, but prove yourself. I cannot help you, and you cannot help me. Indeed, I did not allow your deeds to associate with me (with Allah) long ago. even to him as great a zarrah, He will judge the deeds of man justly and no one will be harmed in this, but He will reward good deeds with double rewards.",
      "text_tafsir": "Allah menolak dan membatalkan persangkaan Iblis yang tidak benar itu. Allah menegaskan bahwa tidak ada kekuasaan sedikit pun bagi setan terhadap manusia untuk menyesatkan mereka, sehingga mereka durhaka kepada-Nya. Tipu daya setan itu hanyalah sebagai ujian dari Allah terhadap hamba-hamba-Nya, apakah mereka mau teperdaya oleh bujukan setan ataukah mereka menolaknya sama sekali sehingga tidak mempengaruhi sedikit pun pada keimanan dan ketakwaan mereka.\n\nAl-hasan al-Bashri berpendapat bahwa setan itu tidak pernah memukul manusia dengan tongkat dan tidak pernah memaksa mereka untuk melakukan sesuatu. Tindakan setan hanya sekadar melakukan tipu daya, membujuk dengan angan-angan kosong, lalu manusia menerimanya. Tipu daya setan itu hanya seperti itu, tidak ubahnya seperti bakteri-bakteri yang menyerang manusia di musim tersebarnya wabah penyakit. Barang siapa tidak memiliki ketahanan yang kuat dalam tubuhnya untuk menahan serangan penyakit itu, ia menjadi korbannya. Tetapi, penyakit itu tidak akan dapat menguasai orang yang di dalam tubuhnya terdapat unsur-unsur ketahanan yang kuat. Ia akan tetap sehat walafiat meskipun telah banyak orang yang jatuh sakit atau meninggal karenanya. Bila ada orang yang terperosok masuk perangkap setan maka janganlah ia menyesali orang lain, yang salah dan lemah dalam hal ini adalah dirinya sendiri. Oleh sebab itu, setiap manusia harus membentengi dirinya dengan iman yang kuat dengan takwa dan selalu beramal saleh. \n\nFirman Allah:\n\nTidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri. Aku tidak dapat menolongmu, dan kamu pun tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.\" Sungguh, orang yang zalim akan mendapat siksaan yang pedih. (Ibrahim\/14: 22)\n\nAllah lalu menegaskan kepada Nabi Muhammad bahwa Dia mencatat segala perbuatan manusia, tidak ada yang tersembunyi bagi-Nya sebesar zarrah pun. Ia akan memperhitungkan perbuatan manusia dengan seadil-adilnya dan tidak ada seorang pun yang dirugikan dalam hal ini, bahkan Dia akan membalas perbuatan yang baik dengan pahala yang berlipat ganda.",
      "text_translation": "Dan tidak ada kekuasaan (Iblis) terhadap mereka, melainkan hanya agar Kami dapat membedakan siapa yang beriman kepada adanya akhirat dan siapa yang masih ragu-ragu tentang  (akhirat) itu. Dan Tuhanmu Maha Memelihara segala sesuatu.",
      "text": "وَمَا كَانَ لَهٗ عَلَيْهِمْ مِّنْ سُلْطَانٍ اِلَّا لِنَعْلَمَ مَنْ يُّؤْمِنُ بِالْاٰخِرَةِ مِمَّنْ هُوَ مِنْهَا فِيْ شَكٍّ ۗوَرَبُّكَ عَلٰى كُلِّ شَيْءٍ حَفِيْظٌ ࣖ ",
      "text_translation_en": "And yet, he had no power at all over them: [for if We allow him to tempt man,] it is only to the end that We might make a clear distinction between those who [truly] believe in the life to come and those who are in doubt thereof: for thy Sustainer watches over all things.",
      "juz_number": 22
    },
    "22": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad to challenge the Muslims of Mecca, if their idols and worshipers really have the least power, try to prove it by giving examples of what they have created or what they have. Whether the idols can help them or resist the dangers that threaten them. Of course they cannot provide such evidence, since it is unlikely that the dead thing they created with their own hands will be able to do something or help and resist their harm. Therefore, Allah asserts that the idols have no power whatsoever (not even the size of a zarrah) over the heavens, the earth, and all that is in them, and that they have no power to help them. How can they worship him if they use their senses. In another verse, God reaffirms this with His word: And those whom you call (worshipers) other than Allah have nothing but thin skin. (Fathir \/ 35: 13) They have nothing in themselves or in union with others and nothing in common with them in creating or possessing something. This is a fact we see in the world.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan Nabi Muhammad supaya menantang kaum musyrik Mekah, kalau berhala-berhala dan sembahan mereka benar-benar mempunyai kekuasaan walaupun sedikit, cobalah mereka buktikan hal itu dengan memberikan contoh tentang apa yang telah diciptakan atau yang mereka miliki. Apakah berhala itu dapat memberikan pertolongan kepada mereka atau menolak bahaya yang mengancam mereka. Tentu saja mereka tidak dapat memberikan bukti-bukti seperti itu, karena tidak mungkin benda mati yang mereka buat dengan tangan mereka sendiri akan dapat membuat sesuatu atau dapat menolong serta menolak kemudaratan dari mereka. \n\nOleh sebab itu, Allah menegaskan bahwa berhala-berhala itu tidak memiliki kekuasaan sedikit pun (walau sebesar zarrah sekalipun) terhadap langit, bumi, dan apa yang terdapat dalam keduanya, dan tidak ada kemampuan sama sekali untuk menolong mereka. Bagaimanakah mereka sampai menyembahnya kalau mereka mempergunakan akal pikiran mereka. Dalam ayat lain, Allah menegaskan pula hal ini dengan firman-Nya:\n\nDan orang-orang yang kamu seru (sembah) selain Allah tidak mempunyai apa-apa walaupun setipis kulit ari. (Fathir\/35: 13) \n\nMereka tidak memiliki apa pun secara sendiri atau secara berserikat dengan yang lain dan tidak ada suatu apa pun yang bekerja sama dengan mereka dalam menciptakan atau memiliki sesuatu. Hal ini adalah fakta yang kita lihat di dunia.",
      "text_translation": "Katakanlah (Muhammad), “Serulah mereka yang kamu anggap (sebagai tuhan) selain Allah! Mereka tidak memiliki (kekuasaan) seberat zarrah pun di langit dan di bumi, dan mereka sama sekali tidak mempunyai peran serta dalam (penciptaan) langit dan bumi dan tidak ada di antara mereka yang menjadi pembantu bagi-Nya.”",
      "text": "قُلِ ادْعُوا الَّذِيْنَ زَعَمْتُمْ مِّنْ دُوْنِ اللّٰهِۚ لَا يَمْلِكُوْنَ مِثْقَالَ ذَرَّةٍ فِى السَّمٰوٰتِ وَلَا فِى الْاَرْضِ وَمَا لَهُمْ فِيْهِمَا مِنْ شِرْكٍ وَّمَا لَهٗ مِنْهُمْ مِّنْ ظَهِيْرٍ ",
      "text_translation_en": "SAY: “Call upon those [beings] whom you imagine [to be endowed with divine powers] beside God: they have not an atom’s weight of power either in the heavens or on earth, nor have they any share in [governing] either, nor does He [choose to] have any helper from among them.”",
      "juz_number": 22
    },
    "23": {
      "text_tafsir_en": "In the hereafter the idol cannot save them from trouble. It is also impossible to intercede because on that day no one can intercede except by Allah's permission. Is it possible for God to allow idols that cause His servant to err in intercession? The intercession will not be granted to God except to His prophets, angels, and servants who are considered worthy of intercession. God's Word: No one can intercede on His behalf without His permission. (al-Baqarah \/ 2: 255) And as many angels in heaven, their intercession (aid) is of little use except when Allah has granted (and only) for whom He wills and pleases. (an-Najm \/ 53: 36) On that day, the servants of God waited with anxiety and impatience, which of them would He allow to intercede and who would intercede? At that time, they were silent because the fear had disappeared from their hearts and God was going to give them his decision. They waited, hoping and wondering among themselves what God had said. All said, \"What God says is the true word that His intercession will be given to whom He pleases because He is the Most High and the Great.\" At that time, the unbelievers realized that they would not receive intercession and that they knew what they had to do.",
      "text_tafsir": "Di akhirat berhala itu tidak dapat menolong mereka dari kesulitan. Juga tidak mungkin memberi syafaat karena pada hari itu tidak ada seorang pun yang dapat memberi syafaat, kecuali dengan izin Allah. Apakah mungkin Allah akan mengizinkan berhala-berhala yang menjadi sebab bagi kesesatan hamba-Nya untuk memberi syafaat? Syafaat tidak akan diberikan Allah kecuali kepada para nabi, malaikat, dan hamba-Nya yang dianggap berhak untuk diberi syafaat. Firman Allah:\n\nTidak ada yang dapat memberi syafaat di sisi-Nya tanpa izin-Nya. (al-Baqarah\/2: 255)\n\nDan betapa banyak malaikat di langit, syafaat (pertolongan) mereka sedikit pun tidak berguna kecuali apabila Allah telah mengizinkan (dan hanya) bagi siapa yang Dia kehendaki dan Dia ridai. (an-Najm\/53: 36)\n\nPada hari itu, hamba-hamba Allah menunggu dengan perasaan gelisah dan tidak sabar, siapakah di antara mereka yang akan diizinkan-Nya untuk memberi syafaat dan yang akan mendapat syafaat. Ketika itu, mereka berdiam semuanya karena ketakutan telah hilang dari hati mereka dan Allah akan memberi ketetapan-Nya. Mereka menunggu sambil berharap-harap dan bertanya-tanya antara sesama mereka apa yang difirmankan Tuhan. Semua menjawab, \"Yang difirmankan Allah ialah perkataan yang benar yaitu syafaat-Nya akan diberikan kepada siapa yang diridai-Nya karena Dia Mahatinggi dan Mahabesar.\" Pada waktu itu, sadarlah orang-orang kafir bahwa mereka tidak akan mendapat syafaat dan tahulah mereka nasib apa yang harus mereka alami.",
      "text_translation": "Dan syafaat (pertolongan) di sisi-Nya hanya berguna bagi orang yang telah diizinkan-Nya (memperoleh syafaat itu). Sehingga apabila telah dihilangkan ketakutan dari hati mereka, mereka berkata, “Apakah yang telah difirmankan oleh Tuhanmu?” Mereka menjawab, “(Perkataan) yang benar,” dan Dialah Yang Mahatinggi, Mahabesar.",
      "text": "وَلَا تَنْفَعُ الشَّفَاعَةُ عِنْدَهٗٓ اِلَّا لِمَنْ اَذِنَ لَهٗ ۗحَتّٰىٓ اِذَا فُزِّعَ عَنْ قُلُوْبِهِمْ قَالُوْا مَاذَاۙ قَالَ رَبُّكُمْۗ قَالُوا الْحَقَّۚ وَهُوَ الْعَلِيُّ الْكَبِيْرُ ",
      "text_translation_en": "And, before Him, intercession can be of no avail [to any] save one in whose case He may have granted leave [there for]: so much so that when the terror [of the Last Hour] is lifted from their hearts, they [who have been resurrected] will ask [one an­other], “What has your Sustainer decreed [for you]?” - [to which] the others will answer, “Whatever is true and deserved - for He alone is exalted, great!”",
      "juz_number": 22
    },
    "24": {
      "text_tafsir_en": "In this verse, God, through the Prophet Muhammad, asked the Muslims, who provided them with sustenance from heaven and earth by the pouring of rain, and with that rain the earth became fertile and gave rise to many kinds of plants for food for them and for livestock. They can't answer that. Although they want to say Allah, the answer is in accordance with their conscience, but they answer the idols, the answer actually contradicts their conscience which justifies the call of the Prophet Muhammad. Therefore, they are silent, unable to provide any answers. Thus Allah commanded Muhammad that the sustenance of both heaven and earth is only Allah. This same question is repeated in another verse: Say: Who is the Lord of heaven and earth? Say, \"God.\" Say, \"Must you take protectors other than Allah, when they have no power to do good or to destroy themselves?\" (ar-Ra'd \/ 13: 16) Allah then sent the Prophet Muhammad to them after he could not answer the above question, \"We or you must be in the right or in the wrong.\" This is a very fine and thorough way of discussion. The Prophet did not say that the Muslims were the ones who were lost and that he was right, but he said one of them must be the one who followed the right path and the other one who went astray. These words must entice opponents to think of who actually got the clues and who was misguided, and to avoid the harsh ways of getting the answer out loud. If the Prophet (peace and blessings be upon him) said that they were astray, then they would have answered the false prophet.",
      "text_tafsir": "Pada ayat ini, Allah dengan perantaraan Nabi Muhammad menanyakan kepada kaum musyrik, siapakah yang memberi mereka rezeki dari langit dan bumi dengan menurunkan hujan, dan dengan air hujan itu bumi menjadi subur dan menumbuhkan berbagai macam tumbuhan untuk menjadi makanan bagi mereka dan binatang ternak. Mereka tentu tidak dapat menjawabnya. Walaupun mereka ingin mengatakan Allah, jawaban yang sesuai dengan hati nurani mereka, tetapi mereka menjawabnya berhala-berhala, jawaban yang sebetulnya bertentangan dengan hati nurani mereka yang membenarkan seruan Nabi Muhammad. Oleh sebab itu, mereka terdiam, tidak dapat memberikan jawaban apa pun. Demikianlah Allah memerintahkan kepada Muhammad bahwa yang memberi rezeki baik dari langit maupun bumi hanyalah Allah. Pertanyaan semacam ini disebut pula pada ayat lain yaitu:\n\nKatakanlah (Muhammad), \"Siapakah Tuhan langit dan bumi?\" Katakanlah, \"Allah.\" Katakanlah, \"Pantaskah kamu mengambil pelindung-pelindung selain Allah, padahal mereka tidak kuasa mendatangkan manfaat maupun menolak mudarat bagi dirinya sendiri?\" (ar-Ra'd\/13: 16) \n\nAllah lalu menyuruh Nabi Muhammad mengatakan kepada mereka setelah tidak dapat menjawab pertanyaan di atas, \"Kami atau kamu pasti berada dalam petunjuk atau dalam kesesatan yang nyata.\" Inilah suatu cara berdiskusi yang amat halus dan tajam. Nabi tidak mengatakan bahwa kaum musyrik itulah yang sesat dan dirinya yang benar, tetapi dia menyatakan salah satu di antara keduanya pasti ada yang mengikuti jalan yang benar dan ada yang mengikuti jalan yang sesat. Ucapan ini pasti menarik lawan untuk berpikir siapa sebenarnya yang mendapat petunjuk dan siapa yang sesat, dan menghindari cara-cara yang keras karena akan mendatangkan jawaban yang keras pula. Kalau Nabi saw mengatakan dengan tegas bahwa merekalah yang sesat, tentu mereka akan menjawab dengan tegas bahwa Nabilah yang sesat.",
      "text_translation": "Katakanlah (Muhammad), “Siapakah yang memberi rezeki kepadamu dari langit dan dari bumi?” Katakanlah, “Allah,” dan sesungguhnya kami atau kamu (orang-orang musyrik), pasti berada dalam kebenaran atau dalam kesesatan yang nyata.",
      "text": "۞ قُلْ مَنْ يَّرْزُقُكُمْ مِّنَ السَّمٰوٰتِ وَالْاَرْضِۗ قُلِ اللّٰهُ ۙوَاِنَّآ اَوْ اِيَّاكُمْ لَعَلٰى هُدًى اَوْ فِيْ ضَلٰلٍ مُّبِيْنٍ ",
      "text_translation_en": "Say: “Who is it that provides for you sus­tenance out of the heavens and the earth?” Say: “It is God. And, behold, either we [who believe in Him] or you [who deny His oneness] are on the right path, or have clearly gone astray!”",
      "juz_number": 22
    },
    "25": {
      "text_tafsir_en": "In this verse, the Prophet Muhammad was told to tell them that everyone was responsible for his actions. The Muslims are not responsible for the wrongdoings of the Muslims, on the contrary, Muslims are not responsible for the actions of the Muslims. Some disbelievers say that the Muslims once accused the Prophet (saws) and the believers that they had committed a great sin of apostasy and betrayed the religion of their ancestors. In response to the charge, it is submitted that Muslims are responsible for all their sins and wrongdoings. In the same way, the Muslims are fully responsible for their good or bad deeds. In another verse, Allah tells the Prophet to say things that are in line with this, as He said: And if they (Muhammad) deny (Muhammad), then say, \"For my work and for your work. You have no responsibility for what I do.\" do it and I'm not responsible for what you do. \" (Jonah 10:41)",
      "text_tafsir": "Pada ayat ini, Nabi Muhammad disuruh mengatakan kepada mereka bahwa masing-masing bertanggung jawab penuh atas segala perbuatannya. Kaum musyrik tidak bertanggung jawab atas perbuatan kaum Muslimin yang salah, demikian pula sebaliknya, kaum Muslimin pun tidak bertanggung jawab atas segala perbuatan kaum musyrik. Sebagian mufasir mengatakan bahwa orang-orang musyrik pernah menuduh Nabi saw dan orang-orang mukmin bahwa mereka telah berdosa besar karena murtad dan mengkhianati agama nenek moyang mereka. Sebagai jawaban atas tuduhan itu, dikemukakan bahwa kaum Muslimin memang bertanggung jawab atas segala dosa dan kesalahan mereka. Demikian pula kaum musyrikin bertanggung jawab pula sepenuhnya atas segala perbuatan mereka yang baik ataupun yang jahat. Pada ayat lain, Allah menyuruh Nabi mengucapkan kata-kata yang senada dengan ini, seperti firman-Nya:\n\nDan jika mereka (tetap) mendustakanmu (Muhammad), maka katakanlah, \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu tidak bertanggung jawab terhadap apa yang aku kerjakan dan aku pun tidak bertanggung jawab terhadap apa yang kamu kerjakan.\" (Yunus\/10: 41)",
      "text_translation": "Katakanlah, “Kamu tidak akan dimintai tanggung jawab atas apa yang kami kerjakan dan kami juga tidak akan dimintai tanggung jawab atas apa yang kamu kerjakan.”",
      "text": "قُلْ لَّا تُسْـَٔلُوْنَ عَمَّآ اَجْرَمْنَا وَلَا نُسْـَٔلُ عَمَّا تَعْمَلُوْنَ ",
      "text_translation_en": "Say: “Neither shall you be called to account for whatever we may have become guilty of, nor shall we be called to account for whatever you are doing.”",
      "juz_number": 22
    },
    "26": {
      "text_tafsir_en": "Then the Prophet was told to say to the Muslims, \"Allah will bring us all together on the Day of Judgment and there He will judge us and our actions justly. the straight path, who among us is wrong and who is right. \" All the acts of his servants will be weighed down with a balance of justice. Bad deeds will be rewarded with a fair reward and good deeds will be rewarded with double rewards. This is also clearly stated in another verse, that is: And on the day (when) the Resurrection occurs, on that day the people are divided (in groups). But as for those who believe and do good, then they in the garden will rejoice. And as for those who disbelieve and deny Our Signs and (deny) the Hereafter, they will be in the torment. (ar-Romans \/ 30: 14-16) Wherever God decides, no one can argue because all those decisions are based on facts that cannot be denied. Allah knows when the verdict will be dropped, and no servant can know, for He is the All-Knowing and the All-Knowing.",
      "text_tafsir": "Kemudian Nabi diperintahkan untuk mengatakan kepada kaum musyrikin itu, \"Allah akan mengumpulkan kita semua pada hari Kiamat dan di sanalah Dia akan memberi keputusan terhadap kita dan perbuatan kita dengan seadil-adilnya. Di sana akan jelas siapa di antara kita yang sesat dan siapa yang menempuh jalan yang lurus, siapa di antara kita yang salah dan siapa yang benar.\"\n\nSemua perbuatan hamba-Nya akan ditimbang dengan neraca keadilan. Perbuatan buruk akan dibalas dengan balasan yang setimpal dan perbuatan baik akan dibalas dengan pahala yang berlipat ganda. Hal ini disebut pula dengan jelas pada ayat lain, yaitu:\n\nDan pada hari (ketika) terjadi Kiamat, pada hari itu manusia terpecah-pecah (dalam kelompok). Maka adapun orang-orang yang beriman dan mengerjakan kebajikan, maka mereka di dalam taman (surga) bergembira. Dan adapun orang-orang yang kafir dan mendustakan ayat-ayat Kami serta (mendustakan) pertemuan hari akhirat, maka mereka tetap berada di dalam azab (neraka). (ar-Rum\/30: 14-16)\n\nDi sanalah nanti Allah memberikan keputusan, tidak ada yang dapat membantah karena semua keputusan itu berdasarkan fakta-fakta yang nyata yang tidak dapat disangkal lagi. Allah Maha Mengetahui kapan vonis itu akan dijatuhkan-Nya, tidak ada seorang hamba pun yang dapat mengetahui, karena Dialah yang Maha Pemberi Keputusan dan Maha Mengetahui.",
      "text_translation": "Katakanlah, “Tuhan kita akan mengumpulkan kita semua, kemudian Dia memberi keputusan antara kita dengan benar. Dan Dia Yang Maha Pemberi keputusan, Maha Mengetahui.”",
      "text": "قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِالْحَقِّۗ وَهُوَ الْفَتَّاحُ الْعَلِيْمُ ",
      "text_translation_en": "Say: “Our Sustainer will bring us all together [on Judgment Day], and then He will lay open the truth between us, in justice - for He alone is the One who opens all truth, the All-Knowing!”",
      "juz_number": 22
    },
    "27": {
      "text_tafsir_en": "Allah then ordered the Prophet Muhammad to ask the unbelievers, who and what of the idols they had associated with Allah. They were asked to explain to him who the idols were, what his attributes were, their values, their values, and their position. Why are they worshiped, is he worthy of worship? The questions posed to them are a challenge and a statement that they do not use their senses in worshiping something of worthless, dead matter that they create with their own hands. It is never possible and unreasonable to associate the dead with the almighty God.",
      "text_tafsir": "Allah lalu memerintahkan kepada Nabi Muhammad supaya menanyakan kepada orang-orang musyrik itu, siapakah dan apakah sebenarnya berhala-berhala yang mereka persekutukan dengan Allah. Mereka diminta untuk menerangkan kepadanya siapa berhala-berhala itu, bagaimana sifat-sifatnya, nilai dan mutunya, serta kedudukannya. Mengapa mereka dijadikan sembahan, apakah memang dia berhak disembah? \n\nPertanyaan-pertanyaan yang dikemukakan kepada mereka itu sebagai tantangan dan pernyataan bahwa mereka tidak mempergunakan akal mereka karena menyembah sesuatu yang tidak ada nilainya, benda mati yang mereka buat dengan tangan mereka sendiri. Sekali-kali tidak mungkin dan tidak masuk akal mempersekutukan benda mati dengan Allah Yang Mahaperkasa dan Maha Mengetahui.",
      "text_translation": "Katakanlah, “Perlihatkanlah kepadaku sembahan-sembahan yang kamu hubungkan dengan Dia sebagai sekutu-sekutu(-Nya), tidak mungkin! Sebenarnya Dialah Allah Yang Mahaperkasa, Mahabijaksana.”",
      "text": "قُلْ اَرُوْنِيَ الَّذِيْنَ اَلْحَقْتُمْ بِهٖ شُرَكَاۤءَ كَلَّا ۗبَلْ هُوَ اللّٰهُ الْعَزِيْزُ الْحَكِيْمُ ",
      "text_translation_en": "Say: “Point out to me those [beings] that you have joined with Him [in your minds] as partners [in His divinity]! Nay - nay, but He [alone] is God, the Almighty, the Wise!”",
      "juz_number": 22
    },
    "28": {
      "text_tafsir_en": "In this verse, God explains that Prophet Muhammad was sent to all mankind. He serves as a happy news anchor for those who believe in and practice the pamphlets he brings and as a reminder to those who reject or reject his teachings. Prophet Muhammad was a closing prophet, no more prophets and apostles were sent by God afterwards. Thus, the pamphlet he brought was for all mankind to the end. As a final treatise, it contains rules and regulations of the law that are good and proper to be practiced at every place and time. The leaflet that the Prophet Muhammad brought was from the Almighty and Knowing God. God who created the heavens and the earth and everything in them. He is the one who controls everything that exists between the two. It is he who rules it with such careful rules that everything goes well and harmoniously. The great God of His power would not have released a pamphlet covering the whole human race if the rules and regulations did not cover all human interests at all times. Thus, it must be a good leaflet to be applied to anyone and any people in the world. Many verses in the Qur'an assert that Muhammad was sent to mankind as a whole. The holiness of God who sent down the Furqan (Qur'an) to his servant (Muhammad), that he might be a warning to the whole world (jinn and mankind). (al-Furqan \/ 25: 1) And He says: Say: \"O mankind! Verily, I am the Messenger of Allah to you all, who have the kingdom of heaven and of earth; Whoever lives and kills, then believe in Allah and His Messenger, (the) Prophet (s) who believes in Allah and in His words. Follow him, that you may be guided. \" al-A 'raf \/ 7: 158) It is not known to everyone that most people reject it and challenge it. Among those challengers were the Muhammadans themselves, the infidels of Mecca. And most people will not believe it even if you really want it. (Joseph \/ 12: 103)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Nabi Muhammad diutus kepada seluruh manusia. Ia bertugas sebagai pembawa berita gembira bagi orang yang mempercayai dan mengamalkan risalah yang dibawanya dan sekaligus pembawa peringatan kepada orang yang mengingkari atau menolak ajaran-ajarannya. Nabi Muhammad adalah nabi penutup, tidak ada lagi nabi dan rasul diutus Allah sesudahnya. Dengan demikian, pastilah risalah yang dibawanya itu berlaku untuk seluruh manusia sampai kiamat. Sebagai risalah yang terakhir, maka di dalamnya tercantum peraturan-peraturan dan syariat hukum-hukum yang layak dan baik untuk dijalankan di setiap tempat dan masa. \n\nRisalah yang dibawa Nabi Muhammad bersumber dari Allah Yang Mahabijaksana dan Maha Mengetahui. Tuhan yang menciptakan langit dan bumi dan segala apa yang ada pada keduanya. Dialah yang mengatur segala apa yang ada pada keduanya. Dialah yang mengatur semuanya itu dengan peraturan yang amat teliti sehingga semuanya berjalan dengan baik dan harmonis. Allah yang demikian besar kekuasaan-Nya tidak mungkin akan menurunkan suatu risalah yang mencakup seluruh umat manusia kalau peraturan dan syariat itu tidak mencakup seluruh kepentingan manusia pada setiap masa. Dengan demikian, pastilah risalahnya itu risalah yang baik untuk diterapkan kepada siapa dan umat yang mana pun di dunia ini. Banyak ayat di dalam Al-Qur'an yang menegaskan bahwa Muhammad diutus kepada manusia seluruhnya.\n\nMahasuci Allah yang telah menurunkan al-Furqan (Al-Qur'an) kepada hamba-Nya (Muhammad), agar dia menjadi pemberi peringatan kepada seluruh alam (jin dan manusia). (al-Furqan\/25: 1) \n\nDan firman-Nya:\n\nKatakanlah (Muhammad), \"Wahai manusia! Sesungguhnya aku ini utusan Allah bagi kamu semua, Yang memiliki kerajaan langit dan bumi; tidak ada tuhan (yang berhak disembah) selain Dia, Yang menghidupkan dan mematikan, maka berimanlah kamu kepada Allah dan Rasul-Nya, (yaitu) Nabi yang ummi yang beriman kepada Allah dan kepada kalimat-kalimat-Nya (kitab-kitab-Nya). Ikutilah dia, agar kamu mendapat petunjuk.\"(al-A 'raf\/7: 158) \n\nHal ini tidak diketahui oleh semua orang bahkan kebanyakan manusia menolak dan menantangnya. Di antara penantang-penantang itu adalah kaum Muhammad sendiri yaitu orang-orang kafir Mekah. \n\nDan kebanyakan manusia tidak akan beriman walaupun engkau sangat menginginkannya. (Yusuf\/12: 103)",
      "text_translation": "Dan Kami tidak mengutus engkau (Muhammad), melainkan kepada semua umat manusia sebagai pembawa berita gembira dan sebagai pemberi peringatan, tetapi kebanyakan manusia tidak mengetahui.",
      "text": "وَمَآ اَرْسَلْنٰكَ اِلَّا كَاۤفَّةً لِّلنَّاسِ بَشِيْرًا وَّنَذِيْرًا وَّلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ ",
      "text_translation_en": "NOW [as for thee, O Muhammad,] We have not sent thee otherwise than to mankind at large, to be a herald of glad tidings and a warner; but most people do not understand [this],",
      "juz_number": 22
    },
    "29": {
      "text_tafsir_en": "In this verse, Allah explains that the Muslims opposed the Prophet Muhammad as a bearer of glad tidings to the believers and a warning to the disbelievers. Muhammad explained to them that the justice of God not only applies to the world, but includes justice in the hereafter. All human actions will be rewarded with a fair reward. They mocked the Prophet's words and said that the Day of Resurrection would not have happened and would not have happened. They said to him in a mocking tone, \"If the truth of your Lord's promise is true, then tell us when it will be.\" In other verses it is stated that they challenged the Prophet Muhammad to have the coming of the Day hastened, as it is said in Allah: Those who do not believe that the Day of Judgment demanded that the day should come soon, and those who believed were afraid of it and they believe that the end is right (will happen). Be aware that the fact that people are arguing about the end of the doom has really gone astray. (asy-Syura \/ 42: 18) Their ridicule and challenge show their ignorance about the mission of the Prophet Muhammad, and they do not know the limits of his duty. The apostle was just a man assigned by God to deliver the brochure. He was not a man of power and knowledge like his God. His knowledge and power are limited to what God has given him. If he were asked about the supernatural, he would not be able to explain it unless God had told him. If he is asked to bring down the doom or hasten the coming of the Day of Judgment, it is beyond his means.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa kaum musyrik menentang Nabi Muhammad sebagai pembawa berita gembira bagi orang mukmin dan pemberi peringatan bagi kaum yang ingkar. Muhammad menerangkan kepada mereka bahwa keadilan Allah bukan hanya berlaku di dunia saja, tetapi mencakup keadilan di akhirat. Semua perbuatan manusia akan dibalas dengan balasan yang setimpal. Mereka mengolok-olok ucapan Nabi saw dan mengatakan bahwa hari Kiamat tidak mungkin terjadi dan tidak mungkin akan terjadi. Mereka berkata kepadanya dengan nada mengejek, \"Kalau benar kiamat yang dijanjikan Tuhanmu itu benar akan terjadi, maka terangkanlah kepada kami kapan akan terjadi.\" Bahkan pada ayat lain diterangkan bahwa mereka menantang Nabi Muhammad supaya kedatangan hari kiamat itu disegerakan saja, sebagaimana disebut dalam firman Allah:\n\nOrang-orang yang tidak percaya adanya hari kiamat meminta agar hari itu segera terjadi, dan orang-orang yang beriman merasa takut kepadanya dan mereka yakin bahwa kiamat itu adalah benar (akan terjadi). Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya kiamat itu benar-benar telah tersesat jauh. (asy-Syura\/42: 18) \n\nEjekan dan tantangan mereka itu menunjukkan ketidaktahuan mereka tentang tugas Nabi Muhammad sebagai rasul, dan mereka tidak mengetahui batas-batas tugasnya. Rasul itu hanya seorang manusia yang ditugaskan Allah menyampaikan risalah. Dia bukan orang yang berkuasa dan mempunyai ilmu seperti Tuhannya. Ilmu dan kekuasaannya terbatas pada apa yang diberikan Allah kepadanya. Kalau ditanyakan kepadanya tentang hal-hal yang gaib, dia tentu tidak akan dapat menjelaskannya kecuali bila Allah telah memberitahukan kepadanya. Kalau diminta kepadanya agar diturunkan azab atau disegerakan datangnya hari Kiamat, maka hal itu berada di luar kemampuannya.",
      "text_translation": "Dan mereka berkata, “Kapankah (datangnya) janji ini, jika kamu orang yang benar?”",
      "text": "وَيَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ ",
      "text_translation_en": "and so they ask, “When is this promise [of resurrection and judgment] to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!”",
      "juz_number": 22
    },
    "30": {
      "text_tafsir_en": "In response to the disobedience and challenge of the Muslims, Allah sent Prophet Muhammad to assure them that the Day of Judgment must occur at the appointed time of Allah. When the time is up, the end cannot be withdrawn or advanced for a moment. Therefore, they should be careful, always alert, and be prepared with faith and righteous deeds. When the time of the end has come, there is no chance for a person to repent and he will regret it when he sees the torment provided for the disobedient.",
      "text_tafsir": "Sebagai jawaban atas keingkaran dan tantangan kaum musyrik itu, Allah menyuruh Nabi Muhammad menegaskan kepada mereka bahwa hari kiamat itu pasti terjadi pada waktu yang telah ditentukan Allah. Bila waktunya sudah tiba, kiamat itu tidak dapat diundurkan atau dimajukan walau sesaat pun. Oleh sebab itu, mereka harus berhati-hati, selalu waspada, dan bersiap-siap dengan iman dan amal saleh. Jika waktu kiamat sudah datang, tidak ada kesempatan lagi bagi seseorang untuk bertobat dan dia akan menyesal kelak bila melihat azab yang disediakan bagi orang yang ingkar.",
      "text_translation": "Katakanlah, “Bagimu ada hari yang telah dijanjikan (hari Kiamat), kamu tidak dapat meminta penundaan atau percepatannya sesaat pun.”",
      "text": "قُلْ لَّكُمْ مِّيْعَادُ يَوْمٍ لَّا تَسْتَأْخِرُوْنَ عَنْهُ سَاعَةً وَّلَا تَسْتَقْدِمُوْنَ ࣖ ",
      "text_translation_en": "Say: “There has been appointed for you a Day, which you can neither delay nor advance by a single moment.”",
      "juz_number": 22
    },
    "31": {
      "text_tafsir_en": "In this verse, God describes how deeply the unbelievers disbelieved in the religion brought by Muhammad and other religions brought by the previous prophets. They assert that they will not believe in the Qur'an and the books that Allah has revealed to His apostles. For those who are determined to do this, there is no evidence or proof they can accept, even if the evidence is strong, tangible, and acceptable to a healthy mind or a clear mind. Their hearts have been filled with so much fanaticism that everything that goes against them is wrong, misguided, and totally unacceptable. Ever the Meccanic monks asked the Bookers what the attributes and attributes of Muhammad saw were and what they say in their books. Some Scripture scholars have described the characteristics and attributes of Muhammad. They also say that maybe Muhammad was indeed an apostle of the Messenger of God. For a person whose heart is pure and unspotted by the arrogance and blind fanaticism, this answer will haunt them and make them think. However, the answer made them angry and rejected the scholars' testimony and refused to believe it. In fact, they are closed to receive the truth as it is said in the Word of God: God has locked their hearts and their hearing, their eyes have been closed, and they will receive a severe punishment. (al-Baqarah \/ 2: 7) Since there is no evidence that can destroy them, and what must be presented to them is a serious threat, in these verses it is told how the disbelievers and their leaders in the Hereafter later standing before God. At that time, the unbelievers realized that they had gone astray. They turned to their leaders and said, \"If it had not been for your actions against us in the world, we would not have suffered such a thing. We would have believed in Muhammad (saw) and included the servant of Allah whom He approved.\"",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bagaimana mendalamnya keingkaran orang-orang musyrik terhadap agama yang dibawa oleh Nabi Muhammad dengan agama samawi lainnya yang dibawa oleh para rasul sebelumnya. Mereka menyatakan tekad tidak akan beriman kepada Al-Qur'an dan kitab-kitab yang diturunkan Allah kepada para rasul-Nya. Bagi orang-orang yang bertekad seperti ini tidak ada suatu dalil atau bukti pun yang dapat mereka terima, walaupun bukti itu kuat, nyata, dan dapat diterima oleh akal yang sehat atau pikiran yang jernih.\n\nHati mereka telah dipenuhi dengan fanatisme yang keras sehingga semua yang bertentangan dengan paham mereka adalah salah, sesat, dan sama sekali tidak dapat diterima. Pernah kaum musyrik Mekah bertanya kepada Ahli Kitab tentang bagaimana ciri-ciri dan sifat-sifat Muhammad saw dan apakah hal itu disebutkan dalam kitab mereka. Sebagian Ahli Kitab menerangkan ciri-ciri dan sifat-sifat Muhammad saw. Mereka juga mengatakan bahwa mungkin Muhammad saw itu memang seorang rasul utusan Tuhan. Bagi orang yang hatinya bersih dan tidak dikotori oleh kesombongan dan fanatik buta, jawaban ini akan menginsafkan mereka dan menjadikan mereka berpikir. Tetapi, jawaban itu membuat mereka menjadi marah dan menolak mentah-mentah keterangan para Ahli Kitab itu dan tidak mau memercayainya. Memang batin mereka telah ditutup untuk menerima kebenaran sebagaimana disebut dalam firman Allah:\n\nAllah telah mengunci hati dan pendengaran mereka, penglihatan mereka telah tertutup, dan mereka akan mendapat azab yang berat. (al-Baqarah\/2: 7)\n\nOleh karena tidak ada bukti yang dapat menginsafkan mereka, dan yang patut dikemukakan kepada mereka ialah ancaman yang keras, maka pada ayat-ayat ini diceritakan bagaimana keadaan orang-orang kafir itu dan para pemimpin mereka di akhirat nanti ketika berdiri di hadapan Allah. Pada waktu itu, orang-orang kafir itu sadar bahwa mereka telah sesat. Mereka menoleh kepada pemimpin mereka dan berkata, \"Kalau tidak karena tindakanmu terhadap kami di dunia, tentu kami tidak akan mengalami hal seperti ini. Kami tentu telah beriman kepada Muhammad saw dan termasuk hamba Allah yang diridai-Nya.\"",
      "text_translation": "Dan orang-orang kafir berkata, “Kami tidak akan beriman kepada Al-Qur'an ini dan tidak (pula) kepada Kitab yang sebelumnya.” Dan (alangkah mengerikan) kalau kamu melihat ketika orang-orang yang zalim itu dihadapkan kepada Tuhannya, sebagian mereka mengembalikan perkataan kepada sebagian yang lain; orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri, “Kalau tidaklah karena kamu tentulah kami menjadi orang-orang mukmin.”",
      "text": "وَقَالَ الَّذِيْنَ كَفَرُوْا لَنْ نُّؤْمِنَ بِهٰذَا الْقُرْاٰنِ وَلَا بِالَّذِيْ بَيْنَ يَدَيْهِۗ وَلَوْ تَرٰىٓ اِذِ الظّٰلِمُوْنَ مَوْقُوْفُوْنَ عِنْدَ رَبِّهِمْۖ يَرْجِعُ بَعْضُهُمْ اِلٰى بَعْضِ ِۨالْقَوْلَۚ يَقُوْلُ الَّذِيْنَ اسْتُضْعِفُوْا لِلَّذِيْنَ اسْتَكْبَرُوْا لَوْلَآ اَنْتُمْ لَكُنَّا مُؤْمِنِيْنَ ",
      "text_translation_en": "And [yet,] those who are bent on denying the truth do say, “We shall never believe in this Qur’an, and neither in whatever there still remains of earlier revelations!” But if thou couldst only see [how it will be on Judgment Day,] when these evildoers shall be made to stand before their Sustainer, hurling reproaches back and forth at one another! Those [of them] who had been weak [on earth] will say unto those who had gloried in their arrogance: “Had it not been for you, we would certainly have been believers!”",
      "juz_number": 22
    },
    "32": {
      "text_tafsir_en": "These words and accusations were answered by leaders who had threatened them with their release from responsibility. The leaders said, \"Have we ever prevented you from following our instructions? We have never forced you to follow our will and follow the path we have taken. We have never prevented you from following the teachings of the Messenger of Allah. If you have erred because of your deeds, do not bring us to account for your deeds. You are indeed among the astray. \" If the answers of those leaders were uttered while they were still in the world, their followers would have been silent, due to their great influence on them. However, there is something else in the hereafter. Man's standing before God is all the same, no subordinates and leaders, and no feudal or lay people.",
      "text_tafsir": "Ucapan dan tuduhan ini dijawab oleh para pemimpin yang telah menjerumuskan mereka karena hendak melepaskan diri dari tanggung jawab. Para pemimpin itu berkata, \"Apakah kami pernah menghalangi kamu mengikuti petunjuk? Kami tidak pernah memaksa kamu supaya mengikuti kemauan kami dan mengikuti jalan yang kami tempuh. Kami tidak pernah menghalangi kamu mengikuti ajaran yang dibawa oleh rasul Allah. Hanya kamu sendirilah dengan kemauan kamu sendiri pula yang menolak ajaran itu, dan turut mendustakannya. Kalau kamu telah sesat disebabkan tindakan kamu, janganlah kami dibawa-bawa untuk mempertanggungjawabkan perbuatanmu itu. Kamu sebenarnya termasuk orang-orang sesat.\" \n\nKalau jawaban para pemimpin itu diucapkan pada waktu mereka masih di dunia, para pengikutnya pasti akan diam, karena pengaruhnya yang besar terhadap mereka. Tetapi, lain halnya di akhirat. Kedudukan manusia di hadapan Allah semua sama, tidak ada bawahan dan pimpinan, dan tidak ada kaum feodal atau kaum jelata.",
      "text_translation": "Orang-orang yang menyombongkan diri berkata kepada orang-orang yang dianggap lemah, “Kamikah yang telah menghalangimu untuk memperoleh petunjuk setelah petunjuk itu datang kepadamu? (Tidak!) Sebenarnya kamu sendirilah orang-orang yang berbuat dosa.”",
      "text": "قَالَ الَّذِيْنَ اسْتَكْبَرُوْا لِلَّذِيْنَ اسْتُضْعِفُوْٓا اَنَحْنُ صَدَدْنٰكُمْ عَنِ الْهُدٰى بَعْدَ اِذْ جَاۤءَكُمْ بَلْ كُنْتُمْ مُّجْرِمِيْنَ ",
      "text_translation_en": "[And] those who were wont to glory in their arrogance will say unto those who had been weak: “Why - did we keep you [forcibly] from following the right path after it had become obvious to you? Nay, it was but you [yourselves] who were guilty!”",
      "juz_number": 22
    },
    "33": {
      "text_tafsir_en": "Therefore, the followers were dissatisfied with the answers of their leaders and went on to claim that those leaders always persuaded and deceived them day and night, and ordered them to disobey God and associate with others. But all is well and there is no time to return to the truth or to repent. Everyone, both their leaders and their followers, knew that they would have a fair reward for their cruelty and rebellion. They feel very sorry when they see the punishment that will befall them, but regret is no longer useful. They are cast into hell in shackles. It is the torment that deserves to be met for their attitude and actions throughout the world.",
      "text_tafsir": "Oleh sebab itu, para pengikut itu tidak puas mendengar jawaban para pemimpinnya dan melanjutkan dakwaan bahwa para pemimpin itu selalu membujuk dan menipu mereka siang dan malam, serta memerintahkan supaya ingkar kepada Allah dan mempersekutukan-Nya dengan yang lain. Tetapi, semuanya telah telanjur dan tidak ada waktu lagi untuk kembali kepada kebenaran atau untuk bertobat. \n\nSemuanya, baik para pemimpin maupun pengikutnya, telah mengetahui akan mendapat balasan yang setimpal atas ke-ingkaran dan kedurhakaan mereka. Mereka merasa sangat menyesal ketika melihat azab yang akan ditimpakan kepada mereka, tetapi penyesalan itu tidak berguna lagi. Mereka dimasukkan ke neraka dalam keadaan terbelenggu. Memang siksaan itulah yang layak ditimpakan karena sikap dan perbuatan mereka selama di dunia.",
      "text_translation": "Dan orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri, “(Tidak!) Sebenarnya tipu daya(mu) pada waktu malam dan siang (yang menghalangi kami), ketika kamu menyeru kami agar kami kafir kepada Allah dan menjadikan sekutu-sekutu bagi-Nya.” Mereka menyatakan penyesalan ketika mereka melihat azab. Dan Kami pasangkan belenggu di leher orang-orang yang kafir. Mereka tidak dibalas melainkan sesuai dengan apa yang telah mereka kerjakan.",
      "text": "وَقَالَ الَّذِيْنَ اسْتُضْعِفُوْا لِلَّذِيْنَ اسْتَكْبَرُوْا بَلْ مَكْرُ الَّيْلِ وَالنَّهَارِ اِذْ تَأْمُرُوْنَنَآ اَنْ نَّكْفُرَ بِاللّٰهِ وَنَجْعَلَ لَهٗٓ اَنْدَادًا ۗوَاَسَرُّوا النَّدَامَةَ لَمَّا رَاَوُا الْعَذَابَۗ وَجَعَلْنَا الْاَغْلٰلَ فِيْٓ اَعْنَاقِ الَّذِيْنَ كَفَرُوْاۗ هَلْ يُجْزَوْنَ اِلَّا مَا كَانُوْا يَعْمَلُوْنَ ",
      "text_translation_en": "But those who had been weak will say unto those who had gloried in their arrogance: “Nay, [what kept us away was your] devising of false arguments, night and day, [against God’s messages- as you did] when you persuaded us to blaspheme against God and to claim that there are powers that could rival Him!” And when they see the suffering [that awaits them], they will [all] be unable to express [the full depth of] their remorse: for We shall have put shackles around the necks of those who had been bent on denying the truth: [and] will this be aught but a [just] requital for what they were doing?",
      "juz_number": 22
    },
    "34": {
      "text_tafsir_en": "In this verse it is stated that no prophet was sent by God to a country without resistance from the leaders of his people. They are usually the elite who dominate the political and economic life of the country. They are well-established and lively lives, and are happy. With the coming of the prophets, they felt that their life was at stake by the teachings of the prophets. Religion does not allow the powerful to oppress the weak, while their supremacy is maintained by oppressing the weak. Religion asks people to pay attention to the legality and the pursuit of wealth and to exploit their wealth, while their wealth is obtained in any way, legal or illegal, and that wealth they use to exploit. Religion does not allow it to violate the rules of religion, whereas it does not live up to its norms. Therefore, they go against the prophets and proclaim, \"We are against what you teach!\" The remarks reaffirmed their arrogance, and further motivated them to act in the earth. When humans have acted in vain, it becomes a reason for Allah to show His power, which is to destroy them. The Word of Allah: And if We desire to destroy a country, then We command the inhabitants of that land to prosper, but when they commit a rebellion in it, it is right for them to do so. and then We destroyed (the land) altogether. (al-Isra '\/ 17: 16)",
      "text_tafsir": "Pada ayat ini ditegaskan bahwa tidak ada seorang nabi pun yang dikirim Allah ke suatu negeri yang tidak mendapat perlawanan dari pemuka-pemuka kaumnya. Mereka biasanya adalah kaum elite yang menguasai kehidupan politik dan ekonomi negeri itu. Mereka sudah mapan dan hidup mewah, dan berfoya-foya. Dengan kedatangan nabi-nabi, mereka merasa kemapanan hidup mereka terusik oleh ajaran-ajaran yang dibawa para nabi itu. \n\nAgama tidak membenarkan yang berkuasa menzalimi yang lemah, sedangkan kemapanan mereka dipertahankan dengan jalan menekan golongan lemah. Agama meminta manusia agar mengindahkan kehalalan dan keharaman dalam mencari rezeki dan memanfaatkan kekayaan, sedangkan kekayaan mereka diperoleh dengan cara apa saja, legal atau ilegal, dan kekayaan itu mereka gunakan untuk berfoya-foya. Agama tidak membolehkan melanggar aturan-aturan agama, sedangkan kehidupan mereka tanpa mengindahkan norma-norma itu. Oleh karena itu, mereka menentang nabi-nabi dan dengan lantang menyatakan, \"Kami menentang apa yang kalian ajarkan!\" Ucapan itu menegaskan pula kesombongan mereka, dan selanjutnya mendorong mereka bertindak semena-mena (fusuq) di bumi ini. Bila manusia sudah berbuat semena-mena, maka itu menjadi alasan bagi Allah untuk memperlihatkan kekuasaan-Nya, yaitu memusnahkan mereka. Firman Allah: \n\nDan jika Kami hendak membinasakan suatu negeri, maka Kami perintahkan kepada orang yang hidup mewah di negeri itu (agar menaati Allah), tetapi bila mereka melakukan kedurhakaan di dalam (negeri) itu, maka sepantasnya berlakulah terhadapnya perkataan (hukuman Kami), kemudian Kami binasakan sama sekali (negeri itu). (al-Isra'\/17:16)",
      "text_translation": "Dan setiap Kami mengutus seorang pemberi peringatan kepada suatu negeri, orang-orang yang hidup mewah (di negeri itu) berkata, “Kami benar-benar mengingkari apa yang kamu sampaikan sebagai utusan.”",
      "text": "وَمَآ اَرْسَلْنَا فِيْ قَرْيَةٍ مِّنْ نَّذِيْرٍ ِالَّا قَالَ مُتْرَفُوْهَآ  ۙاِنَّا بِمَآ اُرْسِلْتُمْ بِهٖ كٰفِرُوْنَ ",
      "text_translation_en": "For [thus it is:] whenever We sent a warner to any community, those of its people who had lost themselves entirely in the pursuit of pleasures would declare, “Behold, we deny that there is any truth in [what you claim to be] your message!” –",
      "juz_number": 22
    },
    "35": {
      "text_tafsir_en": "The abusive, arrogant, and oppressive rulers boast of their wealth and their offspring. They said, \"We are rich and our descendants are many, we will not be punished.\" With wealth, they feel they can buy anything. With their descendants and supporters, they think their power over the weak can be maintained for generations. They also feel loved by God so that in the hereafter they will not be punished for their sins. The benchmark they use is the joy of living in the world. The pleasures of life, in their view, show that they are loved, while the miseries of life indicate that they are hated by God. All their assumptions are false. The gift of abundance and the offspring of those who succeed to the unbelievers is not an indication that God loves them, but rather, as the following verse says: Do they think We give them wealth and children (meaning that), We soon give them good things? (No), but they didn't realize it. (al-Mu'minun \/ 23: 55-56) However, the punishment of the unbelievers in this world is not immediately given to Allah because He still holds them back. This is meant to give them the opportunity to repent, as the Word of God says: And if Allah punishes men for their unrighteousness, then He will not leave anything on earth, but He will hold them back from time to time. has been determined. So when the end comes, they cannot ask for a moment's delay or acceleration. (an-Nahl \/ 16: 61) In another verse it is explained that property and children are the test of man, whether he is a believer and grateful or not. Allah says: Your wealth and your children are but a trial, and in the sight of Allah a great reward. (at-Tagabun \/ 64: 15) Surely the wealth of the unbelievers will not make them eternal in the world, but rather will cause them to be cast into hell, as Allah says: He (man) thinks that his wealth can sustain it. (al-Humazah \/ 104: 3)",
      "text_tafsir": "Golongan berkuasa yang zalim, sombong, dan semena-mena itu membanggakan kekayaan dan keturunan mereka. Mereka berkata, \"Kami kaya raya dan keturunan kami banyak, kami tidak akan terkena azab (tersentuh hukum).\" Dengan kekayaan, mereka merasa dapat membeli apa saja. Dengan keturunan dan pendukung, mereka beranggapan bahwa kekuasaan mereka terhadap yang lemah dapat terus dipertahankan dari generasi ke generasi. Mereka juga merasa disayangi oleh Allah sehingga di akhirat nanti tidak akan dihukum karena dosa-dosa mereka. Tolok ukur yang mereka pakai adalah kesenangan hidup di dunia. Kesenangan hidup, menurut pandangan mereka, menunjukkan bahwa mereka disayangi, sedangkan kesengsaraan hidup menandakan mereka dibenci Allah. \n\nSemua anggapan mereka itu tidaklah benar. Pemberian harta yang melimpah dan anak-anak yang berhasil bagi orang kafir tidak merupakan petunjuk bahwa Allah menyayangi mereka, tetapi sebaliknya, sebagaimana dinyatakan ayat berikut:\n\nApakah mereka mengira bahwa Kami memberikan harta dan anak-anak kepada mereka itu (berarti bahwa), Kami segera memberikan kebaikan-kebaikan kepada mereka? (Tidak), tetapi mereka tidak menyadarinya. (al-Mu'minun\/23: 55-56)\n\nWalaupun begitu, azab tidak segera dijatuhkan kepada orang-orang kafir di dunia ini karena Allah masih memberi penangguhan kepada mereka. Hal ini dimaksudkan untuk memberi kesempatan kepada mereka agar bertobat, sebagaimana dinyatakan dalam firman Allah:\n\nDan kalau Allah menghukum manusia karena kezalimannya, niscaya tidak akan ada yang ditinggalkan-Nya (di bumi) dari makhluk yang melata sekalipun, tetapi Allah menangguhkan mereka sampai waktu yang sudah di-tentukan. Maka apabila ajalnya tiba, mereka tidak dapat meminta penundaan atau percepatan sesaat pun. (an-Nahl\/16: 61) \n\nDalam ayat lain diterangkan bahwa harta dan anak-anak menjadi ujian bagi manusia, apakah ia tetap beriman dan bersyukur ataukah ingkar. Allah berfirman:\n\nSesungguhnya hartamu dan anak-anakmu hanyalah cobaan (bagimu), dan di sisi Allah pahala yang besar. (at-Tagabun\/64: 15)\n\nSesungguhnya harta bagi orang kafir tidak akan bisa membuat mereka abadi di dunia, tetapi sebaliknya akan menyebabkan mereka dilemparkan ke dalam neraka, sebagaimana firman Allah:\n\nDia (manusia) mengira bahwa hartanya itu dapat mengekalkannya. (al-Humazah\/104: 3)",
      "text_translation": "Dan mereka berkata, “Kami memiliki lebih banyak harta dan anak-anak (daripada kamu) dan kami tidak akan diazab.”",
      "text": "وَقَالُوْا نَحْنُ اَكْثَرُ اَمْوَالًا وَّاَوْلَادًاۙ وَّمَا نَحْنُ بِمُعَذَّبِيْنَ ",
      "text_translation_en": "and they would add, “Richer [than you] are we in wealth and in children, and [so] we are not going to be made to suffer!”",
      "juz_number": 22
    },
    "36": {
      "text_tafsir_en": "In this verse, Allah asks the Prophet Muhammad to emphasize on the leaders of the infidels of Mecca that one who extends one's sustenance and restricts his sustenance is Allah. It is to reject the unbelievers above that the prosperity of life in the world is a sign of God's favor and suffering is a sign of His hatred. God extends or limits one's sustenance according to His wisdom. God extends one's provision probably because He trusts so that he can give away some of his wealth to the poor, as the verse says: Indeed, man is created in a complaining nature. When he was in distress he groaned, and when he received good (wealth) he was careless, except for those who performed the prayers, those who faithfully performed their prayers, and those in his fortune prepared a certain portion, for the poor (poor) those who ask and who do not ask, (al-Ma'arij \/ 70: 19-25) For those who disbelieve, their abundance and their offspring are so successful that God has made them an excuse for their punishment. The reason is that the means of obtaining and using the wealth and education of the offspring are not in accordance with the provisions of God, as the verse says: Let not their wealth and their children make you amazed. Allah's purpose is to torment them in the life of the world and to die in a state of disbelief. (at-Taubah \/ 9: 55) On the contrary, it is God who restricts one's sustenance. For those who believe in diminishing wealth, family members, and food are to test their patience. If they are patient, God will make them happy in this world and in the hereafter, as He says: And We will surely test you with a little fear, hunger, lack of wealth, soul, and fruit. And give glad tidings to those who are patient. (al-Baqarah \/ 2: 155) For the weak of his faith, the misery of life did not stop him from regretting his fate, and finally led him to disbelief: Humans are not tired of asking for good, and when disaster strikes, they give up and despair. (Fushshilat \/ 41: 49) It is clear that both pleasure and hardship are tests of God. Life is not a benchmark that God loves, and life is not a benchmark that God hates. It could mean, instead, that the pleasures of life are given by God as a test so that the person becomes more vulnerable to disobedience. Difficulty in life is the way to happiness in the hereafter when the person resolutely accepts it. It is a condition that many people do not know or do not understand, including by the leaders of the Meccans.",
      "text_tafsir": "Pada ayat ini, Allah meminta Nabi Muhammad menegaskan kepada pemuka-pemuka kafir Mekah bahwa yang melapangkan rezeki seseorang dan membatasi rezeki adalah Allah. Hal itu untuk menolak pandangan orang kafir di atas bahwa keberuntungan hidup di dunia adalah tanda kesayangan Allah dan kesengsaraan adalah tanda kebencian-Nya. \n\nAllah melapangkan atau membatasi rezeki seseorang sesuai dengan kebijaksanaan-Nya. Allah melapangkan rezeki seseorang mungkin karena dipercayai-Nya sehingga mampu mengeluarkan sebagian kekayaannya untuk mereka yang berkekurangan, sebagaimana dinyatakan ayat:\n\nSungguh, manusia diciptakan bersifat suka mengeluh. Apabila dia ditimpa kesusahan dia berkeluh kesah, dan apabila mendapat kebaikan (harta) dia jadi kikir, kecuali orang-orang yang melaksanakan salat, mereka yang tetap setia melaksanakan salatnya, dan orang-orang yang dalam hartanya disiapkan bagian tertentu, bagi orang (miskin) yang meminta dan yang tidak meminta, (al-Ma'arij\/70: 19-25)\n\nBagi mereka yang kafir, harta yang melimpah dan keturunan yang banyak dan berhasil justru untuk dijadikan Allah sebagai alasan untuk menghukum mereka. Penyebabnya adalah karena cara memperoleh dan menggunakan kekayaan serta pendidikan keturunan itu tidak sesuai dengan ketentuan Allah, sebagaimana dinyatakan ayat:\n\nMaka janganlah harta dan anak-anak mereka membuatmu kagum. Sesungguhnya maksud Allah dengan itu adalah untuk menyiksa mereka dalam kehidupan dunia dan kelak akan mati dalam keadaan kafir. (at-Taubah\/9: 55) \n\nSebaliknya, Allah pulalah yang membatasi rezeki seseorang. Bagi yang beriman berkurangnya harta benda, anggota keluarga, dan makanan adalah untuk menguji kesabaran mereka. Bila mereka sabar, Allah akan membahagiakan mereka di dunia dan di akhirat, sebagaimana firman-Nya:\n\nDan Kami pasti akan menguji kamu dengan sedikit ketakutan, kelaparan, kekurangan harta, jiwa, dan buah-buahan. Dan sampaikanlah kabar gembira kepada orang-orang yang sabar. (al-Baqarah\/2: 155)\n\nBagi yang tidak kuat imannya, kesengsaraan hidup membuatnya tidak berhenti menyesali nasib, dan akhirnya membawanya kepada kekafiran:\n\nManusia tidak jemu memohon kebaikan, dan jika ditimpa malapetaka, mereka berputus asa dan hilang harapannya. (Fushshilat\/41: 49)\n\nJelaslah bahwa baik kesenangan maupun kesusahan hidup adalah ujian dari Allah. Kesenangan hidup bukanlah tolok ukur bahwa Allah menyayangi, dan kesempitan hidup bukan pula tolok ukur bahwa Allah membenci. Bisa berarti sebaliknya, bahwa kesenangan hidup diberikan Allah sebagai ujian sehingga orang itu semakin terperosok dalam keingkaran. Kesempitan hidup adalah jalan untuk memperoleh kebahagiaan di akhirat bila orang itu tabah menerimanya. Ketentuan itulah yang tidak diketahui atau tidak dipahami oleh banyak orang, termasuk oleh pemuka kaum kafir Mekah.",
      "text_translation": "Katakanlah, “Sungguh, Tuhanku melapangkan rezeki bagi siapa yang Dia kehendaki dan membatasinya (bagi siapa yang Dia kehendaki), tetapi kebanyakan manusia tidak mengetahui.”",
      "text": "قُلْ اِنَّ رَبِّيْ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ وَيَقْدِرُ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ ࣖ",
      "text_translation_en": "Say: “Behold, my Sustainer grants abundant sustenance, or gives it in scant measure, unto whomever He wills: but most men do not understand [God’s ways].”",
      "juz_number": 22
    },
    "37": {
      "text_tafsir_en": "In this verse it is pointed out to the disbelievers of Mecca that it is not property and descent that can draw people to God and obtain His love, but faith and charity. Wealth and descent are only useful as we strengthen faith and increase charity. Therefore, property must be acquired properly and used properly. Descendants must be well-educated to be good descendants. Thus, the means of drawing closer to God and gaining His love is a property acquired and used properly, and a well-educated lineage that will preserve and further its faith and righteousness. In another verse, God asks believers to find a way to draw closer to Him, and the way is to righteous deeds: O believers! Fear Allah and look for the way to draw closer to Him, and fight (fight) in His way, that you may prosper. (al-Ma'idah. \/ 35: 35) Only those who believe and have many good deeds will be rewarded with double rewards by God. In other verses it is stated that the multiplication is at least ten times (al-An'am \/ 6: 160), and there are seven hundred times (al-Baqarah \/ 2: 261). Those who have been given heaven feel safe, free from the threat of hell. Moreover, they are happy and happy because God loves them and they love Him. Allah says: Allah says, \"This is the time when the righteous will benefit from his righteousness. great. \" (al-Ma'idah. \/ 5: 119)",
      "text_tafsir": "Pada ayat ini ditegaskan kepada pemuka kafir Mekah bahwa bukan harta benda dan keturunan yang dapat mendekatkan diri manusia kepada Allah dan memperoleh kasih sayang-Nya, tetapi iman dan amal saleh. Harta benda dan keturunan itu hanya bermanfaat bila menambah kuat iman dan memperbanyak amal. Oleh karena itu, harta benda harus diperoleh dengan benar dan dipergunakan dengan benar pula. Keturunan harus dididik dengan baik sehingga menjadi keturunan yang baik pula. Dengan demikian, sarana untuk mendekatkan diri kepada Allah dan memperoleh kasih sayang-Nya adalah harta yang diperoleh dan digunakan dengan benar, dan keturunan yang dididik dengan baik yang akan melestarikan dan melanjutkan iman dan amal salehnya.\n\nDalam ayat lain, Allah memang meminta orang yang beriman agar mencari jalan untuk mendekatkan diri kepada-Nya, dan caranya adalah dengan amal saleh:\n\nWahai orang-orang yang beriman! Bertakwalah kepada Allah dan carilah wasilah (jalan) untuk mendekatkan diri kepada-Nya, dan berjihadlah (berjuanglah) di jalan-Nya, agar kamu beruntung. (al-Ma'idah.\/5: 35)\n\nHanya orang-orang yang beriman dan banyak amal salehnya yang akan diberi balasan pahala yang berlipat ganda oleh Allah. Dalam ayat-ayat lain disebutkan bahwa pelipatgandaan itu minimal sepuluh kali (al-An'am\/6: 160), dan ada yang tujuh ratus kali lipat (al-Baqarah\/2: 261).\n\nMereka yang diberi surga itu merasa aman, yaitu bebas dari ancaman neraka. Lebih dari itu, mereka puas dan bahagia karena Allah mencintai mereka dan mereka pun mencintai-Nya. Allah berfirman:\n\nAllah berfirman, \"Inilah saat orang yang benar memperoleh manfaat dari kebenarannya. Mereka memperoleh surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya selama-lamanya. Allah rida kepada mereka dan mereka pun rida kepada-Nya. Itulah kemenangan yang agung.\" (al-Ma'idah.\/5: 119)",
      "text_translation": "Dan bukanlah harta atau anak-anakmu yang mendekatkan kamu kepada Kami; melainkan orang-orang yang beriman dan mengerjakan kebajikan, mereka itulah yang memperoleh balasan yang berlipat ganda atas apa yang telah mereka kerjakan; dan mereka aman sentosa di tempat-tempat yang tinggi (dalam surga).",
      "text": "وَمَآ اَمْوَالُكُمْ وَلَآ اَوْلَادُكُمْ بِالَّتِيْ تُقَرِّبُكُمْ عِنْدَنَا زُلْفٰىٓ اِلَّا مَنْ اٰمَنَ وَعَمِلَ صَالِحًاۙ فَاُولٰۤىِٕكَ لَهُمْ جَزَاۤءُ الضِّعْفِ بِمَا عَمِلُوْا وَهُمْ فِى الْغُرُفٰتِ اٰمِنُوْنَ ",
      "text_translation_en": "For, it is neither your riches nor your children that can bring you nearer to Us: only he who attains to faith and does what is right and just [comes near unto Us]; and it is [such as] these whom multiple recompense awaits for all that they have done; and it is they who shall dwell secure in the mansions [of paradise] –",
      "juz_number": 22
    },
    "38": {
      "text_tafsir_en": "God then explained about the unbelievers. They try to undermine Allah's revelations. The point is that they are always trying to thwart the mission of Islam so that people do not know, believe, and apply Islamic teachings well. They will be cast into hell and severely punished, as stated in another verse: (that is) those who obstruct from the way of Allah and desire that the path be crooked. And they are those who do not believe in the hereafter. They cannot prevent (the torment of Allah) on earth, and there will be no help for them other than Allah. The doom is multiplied to them. They cannot hear (the truth) nor can they see. (Hud \/ 11: 19-20)",
      "text_tafsir": "Selanjutnya Allah menjelaskan tentang orang-orang yang tidak beriman. Mereka itu berusaha melemahkan ayat-ayat Allah. Yang dimaksud adalah bahwa mereka selalu berusaha menggagalkan misi Islam sehingga manusia tidak mengenal, meyakini, dan melaksanakan ajaran-ajaran Islam dengan baik. Mereka itu akan dimasukkan ke dalam neraka dan diazab dengan dahsyat, sebagaimana dinyatakan dalam ayat lain:\n\n(yaitu) mereka yang menghalangi dari jalan Allah dan menghendaki agar jalan itu bengkok. Dan mereka itulah orang yang tidak percaya adanya hari akhirat. Mereka tidak mampu menghalangi (siksaan Allah) di bumi, dan tidak akan ada bagi mereka penolong selain Allah. Azab itu dilipatgandakan kepada mereka. Mereka tidak mampu mendengar (kebenaran) dan tidak dapat melihat(nya). (Hud\/11: 19-20)",
      "text_translation": "Dan orang-orang yang berusaha menentang ayat-ayat Kami untuk melemahkan (menggagalkan azab Kami), mereka itu dimasukkan ke dalam azab.",
      "text": "وَالَّذِيْنَ يَسْعَوْنَ فِيْٓ اٰيٰتِنَا مُعٰجِزِيْنَ اُولٰۤىِٕكَ فِى الْعَذَابِ مُحْضَرُوْنَ ",
      "text_translation_en": "whereas all who strive against Our messages, seeking to defeat their purpose, shall be given over to suffering.",
      "juz_number": 22
    },
    "39": {
      "text_tafsir_en": "In this verse it is reiterated that it is Allah who makes provision or limits it. In contrast to verse 36, in this verse it is asserted that His provision or limitation is the provision of His servants. It means that a servant of God will accept the provision of his provision whether extended or limited by God. Thus this verse argues once again that the provision of sustenance is a sign of God's love and its limitations indicate that God hates it. A servant of God will be patient when his provisions are limited. A servant of God, when his sustenance is more favorable to others in need. It will not include a religious liar or a later day, as the following verse states: Do you know (people) who reject religion? So it is he who rebukes the orphan, and does not encourage the feeding of the poor. (al-Ma'un \/ 107: 1-3) Helping others, based on this verse, instead of retaining their wealth instead of spending it. Helping others will not make us poor, but vice versa because it means empowering people. The freedom of the masses will bring prosperity, but the exploitation of the society will cause the society to fail. The Messenger of Allah (may peace be upon him) said that those who help others pray for the angels to increase their provision, and those who think the angels pray for the loss of their property: Every morning two angels come down to the servant of God, one praying, \"O Allah, give to the one who have fun. \" And the other prayed, \"O God, destroy the wealth of the unwary.\" (History of al-Bukhari and Muslim from Abu Hurairah)",
      "text_tafsir": "Dalam ayat ini ditegaskan sekali lagi bahwa Allah-lah yang melapangkan rezeki atau membatasinya. Berbeda dengan ayat 36, dalam ayat ini ditegaskan bahwa yang dilapangkan rezekinya atau dibatasi-Nya adalah rezeki hamba-hamba-Nya. Berarti bahwa seorang hamba Allah akan menerima ketentuan rezekinya apakah dilapangkan atau dibatasi oleh Allah. Dengan demikian ayat ini membantah sekali lagi bahwa kelapangan rezeki itu adalah tanda Allah sayang dan keterbatasannya menandakan Allah benci. Seorang hamba Allah akan sabar bila rezekinya terbatas. Seorang hamba Allah, bila rezekinya lebih akan memperhatikan orang lain yang kekurangan. Ia tidak akan termasuk pendusta agama atau hari kemudian, sebagaimana dinyatakan ayat berikut:\n\nTahukah kamu (orang) yang mendustakan agama? Maka itulah orang yang menghardik anak yatim, dan tidak mendorong memberi makan orang miskin. (al-Ma'un\/107: 1-3)\n\nMembantu orang lain, berdasarkan ayat ini, justru akan mengekalkan kekayaan itu, bukan menghabiskannya. Membantu orang lain tidak akan membuat kita miskin, bahkan sebaliknya karena bantuan itu berarti memberdayakan orang banyak. Keberdayaan orang banyak akan membuahkan kemakmuran, sebaliknya eksploitasi masyarakat akan membuat masyarakat itu melarat. Rasulullah menginformasikan bahwa orang yang membantu orang lain didoakan oleh malaikat pertambahan rezekinya, dan orang yang kikir didoakan oleh malaikat kehilangan harta bendanya:\n\nPada setiap pagi ada dua malaikat yang turun kepada hamba Allah, yang satu berdoa, \"Ya Allah, berikanlah ganti kepada orang yang berinfak.\" Dan yang satu lagi berdoa pula, \"Ya Allah, musnahkanlah harta orang yang tidak mau berinfak.\" (Riwayat al-Bukhari dan Muslim dari Abu Hurairah)",
      "text_translation": "Katakanlah, “Sungguh, Tuhanku melapangkan rezeki dan membatasinya bagi siapa yang Dia kehendaki di antara hamba-hamba-Nya.” Dan apa saja yang kamu infakkan, Allah akan menggantinya dan Dialah pemberi rezeki yang terbaik.",
      "text": "قُلْ اِنَّ رَبِّيْ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ مِنْ عِبَادِهٖ وَيَقْدِرُ لَهٗ  ۗوَمَآ اَنْفَقْتُمْ مِّنْ شَيْءٍ فَهُوَ يُخْلِفُهٗ ۚوَهُوَ خَيْرُ الرّٰزِقِيْنَ ",
      "text_translation_en": "Say: “Behold, my Sustainer grants abundant sustenance, or gives it in scant measure, unto whomever He wills of His servants; and whatever it be that you spend on others, He [always] replaces it: for He is the best of providers.”",
      "juz_number": 22
    },
    "40": {
      "text_tafsir_en": "In this verse, God explains that on the Day of Resurrection all people will be gathered before God to take responsibility for their actions. At that time, heathen worshipers other than Allah will be found by their worship of the world. To the worshipers, God asks if they have ever asked people to worship him. Among those questioned were angels, because in the world there was a man who worshiped them. There are some who view these angels as daughters of God who, by their very nature, will always love their children even when they are guilty. That's why they worship it. Allah says: And they make the angels of the Most Merciful (kind) servants of women. Do they witness the creation (angels)? Later, their testimony will be written down and responsibility will be demanded. And they say, \"If the Most Merciful (Allah) would, we would not worship them.\" They have little knowledge of it. They are nothing but speculation. (az-Zukhruf \/ 43: 19-20) The angel and his worshipers were found not because God did not know the true events, but to show the worshipers themselves that they were wrong.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan bahwa pada hari Kiamat nanti semua manusia dikumpulkan di hadapan Allah untuk mempertanggungjawabkan perbuatan mereka. Pada saat itu, orang-orang kafir yang menyembah selain Allah akan dipertemukan dengan sembahan-sembahan mereka di dunia. Kepada yang disembah, Allah bertanya apakah mereka dulu pernah meminta manusia untuk menyembahnya. Di antara yang ditanya itu adalah malaikat, karena sewaktu di dunia ada manusia yang menyembah mereka. Manusia ada yang memandang para malaikat itu sebagai anak-anak perempuan Allah, yang karena sifat keibuannya, akan selalu menyayangi anak-anaknya sekalipun bersalah. Karena itulah mereka menyembahnya. Allah berfirman:\n\nDan mereka menjadikan malaikat-malaikat hamba-hamba (Allah) Yang Maha Pengasih itu sebagai jenis perempuan. Apakah mereka menyaksikan penciptaan (malaikat-malaikat itu)? Kelak akan dituliskan kesaksian mereka dan akan dimintakan pertanggungjawaban. Dan mereka berkata, \"Sekiranya (Allah) Yang Maha Pengasih menghendaki, tentulah kami tidak me-nyembah mereka (malaikat).\" Mereka tidak mempunyai ilmu sedikit pun tentang itu. Tidak lain mereka hanyalah menduga-duga belaka. (az-Zukhruf\/43: 19-20)\n\nMalaikat dengan para penyembahnya itu dipertemukan bukan karena Allah tidak tahu peristiwa yang sebenarnya, tetapi untuk memperlihatkan sendiri kepada penyembah-penyembah itu bahwa mereka salah.",
      "text_translation": "Dan (ingatlah) pada hari (ketika) Allah mengumpulkan mereka semuanya kemudian Dia berfirman kepada para malaikat, “Apakah kepadamu mereka ini dahulu menyembah?”",
      "text": "وَيَوْمَ يَحْشُرُهُمْ جَمِيْعًا ثُمَّ يَقُوْلُ لِلْمَلٰۤىِٕكَةِ اَهٰٓؤُلَاۤءِ اِيَّاكُمْ كَانُوْا يَعْبُدُوْنَ ",
      "text_translation_en": "And [as for those who now deny the truth,] one Day He will gather them all together, and will ask the angels, “Was it you that they were wont to worship?”",
      "juz_number": 22
    },
    "41": {
      "text_tafsir_en": "The angels answered that they had never asked for it, and they even purified God by worshiping Him besides Him. They themselves seek Allah and seek His protection, so how can they ask men to worship Him? They explain that the one who always misleads people is the genie or the devil. Thus, humans are actually mistaken when they think that they worship angels, because what they worship is a genie or a demon. Most people who worship the genie or the devil actually believe that it is the genie or demon that determines the life of the human being to fulfill it. In another verse it is explained that among the ones God asked if he ever asked people to worship him was Jesus as He also confessed that he instead asked them to worship God, as the following verse states: And (remember) when Allah said, \" Jesus, the son of Mary, the one who said to the people, \"Make me and my mother two gods besides God.\" (Jesus) said, \"Your holiness, it is not right for me to say what is not mine. If I had said it, you would have known it. You would know what is in me and I would not know what is yours. Knowing everything that is magical. \" I never said to them except what You commanded me to do, \"Worship God, my Lord and your Lord,\" and I was a witness to them, while I was with them. So after You forgive me, You are watching over them. And You are the All-Seeing of all things. (al-Ma'idah. \/ 5: 116-117)",
      "text_tafsir": "Para malaikat itu menjawab bahwa mereka tidak pernah meminta demikian, bahkan mereka menyucikan Allah dari adanya sembahan-sembahan selain-Nya. Mereka sendiri mempertuhankan Allah dan memohon perlindungan dari-Nya, sehingga bagaimana mungkin mereka meminta manusia untuk menyembahnya. Mereka menjelaskan bahwa yang selalu menyesatkan manusia adalah jin atau setan. Dengan demikian, manusia sesungguhnya keliru ketika menyangka bahwa mereka menyembah malaikat, karena yang mereka sembah adalah jin atau setan. Sebagian besar manusia yang menyembah jin atau setan itu benar-benar percaya bahwa jin atau setan itulah yang menentukan kehidupan manusia sehingga mempertuhankannya. \n\nDi dalam ayat lain diterangkan bahwa di antara yang ditanya Allah apakah ia pernah meminta manusia untuk menyembahnya adalah Nabi Isa a.s. Beliau pun mengingkarinya seraya menegaskan bahwa ia justru meminta mereka untuk menyembah Allah, sebagaimana diungkapkan ayat berikut:\n\nDan (ingatlah) ketika Allah berfirman, \"Wahai Isa putra Maryam! Engkaukah yang mengatakan kepada orang-orang, jadikanlah aku dan ibuku sebagai dua tuhan selain Allah?\" (Isa) menjawab, \"Mahasuci Engkau, tidak patut bagiku mengatakan apa yang bukan hakku. Jika aku pernah mengatakannya tentulah Engkau telah mengetahuinya. Engkau mengetahui apa yang ada pada diriku dan aku tidak mengetahui apa yang ada pada-Mu. Sungguh, Engkaulah Yang Maha Mengetahui segala yang gaib.\" Aku tidak pernah mengatakan kepada mereka kecuali apa yang Engkau perintahkan kepadaku (yaitu), \"Sembahlah Allah, Tuhanku dan Tuhanmu,\" dan aku menjadi saksi terhadap mereka, selama aku berada di tengah-tengah mereka. Maka setelah Engkau mewafatkan aku, Engkaulah yang mengawasi mereka. Dan Engkaulah Yang Maha Menyaksikan atas segala sesuatu. (al-Ma'idah.\/5: 116-117)",
      "text_translation": "Para malaikat itu menjawab, “Mahasuci Engkau. Engkaulah pelindung kami, bukan mereka; bahkan mereka telah menyembah jin; kebanyakan mereka beriman kepada jin itu.”",
      "text": "قَالُوْا سُبْحٰنَكَ اَنْتَ وَلِيُّنَا مِنْ دُوْنِهِمْ ۚبَلْ كَانُوْا يَعْبُدُوْنَ الْجِنَّ اَكْثَرُهُمْ بِهِمْ مُّؤْمِنُوْنَ ",
      "text_translation_en": "They will answer: “Limitless art Thou in Thy glory! Thou [alone] art close unto us, not they! Nay, [when they thought that they were worshipping us,] they were but [blindly] worshipping forces concealed from their senses; most of them believed in them.”",
      "juz_number": 22
    },
    "42": {
      "text_tafsir_en": "On that day Mahsyar Allah stated that neither those who worship other than Allah nor those who are worshiped will be able to do anything, both beneficial and detrimental to others. Unbelievers who worship other than Allah will not get help from those they worship, because those who are worshiped are indeed unable to do anything. Those who worship also cannot blame those who are worshiped, because those who are worshiped never ask them to worship. In the Qur'an it is stated that anyone will not be able to help anyone, including family or close friends, as Allah says: On that day man runs away from his brother, and from his mother and father, and from his wife and children. Everyone of them on that day had a busy business. ('Abasa \/ 80: 34-37) Also his word: And no close friend asks his friend. (al-Ma'arij \/ 70: 10) They will be dragged and thrown into hell and further humiliated with the words, \"Feel the punishment of hell that you did not believe in!\" These words mean that they are blamed for not believing in hell at this time in the world, which will make them more miserable. These words also mean that the punishment of hell is terrible. Thus is the reward for those who do not heed the invitation of the Prophet. Submission of the event in the Qur'an aims at the Meccan infidel leaders, and anyone thereafter, to have faith so that the event will not befall them later.",
      "text_tafsir": "Pada hari Mahsyar itu Allah menyatakan bahwa baik yang menyembah selain Allah maupun yang disembah tidak akan bisa berbuat apa-apa, baik yang menguntungkan maupun yang merugikan yang lain. Orang-orang kafir yang menyembah selain Allah itu tidak akan memperoleh pertolongan dari yang mereka sembah, karena yang disembah itu memang tidak mampu berbuat apa-apa. Orang yang menyembah itu juga tidak akan bisa menyalahkan yang disembah, karena yang disembah itu tidak pernah meminta mereka menyembahnya. \n\nDalam Al-Qur'an dinyatakan bahwa siapa pun tidak akan bisa menolong siapa pun, termasuk keluarga atau teman dekat, sebagaimana firman Allah:\n\nPada hari itu manusia lari dari saudaranya, dan dari ibu dan bapaknya, dan dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. ('Abasa\/80: 34-37)\n\nJuga firman-Nya:\n\nDan tidak ada seorang teman karib pun menanyakan temannya. (al-Ma'arij\/70: 10) \n\nMereka akan diseret dan dijebloskan ke dalam neraka dan tambah dihinakan lagi dengan kata-kata, \"Rasakan azab neraka yang dulu kalian tidak percayai!\" Kata-kata itu berarti bahwa mereka disalahkan karena tidak percaya adanya neraka pada waktu di dunia, yang akan membuat mereka lebih tersiksa. Kata-kata itu juga berarti bahwa azab neraka itu adalah dahsyat. \n\nDemikianlah balasan bagi orang-orang yang tidak mengindahkan ajakan Rasulullah saw. Penyampaian peristiwa itu di dalam Al-Qur'an bertujuan agar para pemimpin kafir Mekah, dan siapa saja sesudahnya, untuk beriman sehingga peristiwa itu nanti tidak menimpa mereka.",
      "text_translation": "Maka pada hari ini sebagian kamu tidak kuasa (mendatangkan) manfaat maupun (menolak) mudarat kepada se-bagian yang lain. Dan Kami katakan kepada orang-orang yang zalim, “Rasakanlah olehmu azab neraka yang dahulu kamu dustakan.”",
      "text": "فَالْيَوْمَ لَا يَمْلِكُ بَعْضُكُمْ لِبَعْضٍ نَّفْعًا وَّلَا ضَرًّا ۗوَنَقُوْلُ لِلَّذِيْنَ ظَلَمُوْا ذُوْقُوْا عَذَابَ النَّارِ الَّتِيْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ ",
      "text_translation_en": "And [on that Day God will say]: “None of you [created beings] has today any power to benefit or to harm another!” And [then] We shall say unto those who had been bent on evildoing: “Taste [now] that suffering through fire which you were wont to call a lie!”",
      "juz_number": 22
    },
    "43": {
      "text_tafsir_en": "In this verse are explained two further charges of the infidelity of the Meccans against Islam. First, he accused the Prophet Muhammad of being a mere human who passed on to them the verses of the Qur'an with the purpose of preventing them from practicing the religion of their ancestors. In other words, the Prophet Muhammad was only a human being, not an angel, and had no privileges in the form of wealth, and so on. The purpose of Prophet Muhammad was to distance them from the religion of their ancestors. Thus, they view the religion of their ancestors as better than the religion that Prophet Muhammad saw. Second, they accuse the Qur'an of being a lie. The Qur'an is only made by Muhammad, not the revelation of Allah Almighty, and its contents are not true. On the other hand, they see the fact that many people are interested in the Qur'an. Even when they read or read the verses of the Qur'an, they are also interested. When looking at the contents of the Qur'an, they believe that it is not possible that Muhammad made it because he did not study it and could not read it. They became aware that their accusations against the Qur'an were false. The statement required them to look for another reason. In the end, they claim the Qur'an is magic, and because of its incredible influence, they consider its magic to be extraordinary. Such is the nature of the disbelievers, when they can no longer dispute the truth of the Qur'an, they ridicule it and look for other absurd reasons, as Allah says: And when they see a sign of Allah, they mock . And they said, \"This is nothing but real magic.\" (Ash-shaffat \/ 37: 14-15) His Word also says: And if they (signs) see a sign, they turn and say, \"(This is) continuous magic.\" (Al-Qamar \/ 54: 2)",
      "text_tafsir": "Pada ayat ini dijelaskan dua tuduhan lebih lanjut pemuka kaum kafir Mekah terhadap Islam. Pertama, menuduh Nabi Muhammad hanyalah seorang manusia biasa yang menyampaikan ayat-ayat Al-Qur'an kepada mereka dengan maksud menghalangi mereka menjalankan agama syirik yang diwarisi dari nenek moyang mereka. Maksudnya, Nabi Muhammad saw hanya manusia biasa, bukan malaikat, dan tidak memiliki keistimewaan berupa kekayaan, dan sebagainya. Tujuan Nabi Muhammad hanyalah menjauhkan mereka dari agama nenek moyang mereka. Dengan demikian, mereka memandang agama nenek moyang mereka itu lebih baik daripada agama yang dibawa Nabi Muhammad saw. \n\nKedua, mereka menuduh Al-Qur'an sebagai suatu kebohongan yang dibuat-buat. Al-Qur'an itu hanyalah buatan Muhammad saw, bukan wahyu dari Allah swt, dan isinya tidak benar.\n\nDi sisi lain, mereka melihat kenyataan bahwa banyak manusia yang tertarik pada Al-Qur'an. Mereka sendiri pun ketika membaca atau dibacakan ayat-ayat Al-Qur'an juga merasa tertarik. Ketika melihat kandungan Al-Qur'an, mereka yakin bahwa itu tidak mungkin buatan Muhammad karena ia tidak belajar kepada siapa pun dan tidak bisa pula tulis baca. Mereka menjadi sadar bahwa tuduhan mereka terhadap Al-Qur'an itu salah. Kenyataan itu menghendaki mereka untuk mencari alasan lain. Akhirnya, mereka menuduh Al-Qur'an adalah sihir, dan karena pengaruhnya yang luar biasa, mereka menganggap sihirnya itu luar biasa hebatnya. Begitulah sifat orang kafir, ketika mereka tidak mampu lagi membantah kebenaran Al-Qur'an, mereka mencercanya dan mencari-cari alasan lain yang tak masuk akal, sebagaimana Allah berfirman:\n\nDan apabila mereka melihat suatu tanda (kebesaran) Allah, mereka memperolok-olokkan. Dan mereka berkata, \"Ini tidak lain hanyalah sihir yang nyata. (ash-shaffat\/37: 14-15)\n\nFirman-Nya juga:\n\nDan jika mereka (orang-orang musyrik) melihat suatu tanda (mukjizat), mereka berpaling dan berkata, \"(Ini adalah) sihir yang terus-menerus.\" (al-Qamar\/54: 2)",
      "text_translation": "Dan apabila dibacakan kepada mereka ayat-ayat Kami yang terang, mereka berkata, “Orang ini tidak lain hanya ingin menghalang-halangi kamu dari apa yang disembah oleh nenek moyangmu,” dan mereka berkata, “(Al-Qur'an) ini tidak lain hanyalah kebohongan yang diada-adakan saja.” Dan orang-orang kafir berkata terhadap kebenaran ketika kebenaran (Al-Qur'an) itu datang kepada mereka, “Ini tidak lain hanyalah sihir yang nyata.”",
      "text": "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ قَالُوْا مَا هٰذَآ اِلَّا رَجُلٌ يُّرِيْدُ اَنْ يَّصُدَّكُمْ عَمَّا كَانَ يَعْبُدُ اٰبَاۤؤُكُمْ ۚوَقَالُوْا مَا هٰذَآ اِلَّآ اِفْكٌ مُّفْتَرًىۗ وَقَالَ الَّذِيْنَ كَفَرُوْا لِلْحَقِّ لَمَّا جَاۤءَهُمْۙ اِنْ هٰذَآ اِلَّا سِحْرٌ مُّبِيْنٌ ",
      "text_translation_en": "For [thus it is:] whenever Our messages are conveyed unto them in all their clarity, they [who are bent on denying the truth] say [to one another], “This [Muhammad] is nothing but a man who wants to turn you away from what your forefathers were wont to worship!” And they say, “This [Qur’an] is nothing but a falsehood invented [by man]!” And [finally,] they who are bent on denying the truth speak thus of the truth when it comes to them: “This is clearly nothing but spellbinding eloquence!”",
      "juz_number": 22
    },
    "44": {
      "text_tafsir_en": "God denied the accusations of the Meccans for two reasons. First, the religion of their ancestors was not based on a scripture from God; and second, that religion was not taught by His prophet. True religion should have the scriptures as the basis for teaching, since the human mind is not guaranteed its truth. Allah said: Or have We ever given them a book, and they cling to it? (az-Zukhruf \/ 43: 21) In addition to the scriptures, religion must have a prophet sent by God to receive and teach the contents of the scriptures. Allah says: Or have We sent down to them a revelation, which explains (just) what they (often) associate with God? (ar-Romans \/ 35: 35) The shirk of the pagan ancestors of the Meccans had no basis in scripture and was not taught by a prophet of God. Therefore, the religion is wrong, and they should not follow the wrong religion. The true religion is Islam because it is based on the revelation of Allah which is the Qur'an and is conveyed by a prophet, Muhammad. They practically accept the religion that the Prophet Muhammad brought.",
      "text_tafsir": "Allah membantah tuduhan kaum kafir Mekah itu dengan dua alasan. Pertama, agama syirik dari nenek moyang mereka itu tidaklah berdasar suatu kitab suci dari Allah; dan kedua, agama itu tidak diajarkan oleh nabi-Nya. Agama yang benar haruslah mempunyai kitab suci sebagai landasan ajaran, karena pikiran manusia tidak terjamin kebenarannya. Allah berfirman:\n\nAtau apakah pernah Kami berikan sebuah kitab kepada mereka sebelumnya, lalu mereka berpegang (pada kitab itu)? (az-Zukhruf\/43: 21)\n\nDi samping kitab suci, agama harus mempunyai seorang nabi yang diutus Allah untuk menerima dan mengajarkan isi kitab suci itu. Allah berfirman:\n\nAtau pernahkah Kami menurunkan kepada mereka keterangan, yang menjelaskan (membenarkan) apa yang (selalu) mereka persekutukan dengan Tuhan? (ar-Rum\/30: 35)\n\nAgama syirik nenek moyang kaum kafir Mekah itu tidak mempunyai dasar kitab suci dan tidak diajarkan seorang nabi dari Allah. Oleh karena itu, agama tersebut salah, dan mereka tidak patut mengikuti agama yang salah itu. Agama yang benar adalah Islam karena berdasarkan wahyu dari Allah yaitu Al-Qur'an dan disampaikan oleh seorang nabi yaitu Muhammad saw. Mereka seyogyanya menerima agama yang dibawa Nabi Muhammad tersebut.",
      "text_translation": "Dan Kami tidak pernah memberikan kepada mereka kitab-kitab yang mereka baca dan Kami tidak pernah mengutus seorang pemberi peringatan kepada mereka sebelum engkau (Muhammad).",
      "text": "وَمَآ اٰتَيْنٰهُمْ مِّنْ كُتُبٍ يَّدْرُسُوْنَهَا وَمَآ اَرْسَلْنَآ اِلَيْهِمْ قَبْلَكَ مِنْ نَّذِيْرٍۗ ",
      "text_translation_en": "And yet, [O Muhammad,] never have We vouchsafed them any revelations which they could quote, and neither have We sent unto them any warner before thee.",
      "juz_number": 22
    },
    "45": {
      "text_tafsir_en": "In this verse, God explains that the ancient nations, such as the people of Noah, the 'Ad, the Samaritans, and others, because of their unbelief, were destroyed by God and lived only in debris or names. They reject Allah's revelations and regard His apostles as false, but they are stronger and more powerful in their ability and culture. The infidels of Mecca are not able to make a tenth of those people, so will they rebel and boast themselves? Do they not fear the wrath of God, remembering that the more powerful nations have already been destroyed by God? They should have learned from the history of the past, because they knew the former territories well, as they passed day or night on their trade trips in summer or winter, as the word of God said: And verily ye (the people) Mecca) will go through them (in the morning), in the morning, and at night. Then why don't you understand? (ash-shaffat \/ 37: 137-138)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa umat-umat terdahulu, seperti kaum Nabi Nuh, kaum 'Ad, kaum Samud, dan lain-lain yang karena kekafiran mereka telah dimusnahkan Allah dan tinggal hanya puing-puing atau nama-nama. Mereka mendustakan ayat-ayat Allah dan menganggap rasul-rasul-Nya bohong, padahal mereka lebih perkasa dan lebih hebat kemampuan dan kebudayaan mereka. Kafir Mekah tidak sampai berkekuatan sepersepuluh dari umat-umat itu, lalu apakah mereka akan membangkang dan menyombongkan diri pula? Tidak takutkah mereka terhadap murka Allah, mengingat umat-umat terdahulu yang lebih perkasa saja sudah dimusnahkan Allah? Seharusnya mereka mengambil pelajaran dari sejarah masa lampau itu, karena mereka mengenal betul daerah-daerah bekas umat-umat terdahulu itu, sebab mereka melewatinya siang atau malam dalam perjalanan dagang mereka pada musim panas atau musim dingin, sebagaimana firman Allah:\n\nDan sesungguhnya kamu (penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka pada waktu pagi, dan pada waktu malam. Maka mengapa kamu tidak mengerti? (ash-shaffat\/37: 137-138)",
      "text_translation": "Dan orang-orang yang sebelum mereka telah mendustakan (para rasul) sedang orang-orang (kafir Mekah) itu belum sampai menerima sepersepuluh dari apa yang telah Kami berikan kepada orang-orang terdahulu itu namun mereka mendustakan para rasul-Ku. Maka (lihatlah) bagaimana dahsyatnya akibat kemurkaan-Ku.",
      "text": "وَكَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْۙ وَمَا بَلَغُوْا مِعْشَارَ مَآ اٰتَيْنٰهُمْ فَكَذَّبُوْا رُسُلِيْۗ فَكَيْفَ كَانَ نَكِيْرِ ࣖ",
      "text_translation_en": "Thus, too, gave the lie to the truth [many of] those who lived before them; and although those [earlier people] had not attained to even a tenth of [the evidence of the truth] which We have vouch­safed unto these [late successors of theirs], yet when they gave the lie to My apostles, how awesome was My rejection!",
      "juz_number": 22
    },
    "46": {
      "text_tafsir_en": "In this verse, Allah asks the Prophet Muhammad to ask the unbelievers to do only one thing, that is, to really seek to draw closer to Allah to seek the truth. Approaching yourself to seek the truth can be done on your own or with others in order to change your mind. Thereafter, they were asked to reflect on the truth of the teachings of the Qur'an, calmly, objectively, and sincerely without being influenced by lust or malice. After they objectively pondered, would they still argue that those who conveyed the truth, the Prophet Muhammad, were not right? Isn't that what the Qur'an teaches? If so, the bearer is right. They should have come to the conclusion that he was in fact a sincere person. He just wants to remind and warn people not to get lost in the world and to lose it in the hereafter. He just wants people to believe and be good people, to be happy in the world and to avoid the hereafter. Therefore, they should thank him, and not accuse him of nothing. His function as a warner is also conveyed in a hadith: Verily I am the one who warns you before facing a severe punishment. (History of al-Bukhari by Ibn 'Abbas)",
      "text_tafsir": "Pada ayat ini, Allah meminta Nabi Muhammad agar mengajak kaum kafir untuk melakukan satu hal saja, yaitu benar-benar berupaya mendekatkan diri kepada Allah untuk mencari kebenaran. Mendekatkan diri untuk mencari kebenaran dapat dilakukan sendiri-sendiri atau bersama dengan orang lain supaya dapat bertukar pikiran. Setelah itu, mereka diminta untuk merenungkan kebenaran ajaran-ajaran dalam Al-Qur'an, secara tenang, objektif, dan tulus tanpa dipengaruhi hawa nafsu atau kedengkian. Setelah mereka renungkan secara objektif, masih jugakah mereka akan menuduh bahwa yang menyampaikan kebenaran itu, yaitu Nabi Muhammad, tidak benar? Bukankah ajaran Al-Qur'an itu amat benar? Bila benar, pembawa ajaran itu juga benar. Seharusnya mereka sampai kepada kesimpulan bahwa beliau sejatinya adalah seorang yang tulus. Ia hanya ingin mengingatkan dan memperingatkan manusia agar tidak sesat di dunia dan merugi nanti di akhirat. Beliau hanya ingin agar manusia beriman dan menjadi manusia yang baik, agar di dunia bahagia dan di akhirat terhindar dari neraka. Oleh karena itu, mereka seharusnya berterima kasih kepadanya, dan tidak menuduhnya yang bukan-bukan. \n\nFungsi beliau sebagai pemberi peringatan ini juga disampaikan beliau dalam sebuah hadis:\n\nSesungguhnya aku ini pemberi peringatan bagimu sekalian sebelum menghadapi azab yang keras. (Riwayat al-Bukhari dari Ibnu 'Abbas)",
      "text_translation": "Katakanlah, “Aku hendak memperingatkan kepadamu satu hal saja, yaitu agar kamu menghadap Allah (dengan ikhlas) berdua-dua atau sendiri-sendiri; kemudian agar kamu pikirkan (tentang Muhammad). Kawanmu itu tidak gila sedikit pun. Dia tidak lain hanyalah seorang pemberi peringatan bagi kamu sebelum (menghadapi) azab yang keras.”",
      "text": "۞ قُلْ اِنَّمَآ اَعِظُكُمْ بِوَاحِدَةٍۚ اَنْ تَقُوْمُوْا لِلّٰهِ مَثْنٰى وَفُرَادٰى ثُمَّ تَتَفَكَّرُوْاۗ مَا بِصَاحِبِكُمْ مِّنْ جِنَّةٍۗ اِنْ هُوَ اِلَّا نَذِيْرٌ لَّكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيْدٍ ",
      "text_translation_en": "Say: “I counsel you one thing only: Be [ever­ conscious of] standing before God, whether you are in the company of others or alone; and then bethink yourselves [that] there is no madness in [this pro­phet,] your fellow-man: he is only a warner to you of suffering severe to come.”",
      "juz_number": 22
    },
    "47": {
      "text_tafsir_en": "The prophet Muhammad was later asked by Allah to make clear to the unbelievers that he did not expect anything from his work to deliver the message. Even if they have a conscience, their desire is for them to believe. By faith, the benefits will come back to them, not to him. He only wants God's reward for his work, not worldly gain. That reward he hopes to receive in the hereafter, not in the world today. Then what else is the reason they didn't respond? If they do not want to believe, then they need to know that God is witnessing everything so that nothing is lost from His knowledge, whether it is real, such as evil deeds, or supernatural, such as unbelief. Therefore, to those who believe and do good, He will return to heaven, and to those who disbelieve and do evil He will reward them with hell.",
      "text_tafsir": "Nabi Muhammad selanjutnya diminta oleh Allah untuk menegaskan kepada kaum kafir bahwa beliau tidak mengharapkan pamrih apa-apa dari pekerjaannya menyampaikan dakwah. Kalaupun ada pamrihnya, maka keinginannya hanyalah agar mereka beriman. Dengan beriman, maka keuntungannya akan kembali kepada mereka juga, tidak kepadanya. Ia sendiri hanya mengharapkan pahala dari Allah atas pekerjaannya, bukan keuntungan duniawi. Pahala itu ia harapkan diterimanya nanti di akhirat, tidak di dunia sekarang ini. Lalu apa lagi alasan mereka tidak menerima seruannya? Bila mereka tidak juga mau beriman, maka mereka perlu mengetahui bahwa Allah menyaksikan segala sesuatu sehingga tidak ada yang luput dari pengetahuan-Nya, baik yang nyata, seperti perbuatan-perbuatan jahat, maupun yang gaib, seperti kekafiran. Oleh karena itu, bagi yang beriman dan berbuat baik akan dibalasi-Nya dengan surga, dan yang kafir dan berbuat jahat akan diganjari-Nya dengan neraka.",
      "text_translation": "Katakanlah (Muhammad), “Imbalan apa pun yang aku minta kepadamu, maka itu untuk kamu. Imbalanku hanyalah dari Allah, dan Dia Maha Mengetahui segala sesuatu.”",
      "text": "قُلْ مَا سَاَلْتُكُمْ مِّنْ اَجْرٍ فَهُوَ لَكُمْۗ اِنْ اَجْرِيَ اِلَّا عَلَى اللّٰهِ ۚوَهُوَ عَلٰى كُلِّ شَيْءٍ شَهِيْدٌ ",
      "text_translation_en": "Say: “No reward have I ever asked of you [out of anything] that is yours: my reward rests with none but God, and He is witness unto everything!”",
      "juz_number": 22
    },
    "48": {
      "text_tafsir_en": "Next, the Prophet Muhammad was asked by Allah to assure the unbelievers that Allah always sends the truth, that is to inculcate His revelation, into the hearts of His apostles. It is just as He says in another verse: (He is) the Most High of His degree, the Almighty, who decrees revelation by His command to whom He wills among His servants, to warn (men) of meeting day (Judgment Day). (al-Mu'min \/ 40: 15) Those are the people whom Allah has chosen. He knows who is right for him to choose. Thus, man has no authority to question it, as he says: And when a verse comes to them they say, \"We will not believe (before) it is given to us as it was given to the apostles of God.\" God knows best where He places His message. Sinners will suffer humiliation in the presence of Allah and a severe punishment for their deceit. (al-An'am \/ 6: 124) Since the revelation is from Allah and those who receive it are the elect, then the apostles must be right. So are the teachings he imparts, so that the people should not object to them.",
      "text_tafsir": "Selanjutnya Nabi Muhammad diminta oleh Allah menegaskan kepada kaum kafir bahwa Allah selalu melontarkan kebenaran, yaitu menanamkan wahyu-Nya, ke dalam hati para rasul-Nya. Hal itu juga sebagaimana difirmankan-Nya dalam ayat lain:\n\n(Dialah) Yang Mahatinggi derajat-Nya, yang memiliki Arsy, yang menurunkan wahyu dengan perintah-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya, agar memperingatkan (manusia) tentang hari pertemuan (hari Kiamat). (al-Mu'min\/40: 15)\n\nRasul-rasul itu adalah orang-orang yang dipilih Allah. Ia Maha Mengetahui siapa yang pantas untuk dipilih-Nya. Dengan demikian, manusia tidak berwenang mempersoalkannya, sebagaimana difirmankan-Nya:\n\nDan apabila datang suatu ayat kepada mereka, mereka berkata, \"Kami tidak akan percaya (beriman) sebelum diberikan kepada kami seperti apa yang diberikan kepada rasul-rasul Allah.\" Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan-Nya. Orang-orang yang berdosa, nanti akan ditimpa kehinaan di sisi Allah dan azab yang keras karena tipu daya yang mereka lakukan. (al-An'am\/6: 124)\n\nKarena wahyu itu dari Allah dan yang menerimanya adalah orang-orang yang terpilih, maka rasul-rasul itu pasti pula benar. Begitu juga ajaran-ajaran yang disampaikannya, sehingga manusia tidak selayaknya membantahnya.",
      "text_translation": "Katakanlah, “Sesungguhnya Tuhanku mewahyukan kebenaran. Dia Maha Mengetahui segala yang gaib.”",
      "text": "قُلْ اِنَّ رَبِّيْ يَقْذِفُ بِالْحَقِّۚ عَلَّامُ الْغُيُوْبِ ",
      "text_translation_en": "Say: “Verily, my Sustainer hurls the truth [against all that is false] He who fully knows all the things that are beyond the reach of a created being’s perception!”",
      "juz_number": 22
    },
    "49": {
      "text_tafsir_en": "Allah then asked the Prophet Muhammad to assure the unbelievers that the truth had come and that falsehood would not return. The meaning of truth here is Islam, while falsehood is infidelity. The truth is that when it comes, it will destroy it to the ground, as Allah says: Verily We cast the right (unrighteous) on the unjust (and the unrighteous), and that right shall be abolished; And woe to you because you are (Allah) in disguise (al-Anbiya '\/ 21: 18) Thus the vanity will vanish when the truth comes, and the truth will win the Word of Allah: And say, \" The truth has come, and the false are gone. \" Really, the vanity must have disappeared. (al-Isra '\/ 17: 81) The triumph of the truth will make the void appear, whether in a new form or a new form. Returning in a new form is the death of old vanity, replaced by another. Return to its original form, which is the resurrection of the dead dead. An example of the triumph of righteousness is the conquest of the city of Mecca where the Prophet Muhammad entered the Sacred Mosque and destroyed the idols that the infidels of Mecca surrounded and in the Kaaba. A hadith informs this: When the Prophet entered the Sacred Mosque on the day of the conquest of Mecca and found many idols all around the Kaaba, he stabbed one of them with his arrow and read, \"The true one has come and the false one have vanished, surely the vanity is a sure thing, \"and read this verse 49. (History of al-Bukhari and Muslim) After the massacre of the city of Mecca, tribes throughout the Arabian Peninsula declared their faith one by one. Then Islam continues to expand throughout the world, and will continue to prosper until the end of the day. Thus, the triumph of truth and the destruction of falsehood can only be realized through struggle, as Prophet Muhammad, his companions, and the leaders after their struggle. In the future, Islam must be right and unbelief must be wrong.",
      "text_tafsir": "Allah selanjutnya meminta Nabi Muhammad menegaskan kepada kaum kafir itu bahwa kebenaran telah datang dan kebatilan tidak akan kembali. Maksud kebenaran di sini adalah Islam, sedangkan kebatilan adalah kekafiran. \n\nKebenaran apabila sudah datang maka kebatilan itu akan dihancurkannya sampai lumat, sebagaimana firman Allah:\n\nSebenarnya Kami melemparkan yang hak (kebenaran) kepada yang batil (tidak benar) lalu yang hak itu menghancurkannya, maka seketika itu (yang batil) lenyap. Dan celaka kamu karena kamu menyifati (Allah dengan sifat-sifat yang tidak pantas bagi-Nya) (al-Anbiya'\/21: 18)\n\nDengan demikian kebatilan akan sirna bila datang kebenaran, dan kebenaran itu akan menang Firman Allah:\n\nDan katakanlah, \"Kebenaran telah datang dan yang batil telah lenyap.\" Sungguh, yang batil itu pasti lenyap. (al-Isra'\/17: 81)\n\nKemenangan kebenaran akan membuat kebatilan tidak akan muncul lagi, baik dalam bentuk baru atau bentuk semula. Kembali dalam bentuk baru yaitu matinya kebatilan yang lama digantikan kebatilan lainnya. Kembali dalam bentuk semula, yaitu hidupnya kembali kebatilan yang sudah mati itu. Contoh kemenangan kebenaran itu adalah penguasaan kota Mekah dimana Nabi Muhammad memasuki Masjidil Haram dan menghancurleburkan berhala-berhala yang ditempatkan kaum kafir Mekah di sekeliling dan di dalam Ka'bah. Sebuah hadis menginformasikan hal itu:\n\nKetika Rasulullah memasuki Masjidil Haram pada hari penaklukan Mekah dan menemukan banyak berhala terpancang di sekeliling Ka'bah, beliau menusuk satu berhala di antara berhala-berhala itu dengan ujung panahnya dan membaca, \"Yang benar telah datang dan yang batil telah lenyap, sesungguhnya yang batil itu sesuatu yang pasti lenyap,\" dan seterusnya membaca ayat 49 ini. (Riwayat al-Bukhari dan Muslim)\n\nSetelah pengislaman kota Mekah, suku-suku di seluruh Jazirah Arab menyatakan keislaman mereka satu demi satu. Kemudian Islam terus berkembang ke seluruh dunia, dan akan terus berjaya sampai hari kiamat. Dengan demikian, kemenangan kebenaran dan kehancuran kebatilan hanya terwujud dengan perjuangan, sebagaimana Nabi Muhammad, para sahabat, dan para pemimpin sesudah mereka berjuang. Di akhirat nanti, Islam itu pasti benar dan kekafiran itu pasti salah.",
      "text_translation": "Katakanlah, “Kebenaran telah datang dan yang batil itu tidak akan memulai dan tidak (pula) akan mengulangi.”",
      "text": "قُلْ جَاۤءَ الْحَقُّ وَمَا يُبْدِئُ الْبَاطِلُ وَمَا يُعِيْدُ ",
      "text_translation_en": "Say: “The truth has now come [to light, and falsehood is bound to wither away]: for, falsehood cannot bring forth anything new, nor can it bring back [what has passed away].”",
      "juz_number": 22
    },
    "50": {
      "text_tafsir_en": "Finally, Allah ordered the Prophet (peace and blessings be upon him) to tell the unbelievers that if he was wrong, then it was his fault. But when he is right, he receives the truth from God. This verse shows the great responsibility of Prophet Muhammad. He is responsible for all the content of the preaching he imparts. When he is wrong in his teachings, he will hold himself accountable for the error, not bring his people. But it is not possible that what he said was wrong, because it was all from Allah, nothing he added or reduced. Therefore, his responsibility is to show that what he is saying is true. Thus, the unbelievers do not have to doubt it and their religious beliefs. When people believe, then God hears it. When they worship Him, He knows and will accept them. When his servant prays, he will answer his prayer. That's because He is so Hearing, He is also very close to humans. How close is God to man that He hears the whisper of his heart in the form of faith or infidelity and answers the prayers of those who pray, in the following verse: And verily, We created man and knew what his heart whispered, and We were closer to him than the veins of his neck. (Qaf \/ 50: 16) In another verse Allah says: And if My servants ask you (Muhammad) about me, then surely I am near. I grant the prayer of the person who prays when he prays to me. They must obey My commandments and believe in me, that they may obtain the truth. (al-Baqarah \/ 2: 186)",
      "text_tafsir": "Terakhir, Allah memerintahkan Nabi saw menyampaikan kepada kaum kafir bahwa seandainya ia salah, maka kesalahan itu dari dirinya sendiri. Tetapi bila ia benar, maka kebenaran itu diperolehnya dari Allah. \n\nAyat ini memperlihatkan tanggung jawab yang besar dari Nabi Muhammad. Beliau bertanggung jawab atas seluruh isi dakwah yang beliau sampaikan. Bila ia salah dalam ajaran-ajaran yang disampaikannya, maka ia akan mempertanggungjawabkan sendiri kesalahan itu, tidak akan membawa-bawa umatnya. Tetapi tidak mungkin apa yang beliau sampaikan itu salah, karena semuanya dari Allah, tidak ada yang beliau tambah-tambah atau kurangi. Oleh karena itu, tanggung jawab beliau itu adalah untuk menunjukkan bahwa yang beliau sampaikan itu sangat benar. Dengan demikian, orang-orang kafir itu tidak perlu meragukannya dan seyogyanya beriman. \n\nBila manusia beriman, maka Allah mendengarnya. Bila mereka menyembah-Nya, Ia mengetahui dan akan menerimanya. Bila hamba-Nya berdoa, maka doanya itu akan dikabulkan-Nya. Hal itu karena Ia Maha Mendengar, Ia juga sangat dekat dengan manusia. Bagaimana dekatnya Allah dengan manusia sehingga Ia mendengar bisikan hatinya dalam bentuk iman atau kafir dan mengabulkan doa orang yang berdoa, dilukiskan ayat berikut:\n\nDan sungguh, Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya, dan Kami lebih dekat kepadanya daripada urat lehernya. (Qaf\/50: 16) \n\nDalam ayat lain Allah berfirman:\n\nDan apabila hamba-hamba-Ku bertanya kepadamu (Muhammad) tentang Aku, maka sesungguhnya Aku dekat. Aku Kabulkan permohonan orang yang berdoa apabila dia berdoa kepada-Ku. Hendaklah mereka itu memenuhi (perintah)-Ku dan beriman kepada-Ku, agar mereka memperoleh kebenaran. (al-Baqarah\/2:186)",
      "text_translation": "Katakanlah, “Jika aku sesat maka sesungguhnya aku sesat untuk diriku sendiri; dan jika aku mendapat petunjuk maka itu disebabkan apa yang diwahyukan Tuhanku kepadaku. Sungguh, Dia Maha Mendengar, Maha-dekat.”",
      "text": "قُلْ اِنْ ضَلَلْتُ فَاِنَّمَآ اَضِلُّ عَلٰى نَفْسِيْۚ وَاِنِ اهْتَدَيْتُ فَبِمَا يُوْحِيْٓ اِلَيَّ رَبِّيْۗ اِنَّهٗ سَمِيْعٌ قَرِيْبٌ ",
      "text_translation_en": "Say: “Were I to go astray, I would but go astray [due to my own self, and] to the hurt of myself; but if I am on the right path, it is but by virtue of what my Sustainer reveals unto me: for, verily, He is all-hearing, ever-near!”",
      "juz_number": 22
    },
    "51": {
      "text_tafsir_en": "In this verse it is explained that if the Messenger of Allah witnessed how the disbelievers would fear in front of Allah, then he would witness a very great event. At that time, the infidels were confronted with the punishment of Allah. There is no escape, nor is there a possibility of help, or a place to take shelter. Therefore, stir them in extreme fear. It was at that time that they were easily beaten without a move because they were cornered in the stifling Mahsyar Padang.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa andaikata Rasulullah menyaksikan bagaimana orang-orang kafir itu nanti ketakutan di depan Allah, maka beliau akan menyaksikan peristiwa yang hebat sekali. Pada waktu itu, orang-orang kafir itu dihadapkan kepada siksa Allah. Tempat melarikan diri tidak ada, begitu juga kemungkinan adanya pertolongan, atau tempat untuk berlindung. Oleh karena itu, gemparlah mereka dalam ketakutan yang luar biasa. Pada waktu itulah mereka dibekuk dengan mudah tanpa berkutik karena sudah terpojok di Padang Mahsyar yang menyesakkan.",
      "text_translation": "Dan (alangkah mengerikan) sekiranya engkau melihat mereka (orang-orang kafir) ketika terperanjat ketakutan (pada hari Kiamat); lalu mereka tidak dapat melepaskan diri dan mereka ditangkap dari tempat yang dekat (untuk dibawa ke neraka),",
      "text": "وَلَوْ تَرٰىٓ اِذْ فَزِعُوْا فَلَا فَوْتَ وَاُخِذُوْا مِنْ مَّكَانٍ قَرِيْبٍۙ ",
      "text_translation_en": "IF THOU couldst but see [how the deniers of the truth will fare on Resurrection Day,] when they will shrink in terror, with nowhere to escape - since they will have been seized from so close nearby",
      "juz_number": 22
    },
    "52": {
      "text_tafsir_en": "At that time they repented by declaring their faith in God, His apostles, and the Qur'an. They profess their sincere faith because all the evidence they once suspected has been true and proven. Such a declaration of faith is set forth in another verse: And if ye see the wicked put his head down before his Lord, (they say), \"O our Lord, we have seen and heard; (to the world), we will do good. Indeed, we are confident. \" (as-Sajdah \/ 32: 12) Declaring the faith to repent at that time is no longer possible to achieve, as they are already in a faraway place, the Hereafter. In such remote places it is impossible to find safety. A place of safety for believers and good deeds is in the world, but time has passed and they can never be returned there. Therefore, repentance and the confession of their faith are useless and impossible.",
      "text_tafsir": "Pada waktu itulah mereka bertobat dengan mengikrarkan iman mereka kepada Allah, para rasul-Nya, dan Al-Qur'an. Mereka mengikrarkan iman yang tulus sekali karena semua bukti yang tadinya mereka ragukan telah nyata dan telah terbukti. Ikrar iman seperti itu dilukiskan dalam ayat lain:\n\nDan (alangkah ngerinya), jika sekiranya kamu melihat orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhannya, (mereka berkata), \"Ya Tuhan kami, kami telah melihat dan mendengar, maka kembalikanlah kami (ke dunia), niscaya kami akan mengerjakan kebajikan. Sungguh, kami adalah orang-orang yang yakin.\" (as-Sajdah\/32: 12)\n\nMengikrarkan iman untuk bertobat pada waktu itu tidak mungkin lagi mencapai maksud yang diharapkan, karena mereka sudah berada di tempat yang sangat jauh yaitu akhirat. Di tempat yang sangat jauh seperti itu tidak mungkin lagi mencari keselamatan. Tempat mencari keselamatan dengan beriman dan beramal saleh adalah di dunia, tetapi masa itu sudah berlalu dan mereka tidak mungkin lagi dikembalikan ke sana. Oleh karena itu, tobat dan ikrar iman mereka itu tidak berguna dan tidak mungkin diterima.",
      "text_translation": "dan (ketika) mereka berkata, “Kami beriman kepada-Nya.” Namun bagaimana mereka dapat mencapai (keimanan) dari tempat yang jauh?",
      "text": "وَّقَالُوْٓا اٰمَنَّا بِهٖۚ وَاَنّٰى لَهُمُ التَّنَاوُشُ مِنْ مَّكَانٍۢ بَعِيْدٍۚ ",
      "text_translation_en": "and will cry, “We do [now] believe in it!” But how can they [hope to] attain [to salvation] from so far away,",
      "juz_number": 22
    },
    "53": {
      "text_tafsir_en": "It is further explained that they are no longer able to seek safety in such a distant place because while living in the world they refuse to. They would not believe in Allah, His Apostles, the Qur'an, and the Hereafter. The reason they do not want to believe is because they throw out false assumptions at all. They thought of others as God, accusing the Prophet Muhammad. poets, shamans, witches, madmen, and so forth, proclaim the Qur'an a fairy tale, a dream, or a magic spell, and pretend to lie in the future with heaven and hell. All that they say is without a basis of knowledge, but only based on assumptions. The suspicion is that of a person who threw something obscure from a distance. He didn't know if the throw was about the target or not. In al-Kahf \/ 18: 22 the action is described with the expression: rajman bil-supernatural, that is, to aim at something that is ambiguous or to guess something without any basis at all.",
      "text_tafsir": "Dijelaskan lebih lanjut bahwa mereka tidak mungkin lagi mencari keselamatan di tempat yang jauh itu karena semasa hidup di dunia mereka ingkar sekali. Mereka tidak mau mengimani Allah, para rasul-Nya, Al-Qur'an, dan hari kemudian. Sebab mereka tidak mau beriman adalah karena mereka melontarkan dugaan-dugaan yang tidak beralasan sama sekali. Mereka menyangka yang lain dari Allah sebagai Tuhan, menuduh Nabi Muhammad saw. penyair, dukun, penyihir, gila, dan sebagainya, menyatakan Al-Qur'an dongeng, mimpi, atau sihir, dan menyangka bohong adanya hari kemudian beserta surga dan neraka. Semua itu mereka nyatakan tanpa dasar pengetahuan, tetapi hanya berdasarkan dugaan. Dugaan itu diibaratkan orang yang melempar sesuatu yang tidak jelas secara serampangan dari tempat yang jauh. Ia tidak tahu apakah lemparan itu mengenai sasaran atau tidak. Dalam al-Kahf\/18: 22 tindakan itu dilukiskan dengan ungkapan: rajman bil-gaib, yaitu membidik sesuatu yang tidak jelas secara serampangan atau menerka-nerka sesuatu tanpa dasar sama sekali.",
      "text_translation": "Dan sungguh, mereka telah mengingkari Allah sebelum itu; dan mereka mendustakan tentang yang gaib dari tempat yang jauh.",
      "text": "وَقَدْ كَفَرُوْا بِهٖ مِنْ قَبْلُۚ وَيَقْذِفُوْنَ بِالْغَيْبِ مِنْ مَّكَانٍۢ بَعِيْدٍۚ ",
      "text_translation_en": "seeing that aforetime they had been bent on denying the truth, and had been wont to cast scorn, from far away, on something that was beyond the reach of human perception?",
      "juz_number": 22
    },
    "54": {
      "text_tafsir_en": "In this verse it is explained that between the man and his hope of repentance and the escape of total torment, it would not have been possible at all, as if two of them had erected a large wall. The delusions are just as much as the people expected them to be. The people from the beginning have always rebelled and believed only when disaster as punishment was before their eyes. Of course repentance and faith at that time had not been accepted, as it is stated in another verse: So when they saw Our torment, they said, \"We believe only in Allah and we disobey the worships which we have associated with Allah.\" . \" So their faith when they saw the torment We were no longer useful to them. That is what Allah has done for His servants. And at that time those who disbelieved were lost. (al-Mu'min \/ 40: 84-85) They do not believe in the world because they are always skeptical of the truth of the Qur'an and hesitate to accept it. In fact, the Qur'an does not need to be doubted by humans, because it is a revelation of God, delivered by Gabriel, accepted by the Prophet Muhammad, and its contents are true. Doubt will only produce disbelief, and disbelief will only produce misery in the hereafter.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa antara orang itu dengan harapannya untuk bertobat dan terlepas dari siksa terganjal total, tidak mungkin terjadi sama sekali, seakan-akan di antara keduanya telah terbangun tembok tebal yang besar. Dambaan itu sama halnya dengan apa yang diharapkan umat-umat sebelum mereka. Umat-umat itu semenjak awal selalu membangkang dan baru beriman ketika bencana sebagai hukuman sudah di depan mata. Tentu saja tobat dan iman pada waktu sudah terpaksa seperti itu tidak diterima, sebagaimana dinyatakan dalam ayat lain:\n\nMaka ketika mereka melihat azab Kami, mereka berkata, \"Kami hanya beriman kepada Allah saja dan kami ingkar kepada sembahan-sembahan yang telah kami persekutukan dengan Allah.\" Maka iman mereka ketika mereka telah melihat azab Kami tidak berguna lagi bagi mereka. Itulah ketentuan Allah yang telah berlaku terhadap hamba-hamba-Nya. Dan ketika itu rugilah orang-orang kafir. (al-Mu'min\/40: 84-85)\n\nMereka tidak beriman di dunia karena selalu sangsi mengenai kebenaran Al-Qur'an dan ragu untuk menerima kebenarannya. Padahal, Al-Qur'an tidak perlu diragukan lagi oleh manusia, karena merupakan wahyu Allah, disampaikan oleh Jibril, diterima Nabi Muhammad, dan isinya benar. Keraguan hanya akan menghasilkan kekafiran, dan kekafiran hanya akan membuahkan kesengsaraan di akhirat.",
      "text_translation": "Dan diberi penghalang antara mereka dengan apa yang mereka inginkan sebagaimana yang dilakukan terhadap orang-orang yang sepaham dengan mereka yang terdahulu. Sesungguhnya mereka dahulu (di dunia) dalam keraguan yang mendalam.",
      "text": "وَحِيْلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُوْنَۙ  كَمَا فُعِلَ بِاَشْيَاعِهِمْ مِّنْ قَبْلُۗ اِنَّهُمْ كَانُوْا فِيْ شَكٍّ مُّرِيْبٍ ࣖ",
      "text_translation_en": "And so, a barrier will be set between them and all that they had [ever] desired, as will be done to such of their kind as lived before their time: for, behold, they [too] were lost in doubt amounting to suspicion.",
      "juz_number": 22
    }
  },
  "name": "سبأ",
  "name_translation_en": "Sheba",
  "name_translation": "Saba'",
  "name_latin": "Saba'"
}