{
  "number": 35,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 45,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, God explains that praise and gratitude are only to Him, who created the heavens and the earth and what is between them with wonderful and wonderful creations, unprecedented creation, and organized by order and complete and perfect. He has also commissioned angels to give visions to His prophets, to convey all kinds of matters. An angel is a kind of creature with many wings, some two, three, or four even more. The angels are responsible for delivering all the commandments and prohibitions of God to His prophets. God has the power to raise the angels' wings even more according to His will, according to His need. No power can hinder him, for God is omnipotent. In a hadith it is explained that: Indeed the Prophet Muhammad saw the Angel Gabriel at night 'in its original form, he had six hundred wings, between his two wings as the eyes looked east and west. (Muslim History of Ibn Mas'ud)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa puji dan syukur hanyalah bagi-Nya, yang telah menciptakan langit dan bumi serta apa yang ada di antara keduanya dengan ciptaan yang amat indah dan ajaib, ciptaan yang belum ada sebelumnya, dan telah diatur-Nya dengan tertib dan lengkap serta sempurna. Dia juga yang telah menugaskan malaikat menyampaikan wahyu kepada para nabi-Nya, untuk menyampaikan berbagai macam urusan. Malaikat itu adalah sejenis makhluk yang mempunyai sayap yang beraneka ragam, ada yang dua, tiga, atau empat bahkan ada yang lebih dari itu. Malaikat bertugas untuk menyampaikan segala perintah dan larangan Allah kepada para nabi-Nya. Allah berkuasa menambah sayap para malaikat lebih banyak lagi menurut kehendak-Nya, sesuai dengan keperluan. Tidak ada kekuatan yang dapat menghalangi-Nya, karena Allah itu Mahakuasa atas segala sesuatu. Di dalam suatu hadis diterangkan bahwa:\n\nSesungguhnya Nabi Muhammad saw melihat Malaikat Jibril pada malam isra' dalam bentuk aslinya, dia mempunyai enam ratus sayap, antara dua sayapnya seperti sepanjang mata memandang ke timur dan barat. (Riwayat Muslim dari Ibnu Mas'ud)",
      "text_translation": "Segala puji bagi Allah Pencipta langit dan bumi, yang menjadikan malaikat sebagai utusan-utusan (untuk mengurus berbagai macam urusan) yang mempunyai sayap, masing-masing (ada yang) dua, tiga dan empat. Allah menambahkan pada ciptaan-Nya apa yang Dia kehendaki. Sungguh, Allah Mahakuasa atas segala sesuatu.",
      "text": "اَلْحَمْدُ لِلّٰهِ فَاطِرِ السَّمٰوٰتِ وَالْاَرْضِ جَاعِلِ الْمَلٰۤىِٕكَةِ رُسُلًاۙ اُولِيْٓ اَجْنِحَةٍ مَّثْنٰى وَثُلٰثَ وَرُبٰعَۗ يَزِيْدُ فِى الْخَلْقِ مَا يَشَاۤءُۗ اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ",
      "text_translation_en": "ALL PRAISE is due to God, Originator of the heavens and the earth, who causes the angels to be (His) message-bearers, endowed with wings, two, or three, or four. [Unceasingly] He adds to His creation whatever He wills: for, verily, God has the power to will anything.",
      "juz_number": 22
    },
    "2": {
      "text_tafsir_en": "In this verse, God explains that the granting or retention of a grace is within His power. When He bestows a grace upon man, no one can withstand and hinder him. On the contrary, when He holds back and closes a grace and has not given it to whom He pleases, then no one can open it and give it, for all things are in His hands. He is Mighty to do according to His will and wisdom. Therefore, we should always turn to God through worship to achieve our goals, and always rely on Him, in the pursuit of His purpose and purpose. In the meantime, God says: And if Allah causes a disaster for you, then no one can eliminate it except Him. And if Allah desires good for you, then no one can deny His bounty. (Jonah \/ 10: 107) And in a hadith it is read as follows: From al-Mugirah bin Shu'bah, he said, \"I heard the Messenger of Allah (may peace be upon him) say, 'There is no god but Allah. To him the kingdom and to him the praise, the power over all things: O my God, there is no restraint in what You give, and no one in anything that You hold back, does not avail one's success in facing torment you. \" (History of Ahmad, al-Bukhari and Muslim)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa pemberian atau penahanan suatu rahmat termasuk dalam kekuasaan-Nya. Apabila Dia menganugerahkan suatu rahmat kepada manusia, tidak seorang pun dapat menahan dan menghalangi-Nya. Begitu pula sebaliknya, apabila Dia menahan dan menutup sesuatu rahmat dan belum diberikan kepada siapa yang dikehendaki-Nya, maka tiada seorang pun bisa membuka dan memberikannya, karena semua urusan di tangan-Nya. Dia Maha Perkasa berbuat menurut kehendak dan kebijaksanaan-Nya. Oleh karena itu, kita harus selalu menghadap Allah melalui ibadah untuk mencapai cita-cita kita, dan senantiasa dengan bertawakal kepada-Nya, begitu pula di dalam usaha mencapai tujuan dan maksud yang diridai-Nya. Sejalan dengan ini, Allah berfirman:\n\nDan jika Allah menimpakan suatu bencana kepadamu, maka tidak ada yang dapat menghilangkannya kecuali Dia. Dan jika Allah menghendaki kebaikan bagi kamu, maka tidak ada yang dapat menolak karunia-Nya. (Yunus\/10: 107) \n\nDan dalam sebuah hadis disebutkan sebagai berikut:\n\nDari al-Mugirah bin Syu'bah bahwa ia berkata, \"Saya mendengar Rasulullah saw apabila selesai salat mengucapkan, 'Tiada tuhan melainkan Allah. Dia Esa tiada ada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala puji. Dia kuasa atas segala sesuatu. Ya Allah Tuhanku, tidak ada seorang pencegah pun terhadap sesuatu yang Engkau berikan dan tak ada seorang pemberi terhadap sesuatu yang Engkau cegah, tidak bermanfaat kejayaan seseorang dalam menghadapi siksaan Engkau.\" (Riwayat Ahmad, al-Bukhari dan Muslim)",
      "text_translation": "Apa saja di antara rahmat Allah yang dianugerahkan kepada manusia, maka tidak ada yang dapat menahannya; dan apa saja yang ditahan-Nya maka tidak ada yang sanggup untuk melepaskannya setelah itu. Dan Dialah Yang Mahaperkasa, Mahabijaksana.",
      "text": "مَا يَفْتَحِ اللّٰهُ لِلنَّاسِ مِنْ رَّحْمَةٍ فَلَا مُمْسِكَ لَهَا ۚوَمَا يُمْسِكْۙ فَلَا مُرْسِلَ لَهٗ مِنْۢ بَعْدِهٖۗ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ ",
      "text_translation_en": "Whatever grace God opens up to man, none can withhold it; and whatever He withholds, none can henceforth release: for He alone is almighty, truly wise.",
      "juz_number": 22
    },
    "3": {
      "text_tafsir_en": "In this verse, God proposes that people pay particular attention to the favor given to them and keep them from disappearing and disappearing. For this purpose, humankind must always humbly admit that all these favors come from God as a gift to him, which is to be commended by worshiping him not to others, obeying all his commands, and abstaining from all his prohibitions. The only way to preserve and maintain the health of one's favors is to appreciate it. Thus, God will always increase it. On the contrary, if it is not favored, then Allah will suffer a severe punishment, as He says: And (remember) when your Lord informs, \"Verily, if you are grateful, I will surely add to you.\" (Ibrahim \/ 14: 7) Allah is the only true provider of food, whether coming down from heaven in the form of rain and so on, or growing from the earth in the form of living things such as rice, water, clothing, and so on. There is no God but Him. If man were to understand and realize all this, he would not turn his back on him, but he would still trouble him, worshiping only him, not others.",
      "text_tafsir": "Pada ayat ini, Allah menganjurkan supaya manusia memberikan perhatian secara khusus atas nikmat yang telah diberikan kepadanya dan menjaganya agar tidak lenyap dan menghilang. Untuk kepentingan ini, manusia selalu harus merendahkan diri mengakui bahwa semua nikmat itu dari Allah sebagai anugerah kepadanya, yang wajib disyukuri dengan melakukan ibadah kepada-Nya tidak kepada lain-Nya, taat kepada segala perintah-Nya, dan menjauhi semua larangan-Nya. Satu-satunya cara untuk memelihara dan menjaga kelestarian nikmat yang ada pada seseorang ialah mensyukuri nikmat itu. Dengan demikian, Allah akan selalu menambahnya. Sebaliknya, kalau nikmat itu tidak disyukuri, maka Allah akan menimpakan azab yang keras, sebagaimana firman-Nya:\n\nDan (ingatlah) ketika Tuhanmu memaklumkan, \"Sesungguhnya jika kamu bersyukur, niscaya Aku akan menambah (nikmat) kepadamu.\" (Ibrahim\/14: 7)\n\nAllah satu-satunya pemberi rezeki yang hakiki, baik yang turun dari langit berupa hujan dan sebagainya, maupun yang tumbuh dari bumi berupa keperluan hidup seperti beras, air, pakaian, dan sebagainya. Tidak ada Tuhan melainkan Dia. Kalau manusia mau mengerti dan menyadari semuanya itu, tentunya dia tidak akan berpaling daripada-Nya, tetapi dia akan tetap mengesakan-Nya, menyembah hanya kepada-Nya, tidak kepada yang lain-Nya.",
      "text_translation": "Wahai manusia! Ingatlah akan nikmat Allah kepadamu. Adakah pencipta selain Allah yang dapat memberikan rezeki kepadamu dari langit dan bumi? Tidak ada tuhan selain Dia; maka mengapa kamu berpaling (dari ketauhidan)?",
      "text": "يٰٓاَيُّهَا النَّاسُ اذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَيْكُمْۗ هَلْ مِنْ خَالِقٍ غَيْرُ اللّٰهِ يَرْزُقُكُمْ مِّنَ السَّمَاۤءِ وَالْاَرْضِۗ  لَآ اِلٰهَ اِلَّا هُوَۖ فَاَنّٰى تُؤْفَكُوْنَ ",
      "text_translation_en": "O men! Call to mind the blessings which God has bestowed upon you! Is there any creator, other than God, that could provide for you sustenance out of heaven and earth? There is no deity save Him: and yet, how perverted are your minds!",
      "juz_number": 22
    },
    "4": {
      "text_tafsir_en": "In this verse, Allah comforts the Prophet Muhammad that if his people continue to reject him for the truth that he has given after he has given them reason and reason, then he must be as patient as the previous apostles who were always harmed by his people, until it was time for him to win in accordance with God's promise. He should return everything to God. He will repay his forbearance and in return for his people who have always rejected him.",
      "text_tafsir": "Pada ayat ini, Allah menghibur Nabi Muhammad bahwa kalau kaumnya mendustakannya terus-menerus atas kebenaran yang disampaikannya sesudah ia mengemukakan alasan-alasan dan tamsil (ibarat) kepada mereka, maka hendaklah ia bersabar sebagaimana halnya rasul-rasul sebelumnya yang selalu disakiti oleh kaumnya, sampai tiba saatnya ia mendapat kemenangan sesuai dengan ketentuan Allah yang telah dijanjikan-Nya. Hendaklah ia mengembalikan segala urusan kepada Allah. Dia akan memberi balasan atas kesabarannya dan imbalan siksa kepada kaumnya yang selalu mendustakan-Nya.",
      "text_translation": "Dan jika mereka mendustakan engkau (setelah engkau beri peringatan), maka sungguh, rasul-rasul sebelum engkau telah didustakan pula. Dan hanya kepada Allah segala urusan dikembalikan.",
      "text": "وَاِنْ يُّكَذِّبُوْكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِّنْ قَبْلِكَۗ وَاِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ ",
      "text_translation_en": "But if they [whose minds are perverted] give thee the lie, [O Prophet, remember that] even so, before thy time, have [other] apostles been given the lie: for [the unbelievers always refuse to admit that] all things go back to God [as their source].",
      "juz_number": 22
    },
    "5": {
      "text_tafsir_en": "In this verse, God explains the truth of His promise, which is the Day of Resurrection and the Day of Atonement. When a person obeys his commandments, he is rewarded, and those who disobey him will be tormented. God's promise in time will come true. He will never break His promise, as God says: Indeed, God does not transgress. (ali 'Imran \/ 3: 9) Therefore, it is not in a position to be fooled by the luxury of worldly luxury, so that he \"forgets the land,\" even forgetting God. All his time is used to accumulate wealth without even remembering God. God forbids it as He says: O you who believe! Let not your wealth and your children forget you from remembering Allah. (al-Munafiqun \/ 63: 9) Likewise, one should not be deceived and deceived by the seductions and temptations of the devil, easily following his whisperings and exhortations because the devil is not only inviting evil and evil things, but sometimes he calls on people to do well-intentioned. Allah says: O you who believe! Do not follow the devil's steps. Whoever follows the footsteps of the devil, then he (the devil) is to do evil and evil deeds. (an-Nur \/ 24: 21)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan kebenaran janji-Nya, yaitu terjadinya hari Kebangkitan dan hari Pembalasan. Apabila seseorang taat kepada perintah-Nya akan diberi pahala, dan orang yang mendurhakai-Nya akan disiksa. Janji Allah pada waktunya akan menjadi kenyataan. Dia itu tidak akan pernah menyalahi janji-Nya, sebagaimana firman Allah:\n\nSungguh, Allah tidak menyalahi janji. (ali 'Imran\/3: 9) \n\nOleh karena itu, tidaklah pada tempatnya bila seseorang teperdaya dengan kehidupan dunia yang mewah, sehingga ia \"lupa daratan\", bahkan melupakan Tuhan. Semua waktunya dipergunakan untuk menumpuk harta tanpa mengingat Allah sedikit pun. Hal demikian itu dilarang oleh Allah sebagaimana firman-Nya:\n\nWahai orang-orang yang beriman! Janganlah harta benda dan anak-anakmu melalaikan kamu dari mengingat Allah. (al-Munafiqun\/63: 9)\n\nBegitu pula janganlah seseorang dapat tertipu dan teperdaya dengan bujukan dan godaan setan, dengan mudah menuruti bisikan dan ajakannya karena setan tidak hanya mengajak kepada hal-hal yang keji dan mungkar, tetapi kadangkala ia menyuruh orang untuk berbuat baik dengan tujuan ria. Allah berfirman :\n\nWahai orang-orang yang beriman! Janganlah kamu mengikuti langkah-langkah setan. Barang siapa mengikuti langkah-langkah setan, maka sesungguhnya dia (setan) menyuruh mengerjakan perbuatan yang keji dan mungkar. (an-Nur\/24: 21)",
      "text_translation": "Wahai manusia! Sungguh, janji Allah itu benar, maka janganlah kehidupan dunia memperdayakan kamu dan janganlah (setan) yang pandai menipu, memperdayakan kamu tentang Allah.",
      "text": "يٰٓاَيُّهَا النَّاسُ اِنَّ وَعْدَ اللّٰهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيٰوةُ الدُّنْيَاۗ وَلَا يَغُرَّنَّكُمْ بِاللّٰهِ الْغَرُوْرُ ",
      "text_translation_en": "O men! Verily, God’s promise [of resurrection] is true indeed: let not, then, the life of this world delude you, and let not [your own] deceptive thoughts about God delude you!",
      "juz_number": 22
    },
    "6": {
      "text_tafsir_en": "In this verse, Allah explains that the devil is an eternal enemy of humans who always make doubts, whisper the evil with its charming appeal, so that humans obey and do it. God's Word: Satan has made them feel good for their (bad) deeds, thus blocking them from the path (of God), while they are sharp-minded people. (al-'Ankabut \/ 29: 38) Therefore, let people consider and make Satan a very dangerous enemy, which does not need to be served and followed at all, as Allah says: And do not follow the steps of Satan. Truly Satan is your real enemy. (al-An'am \/ 6: 142) At the end of this verse it is stressed that the intent and purpose of Satan to encourage people to act contrary to Allah's command is to make as many friends as possible, to become a blazing denizen of hell. The Word of God: Are they (going to follow their ancestors) even though the devil actually called them into the punishment of the blazing fire (hell)? (Luqman \/ 31: 21)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa setan itu adalah musuh abadi bagi manusia yang selalu membuat keraguan, membisikkan yang jahat dengan daya tariknya yang memesona, supaya manusia menuruti dan mengerjakannya. Firman Allah:\n\nSetan telah menjadikan terasa indah bagi mereka perbuatan (buruk) mereka, sehingga menghalangi mereka dari jalan (Allah), sedangkan mereka adalah orang-orang yang berpandangan tajam. (al-'Ankabut\/29: 38)\n\nOleh karena itu, hendaklah manusia menganggap dan menjadikan setan itu musuhnya yang sangat berbahaya, yang tidak perlu dilayani dan diikuti sama sekali, sebagaimana firman Allah:\n\nDan janganlah kamu mengikuti langkah-langkah setan. Sesungguhnya setan itu musuh yang nyata bagimu. (al-An'am\/6: 142) \n\nPada akhir ayat ini ditegaskan bahwa maksud dan tujuan setan mendorong manusia berbuat yang bertentangan dengan perintah Allah adalah untuk mencari teman sebanyak-banyaknya, menjadi penghuni neraka yang menyala-nyala. Firman Allah:\n\nApakah mereka (akan mengikuti nenek moyang mereka) walaupun sebenarnya setan menyeru mereka ke dalam azab api yang menyala-nyala (neraka)? (Luqman\/31: 21)",
      "text_translation": "Sungguh, setan itu musuh bagimu, maka perlakukanlah ia sebagai musuh, karena sesungguhnya setan itu hanya mengajak golongannya agar mereka menjadi penghuni neraka yang menyala-nyala.",
      "text": "اِنَّ الشَّيْطٰنَ لَكُمْ عَدُوٌّ فَاتَّخِذُوْهُ عَدُوًّاۗ اِنَّمَا يَدْعُوْا حِزْبَهٗ لِيَكُوْنُوْا مِنْ اَصْحٰبِ السَّعِيْرِۗ ",
      "text_translation_en": "Behold, Satan is a foe unto you: so treat him as a foe. He but calls on his followers to the end that they might find themselves among such as are des­tined for the blazing flame –",
      "juz_number": 22
    },
    "7": {
      "text_tafsir_en": "In this verse it is explained that those who disobey God and His Messenger will receive a severe and painful torment in hell. It was in retribution for their disobedience to the devil's persuasion, and followed his steps. But those who justify the commandments brought by his apostles and do good deeds will receive great forgiveness and reward. Their sins were forgiven by God, their merit was multiplied and heaven was prepared in return for their strong faith in their hearts and sincere righteous deeds for God alone. The Word of God: And give glad tidings to those who believe and do good, that they may have a paradise flowing beneath the rivers. (al-Baqarah \/ 2: 25)",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa orang-orang yang ingkar kepada Allah dan rasul-Nya akan mendapat azab yang keras dan pedih di dalam neraka. Azab itu sebagai balasan atas keingkaran mereka pada bujukan setan, lalu mengikuti langkah-langkahnya. Adapun orang-orang yang membenarkan perintah-perintah yang dibawa oleh rasul-Nya dan mengerjakan amal saleh akan memperoleh ampunan dan pahala yang besar. Dosa-dosa mereka diampuni oleh Allah, pahala mereka dilipatgandakan dan telah disiapkan surga sebagai balasan atas iman yang mantap di dalam hati mereka dan amal saleh yang ikhlas karena Allah semata. Firman Allah:\n\nDan sampaikanlah kabar gembira kepada orang-orang yang beriman dan berbuat kebajikan, bahwa untuk mereka (disediakan) surga-surga yang mengalir di bawahnya sungai-sungai. (al-Baqarah\/2: 25)",
      "text_translation": "Orang-orang yang kafir, mereka akan mendapat azab yang sangat keras. Dan orang-orang yang beriman dan mengerjakan kebajikan, mereka memperoleh ampunan dan pahala yang besar.",
      "text": "اَلَّذِيْنَ كَفَرُوْا لَهُمْ عَذَابٌ شَدِيْدٌ ەۗ وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ كَبِيْرٌ ࣖ ",
      "text_translation_en": "[seeing that] for those who are bent on denying the truth there is suffering severe in store, just as for those who have attained to faith and do righteous deeds there is forgiveness of sins, and a great reward.",
      "juz_number": 22
    },
    "8": {
      "text_tafsir_en": "In this verse, God describes the great difference between the two groups mentioned in the previous verse. People who are deceived and deceived by demons, so that their evil deeds are considered good, are certainly not the same as those who cannot be deceived by demons. As the word of Allah says, \"Do We Need to tell you about the one who has lost the most?\" (That is) people who do nothing in the life of the world, but they think they have done their best. (al-Kahf \/ 18: 103-104) Get lost or be led into the hands of God. He misleads or directs those whom He pleases, according to His wisdom, based on the circumstances of the servant concerned. People who are destined to get lost, he always does bad and evil deeds. Instead, those who are guided by God always do good deeds. Therefore, the Prophet Muhammad was forbidden by Allah to be sad and anxious to face his people who would not believe and accept his request, so that he would not destroy himself. This is also explained in another verse, the word of Allah: Then you (Muhammad) will suffer for your misery after they turn away, if they do not believe this (Qur'an). (al-Kahf \/ 18: 6) This verse closes with Allah's assertion that He knows what they are doing, including the evil and vile deeds that He will repay in return.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan perbedaan besar antara dua golongan disebut pada ayat sebelumnya. Orang-orang yang teperdaya dan dapat ditipu oleh setan, sehingga pekerjaan mereka yang buruk dianggapnya baik, tentunya tidak sama dengan orang-orang yang tidak dapat ditipu oleh setan. Sebagaimana firman Allah:\n\nKatakanlah (Muhammad), \"Apakah perlu Kami beritahukan kepadamu tentang orang yang paling rugi perbuatannya?\" (Yaitu) orang yang sia-sia perbuatannya dalam kehidupan dunia, sedangkan mereka mengira telah berbuat sebaik-baiknya. (al-Kahf\/18: 103-104)\n\nTersesat atau mendapat petunjuk ada di tangan Allah. Dia menyesatkan atau memberikan petunjuk kepada orang yang dikehendaki-Nya, sesuai dengan kebijaksanaan-Nya, berdasarkan keadaan hamba yang bersangkutan. Orang-orang yang ditetapkan tersesat, dia selalu mengerjakan perbuatan buruk dan keji. Sebaliknya orang-orang yang diberi petunjuk oleh Allah, selalu mengerjakan amalan yang baik. Oleh karena itu, Nabi Muhammad dilarang Allah untuk sedih dan cemas menghadapi kaumnya yang belum mau beriman dan menerima ajakannya, sehingga tidak membinasakan dirinya. Hal semacam ini diterangkan juga di ayat yang lain, firman Allah:\n\nMaka barangkali engkau (Muhammad) akan mencelakakan dirimu karena bersedih hati setelah mereka berpaling, sekiranya mereka tidak beriman kepada keterangan ini (Al-Qur'an). (al-Kahf\/18: 6)\n\nAyat ini ditutup dengan penegasan Allah bahwa Ia Mengetahui apa yang mereka perbuat, termasuk perbuatan buruk dan keji yang akan dibalas-Nya dengan balasan yang setimpal.",
      "text_translation": "Maka apakah pantas orang yang dijadikan terasa indah perbuatan buruknya, lalu menganggap baik perbuatannya itu? Sesungguhnya Allah menyesatkan siapa yang Dia kehendaki dan memberi petunjuk kepada siapa yang Dia kehendaki. Maka jangan engkau (Muhammad) biarkan dirimu binasa karena kesedihan terhadap mereka. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat.",
      "text": "اَفَمَنْ زُيِّنَ لَهٗ سُوْۤءُ عَمَلِهٖ فَرَاٰهُ حَسَنًاۗ فَاِنَّ اللّٰهَ يُضِلُّ مَنْ يَّشَاۤءُ وَيَهْدِيْ مَنْ يَّشَاۤءُۖ فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرٰتٍۗ اِنَّ اللّٰهَ عَلِيْمٌ ۢبِمَا يَصْنَعُوْنَ ",
      "text_translation_en": "Is, then, he to whom the evil of his own doings is [so] alluring that [in the end] he regards it as good [anything but a follower of Satan]? For, verily, God lets go astray him that wills [to go astray], just as He guides him that wills [to be guided]. Hence, [O believer,] do not waste thyself in sorrowing over them: verily, God has full knowledge of all that they do!",
      "juz_number": 22
    },
    "9": {
      "text_tafsir_en": "In this verse, God explains that He created the wind that moved the thick cloud of water and then brought it to a barren land, and caused it to rain. With the downpour of rain, the earth dies and there is no small tree above it becomes fertile. The earth grows a variety of fruits and a variety of tastes. Thus Allah brought the earth to life after the rain fell from the clouds. If human beings were to use their senses and to think seriously of the sign of God's power as in the above case, he would have come to the conclusion that the almighty God raised the dead, and indeed the power to revive the dead has been broken and bone broken. -It's scattered. Abu Ruzain al-'Uqaili, may Allah be pleased with him, reported that he asked the Messenger of Allah about how Allah gives life to the dead and what their signs are to the creatures. The Messenger of Allah (may peace be upon him) said, \"O Abu Ruzain, have you passed through the valley of your arid people, and then you have passed it back to its fertile and green state?\" Abu Ruzain replied, \"Never.\" The Prophet said, \"Thus Allah raises the dead.\"",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Dia-lah Yang Menciptakan angin yang menggerakkan awan tebal yang mengandung air kemudian membawanya ke bumi yang tandus, dan menurunkan hujan. Dengan turunnya air hujan, bumi yang mati dan tidak ada pepohonan sedikit pun di atasnya berubah menjadi subur. Bumi menumbuhkan buah-buahan yang bermacam-macam dan beraneka ragam cita rasanya. Demikianlah Allah menghidupkan bumi sesudah mati dengan hujan yang turun dari awan. Kalau manusia mau menggunakan akalnya dan memikirkan dengan sungguh-sungguh tanda kekuasaan Allah seperti kejadian yang tersebut di atas, tentu ia akan sampai kepada suatu kesimpulan bahwa Allah yang berkuasa menghidupkan tanah yang mati, tentunya kuasa pula menghidupkan manusia yang sudah mati sekalipun telah hancur dan tulang-belulangnya berserakan.\n\nDiriwayatkan dari Abu Ruzain al-'Uqaili bahwa ia bertanya kepada Rasulullah saw tentang bagaimana cara Allah menghidupkan orang mati dan apa tanda-tandanya pada makhluk. Rasulullah saw menjawab, \"Wahai Abu Ruzain, pernahkah engkau melalui suatu lembah kaummu yang gersang, kemudian kamu melaluinya kembali dalam keadaan subur dan menghijau?\" Abu Ruzain menjawab, \"Pernah.\" Rasulullah bersabda, \"Begitulah Allah menghidupkan orang yang sudah mati.\"",
      "text_translation": "Dan Allah-lah yang mengirimkan angin; lalu (angin itu) menggerakkan awan, maka Kami arahkan awan itu ke suatu negeri yang mati (tandus) lalu dengan hujan itu Kami hidupkan bumi setelah mati (kering). Seperti itulah kebangkitan itu.",
      "text": "وَاللّٰهُ الَّذِيْٓ اَرْسَلَ الرِّيٰحَ فَتُثِيْرُ سَحَابًا فَسُقْنٰهُ اِلٰى بَلَدٍ مَّيِّتٍ فَاَحْيَيْنَا بِهِ الْاَرْضَ بَعْدَ مَوْتِهَاۗ  كَذٰلِكَ النُّشُوْرُ ",
      "text_translation_en": "AND [remember:] it is God who sends forth the winds, so that they raise a cloud, whereupon We drive it towards dead land and thereby give life to the earth after it had been lifeless: even thus shall resur­rection be!",
      "juz_number": 22
    },
    "10": {
      "text_tafsir_en": "In this verse, God explains that whoever wants to gain glory in this world and in the hereafter, let him always obey God because all the glory both in the world and in the hereafter belongs to him. He is the one who receives good words such as monotheistic sentences, remembrance, recitation of the Qur'an, etc., and good deeds that are accompanied by sincerity will be rewarded by Allah. A charity, whether it be words or deeds, done without sincerity will not be rewarded, it will even be punished for being regarded as a denial of religion. Prayers of prayer, charity, and other good deeds when performed with joy, such as not to seek God's will, but to seek the praise or fame of the community, will not be acceptable to God. The Word of God: Woe to those who pray, who are disobedient to their prayers, who do wrong, and refuse to give help. (al-Ma'un \/ 107: 4-7) Those who plot evil against Muslims, such as plotting something that will result in the withdrawal of Islam or less attention from the community and others, will suffer severe torture. on the Day of Judgment and its evil plan will be destroyed without the goals of the Quraysh infidels. They planned to capture the Messenger of Allah (may peace be upon him) and kill or exile in a place far from his blood, so that Islam would become weak and even disappear on the surface of the earth.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa barang siapa ingin mendapatkan kemuliaan di dunia dan di akhirat, hendaklah ia senantiasa taat kepada Allah karena semua kemuliaan baik di dunia maupun di akhirat adalah kepunyaan-Nya. Dialah yang menerima perkataan-perkataan yang baik seperti kalimat tauhid, zikir, membaca Al-Qur'an, dan lainnya, begitu pula amal-amal yang baik yang disertai dengan keikhlasan akan diberi pahala oleh Allah. Sesuatu amal, baik berupa perkataan maupun perbuatan, yang dilakukan tanpa keikhlasan tidak akan berpahala, bahkan akan mendapat azab karena dianggap mendustakan agama. Ibadah salat, zakat, dan amal-amal baik yang lain apabila dilakukan dengan ria, yakni dikerjakan bukan untuk mencari keridaan Allah, tetapi mencari pujian atau ketenaran di masyarakat, tidak akan diterima oleh Allah. Firman Allah:\n\nMaka celakalah orang yang salat, (yaitu) orang-orang yang lalai terhadap salatnya, yang berbuat ria, dan enggan (memberikan) bantuan. (al-Ma'un\/107: 4-7) \n\nOrang-orang yang merencanakan kejahatan terhadap orang-orang Islam, seperti merencanakan suatu hal yang akan menyebabkan mundurnya Islam atau kurang mendapat perhatian dari masyarakat dan lain-lain, akan mendapat siksa yang pedih di hari Kiamat dan rencana buruknya akan hancur tidak mencapai sasarannya seperti yang dialami orang-orang kafir Quraisy. Mereka dulu merencanakan akan menangkap Rasulullah saw lalu membunuh atau mengasingkannya di suatu tempat yang jauh dari tumpah darahnya, agar Islam menjadi lemah bahkan akan hilang lenyap di permukaan bumi.",
      "text_translation": "Barangsiapa menghendaki kemuliaan, maka (ketahuilah) kemuliaan itu semuanya milik Allah. Kepada-Nyalah akan naik perkataan-perkataan yang baik, dan amal kebajikan Dia akan mengangkatnya. Adapun orang-orang yang merencanakan kejahatan mereka akan mendapat azab yang sangat keras, dan rencana jahat mereka akan hancur.",
      "text": "مَنْ كَانَ يُرِيْدُ الْعِزَّةَ فَلِلّٰهِ الْعِزَّةُ جَمِيْعًاۗ اِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهٗ ۗوَالَّذِيْنَ يَمْكُرُوْنَ السَّيِّاٰتِ لَهُمْ عَذَابٌ شَدِيْدٌ ۗوَمَكْرُ اُولٰۤىِٕكَ هُوَ يَبُوْرُ ",
      "text_translation_en": "He who desires might and glory [ought to know that] all might and glory belong to God [alone]. Unto Him ascend all good words, and the righteous deed does He exalt. But as for those who cunningly devise evil deeds - suffering severe awaits them; and all their devising is bound to come to nought.",
      "juz_number": 22
    },
    "11": {
      "text_tafsir_en": "In this verse, God describes the creation of Adam as the ancestor of mankind. He was made by God directly from the soil, then his offspring were made from sperm which in fact also originated from the soil because it came from foods in the form of rice, vegetables and other things, which came from the soil. Then they were made into pairs, consisting of men and women. There is no woman who is pregnant or giving birth unless it is known to God, and nothing is hidden from her. In line with this verse God says: God knows what each woman has, what is imperfect and what grows in the womb. And everything has its size on its side. (Allah) Who knows all that is supernatural and real; The Most High, the Most High. (ar-Ra'd \/ 13: 8-9) No one who lives long, unless it is predestined by God and written in the Far Mahfudh, will not increase nor diminish. Likewise, a person who is appointed to be short-lived, will not be taller or shorter in order to maintain the balance on the earth in order to prosper his way. Such things are easy for God, since He knows everything, and nothing is hidden from Him.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan kejadian Adam yang menjadi nenek moyang manusia. Ia dijadikan oleh Allah langsung dari tanah, kemudian keturunannya dijadikan dari sperma yang pada hakikatnya juga berasal dari tanah karena berasal dari makanan berupa beras, sayur-sayuran dan lain-lain, yang berasal dari tanah. Kemudian mereka dijadikan berpasang-pasangan, terdiri dari laki-laki dan perempuan. Tidak ada seorang perempuan yang mengandung atau melahirkan kecuali semuanya diketahui oleh Allah, tidak ada yang tersembunyi bagi-Nya. Sejalan dengan ayat ini Allah berfirman:\n\nAllah mengetahui apa yang dikandung oleh setiap perempuan, apa yang kurang sempurna dan apa yang bertambah dalam rahim. Dan segala sesuatu ada ukuran di sisi-Nya. (Allah) Yang mengetahui semua yang gaib dan yang nyata; Yang Mahabesar, Mahatinggi. (ar-Ra'd\/13: 8-9)\n\nTidak seorang pun yang berumur panjang, kecuali telah ditetapkan Allah lebih dahulu dan tertulis di Lauh Mahfudh, tidak akan bertambah dan tidak akan berkurang. Begitu pula orang yang telah ditetapkan berumur pendek, tidak akan lebih panjang dan tidak lebih pendek demi untuk menjaga keseimbangan di bumi supaya kemakmuran tertib jalannya. Hal demikian itu bagi Allah adalah mudah, karena Dia mengetahui segala sesuatu, tidak ada yang tersembunyi bagi-Nya.",
      "text_translation": "Dan Allah menciptakan kamu dari tanah kemudian dari air mani, kemudian Dia menjadikan kamu berpasangan (laki-laki dan perempuan). Tidak ada seorang perempuan pun yang mengandung dan melahirkan, melainkan dengan sepengetahuan-Nya. Dan tidak dipanjangkan umur seseorang dan tidak pula dikurangi umurnya, melainkan (sudah ditetapkan) dalam Kitab (Lauh Mahfuzh). Sungguh, yang demikian itu mudah bagi Allah.",
      "text": "وَاللّٰهُ خَلَقَكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ جَعَلَكُمْ اَزْوَاجًاۗ وَمَا تَحْمِلُ مِنْ اُنْثٰى وَلَا تَضَعُ اِلَّا بِعِلْمِهٖۗ وَمَا يُعَمَّرُ مِنْ مُّعَمَّرٍ وَّلَا يُنْقَصُ مِنْ عُمُرِهٖٓ اِلَّا فِيْ كِتٰبٍۗ اِنَّ ذٰلِكَ عَلَى اللّٰهِ يَسِيْرٌ ",
      "text_translation_en": "And [remember:] God creates [every one of] you out of dust, then out of a drop of sperm; and then He fashions you into either of the two sexes. And no female conceives or gives birth unless it be with His knowledge; and none that is long-lived has his days lengthened - and neither is aught lessened of his days - unless it be thus laid down in [God’s] decree: for, behold, all this is easy for God.",
      "juz_number": 22
    },
    "12": {
      "text_tafsir_en": "In this verse, Allah explains that there are two features of water, each of which has its own uses. Both can be breeding grounds for delicious fish. Fresh water in rivers that flow through villages and big cities, is pleasant to drink, removes thirst, fertilizes the soil, and grows grasses, plants, and trees. Boats can sail on it to carry the necessities of life from one place to another. While salt water, in which there are pearls and sea corals that can be used as jewelry, and become a place for sailing large ships carrying agricultural products and mines from one place to another, both in their own area and abroad as export goods or bring it from abroad as imported goods, which cannot be reached by small boats, as merchandise to seek the gift of God. At the end of this verse it is explained that God's authority can subdue fresh water and salt water so that it can be used according to their respective functions. This is so that humans are grateful for the favors that Allah has bestowed upon him. According to scientists, the water is delicious to drink and feels fresh if it contains only a small amount of dissolved salt, while the salty and bitter taste of sea water is caused by the high content of salt dissolved in it. The size of the salt content in ordinary water is expressed in salt or salinity, the unit of which is grams of salt per kg of water, or because BD water = 1, in grams \/ liter. Fourteen centuries ago, when practical chemistry did not yet exist, this verse had stated that salinity of seawater was different. This fact is proven now that what is stated in this verse is true. Measurement results around the world show that the average salinity of sea water is 34.72 gr \/ l. But the average salinity of the three large oceans has differences: 34, 90 for the Atlantic Ocean, 34.76 for the Indian Ocean and 34.62 for the Pacific Ocean. Salinity of water in the open ocean generally varies between 33 to 37 grams \/ l. The highest salinity in the open sea is found in the Red Sea (around 41 gr \/ l), while the lowest salinity is found in the Gulf of Bothnia and the Baltic Sea (about 10 and 20 gr \/ l respectively).",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa ada dua keistimewaan air, masing-masing mempunyai kegunaan sendiri-sendiri. Keduanya dapat menjadi tempat berkembang biak ikan yang lezat cita rasanya. Air tawar di sungai-sungai yang mengalir melalui desa-desa dan kota-kota besar, sedap diminum, menghilangkan dahaga, menyuburkan tanah, dan menumbuhkan rumput-rumputan, tanam-tanaman, dan pohon-pohonan. Perahu-perahu dapat berlayar di atasnya untuk membawa keperluan hidup dari satu tempat ke tempat lain. Sedangkan air asin, di dalamnya terdapat mutiara dan karang laut yang dapat dijadikan perhiasan, dan menjadi tempat berlayarnya kapal-kapal besar membawa hasil bumi dan tambang dari satu tempat ke tempat-tempat lain, baik di daerah sendiri maupun ke luar negeri sebagai barang ekspor atau mendatangkannya dari luar negeri sebagai barang impor, yang tidak dapat dijangkau oleh perahu-perahu kecil, sebagai barang dagangan untuk mencari karunia Allah. \n\nPada akhir ayat ini dijelaskan bahwa kekuasaan Allah dapat menundukkan air tawar dan air asin sehingga bisa dipergunakan menurut fungsinya masing-masing. Hal demikian itu bertujuan agar manusia bersyukur atas nikmat-nikmat yang telah dianugerahkan Allah kepadanya itu.\n\nMenurut para saintis, air nikmat diminum dan terasa segar apabila mengandung hanya sedikit garam terlarut, sedangkan rasa asin dan pahit air laut disebabkan oleh tingginya kandungan garam yang terlarut di dalamnya. Ukuran kandungan garam di dalam air biasa dinyatakan dengan kegaraman atau salinitas yang satuannya adalah gram garam per kg air, atau karena BD air = 1, dalam gram\/liter. Empat belas abad yang lalu, ketika ilmu kimia praktis belum ada, ayat ini telah menyatakan bahwa salinitas air laut berbeda-beda. Kenyataan ini terbukti kini bahwa apa yang dinyatakan dalam ayat ini benar adanya. Hasil pengukuran di seluruh dunia memperlihatkan bahwa salinitas rata-rata air laut adalah sebesar 34,72 gr\/l. Tetapi salinitas rata-rata ketiga samudra besar memiliki perbedaan: 34, 90 untuk Samudra Atlantik, 34,76 untuk Samudra Hindia dan 34,62 untuk Samudra Pasifik. Salinitas air di lautan terbuka umumnya bervariasi antara 33 sampai 37 gram\/l. Salinitas tertinggi di laut terbuka dijumpai di Laut Merah ( sekitar 41 gr\/l), sedangkan salinitas terendah dijumpai di Teluk Bothnia dan Laut Baltik (Masing-masing sekitar 10 dan 20 gr\/l).",
      "text_translation": "Dan tidak sama (antara) dua lautan; yang ini tawar, segar, sedap diminum dan yang lain asin lagi pahit. Dan dari (masing-masing lautan) itu kamu dapat memakan daging yang segar dan kamu dapat mengeluarkan perhiasan yang kamu pakai, dan di sana kamu melihat kapal-kapal berlayar membelah laut agar kamu dapat mencari karunia-Nya dan agar kamu bersyukur.",
      "text": "وَمَا يَسْتَوِى الْبَحْرٰنِۖ هٰذَا عَذْبٌ فُرَاتٌ سَاۤىِٕغٌ شَرَابُهٗ وَهٰذَا مِلْحٌ اُجَاجٌۗ وَمِنْ كُلٍّ تَأْكُلُوْنَ لَحْمًا طَرِيًّا وَّتَسْتَخْرِجُوْنَ حِلْيَةً تَلْبَسُوْنَهَا ۚوَتَرَى الْفُلْكَ فِيْهِ مَوَاخِرَ لِتَبْتَغُوْا مِنْ فَضْلِهٖ وَلَعَلَّكُمْ تَشْكُرُوْنَ ",
      "text_translation_en": "[Easy is it for Him to create likeness and variety:] thus, the two great bodies of water [on earth] are not alike the one sweet, thirst-allaying, pleasant to drink, and the other salty and bitter: and yet, from either of them do you eat fresh meat, and [from either] you take gems which you may wear; and on either thou canst see ships ploughing through the waves, so that you might [be able to] go forth in quest of some of His bounty, and thus have cause to be grateful.",
      "juz_number": 22
    },
    "13": {
      "text_tafsir_en": "In this verse it is explained that it is God who brings the night into the day, so that the day is longer than the night, and vice versa. He put in the day into the night so it was longer than the day. Alternating day and night is a blessing from God. During the day, people work for sustenance and at night they rest to relieve fatigue and gather new energy for use the next day. God subdues day and night, and makes the sun and the moon to pass according to the conditions outlined. None of them violated that provision, so there was no collision. This is all the grace of God, for thus the number and the number of times can be known, as God states in another verse: He makes the sun shine and the moon shine, and He sets the places of its orbit, so that you may know the number of years, and calculations (time). (Jonah \/ 10: 5) Only God does all this. A God of perfect and absolute power. He is the God to be worshiped. All that is in the heavens and in the earth is His servant, and is under His power. In contrast to the idols worshiped by the monks, who had little ability, even a thin skin of cord. In fact, their worship belongs to God the Creator of the universe.",
      "text_tafsir": "Pada ayat ini diterangkan bahwa Allah yang memasukkan malam ke dalam siang, maka jadilah siang itu lebih panjang dari malam, begitu pula sebaliknya. Dia memasukkan siang ke dalam malam maka jadilah malam itu lebih panjang dari siang. Silih bergantinya siang dengan malam merupakan suatu rahmat dari Allah. Pada waktu siang, manusia bekerja mencari rezeki dan pada waktu malam mereka beristirahat untuk melepaskan lelah dan mengumpulkan tenaga baru untuk dipergunakan lagi esok harinya.\n\nAllah menundukkan siang dan malam, dan menjadikan matahari dan bulan beredar menurut ketentuan yang telah digariskan. Tidak satu pun di antaranya yang menyalahi ketentuan itu, sehingga tidak terjadi tabrakan. Ini semua merupakan rahmat dari Allah, karena dengan demikian bilangan tahun dan perhitungan waktu dapat diketahui, sebagaimana ditegaskan Allah dalam ayat yang lain:\n\nDialah yang menjadikan matahari bersinar dan bulan bercahaya, dan Dialah yang menetapkan tempat-tempat orbitnya, agar kamu mengetahui bilangan tahun, dan perhitungan (waktu). (Yunus\/10: 5) \n\nHanya Allah yang melakukan semua itu. Tuhan yang mempunyai kekuasaan yang sempurna dan mutlak. Dialah Tuhan yang wajib disembah. Semua yang ada di langit dan di bumi adalah hamba-Nya dan di bawah kekuasaan-Nya. Berbeda dengan berhala-berhala yang disembah orang-orang musyrik, yang tidak memiliki daya kemampuan sedikit pun, sekalipun setipis kulit ari. Bahkan, sembahan mereka itu adalah milik Allah Pencipta semesta alam.",
      "text_translation": "Dia memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan menundukkan matahari dan bulan, masing-masing beredar menurut waktu yang ditentukan. Yang (berbuat) demikian itulah Allah Tuhanmu, milik-Nyalah segala kerajaan. Dan orang-orang yang kamu seru (sembah) selain Allah tidak mempunyai apa-apa walaupun setipis kulit ari.",
      "text": "يُوْلِجُ الَّيْلَ فِى النَّهَارِ وَيُوْلِجُ النَّهَارَ فِى الَّيْلِۚ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَّجْرِيْ لِاَجَلٍ مُّسَمًّىۗ ذٰلِكُمُ اللّٰهُ رَبُّكُمْ لَهُ الْمُلْكُۗ وَالَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِهٖ مَا يَمْلِكُوْنَ مِنْ قِطْمِيْرٍۗ ",
      "text_translation_en": "He makes the night grow longer by shortening the day, and He makes the day grow longer by shortening the night; and He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him]. Thus is God, your Sustainer: unto Him belongs all dominion - whereas those whom you invoke instead of Him do not own so much as the husk of a date-stone!",
      "juz_number": 22
    },
    "14": {
      "text_tafsir_en": "This verse explains that the gods whom they associate with God cannot hear when called upon by their worshipers, for they are only lifeless things. If they could hear their worshipers' prayers, the gods would not be able to do anything, and would not serve and grant their requests on the Day of Judgment. The gods turned away from them, did not want to be responsible, and instead said, \"They do not worship us, but worship their passions, and are considered good by the demands and persuasion of the devil.\" Allah says: And they have chosen gods other than Allah, that they may be their protector. Not at all! They will disregard their worship of him, and will be their enemies. (Mary \/ 19: 81-82) This 14th verse closes with the assertion that the declaration of the gods worshiping the muslims is true and cannot be mistaken, since the information is from God, the Almighty. There is nothing hidden for him, either on earth or in heaven. God's Word: For Allah there is nothing hidden on earth and in heaven. (ali 'Imran \/ 3: 5",
      "text_tafsir": "Ayat ini menerangkan bahwa tuhan-tuhan yang mereka persekutukan dengan Allah tidak dapat mendengar apabila diseru oleh penyembahnya, karena hanya berupa benda mati yang tidak bernyawa. Andaipun dapat mendengar seruan penyembahnya, tuhan-tuhan itu tidak akan dapat berbuat apa-apa, serta tidak dapat melayani dan mengabulkan permintaan mereka di hari kiamat nanti. Tuhan-tuhan itu berlepas diri dari mereka, tidak mau bertanggung jawab, dan bahkan berkata, \"Sebenarnya mereka itu tidaklah menyembah kami, tetapi menyembah hawa nafsu mereka, dan sesuatu yang dianggap baik menurut ajakan dan bujukan setan.\" Allah berfirman:\n\nDan mereka telah memilih tuhan-tuhan selain Allah, agar tuhan-tuhan itu menjadi pelindung bagi mereka. Sama sekali tidak! Kelak mereka (se-sembahan) itu akan mengingkari penyembahan mereka terhadapnya, dan akan menjadi musuh bagi mereka. (Maryam\/19: 81-82)\n\nAyat 14 ini ditutup dengan ketegasan bahwa pemberitaan mengenai tuhan-tuhan yang menjadi sembahan kaum musyrikin adalah benar dan tidak mungkin keliru, karena informasi itu berasal dari Allah, Tuhan Maha Mengetahui segala sesuatu dengan pasti. Tidak ada yang tersembunyi bagi-Nya, baik di bumi maupun di langit. Firman Allah:\n\nBagi Allah tidak ada sesuatu pun yang tersembunyi di bumi dan di langit. (ali 'Imran\/3: 5",
      "text_translation": "Jika kamu menyeru mereka, mereka tidak mendengar seruanmu, dan sekiranya mereka mendengar, mereka juga tidak memperkenankan permintaanmu. Dan pada hari Kiamat mereka akan mengingkari kemusyrikanmu dan tidak ada yang dapat memberikan keterangan kepadamu seperti yang diberikan oleh (Allah) Yang Mahateliti.",
      "text": "اِنْ تَدْعُوْهُمْ لَا يَسْمَعُوْا دُعَاۤءَكُمْۚ وَلَوْ سَمِعُوْا مَا اسْتَجَابُوْا لَكُمْۗ وَيَوْمَ الْقِيٰمَةِ يَكْفُرُوْنَ بِشِرْكِكُمْۗ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيْرٍ ࣖ",
      "text_translation_en": "If you invoke them, they do not hear your call; and even if they could hear, they would not [be able to] respond to you. And [withal,] on the Day of Resurrection they will utterly disown your having associated them with God. And none can make thee understand [the truth] like the One who is all-aware.",
      "juz_number": 22
    },
    "15": {
      "text_tafsir_en": "In this verse it is explained that humans are very interested in their Creator, namely God because all humans need His help in all aspects of life, such as strength, fortune, resisting danger, getting pleasure, knowledge and so on, both worldly and the hereafter. All that will not happen except with the grace and taufik of Allah. Only Allah must be worshiped and hoped for His pleasure. He is Mahakaya, he doesn't need anything. Most praiseworthy for the favors that have been bestowed upon His servants. Every favor that humans have comes from His side. He is the one who should be praised and grateful for everything. In another verse Allah confirms: His own is in the heavens and what is on earth. And Allah is truly Mahakaya, Most Praiseworthy. (al-hajj \/ 22: 64)",
      "text_tafsir": "Pada ayat ini diterangkan bahwa manusia sangat berkepentingan kepada Penciptanya yaitu Allah karena semua manusia membutuhkan pertolongan-Nya dalam seluruh aspek kehidupan, seperti kekuatan, rezeki, menolak bahaya, mendapat kenikmatan, ilmu dan sebagainya, baik urusan dunia maupun akhirat. Semua itu tidak akan terjadi kecuali dengan rahmat dan taufik Allah. \n\nHanya Allah yang wajib disembah dan diharapkan rida-Nya. Ia Mahakaya, tidak memerlukan sesuatu. Maha Terpuji atas nikmat yang telah dianugerahkan kepada para hamba-Nya. Setiap nikmat yang dimiliki oleh manusia berasal dari sisi-Nya. Dialah yang seharusnya dipuji dan disyukuri dalam segala hal. Di ayat lain Allah menegaskan:\n\nMilik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Dan Allah benar-benar Mahakaya, Maha Terpuji. (al-hajj\/22: 64)",
      "text_translation": "Wahai manusia! Kamulah yang memerlukan Allah; dan Allah Dialah Yang Mahakaya (tidak memerlukan sesuatu), Maha Terpuji.",
      "text": "۞ يٰٓاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَاۤءُ اِلَى اللّٰهِ ۚوَاللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ ",
      "text_translation_en": "O men! It is you, who stand in need of God, whereas He alone is self-sufficient, the One to whom all praise is due.",
      "juz_number": 22
    },
    "16": {
      "text_tafsir_en": "These verses explain that God does not need anything, and that He has perfect power. If God were to destroy His creatures, then He would destroy them in a moment, for though He created them, He would have no need for them. He then replaced it with other creatures who would obey and obey his command, call good and prevent evil and evil. It is not difficult for God to do this, but it is easy. The Word of God: And if they do not pay attention to how God began creation (creation), then He repeats it. Indeed, that is easy for Allah. (al-'Ankabut \/ 29: 19)",
      "text_tafsir": "Ayat-ayat ini menjelaskan bahwa Allah tidak memerlukan suatu apa pun, dan Dia mempunyai kekuasaan yang sempurna. Jika Allah mau menghancurkan makhluk-Nya, maka dengan sekejap saja hancur binasalah semuanya, karena sekalipun Dia yang menciptakan, tetapi Dia tidak mempunyai keperluan sedikit pun padanya. Dia lalu menggantinya dengan makhluk lain yang akan patuh dan taat kepada perintah-Nya, menyerukan yang baik dan mencegah yang keji dan mungkar. Yang demikian itu tidak sulit bagi Allah untuk melaksanakannya, tetapi mudah sekali. Firman Allah:\n\nDan apakah mereka tidak memperhatikan bagaimana Allah memulai penciptaan (makhluk), kemudian Dia mengulanginya (kembali). Sungguh, yang demikian itu mudah bagi Allah. (al-'Ankabut\/29: 19)",
      "text_translation": "Jika Dia menghendaki, niscaya Dia membinasakan kamu dan mendatangkan makhluk yang baru (untuk menggantikan kamu).",
      "text": "اِنْ يَّشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيْدٍۚ ",
      "text_translation_en": "If He so wills, He can do away with you and bring forth a new mankind [in your stead]:",
      "juz_number": 22
    },
    "17": {
      "text_tafsir_en": "These verses explain that God does not need anything, and that He has perfect power. If God were to destroy His creatures, then He would destroy them in a moment, for though He created them, He would have no need for them. He then replaced it with other creatures who would obey and obey his command, call good and prevent evil and evil. It is not difficult for God to do this, but it is easy. The Word of God: And if they do not pay attention to how God began creation (creation), then He repeats it. Indeed, that is easy for Allah. (al-'Ankabut \/ 29: 19)",
      "text_tafsir": "Ayat-ayat ini menjelaskan bahwa Allah tidak memerlukan suatu apa pun, dan Dia mempunyai kekuasaan yang sempurna. Jika Allah mau menghancurkan makhluk-Nya, maka dengan sekejap saja hancur binasalah semuanya, karena sekalipun Dia yang menciptakan, tetapi Dia tidak mempunyai keperluan sedikit pun padanya. Dia lalu menggantinya dengan makhluk lain yang akan patuh dan taat kepada perintah-Nya, menyerukan yang baik dan mencegah yang keji dan mungkar. Yang demikian itu tidak sulit bagi Allah untuk melaksanakannya, tetapi mudah sekali. Firman Allah:\n\nDan apakah mereka tidak memperhatikan bagaimana Allah memulai penciptaan (makhluk), kemudian Dia mengulanginya (kembali). Sungguh, yang demikian itu mudah bagi Allah. (al-'Ankabut\/29: 19)",
      "text_translation": "Dan yang demikian itu tidak sulit bagi Allah.",
      "text": "وَمَا ذٰلِكَ عَلَى اللّٰهِ بِعَزِيْزٍ ",
      "text_translation_en": "nor is this difficult for God.",
      "juz_number": 22
    },
    "18": {
      "text_tafsir_en": "In this verse, God describes the power of the Day of Resurrection. On that day everyone will bear their own sins. A sinner will not bear the sins of others. If a person has a serious sin and asks others to bear the burden of his sin, then the sin will not be passed on to the beggar, regardless of his relatives, such as father, son, etc. Everyone on the Day of Judgment is busy with his own business of thinking and contemplating what will happen to him. God's Word: O man! Fear your Lord and fear the day when (a father) cannot help his son, and a son cannot (at least) help his father. Indeed, the promise of God must be true, so do not be deceived by the life of this world, and do not be deceived by deceivers in (obeying) Allah. (Luqman \/ 31: 33) Another verse explains: On that day a man fled from his brother, and from his mother and father, and from his wife and children. Every single one of them that day had an affair. ('Abasa \/ 80: 34-37) In al-Qurthubi's interpretation it is narrated from' Ikrimah that a father hangs his son on the Day of Judgment and says, \"O my son! How can I be your father,\" . The father said to his son again, \"O my son! I really need your good deeds even if they are heavy, so that I may be safe from what you see.\" His son answered, \"My father! You may ask a little, but I am as much concerned with myself as you are concerned about myself. Therefore, I cannot give you anything.\" Then he turned to his wife who hung her hope and said, \"O Fulanah! How can I be your husband?\" Then she praised her husband with a good compliment. The husband said to his wife, \"I ask of you one of your good deeds, that by your giving I may be safe from my circumstances, as you have witnessed.\" His wife replied, \"It's a small thing for you to ask, but I can't give it to you because I'm worried about what you're worried about.\" The content of this verse is a comfort to the Messenger of Allah because of his preaching which did not receive good response from his people and they remained stubborn. God explains that those who receive His counsel and warning are only those who fear Allah and His painful torment in the future, though they do not see it. It is not like the people whose hearts have been cut off by God so that they know nothing. They perform the obligatory prayers in accordance with the precepts and conditions, purify their hearts, and draw closer to God. Whoever purifies himself from shirk, sin, and unrighteousness, such as joy, lies, lies, and deceit, his good will return to himself. On the other hand, if he commits sin in his own eyes, his guilt is returned to him. This verse closes with one explanation that all matters are returned to God. Each person will be rewarded according to his charity in the world. If the good will be rewarded well, on the contrary, the bad deeds will be rewarded with a fair reward. The Word of God: Only to Allah is everything restored. (al-Anfal \/ 8: 44)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan kedahsyatan hari Kiamat. Pada hari itu setiap orang memikul dosanya masing-masing. Seseorang yang berdosa tidak akan memikul dosa orang lain. Jika ada yang merasa dosanya berat sekali, lalu meminta bantuan kepada orang lain untuk memikul sebagian dosanya, maka dosa itu tidak akan dipukulkan kepada yang diminta, sekalipun itu kaum kerabatnya, seperti ayah, anak, dan lain sebagainya. Setiap orang di hari Kiamat itu sibuk dengan urusannya masing-masing memikirkan dan merenungkan apa gerangan yang akan menimpa dirinya. Firman Allah:\n\nWahai manusia! Bertakwalah kepada Tuhanmu dan takutlah pada hari yang (ketika itu) seorang bapak tidak dapat menolong anaknya, dan seorang anak tidak dapat (pula) menolong bapaknya sedikit pun. Sungguh, janji Allah pasti benar, maka janganlah sekali-kali kamu teperdaya oleh kehidupan dunia, dan jangan sampai kamu teperdaya oleh penipu dalam (menaati) Allah. (Luqman\/31: 33)\n\nAyat lain menjelaskan:\n\nPada hari itu manusia lari dari saudaranya, dan dari ibu dan bapaknya, dan dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. ('Abasa\/80: 34-37)\n\nDalam tafsir al-Qurthubi diriwayatkan dari 'Ikrimah bahwa seorang bapak menggantungkan harapan kepada anaknya di hari kiamat dan berkata, \"Wahai anakku! Bagaimana aku sebagai bapakmu,\" lalu anak itu memujinya dengan pujian yang baik. Bapak itu berkata lagi kepada anaknya, \"Wahai anakku! Aku benar-benar memerlukan dari amal baikmu sekalipun hanya seberat zarrah, supaya aku selamat dari keadaanku sebagaimana yang engkau lihat.\" Anaknya menjawab, \"Wahai bapakku! Alangkah sedikitnya yang engkau minta, tetapi aku sendiri khawatir terhadap diriku sebagaimana bapak khawatir terhadap diri sendiri. Oleh karena itu, saya tidak dapat memberikan apa-apa barang sedikit pun.\" Kemudian ia beralih kepada istrinya yang menggantungkan harapannya dan berkata, \"Wahai Fulanah! Bagaimanakah aku sebagai suamimu?\" Lalu dipuji-pujinya suaminya itu dengan pujian yang baik. Berkatalah suami itu kepada istrinya, \"Aku meminta kepadamu satu saja dari amal baikmu, semoga dengan pemberianmu aku selamat dari keadaanku, sebagaimana yang kamu saksikan ini.\" Istrinya menjawab, \"Alangkah sedikitnya yang engkau minta, namun aku tidak bisa memberikannya karena aku khawatir juga seperti apa yang engkau khawatirkan.\" \n\nKandungan ayat ini sebagai penghibur hati Rasulullah karena dakwahnya yang tidak mendapat sambutan baik dari kaumnya dan mereka tetap keras kepala. Allah menjelaskan bahwa yang dapat menerima nasihat dan peringatan-Nya hanyalah orang-orang yang takut kepada Allah dan azab-Nya yang pedih di hari kemudian, sekalipun mereka tidak melihatnya. Tidak seperti halnya orang-orang yang telah dipatri hatinya oleh Allah sehingga mereka tidak tahu apa-apa. Mereka mengerjakan salat yang diwajibkan sesuai dengan rukun dan syaratnya, mensucikan hati mereka, dan mendekatkan diri kepada Allah. Barang siapa menyucikan dirinya dari syirik, perbuatan dosa, dan kedurhakaan, seperti ria, ujub, dusta, dan menipu, kebaikannya akan kembali kepada dirinya sendiri. Begitu pula sebaliknya, kalau ia berbuat maksiat bergelimang dosa, maka mudaratnya itu kembali kepada dirinya. \n\nAyat ini ditutup dengan satu penjelasan bahwa semua urusan dikembalikan kepada Allah. Tiap-tiap orang akan dibalas sesuai dengan amal perbuatannya di dunia. Kalau baik akan dibalas dengan baik, begitu pula sebaliknya, kalau amalnya jahat akan dibalas dengan balasan yang setimpal. Firman Allah:\n\nHanya kepada Allah segala urusan dikembalikan. (al-Anfal\/8: 44)",
      "text_translation": "Dan orang yang berdosa tidak akan memikul dosa orang lain. Dan jika seseorang yang dibebani berat dosanya memanggil (orang lain) untuk memikul bebannya itu tidak akan dipikulkan sedikit pun, meskipun (yang dipanggilnya itu) kaum kerabatnya. Sesungguhnya yang dapat engkau beri peringatan hanya orang-orang yang takut kepada (azab) Tuhannya (sekalipun) mereka tidak melihat-Nya dan mereka yang melaksanakan salat. Dan barangsiapa menyucikan dirinya, sesungguhnya dia menyucikan diri untuk kebaikan dirinya sendiri. Dan kepada Allah-lah tempat kembali.",
      "text": "وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰى ۗوَاِنْ تَدْعُ مُثْقَلَةٌ اِلٰى حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَيْءٌ وَّلَوْ كَانَ ذَا قُرْبٰىۗ اِنَّمَا تُنْذِرُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَاَقَامُوا الصَّلٰوةَ ۗوَمَنْ تَزَكّٰى فَاِنَّمَا يَتَزَكّٰى لِنَفْسِهٖ ۗوَاِلَى اللّٰهِ الْمَصِيْرُ ",
      "text_translation_en": "AND NO BEARER of burdens shall be made to bear another’s burden; and if one weighed down by his load calls upon [another] to help him carry it, nothing thereof may be carried [by that other], even if it be one’s near of kin. Hence, thou canst [truly] warn only those who stand in awe of their Sustainer although He is beyond the reach of their perception, and are constant in prayer, and [know that] whoever grows in purity, attains to purity but for the good of his own self, and [that] with God is all journeys’ end.",
      "juz_number": 22
    },
    "19": {
      "text_tafsir_en": "In this verse, Allah explains that those who do not know or deny the religion brought by the Prophet Muhammad are not the same as those who open their eyes wide so they can see and know clearly the truth of the religion they carry, then they follow and obey it . The first group includes people who are bad and don't know, while the second group are people who are good and know. The Word of God: Say (Muhammad), \"It is not the same which is bad with good.\" (al-Ma'idah. \/ 5: 100) And His words: Say, \"Are there those who know and those who do not know?\" (az-Zumar \/ 39: 9)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa orang-orang yang tidak mengetahui atau mengingkari agama yang dibawa oleh Nabi Muhammad tidak sama dengan orang-orang yang membuka matanya lebar-lebar sehingga dapat melihat dan mengetahui dengan jelas kebenaran agama yang dibawanya, lalu mereka mengikuti dan menaatinya. Golongan pertama termasuk orang-orang yang jahat dan tidak mengetahui, sedang golongan kedua adalah orang-orang yang baik dan mengetahui.\n\nFirman Allah:\n\nKatakanlah (Muhammad), \"Tidaklah sama yang buruk dengan yang baik.\" (al-Ma'idah.\/5: 100) \n\nDan firman-Nya:\n\nKatakanlah, \"Apakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui?\" (az-Zumar\/39: 9)",
      "text_translation": "Dan tidaklah sama orang yang buta dengan orang yang melihat,",
      "text": "وَمَا يَسْتَوِى الْاَعْمٰى وَالْبَصِيْرُ ۙ ",
      "text_translation_en": "For [thus it is:] the blind and the seeing are not equal;",
      "juz_number": 22
    },
    "20": {
      "text_tafsir_en": "In this verse, God explains that unbelief is not the same as faith, because unbelief is darkness, not knowing the rules of God. The disbelievers walk in darkness, unable to get out of it, and even drift into worldly misery and the hereafter. It is the light of faith that illuminates Muslims in the right way and brings happiness to the world and the hereafter. Some disbelievers define 'darkness here with' falsehood, and 'light with' truth, falsehood and truth are not the same.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa kekafiran tidak sama dengan iman, karena kekafiran adalah kegelapan, tidak mengetahui peraturan Allah. Orang kafir berjalan dalam kegelapan, tidak dapat keluar darinya, bahkan hanyut dalam kesesatan di dunia dan akhirat. Adapun cahaya iman menerangi orang Islam kepada jalan yang benar dan membawa kebahagiaan dunia dan akhirat. Sebagian mufasir mengartikan 'gelap gulita di sini dengan 'kebatilan, dan 'cahaya dengan 'kebenaran, kebatilan dan kebenaran tidak sama.",
      "text_translation": "dan tidak (pula) sama gelap gulita dengan cahaya,",
      "text": "وَلَا الظُّلُمٰتُ وَلَا النُّوْرُۙ ",
      "text_translation_en": "nor are the depths of darkness and the light;",
      "juz_number": 22
    },
    "21": {
      "text_tafsir_en": "Furthermore, God explains that the protected are not the same as those exposed to heat. Some scholars interpret dhill (shade \/ shade) here as heaven, because it has shade that causes cold air. As the word of God says: The parable of the heaven which is promised to the righteous (that is, like a garden), flowing beneath the rivers; always fruity and shady. (ar-Ra'd \/ 13: 35) The harr (heat) is interpreted as hell, for it is a very hot place and full of flaming fire, much hotter than any known fire in the world. Just as a spark of hell fire falls on the world, then the world will heat up as described in a hadith. If a flicker of fire from the flames of the fire is in the east, then it will feel the heat (of the people) in the west. (Ath-thabrani history of Anas bin Malik)",
      "text_tafsir": "Selanjutnya, Allah menerangkan bahwa yang terlindung tidak sama dengan yang terkena panas. Sebagian ulama tafsir mengartikan dhill (teduh\/naungan) di sini dengan surga, karena surga itu mempunyai naungan yang menyebabkan hawa sejuk. Sebagaimana firman Allah:\n\nPerumpamaan surga yang dijanjikan kepada orang yang bertakwa (ialah seperti taman), mengalir di bawahnya sungai-sungai; senantiasa berbuah dan teduh. (ar-Ra'd\/13: 35) \n\nSedang harr (panas) diartikan dengan neraka, karena ia memang satu tempat yang amat panas dan penuh dengan api yang menyala-nyala, jauh lebih panas dari api yang dikenal di dunia. Sepercik bunga api neraka saja jatuh di dunia, maka dunia akan panas seluruhnya sebagaimana dijelaskan di dalam suatu hadis.\n\nSekiranya sepercik api dari bunga-bunga api neraka (berada) di timur, maka akan dirasakan panasnya (oleh orang-orang yang berada) di barat. (Riwayat ath-thabrani dari Anas bin Malik)",
      "text_translation": "dan tidak (pula) sama yang teduh dengan yang panas,",
      "text": "وَلَا الظِّلُّ وَلَا الْحَرُوْرُۚ ",
      "text_translation_en": "nor the [cooling] shade and the scorching heat:",
      "juz_number": 22
    },
    "22": {
      "text_tafsir_en": "At the beginning of this verse, God explains that those whose hearts are alive because they believe in Allah and His Messenger, and know the Qur'an and its contents, are not the same as those who die in their hearts because of their disbelief. These latter do not want to know the commandments and prohibitions of Allah, cannot distinguish between guidance and error. This is a parable for the believers and for the unbelievers. The Word of God: And is it that the dead are raised to life and We give them light that makes them walk in the midst of many, like those who are in darkness, so that they cannot go out from there? (al-An'am \/ 6: 122) And his word: The parable of the two groups (unbelievers and believers), like the blind and the deaf with those who can see and hear. What are the two groups? Then aren't you taking lessons? (Hud \/ 11: 24) The believers saw, heard, and bathed in bright light as they crossed the shirathal mustaqim to a cool, shady, and abundant paradise. While blind and deaf unbelievers walk in the darkness of darkness and cannot escape it, they are always arrogant in their error of the world and in the afterlife until it is decidedly a fiery hell, full of flames. Allah guides those whom He pleases, hears the truth of the apostle's truth, and accepts the religion he brings to Islam. Just as the dead are brought into the grave, they cannot hear the counsel and counsel that will guide them in the right way, as will the dead. The warnings of God will not be of benefit to him. They could not understand the content of the Qur'an and the teachings of religion.",
      "text_tafsir": "Pada awal ayat ini, Allah menerangkan bahwa orang-orang yang hatinya hidup karena beriman kepada Allah dan rasul-Nya, serta mengetahui Al-Qur'an dan isinya, tidak sama dengan orang yang mati hatinya akibat ditutupi kekafiran. Mereka yang terakhir ini tidak mau mengetahui perintah dan larangan Allah, tidak dapat membedakan antara petunjuk dan kesesatan. Ini adalah perumpamaan bagi orang-orang yang mukmin dan bagi orang-orang kafir. Firman Allah:\n\nDan apakah orang yang sudah mati lalu Kami hidupkan dan Kami beri dia cahaya yang membuatnya dapat berjalan di tengah-tengah orang banyak, sama dengan orang yang berada dalam kegelapan, sehingga dia tidak dapat keluar dari sana? (al-An'am\/6: 122) \n\nDan firman-Nya:\n\nPerumpamaan kedua golongan (orang kafir dan mukmin), seperti orang buta dan tuli dengan orang yang dapat melihat dan dapat mendengar. Samakah kedua golongan itu? Maka tidakkah kamu mengambil pelajaran? (Hud\/11: 24)\n\nOrang mukmin itu melihat, mendengar, dan bermandikan cahaya terang-benderang ketika melintasi shirathal mustaqim sampai ke surga yang sejuk, mempunyai naungan, dan mata air yang banyak. Sedangkan orang kafir buta dan tuli berjalan di dalam gelap gulita tidak dapat keluar daripadanya, bahkan selalu bersikap sombong di dalam kesesatannya di dunia dan akhirat sampai diberi keputusan masuk neraka yang sangat panas, penuh api menyala-nyala. Allah memberi petunjuk kepada orang-orang yang dikehendaki-Nya, mau mendengar hujjah atas kebenaran rasul, dan menerima agama yang dibawanya yaitu Islam dengan baik. Sebagaimana halnya orang yang telah mati dimasukkan dalam kubur, tidak dapat mendengar nasihat-nasihat dan saran-saran yang akan membimbingnya ke jalan yang benar, begitu pula orang yang mati hatinya. Tidak akan bermanfaat baginya peringatan-peringatan Allah. Mereka tidak dapat memahami isi Al-Qur'an dan ajaran-ajaran agama.",
      "text_translation": "dan tidak (pula) sama orang yang hi-dup dengan orang yang mati. Sungguh, Allah memberikan pendengaran kepada siapa yang Dia kehendaki dan engkau (Muhammad) tidak akan sanggup menjadikan orang yang di dalam kubur dapat mendengar.",
      "text": "وَمَا يَسْتَوِى الْاَحْيَاۤءُ وَلَا الْاَمْوَاتُۗ اِنَّ اللّٰهَ يُسْمِعُ مَنْ يَّشَاۤءُ ۚوَمَآ اَنْتَ بِمُسْمِعٍ مَّنْ فِى الْقُبُوْرِ ",
      "text_translation_en": "and neither are equal the living and the dead [of heart]. Behold, [O Muhammad,] God can make hear whomever He wills, whereas thou canst not make hear such as are [dead of heart like the dead] in their graves:",
      "juz_number": 22
    },
    "23": {
      "text_tafsir_en": "In this verse, Allah explains that the duty of the Prophet Muhammad is only to give warnings to humans who have not received a clue. He was not burdened with orders to force them to accept the instructions and the religion they brought, because the instructions were entirely in the hands of God. Therefore, it is not the place of the Prophet Muhammad to grieve and feel disappointed if they did not want to welcome his call. This task was confirmed by the Prophet Muhammad as the word of God: Say (Muhammad), \"Verily, I am only a reminder,\" (shad \/ 38: 65) And His words: Revealed to me, that I am only a real warning. \" (shad \/ 38: 70)",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan bahwa tugas Nabi Muhammad hanyalah memberi peringatan kepada manusia yang belum mendapat petunjuk. Ia tidak dibebani perintah untuk memaksa mereka menerima petunjuk dan agama yang dibawanya, karena petunjuk itu adalah sepenuhnya berada di tangan Allah. Oleh karena itu, tidak pada tempatnya Nabi Muhammad bersedih hati dan merasa kecewa kalau mereka itu belum mau menyambut baik seruannya. Tugas ini ditegaskan oleh Nabi Muhammad sebagaimana firman Allah:\n\nKatakanlah (Muhammad), \"Sesungguhnya aku hanya seorang pemberi peringatan,\" (shad\/38: 65) \n\nDan firman-Nya:\n\nYang diwahyukan kepadaku, bahwa aku hanyalah seorang pemberi peringatan yang nyata.\" (shad\/38: 70)",
      "text_translation": "Engkau tidak lain hanyalah seorang pemberi peringatan.",
      "text": "اِنْ اَنْتَ اِلَّا نَذِيْرٌ",
      "text_translation_en": "thou art nothing but a warner.",
      "juz_number": 22
    },
    "24": {
      "text_tafsir_en": "This verse explains that the Prophet Muhammad was sent to mankind so that they would believe in the One True God with the Shari'ah obligated to His servant. The Prophet (peace be upon him) was also ordered to give glad tidings to those who justified his brochures and to accept the religion which he had brought from Allah, that they would be admitted into a paradise full of pleasure and pleasure. It also warns those who deny it and reject the revelation revealed from God that they will be put into hell full of torment and torment. In another verse God declares as follows: And We send thee (Muhammad), only as a bearer of glad tidings and a warner. (al-Isra '\/ 17: 105) There has been no people since the time of Adam except Allah sent them a messenger to warn. Thus, the people had no reason to rebel against God after being sent by the apostles. The Word of God: The apostles are the bearers of the glad tidings and the warners, so that there is no reason for man to disobey God once the apostles are sent. (an-Nisa '\/ 4: 165) And he said: We will not suffer until We send an apostle. (al-Isra '\/ 17: 15) In another verse it is also stated as follows: And if they (disbelievers) deny you (Muhammad), then the people before them, the people of Noah,' Ad, and Samud (and denied his apostles), and (so did) the Abrahamites and the people of Lot and the people of Midian. And Moses was rejected, but I gave the unbelievers a time, and then I punished them, and how great was my punishment. (al-hajj \/ 22: 42-44)",
      "text_tafsir": "Ayat ini menerangkan bahwa Nabi Muhammad diutus kepada manusia agar mereka beriman kepada Allah Yang Maha Esa disertai dengan syariat yang diwajibkan kepada hamba-Nya. Nabi saw juga diperintahkan untuk memberi kabar gembira kepada orang yang membenarkan risalahnya dan menerima baik agama yang dibawanya dari Allah, bahwa mereka akan dimasukkan ke dalam surga yang penuh dengan kenikmatan dan kesenangan. Juga memberi peringatan kepada orang yang mendustakannya dan menolak wahyu yang diturunkan dari Allah bahwa mereka akan dimasukkan ke dalam neraka yang penuh dengan azab dan siksa yang amat pedih. Pada ayat yang lain Allah menegaskan sebagai berikut:\n\nDan Kami mengutus engkau (Muhammad), hanya sebagai pembawa berita gembira dan pemberi peringatan. (al-Isra'\/17: 105)\n\nTidak ada suatu umat pun sejak Nabi Adam kecuali Allah mengutus kepada mereka seorang utusan yang memberi peringatan. Dengan demikian, umat itu tidak mempunyai alasan lagi untuk membantah Allah sesudah diutus-Nya para rasul itu. Firman Allah:\n\nRasul-rasul itu adalah sebagai pembawa berita gembira dan pemberi peringatan, agar tidak ada alasan bagi manusia untuk membantah Allah setelah rasul-rasul itu diutus. (an-Nisa'\/4: 165) \n\nDan firman-Nya:\n\nKami tidak akan menyiksa sebelum Kami mengutus seorang rasul. (al-Isra'\/17: 15)\n\nPada ayat lain ditegaskan juga sebagai berikut:\n\nDan jika mereka (orang-orang musyrik) mendustakan engkau (Muhammad), begitu pulalah kaum-kaum yang sebelum mereka, kaum Nuh, 'Ad, dan Samud (juga telah mendustakan rasul-rasul-Nya), dan (demikian juga) kaum Ibrahim dan kaum Lut, dan penduduk Madyan. Dan Musa (juga) telah didustakan, namun Aku beri tenggang waktu kepada orang-orang kafir, kemudian Aku siksa mereka, maka betapa hebatnya siksaan-Ku. (al-hajj\/22: 42-44)",
      "text_translation": "Sungguh, Kami mengutus engkau dengan membawa kebenaran sebagai pembawa berita gembira dan sebagai pemberi peringatan. Dan tidak ada satu pun umat melainkan di sana telah datang seorang pemberi peringatan.",
      "text": "اِنَّآ اَرْسَلْنٰكَ بِالْحَقِّ بَشِيْرًا وَّنَذِيْرًا ۗوَاِنْ مِّنْ اُمَّةٍ اِلَّا خَلَا فِيْهَا نَذِيْرٌ ",
      "text_translation_en": "Verily, We have sent thee with the truth, as a bearer of glad tidings and a warner: for there never was any community but a warner has [lived and] passed away in its midst.",
      "juz_number": 22
    },
    "25": {
      "text_tafsir_en": "In this verse, God explains that after they had rejected the coming of the apostles and rejected the religion they brought, He punished the unbelievers with a painful torment. How great is the wrath of Allah against them when they remain in opposition, and still reject the recitation of Muhammad and the religion they carry. They will experience what the people have experienced in the past. Thus the circumcision continues and will not change. As the word of Allah says: As the Sunnah of Allah is (the same) for those who have gone before (you), and you will not find any change in the Sunnah of Allah. (al-Ahzab \/ 33: 62)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa setelah mereka mengingkari kedatangan rasul dan mendustakan agama yang dibawanya, Dia mengazab orang-orang kafir itu dengan azab yang pedih. Alangkah hebatnya kemurkaan Allah kepada mereka apabila mereka tetap dalam keadaan membangkang, serta tetap mengingkari kerasulan Muhammad saw dan agama yang dibawanya. Mereka akan mengalami seperti apa yang telah dialami umat dahulu. Demikian sunatullah tetap berlaku dan tidak akan berubah. Sebagaimana firman Allah:\n\nSebagai sunnah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunah Allah. (al-Ahzab\/33: 62)",
      "text_translation": "Dan jika mereka mendustakanmu, maka sungguh, orang-orang yang sebelum mereka pun telah mendustakan (rasul-rasul); ketika rasul-rasulnya datang dengan membawa keterangan yang nyata (mukjizat), zubur, dan kitab yang memberi penjelasan yang sempurna.",
      "text": "وَاِنْ يُّكَذِّبُوْكَ فَقَدْ كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ ۚجَاۤءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِ وَبِالزُّبُرِ وَبِالْكِتٰبِ الْمُنِيْرِ ",
      "text_translation_en": "And if they give thee the lie - even so gave the lie to the truth [many of] those who lived before their time, [when] there came unto them their apostles with all evidence of the truth, and with books of divine wisdom, and with light-giving revelation;",
      "juz_number": 22
    },
    "26": {
      "text_tafsir_en": "In this verse, God explains that after they had rejected the coming of the apostles and rejected the religion they brought, He punished the unbelievers with a painful torment. How great is the wrath of Allah against them when they remain in opposition, and still reject the recitation of Muhammad and the religion they carry. They will experience what the people have experienced in the past. Thus the circumcision continues and will not change. As the word of Allah says: As the Sunnah of Allah is (the same) for those who have gone before (you), and you will not find any change in the Sunnah of Allah. (al-Ahzab \/ 33: 62)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa setelah mereka mengingkari kedatangan rasul dan mendustakan agama yang dibawanya, Dia mengazab orang-orang kafir itu dengan azab yang pedih. Alangkah hebatnya kemurkaan Allah kepada mereka apabila mereka tetap dalam keadaan membangkang, serta tetap mengingkari kerasulan Muhammad saw dan agama yang dibawanya. Mereka akan mengalami seperti apa yang telah dialami umat dahulu. Demikian sunatullah tetap berlaku dan tidak akan berubah. Sebagaimana firman Allah:\n\nSebagai sunnah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunah Allah. (al-Ahzab\/33: 62)",
      "text_translation": "Kemudian Aku azab orang-orang yang kafir; maka (lihatlah) bagaimana akibat kemurkaan-Ku.",
      "text": "ثُمَّ اَخَذْتُ الَّذِيْنَ كَفَرُوْا فَكَيْفَ كَانَ نَكِيْرِ ࣖ ",
      "text_translation_en": "[but] in the end I took to task all those who were bent on denying the truth: and how awesome was My rejection!",
      "juz_number": 22
    },
    "27": {
      "text_tafsir_en": "In this verse, Allah outlines several things that show His perfection and power, which humans can see at all times. If they realize and realize all that, of course they will also realize the oneness and power of Allah the Most Perfect. Among the signs is that God made something of a variety of kinds originating from one. God sends rain from the sky, so that plants can grow and produce fruits of various colors, flavors, shapes and aromas, as we have seen. The fruits are yellow, red, green, and so on. The same thing is explained in another verse. God's Word: And on earth there are adjoining parts, vineyards, plants, branched date palms, and unbranched ones; doused with the same water, but We add one plant to another in terms of taste. Indeed, in that there are signs (the greatness of God) for those who understand. (ar-Ra'd \/ 13: 4) God also created mountains that looked like lines, some that looked white, red, and jet black. Among the mountains stretches are also of varying colors. According to scientists, colored lines in rocks are most commonly found in sedimentary rock types. Sedimentary rocks are formed from the deposition of material transported by water or wind flow. The deposited material is fine grains in the form of sand, dust, or clay as a result of weathering rocks in other places, which are then separated from the parent rock and transported by water flow or wind. The sedimentation sites of these sediments are generally located in low parts where the speed of the transporting force (water flow, wind gusts) is reduced. Common areas known as settling sites are plains, coastal areas, especially deltaic areas, and the seabed. In the process of transportation (transportation) and sedimentation (sorting) also occurs sorting mechanism in which in general material with the same physical characteristics (for example in terms of grain size or specific gravity) will be deposited in the same depositional environment. This weathering, transportation, and sedimentation process continues throughout the history of the earth which can take thousands or even millions of years. During this process there are also changes in both the depositional environment and the type of deposited material, so that sedimentary rocks form layers that also describe the historical sequence (time) of deposition. Another geological mechanism which is common in sedimentary rocks is experiencing lifting by the presence of tectonic forces so that sedimentary rocks that usually form in low places can be found on the tops of mountains. At incised peaks, both by erosion and by cracking, these layers of sediment will appear to the surface. Each layer in sedimentary rock can have a different color because it is composed of different materials. This color difference is mainly characterized by differences in its mineralogical arrangement. For example: minerals containing red iron oxide compounds (hematite), white minerals such as alumino-silica (kaoline), metal hydroxide minerals (goethite, brucite, diaspore, boehmite) can provide various colors (yellow, green, gray, black, pink), which have clear colors such as silica (quartz). Colorful hard rocks or minerals are usually rubbed into jewelry stones.",
      "text_tafsir": "Pada ayat ini, Allah menguraikan beberapa hal yang menunjukkan kesempurnaan dan kekuasaan-Nya, yang dapat dilihat manusia setiap waktu. Jika mereka menyadari dan menginsyafi semuanya itu, tentu mereka akan menyadari pula keesaan dan kekuasaan Allah Yang Maha Sempurna itu. Di antara tanda-tanda itu adalah Allah menjadikan sesuatu yang beraneka ragam macamnya yang bersumber dari yang satu. Allah menurunkan hujan dari langit, sehingga tanaman bisa tumbuh dan mengeluarkan buah-buahan yang beraneka ragam warna, rasa, bentuk, dan aromanya, sebagaimana yang kita saksikan. Buah-buahan itu warnanya ada yang kuning, merah, hijau, dan sebagainya. Hal yang sama dijelaskan pula di dalam ayat yang lain. Firman Allah:\n\nDan di bumi terdapat bagian-bagian yang berdampingan, kebun-kebun anggur, tanaman-tanaman, pohon kurma yang bercabang, dan yang tidak bercabang; disirami dengan air yang sama, tetapi Kami lebihkan tanaman yang satu dari yang lainnya dalam hal rasanya. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang mengerti. (ar-Ra'd\/13: 4)\n\nAllah juga menciptakan gunung-gunung yang kelihatan seperti garis-garis, ada yang kelihatan putih, merah, dan hitam pekat. Di antara gunung-gunung itu terbentang pula jalan-jalan yang beraneka ragam pula warnanya.\n\nMenurut para saintis, garis-garis berwarna pada batuan paling umum dijumpai pada jenis batuan sedimen. Batuan sedimen terbentuk dari hasil pengendapan bahan yang terangkut oleh aliran air atau angin. Bahan yang diendapkan adalah butiran-butiran halus berupa pasir, debu, atau lempung sebagai hasil pelapukan batuan di tempat lain, yang kemudian terlepas dari batuan induknya dan terangkut oleh aliran air atau tiupan angin. Tempat pengendapan bahan sedimen ini umumnya terletak pada bagian-bagian yang rendah di mana kecepatan tenaga pengangkut (arus air, hembusan angin) berkurang. Daerah-daerah yang umum dikenal sebagai tempat pengendapan adalah dataran, pesisir terutama daerah delta, dan dasar laut. \n\nPada proses pengangkutan (transportasi) dan pengendapan (sedimentasi) terjadi pula mekanisme pemilahan (sorting) di mana pada umumnya bahan dengan karakteristik fisik yang sama (misalnya dalam hal ukuran butir atau berat jenis) akan diendapkan pada lingkungan pengendapan yang sama. \n\nProses pelapukan, pengangkutan, dan pengendapan ini berjalan terus- menerus sepanjang sejarah bumi yang dapat memakan waktu ribuan bahkan jutaan tahun. \n\nSelama proses ini berjalan terdapat pula perubahan-perubahan baik dalam hal lingkungan pengendapan maupun jenis bahan yang diendapkan, sehingga pada batuan sedimen terbentuk lapisan-lapisan yang juga melukiskan urutan sejarah (waktu) pengendapan. Mekanisme geologi lain yang biasa terjadi pada batuan sedimen adalah mengalami pengangkatan oleh adanya gaya tektonik sehingga batuan sedimen yang biasanya terbentuk di tempat-tempat yang rendah bisa dijumpai di puncak-puncak gunung. Pada puncak-puncak gunung yang tertoreh, baik oleh pengikisan maupun oleh terjadinya rekahan, lapisan-lapisan sedimen ini akan tampak ke permukaan.\n\nSetiap lapisan pada batuan sedimen dapat memiliki warna yang berbeda karena tersusun dari material yang berbeda. Perbedaan warna ini terutama dicirikan oleh perbedaan susunan mineralogisnya. Misal: mineral-mineral yang mengandung senyawa besi oksida (hematit) berwarna merah, mineral yang berwarna putih antara lain alumino-silika (kaoline), mineral-mineral logam hidroksida (goethite, brucite, diaspore, boehmite) dapat memberikan berbagai warna (kuning, hijau, abu-abu, hitam, merah muda), yang berwarna bening antara lain silika (kuarsa). Batuan atau mineral keras yang berwarna-warni biasa digosok menjadi batu perhiasan.",
      "text_translation": "Tidakkah engkau melihat bahwa Allah menurunkan air dari langit lalu dengan air itu Kami hasilkan buah-buahan yang beraneka macam jenisnya. Dan di antara gunung-gunung itu ada garis-garis putih dan merah yang beraneka macam warnanya dan ada (pula) yang hitam pekat.",
      "text": "اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَاۤءِ مَاۤءًۚ فَاَخْرَجْنَا بِهٖ ثَمَرٰتٍ مُّخْتَلِفًا اَلْوَانُهَا ۗوَمِنَ الْجِبَالِ جُدَدٌ ۢبِيْضٌ وَّحُمْرٌ مُّخْتَلِفٌ اَلْوَانُهَا وَغَرَابِيْبُ سُوْدٌ ",
      "text_translation_en": "ART THOU NOT aware that God sends down water from the skies, whereby We bring forth fruits of many hues - just as in the mountains there are streaks of white and red of various shades, as well as (others) raven-black,",
      "juz_number": 22
    },
    "28": {
      "text_tafsir_en": "In this verse, God adds further explanations of things that show His perfection and power. God created animals both animals and animals, whose colors are of the same kind. There are even one animal, but they have different colors. Holiness is the best Creator of the universe. In line with this the word of God: And among His signs is the creation of heaven and earth, the difference between your language and the color of your skin. (ar-Romans \/ 30:22) Thus God shows the signs of His power as above to be known in depth. Only scholars are fully aware and aware of the signs of God's power, so they are completely submissive to His power and afraid of His torment. Ibn 'Abbas said, \"The so-called scholars are those who know that Allah is omnipotent.\" In another history, Ibn 'Abbas said, \"The scholars were those who did not associate with God in anything, who justified God's law and prohibited what He had forbidden, kept His commandments, and believed that he would to meet Him who will devour and repay all human deeds. \" This verse closes with an affirmation that Almighty God acts on those who disbelieve in Him. He does not punish those who believe and obey Him, but He is forgiving to them. He has the power to punish those who sin and commit sin, just as He has the power to reward those who obey him and to forgive their sins, so man should fear him.",
      "text_tafsir": "Pada ayat ini, Allah menambah penjelasan lagi tentang hal-hal yang menunjukkan kesempurnaan dan kekuasaan-Nya. Allah menciptakan binatang melata dan binatang ternak, yang bermacam-macam warnanya sekalipun berasal dari jenis yang satu. Bahkan ada binatang yang satu, tetapi memiliki warna yang bermacam-macam. Mahasuci Allah pencipta alam semesta dengan sebaik-baiknya. Sejalan dengan ini firman Allah:\n\nDan di antara tanda-tanda (kebesaran)-Nya ialah penciptaan langit dan bumi, perbedaan bahasamu dan warna kulitmu. (ar-Rum\/30: 22)\n\nDemikianlah Allah menunjukkan tanda-tanda kekuasaan-Nya seperti tersebut di atas untuk dapat diketahui secara mendalam. Hanya ulama yang benar-benar menyadari dan mengetahui tanda-tanda kekuasaan Allah, sehingga mereka benar-benar tunduk kepada kekuasaan-Nya dan takut kepada siksa-Nya.\n\nIbnu 'Abbas berkata, \"Yang dinamakan ulama ialah orang-orang yang mengetahui bahwa Allah itu Mahakuasa atas segala sesuatu.\" Di dalam riwayat lain, Ibnu 'Abbas berkata, \"Ulama itu ialah orang yang tidak mempersekutukan Tuhan dengan sesuatu apa pun, yang menghalalkan yang telah dihalalkan Allah dan mengharamkan yang telah diharamkan-Nya, menjaga perintah-perintah-Nya, dan yakin bahwa dia akan bertemu dengan-Nya yang akan menghisab dan membalas semua amalan manusia.\"\n\nAyat ini ditutup dengan suatu penegasan bahwa Allah Mahaperkasa menindak orang-orang yang kafir kepada-Nya. Dia tidak mengazab orang-orang yang beriman dan taat kepada-Nya, tetapi Maha Pengampun kepada mereka. Dia kuasa mengazab orang-orang yang selalu berbuat maksiat dan bergelimang dosa, sebagaimana Dia kuasa memberi pahala kepada orang-orang yang taat kepada-Nya dan mengampuni dosa-dosa mereka, maka sepatutnya manusia itu takut kepada-Nya.",
      "text_translation": "Dan demikian (pula) di antara manusia, makhluk bergerak yang bernyawa dan hewan-hewan ternak ada yang bermacam-macam warnanya (dan jenisnya). Di antara hamba-hamba Allah yang takut kepada-Nya, hanyalah para ulama. Sungguh, Allah Mahaperkasa, Maha Pengampun.",
      "text": "وَمِنَ النَّاسِ وَالدَّوَاۤبِّ وَالْاَنْعَامِ مُخْتَلِفٌ اَلْوَانُهٗ كَذٰلِكَۗ اِنَّمَا يَخْشَى اللّٰهَ مِنْ عِبَادِهِ الْعُلَمٰۤؤُاۗ اِنَّ اللّٰهَ عَزِيْزٌ غَفُوْرٌ ",
      "text_translation_en": "and (as) there are in men, and in crawling beasts, and in cattle, too, many hues? Of all His servants, only such as are endowed with [innate] knowledge stand [truly] in awe of God: [for they alone comprehend that,] verily, God is almighty, much-forgiving.",
      "juz_number": 22
    },
    "29": {
      "text_tafsir_en": "In this verse, Allah explains that those who read the Qur'an, believe the news, learn its words and meanings and practice it, follow the commandments, avoid the prohibitions, perform the prayers in due course in a sincere and sincere way and devoutly, disposing of their property without exaggeration sincerely, whether openly or openly, they are the ones who practice their knowledge and do good to their Lord. They are like traders who do not lose, but gain double the reward of God's grace, based on their charity. The Word of God: As for those who believe and do good, Allah will reward them and increase some of His bounty. (an-Nisa '\/ 4: 173) Moreover, they will also be forgiven of the wrongs and evils which they have committed, for Allah is Oft-Forgiving, Most Merciful to His servants, bestowing reward for their deeds, forgive him and increase his favor. In line with this the word of God: Indeed, Allah is Oft-Forgiving, Most Merciful. (Asi-Syura \/ 42: 23)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa orang-orang yang selalu membaca Al-Qur'an, meyakini berita, mempelajari kata dan maknanya lalu diamalkan, mengikuti perintah, menjauhi larangan, mengerjakan salat pada waktunya sesuai dengan cara yang telah ditetapkan dan dengan penuh ikhlas dan khusyuk, menafkahkan harta bendanya tanpa berlebih-lebihan dengan ikhlas tanpa ria, baik secara diam-diam atau terang-terangan, mereka adalah orang yang mengamalkan ilmunya dan berbuat baik dengan Tuhan mereka. Mereka itu ibarat pedagang yang tidak merugi, tetapi memperoleh pahala yang berlipat ganda sebagai karunia Allah, berdasarkan amal baktinya. Firman Allah:\n\nAdapun orang-orang yang beriman dan mengerjakan kebajikan, Allah akan menyempurnakan pahala bagi mereka dan menambah sebagian dari karunia-Nya. (an-Nisa'\/4: 173) \n\nSelain dari itu, mereka juga akan memperoleh ampunan atas kesalahan dan kejahatan yang telah dilakukan, karena Allah Maha Pengampun lagi Maha Mensyukuri hamba-hamba-Nya, memberikan pahala yang sempurna terhadap amal-amal mereka, memaafkan kesalahannya dan menambah nikmat-Nya. Sejalan dengan ini firman Allah:\n\nSungguh, Allah Maha Pengampun, Maha Mensyukuri. (asy-Syura\/42: 23)",
      "text_translation": "Sesungguhnya orang-orang yang selalu membaca Kitab Allah (Al-Qur'an) dan melaksanakan salat dan menginfakkan sebagian rezeki yang Kami anugerahkan kepadanya dengan diam-diam dan terang-terangan, mereka itu mengharapkan perdagangan yang tidak akan rugi,",
      "text": "اِنَّ الَّذِيْنَ يَتْلُوْنَ كِتٰبَ اللّٰهِ وَاَقَامُوا الصَّلٰوةَ وَاَنْفَقُوْا مِمَّا رَزَقْنٰهُمْ سِرًّا وَّعَلَانِيَةً يَّرْجُوْنَ تِجَارَةً لَّنْ تَبُوْرَۙ ",
      "text_translation_en": "(It is) they who [truly] follow God’s revelation, and are constant in prayer, and spend on others, secretly and openly, out of what We provide for them as sustenance - it is they who may look forward to a bargain that can never fail,",
      "juz_number": 22
    },
    "30": {
      "text_tafsir_en": "In this verse, Allah explains that those who read the Qur'an, believe the news, learn its words and meanings and practice it, follow the commandments, avoid the prohibitions, perform the prayers in due course in a sincere and sincere way and devoutly, disposing of their property without exaggeration sincerely, whether openly or openly, they are the ones who practice their knowledge and do good to their Lord. They are like traders who do not lose, but gain double the reward of God's grace, based on their charity. The Word of God: As for those who believe and do good, Allah will reward them and increase some of His bounty. (an-Nisa '\/ 4: 173) Moreover, they will also be forgiven of the wrongs and evils which they have committed, for Allah is Oft-Forgiving, Most Merciful to His servants, bestowing reward for their deeds, forgive him and increase his favor. In line with this the word of God: Indeed, Allah is Oft-Forgiving, Most Merciful. (Asi-Syura \/ 42: 23)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa orang-orang yang selalu membaca Al-Qur'an, meyakini berita, mempelajari kata dan maknanya lalu diamalkan, mengikuti perintah, menjauhi larangan, mengerjakan salat pada waktunya sesuai dengan cara yang telah ditetapkan dan dengan penuh ikhlas dan khusyuk, menafkahkan harta bendanya tanpa berlebih-lebihan dengan ikhlas tanpa ria, baik secara diam-diam atau terang-terangan, mereka adalah orang yang mengamalkan ilmunya dan berbuat baik dengan Tuhan mereka. Mereka itu ibarat pedagang yang tidak merugi, tetapi memperoleh pahala yang berlipat ganda sebagai karunia Allah, berdasarkan amal baktinya. Firman Allah:\n\nAdapun orang-orang yang beriman dan mengerjakan kebajikan, Allah akan menyempurnakan pahala bagi mereka dan menambah sebagian dari karunia-Nya. (an-Nisa'\/4: 173) \n\nSelain dari itu, mereka juga akan memperoleh ampunan atas kesalahan dan kejahatan yang telah dilakukan, karena Allah Maha Pengampun lagi Maha Mensyukuri hamba-hamba-Nya, memberikan pahala yang sempurna terhadap amal-amal mereka, memaafkan kesalahannya dan menambah nikmat-Nya. Sejalan dengan ini firman Allah:\n\nSungguh, Allah Maha Pengampun, Maha Mensyukuri. (asy-Syura\/42: 23)",
      "text_translation": "agar Allah menyempurnakan pahalanya kepada mereka dan menambah karunia-Nya. Sungguh, Allah Maha Pengampun, Maha Mensyukuri.",
      "text": "لِيُوَفِّيَهُمْ اُجُوْرَهُمْ وَيَزِيْدَهُمْ مِّنْ فَضْلِهٖۗ اِنَّهٗ غَفُوْرٌ شَكُوْرٌ ",
      "text_translation_en": "since He will grant them their just rewards, and give them yet more out of His bounty: for, verily, He is much-forgiving, ever-responsive to gratitude.",
      "juz_number": 22
    },
    "31": {
      "text_tafsir_en": "Indeed, the Qur'an revealed to the Prophet Muhammad is the Book of Allah which is actually revealed from Allah. Therefore, Allah obliges the Prophet and all his people to practice his teachings and to follow the guidelines of life contained therein. If a Muslim has fully followed the teachings of the Qur'an, he will never again practice the ancient scriptures, even if he is obliged to believe them. Because what has been explained in previous books, is already justified by the Qur'an. In other words, believing in the scriptures that were passed down to the apostles before the Prophet Muhammad did not mean practicing his teachings, but simply believing the truth, because the essence of what is contained in the scriptures is also revealed in the Qur'an. Allah knows all about His servant. God is aware of the rules of life that are necessary for them. On that basis He sets the rules and the laws that apply to their lives, where and when they are. For the sake of human well-being, God sent the apostles with the task of delivering His Shari'ah, in which the Prophet Muhammad was the last messenger sent for all mankind until the Day of Resurrection. The leaflets and Shari'ah that he brought remain and remain until the Day of Judgment. The Word of God: God knows best where He places His writings. (al-An'am \/ 6: 124) Imam Ibn Katsir explained that the purpose of the Almighty's knowledge of His servant is that He elevates the degrees of prophets and apostles above all mankind. Even among them (the prophets) the levels of his own height, and the position of the Prophet Muhammad above them all.",
      "text_tafsir": "Sesungguhnya Al-Qur'an yang diturunkan kepada Nabi Muhammad adalah Kitabullah yang benar-benar diturunkan dari Allah. Oleh karena itu, Allah mewajibkan kepada Nabi dan kepada segenap umatnya untuk mengamalkan ajarannya dan mengikuti pedoman-pedoman hidup yang terdapat di dalamnya. Bila seorang muslim telah mematuhi secara sempurna ajaran Al-Qur'an itu, maka ia tidak perlu lagi mengamalkan kitab-kitab suci sebelumnya, sekalipun diwajibkan untuk mengimaninya. Sebab apa yang pernah diterangkan dalam kitab-kitab sebelumnya, telah dibenarkan oleh Al-Qur'an. Dengan kata lain, beriman dengan kitab-kitab suci yang pernah diturunkan kepada para rasul sebelum Nabi Muhammad bukan berarti mengamalkan ajarannya, tetapi cukup mengimani kebenarannya, sebab intisari dari apa yang tercantum dalam kitab-kitab itu telah tertera pula dalam Al-Qur'an. Allah Maha Mengetahui perihal hamba-Nya. Allah Mahateliti akan aturan-aturan hidup yang perlu bagi mereka. Atas dasar itulah Dia menetapkan aturan dan hukum-hukum yang sesuai dengan kehidupan mereka, di mana dan kapan mereka berada. Guna kesejahteraan manusia seutuhnya, Allah mengutus para rasul dengan tugas menyampaikan syariat-Nya, di mana Nabi Muhammad adalah rasul terakhir yang diutus untuk sekalian manusia sampai hari Kiamat. Risalah dan syariat yang dibawanya kekal dan abadi sampai tibanya hari Kiamat.\n\nFirman Allah:\n\nAllah lebih mengetahui di mana Dia menempatkan tugas kerasulan-Nya. (al-An'am\/6: 124) \n\nImam Ibnu Katsir menjelaskan bahwa maksud pengetahuan Allah yang Mahaluas mengenai perihal hamba-Nya itu ialah Dia mengangkat derajat para nabi dan rasul melebihi manusia keseluruhannya. Bahkan di antara mereka (para nabi) itu sendiri berbeda-beda tingkat ketinggiannya, dan kedudukan Nabi Muhammad melebihi semua mereka.",
      "text_translation": "Dan apa yang telah Kami wahyukan kepadamu (Muhammad) yaitu Kitab (Al-Qur'an) itulah yang benar, membenarkan kitab-kitab yang sebelumnya. Sungguh, Allah benar-benar Maha Mengetahui, Maha Melihat (keadaan) hamba-hamba-Nya.",
      "text": "وَالَّذِيْٓ اَوْحَيْنَآ اِلَيْكَ مِنَ الْكِتٰبِ هُوَ الْحَقُّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِۗ اِنَّ اللّٰهَ بِعِبَادِهٖ لَخَبِيْرٌۢ بَصِيْرٌ ",
      "text_translation_en": "And [know that] all of the divine writ with which We have inspired thee is the very truth, confirming the truth of whatever there still remains of earlier revelations for, behold, of [the needs of] His servants God is fully aware, all-seeing.",
      "juz_number": 22
    },
    "32": {
      "text_tafsir_en": "Allah revealed the Qur'an to the Prophet Muhammad. Then the teachings of the Qur'an were passed on to his chosen servants. They are the people of the Prophet Muhammad, for Allah has glorified this people beyond the glory that the people had before. The glory depends on the extent to which the Prophet's teachings are practiced, and to what extent they are able to follow Allah's guidance. The following are explained the levels of the believers who practice the Qur'an: 1. People who have wronged themselves. It means people who do compulsory work and also do not abandon illegal activities. 2.Muqtashid, that is, those who perform all their duties and abandon their prohibitions, but sometimes he does not perform the deeds performed by the sun or still perform some part of the work that he sees. 3.Sabiqun bill of devotion, that is, those who practice the obligatory practices and the sunah, abandon all illegal and profane practices, as well as some things that are changed (allowed). According to al-Maragi the above divisions can also be expressed in other words, namely: 1. Those who have little practice of the Bible and are too lazy to obey their passions, or who do more evil deeds than good deeds. 2. There is a balance between good and evil deeds. 3. People who are constantly seeking the reward of God by doing good deeds. The scholars have interpreted several hadiths in connection with the above. One of these is the hadith of Ahmad from Abu Darda ', where, after reciting verse 32 of Surah Fathir above, the Messenger of Allah (may peace be upon him) said: As for those who do good deeds, they will enter heaven without hisab, and the people of the middle (muqtashid) they will be tormented with a small flame, and the one who abuses himself will be held in place first, and he will suffer and then be taken to heaven. Then he read \"Alhamdulillah al-ladzi adhhaba 'anna al-hazana inna rabbana lagafurun syakur,\" (All praise be to Allah who has taken away our grief, surely our Lord is Forgiving, Most Merciful). (History of Ahmad) The legacy of practicing the scriptures and the glory given to the people of Prophet Muhammad is a great gift from God, which no one can interfere with.",
      "text_tafsir": "Allah mewahyukan Al-Qur'an kepada Nabi Muhammad. Kemudian ajaran-ajaran Al-Qur'an itu diwariskan-Nya kepada hamba-hamba-Nya yang terpilih. Mereka itu adalah umat Nabi Muhammad, sebab Allah telah memuliakan umat ini melebihi kemuliaan yang diperoleh umat sebelumnya. Kemuliaan itu tergantung kepada sejauh manakah ajaran Rasulullah itu mereka amalkan, dan sampai di mana mereka sanggup mengikuti petunjuk Allah. Berikut ini dijelaskan tingkatan-tingkatan orang mukmin yang mengamalkan Al-Qur'an:\n\n1.Orang yang zalim kepada dirinya. Maksudnya orang yang mengerjakan perbuatan wajib dan juga tidak meninggalkan perbuatan yang haram.\n\n2.Muqtashid, yakni orang-orang yang melaksanakan segala kewajiban dan meninggalkan larangan-larangannya, tetapi kadang-kadang ia tidak mengerjakan perbuatan yang dipandang sunah atau masih mengerjakan sebagian pekerjaan yang dipandang makruh.\n\n3.Sabiqun bil khairat, yaitu orang yang selalu mengerjakan amalan yang wajib dan sunah, meninggalkan segala perbuatan yang haram dan makruh, serta sebagian hal-hal yang mubah (dibolehkan).\n\nMenurut al-Maragi pembagian di atas dapat pula diungkapkan dengan kata-kata lain, yaitu:\n\n1.Orang yang masih sedikit mengamalkan ajaran Kitabullah dan terlalu senang menuruti hawa nafsunya, atau orang yang masih banyak perbuatan kejahatannya dibanding dengan amal kebaikannya.\n\n2.Orang yang seimbang antara amal kebaikan dan kejahatannya.\n\n3.Orang yang terus-menerus mencari ganjaran Allah dengan melakukan amal kebaikan.\n\nPara ulama tafsir telah menyebutkan beberapa hadis sehubungan dengan maksud di atas. Salah satunya adalah hadis riwayat Ahmad dari Abu Darda', di mana setelah membaca ayat 32 Surah Fathir di atas, Rasulullah bersabda: \n\nAdapun orang yang berlomba dalam berbuat kebaikan mereka akan masuk surga tanpa hisab (perhitungan), sedang orang-orang pertengahan (muqtashid) mereka akan dihisab dengan hisab yang ringan, dan orang yang menganiaya dirinya sendiri mereka akan ditahan dulu di tempat (berhisabnya), sehingga ia mengalami penderitaan kemudian dimasukkan ke dalam surga. Kemudian beliau membaca \"Alhamdulillah al-ladzi adhhaba 'anna al-hazana inna rabbana lagafurun syakur,\" (Segala puji bagi Allah yang telah menghilangkan duka cita dari kami, sesungguhnya Tuhan kami Maha Pengampun lagi Maha Mensyukuri). (Riwayat Ahmad) \n\nWarisan mengamalkan kitab suci dan kemuliaan yang diberikan kepada umat Nabi Muhammad itu merupakan suatu karunia yang amat besar dari Allah, yang tidak seorang pun dapat menghalangi ketetapan itu.",
      "text_translation": "Kemudian Kitab itu Kami wariskan kepada orang-orang yang Kami pilih di antara hamba-hamba Kami, lalu di antara mereka ada yang menzalimi diri sendiri, ada yang pertengahan dan ada (pula) yang lebih dahulu berbuat kebaikan dengan izin Allah. Yang demikian itu adalah karunia yang besar.",
      "text": "ثُمَّ اَوْرَثْنَا الْكِتٰبَ الَّذِيْنَ اصْطَفَيْنَا مِنْ عِبَادِنَاۚ فَمِنْهُمْ ظَالِمٌ لِّنَفْسِهٖ ۚوَمِنْهُمْ مُّقْتَصِدٌ ۚوَمِنْهُمْ سَابِقٌۢ بِالْخَيْرٰتِ بِاِذْنِ اللّٰهِ ۗذٰلِكَ هُوَ الْفَضْلُ الْكَبِيْرُۗ ",
      "text_translation_en": "And so, We have bestowed this divine writ as a heritage unto such of Our servants as We chose: and among them are some who sin against themselves; and some who keep half-way [between right and wrong]; and some who, by God’s leave, are fore­most in deeds of goodness: [and] this, indeed, is a merit most high!",
      "juz_number": 22
    },
    "33": {
      "text_tafsir_en": "Then Allah described the reward that believers will receive on the heaven of 'Adn, the abode of eternity, which they will enjoy in the hereafter when they are before Allah. They were awarded gold jewelry and silk garments. Abu Hurairah, may Allah be pleased with him, reported: Allah's Messenger (may peace be upon him) said: Some of the believers will receive jewelry (in heaven) on the members of the ablution body (water). (Al-Bukhari's History) In another hadith, the Messenger of Allah (may peace be upon him) said: It was from Abu Hurairah that Abu Umamah narrated the hadith that the Messenger of Allah had told his companions, and mentioned the jewelry of the inhabitants of heaven. He said, \"They were given gold and silver bracelets with pearls, they also wore crowns of adhering pearls. They wore crowns like kings. They were young, without beards and beard, and their eyes were glazed.\" Ibn Abi atim) By the grace of Allah, they praised His greatness and were grateful for their safety from grief and sorrow: Ibn 'Abbas interpreted it as hell (fire), for the pain of sin or the sorrow of the great torment The release of the Messenger of Allah (may peace be upon him) from all the torments and fears is due to the forgiveness of Allah for those who do wrong (sin) and the recompense of thanks to those who obey Him. (always saying) \"La ilaha illallah\" will not feel lonely in his death, in his grave, and in the day of the Resurrection. as if I were with them where they had cleared their heads from the ground, and they said, \"Praise be to Allah who has taken away our grief! Verily, our Lord is Forgiving, Most Gracious. \"",
      "text_tafsir": "Kemudian Allah menerangkan pahala yang akan diterima orang mukmin di atas yakni surga 'Adn, tempat tinggal abadi buat selama-lamanya, yang akan mereka diami kelak di akhirat ketika mereka telah menghadap Allah. Mereka dianugerahi perhiasan dari emas dan pakaian dari sutra. Diriwayatkan dari Abu Hurairah bahwa Rasulullah bersabda:\n\nSebagian dari orang mukmin itu akan memperoleh perhiasan (di surga) diletakkan pada anggota badan yang terbasuh (air) wudhu. (Riwayat al-Bukhari) \n\nDalam hadis lain, Rasulullah bersabda:\n\nDari Abu Hurairah r.a. bahwa Abu Umamah meriwayatkan hadis bahwa Rasulullah mengatakan kepada para sahabat, dan menyebutkan perhiasan penghuni surga. Beliau berkata, \"Mereka diberi gelang emas dan perak yang bertatahkan mutiara, mereka juga memakai mahkota dari mutiara yaqut yang bersambung. Mereka memakai mahkota seperti mahkota raja-raja. Mereka muda-muda, tidak berjenggot dan berkumis, dan mata mereka bercelak. (Riwayat Ibnu Abi hatim)\n\nAtas anugerah Allah yang berlipat ganda itu, mereka memuji kebesaran-Nya dan bersyukur atas keselamatan mereka dari kesedihan dan kepedihan. Ibnu 'Abbas mengartikan kesedihan (hazan) itu dengan api neraka, karena kepedihan akibat dosa atau kepedihan akibat hebatnya siksaan di Padang Mahsyar. Lepasnya mereka dari segala siksaan dan ketakutan adalah semata-mata karena ampunan Allah bagi orang yang berbuat kesalahan (dosa) dan balasan syukur bagi orang yang selalu menaati-Nya. Diriwayatkan dalam sebuah hadis dari Ibnu 'Umar dimana Nabi saw bersabda:\n\nOrang (yang selalu mengucapkan)\"La ilaha illallah\" tidak akan merasa kesepian di dalam kematiannya, di dalam kuburnya, dan juga pada hari Kebangkitan. Seolah-olah aku berada dengan mereka di mana mereka membersihkan kepalanya dari tanah\/debu, dan mereka berkata, \"Segala puji bagi Allah yang telah melenyapkan kedukaan dari kami! Sesungguhnya Tuhan kami Maha Pengampun lagi Maha Penerima syukur.\" (Riwayat ath-thabrani dari Ibnu 'Umar)\n\nRingkasnya, mereka terlepas dari segala ketakutan dan siksaan yang telah diancamkan pada orang-orang yang berdosa akibat bisikan dan rayuan setan ketika hidup di dunia ini.",
      "text_translation": "(Mereka akan mendapat) surga ‘Adn, mereka masuk ke dalamnya, di dalamnya mereka diberi perhiasan gelang-gelang dari emas dan mutiara, dan pakaian mereka di dalamnya adalah sutera.",
      "text": "جَنّٰتُ عَدْنٍ يَّدْخُلُوْنَهَا يُحَلَّوْنَ فِيْهَا مِنْ اَسَاوِرَ مِنْ ذَهَبٍ وَّلُؤْلُؤًا ۚوَلِبَاسُهُمْ فِيْهَا حَرِيْرٌ ",
      "text_translation_en": "[Hence,] gardens of perpetual bliss will they enter, therein to be adorned with bracelets of gold and pearls, and therein to be clad in raiments of silk;",
      "juz_number": 22
    },
    "34": {
      "text_tafsir_en": "Then Allah described the reward that believers will receive on the heaven of 'Adn, the abode of eternity, which they will enjoy in the hereafter when they are before Allah. They were awarded gold jewelry and silk garments. Abu Hurairah, may Allah be pleased with him, reported: Allah's Messenger (may peace be upon him) said: Some of the believers will receive jewelry (in heaven) on the members of the ablution body (water). (Al-Bukhari's History) In another hadith, the Messenger of Allah (may peace be upon him) said: It was from Abu Hurairah that Abu Umamah narrated the hadith that the Messenger of Allah had told his companions, and mentioned the jewelry of the inhabitants of heaven. He said, \"They were given gold and silver bracelets with pearls, they also wore crowns of adhering pearls. They wore crowns like kings. They were young, without beards and beard, and their eyes were glazed.\" Ibn Abi atim) By the grace of Allah, they praised His greatness and were grateful for their safety from grief and sorrow: Ibn 'Abbas interpreted it as hell (fire), for the pain of sin or the sorrow of the great torment The release of the Messenger of Allah (may peace be upon him) from all the torments and fears is due to the forgiveness of Allah for those who do wrong (sin) and the recompense of thanks to those who obey Him. (always saying) \"La ilaha illallah\" will not feel lonely in his death, in his grave, and in the day of the Resurrection. as if I were with them where they had cleared their heads from the ground, and they said, \"Praise be to Allah who has taken away our grief! Verily, our Lord is Forgiving, Most Gracious. \"",
      "text_tafsir": "Kemudian Allah menerangkan pahala yang akan diterima orang mukmin di atas yakni surga 'Adn, tempat tinggal abadi buat selama-lamanya, yang akan mereka diami kelak di akhirat ketika mereka telah menghadap Allah. Mereka dianugerahi perhiasan dari emas dan pakaian dari sutra. Diriwayatkan dari Abu Hurairah bahwa Rasulullah bersabda:\n\nSebagian dari orang mukmin itu akan memperoleh perhiasan (di surga) diletakkan pada anggota badan yang terbasuh (air) wudhu. (Riwayat al-Bukhari) \n\nDalam hadis lain, Rasulullah bersabda:\n\nDari Abu Hurairah r.a. bahwa Abu Umamah meriwayatkan hadis bahwa Rasulullah mengatakan kepada para sahabat, dan menyebutkan perhiasan penghuni surga. Beliau berkata, \"Mereka diberi gelang emas dan perak yang bertatahkan mutiara, mereka juga memakai mahkota dari mutiara yaqut yang bersambung. Mereka memakai mahkota seperti mahkota raja-raja. Mereka muda-muda, tidak berjenggot dan berkumis, dan mata mereka bercelak. (Riwayat Ibnu Abi hatim)\n\nAtas anugerah Allah yang berlipat ganda itu, mereka memuji kebesaran-Nya dan bersyukur atas keselamatan mereka dari kesedihan dan kepedihan. Ibnu 'Abbas mengartikan kesedihan (hazan) itu dengan api neraka, karena kepedihan akibat dosa atau kepedihan akibat hebatnya siksaan di Padang Mahsyar. Lepasnya mereka dari segala siksaan dan ketakutan adalah semata-mata karena ampunan Allah bagi orang yang berbuat kesalahan (dosa) dan balasan syukur bagi orang yang selalu menaati-Nya. Diriwayatkan dalam sebuah hadis dari Ibnu 'Umar dimana Nabi saw bersabda:\n\nOrang (yang selalu mengucapkan)\"La ilaha illallah\" tidak akan merasa kesepian di dalam kematiannya, di dalam kuburnya, dan juga pada hari Kebangkitan. Seolah-olah aku berada dengan mereka di mana mereka membersihkan kepalanya dari tanah\/debu, dan mereka berkata, \"Segala puji bagi Allah yang telah melenyapkan kedukaan dari kami! Sesungguhnya Tuhan kami Maha Pengampun lagi Maha Penerima syukur.\" (Riwayat ath-thabrani dari Ibnu 'Umar)\n\nRingkasnya, mereka terlepas dari segala ketakutan dan siksaan yang telah diancamkan pada orang-orang yang berdosa akibat bisikan dan rayuan setan ketika hidup di dunia ini.",
      "text_translation": "Dan mereka berkata, “Segala puji bagi Allah yang telah menghilangkan kesedihan dari kami. Sungguh, Tuhan kami benar-benar Maha Pengampun, Maha Mensyukuri,",
      "text": "وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْٓ اَذْهَبَ عَنَّا الْحَزَنَۗ اِنَّ رَبَّنَا لَغَفُوْرٌ شَكُوْرٌۙ ",
      "text_translation_en": "and they will say: “All praise is due to God, who has caused all sorrow to leave us: for, verily, our Sustainer is indeed much-forgiving, ever-responsive to gratitude –",
      "juz_number": 22
    },
    "35": {
      "text_tafsir_en": "The one who has received the favor of God realizes that all these gifts are due only to His love. The gift of God is not the same as the good that they do. Therefore, the believers are not in heaven for the good they do, but for God's grace and grace for those who obey His commands. The Messenger of Allah (may peace be upon him) said: None of you has entered heaven because of his deeds. They (the Companions) asked, \"Are you not so, O Messenger of Allah?\" He answered, \"Neither do I, for God has given me grace and grace.\" (Muslim History of Jabir bin 'Abdullah) In that paradise they will not find any difficulties or obstacles as they feel in today's life. They also don't feel tired and tired. Everything is delicious and enjoyable. In short, heaven is a place of eternal and lasting happiness, where its inhabitants can enjoy it as a reward for their obedience and obedience in this world. Allah says: (To them it is said), \"Eat and drink with joy because of the deeds that you have done in the past.\" (al-haqqah \/ 69: 24)",
      "text_tafsir": "Orang yang telah memperoleh nikmat dari Allah itu menyadari bahwa semua pemberian tersebut adalah semata-mata karena kasih sayang-Nya. Tidaklah seimbang besarnya pemberian Allah itu dengan perbuatan baik yang mereka kerjakan. Oleh karena itu, masuknya orang-orang mukmin ke dalam surga sama sekali bukanlah karena kebaikan yang mereka kerjakan, tetapi karena rahmat dan karunia Allah bagi orang yang mematuhi perintah-Nya.\n\nRasulullah saw bersabda:\n\nTiada masuk surga seorang di antara kamu karena perbuatannya. Mereka (para sahabat) bertanya, \"Apakah engkau juga tidak begitu wahai Rasulullah?\" Beliau menjawab, \"Aku juga tidak, melainkan karena Allah memberi rahmat dan karunia kepadaku.\" (Riwayat Muslim dari Jabir bin 'Abdullah) \n\nDi surga itu mereka tidak menemui kesulitan atau rintangan lagi sebagaimana yang mereka rasakan dalam kehidupan di dunia ini. Mereka juga tidak merasa lelah dan letih. Semuanya terasa nikmat dan menggembirakan.\n\nRingkasnya surga itulah tempat nikmat yang kekal dan abadi, di mana penghuninya dapat menikmati kesenangan itu sebagai ganjaran kepatuhan dan ketaatan mereka di dunia ini. Allah berfirman:\n\n(Kepada mereka dikatakan), \"Makan dan minumlah dengan nikmat karena amal yang telah kamu kerjakan pada hari-hari yang telah lalu.\" (al-haqqah\/69: 24)",
      "text_translation": "yang dengan karunia-Nya menempatkan kami dalam tempat yang kekal (surga); di dalamnya kami tidak merasa lelah dan tidak pula merasa lesu.”",
      "text": " ۨالَّذِيْٓ اَحَلَّنَا دَارَ الْمُقَامَةِ مِنْ فَضْلِهٖۚ  لَا يَمَسُّنَا فِيْهَا نَصَبٌ وَّلَا يَمَسُّنَا فِيْهَا لُغُوْبٌ ",
      "text_translation_en": "He who, out of His bounty, has made us alight in this abode of life enduring, wherein no struggle can assail us, and wherein no weariness can touch us!”",
      "juz_number": 22
    },
    "36": {
      "text_tafsir_en": "In this verse it is explained that to the unbelievers who always hide the truth of their religion they have obtained their knowledge, both from the evidence of the Qur'anic verses and through the results of deep thought, for them to be provided with Hell. Their condition is there between life and death. Death may be better than suffering such things, but God purposely decrees such torture in return for their crimes. In Surah al-A'la \/ 87: 13 it is stated that their condition is not dead and not alive, as interpretations of the word \"do not impose death upon them\". In addition, it was explained that the torment of Hell did not lessen his pain, even though the poor people who were suffering there screamed for help. There is evidence from another verse that illustrates that death is much to their expectation from the state of life and death, the hope of death being inferred from the meaning of the verse: And they cried out, \"O Allah! He answered, \"Indeed, you will remain (in this hell).\" (az-Zukhruf \/ 43: 77) The Muslim Imam narrates a hadith regarding the condition of the infidels who reads as follows: As for the inhabitants of hell where they dwell, they will not die in it nor live. (The Muslim History of Abu Sa'id al-Khudri) About that less torture, more and more, is also explained in other verses, such as: So when We opened for them a very severe doom, they immediately broke up. hope. (al-Mu'minun \/ 23: 77) And He says: Therefore taste it! There is nothing We shall add to you besides the torment. (an-Naba '\/ 78: 30) And We will gather them on the Day of Judgment, with their faces blind, dumb, and deaf. Their dwelling place is Hell. Whenever the flames of Hell would be extinguished, We would light them again. (al-Isra '\/ 17: 97) Such torment is a just recompense for anyone who disregards the favor of God, does not acknowledge His strength and does not trust His Messenger.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa bagi orang-orang kafir yang senantiasa menyembunyikan kebenaran agama yang buktinya telah diperoleh oleh akal mereka, baik dari keterangan ayat-ayat Al-Qur'an maupun melalui hasil pemikiran yang mendalam, bagi mereka disediakan neraka Jahanam. Keadaan mereka di sana antara hidup dan mati. Mungkin kematian lebih baik daripada menanggung kesengsaraan seperti itu, tetapi Allah sengaja menetapkan siksaan demikian sebagai balasan kejahatan yang mereka lakukan. Dalam Surah al-A'la\/87: 13 ditegaskan bahwa keadaan mereka tidak mati dan tidak hidup, sebagai tafsir dari kata \"tidak ditetapkan kematian atas mereka\". \n\nDi samping itu dijelaskan bahwa azab neraka Jahanam tidak pula dikurangi kepedihannya, sekalipun manusia-manusia malang yang sedang mengalami siksaan di sana menjerit-jerit meminta tolong. Ada keterangan dari ayat lain yang menggambarkan bahwa kematian sangat mereka harapkan daripada keadaan mereka antara hidup dan mati, harapan kematian itu disimpulkan dari makna yang terkandung dalam ayat:\n\nDan mereka berseru, \"Wahai (Malaikat) Malik! Biarlah Tuhanmu mematikan kami saja.\" Dia menjawab, \"Sungguh, kamu akan tetap tinggal (di neraka ini).\" (az-Zukhruf\/43: 77)\n\nImam Muslim meriwayatkan sebuah hadis tentang keadaan orang-orang kafir yang berbunyi sebagai berikut:\n\nAdapun penghuni neraka di mana mereka sebagai penduduknya, mereka tidak akan mati di dalamnya dan juga tidak hidup. (Riwayat Muslim dari Abu Sa'id al-Khudri)\n\nTentang siksaan yang tidak diringankan itu, bahkan makin ditambah lagi, juga diperoleh penjelasan dalam ayat lain, misalnya:\n\nSehingga apabila Kami bukakan untuk mereka pintu azab yang sangat keras, seketika itu mereka menjadi putus asa. (al-Mu'minun\/23: 77) \n\nDan firman-Nya:\n\nMaka karena itu rasakanlah! Maka tidak ada yang akan Kami tambahkan kepadamu selain azab. (an-Naba'\/78: 30) \n\nDan Kami akan mengumpulkan mereka pada hari Kiamat dengan wajah tersungkur, dalam keadaan buta, bisu, dan tuli. Tempat kediaman mereka adalah neraka Jahanam. Setiap kali nyala api Jahanam itu akan padam, Kami tambah lagi nyalanya bagi mereka. (al-Isra'\/17: 97)\n\nSiksaan demikian itu balasan yang pantas bagi setiap orang yang mengingkari nikmat Allah, tidak mengakui kemahaesaan-Nya dan tidak percaya kepada rasul yang diutus-Nya.",
      "text_translation": "Dan orang-orang yang kafir, bagi mereka neraka Jahanam. Mereka tidak dibinasakan hingga mereka mati, dan tidak diringankan dari mereka azabnya. Demikianlah Kami membalas setiap orang yang sangat kafir.",
      "text": "وَالَّذِيْنَ كَفَرُوْا لَهُمْ نَارُ جَهَنَّمَۚ  لَا يُقْضٰى عَلَيْهِمْ فَيَمُوْتُوْا وَلَا يُخَفَّفُ عَنْهُمْ مِّنْ عَذَابِهَاۗ  كَذٰلِكَ نَجْزِيْ كُلَّ كَفُوْرٍ ۚ",
      "text_translation_en": "But as for those who are bent on denying the truth - the fire of hell awaits them: no end shall be put to their lives so that they could die, nor shall aught of the suffering caused by that [fire] be lightened for them: thus shall We requite all who are bereft of gratitude.",
      "juz_number": 22
    },
    "37": {
      "text_tafsir_en": "It is further explained that the unfortunate man begged God to be released from the torment and brought back to the world. They promise to obey God for as long as they worship. However, if the application were granted \"and this is not possible\" they would have to repeat the old prohibited act. The acts they regretted and had done in the past were shirk and all other evil acts. God answered and rebuked them with an insulting utterance that in the first world they had been given the opportunity to live long enough to correct a mistake and accept the truth that the apostle had given as a warner. In other words, such a request is not accepted by God at all. Another verse says: O our Lord, take us out of it, if we return (to disbelief), indeed, we are the wrongdoers. \"He (Allah) said,\" Abide in contempt. in it, and do not talk to me. \"(al-Mu'minun \/ 23: 107-108) Allah said:\" Whoever is allowed to go astray from Allah, there will be no protector thereafter. they see the torment of saying, \"Is there any way to return (to the world)?\" (asy-Syura \/ 42: 44) About the age meant in this verse 37, Ibn 'Abbas explained in one history, 40 years, and another. say 60 years, Ibn Katsir in his interpretation chose the most authentic history of Ibn 'Abbas 60 years, and so had the narration of Imam Ahmad of Abu Hurairah. in this verse is N Muhammad himself taught the Book of Allah to his people, threatening them with painful torment for those who disobeyed Allah and did not obey Him. In short, their request to return to the world was not due to two things. First, because they had been given the opportunity to live for 60 to 70 years, and second, the apostles had been sent to convey the teachings and warnings of God. Notice the word of God: It almost explodes in anger. Whenever a group (of the disbelievers) was thrown into it, the guards (hell) asked them, \"Has no one ever come to warn you (in the world)?\" (al-Mulk \/ 67: 8) In Tafsir al-Wadhih it is said that the nadzir (warner) in this verse means that the Prophet who brought the Qur'an, can also be interpreted as old age and death. Indeed, age and death are important warnings to mankind that he will soon leave this mortal world, and be held accountable for his actions. It is clear that the disbelievers above remain in hell and are not cast out forever. The doom is what they feel all the time in return for the wrongdoers who do not want to submit to the teachings of the apostles as messengers of God in their earthly lives. This verse emphasizes that they will not find help that will save them from the torment of hell from chains and shackles made from the fire of hell.",
      "text_tafsir": "Lebih lanjut diterangkan bahwa orang yang bernasib malang itu memohon kepada Allah agar dilepaskan dari azab dan dikembalikan ke dunia lagi. Mereka berjanji akan menaati Allah yang selama di dunia mereka lalaikan. Akan tetapi, seandainya permohonan itu dikabulkan”dan ini tidak mungkin sama sekali”tentulah mereka akan mengulangi kembali perbuatan lama yang terlarang. Perbuatan yang mereka sesali dan pernah mereka lakukan di dunia dulu adalah perbuatan syirik dan segala perbuatan jahat lainnya. Allah menjawab dan menghardik mereka dengan ucapan yang menghina bahwa di dunia dulu kepada mereka telah diberikan kesempatan hidup dengan umur yang cukup panjang untuk memperbaiki kesalahan dan menerima kebenaran yang disampaikan rasul selaku orang yang memberi peringatan. Dengan kata lain, permohonan demikian tidak diterima Allah sama sekali. Ayat lain menyatakan:\n\nYa Tuhan kami, keluarkanlah kami darinya (kembalikanlah kami ke dunia), jika kami masih juga kembali (kepada kekafiran), sungguh, kami adalah orang-orang yang zalim.\" Dia (Allah) berfirman, \"Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.\" (al-Mu'minun\/23: 107-108) \n\nAllah berfirman:\n\nDan barang siapa dibiarkan sesat oleh Allah, maka tidak ada baginya pelindung setelah itu. Kamu akan melihat orang-orang zalim ketika mereka melihat azab berkata, \"Adakah kiranya jalan untuk kembali (ke dunia)?\" (asy-Syura\/42: 44)\n\nTentang umur yang dimaksudkan dalam ayat 37 ini, Ibnu 'Abbas menerangkan dalam satu riwayat, yaitu 40 tahun, dan riwayat lain mengatakan 60 tahun. Ibnu Katsir dalam tafsirnya memilih riwayat yang paling sahih dari Ibnu 'Abbas yakni 60 tahun. Demikian pula hadis riwayat Imam Ahmad dari Abu Hurairah. Di antara sekian banyak lafaz hadis itu, ada yang berarti: Adapun orang yang memberi peringatan yang disebutkan dalam ayat ini adalah Nabi Muhammad sendiri yang mengajarkan Kitabullah kepada umatnya, mengancam mereka dengan siksaan yang pedih bagi siapa yang tidak patuh kepada perintah Allah dan tidak mau menaati-Nya.\n\nRingkasnya, permohonan mereka itu tidak dikabulkan untuk kembali ke dunia ialah karena dua hal. Pertama, karena mereka rata-rata telah diberi kesempatan untuk hidup begitu lama antara 60 - 70 tahun, dan kedua, rasul sudah diutus kepada mereka untuk menyampaikan ajaran dan peringatan dari Tuhan.\n\nPerhatikan firman Allah:\n\nHampir meledak karena marah. Setiap kali ada sekumpulan (orang-orang kafir) dilemparkan ke dalamnya, penjaga-penjaga (neraka itu) bertanya kepada mereka, \"Apakah belum pernah ada orang yang datang memberi peringatan kepadamu (di dunia)?\" (al-Mulk\/67: 8) \n\nDalam Tafsir al-Wadhih dikatakan bahwa nadzir (pemberi peringatan) dalam ayat ini berarti Rasulullah yang membawa Al-Qur'an, boleh pula diartikan sebagai umur tua dan kematian. Memang umur dan kematian tersebut adalah peringatan penting bagi manusia bahwa sebentar lagi dia akan meninggalkan dunia yang fana ini, dan diwajibkan mempertanggungjawabkan perbuatannya. Jelaslah bahwa orang-orang kafir di atas kekal di dalam neraka dan tidak dikeluarkan selama-lamanya. Azab nerakalah yang mereka rasakan sepanjang masa sebagai imbalan yang setimpal bagi orang yang zalim yang tidak mau tunduk kepada ajaran rasul sebagai utusan Allah dalam kehidupan duniawinya. Ayat ini menegaskan jangan diharap mereka akan memperoleh penolong yang akan menyelamatkan mereka dari azab neraka dari rantai dan belenggu yang terbuat dari api neraka.",
      "text_translation": "Dan mereka berteriak di dalam neraka itu, “Ya Tuhan kami, keluarkanlah kami (dari neraka), niscaya kami akan mengerjakan kebajikan, yang berlainan dengan yang telah kami kerjakan dahulu.” (Dikatakan kepada mereka), “Bukankah Kami telah memanjangkan umurmu untuk dapat berpikir bagi orang yang mau berpikir, padahal telah datang kepadamu seorang pemberi peringatan? Maka rasakanlah (azab Kami), dan bagi orang-orang zalim tidak ada seorang penolong pun.”",
      "text": "وَهُمْ يَصْطَرِخُوْنَ فِيْهَاۚ رَبَّنَآ اَخْرِجْنَا نَعْمَلْ صَالِحًا غَيْرَ الَّذِيْ كُنَّا نَعْمَلُۗ اَوَلَمْ نُعَمِّرْكُمْ مَّا يَتَذَكَّرُ فِيْهِ مَنْ تَذَكَّرَ وَجَاۤءَكُمُ النَّذِيْرُۗ فَذُوْقُوْا فَمَا لِلظّٰلِمِيْنَ مِنْ نَّصِيْرٍ ",
      "text_translation_en": "And in that [hell] they will cry aloud: “O our Sustainer! Cause us to come out [of this suffering]! We shall [henceforth] do good deeds, not such as we were wont to do [aforetime]!” [But We shall answer:] “Did We not grant you a life long enough so that whoever was willing to take thought could bethink himself? And [withal,] a war­ner had come unto you! Taste, then, [the fruit of your evil deeds]: for evildoers shall have none to succour them!”",
      "juz_number": 22
    },
    "38": {
      "text_tafsir_en": "This verse commands the Prophet Muhammad to warn the unbelievers that Allah is well-acquainted with everything they hide. God is also aware of the feelings that are in their hearts, and what their plans are. God alone knows everything that is invisible to man, both in heaven and on earth. Therefore let the unbelievers fear God, for all their deeds are under his control. Everything they plan to deceive the apostles and do away with the truth of their religion on this earth, or their efforts to assist their allies in idolatry, is well known to God. God knows all the feelings contained in the human heart, and whatever works they do. God's Word \"Surely He Knows What Is in the Human Chest\" signifies the sense that even unbelievers are given a chance to live longer, but they will not abandon their disbelief. Therefore, in vain Allah extends his life.",
      "text_tafsir": "Ayat ini memerintahkan kepada Nabi Muhammad agar memberi peringatan keras kepada orang-orang musyrik bahwa Allah Maha Mengetahui segala apa yang mereka sembunyikan. Allah juga Maha Mengetahui perasaan yang terkandung dalam hati mereka, dan rencana apa yang akan mereka kerjakan. Allah pulalah yang mengetahui segala yang tak terlihat oleh pancaindra manusia, baik yang ada di langit maupun di bumi. Oleh karena itu, hendaklah orang-orang musyrik itu merasa takut kepada Allah, sebab segala gerak-gerik mereka di bawah pengawasan-Nya. Segala yang mereka rencanakan untuk menipu rasul dan melenyapkan kebenaran agama-Nya di bumi ini, atau usaha mereka untuk membantu sekutu mereka dalam menuhankan berhala, pasti diketahui Allah. \n\nAllah Mengetahui segala perasaan yang terkandung dalam hati manusia, dan perbuatan apa saja yang mereka kerjakan. Firman Allah \"Sesungguhnya Dia Maha Mengetahui apa yang ada dalam dada manusia\" mengisyaratkan kepada pengertian sekalipun orang-orang kafir diberi kesempatan untuk hidup lebih lama lagi, namun mereka tidak akan meninggalkan kekufurannya. Oleh karena itu, sia-sia Allah memanjangkan umurnya.",
      "text_translation": "Sungguh, Allah mengetahui yang gaib (tersembunyi) di langit dan di bumi. Sungguh, Dia Maha Mengetahui segala isi hati.",
      "text": "اِنَّ اللّٰهَ عَالِمُ غَيْبِ السَّمٰوٰتِ وَالْاَرْضِۗ اِنَّهٗ عَلِيْمٌ ۢبِذَاتِ الصُّدُوْرِ ",
      "text_translation_en": "Verily, God knows the hidden reality of the heavens and the earth: [and,] behold, He has full knowledge of what is in the hearts [of men].",
      "juz_number": 22
    },
    "39": {
      "text_tafsir_en": "This verse confirms that man was made a caliph on earth. As caliphs, which can be interpreted as rulers, humans are given the ability to make the most of this world for the betterment of their lives. Some interpreters explain that the meaning of khala'if fi al-ardh is that some people replace other people, one generation replacing another so that they can learn the lessons because God has destroyed the past because of their sin. It's all about making them realize who they really are. Such a feeling of God willingness will motivate him to be grateful for all his infinite favors, to deprive him of all his deeds and beliefs, and to obey his commandments. The more the unbelief spread in their hearts, the more wrath and wrath of God. However, this does not mean that it will diminish the greatness and glory of God, for He does not need the praise and gratitude of men for His greatness and glory, as the verse says: ; and whoever is not grateful, surely Allah is Mighty, Most Merciful. (Luqman \/ 31: 12) Instead, the loss will come to them in the hereafter because they will not return to the right path, and will remain in disbelief. They remain in Hell's torment as described above. In fact the phrase, \"do not add to this disbelief for the disbelievers\" is mentioned twice because it implies that the disbelief which causes Allah's anger and the disfellowshipping which leads to loss, both are separate and have their own meanings.",
      "text_tafsir": "Ayat ini menegaskan bahwa manusia dijadikan sebagai khalifah di bumi. Sebagai khalifah, yang dapat diartikan sebagai penguasa, manusia diberi kemampuan untuk memanfaatkan alam ini dengan sebaik-baiknya guna kesejahteraan hidup mereka. Sebagian ahli tafsir menerangkan maksud khala'if fi al-ardh ialah sebagian manusia menggantikan manusia yang lain, satu generasi menggantikan generasi lain agar mereka mengambil pelajaran karena Allah telah membinasakan umat terdahulu disebabkan dosa yang mereka lakukan.\n\nSemuanya bertujuan agar mereka menyadari siapakah mereka itu sebenarnya. Rasa keinsafan demikian insya Allah akan mendorong untuk mensyukuri segala nikmat-Nya yang tidak terhingga, mengesakan-Nya dari segala perbuatan dan kepercayaan yang berbau syirik, serta menaati segala perintah-Nya. Semakin bertambah rasa kekafiran itu dalam lubuk hati mereka, makin bertambah pula kemarahan dan kemurkaan Allah. Akan tetapi, tidaklah berarti bahwa hal demikian akan mengurangi kebesaran dan keagungan Allah, sebab Dia tidak memerlukan puji dan syukur manusia untuk keagungan dan kemuliaan-Nya, seperti bunyi ayat:\n\nDan barang siapa bersyukur (kepada Allah), maka sesungguhnya dia bersyukur untuk dirinya sendiri; dan barang siapa tidak bersyukur (kufur), maka sesungguhnya Allah Mahakaya, Maha Terpuji. (Luqman\/31: 12) \n\nSebaliknya, kerugian akan menimpa mereka di hari akhirat kelak karena tidak mau kembali ke jalan yang benar, dan tetap berada dalam kekafiran. Mereka kekal dalam siksaan api neraka Jahanam seperti diuraikan di atas. Sengaja kalimat, \"tidaklah menambah kekafiran itu bagi orang-orang kafir\" disebutkan dua kali karena mengandung maksud bahwa kufur yang menimbulkan kemarahan Allah dan kufur yang mendatangkan kerugian, keduanya terpisah dan mengandung makna sendiri-sendiri.",
      "text_translation": "Dialah yang menjadikan kamu sebagai khalifah-khalifah di bumi. Barangsiapa kafir, maka (akibat) kekafirannya akan menimpa dirinya sendiri. Dan kekafiran orang-orang kafir itu hanya akan menambah kemurkaan di sisi Tuhan mereka. Dan kekafiran orang-orang kafir itu hanya akan menambah kerugian mereka belaka.",
      "text": "هُوَ الَّذِيْ جَعَلَكُمْ خَلٰۤىِٕفَ فِى الْاَرْضِۗ فَمَنْ كَفَرَ فَعَلَيْهِ كُفْرُهٗۗ وَلَا يَزِيْدُ الْكٰفِرِيْنَ كُفْرُهُمْ عِنْدَ رَبِّهِمْ اِلَّا مَقْتًا ۚوَلَا يَزِيْدُ الْكٰفِرِيْنَ كُفْرُهُمْ اِلَّا خَسَارًا ",
      "text_translation_en": "He it is who has made you inherit the earth. Hence, he who is bent on denying the truth [of God’s oneness and uniqueness ought to know that] this denial of his will fall back upon him: for their [per­sistent] denial of this truth does but add to the deniers’ loathsomeness in their Sustainer’s sight and, thus, their denial of this truth does but add to the deniers’ loss.",
      "juz_number": 22
    },
    "40": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad to invite the unbelievers to dialogue to explore their wrong way of thinking. What is the reason for those idolaters asking for help in the idols and idols they have dedicated to God? Is there evidence that the idol is worth worshiping? The Meccans of the Meccans did not fully understand the nature of their deity, or their condition. If they realized that their gods could not do anything, they would not worship him. On the contrary, if the idols had the power (to create), they would have been able to show the result. Likewise, when God has allies in the creation of the heavens, they are also worthy of worship as they expect. Is there a scripture (the truth in it) that can strengthen the arguments for an alliance with the Lord? Prophet Muhammad gave the Muslims an opportunity to present their reasons for worshiping idols, especially the ability of the gods to create beings, so that he was entitled to worship and fellowship with Allah in the matter of creation. Because such belief is purely their ancestral heritage (see Surah al-Baqarah \/ 2: 170), there is no single reason they can come up with either the naqli (nas) or the aqli (logic) arguments. Wherever found there was no scripture that called upon men to worship idols, for all were but the imagination and imagination of the ancients. After the Qur'an blamed and shattered their way of thinking, and what they followed was the mind of their misguided leaders, of course their opinions were mistaken and led to misery.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad agar mengajak orang-orang musyrik itu untuk berdialog menjajaki jalan pikiran mereka yang salah. Apa sebab orang-orang musyrik itu meminta pertolongan kepada patung dan berhala yang mereka sekutukan kepada Allah. Adakah bukti yang menunjukkan bahwa berhala itu pantas disembah. Orang-orang musyrik Mekah itu tidak paham benar akan hakikat tuhan mereka, bagaimana keadaannya. Seandainya mereka menyadari bahwa tuhan-tuhan mereka itu tidak sanggup berbuat apa-apa, tentulah mereka tidak menyembahnya. Tetapi sebaliknya, kalau memang betul berhala-berhala itu mempunyai kekuatan (untuk mencipta), tentulah mereka mampu memperlihatkan hasilnya. Demikian juga, apabila Allah mempunyai sekutu dalam menciptakan langit, tentu sekutu itu juga berhak disembah seperti yang mereka duga. Apakah ada kitab suci (yang benar isinya) yang dapat menguatkan dalil-dalil tentang adanya sekutu bagi Tuhan itu? \n\nNabi Muhammad memberi kesempatan kepada kaum musyrik agar mengemukakan alasan penyembahan mereka terhadap berhala, terutama kemampuan tuhan-tuhan itu untuk menciptakan makhluk, sehingga ia berhak disembah dan dipersekutukan dengan Allah dalam soal penciptaan. Karena kepercayaan demikian hanya semata-mata warisan dari nenek moyang mereka (lihat Surah al-Baqarah\/2: 170), maka tiada satu alasan yang dapat mereka kemukakan, baik alasan yang diterima dari dalil naqli (nas) maupun alasan aqli (logika). Di mana pun tidak pernah ada dijumpai suatu kitab suci yang menyerukan manusia menyembah berhala, sebab semuanya hanyalah imajinasi dan khayalan orang-orang dahulu saja. Setelah Al-Qur'an menyalahkan dan mematahkan jalan pikiran mereka, dan bahwa apa yang mereka turuti itu adalah jalan pikiran pemimpin-pemimpin mereka yang sesat, maka tentulah pendapat mereka batil dan membawa kepada kesengsaraan.",
      "text_translation": "Katakanlah, “Terangkanlah olehmu tentang sekutu-sekutumu yang kamu seru selain Allah.” Perlihatkanlah kepada-Ku (bagian) manakah dari bumi ini yang telah mereka ciptakan; ataukah mereka mempunyai peran serta dalam (penciptaan) langit; atau adakah Kami memberikan kitab kepada mereka sehingga mereka mendapat keterangan-keterangan yang jelas darinya? Sebenarnya orang-orang zalim itu, sebagian mereka hanya menjanjikan tipuan belaka kepada sebagian yang lain.  ",
      "text": "قُلْ اَرَاَيْتُمْ شُرَكَاۤءَكُمُ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ ۗاَرُوْنِيْ مَاذَا خَلَقُوْا مِنَ الْاَرْضِ اَمْ لَهُمْ شِرْكٌ فِى السَّمٰوٰتِۚ اَمْ اٰتَيْنٰهُمْ كِتٰبًا فَهُمْ عَلٰى بَيِّنَتٍ مِّنْهُۚ بَلْ اِنْ يَّعِدُ الظّٰلِمُوْنَ بَعْضُهُمْ بَعْضًا اِلَّا غُرُوْرًا ",
      "text_translation_en": "Say: “Have you ever [really] considered those beings and forces to whom you ascribe a share in God’s divinity, [and] whom you invoke beside God? Show me what it is that they have created on earth - or do [you claim that] they have a share in [govern­ing] the heavens?” Have We ever vouchsafed them a divine writ on which they could rely as evidence [in support of their views]? Nay, [the hope which] the evildoers hold out to one another [is] nothing but a delusion.",
      "juz_number": 22
    },
    "41": {
      "text_tafsir_en": "God is drawing out the truth and majesty of His power. By his power, the heavens were created without pillars, and the mountains stood firm. Allah spreads creeping things, men, and animals upon the earth, as in the verse: He created the sky without poles as you see it, and He established the mountains (earth) so that it would not shake you; and extends all kinds of living things to the living beings on earth. And We sent down rain from the sky, and planted in it all kinds of good plants. (Luqman \/ 31: 10) It all proves the greatness and power of the Most High God. The concept of God holding the heavens and the earth is to hold the heavens by the law of gravity so that they do not shake and collapse, or move from place to place. God preserves and watches over them with the care He Himself knows. All the celestial bodies in this universe circulate in their own circuits. Astronomers can prove that there has never been a collision between space objects. They all circulate in their own lines. Another affirmation of the meaning contained in the above verse is: And among His signs is the creation of heaven and earth by His will. Then when He calls you once from the earth, you go out immediately. (ar-Romans \/ 30: 25) The power of the heavens and the earth is so strong that it has never suffered any destruction, collapse, and so on because of the power of God. If the Almighty God intended to destroy the earth and the heavens, not one power of a creature could prevent it. Similarly, the other verses make it clear: Do you not see that God is subduing for you (mankind) what is on the earth and the ships that sail on the seas by His command. And He withheld (the objects) of heaven from falling to the earth, except by His permission? Indeed, Allah is Most Merciful, Most Merciful to mankind. (al-hajj \/ 22: 65) In addition to His almighty nature, God also has a compassionate attitude toward his servant. Although the people of this world are most infidels and do not want to submit to the teachings and guidelines of life toward the world and the hereafter, He does not suffer the wrath and wrath of God immediately to condemn the unbelievers and the rebellious. The love of God is that in addition to enduring torture for the disbelievers and the disobedient, it is also very easy to forgive those who want to repent of all their sins, no matter how great a sin they have done. Allah is All-Mighty, Most Merciful, and Merciful to all His servants, both to the believers and to the unbelievers.",
      "text_tafsir": "Allah melukiskan kebenaran dan keagungan kekuasaan-Nya. Dengan kekuasaan-Nya, langit tercipta tanpa tiang, dan gunung-gunung berdiri dengan kokoh. Allah menyebarkan makhluk melata (dabbah), manusia, dan hewan di atas bumi, seperti bunyi ayat:\n\nDia menciptakan langit tanpa tiang sebagaimana kamu melihatnya, dan Dia meletakkan gunung-gunung (di permukaan) bumi agar ia (bumi) tidak menggoyangkan kamu; dan memperkembangbiakkan segala macam jenis makhluk bergerak yang bernyawa di bumi. Dan Kami turunkan air hujan dari langit, lalu Kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik. (Luqman\/31: 10) \n\nSemuanya membuktikan kebesaran dan kekuasaan Allah Yang Mahaagung. Pengertian Allah menahan langit dan bumi ialah menahan langit itu dengan hukum gravitasi agar tidak guncang dan roboh, atau bergeser dari tempatnya. Allah memelihara dan mengawasi keduanya dengan pengawasan yang Dia sendirilah yang mengetahuinya. Semua benda-benda langit di jagat raya ini beredar menurut garis edarnya masing-masing. Para ahli ilmu astronomi dapat membuktikan bahwa tidak pernah terjadi benturan antara benda-benda angkasa itu satu dengan yang lain. Semuanya beredar menurut garis edarnya masing-masing. Keterangan lain yang menguatkan arti yang terkandung dalam ayat di atas yakni:\n\nDan di antara tanda-tanda (kebesaran)-Nya ialah berdirinya langit dan bumi dengan kehendak-Nya. Kemudian apabila Dia memanggil kamu sekali panggil dari bumi, seketika itu kamu keluar (dari kubur). (ar-Rum\/30: 25)\n\nKuatnya bangunan langit dan bumi itu sehingga tidak pernah mengalami kerusakan, keruntuhan, dan sebagainya adalah karena kekuasaan Allah juga. Jika Allah Yang Mahakuasa itu bermaksud menghancurkan bumi dan langit itu, tiada satu kekuatan pun dari makhluk yang sanggup mencegahnya. Demikianlah pula dijelaskan oleh ayat lain:\n\nTidakkah engkau memperhatikan bahwa Allah menundukkan bagimu (manusia) apa yang ada di bumi dan kapal yang berlayar di lautan dengan perintah-Nya. Dan Dia menahan (benda-benda) langit agar tidak jatuh ke bumi, melainkan dengan izin-Nya? Sungguh, Allah Maha Pengasih, Maha Penyayang kepada manusia. (al-hajj\/22: 65)\n\nDi samping sifat-Nya Yang Maha Perkasa itu, Allah juga mempunyai sifat rasa kasih sayang kepada hamba-Nya. Biarpun manusia di bumi ini kebanyakan kafir dan tidak mau tunduk pada pengajaran dan pedoman hidup menuju kesejahteraan dunia dan akhirat yang telah ditetapkan-Nya, namun azab dan murka Allah tiada segera diturunkan untuk menghukum kaum kafir dan pendurhaka. Kasih sayang Allah itu ialah selain menunda siksaan bagi orang kafir dan ingkar, juga sangat mudah memberi ampunan kepada siapa yang mau tobat dari segala kesalahannya, bagaimanapun besarnya perbuatan maksiat yang pernah dilakukannya. Allah Maha Perkasa, Maha Pengasih, dan Penyayang kepada seluruh hamba-Nya, baik terhadap orang mukmin maupun kafir.",
      "text_translation": "Sungguh, Allah yang menahan langit dan bumi agar tidak lenyap; dan jika keduanya akan lenyap tidak ada seorang pun yang mampu menahannya selain Allah. Sungguh, Dia Maha Penyantun, Maha Pengampun.",
      "text": "۞ اِنَّ اللّٰهَ يُمْسِكُ السَّمٰوٰتِ وَالْاَرْضَ اَنْ تَزُوْلَا ەۚ وَلَىِٕنْ زَالَتَآ اِنْ اَمْسَكَهُمَا مِنْ اَحَدٍ مِّنْۢ بَعْدِهٖ ۗاِنَّهٗ كَانَ حَلِيْمًا غَفُوْرًا",
      "text_translation_en": "Verily, it is God [alone] who upholds the celestial bodies and the earth, lest they deviate [from their orbits] - for if they should ever deviate, there is none that could uphold them after He will have ceased to do so. [But,] verily, He is ever-forbearing, much-for­giving!",
      "juz_number": 22
    },
    "42": {
      "text_tafsir_en": "The Muslims swore wholeheartedly, if God had sent an apostle who warned of the misdeeds of the people and the moral degradation of his people, surely they would have been more receptive to the apostle's instructions than any of them had ever been before. The explanation of this verse is further reinforced by another verse that reads: If we had a scripture from the ancient people, we would have been the servants of God sanctified (from sin). But it turns out that they have denied it (the Qur'an); then they will know. (ash-shaffat \/ 37: 168-170) In Tafsir al-Khazin it is reported that the heathen of Mecca when they knew the Scripture (Jews and Christians) denied the apostles sent to them, and they swore in the name of Allah if they were sent as the apostles had been sent to the Children of Israel, they would have become a nation more worthy of guidance than Jews and Christians. This was their attitude before Muhammad was sent as an apostle. But when he was truly sent to them, they rejected him, according to the attitude of the Scriptures against his apostles. To warn the Muslims of the attitude of the unbelievers who had obtained the pure truth of the Prophet Muhammad and his brochure, Allah sent down the above verses. Once their dream came true, that was when Muhammad saw them as messengers in their community to convey the truth from Allah, which is listed in the Qur'an al-Karim, they immediately denied it. Even their stubbornness and arrogance have grown. They were not closer to the truth, but further to the cause of maintaining the honor and dignity of their people. In fact, the Meccan Muslim leaders refused to follow the teachings of Prophet Muhammad. Their condition is similar to that of a fleeing wild camel, the more they are chased by the owner, the faster they run and the more they lose their way, making it difficult to catch.",
      "text_tafsir": "Orang-orang musyrik itu bersumpah dengan sepenuh hati, seandainya Allah mengirimkan seorang rasul yang memperingatkan kesesatan jalan pikiran dan kerusakan moral masyarakatnya, pasti merekalah yang paling mudah menerima petunjuk rasul itu, dibanding dengan umat mana pun yang pernah ada sebelum mereka. Penjelasan ayat ini diperkuat pula oleh ayat lain yang berbunyi:\n\nSekiranya di sisi kami ada sebuah kitab dari (kitab-kitab yang diturunkan) kepada orang-orang dahulu, tentu kami akan menjadi hamba Allah yang disucikan (dari dosa). Tetapi ternyata mereka mengingkarinya (Al-Qur'an); maka kelak mereka akan mengetahui (akibat keingkarannya itu). (ash-shaffat\/37: 168-170)\n\nDalam Tafsir al-Khazin diriwayatkan bahwa orang-orang kafir Mekah ketika mengetahui Ahli Kitab (Yahudi dan Nasrani) mendustakan para rasul yang diutus kepada mereka, mereka pun bersumpah dengan nama Allah seandainya kepada mereka diutus pula rasul seperti yang pernah diutus kepada Bani Israil itu, tentulah mereka akan menjadi bangsa yang lebih banyak memperoleh petunjuk dibanding dengan kaum Yahudi dan Nasrani. Sikap demikian itu mereka tunjukkan sebelum Muhammad saw diutus sebagai rasul. Tetapi, setelah beliau betul-betul diutus ke tengah mereka, mereka pun mendustakannya sebagaimana sikap Ahli Kitab terhadap rasul-Nya. Untuk memperingatkan kaum Muslimin akan sikap orang-orang kafir yang telah memperoleh kebenaran murni tentang Nabi Muhammad dan risalahnya itu, Allah menurunkan ayat-ayat di atas. \n\nSetelah impian mereka menjadi kenyataan, yakni dengan diutusnya Muhammad saw sebagai rasul di tengah masyarakat mereka untuk menyampaikan kebenaran dari Allah, yang tercantum dalam Al-Qur'an al-Karim, maka dengan serta merta mereka mendustakannya. Bahkan sikap keingkaran dan kesombongan mereka makin menjadi-jadi. Mereka bukannya makin dekat kepada kebenaran, bahkan semakin jauh dengan alasan menjaga kehormatan dan martabat kaumnya. Tegasnya, para pemimpin musyrik Mekah itu enggan mengikuti ajaran Nabi Muhammad. Keadaan mereka serupa dengan unta liar yang kabur, semakin dikejar oleh pemiliknya, semakin cepat larinya dan semakin tersesat jalannya, sehingga sukar ditangkap.",
      "text_translation": "Dan mereka bersumpah dengan nama Allah dengan sungguh-sungguh bahwa jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat (yang lain). Tetapi ketika pemberi peringatan datang kepada mereka, tidak menambah (apa-apa) kepada mereka, bahkan semakin jauh mereka dari (kebenaran),",
      "text": "وَاَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْ لَىِٕنْ جَاۤءَهُمْ نَذِيْرٌ لَّيَكُوْنُنَّ اَهْدٰى مِنْ اِحْدَى الْاُمَمِۚ فَلَمَّا جَاۤءَهُمْ نَذِيْرٌ مَّا زَادَهُمْ اِلَّا نُفُوْرًاۙ ",
      "text_translation_en": "As it is, they [who are averse to the truth often] swear by God with their most solemn oaths that if a warner should ever come to them, they would follow his guidance better than any of the communities [of old had followed the warner sent to them]: but now that a warner has come unto them, [his call] but increases their aversion,",
      "juz_number": 22
    },
    "43": {
      "text_tafsir_en": "This verse still describes the attitude of the Meccans toward the Prophet's preaching. With all their might and mind, with their wealth and wealth, they opposed the Prophet Muhammad's preaching, and even he was boycotted and obstructed. However, any malicious plan to break the Islamic message eventually became a boon to them. The failure of the Meccans to prevent the spread of Islamic preaching has been engraved in gold in Islamic history. Every attempt and evil plan to extinguish the light of God's religion on this earth will surely fail, for God will always preserve his religious existence on this earth, until the end of the world, despite the dislike of the Muslims, as stated in the verse: They to extinguish the light (religion) of God with their mouths, but Allah refines His light even though the disbelievers hate it. (ash-shaff \/ 61: 8) In Aisar at-Tafasir a story is told that the Ka'ab said to Ibn 'Abbas, \"In the Torah it is said that whoever digs a hole for his friend, it is he who enters it.\" Ibn 'Abbas replied, \"That is what I find in the Qur'an.\" Ka'ab asked, \"Where?\" Ibn 'Abbas replied, \"Read wa la yahiqul makrus-sayyi' illa bi ahlih (The evil plan will only overtake those who plan it for themselves.)\" As described above, sometimes Allah deferring torture as evidence of His love. to the unbelievers. However, do not think that God will not torment them if they do not repent, for if they did not experience the torment, in the hereafter they will also. In the hereafter they will believe that the wrongdoer was placed by God in accordance with God's threat when they were in the world. And the unjust will know where they will come from. (asy-Syu'ara '\/ 26: 227) Though the punishment is surely coming, those who disbelieve it still resist his coming without stopping all his evil deeds. In this verse, God reveals their fate in the future by saying that they have nothing to look forward to but the torture that mankind has experienced in the past because of their disobedience to the apostles' pamphlets. However, the end of this verse confirms that Allah determines that everyone who rejects His teaching will be tormented with a torment that will not change and will not be passed on to others. God will not bestow His mercy upon a person who has been recorded as a rebel and a sinner, nor will He bring guilt upon others. And one will not bear the burden of another's sin. (al-An'am \/ 6: 164) (44) Allah commanded the Prophet Muhammad to warn the liars (disbelievers), if they had not traveled to witness the terrible torment which had been inflicted upon the nations by their disobedience to the truth the teachings of God. This verse is aimed at the Meccan monks, who are generally in the habit of trading livestock. At certain times, the Quraysh caravan traveled to Sham (Syria) and Iraq. In the desert areas they visit, there are many former states that were inhabited by people in ancient times, as a result of the rebellion of the inhabitants of the Messenger of Allah. They are tortured, and the earth upon which they trod may be overturned and utterly destroyed. Allah warns the Quraysh traders, even if they also follow in the footsteps of His people, then they will surely obey. They will feel the torment and the punishment they cannot bear. To convince them, this verse 44 further explains that the people who had retaliated by their attitudes and actions against the apostles' teachings were powerful, courageous, wealthy, and numerous descendants. Nevertheless, their great power, wealth, and posterity did not seem able to defend and protect them from the torment of God. The purpose of walking the earth, according to the interpretation of Sayid Quthub in the Interpretation of the Qur'an, is to walk with open eyes and a fresh mind while contemplating the events of the past, how and how they were affected. Allah's punishment. Such a journey, he said, enhances his fear of God, awakens his heart from oblivion and delays in the inevitable sunatullah. They are reminded that God Almighty never fails to carry out His decision, if He wills. For it is said that there is no power and strength that is able to weaken God, whether it be in heaven or on earth. How is God weak? Doesn't His knowledge and power cover the kingdoms of heaven and earth? How is it possible that His creatures, when all mankind is united against the power of God, will not be able to overthrow or match His power, while they are all made physically weak? Allah says: Allah wants to give you relief, because man is made (weak). (an-Nisa '\/ 4:28) Look at the end of this verse by emphasizing that God is all-knowing and all-powerful in all His creatures. In al-Maragi's Interpretation it is explained that Allah is All-Knowing and Powerful to those who need immediate punishment. Instead, he who repents, and desires to return to God from his error, he guides him to full faith. When the Muslims asked the Prophet Muhammad for the promised torment to be brought down, it was explained to them that Allah had decreed His rule for this people, that torture would not be immediately revealed to those who had disobeyed or disobeyed the teachings of the apostles. It is hoped that some of them may still be willing to accept and return to the teachings of their God",
      "text_tafsir": "Ayat ini masih menjelaskan sikap orang musyrik Mekah terhadap dakwah Nabi saw. Dengan segala daya dan pikiran, dengan harta dan kekayaan yang dimiliki, mereka menentang dakwah Nabi Muhammad, bahkan beliau diboikot dan dihalangi. Tetapi, segala rencana jahat guna mematahkan dakwah Islam itu pada akhirnya menjadi bumerang bagi mereka. Kegagalan kaum kafir Mekah mencegah tersiarnya dakwah Islam telah tertulis dengan tinta emas dalam sejarah Islam. Setiap usaha dan rencana jahat untuk memadamkan cahaya agama Allah di bumi ini, pasti akan gagal, sebab Allah selalu akan memelihara eksistensi agama-Nya di bumi ini, sampai akhir zaman, biarpun tidak disukai oleh orang-orang musyrik, sebagaimana disebutkan dalam ayat:\n\nMereka hendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka, tetapi Allah tetap menyempurnakan cahaya-Nya meskipun orang-orang kafir membencinya. (ash-shaff\/61: 8) \n\nDalam Aisar at-Tafasir disebutkan satu riwayat bahwa Ka'ab berkata kepada Ibnu 'Abbas, \"Dalam Taurat diterangkan bahwa siapa yang menggali lubang untuk kawannya, dialah yang masuk ke dalamnya.\" Ibnu 'Abbas menjawab, \"Hal itu aku temukan dalam Al-Qur'an.\" Ka'ab bertanya, \"Di mana?\" Ibnu 'Abbas menjawab, \"Bacalah wa la yahiqul makrus-sayyi' illa bi ahlih (Rencana yang jahat itu hanya akan menimpa orang yang merencanakannya sendiri.)\" \n\nSeperti diuraikan di atas, kadang-kadang Allah menunda kedatangan siksa sebagai bukti kasih sayang-Nya kepada orang-orang kafir. Tetapi, jangan dikira bahwa Allah tidak akan menyiksa mereka bila mereka tidak tobat, sebab bila mereka di dunia belum merasakan siksaan, di akhirat kelak pasti akan mereka alami juga. Di akhirat nanti baru mereka yakini ke mana orang yang zalim itu ditempatkan Allah sesuai dengan ancaman Allah ketika mereka masih di dunia.\n\nDan orang-orang yang zalim kelak akan tahu ke tempat mana mereka akan kembali. (asy-Syu'ara'\/26: 227)\n\nSekalipun azab itu sudah pasti datang, orang-orang yang tidak mengimaninya masih saja menentang kedatangannya dengan tidak menghentikan segala perbuatan jahatnya. Dalam ayat ini, Allah mengungkapkan nasib mereka kelak dengan mengatakan bahwa tidak ada yang mereka tunggu-tunggu itu melainkan siksaan seperti apa yang telah menimpa manusia dahulu kala disebabkan keingkaran mereka terhadap risalah para rasul. Tetapi, ujung ayat ini menegaskan bahwa sunah Allah menentukan bahwa setiap orang yang mendustakan ajaran-Nya pasti akan disiksa dengan azab yang tidak akan berubah dan tidak akan dipindahkan kepada orang lain. Allah tidak akan melimpahkan rahmat-Nya pada seseorang yang sudah tercatat sebagai pembangkang dan pendosa, serta tidak akan memikulkan dosanya kepada diri orang lain.\n\nDan seseorang tidak akan memikul beban dosa orang lain. (al-An'am\/6: 164) \n\n(44) Allah memerintahkan kepada Nabi Muhammad supaya memperingatkan kaum pendusta (musyrik), apakah mereka tidak pernah melakukan perjalanan untuk menyaksikan betapa dahsyatnya azab yang diturunkan pada bangsa-bangsa dahulu akibat keingkaran mereka pada kebenaran ajaran Allah.\n\nSemula ayat ini ditujukan kepada kaum musyrik Mekah, yang umumnya bermata pencaharian berdagang. Pada musim-musim tertentu, kafilah Quraisy berangkat menuju Syam (Syiria) dan Irak. Pada daerah-daerah gurun pasir yang mereka lewati, banyak terdapat bekas-bekas negeri yang pernah dihuni manusia di zaman kuno, akibat kedurhakaan penduduknya kepada rasul utusan Allah. Mereka disiksa, dan bumi tempat mereka berpijak dijungkirbalikkan sehingga hancur sama sekali. Allah memperingatkan kaum pedagang Quraisy, andaikata mereka juga mengikuti jejak bangsa yang mendustakan-Nya, maka kepada mereka pasti akan berlaku sunatullah. Mereka akan merasakan siksaan dan azab yang tidak sanggup mereka tolak. \n\nUntuk meyakinkan mereka, ayat 44 ini lebih lanjut memberi penjelasan bahwa umat-umat yang telah merasakan balasan akibat sikap dan tindak-tanduk mereka yang menentang ajaran rasul itu adalah umat yang perkasa, berani, punya harta, dan anak keturunan yang banyak sekali. Namun demikian, keperkasaan, kekayaan, dan keturunan mereka yang besar itu ternyata tidak sanggup membela dan melindunginya dari azab Allah. \n\nMaksud berjalan di muka bumi, menurut penafsiran Sayid Quthub dalam Tafsir fi Â¨ilal al-Qur'an, adalah berjalan dengan mata hati terbuka dan pikiran yang segar sambil merenungkan peristiwa-peristiwa yang pernah menimpa umat dahulu, betapa dan bagaimana keadaan mereka sewaktu ditimpa azab Allah. Perjalanan demikian, menurutnya, menambah perasaan takwa kepada Allah, membangunkan hati dari kelalaian dan kelengahan akan sunatullah yang pasti berlaku itu. Mereka diingatkan bahwa Allah Yang Mahakuasa itu tidak pernah kewalahan untuk melaksanakan keputusan-Nya, apabila Dia telah menginginkan. Sebab dengan tegas dikatakan tiada satu daya dan kekuatan yang sanggup melemahkan Allah, baik kekuatan itu terdapat di langit maupun di bumi. Bagaimana Allah itu lemah? Bukankah ilmu dan kekuasaan-Nya meliputi kerajaan langit dan bumi? Bagaimana mungkin makhluk ciptaan-Nya, Sekalipun seluruh manusia bersatu menandingi kekuasaan Allah, tidak akan sanggup menjatuhkan atau menandingi kekuasaan-Nya, sedang semuanya dijadikan dengan fisik yang lemah? Allah berfirman:\n\nAllah hendak memberikan keringanan kepadamu, karena manusia diciptakan (bersifat) lemah. (an-Nisa'\/4: 28)\n\nPerhatikanlah akhir ayat ini dengan penegasan bahwa Allah Maha Mengetahui dan Mahakuasa terhadap segala makhluk ciptaan-Nya. Dalam Tafsir al-Maragi dijelaskan bahwa Allah Maha Mengetahui dan Mahakuasa terhadap orang-orang yang harus mendapatkan siksaan dengan segera. Sebaliknya, orang yang tobat, dan ingin kembali kepada Tuhan dari kesesatannya, Dia memberi petunjuk kepadanya sehingga beriman sepenuhnya. Ketika orang-orang musyrik meminta kepada Nabi Muhammad agar azab yang dijanjikan itu segera diturunkan, maka diterangkan kepada mereka bahwa Allah menentukan peraturan-Nya bagi umat ini, yakni siksaan tidak segera diturunkan kepada mereka yang melakukan kedurhakaan atau keingkaran terhadap ajaran rasul. Sebab diharapkan sebagian di antara mereka mungkin masih ada yang insaf dan kembali kepada ajaran Tuhannya",
      "text_translation": "karena kesombongan (mereka) di bumi dan karena rencana (mereka) yang jahat. Rencana yang jahat itu hanya akan menimpa orang yang merencanakannya sendiri. Mereka hanyalah menunggu (berlakunya) ketentuan kepada orang-orang yang terdahulu. Maka kamu tidak akan mendapatkan perubahan bagi Allah, dan tidak (pula) akan menemui penyimpangan bagi ketentuan Allah itu.",
      "text": " ۨاسْتِكْبَارًا فِى الْاَرْضِ وَمَكْرَ السَّيِّئِۗ وَلَا يَحِيْقُ الْمَكْرُ السَّيِّئُ اِلَّا بِاَهْلِهٖ ۗفَهَلْ يَنْظُرُوْنَ اِلَّا سُنَّتَ الْاَوَّلِيْنَۚ فَلَنْ تَجِدَ لِسُنَّتِ اللّٰهِ تَبْدِيْلًا ەۚ وَلَنْ تَجِدَ لِسُنَّتِ اللّٰهِ تَحْوِيْلًا",
      "text_translation_en": "their arro­gant behaviour on earth, and their devising of evil [arguments against God’s messages]. Yet [in the end,] such evil scheming will engulf none but its authors: and can they expect anything but [to be made to go] the way of those [sinners] of olden times? Thus [it is]: no change wilt thou ever find in God’s way; yea, no deviation wilt thou ever find in God’s way!",
      "juz_number": 22
    },
    "44": {
      "text_tafsir_en": "This verse still describes the attitude of the Meccans toward the Prophet's preaching. With all their might and mind, with their wealth and wealth, they opposed the Prophet Muhammad's preaching, and even he was boycotted and obstructed. However, any malicious plan to break the Islamic message eventually became a boon to them. The failure of the Meccans to prevent the spread of Islamic preaching has been engraved in gold in Islamic history. Every attempt and evil plan to extinguish the light of God's religion on this earth will surely fail, for God will always preserve his religious existence on this earth, until the end of the world, despite the dislike of the Muslims, as stated in the verse: They to extinguish the light (religion) of God with their mouths, but Allah refines His light even though the disbelievers hate it. (ash-shaff \/ 61: 8) In Aisar at-Tafasir a story is told that the Ka'ab said to Ibn 'Abbas, \"In the Torah it is said that whoever digs a hole for his friend, it is he who enters it.\" Ibn 'Abbas replied, \"That is what I find in the Qur'an.\" Ka'ab asked, \"Where?\" Ibn 'Abbas replied, \"Read wa la yahiqul makrus-sayyi' illa bi ahlih (The evil plan will only overtake those who plan it for themselves.)\" As described above, sometimes Allah deferring torture as evidence of His love. to the unbelievers. However, do not think that God will not torment them if they do not repent, for if they did not experience the torment, in the hereafter they will also. In the hereafter they will believe that the wrongdoer was placed by God in accordance with God's threat when they were in the world. And the unjust will know where they will come from. (asy-Syu'ara '\/ 26: 227) Though the punishment is surely coming, those who disbelieve it still resist his coming without stopping all his evil deeds. In this verse, God reveals their fate in the future by saying that they have nothing to look forward to but the torture that mankind has experienced in the past because of their disobedience to the apostles' pamphlets. However, the end of this verse confirms that Allah determines that everyone who rejects His teaching will be tormented with a torment that will not change and will not be passed on to others. God will not bestow His mercy upon a person who has been recorded as a rebel and a sinner, nor will He bring guilt upon others. And one will not bear the burden of another's sin. (al-An'am \/ 6: 164)",
      "text_tafsir": "Ayat ini masih menjelaskan sikap orang musyrik Mekah terhadap dakwah Nabi saw. Dengan segala daya dan pikiran, dengan harta dan kekayaan yang dimiliki, mereka menentang dakwah Nabi Muhammad, bahkan beliau diboikot dan dihalangi. Tetapi, segala rencana jahat guna mematahkan dakwah Islam itu pada akhirnya menjadi bumerang bagi mereka. Kegagalan kaum kafir Mekah mencegah tersiarnya dakwah Islam telah tertulis dengan tinta emas dalam sejarah Islam. Setiap usaha dan rencana jahat untuk memadamkan cahaya agama Allah di bumi ini, pasti akan gagal, sebab Allah selalu akan memelihara eksistensi agama-Nya di bumi ini, sampai akhir zaman, biarpun tidak disukai oleh orang-orang musyrik, sebagaimana disebutkan dalam ayat:\n\nMereka hendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka, tetapi Allah tetap menyempurnakan cahaya-Nya meskipun orang-orang kafir membencinya. (ash-shaff\/61: 8) \n\nDalam Aisar at-Tafasir disebutkan satu riwayat bahwa Ka'ab berkata kepada Ibnu 'Abbas, \"Dalam Taurat diterangkan bahwa siapa yang menggali lubang untuk kawannya, dialah yang masuk ke dalamnya.\" Ibnu 'Abbas menjawab, \"Hal itu aku temukan dalam Al-Qur'an.\" Ka'ab bertanya, \"Di mana?\" Ibnu 'Abbas menjawab, \"Bacalah wa la yahiqul makrus-sayyi' illa bi ahlih (Rencana yang jahat itu hanya akan menimpa orang yang merencanakannya sendiri.)\" \n\nSeperti diuraikan di atas, kadang-kadang Allah menunda kedatangan siksa sebagai bukti kasih sayang-Nya kepada orang-orang kafir. Tetapi, jangan dikira bahwa Allah tidak akan menyiksa mereka bila mereka tidak tobat, sebab bila mereka di dunia belum merasakan siksaan, di akhirat kelak pasti akan mereka alami juga. Di akhirat nanti baru mereka yakini ke mana orang yang zalim itu ditempatkan Allah sesuai dengan ancaman Allah ketika mereka masih di dunia.\n\nDan orang-orang yang zalim kelak akan tahu ke tempat mana mereka akan kembali. (asy-Syu'ara'\/26: 227)\n\nSekalipun azab itu sudah pasti datang, orang-orang yang tidak mengimaninya masih saja menentang kedatangannya dengan tidak menghentikan segala perbuatan jahatnya. Dalam ayat ini, Allah mengungkapkan nasib mereka kelak dengan mengatakan bahwa tidak ada yang mereka tunggu-tunggu itu melainkan siksaan seperti apa yang telah menimpa manusia dahulu kala disebabkan keingkaran mereka terhadap risalah para rasul. Tetapi, ujung ayat ini menegaskan bahwa sunah Allah menentukan bahwa setiap orang yang mendustakan ajaran-Nya pasti akan disiksa dengan azab yang tidak akan berubah dan tidak akan dipindahkan kepada orang lain. Allah tidak akan melimpahkan rahmat-Nya pada seseorang yang sudah tercatat sebagai pembangkang dan pendosa, serta tidak akan memikulkan dosanya kepada diri orang lain.\n\nDan seseorang tidak akan memikul beban dosa orang lain. (al-An'am\/6: 164)",
      "text_translation": "Dan tidakkah mereka bepergian di bumi lalu melihat bagaimana kesudahan orang-orang sebelum mereka (yang mendustakan rasul), padahal orang-orang itu lebih besar kekuatannya dari mereka? Dan tidak ada sesuatu pun yang dapat melemahkan Allah baik di langit maupun di bumi. Sungguh, Dia Maha Mengetahui, Mahakuasa.",
      "text": "اَوَلَمْ يَسِيْرُوْا فِى الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ مِنْ قَبْلِهِمْ وَكَانُوْٓا اَشَدَّ مِنْهُمْ قُوَّةً ۗوَمَا كَانَ اللّٰهُ لِيُعْجِزَهٗ مِنْ شَيْءٍ فِى السَّمٰوٰتِ وَلَا فِى الْاَرْضِۗ اِنَّهٗ كَانَ عَلِيْمًا قَدِيْرًا ",
      "text_translation_en": "Have they never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time and were [so much] greater than they in power? And [do they not see that the will of] God can never be foiled by anything whatever in the heavens or on earth, since, verily, He is all-knowing, infinite in His power?",
      "juz_number": 22
    },
    "45": {
      "text_tafsir_en": "This verse explains the manifestations of the nature of rahman and rahim from Allah. If Allah directly tortures the polytheists as they wish, surely they and the animals die of thirst due to lack of drinking. However, God does not act like that even though He is in power, instead He sets a provision that is the torture is delayed until a time only known to Himself. However, if the punishment has befallen, it will not be reduced and they will not be able to escape. Such provisions of Allah only apply to the people of the Prophet Muhammad, while in the previous community if they were guilty, immediately punished without delay. In Tafsir al-Wadhih explained that the provision is a glory that God gave to the Prophet Muhammad, as a law for him and his people. With the hope that those who still do not want to believe immediately repent, return to His instructions and teachings. However, when the promise of God has come, there is no more time to delay it. That's where later each person will count towards his actions. The good is rewarded with good, the evil is punished. With God's love and mercy, the Qur'an calls on people to repent and return to Him. Even though the doom has been postponed, but when the time is certain, no one will know. People who feel guilty do not need to despair, because no matter how big the mistake, if it ends with real regret and repentance, surely God will be forgiven. He is the Most Forgiving and Merciful. He is the All-Knowing and caring for all His servants.",
      "text_tafsir": "Ayat ini menjelaskan manifestasi dari sifat rahman dan rahim dari Allah. Jika Allah langsung menyiksa orang-orang musyrik itu seperti apa yang mereka kehendaki, pasti mereka dan binatang-binatang mati kehausan akibat kurang minum. Tetapi, Allah tidak bertindak begitu sekalipun Dia berkuasa, sebaliknya Dia tetapkan suatu ketentuan yakni siksaan itu ditunda sampai pada waktu yang hanya diketahui-Nya sendiri. Akan tetapi, kalau azab itu telah menimpa, tidak akan dikurangi dan mereka tidak akan bisa melepaskan diri. Ketentuan Allah yang demikian itu hanya berlaku bagi umat Nabi Muhammad saja, sedang pada umat sebelumnya bila mereka bersalah, langsung dihukum tanpa penundaan. \n\nDalam Tafsir al-Wadhih dijelaskan bahwa ketentuan itu adalah kemuliaan yang dikaruniakan Allah kepada Nabi Muhammad, sebagai suatu hukum bagi beliau dan umatnya. Dengan harapan agar orang-orang yang masih belum mau beriman segera tobat, kembali kepada petunjuk dan ajaran-Nya. Tetapi, bila janji Allah telah datang, tidak ada waktu lagi untuk menundanya. Di situlah nanti masing-masing orang akan diperhitungkan perbuatannya. Yang baik dibalas dengan ganjaran kebaikan, yang jahat dibalas dengan azab.\n\nDengan kasih dan sayang Allah, Al-Qur'an menyerukan supaya manusia bertobat dan kembali kepada-Nya. Biarpun azab itu telah ditunda kedatangannya, namun kapan waktunya yang pasti, tiada seorang pun yang mengetahuinya. Orang yang merasa dirinya bersalah tidak perlu berputus asa, sebab betapapun besarnya kesalahan, jika diakhiri dengan penyesalan dan tobat yang sesungguhnya, pasti akan diampuni Allah. Dialah Yang Maha Pengampun dan Penyayang. Dialah Yang Maha Mengetahui dan memperhatikan sekalian hamba-Nya.",
      "text_translation": "Dan sekiranya Allah menghukum manusia disebabkan apa yang telah mereka perbuat, niscaya Dia tidak akan menyisakan satu pun makhluk bergerak yang bernyawa di bumi ini, tetapi Dia menangguhkan (hukuman)nya, sampai waktu yang sudah ditentukan. Nanti apabila ajal mereka tiba, maka Allah Maha Melihat (keadaan) hamba-hamba-Nya.",
      "text": "وَلَوْ يُؤَاخِذُ اللّٰهُ النَّاسَ بِمَا كَسَبُوْا مَا تَرَكَ عَلٰى ظَهْرِهَا مِنْ دَاۤبَّةٍ وَّلٰكِنْ يُّؤَخِّرُهُمْ اِلٰٓى اَجَلٍ مُّسَمًّىۚ فَاِذَا جَاۤءَ اَجَلُهُمْ فَاِنَّ اللّٰهَ كَانَ بِعِبَادِهٖ بَصِيْرًا ࣖ ",
      "text_translation_en": "Now if God were to take men [at once] to task for whatever [wrong] they commit [on earth], He would not leave a single living creature upon its surface. However, He grants them respite for a term set [by Him]: but when their term comes to an end - then, verily, [they come to know that] God sees all that is in [the hearts of] His servants.",
      "juz_number": 22
    }
  },
  "name": "فاطر",
  "name_translation_en": "The Originator",
  "name_translation": "Maha Pencipta",
  "name_latin": "Fatir"
}