{
  "number": 38,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 88,
  "ayat": {
    "1": {
      "text_tafsir_en": "Allah begins His word with the Fawatih as-Suwar \"shad.\", Just as He initiated several surahs were revealed in Mecca and two surahs were revealed in Medinah. On the interpretation of Fawatih as-Suwar has been widely used in the interpretation of the first verse of the second chapter (al-Baqarah in the Qur'an and its Interpretation of Volume 1). Then Allah swore by the Qur'an that its glory, the glory of his glory and the perfection of his law were magnificent and wonderful. The Qur'an is treated with \"greatness\" so that people can understand that the Qur'an given to His Messenger is from Allah, and contains the true teachings that the Messenger of Allah conveyed to all mankind.",
      "text_tafsir": "Allah memulai firman-Nya dengan Fawatih as-Suwar \"shad.\", seperti halnya Dia memulai beberapa surah yang diturunkan di Mekah dan dua buah surah yang diturunkan di Medinah. Mengenai penafsiran Fawatih as-Suwar telah dikemukakan secara luas pada penafsiran ayat yang pertama surah yang kedua (al-Baqarah dalam Al-Qur'an dan Tafsirnya Jilid 1). \n\nKemudian Allah bersumpah dengan Al-Qur'an yang mempunyai keagungan isinya, kemuliaan martabatnya serta kesempurnaan hukumnya yang mengagungkan dan menakjubkan.\n\nAl-Qur'an disifati dengan \"yang mempunyai keagungan\" agar manusia memahami bahwa Al-Qur'an yang diturunkan kepada rasul-Nya itu benar-benar dari Allah, dan mengandung ajaran yang benar yang disampaikan oleh Rasulullah kepada seluruh manusia.",
      "text_translation": "Shad, demi Al-Qur'an yang mengandung peringatan. ",
      "text": "صۤ ۗوَالْقُرْاٰنِ ذِى الذِّكْرِۗ",
      "text_translation_en": "Sad. CONSIDER this Qur’an, endowed with all that one ought to remember!",
      "juz_number": 23
    },
    "2": {
      "text_tafsir_en": "God reveals the condition of the infidels of Mecca who deny the truth of revelation, and cannot see the values of truth, which is very important to their worldly prosperity and the happiness of the hereafter, because of their arrogance and hostility in their souls. Their arrogance was evident in their actions toward the Prophet and his followers. They despise Muslims for feeling stronger and richer. While the Muslims are poor and few in number. This hostility was due to the teachings of the Apostle threatening the religion of their ancestors, and dishonoring the statues they had worshiped in the presence of God.",
      "text_tafsir": "Allah mengungkapkan keadaan orang-orang kafir Mekah yang mengingkari kebenaran wahyu, dan tidak dapat melihat nilai-nilai kebenarannya, yang sebenarnya sangat penting bagi kesejahteraan mereka di dunia dan kebahagiaan di akhirat, karena kesombongan dan permusuhan yang bersarang dalam jiwa mereka.\n\nKesombongan mereka tampak pada tindakan mereka terhadap Rasul dan para pengikutnya. Mereka sangat merendahkan kaum Muslimin karena merasa lebih kuat dan lebih banyak hartanya. Sedangkan kaum Muslimin terdiri dari orang-orang miskin dan berjumlah sedikit.\n\nPermusuhan yang sengit itu disebabkan karena ajaran yang dibawa oleh Rasul itu mengancam agama nenek moyang mereka, dan menghinakan patung-patung yang mereka jadikan sembahan-sembahan di samping Allah.",
      "text_translation": "Tetapi orang-orang yang kafir (berada) dalam kesombongan dan permusuhan.",
      "text": "بَلِ الَّذِيْنَ كَفَرُوْا فِيْ عِزَّةٍ وَّشِقَاقٍ",
      "text_translation_en": "But nay - they who are bent on denying the truth are lost in [false] pride, and [hence] deeply in the wrong.",
      "juz_number": 23
    },
    "3": {
      "text_tafsir_en": "God denies their arrogance and enmity by explaining that many of the people before them, who despised and rejected God's apostles, were destroyed. When the punishment was inflicted, they sought Allah's help. But the request is useless, and they will not be able to escape the devastating torment. Allah says: When they saw Our torment, they said, \"We believe only in Allah, and we disbelieve in the deeds which we have associated with Allah.\" (al-Mu'min \/ 40: 84) And His saying: When they felt Our punishment, they fled from it. Do not run in haste; return to the comforts of your life and your (good) residences, that you may be asked. (al-Anbiya '\/ 21: 12-13)",
      "text_tafsir": "Allah mengecam kesombongan dan permusuhan mereka dengan menjelaskan bahwa betapa banyak umat sebelum mereka, yang menghina dan mengingkari rasul-rasul Allah, dibinasakan-Nya. Ketika azab itu ditimpakan, mereka meminta pertolongan kepada Allah. Namun permintaan itu tidak berguna lagi, dan mereka tidak akan dapat melepaskan diri dari siksa yang membinasakan.\n\nAllah berfirman:\n\nMaka ketika mereka melihat azab Kami, mereka berkata, \"Kami hanya beriman kepada Allah saja dan kami ingkar kepada sembahan-sembahan yang telah kami persekutukan dengan Allah.\" (al-Mu'min\/40: 84)\n\nDan firman-Nya:\n\nMaka ketika mereka merasakan azab Kami, tiba-tiba mereka melarikan diri dari (negerinya) itu. Janganlah kamu lari tergesa-gesa; kembalilah kamu kepada kesenangan hidupmu dan tempat-tempat kediamanmu (yang baik), agar kamu dapat ditanya. (al-Anbiya'\/21: 12-13)",
      "text_translation": "Betapa banyak umat sebelum mereka yang telah Kami binasakan, lalu mereka meminta tolong padahal (waktu itu) bukanlah saat untuk lari melepaskan diri.",
      "text": "كَمْ اَهْلَكْنَا مِنْ قَبْلِهِمْ مِّنْ قَرْنٍ فَنَادَوْا وَّلَاتَ حِيْنَ مَنَاصٍ",
      "text_translation_en": "How many a generation have We destroyed before their time [for this very sin]! And [how] they called [unto Us] when it was too late to escape!",
      "juz_number": 23
    },
    "4": {
      "text_tafsir_en": "This verse expresses the astonishment of the unbelievers of Mecca when the prophets who came to them turned out to be ordinary people from among them as well. According to them, Muhammad who claimed to be the apostle had no privileges, both physical and spiritual, but the rank of the apostle was high. Thus, it is impossible for Muhammad to occupy a high position. That is why they say Muhammad is only a magician. He's a liar and a liar. What is said is either a command or a prohibition from God is a lie. The Word of God: Man should be surprised that We give a revelation to a man among them, \"Give warning to men and make them glad that they are high in the sight of God.\" The disbelievers say, \"This man (Muhammad) is a true witch.\" (Jonah 10: 2)",
      "text_tafsir": "Ayat ini mengungkapkan keadaan orang-orang kafir Mekah yang sangat heran ketika nabi yang datang kepada mereka ternyata manusia biasa dari kalangan mereka juga. Menurut mereka, Muhammad yang mengaku dirinya diangkat menjadi rasul itu tidak mempunyai keistimewaan, baik keistimewaan jasmani maupun rohani, padahal kedudukan rasul itu tinggi. Dengan demikian, tidak mungkin Muhammad menduduki kedudukan yang tinggi. Itulah sebabnya maka mereka mengatakan bahwa Muhammad hanyalah tukang sihir. Dia penipu dan pendusta. Apa yang disampaikan baik berupa perintah atau pun larangan yang dikatakan dari Allah adalah dusta. Firman Allah:\n\nPantaskah manusia menjadi heran bahwa Kami memberi wahyu kepada seorang laki-laki di antara mereka, \"Berilah peringatan kepada manusia dan gembirakanlah orang-orang beriman bahwa mereka mempunyai kedudukan yang tinggi di sisi Tuhan.\" Orang-orang kafir berkata, \"Orang ini (Muhammad) benar-benar pesihir.\" (Yunus\/10: 2)",
      "text_translation": "Dan mereka heran karena mereka kedatangan seorang pemberi peringatan (rasul) dari kalangan mereka; dan orang-orang kafir berkata, “Orang ini adalah pesihir yang banyak berdusta.”",
      "text": "وَعَجِبُوْٓا اَنْ جَاۤءَهُمْ مُّنْذِرٌ مِّنْهُمْ ۖوَقَالَ الْكٰفِرُوْنَ هٰذَا سٰحِرٌ كَذَّابٌۚ",
      "text_translation_en": "Now these [people] deem it strange that a warner should have come unto them from their own midst - and [so] the deniers of the truth are saying: “A [mere] spellbinder is he, a liar!",
      "juz_number": 23
    },
    "5": {
      "text_tafsir_en": "Because this verse is so wonderful as narrated by Ibn Jarir. ath-thabari of Ibn 'Abbas who stated that after the Abu rabbit became ill, a group of Quraysh entered, among them there was Abu Jahal. They said, \"Surely you have mocked our gods. They did it and said it. It would be good if you sent someone to forbid it.\" So the crucifixion sent to him. Then the Prophet came and entered his house, while the distance between the Quraysh and the Abu Talib was close enough for only one seat. Ibn 'Abbas said that Abu Jahal was worried that the Prophet would sit next to Abu crucifix. Then he became mean. He then jumped and sat in an uninhabited place next to Abu the cross. Thus the Prophet did not get a seat near his uncle. He was sitting near the door. Then the rabbi said to him, \"O my people, why are your people complaining to you? They accuse you of cursing their gods and you say so.\" Ibn 'Abbas went on to say that the Quraysh people had a great deal to say to the Abu Talib. Then Allah's Messenger (may peace be upon him) said: \"O my uncle! I want them to pronounce only one sentence, in which the Arabs submit to them, and the 'Ajam (other than the Arabs) pay them jizyah (head tax). . \" So they were pleased with the words and the words of the Messenger. Then the Quraysh asked, \"What is the sentence? For your father, of course we will repay you ten times.\" The Prophet said, \"La ilaha ilallah.\" Then they rose up, trembling, and lifting up their sleeves, and saying, \"Why is it that He is the God of gods? Surely this is a marvelous thing.\" Then come down to this verse. God explains the amazement of the Muslims to the call of the apostles. They wonder why Muhammad made God the only one, contrary to the beliefs of their ancestors. When the Prophet asked them to abandon their many prayers and replace them with the worship of the One True God, they considered that Muhammad's call was not a trivial matter, but rather a surprise. They rejected the call out of belief that it was impossible for their ancestors to believe wrongly, but Muhammad was a liar who claimed to be right.",
      "text_tafsir": "Sebab nuzul ayat ini sebagaimana diriwayatkan oleh Ibnu Jarir. ath-thabari dari Ibnu 'Abbas yang menyatakan bahwa setelah Abu thalib sakit, masuklah serombongan orang-orang Quraisy, di antara mereka terdapat Abu Jahal. Mereka berkata, \"Sesungguhnya kemenakanmu mencaci-maki tuhan-tuhan kami. Ia betul-betul berbuat dan mengatakannya. Alangkah baiknya kalau engkau mengutus seseorang untuk melarangnya.\" Maka Abu thalib pun mengutus utusan kepadanya. Lalu Nabi pun datang dan masuk ke rumahnya, sedangkan jarak antara orang-orang Quraisy dengan Abu thalib dekat sekali sekadar tempat duduk yang cukup untuk seorang. Ibnu 'Abbas mengatakan bahwa Abu Jahal khawatir kalau-kalau Nabi duduk di samping Abu thalib. Lalu ia menjadi bersikap lunak. Ia lalu melompat dan duduk di tempat yang belum diduduki di sisi Abu thalib. Dengan demikian Rasulullah tidak mendapatkan tempat duduk di dekat pamannya. Beliau duduk di dekat pintu. Lalu Abu thalib berkata kepada beliau, \"Hai kemenakanku, mengapa kaummu mengadukan engkau. Mereka menuduh engkau memaki tuhan-tuhan mereka dan engkau pun mengatakan begini-begitu.\" Ibnu 'Abbas melanjutkan bahwa orang-orang Quraisy banyak sekali berbicara dengan Abu thalib. \n\nKemudian Rasulullah berkata, \"Hai Pamanku. Sesungguhnya saya ingin agar mereka itu menyatakan kalimat yang satu saja, yang dengan kalimat itu orang-orang Arab tunduk kepada mereka, dan orang-orang 'Ajam (selain Arab) membayar jizyah (pajak kepala) kepada mereka.\" Maka mereka pun senang akan kalimat (yang diusulkan itu) dan senang pula akan perkataan Rasul. Lalu kaum Quraisy itu bertanya, \"Apakah kalimat itu? Demi Ayahmu, tentu kami memberi balasan kepadamu sepuluh kali lipat.\" Rasulullah pun bersabda, \"La ilaha ilallah.\" Maka mereka pun bangkit dengan gemetar, sambil menyingsingkan lengan bajunya dan berkata, \"Mengapa ia menjadikan tuhan-tuhan itu Tuhan Yang Satu saja, sesungguhnya ini benar-benar suatu hal yang mengherankan.\" Maka turunlah ayat ini.\n\nAllah menjelaskan keheranan kaum musyrik akan seruan rasul. Mereka heran mengapa Muhammad menjadikan Tuhan hanya satu saja, ini bertentangan dengan kepercayaan nenek moyang mereka. Ketika Rasulullah mengajak mereka agar meninggalkan sembahan-sembahan mereka yang banyak itu dan menggantinya dengan menyembah Allah Yang Maha Esa, maka mereka menganggap bahwa seruan Muhammad itu bukan masalah yang remeh, akan tetapi benar-benar suatu yang mengherankan. Mereka mengingkari seruan itu karena yakin bahwa tidak mungkin nenek moyang mereka menganut keyakinan yang salah, tetapi Muhammad adalah seorang pendusta yang mengaku dirinya benar.",
      "text_translation": "Apakah dia menjadikan tuhan-tuhan itu Tuhan yang satu saja? Sungguh, ini benar-benar sesuatu yang sangat mengherankan.",
      "text": "اَجَعَلَ الْاٰلِهَةَ اِلٰهًا وَّاحِدًا ۖاِنَّ هٰذَا لَشَيْءٌ عُجَابٌ",
      "text_translation_en": "Does he claim that all the deities are [but] one God? Verily, a most strange thing is this!”",
      "juz_number": 23
    },
    "6": {
      "text_tafsir_en": "In this verse, Allah explains that the Quraysh leaders left the house of Abu thibib after being silenced by the Prophet's answer, as explained in the above reasons. They know Muhammad is hard at defending religion. That is why they have no hope to soften Muhammad's heart with his uncle. They talk about what to do, and they brainstorm for solutions. Finally, they decided to persuade their followers to stick to their beliefs and to worship their gods. At the end of the verse, God reveals the words of the Quraysh leaders to his followers, saying that worshiping idols is exactly what Allah wants.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan bahwa pemimpin-pemimpin Quraisy itu pergi dari rumah Abu thalib setelah terbungkam oleh jawaban Rasul, sebagaimana dijelaskan dalam sebab nuzul di atas. Mereka mengetahui Muhammad berkeras hati membela agama. Itulah sebabnya mereka tidak mempunyai harapan lagi untuk melunakkan hati Muhammad dengan perantaraan pamannya. Mereka berunding apa yang seharusnya dilakukan, dan memeras otak untuk mendapatkan penyelesaian. Akhirnya mereka memutuskan untuk memperkokoh keyakinan pengikut-pengikutnya untuk tetap dengan keyakinan mereka dan tetap menyembah tuhan-tuhan mereka.\n\nDi akhir ayat, Allah mengungkapkan perkataan para pemimpin Quraisy itu kepada pengikut-pengikutnya, bahwa menyembah berhala-berhala itulah yang sebenarnya dikehendaki oleh Allah.",
      "text_translation": "Lalu pergilah pemimpin-pemimpin mereka (seraya berkata), “Pergilah kamu dan tetaplah  (menyembah) tuhan-tuhanmu, sesungguhnya ini benar-benar suatu hal yang dikehendaki.",
      "text": "وَانْطَلَقَ الْمَلَاُ مِنْهُمْ اَنِ امْشُوْا وَاصْبِرُوْا عَلٰٓى اٰلِهَتِكُمْ ۖاِنَّ هٰذَا لَشَيْءٌ يُّرَادُ ۖ",
      "text_translation_en": "And their leaders launch forth [thus]: “Go ahead, and hold steadfastly onto your deities: this, behold, is the only thing to do!",
      "juz_number": 23
    },
    "7": {
      "text_tafsir_en": "Allah explained the other reason given by the Quraysh leaders to his followers, that Muhammad's call was not correct. They say that they have never heard such a cry as Muhammad had uttered in the last revealed religion. The religion they are referring to is a Christian religion. Muhammad's call for man to suppress God was a lie that Muhammad saw was not a coming from Allah.",
      "text_tafsir": "Allah menjelaskan alasan lain yang dikemukakan oleh para pemimpin Quraisy kepada pengikut-pengikutnya, bahwa seruan Muhammad saw itu tidak benar. Mereka mengatakan bahwa mereka tidak pernah mendengar seruan seperti yang diserukan oleh Muhammad itu di dalam agama yang diturunkan terakhir. Agama yang mereka maksudkan adalah agama Nasrani. Seruan Muhammad agar manusia mengesakan Tuhan itu hanyalah dusta yang dibuat-buat oleh Muhammad saw dan bukan datang dari Allah.",
      "text_translation": "Kami tidak pernah mendengar hal ini dalam agama yang terakhir; ini (mengesakan Allah), tidak lain hanyalah (dusta) yang diada-adakan,",
      "text": "مَا سَمِعْنَا بِهٰذَا فِى الْمِلَّةِ الْاٰخِرَةِ ۖاِنْ هٰذَآ اِلَّا اخْتِلَاقٌۚ",
      "text_translation_en": "Never did we hear of [a claim like] this in any faith of latter days! It is nothing but [a mortal man’s] invention!",
      "juz_number": 23
    },
    "8": {
      "text_tafsir_en": "Then Allah explained the disbelievers of Mecca that Muhammad was given a revelation, even though he was a human being. According to them, those who deserve to be delegated are those who have the dignity and leadership that surpasses them. Muhammad did not have such special qualities, so it is not possible for the Qur'an to be revealed to him. Whereas there are still more noble men, and more worthy of leadership. Allah says: And they say, \"Why is not this Qur'an revealed to the great (rich and influential) of one of these two states (Mecca and Taif)?\" (az-Zukhruf \/ 43: 31) They rejected Muhammad's visions and prophecies because according to their way of thinking, the people who were sent to the apostles were rich and influential. They do not realize that God has the power to make choices according to His will, including lifting His servants to the Prophet. Allah said: And they said, \"Why did this Prophet (Muhammad) eat food and walk in the marketplaces? Why was it not sent to him to give him a warning, or to give him wealth or (why) there is no) garden for him, so that he can eat from it? \" And the wicked said, \"You are following a man who has a magic spell.\" (al-Furqan \/ 25: 7-8) In the end, this verse explains that their cause is far from the truth is because their hearts are covered with doubts that cannot be penetrated by the light of the truth of the Qur'an, and they have not yet felt the torment of Allah it hurts. If they were to pay attention to the signs of the truth of the revelation given to his apostles, they would have to admit his prophecy, for the revelation which had been received was sufficient for them. However, because of the malady and envy that has lurked in her chest, they would not accept that revelation. They finally fall into the valley of disobedience.",
      "text_tafsir": "Kemudian Allah menjelaskan pengingkaran orang-orang kafir Mekah bahwa Muhammad diberi wahyu, padahal dia manusia biasa. Menurut anggapan mereka, yang pantas diangkat menjadi utusan ialah orang yang mempunyai kemuliaan dan kepemimpinan yang melebihi mereka. Muhammad tidak mempunyai sifat-sifat istimewa yang seperti itu, sehingga tidak mungkin Al-Qur'an diturunkan kepadanya. Sedangkan di antara mereka masih ada orang-orang yang lebih mulia, dan lebih pantas memegang kepemimpinan.\n\nAllah berfirman:\n\nDan mereka (juga) berkata, \"Mengapa Al-Qur'an ini tidak diturunkan kepada orang besar (kaya dan berpengaruh) dari salah satu dua negeri ini (Mekah dan Taif)?\" (az-Zukhruf\/43: 31)\n\nMereka mengingkari wahyu dan kenabian Muhammad karena menurut jalan pikiran mereka, orang yang diutus menjadi rasul adalah orang yang kaya raya dan berpengaruh. Mereka tidak menyadari bahwa Allah berkuasa menentukan pilihan menurut kehendak-Nya di antaranya mengangkat hamba-Nya menjadi Nabi. \n\nAllah berfirman:\n\nDan mereka berkata, \"Mengapa Rasul (Muhammad) ini memakan makanan dan berjalan di pasar-pasar? Mengapa malaikat tidak diturunkan kepadanya (agar malaikat) itu memberikan peringatan bersama dia, atau (mengapa tidak) diturunkan kepadanya harta kekayaan atau (mengapa tidak ada) kebun baginya, sehingga dia dapat makan dari (hasil)nya?\" Dan orang-orang zalim itu berkata, \"Kamu hanyalah mengikuti seorang laki-laki yang kena sihir.\" (al-Furqan\/25: 7-8)\n\nDi bagian akhir, ayat ini menjelaskan bahwa penyebab mereka jauh dari kebenaran adalah karena hati mereka diselubungi keraguan yang tidak bisa ditembus oleh cahaya kebenaran Al-Qur'an, dan mereka belum merasakan siksa Allah yang pedih. Seandainya mereka mau memperhatikan tanda-tanda kebenaran wahyu yang diturunkan kepada rasul-Nya, niscaya mereka mengakui kenabiannya, karena wahyu yang diterima itu telah cukup menjadi tanda kenabiannya. Namun demikian, karena penyakit hasad dan dengki yang telah bersarang dalam dadanya, maka mereka tidak mau menerima wahyu itu. Akhirnya mereka terjerumus dalam lembah keingkaran.",
      "text_translation": "mengapa Al-Qur'an itu diturunkan kepada dia di antara kita?” Sebenarnya mereka ragu-ragu terhadap Al-Qur'an-Ku, tetapi mereka belum merasakan azab(-Ku).",
      "text": "اَؤُنْزِلَ عَلَيْهِ الذِّكْرُ مِنْۢ بَيْنِنَا ۗبَلْ هُمْ فِيْ شَكٍّ مِّنْ ذِكْرِيْۚ بَلْ لَّمَّا يَذُوْقُوْا عَذَابِ ۗ",
      "text_translation_en": "What! Upon him alone from among all of us should a [divine] reminder have been bestowed from on high?” Nay, but it is My Own reminder that they distrust! Nay, they have not yet tasted the suffering which I do impose!",
      "juz_number": 23
    },
    "9": {
      "text_tafsir_en": "In this verse, God condemns the Quraysh who reject Muhammad's prophecies because he is not one of them. God commanded His Messenger to ask if they had the power to determine and distribute the treasure of God's grace. At the end of the verse, God speaks of His almighty and almighty nature. Power that is beyond the reach of anyone and the nature of the Almighty that cannot be impeded by any other power. God says: And your Lord creates and chooses what He wills. For them (humans) there is no choice. (al-Qashash \/ 28: 68) And His saying: \"He knows best where He places His burden.\" (al-An'am \/ 6: 124)",
      "text_tafsir": "Pada ayat ini, Allah mengecam orang-orang Quraisy yang menolak kenabian Muhammad karena beliau bukan orang terpandang di kalangan mereka. Allah memerintahkan kepada Rasul-Nya agar menanyakan apakah mereka memiliki kekuasaan ikut menentukan dan membagi-bagi khazanah rahmat Allah.\n\nDi akhir ayat, Allah menyebutkan sifat-Nya Yang Mahaperkasa dan Maha Pemberi. Kemahaperkasaan yang tidak bisa ditandingi oleh siapa pun juga dan sifat Mahapemberi yang tidak bisa dihalang-halangi oleh kekuasaan yang lain.\n\nAllah berfirman:\n\nDan Tuhanmu menciptakan dan memilih apa yang Dia kehendaki. Bagi mereka (manusia) tidak ada pilihan. (al-Qashash\/28: 68)\n\nDan firman-Nya:\n\n¦Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan-Nya¦. (al-An'am\/6: 124)",
      "text_translation": "Atau apakah mereka itu mempunyai perbendaharaan rahmat Tuhanmu Yang Mahaperkasa, Maha Pemberi?]",
      "text": "اَمْ عِنْدَهُمْ خَزَاۤىِٕنُ رَحْمَةِ رَبِّكَ الْعَزِيْزِ الْوَهَّابِۚ",
      "text_translation_en": "Or do they [think that they] own the treasures of thy Sustainer’s grace - [the grace] of the Almighty, the Giver of Gifts?",
      "juz_number": 23
    },
    "10": {
      "text_tafsir_en": "Then Allah commanded His Messenger to inquire of the Quraysh for his defiant and arrogant attitude. These questions contain ridicule because they have little power over the heavens, the earth, and the contents of them. If they feel that they have little power in the universe, they should also not interfere in the rapture of the apostle, which includes supernatural affairs, whose power rests with the Almighty and the Almighty. At the end of the verse, God instructs His Messenger to challenge them to ascend the stairs to heaven, and to seek the power to prevent the revelation that was given to the elect of God. They will never be able to do it. Thus, it is clear that they reject the revelation only because of malice (envy).",
      "text_tafsir": "Kemudian Allah memerintahkan kepada Rasul-Nya agar menanyakan kepada orang-orang Quraisy atas sikapnya yang ingkar dan sombong. Pertanyaan ini mengandung cemoohan karena memang mereka tidak mempunyai kekuasaan sedikit pun terhadap langit, bumi, dan isi keduanya. Kalau mereka merasa tidak mempunyai kekuasaan sedikit pun di jagat raya, mestinya mereka juga tidak ikut campur tangan dalam pengangkatan rasul, yang termasuk urusan gaib, yang kekuasaannya berada pada yang Mahaperkasa dan Mahaagung.\n\nDi akhir ayat, Allah memerintah Rasul-Nya agar menantang mereka menaiki tangga-tangga ke langit, dan mencari daya upaya agar menghalang-halangi wahyu yang didatangkan kepada rasul pilihan Allah. Sesungguhnya mereka tidak akan mampu melakukannya. Dengan demikian, jelaslah pengingkaran mereka kepada wahyu hanya karena sikap hasad (dengki).",
      "text_translation": "Atau apakah mereka mempunyai kerajaan langit dan bumi dan apa yang ada di antara keduanya? (Jika ada), maka biarlah mereka menaiki tangga-tangga (ke langit).",
      "text": "اَمْ لَهُمْ مُّلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا ۗفَلْيَرْتَقُوْا فِى الْاَسْبَابِ",
      "text_translation_en": "Or [that] the dominion over the heavens and the earth and all that is between them is theirs? Why, then, let them try to ascend [to God-like power] by all [conceivable] means!",
      "juz_number": 23
    },
    "11": {
      "text_tafsir_en": "In this verse, God explains that the state of the Meccan Muslims rejected Muhammad's apostasy and renounced the monotheism of the great army, which was a union of the armies. The allied army moving to destroy the Muslims must have been defeated, since the foundation of their struggle was not based on a firm belief, but only in malice and arrogance. The events described in this verse did not occur at the time of the passage, because at that time the Muslims did not have an army, the number of their followers was still small, and there were no signs to establish a force that could defeat the combined army as depicted in the verse. However, this incident only occurred in the wake of the Battle of Badr, where the number of Muslims more than the Muslims could be defeated by God's help. The Word of God: Or they say, \"We are a united people who will surely win.\" The people will surely be defeated and they will retreat. Even the Day of Resurrection is the day that is promised to them and the Day of Resurrection is more terrible and bitter. (al-Qamar \/ 54: 44-46) The explanation given by Allah to His Messenger in this verse includes one of the miracles of the Prophet and at once as a sign of the truth of the revelation he received that the revelation was actually from God and not made by Muhammad .",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan bahwa keadaan orang-orang musyrik Mekah yang mendustakan kerasulan Muhammad dan mengingkari agama tauhid laksana bala tentara yang besar, yang merupakan gabungan dari kesatuan-kesatuan tentara. Bala tentara yang bersekutu bergerak untuk menghancurkan kaum Muslimin itu pasti dapat dikalahkan, karena landasan perjuangan mereka tidak didasarkan pada keyakinan yang kokoh, akan tetapi hanyalah karena hasad dan sombong.\n\nPeristiwa seperti digambarkan dalam ayat ini bukanlah terjadi pada saat diturunkannya ayat, karena pada saat itu kaum Muslimin belum mempunyai tentara, jumlah pengikutnya pun masih sedikit, dan belum ada tanda-tanda untuk menyusun kekuatan yang dapat mengalahkan bala tentara gabungan seperti digambarkan dalam ayat. Akan tetapi, peristiwa itu baru terjadi pada saat terjadinya perang Badar, dimana kaum musyrikin yang jumlahnya berlipat ganda melebihi kaum Muslimin dapat dikalahkan atas bantuan Allah. Firman Allah:\n\nAtau mereka mengatakan, \"Kami ini golongan yang bersatu yang pasti menang.\" Golongan itu pasti akan dikalahkan dan mereka akan mundur ke belakang. Bahkan hari Kiamat itulah hari yang dijanjikan kepada mereka dan hari Kiamat itu lebih dahsyat dan lebih pahit. (al-Qamar\/54: 44-46)\n\nPenjelasan yang diberikan Allah kepada Rasul-Nya yang terdapat dalam ayat ini termasuk salah satu di antara mukjizat Nabi dan sekaligus sebagai tanda kebenaran wahyu yang diterimanya bahwa wahyu itu benar-benar dari Allah bukan buatan Muhammad.",
      "text_translation": "(Mereka itu) kelompok besar bala tentara yang berada di sana yang akan dikalahkan.",
      "text": "جُنْدٌ مَّا هُنَالِكَ مَهْزُوْمٌ مِّنَ الْاَحْزَابِ",
      "text_translation_en": "[But] there it is: any and all human beings, however [strongly] leagued together, are bound to suffer defeat [whenever they refuse to accept the truth].",
      "juz_number": 23
    },
    "12": {
      "text_tafsir_en": "In these two verses, God describes six people who rejected the apostles of God, and the consequences they suffered, with the purpose of being a lesson for the Meccans, that they might escape error, and receive guidance. They are: First, the people who accuse Noah of giving advice and warnings are made. Therefore, they make fun of it, even saying that Noah is crazy. Although Noah repeatedly urged them to be religious but their challenges did not diminish, he added, and eventually Noah prayed to God. The Word of God: And Noah said, \"My Lord, do not let any of the heathen dwell on the earth. If You will let them dwell, they will surely mislead Your servants, and they will only bear children.\" They were wicked and ungrateful. (Noah \/ 71: 26-27) The people of Noah rejected their cries, even drowning in error, and God destroyed them by means of storms, hurricanes, and floods in return for their crimes. but Noah and his followers were saved by Allah from the torment. Allah said: Then We opened the gates of the heavens with (the) pouring down of the water, and We made the earth pour forth springs; We have brought him (Noah) on board (ships) made of boards and pegs, which sailed with Our protection in return. that has been denied (his people). (al-Qamar \/ 54: 11-14) Secondly, the 'Ad people rejected the call of Hud asking them to worship the One True God and abandon the worship they had associated with God. However, the Ad people opposed the call, even mocking Hud and saying it was crazy. That is why they are destroyed by very cold and strong winds. Allah says: While the people of Ad, they were destroyed by a very cold tempest, Allah caused them to blow for them seven nights and eight days continually; then you see the people of Ad at that time dying around like sticks of palm trees that had been empty. Then did you see anyone still left among them? (al-haqqah \/ 69: 6-8) Third, Pharaoh had a large army. In addition, it has a special place of torture to torture its enemies and tall and sturdy buildings. God sent Moses to Pharaoh and his followers to stop his error and to worship the One True God. The truth of Moses' call to action was further strengthened by a miracle. But Pharaoh and his followers continued to resist Moses' call, even being arrogant and insulting him by declaring that he was a high God. So God commanded Moses to flee his people to escape Pharaoh's cruelty. Thus Moses and the Israelites were saved from the pursuit of Pharaoh as he and his army sank under the waves of the sea. God said: And We delivered the Children of Israel through the sea, and Pharaoh and his army followed them, to oppress and oppress (them). So when Pharaoh was about to drown he said, \"I believe that there is no god but the God of the Children of Israel, and I am a Muslim (surrender).\" Why is it now (you believe) when you have been unfaithful in the past, and you are the one who has done harm? So today we have saved your body so that you may be a lesson to those who come after you, but most of us do not heed our signs. (Jonah \/ 10: 90-92) The other meaning of the autad is the pens that Pharaoh used to torture. Some say that Pharaoh had a magnificent and sturdy palace. Fourth, the Samaritans rejected the call of Saleh who was sent for them. They have made mistakes that go beyond the limits. They slaughtered the camels that were supposed to be kept. In response to their rebellion, God raised a loud scream, and they withered like grass. Allah says: The people of the world have rejected that warning. So they said, \"How can we follow a (common) man among us? Surely we have indeed gone astray and gone astray. Is that revelation revealed to him among us? and) arrogant. \" They'll soon find out who the real liar is (and) is. We will send the camels as a test for them, so wait for them and be patient. And tell them that the water is divided between them (with the camel); Everyone has the right to drink. So they called his friend, and he caught (the camel) and cut him off. Then how terrible is my punishment and my warning! We send upon them a loud voice, and they become like stubble that is dry. (al-Qamar \/ 54: 23-31) Fifth, the Prophet Lot also rejected his people. Over and over he warned his people to be afraid of God and to abstain from lewd acts, homosexuals, and yet they ignored him. God then ordered Lot and his family to leave Sodom because they would be punished with devastating torment. Allah says: The people of Lot have rejected that warning. Verily We send upon them a storm that carries stones (excepting them), except the family of Lot. We saved them before dawn. (al-Qamar \/ 54: 33-34) Sixth, A.shhabul Aikah, who belonged to the Prophet, also denied his prophet. The Prophet asked them to worship the One True God, forbid His alliance, and not reduce the scales. However, his people did not just reject the call, they allied themselves against it. That is why they are destroyed by lightning that seizes them in dark darkness. Allah said: \"Fall down to us from the sky if you are among the righteous.\" He said, \"My Lord knows best what you do.\" It is indeed a torment on a terrible day (asy-Syu'ara '\/ 26: 187-189)",
      "text_tafsir": "Pada kedua ayat ini, Allah menjelaskan enam kaum yang mendustakan rasul-rasul Allah, serta akibat yang mereka derita, dengan maksud agar menjadi pelajaran bagi kaum musyrik Mekah, sehingga mereka terlepas dari kesesatan, dan mau menerima tuntunan hidayah. Mereka itu adalah:\n\nPertama, kaum Nuh yang menuduh Nabi Nuh telah memberikan nasihat dan peringatan yang dibuat-buat. Oleh karena itu, mereka memperolok-olok, bahkan mengatakan bahwa Nabi Nuh gila. Meskipun Nabi Nuh telah berulang kali menyeru kepada mereka dengan lemah-lembut agar mereka beragama tauhid tetapi tantangan mereka tidak berkurang juga, bahkan bertambah-tambah, akhirnya Nabi Nuh berdoa kepada Allah.\n\nFirman Allah:\n\nDan Nuh berkata, \"Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi. Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka hanya akan melahirkan anak-anak yang jahat dan tidak tahu bersyukur. (Nuh\/71: 26-27)\n\nKaum Nuh tetap mendustakan seruannya, bahkan tenggelam dalam kesesatan. Allah membinasakan mereka dengan perantaraan badai, topan, dan banjir sebagai balasan dari kejahatan yang mereka lakukan. Akan tetapi, Nuh dan pengikut-pengikutnya diselamatkan Allah dari siksaan itu.\n\nAllah berfirman:\n\nLalu Kami bukakan pintu-pintu langit dengan (menurunkan) air yang tercurah, dan Kami jadikan bumi menyemburkan mata-mata air maka bertemulah (air-air) itu sehingga (meluap menimbulkan) keadaan (bencana) yang telah ditetapkan. Dan Kami angkut dia (Nuh) ke atas (kapal) yang terbuat dari papan dan pasak, yang berlayar dengan pemeliharaan (pengawasan) Kami sebagai balasan bagi orang yang telah diingkari (kaumnya). (al-Qamar\/54: 11-14)\n\nKedua, kaum 'Ad yang mendustakan seruan Hud yang mengajak mereka menyembah Allah Yang Maha Esa dan meninggalkan sembahan-sembahan yang mereka persekutukan dengan Allah. Akan tetapi, kaum 'Ad menentang seruan itu, bahkan mereka memperolok-olokkan Hud dan mengatakannya gila. Itulah sebabnya mereka dibinasakan dengan angin yang sangat dingin lagi kencang.\n\nAllah berfirman:\n\nSedangkan kaum 'Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin, Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum 'Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk). Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka? (al-haqqah\/69: 6-8)\n\nKetiga, Fir'aun yang mempunyai tentara yang besar. Di samping itu, ia mempunyai tempat penyiksaan khusus guna menyiksa musuh-musuhnya dan bangunan yang tinggi dan kokoh. Allah telah mengutus Musa kepada Fir'aun dan para pengikutnya agar menghentikan kesesatannya dan menyembah Allah Yang Maha Esa. Kebenaran seruan Musa itu dikuatkan pula dengan mukjizat. Akan tetapi Fir'aun dan para pengikutnya tetap berkeras hati menolak seruan Musa, bahkan bersikap sombong dan menghinanya dengan menyatakan bahwa dialah tuhan yang maha tinggi. Maka Allah memerintahkan Musa untuk mengungsikan kaumnya agar selamat dari kekejaman Fir'aun. Dengan begitu, selamatlah Musa dan kaum Bani Israil dari pengejaran Fir'aun sedang dia dengan bala tentaranya tenggelam ditelan gelombang laut.\n\nAllah berfirman:\n\nDan Kami selamatkan Bani Israil melintasi laut, kemudian Fir'aun dan bala tentaranya mengikuti mereka, untuk menzalimi dan menindas (mereka). Sehingga ketika Fir'aun hampir tenggelam dia berkata, \"Aku percaya bahwa tidak ada tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan aku termasuk orang-orang Muslim (berserah diri).\" Mengapa baru sekarang (kamu beriman), padahal sesungguhnya engkau telah durhaka sejak dahulu, dan engkau termasuk orang yang berbuat kerusakan. Maka pada hari ini Kami selamatkan jasadmu agar engkau dapat menjadi pelajaran bagi orang-orang yang datang setelahmu, tetapi kebanyakan manusia tidak mengindahkan tanda-tanda (kekuasaan) Kami. (Yunus\/10: 90-92)\n\nMakna autad yang lain adalah pasung-pasung yang digunakan Fir'aun untuk menyiksa. Ada juga yang mengatakan bahwa Fir'aun mempunyai istana yang megah dan kokoh.\n\nKeempat, kaum Samud yang mendustakan seruan Nabi Saleh yang diutus untuk mereka. Mereka telah berbuat kesalahan yang melampaui batas. Mereka telah menyembelih unta yang seharus dipelihara. Sebagai balasan atas kedurhakaan mereka, Allah telah menimpakan suara keras yang mengguntur, hingga mereka musnah seperti rumput-rumput kering.\n\nAllah berfirman:\n\nKaum samud pun telah mendustakan peringatan itu. Maka mereka berkata, \"Bagaimana kita akan mengikuti seorang manusia (biasa) di antara kita? Sungguh, kalau begitu kita benar-benar telah sesat dan gila. Apakah wahyu itu diturunkan kepadanya di antara kita? Pastilah dia (Saleh) seorang yang sangat pendusta (dan) sombong.\" Kelak mereka akan mengetahui siapa yang sebenarnya sangat pendusta (dan) sombong itu. Sesungguhnya Kami akan mengirimkan unta betina sebagai cobaan bagi mereka, maka tunggulah mereka dan bersabarlah (Saleh). Dan beritahukanlah kepada mereka bahwa air itu dibagi di antara mereka (dengan unta betina itu); setiap orang berhak mendapat giliran minum. Maka mereka memanggil kawannya, lalu dia menangkap (unta itu) dan memotongnya. Maka betapa dahsyatnya azab-Ku dan peringatan-Ku! Kami kirimkan atas mereka satu suara yang keras mengguntur, maka jadilah mereka seperti batang-batang kering yang lapuk. (al-Qamar\/54: 23-31)\n\nKelima, Nabi Lut juga didustakan kaumnya. Berulang kali dia memperingatkan kaumnya agar bertakwa kepada Allah dan meninggalkan perbuatan keji, melakukan homoseksual, namun mereka tetap tidak menghiraukannya. Allah lalu memerintahkan Lut dan keluarganya meninggalkan Sodom karena mereka akan diazab dengan siksa yang membinasakan.\n\nAllah berfirman:\n\nKaum Lut pun telah mendustakan peringatan itu. Sesungguhnya Kami kirimkan kepada mereka badai yang membawa batu-batu (yang menimpa mereka), kecuali keluarga Lut. Kami selamatkan mereka sebelum fajar menyingsing. (al-Qamar\/54: 33-34)\n\nKeenam, A.shhabul Aikah, yang merupakan kaum Nabi Syuaib, juga mendustakan nabinya. Nabi Syuaib mengajak mereka agar menyembah Allah Yang Maha Esa, melarang mempersekutukan-Nya, dan tidak mengurangi timbangan. Akan tetapi, kaumnya bukan saja menolak seruan itu, bahkan mereka bersekutu menentangnya. Itulah sebabnya mereka dibinasakan dengan kilat yang menyambar mereka dalam keadaan gelap gulita.\n\nAllah berfirman:\n\nMaka jatuhkanlah kepada kami gumpalan dari langit, jika engkau termasuk orang-orang yang benar.\" Dia (Syuaib) berkata, \"Tuhanku lebih mengetahui apa yang kamu kerjakan.\" Kemudian mereka mendustakannya (Syuaib), lalu mereka ditimpa azab pada hari yang gelap. Sungguh, itulah azab pada hari yang dahsyat. (asy-Syu'ara'\/26: 187-189)",
      "text_translation": "Sebelum mereka itu, kaum Nuh, ‘Ad dan Fir’aun yang mempunyai bala tentara yang banyak, juga telah mendustakan (rasul-rasul),",
      "text": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّعَادٌ وَّفِرْعَوْنُ ذُو الْاَوْتَادِۙ",
      "text_translation_en": "To the truth gave the lie aforetime Noah’s people, and [the tribe of] Ad, and Pharaoh of the [many] tent-poles,",
      "juz_number": 23
    },
    "13": {
      "text_tafsir_en": "In these two verses, God describes six people who rejected the apostles of God, and the consequences they suffered, with the purpose of being a lesson for the Meccans, that they might escape error, and receive guidance. They are: First, the people who accuse Noah of giving advice and warnings are made. Therefore, they make fun of it, even saying that Noah is crazy. Although Noah repeatedly urged them to be religious but their challenges did not diminish, he added, and eventually Noah prayed to God. The Word of God: And Noah said, \"My Lord, do not let any of the heathen dwell on the earth. If You will let them dwell, they will surely mislead Your servants, and they will only bear children.\" They were wicked and ungrateful. (Noah \/ 71: 26-27) The people of Noah rejected their cries, even drowning in error, and God destroyed them by means of storms, hurricanes, and floods in return for their crimes. but Noah and his followers were saved by Allah from the torment. Allah said: Then We opened the gates of the heavens with (the) pouring down of the water, and We made the earth pour forth springs; We have brought him (Noah) on board (ships) made of boards and pegs, which sailed with Our protection in return. that has been denied (his people). (al-Qamar \/ 54: 11-14) Secondly, the 'Ad people rejected the call of Hud asking them to worship the One True God and abandon the worship they had associated with God. However, the Ad people opposed the call, even mocking Hud and saying it was crazy. That is why they are destroyed by very cold and strong winds. Allah says: While the people of Ad, they were destroyed by a very cold tempest, Allah caused them to blow for them seven nights and eight days continually; then you see the people of Ad at that time dying around like sticks of palm trees that had been empty. Then did you see anyone still left among them? (al-haqqah \/ 69: 6-8) Third, Pharaoh had a large army. In addition, it has a special place of torture to torture its enemies and tall and sturdy buildings. God sent Moses to Pharaoh and his followers to stop his error and to worship the One True God. The truth of Moses' call to action was further strengthened by a miracle. But Pharaoh and his followers continued to resist Moses' call, even being arrogant and insulting him by declaring that he was a high God. So God commanded Moses to flee his people to escape Pharaoh's cruelty. Thus Moses and the Israelites were saved from the pursuit of Pharaoh as he and his army sank under the waves of the sea. God said: And We delivered the Children of Israel through the sea, and Pharaoh and his army followed them, to oppress and oppress (them). So when Pharaoh was about to drown he said, \"I believe that there is no god but the God of the Children of Israel, and I am a Muslim (surrender).\" Why is it now (you believe) when you have been unfaithful in the past, and you are the one who has done harm? So today we have saved your body so that you may be a lesson to those who come after you, but most of us do not heed our signs. (Jonah \/ 10: 90-92) The other meaning of the autad is the pens that Pharaoh used to torture. Some say that Pharaoh had a magnificent and sturdy palace. Fourth, the Samaritans rejected the call of Saleh who was sent for them. They have made mistakes that go beyond the limits. They slaughtered the camels that were supposed to be kept. In response to their rebellion, God raised a loud scream, and they withered like grass. Allah says: The people of the world have rejected that warning. So they said, \"How can we follow a (common) man among us? Surely we have indeed gone astray and gone astray. Is that revelation revealed to him among us? and) arrogant. \" They'll soon find out who the real liar is (and) is. We will send the camels as a test for them, so wait for them and be patient. And tell them that the water is divided between them (with the camel); Everyone has the right to drink. So they called his friend, and he caught (the camel) and cut him off. Then how terrible is my punishment and my warning! We send upon them a loud voice, and they become like stubble that is dry. (al-Qamar \/ 54: 23-31) Fifth, the Prophet Lot also rejected his people. Over and over he warned his people to be afraid of God and to abstain from lewd acts, homosexuals, and yet they ignored him. God then ordered Lot and his family to leave Sodom because they would be punished with devastating torment. Allah says: The people of Lot have rejected that warning. Verily We send upon them a storm that carries stones (excepting them), except the family of Lot. We saved them before dawn. (al-Qamar \/ 54: 33-34) Sixth, A.shhabul Aikah, who belonged to the Prophet, also denied his prophet. The Prophet asked them to worship the One True God, forbid His alliance, and not reduce the scales. However, his people did not just reject the call, they allied themselves against it. That is why they are destroyed by lightning that seizes them in dark darkness. Allah said: \"Fall down to us from the sky if you are among the righteous.\" He said, \"My Lord knows best what you do.\" It is indeed a torment on a terrible day (asy-Syu'ara '\/ 26: 187-189)",
      "text_tafsir": "Pada kedua ayat ini, Allah menjelaskan enam kaum yang mendustakan rasul-rasul Allah, serta akibat yang mereka derita, dengan maksud agar menjadi pelajaran bagi kaum musyrik Mekah, sehingga mereka terlepas dari kesesatan, dan mau menerima tuntunan hidayah. Mereka itu adalah:\n\nPertama, kaum Nuh yang menuduh Nabi Nuh telah memberikan nasihat dan peringatan yang dibuat-buat. Oleh karena itu, mereka memperolok-olok, bahkan mengatakan bahwa Nabi Nuh gila. Meskipun Nabi Nuh telah berulang kali menyeru kepada mereka dengan lemah-lembut agar mereka beragama tauhid tetapi tantangan mereka tidak berkurang juga, bahkan bertambah-tambah, akhirnya Nabi Nuh berdoa kepada Allah.\n\nFirman Allah:\n\nDan Nuh berkata, \"Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi. Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka hanya akan melahirkan anak-anak yang jahat dan tidak tahu bersyukur. (Nuh\/71: 26-27)\n\nKaum Nuh tetap mendustakan seruannya, bahkan tenggelam dalam kesesatan. Allah membinasakan mereka dengan perantaraan badai, topan, dan banjir sebagai balasan dari kejahatan yang mereka lakukan. Akan tetapi, Nuh dan pengikut-pengikutnya diselamatkan Allah dari siksaan itu.\n\nAllah berfirman:\n\nLalu Kami bukakan pintu-pintu langit dengan (menurunkan) air yang tercurah, dan Kami jadikan bumi menyemburkan mata-mata air maka bertemulah (air-air) itu sehingga (meluap menimbulkan) keadaan (bencana) yang telah ditetapkan. Dan Kami angkut dia (Nuh) ke atas (kapal) yang terbuat dari papan dan pasak, yang berlayar dengan pemeliharaan (pengawasan) Kami sebagai balasan bagi orang yang telah diingkari (kaumnya). (al-Qamar\/54: 11-14)\n\nKedua, kaum 'Ad yang mendustakan seruan Hud yang mengajak mereka menyembah Allah Yang Maha Esa dan meninggalkan sembahan-sembahan yang mereka persekutukan dengan Allah. Akan tetapi, kaum 'Ad menentang seruan itu, bahkan mereka memperolok-olokkan Hud dan mengatakannya gila. Itulah sebabnya mereka dibinasakan dengan angin yang sangat dingin lagi kencang.\n\nAllah berfirman:\n\nSedangkan kaum 'Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin, Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum 'Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk). Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka? (al-haqqah\/69: 6-8)\n\nKetiga, Fir'aun yang mempunyai tentara yang besar. Di samping itu, ia mempunyai tempat penyiksaan khusus guna menyiksa musuh-musuhnya dan bangunan yang tinggi dan kokoh. Allah telah mengutus Musa kepada Fir'aun dan para pengikutnya agar menghentikan kesesatannya dan menyembah Allah Yang Maha Esa. Kebenaran seruan Musa itu dikuatkan pula dengan mukjizat. Akan tetapi Fir'aun dan para pengikutnya tetap berkeras hati menolak seruan Musa, bahkan bersikap sombong dan menghinanya dengan menyatakan bahwa dialah tuhan yang maha tinggi. Maka Allah memerintahkan Musa untuk mengungsikan kaumnya agar selamat dari kekejaman Fir'aun. Dengan begitu, selamatlah Musa dan kaum Bani Israil dari pengejaran Fir'aun sedang dia dengan bala tentaranya tenggelam ditelan gelombang laut.\n\nAllah berfirman:\n\nDan Kami selamatkan Bani Israil melintasi laut, kemudian Fir'aun dan bala tentaranya mengikuti mereka, untuk menzalimi dan menindas (mereka). Sehingga ketika Fir'aun hampir tenggelam dia berkata, \"Aku percaya bahwa tidak ada tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan aku termasuk orang-orang Muslim (berserah diri).\" Mengapa baru sekarang (kamu beriman), padahal sesungguhnya engkau telah durhaka sejak dahulu, dan engkau termasuk orang yang berbuat kerusakan. Maka pada hari ini Kami selamatkan jasadmu agar engkau dapat menjadi pelajaran bagi orang-orang yang datang setelahmu, tetapi kebanyakan manusia tidak mengindahkan tanda-tanda (kekuasaan) Kami. (Yunus\/10: 90-92)\n\nMakna autad yang lain adalah pasung-pasung yang digunakan Fir'aun untuk menyiksa. Ada juga yang mengatakan bahwa Fir'aun mempunyai istana yang megah dan kokoh.\n\nKeempat, kaum Samud yang mendustakan seruan Nabi Saleh yang diutus untuk mereka. Mereka telah berbuat kesalahan yang melampaui batas. Mereka telah menyembelih unta yang seharus dipelihara. Sebagai balasan atas kedurhakaan mereka, Allah telah menimpakan suara keras yang mengguntur, hingga mereka musnah seperti rumput-rumput kering.\n\nAllah berfirman:\n\nKaum samud pun telah mendustakan peringatan itu. Maka mereka berkata, \"Bagaimana kita akan mengikuti seorang manusia (biasa) di antara kita? Sungguh, kalau begitu kita benar-benar telah sesat dan gila. Apakah wahyu itu diturunkan kepadanya di antara kita? Pastilah dia (Saleh) seorang yang sangat pendusta (dan) sombong.\" Kelak mereka akan mengetahui siapa yang sebenarnya sangat pendusta (dan) sombong itu. Sesungguhnya Kami akan mengirimkan unta betina sebagai cobaan bagi mereka, maka tunggulah mereka dan bersabarlah (Saleh). Dan beritahukanlah kepada mereka bahwa air itu dibagi di antara mereka (dengan unta betina itu); setiap orang berhak mendapat giliran minum. Maka mereka memanggil kawannya, lalu dia menangkap (unta itu) dan memotongnya. Maka betapa dahsyatnya azab-Ku dan peringatan-Ku! Kami kirimkan atas mereka satu suara yang keras mengguntur, maka jadilah mereka seperti batang-batang kering yang lapuk. (al-Qamar\/54: 23-31)\n\nKelima, Nabi Lut juga didustakan kaumnya. Berulang kali dia memperingatkan kaumnya agar bertakwa kepada Allah dan meninggalkan perbuatan keji, melakukan homoseksual, namun mereka tetap tidak menghiraukannya. Allah lalu memerintahkan Lut dan keluarganya meninggalkan Sodom karena mereka akan diazab dengan siksa yang membinasakan.\n\nAllah berfirman:\n\nKaum Lut pun telah mendustakan peringatan itu. Sesungguhnya Kami kirimkan kepada mereka badai yang membawa batu-batu (yang menimpa mereka), kecuali keluarga Lut. Kami selamatkan mereka sebelum fajar menyingsing. (al-Qamar\/54: 33-34)\n\nKeenam, A.shhabul Aikah, yang merupakan kaum Nabi Syuaib, juga mendustakan nabinya. Nabi Syuaib mengajak mereka agar menyembah Allah Yang Maha Esa, melarang mempersekutukan-Nya, dan tidak mengurangi timbangan. Akan tetapi, kaumnya bukan saja menolak seruan itu, bahkan mereka bersekutu menentangnya. Itulah sebabnya mereka dibinasakan dengan kilat yang menyambar mereka dalam keadaan gelap gulita.\n\nAllah berfirman:\n\nMaka jatuhkanlah kepada kami gumpalan dari langit, jika engkau termasuk orang-orang yang benar.\" Dia (Syuaib) berkata, \"Tuhanku lebih mengetahui apa yang kamu kerjakan.\" Kemudian mereka mendustakannya (Syuaib), lalu mereka ditimpa azab pada hari yang gelap. Sungguh, itulah azab pada hari yang dahsyat. (asy-Syu'ara'\/26: 187-189)",
      "text_translation": "dan (begitu juga) Samud, kaum Lut dan penduduk Aikah. Mereka itulah golongan-golongan yang bersekutu (menentang rasul-rasul).",
      "text": "وَثَمُوْدُ وَقَوْمُ لُوْطٍ وَّاَصْحٰبُ لْـَٔيْكَةِ ۗ اُولٰۤىِٕكَ الْاَحْزَابُ",
      "text_translation_en": "and [the tribe of] Thamud, and the people of Lot, and the dwellers of the wooded dales [of Madyan]: they all were leagued together, [as it were, in their unbelief:]",
      "juz_number": 23
    },
    "14": {
      "text_tafsir_en": "God explains why they suffered torment and ruin, that is because the earlier people rejected the call of the apostles of Allah, so it is possible that they suffered torment and ruin. The stories of the people of the past were presented to the Meccan monks, as a warning to them to repent and to change the attitude of rejecting the Messenger's call and instead becoming a obedient and accepting people. The story is also an amusement and encouragement to the believers to endure the torment and humiliation of God's enemies, the enemy being exemplary to them that the struggle to defend religion is aided by Allah and will surely end in victory.",
      "text_tafsir": "Allah menjelaskan penyebab mereka mendapat siksa dan mengalami kehancuran, yaitu karena umat-umat terdahulu itu mendustakan seruan para rasul Allah, maka sepantasnyalah mereka mendapat siksa dan mengalami kehancuran. Kisah-kisah umat yang lalu itu dikemukakan kepada kaum musyrik Mekah, sebagai peringatan agar mereka insaf dan mau mengubah sikap yang mendustakan seruan Rasul dan sebaliknya menjadi umat yang taat dan menerima seruannya. Kisah itu juga menjadi hiburan dan dorongan kepada kaum Mukminin agar tabah menghadapi siksaan dan penghinaan musuh-musuh Allah, musuh itu menjadi teladan bagi mereka bahwa perjuangan membela agama tauhid tentu mendapat pertolongan dari Allah dan pasti berakhir dengan kemenangan.",
      "text_translation": "Semua mereka itu mendustakan rasul-rasul, maka pantas mereka merasakan azab-Ku.",
      "text": "اِنْ كُلٌّ اِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ ࣖ",
      "text_translation_en": "not one [was there] but gave the lie to the apostles - and thereupon My retribution fell due.",
      "juz_number": 23
    },
    "15": {
      "text_tafsir_en": "In this verse, God threatens the Meccans who do not want to turn their backs on the Prophet, with the threat of a loud and loud shout, as a sign of the coming Judgment Day. At that time, they did not have the opportunity to avoid the sudden and unanticipated destruction.",
      "text_tafsir": "Pada ayat ini, Allah mengancam kaum musyrik Mekah yang tidak mau mengubah keingkarannya kepada Rasul, dengan ancaman berupa teriakan yang amat keras dan cepat, sebagai tanda datangnya hari Kiamat yang membinasakan. Pada saat itu, mereka tidak mempunyai kesempatan untuk mengelakkan diri dari kebinasaan yang datang secara tiba-tiba dan tidak berselang sesaat pun.",
      "text_translation": "Dan sebenarnya yang mereka tunggu adalah satu teriakan saja, yang tidak ada selanya.",
      "text": "وَمَا يَنْظُرُ هٰٓؤُلَاۤءِ اِلَّا صَيْحَةً وَّاحِدَةً مَّا لَهَا مِنْ فَوَاقٍ",
      "text_translation_en": "And they [who now deny the truth - they, too,] have but to wait for one single blast [of punishment to overtake them]: it shall not be delayed a whit.",
      "juz_number": 23
    },
    "16": {
      "text_tafsir_en": "In this verse, God reveals the disbelief of the Meccans against the doom that threatened them. They mocked the Prophet after hearing that the torment that threatened them was the Day of Judgment. They asked Allah that their doom should be hastened and that they should not wait until the day of reckoning. Allah said: And (when) they said, \"O Allah, if this is from You, then rain down on us with a stone from the sky, or come to us.\" a painful torment. \" (al-Anfal \/ 8: 32) According to the story of Imam an-Nasa'i of Ibn 'Abbas, the one who sought Allah's haste to come was the Nadir bin al-harits bin' Alaqah bin Kaladah. An-Nadhir was killed in the Battle of Badr. What counts as a day of reckoning is the day on which each person's deeds are examined, with careful examination to obtain a reply according to their deeds. The day of reckoning was preceded by a loud shout that destroyed all of life on the Day of Resurrection.",
      "text_tafsir": "Pada ayat ini, Allah mengungkapkan keingkaran orang-orang kafir Mekah terhadap azab yang diancamkan kepada mereka. Mereka memperolok-olokkan Rasulullah setelah mendengar bahwa azab yang diancamkan kepada mereka itu ialah azab di hari Kiamat. Mereka meminta kepada Allah agar azab yang diancamkan kepada mereka itu dipercepat datangnya dan tidak perlu ditunggu hingga hari perhitungan tiba. \n\nAllah berfirman:\n\nDan (ingatlah), ketika mereka (orang-orang musyrik) berkata, \"Ya Allah, jika (Al-Qur'an) ini benar (wahyu) dari Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih.\" (al-Anfal\/8: 32)\n\nMenurut riwayat Imam an-Nasa'i dari Ibnu 'Abbas, bahwa orang yang meminta agar siksa Allah disegerakan datangnya itu ialah an-Nadhir bin al-harits bin 'Alaqah bin Kaladah. An-Nadhir mati terbunuh dalam perang Badar.\n\nYang dimaksud dengan hari perhitungan ialah hari diperiksanya setiap amal seseorang, dengan pemeriksaan yang teliti agar mendapat balasan yang sesuai dengan amalnya. Terjadinya hari perhitungan itu didahului oleh teriakan keras yang membinasakan seluruh kehidupan pada hari Kiamat.",
      "text_translation": "Dan mereka berkata, “Ya Tuhan kami, segerakanlah azab yang diperuntukkan bagi kami sebelum hari perhitungan.”",
      "text": "وَقَالُوْا رَبَّنَا عَجِّلْ لَّنَا قِطَّنَا قَبْلَ يَوْمِ الْحِسَابِ",
      "text_translation_en": "As it is, they say [mockingly]: “O our Sus­tainer! Hasten on to us our share [of punishment even] before the Day of Reckoning!”",
      "juz_number": 23
    },
    "17": {
      "text_tafsir_en": "Allah commanded the Messenger and his followers to remain patient in what the Muslims said, even though the word was insulting and lying. It not only affected the Prophet and his followers, but also the prophets who were sent before. For believers, disobedience and persecution coming from the enemies of God does not diminish the spirit of their struggle to uphold the religion of monotheism, but rather as an impetus for maintaining the truth of monotheism and still striving to destroy Christianity. Allah commanded the Prophet to remind his people of the story of the mighty prophet David. The power of this verse means strength in obeying God and strength in understanding religion. Obedience to God and his knowledge of religion are reflected in his actions that are always striving to fulfill the mandate, spreading the call to embrace monotheism, without even showing any weakness. David is known as the most powerful prophet of worship. He used a three-night time to pray, and at least one day he fasted. About David's obedience to his God is further explained in the following hadiths: God's most beloved fast is David's fast. He fasted daily and broke daily. Allah Ta'ala's most beloved prayer is David's prayer, He sleeps half a night, and performs a third prayer, then sleeps a sixth time. (History of A.Hmad, al-Bukhari, Muslim, Abu Dawud, and an-Nasa'i of Ibn 'Umar) From this history it is understood that the Prophet David in all matters always returned to God. When he feels guilty, or when he feels guilty for something, he always asks God for forgiveness. Imam al-hakim narrated from Abu ad-Darda 'which states: When the Prophet (peace be upon him) mentioned the Prophet David or spoke about it, he made it clear that he was the most human of his worship. The Imam adh-aami narrated from Ibn 'Umar that the Messenger of Allah (may peace be upon him) said: It is not right for anyone to say that I worship more than David. These histories show that the prophet David was a very obedient prophet to God, as God states at the end of this verse.",
      "text_tafsir": "Allah memerintahkan kepada Rasulullah dan pengikut-pengikutnya agar tetap bersabar menghadapi apa saja yang dikatakan oleh kaum musyrikin, meskipun perkataan itu merupakan hinaan dan pendustaan. Hal serupa itu tidak saja menimpa Rasulullah dan para pengikutnya, akan tetapi juga menimpa nabi-nabi yang diutus sebelumnya. Bagi orang-orang yang beriman, pengingkaran dan penganiayaan yang datang dari pihak musuh-musuh Allah, tidaklah mengurangi semangat perjuangan mereka dalam menegakkan agama tauhid, bahkan menjadi pendorong untuk tetap mempertahankan kebenaran tauhid dan tetap berjuang menghancurkan kemusyrikan. \n\nAllah memerintahkan kepada Rasulullah agar mengingatkan kaumnya akan kisah Nabi Daud yang memiliki kekuatan. Dimaksud kekuatan pada ayat ini ialah kekuatan dalam menaati Allah dan kekuatan dalam memahami agama. Ketaatan kepada Allah dan pengetahuannya terhadap agama tergambar pada tindakannya yang selalu berjuang untuk melaksanakan amanat, menyebarluaskan seruan menganut agama tauhid, tanpa menampakkan kelemahan sedikit pun.\n\nNabi Daud terkenal sebagai nabi yang paling kuat beribadah. Ia menggunakan waktunya sepertiga malam untuk salat, dan selang sehari ia berpuasa.\n\nMengenai ketaatan Daud kepada Tuhannya lebih jauh dijelaskan dalam beberapa hadis sebagai berikut: \n\nPuasa yang paling dicintai Allah adalah puasa Daud. Dia berpuasa sehari dan berbuka sehari. Salat yang paling dicintai Allah Ta'ala ialah salat Daud, Dia tidur separuh malam, dan melakukan salat sepertiganya, lalu tidur lagi seperenamnya. (Riwayat A.hmad, al-Bukhari, Muslim, Abu Dawud, dan an-Nasa'i dari Ibnu 'Umar)\n\nDari riwayat ini dapat dipahami bahwa Nabi Daud dalam segala urusan selalu mengembalikannya kepada Allah. Apabila ia merasa bersalah, atau terlintas dalam hatinya ada kesalahan pada dirinya, maka ia selalu meminta ampun kepada Allah.\n\nImam al-hakim meriwayatkan dari Abu ad-Darda' yang menyatakan:\n\nApabila Nabi (Muhammad) saw menyebutkan Nabi Daud atau membicarakannya, maka beliau memberikan sifat bahwa ia adalah manusia yang paling banyak ibadahnya.\n\nImam adh-ailami meriwayatkan dari Ibnu 'Umar yang menyatakan bahwa Rasulullah saw bersabda:\n\nTidak patut bagi seseorang mengatakan bahwa saya lebih banyak beribadah dari Nabi Daud.\n\nRiwayat-riwayat tersebut menunjukkan bahwa Nabi Daud adalah nabi yang amat taat kepada Allah, sebagaimana ditegaskan oleh Allah pada akhir ayat ini.",
      "text_translation": "Bersabarlah atas apa yang mereka katakan; dan ingatlah akan hamba Kami Dawud yang mempunyai kekuatan; sungguh dia sangat taat (kepada Allah).",
      "text": "اِصْبِرْ عَلٰى مَا يَقُوْلُوْنَ وَاذْكُرْ عَبْدَنَا دَاوٗدَ ذَا الْاَيْدِۚ اِنَّهٗٓ اَوَّابٌ",
      "text_translation_en": "[But] bear thou with patience whatever they may say, and remember Our servant David, him who was endowed with [so much] inner strength! He, verily, would always turn unto Us:",
      "juz_number": 23
    },
    "18": {
      "text_tafsir_en": "In these verses, God mentions some of the pleasures given to David. First, that God had subdued the mountains to praise David in the evening and morning. Such expressions contain the sense that David was always obedient to God. He always praises his greatness morning and evening. God equates this obedience to David with the obedience of the mountains to show how obedient David was. As for the adherence to the magnificent mountain is in the fact that the mountains obey God's unchanging sun, which is of course something else with the obedience of man. Allah says: And there is nothing but praise in His praise, but you do not understand them. (al-Isra '\/ 17: 44) If one carefully observes the meaning and usefulness of mountain creation for man, and observes its functioning well, then he knows that the mountain is one of the causes of the downfall, which gives life to man . It is also a medium of water storage in the rainy season, which it streams in the dry season, as well as the minerals it spills into agricultural soil. Likewise in his stomach there are all kinds of mines that are indispensable for the benefit of human life. The mountains do their job well and never go out of their way. God further explained that He also brought down the birds that were always praising Him with David. This similar expression contains a sense of how beautiful the voice of David was when reading the book of Psalms, so that it seemed as if the sound of his voice could capture the birds flying in space. It is described as if the birds were flying in the air at the sound of David's beaming voice, and accompanied by the roar. Birds are not the same as humans. Birds have their own way of expressing God's greatness. Then Allah emphasized that each of the creatures mentioned above, that of the mountain and the bird, is subject to the obedience of Allah for the benefit of mankind. In this verse there is a satire for the Meccans, first and foremost that if the mountain and the bird were created unknowingly always obey the precepts of God, then they should be created as being more perfect and equipped with a greater sense of obedience to the laws. God. If it did, it would mean something was wrong with them. Second, God has strengthened the kingdom of David with a great army, rich riches, highly respected personalities, and skills in organizing warfare to ensure victory. Third, God has bestowed wisdom upon him. The meaning of wisdom in this verse is prophecy, perfection of knowledge, and carefulness in performing deeds of deeds, as well as proper understanding. Among the knowledge that God gave to David was as it is said in the word of God: ¦ And we have used iron for it, (that is, to make} a great armor, and to weave it; and do good. Really, I can see what you're doing. (Saba '\/ 34: 10-11) What is meant by his prudence in performing deeds is that he does not want to start an act, unless he knows the cause and for what the charity is doing. Fourth, God has given him a policy of resolving disputes. In resolving disputes he constantly examines the parties on the basis of convincing evidence far from the one-sided nature, and clean from the influence of lust. To find the true confidence that can be the right way in deciding things that require a great deal of knowledge, a gentle attitude, mastering a disputed question, and strong patience.",
      "text_tafsir": "Di dalam ayat-ayat ini, Allah menyebutkan beberapa kenikmatan yang telah diberikan kepada Daud.\n\nPertama, bahwa Allah telah menundukkan gunung-gunung untuk bertasbih bersama-sama Daud di waktu petang dan pagi. Ungkapan seperti ini mengandung pengertian bahwa Nabi Daud selalu taat beribadah kepada Allah. Dia selalu bertasbih, memuji kebesaran-Nya pagi dan petang. Allah menyamakan ketaatan Daud ini dengan ketaatan gunung-gunung untuk menunjukkan betapa dalam ketaatan Nabi Daud itu. Adapun tentang ketaatan gunung bertasbih itu adalah dalam kenyataan bahwa gunung-gunung itu mengikuti sunah Allah yang tidak berubah-ubah, yang sudah barang tentu lain dengan taatnya manusia.\n\nAllah berfirman:\n\nDan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. (al-Isra'\/17: 44)\n\nApabila seseorang memperhatikan dengan cermat arti dan kegunaan penciptaan gunung untuk manusia, serta memperhatikan pula fungsinya sebaik-baiknya, maka ia akan mengetahui bahwa gunung itu merupakan salah satu penyebab turunnya hujan, yang memberi kehidupan bagi manusia. Ia juga sebagai media penyimpan air di musim penghujan, yang dialirkannya di musim kemarau, serta mineral yang dimuntahkannya menjadi penyubur tanah pertanian. Demikian pula dalam perutnya terdapat segala macam barang tambang yang sangat diperlukan untuk kepentingan perlengkapan hidup manusia. Gunung-gunung itu menunaikan tugas dengan sebaik-baiknya dan tidak pernah keluar dari ketentuan yang berlaku.\n\nAllah selanjutnya menjelaskan bahwa Dia menundukkan pula burung-burung yang selalu bertasbih kepada-Nya bersama Nabi Daud. Ungkapan serupa ini mengandung pengertian betapa indahnya suara Nabi Daud pada saat membaca kitab Zabur, sehingga seolah-olah getaran suaranya dapat menawan burung-burung yang sedang beterbangan di angkasa. Digambarkan seolah-olah burung-burung yang sedang terbang itu terhenti di udara karena mendengar suara Nabi Daud yang sedang bertasbih, dan ikut pula bertasbih bersama-sama dengannya.\n\nTasbih burung-burung tidak sama dengan tasbih manusia. Burung-burung mempunyai cara tersendiri di dalam menyatakan keagungan Allah.\n\nSesudah itu Allah menegaskan bahwa masing-masing makhluk yang disebutkan tadi, yaitu gunung dan burung tunduk, takluk dan jinak patuh pada ketentuan Allah untuk kepentingan umat manusia.\n\nPada ayat ini terdapat sindiran bagi orang-orang musyrik Mekah, pertama bahwa apabila gunung dan burung yang diciptakan tidak berakal itu selalu menaati ketentuan-ketentuan Allah, maka seharusnyalah mereka yang diciptakan sebagai makhluk yang lebih sempurna dan dilengkapi dengan akal lebih taat kepada hukum-hukum Allah. Apabila terjadi sebaliknya, berarti telah terjadi sesuatu yang tidak wajar pada diri mereka.\n\nKedua, Allah telah menguatkan kerajaan Nabi Daud dengan tentara yang banyak, harta kekayaan yang melimpah ruah, pribadi yang sangat disegani, dan kemahiran dalam mengatur siasat perang sehingga selalu meraih kemenangan.\n\nKetiga, Allah telah menganugerahkan kepadanya hikmah. Yang dimaksud hikmah dalam ayat ini adalah kenabian, kesempurnaan ilmu, dan ketelitian dalam melaksanakan amal perbuatan, serta pemahaman yang tepat.\n\nDi antara ilmu pengetahuan yang diberikan Allah kepada Nabi Daud ialah seperti disebutkan dalam firman Allah:\n\n¦ dan Kami telah melunakkan besi untuknya, (yaitu) buatlah baju besi yang besar-besar dan ukurlah anyamannya; dan kerjakanlah kebajikan. Sungguh, Aku Maha Melihat apa yang kamu kerjakan. (Saba'\/34: 10-11)\n\nSedang yang dimaksud ketelitiannya dalam melaksanakan amal perbuatan ialah dia tidak mau memulai sesuatu perbuatan, terkecuali ia mengetahui sebab apa dan untuk apa amal perbuatan itu dilakukan.\n\nKeempat, Allah telah menganugerahkan kepadanya kebijakan dalam menyelesaikan perselisihan. Dalam menyelesaikan persengketaan ia selalu memeriksa pihak-pihak berdasarkan bukti-bukti yang meyakinkan jauh dari sifat-sifat berat sebelah, dan bersih dari pengaruh hawa nafsu. Untuk mencari keyakinan yang sebenar-benarnya yang dapat dijadikan landasan yang tepat dalam memutuskan perkara memerlukan ilmu pengetahuan yang luas, sikap yang lemah-lembut, menguasai persoalan yang dipersengketakan, dan kesabaran yang kuat.",
      "text_translation": "Sungguh, Kamilah yang menundukkan gunung-gunung untuk bertasbih bersama dia (Dawud) pada waktu petang dan pagi,",
      "text": "اِنَّا سَخَّرْنَا الْجِبَالَ مَعَهٗ يُسَبِّحْنَ بِالْعَشِيِّ وَالْاِشْرَاقِۙ",
      "text_translation_en": "[and for this,] behold, We caused the mountains to join him in extolling Our limitless glory at eventide and at sun­rise,",
      "juz_number": 23
    },
    "19": {
      "text_tafsir_en": "In these verses, God mentions some of the pleasures given to David. First, that God had subdued the mountains to praise David in the evening and morning. Such expressions contain the sense that David was always obedient to God. He always praises his greatness morning and evening. God equates this obedience to David with the obedience of the mountains to show how obedient David was. As for the adherence to the magnificent mountain is in the fact that the mountains obey God's unchanging sun, which is of course something else with the obedience of man. Allah says: And there is nothing but praise in His praise, but you do not understand them. (al-Isra '\/ 17: 44) If one carefully observes the meaning and usefulness of mountain creation for man, and observes its functioning well, then he knows that the mountain is one of the causes of the downfall, which gives life to man . It is also a medium of water storage in the rainy season, which it streams in the dry season, as well as the minerals it spills into agricultural soil. Likewise in his stomach there are all kinds of mines that are indispensable for the benefit of human life. The mountains do their job well and never go out of their way. God further explained that He also brought down the birds that were always praising Him with David. This similar expression contains a sense of how beautiful the voice of David was when reading the book of Psalms, so that it seemed as if the sound of his voice could capture the birds flying in space. It is described as if the birds were flying in the air at the sound of David's beaming voice, and accompanied by the roar. Birds are not the same as humans. Birds have their own way of expressing God's greatness. Then Allah emphasized that each of the creatures mentioned above, that of the mountain and the bird, is subject to the obedience of Allah for the benefit of mankind. In this verse there is a satire for the Meccans, first and foremost that if the mountain and the bird were created unknowingly always obey the precepts of God, then they should be created as being more perfect and equipped with a greater sense of obedience to the laws. God. If it did, it would mean something was wrong with them. Second, God has strengthened the kingdom of David with a great army, rich riches, highly respected personalities, and skills in organizing warfare to ensure victory. Third, God has bestowed wisdom upon him. The meaning of wisdom in this verse is prophecy, perfection of knowledge, and carefulness in performing deeds of deeds, as well as proper understanding. Among the knowledge that God gave to David was as it is said in the word of God: ¦ And we have used iron for it, (that is, to make} a great armor, and to weave it; and do good. Really, I can see what you're doing. (Saba '\/ 34: 10-11) What is meant by his prudence in performing deeds is that he does not want to start an act, unless he knows the cause and for what the charity is doing. Fourth, God has given him a policy of resolving disputes. In resolving disputes he constantly examines the parties on the basis of convincing evidence far from the one-sided nature, and clean from the influence of lust. To find the true confidence that can be the right way in deciding things that require a great deal of knowledge, a gentle attitude, mastering a disputed question, and strong patience.",
      "text_tafsir": "Di dalam ayat-ayat ini, Allah menyebutkan beberapa kenikmatan yang telah diberikan kepada Daud.\n\nPertama, bahwa Allah telah menundukkan gunung-gunung untuk bertasbih bersama-sama Daud di waktu petang dan pagi. Ungkapan seperti ini mengandung pengertian bahwa Nabi Daud selalu taat beribadah kepada Allah. Dia selalu bertasbih, memuji kebesaran-Nya pagi dan petang. Allah menyamakan ketaatan Daud ini dengan ketaatan gunung-gunung untuk menunjukkan betapa dalam ketaatan Nabi Daud itu. Adapun tentang ketaatan gunung bertasbih itu adalah dalam kenyataan bahwa gunung-gunung itu mengikuti sunah Allah yang tidak berubah-ubah, yang sudah barang tentu lain dengan taatnya manusia.\n\nAllah berfirman:\n\nDan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. (al-Isra'\/17: 44)\n\nApabila seseorang memperhatikan dengan cermat arti dan kegunaan penciptaan gunung untuk manusia, serta memperhatikan pula fungsinya sebaik-baiknya, maka ia akan mengetahui bahwa gunung itu merupakan salah satu penyebab turunnya hujan, yang memberi kehidupan bagi manusia. Ia juga sebagai media penyimpan air di musim penghujan, yang dialirkannya di musim kemarau, serta mineral yang dimuntahkannya menjadi penyubur tanah pertanian. Demikian pula dalam perutnya terdapat segala macam barang tambang yang sangat diperlukan untuk kepentingan perlengkapan hidup manusia. Gunung-gunung itu menunaikan tugas dengan sebaik-baiknya dan tidak pernah keluar dari ketentuan yang berlaku.\n\nAllah selanjutnya menjelaskan bahwa Dia menundukkan pula burung-burung yang selalu bertasbih kepada-Nya bersama Nabi Daud. Ungkapan serupa ini mengandung pengertian betapa indahnya suara Nabi Daud pada saat membaca kitab Zabur, sehingga seolah-olah getaran suaranya dapat menawan burung-burung yang sedang beterbangan di angkasa. Digambarkan seolah-olah burung-burung yang sedang terbang itu terhenti di udara karena mendengar suara Nabi Daud yang sedang bertasbih, dan ikut pula bertasbih bersama-sama dengannya.\n\nTasbih burung-burung tidak sama dengan tasbih manusia. Burung-burung mempunyai cara tersendiri di dalam menyatakan keagungan Allah.\n\nSesudah itu Allah menegaskan bahwa masing-masing makhluk yang disebutkan tadi, yaitu gunung dan burung tunduk, takluk dan jinak patuh pada ketentuan Allah untuk kepentingan umat manusia.\n\nPada ayat ini terdapat sindiran bagi orang-orang musyrik Mekah, pertama bahwa apabila gunung dan burung yang diciptakan tidak berakal itu selalu menaati ketentuan-ketentuan Allah, maka seharusnyalah mereka yang diciptakan sebagai makhluk yang lebih sempurna dan dilengkapi dengan akal lebih taat kepada hukum-hukum Allah. Apabila terjadi sebaliknya, berarti telah terjadi sesuatu yang tidak wajar pada diri mereka.\n\nKedua, Allah telah menguatkan kerajaan Nabi Daud dengan tentara yang banyak, harta kekayaan yang melimpah ruah, pribadi yang sangat disegani, dan kemahiran dalam mengatur siasat perang sehingga selalu meraih kemenangan.\n\nKetiga, Allah telah menganugerahkan kepadanya hikmah. Yang dimaksud hikmah dalam ayat ini adalah kenabian, kesempurnaan ilmu, dan ketelitian dalam melaksanakan amal perbuatan, serta pemahaman yang tepat.\n\nDi antara ilmu pengetahuan yang diberikan Allah kepada Nabi Daud ialah seperti disebutkan dalam firman Allah:\n\n¦ dan Kami telah melunakkan besi untuknya, (yaitu) buatlah baju besi yang besar-besar dan ukurlah anyamannya; dan kerjakanlah kebajikan. Sungguh, Aku Maha Melihat apa yang kamu kerjakan. (Saba'\/34: 10-11)\n\nSedang yang dimaksud ketelitiannya dalam melaksanakan amal perbuatan ialah dia tidak mau memulai sesuatu perbuatan, terkecuali ia mengetahui sebab apa dan untuk apa amal perbuatan itu dilakukan.\n\nKeempat, Allah telah menganugerahkan kepadanya kebijakan dalam menyelesaikan perselisihan. Dalam menyelesaikan persengketaan ia selalu memeriksa pihak-pihak berdasarkan bukti-bukti yang meyakinkan jauh dari sifat-sifat berat sebelah, dan bersih dari pengaruh hawa nafsu. Untuk mencari keyakinan yang sebenar-benarnya yang dapat dijadikan landasan yang tepat dalam memutuskan perkara memerlukan ilmu pengetahuan yang luas, sikap yang lemah-lembut, menguasai persoalan yang dipersengketakan, dan kesabaran yang kuat.",
      "text_translation": "dan (Kami tundukkan pula) burung-burung dalam keadaan terkumpul. Masing-masing sangat taat (kepada Allah).",
      "text": "وَالطَّيْرَمَحْشُوْرَةً ۗ كُلٌّ لَهٗٓ اَوَّابٌ",
      "text_translation_en": "and [likewise] the birds in their assemblies: [together] they all Would turn again and again unto Him [who had created them].",
      "juz_number": 23
    },
    "20": {
      "text_tafsir_en": "In these verses, God mentions some of the pleasures given to David. First, that God had subdued the mountains to praise David in the evening and morning. Such expressions contain the sense that David was always obedient to God. He always praises his greatness morning and evening. God equates this obedience to David with the obedience of the mountains to show how obedient David was. As for the adherence to the magnificent mountain is in the fact that the mountains obey God's unchanging sun, which is of course something else with the obedience of man. Allah says: And there is nothing but praise in His praise, but you do not understand them. (al-Isra '\/ 17: 44) If one carefully observes the meaning and usefulness of mountain creation for man, and observes its functioning well, then he knows that the mountain is one of the causes of the downfall, which gives life to man . It is also a medium of water storage in the rainy season, which it streams in the dry season, as well as the minerals it spills into agricultural soil. Likewise in his stomach there are all kinds of mines that are indispensable for the benefit of human life. The mountains do their job well and never go out of their way. God further explained that He also brought down the birds that were always praising Him with David. This similar expression contains a sense of how beautiful the voice of David was when reading the book of Psalms, so that it seemed as if the sound of his voice could capture the birds flying in space. It is described as if the birds were flying in the air at the sound of David's beaming voice, and accompanied by the roar. Birds are not the same as humans. Birds have their own way of expressing God's greatness. Then Allah emphasized that each of the creatures mentioned above, that of the mountain and the bird, is subject to the obedience of Allah for the benefit of mankind. In this verse there is a satire for the Meccans, first and foremost that if the mountain and the bird were created unknowingly always obey the precepts of God, then they should be created as being more perfect and equipped with a greater sense of obedience to the laws. God. If it did, it would mean something was wrong with them. Second, God has strengthened the kingdom of David with a great army, rich riches, highly respected personalities, and skills in organizing warfare to ensure victory. Third, God has bestowed wisdom upon him. The meaning of wisdom in this verse is prophecy, perfection of knowledge, and carefulness in performing deeds of deeds, as well as proper understanding. Among the knowledge that God gave to David was as it is said in the word of God: ¦ And we have used iron for it, (that is, to make} a great armor, and to weave it; and do good. Really, I can see what you're doing. (Saba '\/ 34: 10-11) What is meant by his prudence in performing deeds is that he does not want to start an act, unless he knows the cause and for what the charity is doing. Fourth, God has given him a policy of resolving disputes. In resolving disputes he constantly examines the parties on the basis of convincing evidence far from the one-sided nature, and clean from the influence of lust. To find the true confidence that can be the right way in deciding things that require a great deal of knowledge, a gentle attitude, mastering a disputed question, and strong patience.",
      "text_tafsir": "Di dalam ayat-ayat ini, Allah menyebutkan beberapa kenikmatan yang telah diberikan kepada Daud.\n\nPertama, bahwa Allah telah menundukkan gunung-gunung untuk bertasbih bersama-sama Daud di waktu petang dan pagi. Ungkapan seperti ini mengandung pengertian bahwa Nabi Daud selalu taat beribadah kepada Allah. Dia selalu bertasbih, memuji kebesaran-Nya pagi dan petang. Allah menyamakan ketaatan Daud ini dengan ketaatan gunung-gunung untuk menunjukkan betapa dalam ketaatan Nabi Daud itu. Adapun tentang ketaatan gunung bertasbih itu adalah dalam kenyataan bahwa gunung-gunung itu mengikuti sunah Allah yang tidak berubah-ubah, yang sudah barang tentu lain dengan taatnya manusia.\n\nAllah berfirman:\n\nDan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. (al-Isra'\/17: 44)\n\nApabila seseorang memperhatikan dengan cermat arti dan kegunaan penciptaan gunung untuk manusia, serta memperhatikan pula fungsinya sebaik-baiknya, maka ia akan mengetahui bahwa gunung itu merupakan salah satu penyebab turunnya hujan, yang memberi kehidupan bagi manusia. Ia juga sebagai media penyimpan air di musim penghujan, yang dialirkannya di musim kemarau, serta mineral yang dimuntahkannya menjadi penyubur tanah pertanian. Demikian pula dalam perutnya terdapat segala macam barang tambang yang sangat diperlukan untuk kepentingan perlengkapan hidup manusia. Gunung-gunung itu menunaikan tugas dengan sebaik-baiknya dan tidak pernah keluar dari ketentuan yang berlaku.\n\nAllah selanjutnya menjelaskan bahwa Dia menundukkan pula burung-burung yang selalu bertasbih kepada-Nya bersama Nabi Daud. Ungkapan serupa ini mengandung pengertian betapa indahnya suara Nabi Daud pada saat membaca kitab Zabur, sehingga seolah-olah getaran suaranya dapat menawan burung-burung yang sedang beterbangan di angkasa. Digambarkan seolah-olah burung-burung yang sedang terbang itu terhenti di udara karena mendengar suara Nabi Daud yang sedang bertasbih, dan ikut pula bertasbih bersama-sama dengannya.\n\nTasbih burung-burung tidak sama dengan tasbih manusia. Burung-burung mempunyai cara tersendiri di dalam menyatakan keagungan Allah.\n\nSesudah itu Allah menegaskan bahwa masing-masing makhluk yang disebutkan tadi, yaitu gunung dan burung tunduk, takluk dan jinak patuh pada ketentuan Allah untuk kepentingan umat manusia.\n\nPada ayat ini terdapat sindiran bagi orang-orang musyrik Mekah, pertama bahwa apabila gunung dan burung yang diciptakan tidak berakal itu selalu menaati ketentuan-ketentuan Allah, maka seharusnyalah mereka yang diciptakan sebagai makhluk yang lebih sempurna dan dilengkapi dengan akal lebih taat kepada hukum-hukum Allah. Apabila terjadi sebaliknya, berarti telah terjadi sesuatu yang tidak wajar pada diri mereka.\n\nKedua, Allah telah menguatkan kerajaan Nabi Daud dengan tentara yang banyak, harta kekayaan yang melimpah ruah, pribadi yang sangat disegani, dan kemahiran dalam mengatur siasat perang sehingga selalu meraih kemenangan.\n\nKetiga, Allah telah menganugerahkan kepadanya hikmah. Yang dimaksud hikmah dalam ayat ini adalah kenabian, kesempurnaan ilmu, dan ketelitian dalam melaksanakan amal perbuatan, serta pemahaman yang tepat.\n\nDi antara ilmu pengetahuan yang diberikan Allah kepada Nabi Daud ialah seperti disebutkan dalam firman Allah:\n\n¦ dan Kami telah melunakkan besi untuknya, (yaitu) buatlah baju besi yang besar-besar dan ukurlah anyamannya; dan kerjakanlah kebajikan. Sungguh, Aku Maha Melihat apa yang kamu kerjakan. (Saba'\/34: 10-11)\n\nSedang yang dimaksud ketelitiannya dalam melaksanakan amal perbuatan ialah dia tidak mau memulai sesuatu perbuatan, terkecuali ia mengetahui sebab apa dan untuk apa amal perbuatan itu dilakukan.\n\nKeempat, Allah telah menganugerahkan kepadanya kebijakan dalam menyelesaikan perselisihan. Dalam menyelesaikan persengketaan ia selalu memeriksa pihak-pihak berdasarkan bukti-bukti yang meyakinkan jauh dari sifat-sifat berat sebelah, dan bersih dari pengaruh hawa nafsu. Untuk mencari keyakinan yang sebenar-benarnya yang dapat dijadikan landasan yang tepat dalam memutuskan perkara memerlukan ilmu pengetahuan yang luas, sikap yang lemah-lembut, menguasai persoalan yang dipersengketakan, dan kesabaran yang kuat.",
      "text_translation": "Dan Kami kuatkan kerajaannya dan Kami berikan hikmah kepadanya serta kebijaksanaan dalam memutuskan perkara.",
      "text": "وَشَدَدْنَا مُلْكَهٗ وَاٰتَيْنٰهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ",
      "text_translation_en": "And We streng­thened his dominion, and bestowed upon him wisdom and sagacity in judgment.",
      "juz_number": 23
    },
    "21": {
      "text_tafsir_en": "God mentioned one of the interesting events in the story of the prophet David. The story begins with a question directed at the Prophet and his followers, to show that the story really captivates and deserves attention. The interesting story is the story of the people who came to David. David was at his place of worship. David was shocked because he thought they were coming to trick him. David thought so, because they came in unusual and unusual ways. At that time, they asked David not to be afraid. They further made it clear that they had something to decide, and demanded that the matter be decided by a fair decision, without deviating from the truth.",
      "text_tafsir": "Allah menyebutkan salah satu peristiwa yang menarik di antara kisah Nabi Daud. Kisah ini dimulai dengan pertanyaan yang ditujukan kepada Rasulullah dan pengikut-pengikutnya, untuk menunjukkan bahwa kisah dimaksud benar-benar menarik perhatian dan patut diteladani. Kisah yang menarik itu ialah kisah orang-orang yang berperkara yang datang kepada Nabi Daud. Daud pada waktu itu berada di tempat peribadatannya. Nabi Daud pun terperanjat karena beliau menyangka mereka itu datang untuk memperdayainya. Nabi Daud menduga demikian, karena mereka datang dengan cara dan dalam waktu yang tak biasa. Pada saat itulah, mereka meminta kepada Daud agar tidak merasa takut. Selanjutnya mereka menjelaskan bahwa mereka mempunyai perkara yang harus diputuskan, dan meminta agar perkaranya diputuskan dengan keputusan yang adil, lagi tidak menyimpang dari kebenaran.",
      "text_translation": "Dan apakah telah sampai kepadamu berita orang-orang yang berselisih ketika mereka memanjat dinding mihrab?",
      "text": "وَهَلْ اَتٰىكَ نَبَؤُ الْخَصْمِۘ اِذْ تَسَوَّرُوا الْمِحْرَابَۙ",
      "text_translation_en": "AND YET, has the story of the litigants come within thy ken - [the story of the two] who surmounted the walls of the sanctuary [in which David prayed]?",
      "juz_number": 23
    },
    "22": {
      "text_tafsir_en": "God mentioned one of the interesting events in the story of the prophet David. The story begins with a question directed at the Prophet and his followers, to show that the story really captivates and deserves attention. The interesting story is the story of the people who came to David. David was at his place of worship. David was shocked because he thought they were coming to trick him. David thought so, because they came in unusual and unusual ways. At that time, they asked David not to be afraid. They further made it clear that they had something to decide, and demanded that the matter be decided by a fair decision, without deviating from the truth.",
      "text_tafsir": "Allah menyebutkan salah satu peristiwa yang menarik di antara kisah Nabi Daud. Kisah ini dimulai dengan pertanyaan yang ditujukan kepada Rasulullah dan pengikut-pengikutnya, untuk menunjukkan bahwa kisah dimaksud benar-benar menarik perhatian dan patut diteladani. Kisah yang menarik itu ialah kisah orang-orang yang berperkara yang datang kepada Nabi Daud. Daud pada waktu itu berada di tempat peribadatannya. Nabi Daud pun terperanjat karena beliau menyangka mereka itu datang untuk memperdayainya. Nabi Daud menduga demikian, karena mereka datang dengan cara dan dalam waktu yang tak biasa. Pada saat itulah, mereka meminta kepada Daud agar tidak merasa takut. Selanjutnya mereka menjelaskan bahwa mereka mempunyai perkara yang harus diputuskan, dan meminta agar perkaranya diputuskan dengan keputusan yang adil, lagi tidak menyimpang dari kebenaran.",
      "text_translation": "ketika mereka masuk menemui Dawud lalu dia terkejut karena (kedatangan) mereka. Mereka berkata, “Janganlah takut! (Kami) berdua sedang berselisih, sebagian dari kami berbuat zalim kepada yang lain; maka berilah keputusan di antara kami secara adil dan janganlah menyimpang dari kebenaran serta tunjukilah kami ke jalan yang lurus.",
      "text": "اِذْ دَخَلُوْا عَلٰى دَاوٗدَ فَفَزِعَ مِنْهُمْ قَالُوْا لَا تَخَفْۚ خَصْمٰنِ بَغٰى بَعْضُنَا عَلٰى بَعْضٍ فَاحْكُمْ بَيْنَنَا بِالْحَقِّ وَلَا تُشْطِطْ وَاهْدِنَآ اِلٰى سَوَاۤءِ الصِّرَاطِ",
      "text_translation_en": "As they came upon David, and he shrank back in fear from them, they said: “Fear not! [We are but] two litigants. One of us has wronged the other: so judge thou between us with justice, and deviate not from what is right, and show [both of] us the way to rectitude.",
      "juz_number": 23
    },
    "23": {
      "text_tafsir_en": "In this verse Allah explains what they did. One of them explained that his brother had ninety-nine goats. He only had one goat. His brother demanded that he give up the goat he had. Because his brother was good at distorting facts, and while he himself did not have strong evidence to fend off, he felt defeated and had to hand over the same goat to his brother. That is what they appeal to David with the purpose of making a just decision.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan apa yang mereka jadikan perkara itu. Salah satu pihak dari mereka menerangkan bahwa saudaranya mempunyai sembilan puluh sembilan ekor kambing. Sedang ia sendiri mempunyai seekor kambing saja. Saudaranya menuntut agar menyerahkan kambing yang ia miliki. Karena saudaranya itu pandai memutarbalikkan fakta, sedang ia sendiri tidak mempunyai bukti-bukti yang kuat untuk menangkis, ia merasa dikalahkan dan harus menyerahkan kambing yang seekor itu kepada saudaranya. Itulah perkara yang mereka ajukan kepada Nabi Daud dengan maksud agar mendapat keputusan yang adil.",
      "text_translation": "Sesungguhnya saudaraku ini mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor saja, lalu dia berkata, “Serahkanlah (kambingmu) itu kepadaku! Dan dia mengalahkan aku dalam perdebatan.”",
      "text": "اِنَّ هٰذَآ اَخِيْ ۗ لَهٗ تِسْعٌ وَّتِسْعُوْنَ نَعْجَةً وَّلِيَ نَعْجَةٌ وَّاحِدَةٌ ۗفَقَالَ اَكْفِلْنِيْهَا وَعَزَّنِيْ فِى الْخِطَابِ",
      "text_translation_en": "“Behold, this is my brother: he has ninety-nine ewes, whereas I have [only] one ewe - and yet he said, ‘Make her over to me,’ and forcibly prevailed against me in this [our] dispute.”",
      "juz_number": 23
    },
    "24": {
      "text_tafsir_en": "In this verse it is explained that David resolved the matter by saying that the plaintiff had wronged the plaintiff, because the plaintiff had taken the plaintiff's goat for possession, so that the goat became more numerous. In this verse it is not further explained whether the prophet David after receiving the evidence from the plaintiff, also requested the defendant's information. It is also not clear whether David's answer was based on convincing evidence. According to the meaning of the verse, David was only responding after the plaintiff's testimony. It is possible that the plaintiff had presented evidence contrary to fact, or that the manner in which the words were presented was treated in such a manner, that it was improbable that the plaintiff was an honest person. David should not have given the answer in a hurry, or delayed the answer until he had gained some real confidence. Judging from the way they came to see David by climbing the fence, and his timing, and the questions that were being asked, they did not intend to appeal to David, but they had a different purpose. Only because of David's vigilance, they could not carry out their plans. It is known throughout history that the Israelites often tried to kill their prophets, such as those who killed Ilyas' and Zechariah. It is alleged that the two men (plaintiff and plaintiff) actually wanted to mistreat David, only that they could not carry out his evil intentions because their intention was known in advance. Then God explained David's answer in more detail. David told the man that most of the people who held the alliance, mistreated the other members of this because of malice, envy, and covetousness so that one member's rights were taken away by the other members. Except for those whose hearts are full of faith and who love the righteous deeds that are spared from such evil deeds. At the end of the verse, God explains that David realized that he was under trial from God. Then he begged God for his error, and bowed to him for feeling his weakness and guilt. The mistake and disadvantage he faces is his urge to give people answers, even though he has not yet gained the confidence and evidence he should have. He decided based solely on his belief that the coming of those who wanted to seduce him was a trial from God, but what he did not expect to happen.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa Nabi Daud memutuskan perkara tersebut dengan mengatakan bahwa tergugat telah berbuat aniaya kepada penggugat, karena yang digugat itu telah mengambil kambing penggugat untuk dimiliki, sehingga kambingnya menjadi bertambah banyak.\n\nPada ayat ini tidak dijelaskan lebih lanjut apakah Nabi Daud sesudah mendapat keterangan dari penggugat, meminta keterangan juga kepada tergugat. Juga tidak diterangkan apakah jawaban Nabi Daud itu didasarkan atas bukti-bukti yang memberi keyakinan. Menurut pengertian yang tampak dalam ayat, Nabi Daud hanyalah memberi jawaban sesudah mendapat keterangan dari pihak penggugat saja. Padahal mungkin saja pihak penggugat mengemukakan keterangan yang berlawanan dengan kenyataan, atau karena cara mengemukakan kata diatur demikian rupa, hingga timbullah kesan seolah-olah si penggugat itu orang jujur. Seharusnya Nabi Daud tidak memberi jawaban secara tergesa-gesa, atau ditunda saja jawabannya hingga mendapat keyakinan yang sebenar-benarnya. \n\nDitinjau dari cara mereka masuk menemui Daud dengan memanjat pagar, dan waktunya yang tidak tepat, dan persoalan yang diajukan, sebenarnya mereka tidak bermaksud untuk meminta keputusan kepada Daud, tetapi mereka mempunyai maksud yang lain. Hanya karena kewaspadaan Nabi Daud, maka rencana mereka itu tidak dapat mereka laksanakan. Di dalam sejarah dapat diketahui bahwa orang-orang Bani Israil sering kali berusaha untuk membunuh nabinya, misalnya mereka telah membunuh Ilyasa' dan Zakaria. Patut diduga kedua orang itu (penggugat dan tergugat) sebenarnya ingin menganiaya Nabi Daud, hanya saja mereka tidak sampai melaksanakan niat jahatnya karena niat mereka diketahui terlebih dahulu.\n\nKemudian Allah menjelaskan jawaban Daud lebih terperinci. Daud mengatakan kepada orang yang berperkara itu bahwa sebagian besar orang yang mengadakan perserikatan, menganiaya anggotanya yang lain hal ini terjadi karena sifat hasad, dengki, dan memperturutkan hawa nafsu sehingga hak anggota yang satu terambil oleh anggota yang lain. Terkecuali orang-orang yang dalam hatinya penuh dengan iman dan mencintai amal saleh yang terhindar dari perbuatan yang jahat itu.\n\nDi akhir ayat, Allah menjelaskan bahwa Nabi Daud sadar bahwa ia sedang mendapat cobaan dari Allah. Lalu ia meminta ampun kepada Allah atas kesalahan, seraya sujud bertobat kepada-Nya karena merasakan kekurangan dan kesalahan yang ada pada dirinya.\n\nKesalahan dan kekurangan yang menimpa dirinya ialah ketergesa-gesaannya memberikan jawaban kepada orang yang berperkara, padahal ia belum memperoleh keyakinan dan bukti-bukti yang seharusnya ia peroleh. Ia memutuskan hanya berdasar prasangkanya bahwa kedatangan orang yang ingin memperdayainya itu adalah cobaan dari Allah, padahal apa yang ia duga tidak terjadi.",
      "text_translation": "Dia (Dawud) berkata, “Sungguh, dia telah berbuat zalim kepadamu dengan meminta kambingmu itu untuk (ditambahkan) kepada kambingnya. Memang banyak di antara orang-orang yang bersekutu itu berbuat zalim kepada yang lain, kecuali orang-orang yang beriman dan mengerjakan kebajikan; dan hanya sedikitlah mereka yang begitu.” Dan Dawud menduga bahwa Kami mengujinya; maka dia memohon ampunan kepada Tuhannya lalu menyungkur sujud dan bertobat.",
      "text": "قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ اِلٰى نِعَاجِهٖۗ وَاِنَّ كَثِيْرًا مِّنَ الْخُلَطَاۤءِ لَيَبْغِيْ بَعْضُهُمْ عَلٰى بَعْضٍ اِلَّا الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَقَلِيْلٌ مَّا هُمْۗ وَظَنَّ دَاوٗدُ اَنَّمَا فَتَنّٰهُ فَاسْتَغْفَرَ رَبَّهٗ وَخَرَّ رَاكِعًا وَّاَنَابَ ۩ ",
      "text_translation_en": "Said [David]: “He has certainly wronged thee by demanding that thy ewe be added to his ewes! Thus, behold, do many kinsmen wrong one another [all] save those who believe [in God] and do righteous deeds: but how few are they!” And [suddenly] David understood that We had tried him: and so he asked his Sustainer to forgive him his sin, and fell down in prostration, and turned unto Him in repentance.",
      "juz_number": 23
    },
    "25": {
      "text_tafsir_en": "God then explained that He had forgiven David for the error he had realized. God values the high awareness of the events he experiences, and the sharpness of his conscience towards what is moving in his heart and his obedience to God, as a sign that he is close to God. The servant of God is the one who deserves a good return, a Na'im paradise full of enjoyment.",
      "text_tafsir": "Kemudian Allah menjelaskan bahwa Dia telah memberikan ampun kepada Daud atas kesalahan yang ia sadari. Allah menilai bahwa kesadaran yang tinggi terhadap peristiwa yang ia hayati, dan ketajaman nuraninya terhadap apa yang tergerak dalam hatinya serta taatnya kepada Allah, sebagai tanda bahwa ia mempunyai kedudukan yang dekat pada sisi Allah. Hamba Allah seperti dialah yang berhak mendapat tempat kembali yang baik, yaitu surga Na'im yang penuh dengan kenikmatan.",
      "text_translation": "Lalu Kami mengampuni (kesalahannya) itu. Dan sungguh, dia mempunyai kedudukan yang benar-benar dekat di sisi Kami dan tempat kembali yang baik.",
      "text": "فَغَفَرْنَا لَهٗ ذٰلِكَۗ وَاِنَّ لَهٗ عِنْدَنَا لَزُلْفٰى وَحُسْنَ مَاٰبٍ",
      "text_translation_en": "And thereupon We forgave him that [sin]: and, verily, nearness to Us awaits him [in the life to come], and the most beauteous of all goals!",
      "juz_number": 23
    },
    "26": {
      "text_tafsir_en": "In this verse, God describes the appointment of David as the ruler and lawgiver among his people. God declared that he appointed David as the ruler over his people. The meaning of the ruler expressed by the caliph, meaning his successor, is a signal that David in exercising his power is always adorned with good manners, approved by God, and in carrying out the rules that should be guided by Allah's guidance. Thus, the nature of the caliphate of God is reflected in his personality. His people will surely obey all his rules and behaviors. God further explained that He told David to make a decision on what was to happen to man with a just decision by following the revelation that was revealed to him. In that vision there is a law that governs the well-being of men on earth and their happiness in the hereafter. Therefore, God forbade David to direct his passion in carrying out all matters relating to the well-being and happiness of man in the world and in the hereafter. In this verse there is a gesture that indicates the appointment of David as an apostle and what tasks a messenger should teach that would later teach the leaders in exercising his leadership. At the end of the verse Allah explains the consequences of those who obey their desires and what punishment they deserve. Obeying one's passions causes one to lose consciousness. Thus, he loses his personal control so that he is lost from the path that God has established. Then when the error had engulfed a person's heart, he had forgotten the conviction that was in his heart that in his power there was still more power. That is why those who obey their passions are threatened with harsh threats, which they will experience in the day of vengeance, the day when all human deeds are counted for a fair reward.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan pengangkatan Nabi Daud sebagai penguasa dan penegak hukum di kalangan rakyatnya. Allah menyatakan bahwa dia mengangkat Daud sebagai penguasa yang memerintah kaumnya. Pengertian penguasa diungkapkan dengan khalifah, yang artinya pengganti, adalah sebagai isyarat agar Daud dalam menjalankan kekuasaannya selalu dihiasi dengan sopan-santun yang baik, yang diridai Allah, dan dalam melaksanakan peraturan hendaknya berpedoman kepada hidayah Allah. Dengan demikian, sifat-sifat khalifah Allah tercermin pada diri pribadinya. Rakyatnya pun tentu akan menaati segala peraturannya dan tingkah lakunya yang patut diteladani.\n\nSelanjutnya Allah menjelaskan bahwa Dia menyuruh Nabi Daud agar memberi keputusan terhadap perkara yang terjadi antara manusia dengan keputusan yang adil dengan berpedoman pada wahyu yang diturunkan kepadanya. Dalam wahyu itu terdapat hukum yang mengatur kesejahteraan manusia di dunia dan kebahagiaan mereka di akhirat. Oleh sebab itu Allah melarang Nabi Daud memperturutkan hawa nafsunya dalam melaksanakan segala macam urusan yang berhubungan dengan kesejahteraan dan kebahagiaan manusia di dunia dan akhirat.\n\nPada ayat ini terdapat isyarat yang menunjukkan pengangkatan Daud sebagai rasul dan tugas-tugas apa yang seharusnya dilakukan oleh seorang rasul yang mengandung pelajaran bagi para pemimpin sesudahnya dalam melaksanakan kepemimpinannya.\n\nPada akhir ayat Allah menjelaskan akibat dari orang yang memperturutkan hawa nafsu dan hukuman apa yang pantas dijatuhkan kepadanya.\n\nMemperturutkan hawa nafsu menyebabkan seseorang kehilangan kesadaran. Dengan demikian, ia akan kehilangan kontrol pribadi sehingga ia tersesat dari jalan yang diridai Allah. Kemudian apabila kesesatan itu telah menyelubungi hati seseorang, ia lupa akan keyakinan yang melekat dalam hatinya bahwa di atas kekuasaannya masih ada yang lebih berkuasa. Itulah sebabnya orang yang memperturutkan hawa nafsu itu diancam dengan ancaman yang keras, yang akan mereka rasakan deritanya di hari pembalasan, hari diperhitungkannya seluruh amal manusia guna diberi balasan yang setimpal.",
      "text_translation": "(Allah berfirman), “Wahai Dawud! Sesungguhnya engkau Kami jadikan khalifah (penguasa) di bumi, maka berilah keputusan (perkara) di antara manusia dengan adil dan janganlah engkau mengikuti hawa nafsu, karena akan menyesatkan engkau dari jalan Allah. Sungguh, orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan.”",
      "text": "يٰدَاوٗدُ اِنَّا جَعَلْنٰكَ خَلِيْفَةً فِى الْاَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوٰى فَيُضِلَّكَ عَنْ سَبِيْلِ اللّٰهِ ۗاِنَّ الَّذِيْنَ يَضِلُّوْنَ عَنْ سَبِيْلِ اللّٰهِ لَهُمْ عَذَابٌ شَدِيْدٌ ۢبِمَا نَسُوْا يَوْمَ الْحِسَابِ ࣖ ",
      "text_translation_en": "[And We said:] “O David! Behold, We have made thee a [prophet and, thus, Our] vicegerent on earth: judge, then, between men with justice, and do not follow vain desire, lest it lead thee astray from the path of God: verily, for those who go astray from the path of God there is suffering severe in store for having forgotten the Day of Reckoning!”",
      "juz_number": 23
    },
    "27": {
      "text_tafsir_en": "God explains that He created the heavens, the earth, and everything in them, in vain. The sky with all the decorative stars, the sun that shines in the daytime, and the moon that changes its shape from night to night, are of great benefit to mankind. Likewise the earth with all its contents, whether visible on the surface or stored in its stomach, is of great significance to human life. All of this was created by God in His power and will as a priceless grace. If one were to pay close attention to the creatures of this universe, he must have known that all beings were subject and obedient to the conditions that were inescapable. The same is true of human creation. They cannot escape the terms of God, as soon as birth is subject to the force of the earth, they breathe in acid and so on. No human has ever strayed from this provision. As he matures, he needs a life partner to fill his soul, and to fulfill his purpose, he develops a lineage. Then when death came, it returned to its original state. He will be resurrected in the hereafter, to be responsible for all his deeds while on earth. Allah says: And fear the day when you will all be returned to Allah. Then each person will be rewarded according to what he has done, and they will not be harmed. (al-Baqarah \/ 2: 281) If man were to think clearly and earnestly, he would have acknowledged the oneness and power of God over all that is in the heavens, the earth, and all that is between them. When a man acknowledges God's sovereignty, he must acknowledge his power to send revelation to his chosen servant. Then Allah explained the attitude of the infidels of Mecca. They do not pay attention to the signs of God's sovereignty in the heavens and the earth, nor do they consider the great signs of God in themselves. That is why they deny the oneness of God and the Day of Resurrection. Allah says: And it is not We that playfully create the heavens and the earth and what is between them. We did not create them except with the truth, but most of them did not know. (ad-Dukhan \/ 44: 38-39) And He says: Do you think that We created you to mock and that you would not be returned to Us? (al-Mu'minun \/ 23: 115) At the end of the verse, Allah asserts that they will come to a different reality than they had expected in life on earth. They will feel the hell of hell that is a punishment for them, in return for their disobedience to Allah, the truth of revelation, and the day of resurrection.",
      "text_tafsir": "Allah menjelaskan bahwa Dia menjadikan langit, bumi, dan makhluk apa saja yang berada di antaranya, tidak sia-sia. Langit dengan segala bintang yang menghiasi, matahari yang memancarkan sinarnya di waktu siang, dan bulan yang menampakkan bentuknya yang berubah-ubah dari malam ke malam, sangat bermanfaat bagi manusia. Begitu juga bumi dengan segala isinya, baik yang tampak di permukaan ataupun yang tersimpan dalam perutnya, sangat besar artinya bagi kehidupan manusia. Semua itu diciptakan Allah atas kekuasaan dan kehendak-Nya sebagai rahmat yang tak ternilai harganya. \n\nApabila orang mau memperhatikan dengan seksama terhadap makhluk-makhluk yang ada di jagat raya ini, pasti ia mengetahui bahwa semua makhluk yang ada itu tunduk dan taat pada ketentuan-ketentuan yang berlaku, yang tak bisa dihindari. Begitu juga dalam hal penciptaan manusia. Mereka ini tidak dapat melepaskan diri dari ketentuan-ketentuan Allah, begitu lahir sudah tunduk pada gaya tarik bumi, ia bernafas dengan zat asam dan sebagainya. Tidak pernah ada manusia yang menyimpang dari ketentuan ini. Apabila ia dewasa, ia memerlukan kawan hidup untuk mengisi kekosongan jiwanya, dan untuk melaksanakan tujuan hidupnya ia mengembangkan keturunan. Kemudian kalau ajal telah datang, ia kembali ke asalnya. Ia akan dihidupkan kembali di akhirat, guna mempertanggungjawabkan segala amalnya ketika hidup di dunia.\n\nAllah berfirman:\n\nDan takutlah pada hari (ketika) kamu semua dikembalikan kepada Allah. Kemudian setiap orang diberi balasan yang sempurna sesuai dengan apa yang telah dilakukannya, dan mereka tidak dizalimi (dirugikan). (al-Baqarah\/2: 281)\n\nJika manusia berpikir dengan jernih dan sungguh-sungguh, tentu akan mengakui keesaan dan kekuasaan Allah terhadap semua yang ada di langit, bumi, serta segala makhluk yang ada di antara keduanya. Apabila manusia mengakui kemahakuasaan Allah, tentulah akan mengakui pula kekuasaan-Nya menurunkan wahyu kepada hamba pilihan-Nya.\n\nLalu Allah menjelaskan sikap orang-orang kafir Mekah. Mereka tidak mau memperhatikan tanda-tanda kekuasaan Allah yang ada di langit dan bumi, dan juga tidak mau meneliti tanda kebesaran Allah yang ada pada diri mereka sendiri. Itulah sebabnya mereka mendustakan keesaan Allah dan hari kebangkitan.\n\nAllah berfirman:\n\nDan tidaklah Kami bermain-main menciptakan langit dan bumi dan apa yang ada di antara keduanya. Tidaklah Kami ciptakan keduanya melainkan dengan haq (benar), tetapi kebanyakan mereka tidak mengetahui. (ad-Dukhan\/44: 38-39)\n\nDan firman-Nya:\n\nMaka apakah kamu mengira, bahwa Kami menciptakan kamu main-main (tanpa ada maksud) dan bahwa kamu tidak akan dikembalikan kepada Kami? (al-Mu'minun\/23: 115)\n\nPada penghujung ayat, Allah menegaskan bahwa mereka akan mendapatkan kenyataan yang berbeda dengan apa yang mereka duga selama hidup di dunia. Mereka akan merasakan neraka wail yang memang disediakan sebagai azab bagi mereka, sebagai balasan yang setimpal atas keingkaran mereka terhadap keesaan Allah, kebenaran wahyu, dan terjadinya hari kebangkitan.",
      "text_translation": "Dan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan sia-sia. Itu anggapan orang-orang kafir, maka celakalah orang-orang yang kafir itu karena mereka akan masuk neraka.",
      "text": "وَمَا خَلَقْنَا السَّمَاۤءَ وَالْاَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا ۗذٰلِكَ ظَنُّ الَّذِيْنَ كَفَرُوْا فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا مِنَ النَّارِۗ",
      "text_translation_en": "AND [thus it is:] We have not created heaven and earth and all that is between them without meaning and purpose, as is the surmise of those who are bent on denying the truth: but then, woe from the fire [of hell] unto all who are bent on denying the truth!",
      "juz_number": 23
    },
    "28": {
      "text_tafsir_en": "In this verse, God explains that in His wisdom is not to treat His servants as good, with those who fall into the valley of transgression. It is not proper for the substance of God in all His glory to be considered equal among His faithful servants and to do good with those who disobey His will and obey their desires. The believers referred to in this verse are those who believe that God is One, needing no ally in the exercise of His power and will. It is in this belief that they realize and do what they are supposed to do to each other and to their Creator. With that same conviction, they obeyed His command given through His apostles and abstained from all His prohibitions. They always try their best to keep their souls clean from the stains they stain. Allah says: And it will be taken away from him (the Fire) the most fearful, who will treasure his goods (in the way of Allah) to purify (him), and no one will give him any favor. (al-Lail \/ 92: 17-19) What is meant by those who do evil on earth is those who refuse to obey the truth and always follow their desires. They do not want to acknowledge the oneness of God, the truth of revelation, and the day of resurrection and retribution. Therefore, those who are far from the mercy of God, dare to violate His restrictions. They do not believe that they will be resurrected from their graves, they will still be gathered in the Field of Empress to take responsibility for their deeds. Allah says: And every man has We (his) deeds put on his neck. And on the Day of Judgment We have brought forth a book in openness. \"Read your book, just be yourself today as a count on yourself.\" (al-Isra '\/ 17: 13-14) When one of God's servants is rewarded for his good deeds in the world, and is tormented by his evil deeds, it is in accordance with the wisdom and wisdom of God. He has given them understanding so that they may know how great the favor of God has been given to them. However, they do not want to make good use of that sense, so they do not appreciate it, but they reject it. God also sent His Messenger to guide them to the right path. The apostle's counsel and guidance were not only ignored, but they were disowned.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan bahwa di antara kebijaksanaan-Nya ialah tidak menganggap sama para hamba-Nya yang melakukan kebaikan, dengan orang-orang yang terjerumus ke dalam lembah kemaksiatan. Tidak patut bagi zat Allah dengan segala keagungan-Nya, apabila menganggap sama antara hamba-hamba-Nya yang beriman dan melakukan kebaikan dengan orang-orang yang mengingkari keesaan-Nya lagi memperturutkan hawa nafsunya.\n\nOrang-orang yang beriman yang dimaksud dalam ayat ini ialah orang-orang yang meyakini bahwa Allah Maha Esa, tidak memerlukan sekutu dalam melaksanakan kekuasaan dan kehendak-Nya. Atas keyakinan itulah mereka menyadari dan melaksanakan apa yang seharusnya diperbuat terhadap sesamanya dan kepada Penciptanya. Dengan keyakinan itu pula, mereka menaati perintah Khaliknya yang disampaikan melalui rasul-Nya dan menjauhi segala larangan-Nya. Mereka selalu berusaha keras memelihara kebersihan jiwanya dari noda-noda yang mengotorinya.\n\nAllah berfirman:\n\nDan akan dijauhkan darinya (neraka) orang yang paling bertakwa, yang menginfakkan hartanya (di jalan Allah) untuk membersihkan (dirinya), dan tidak ada seorang pun memberikan suatu nikmat padanya yang harus dibalasnya. (al-Lail\/92: 17-19)\n\nSedang yang dimaksud dengan orang yang berbuat kerusakan di muka bumi ialah orang yang tidak mau mengikuti kebenaran dan selalu memperturutkan hawa nafsunya. Mereka ini tidak mau mengakui keesaan Allah, kebenaran wahyu, dan terjadinya hari kebangkitan dan pembalasan. Oleh karena itu, mereka yang jauh dari rahmat Allah, berani melanggar larangan-larangan-Nya. Mereka tidak meyakini bahwa mereka akan dibangkitkan kembali dari kuburnya, mereka tetap akan dihimpun di Padang Mahsyar untuk mempertanggungjawabkan amal perbuatannya.\n\nAllah berfirman:\n\nDan setiap manusia telah Kami kalungkan (catatan) amal perbuatannya di lehernya. Dan pada hari Kiamat Kami keluarkan baginya sebuah kitab dalam keadaan terbuka. \"Bacalah kitabmu, cukuplah dirimu sendiri pada hari ini sebagai penghitung atas dirimu.\" (al-Isra'\/17: 13-14)\n\nApabila ada di antara hamba Allah yang diberi pahala karena amal baiknya di dunia, dan disiksa akibat amal buruknya, hal itu sesuai dengan hikmat dan kebijaksanaan Allah. Dia telah memberikan akal agar mereka dapat mengetahui betapa luasnya nikmat Allah yang telah diberikan kepada mereka. Akan tetapi, mereka tidak mau mempergunakan akal itu sebaik-baiknya, sehingga mereka tidak mensyukuri nikmat itu, bahkan mereka mengingkarinya. Allah juga telah mengutus rasul-Nya untuk membimbing mereka kepada jalan yang benar. Petunjuk dan bimbingan rasul itu bukan saja tidak mereka hiraukan, tetapi malah mereka dustakan.",
      "text_translation": "Pantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan sama dengan orang-orang yang berbuat kerusakan di bumi? Atau pantaskah Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang jahat?",
      "text": "اَمْ نَجْعَلُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ كَالْمُفْسِدِيْنَ فِى الْاَرْضِۖ اَمْ نَجْعَلُ الْمُتَّقِيْنَ كَالْفُجَّارِ",
      "text_translation_en": "[For,] would We treat those who have attained to faith and do righteous deeds in the same manner as [We shall treat] those who spread corruption on earth? Would We treat the God-conscious in the same manner as the wicked?",
      "juz_number": 23
    },
    "29": {
      "text_tafsir_en": "Allah explained that He had sent down the Qur'an to the Messenger of Allah and his followers. The Qur'an is a perfect book containing guidance that is very beneficial to humanity. Guidance is guiding people to live in prosperity in the world and be happy in the hereafter. By contemplating its contents, humans will find ways to regulate the benefit of life in the world. Tamsil is like and the story of the previous people became a lesson in their life goals and away from obstacles and obstacles that prevent the achievement of life goals. The Qur'an was revealed with the intention to contemplate the contents of it, then to understand it with the correct understanding, then practiced as it should. The correct understanding is obtained by following the instructions of the apostles, assisted by the knowledge they have, whether related to language or the development of society. Likewise in exploring the instructions contained in the book, it should be based on the guidance of the apostles and try to enliven their experience with the knowledge of their experience and thoughts. Al-hasan al-Basri explained the meaning of this verse by saying, \"Many servants of Allah and children who do not understand the meaning of the Qur'an, even though they have read it by rote. They memorized it right so that no letters were left behind. But they ignored the provisions of the Qur'an until one of them said, \"By God I have read the Qur'an, so that not a single letter has been missed.\" In fact, such a person has missed the Qur'an. The whole Qur'an, because the influence of the Qur'an does not appear on him, both in manners and in his deeds, By Allah, what is the use of his memorizing each letter, as long as they disregard the provisions of Allah, they are not experts in wisdom and experts teaching provider. May Allah not increase the number of such people. \" Ibn Mas'ud said: People among us when learning ten verses of the Qur'an, they do not move to other verses, until they understand the contents of the ten verses and practice their contents. (History of Ahmad)",
      "text_tafsir": "Allah menjelaskan bahwa Dia telah menurunkan Al-Qur'an kepada Rasulullah saw dan para pengikutnya. Al-Qur'an itu adalah kitab yang sempurna mengandung bimbingan yang sangat bermanfaat kepada umat manusia. Bimbingan itu menuntun manusia agar hidup sejahtera di dunia dan berbahagia di akhirat. Dengan merenungkan isinya, manusia akan menemukan cara-cara mengatur kemaslahatan hidup di dunia. Tamsil ibarat dan kisah dari umat terdahulu menjadi pelajaran dalam menempuh tujuan hidup mereka dan menjauhi rintangan dan hambatan yang menghalangi pencapaian tujuan hidup. Al-Qur'an itu diturunkan dengan maksud agar direnungkan kandungan isinya, kemudian dipahami dengan pengertian yang benar, lalu diamalkan sebagaimana mestinya. Pengertian yang benar diperoleh dengan jalan mengikuti petunjuk-petunjuk rasul, dengan dibantu ilmu pengetahuan yang dimiliki, baik yang berhubungan dengan bahasa ataupun perkembangan masyarakat. Begitu pula dalam mendalami petunjuk-petunjuk yang terdapat dalam kitab itu, hendaknya dilandasi tuntunan rasul serta berusaha untuk menyemarakkan pengalamannya dengan ilmu pengetahuan hasil pengalaman dan pemikiran mereka.\n\nAl-hasan al-Bashri menjelaskan pengertian ayat ini dengan mengatakan, \"Banyak hamba Allah dan anak-anak yang tidak mengerti makna Al-Qur'an, walaupun telah membacanya di luar kepala. Mereka ini hafal betul hingga tak satu pun huruf yang ketinggalan. Namun mereka mengabaikan ketentuan-ketentuan Al-Qur'an itu hingga salah seorang di antara mereka mengatakan, \"Demi Allah saya telah membaca Al-Qur'an, hingga tak satu huruf pun yang kulewatkan.\" Sebenarnya orang yang seperti itu telah melewatkan Al-Qur'an seluruhnya, karena pengaruh Al-Qur'an tidak tampak pada dirinya, baik pada budi pekerti maupun pada perbuatannya. Demi Allah, apa gunanya ia menghafal setiap hurufnya, selama mereka mengabaikan ketentuan-ketentuan Allah. Mereka itu bukan ahli hikmat dan ahli pemberi pengajaran. Semoga Allah tidak memperbanyak jumlah orang yang seperti itu.\"\n\nIbnu Mas'ud mengatakan:Orang-orang di antara kami apabila belajar sepuluh ayat Al-Qur'an, mereka tidak pindah ke ayat lain, sampai memahami kandungan sepuluh ayat tersebut dan mengamalkan isinya.(Riwayat A.hmad)",
      "text_translation": "Kitab (Al-Qur'an) yang Kami turunkan kepadamu penuh berkah agar mereka menghayati ayat-ayatnya dan agar orang-orang yang berakal sehat mendapat pelajaran.",
      "text": "كِتٰبٌ اَنْزَلْنٰهُ اِلَيْكَ مُبٰرَكٌ لِّيَدَّبَّرُوْٓا اٰيٰتِهٖ وَلِيَتَذَكَّرَ اُولُوا الْاَلْبَابِ",
      "text_translation_en": "[All this have We expounded in this] blessed divine writ which We have revealed unto thee, [O Muhammad,] so that men may ponder over its mes­sages, and that those who are endowed with insight may take them to heart.",
      "juz_number": 23
    },
    "30": {
      "text_tafsir_en": "God explained that in addition to David being given glory and power, he was also given a righteous son, who had the ability to carry on his struggle, Solomon. He inherited his father's qualities. He is known as a devout servant and in all things he is always grateful to God. He is convinced that all these pleasures and beauties exist only because of the abundance of God's grace and grace. That is why he is called the best servant of God, and the praise that is due him. God has made him His obedient servant. Thus God appointed Solomon to be the prophet of the prophetic succession and kingdom of David, and to inherit his knowledge found in the Book of Psalms. God said: And Solomon had inherited David. (an-Naml \/ 27: 16)",
      "text_tafsir": "Allah menjelaskan bahwa di samping Daud yang dianugerahi kemuliaan dan kekuasaan, dia juga dianugerahi putra yang saleh, yang mempunyai kemampuan melanjutkan perjuangannya, yaitu Sulaiman. Ia mewarisi sifat-sifat ayahnya. Ia terkenal sebagai hamba yang taat beribadah dan dalam segala urusan ia selalu bersyukur kepada Allah. Ia yakin bahwa segala macam kenikmatan dan keindahan itu terwujud hanyalah semata-mata karena limpahan rahmat Allah dan karunia-Nya. Itulah sebabnya ia disebut sebagai hamba Allah yang paling baik, dan sebagai pujian yang pantas diberikan kepadanya. Allah menyifatinya sebagai hamba-Nya yang amat taat kepada-Nya. Dengan demikian Allah mengangkat Nabi Sulaiman menjadi nabi penerus kenabian dan kerajaan Nabi Daud, serta mewarisi ilmu pengetahuannya yang tertuang dalam Kitab Zabur.\n\nAllah berfirman:\n\nDan Sulaiman telah mewarisi Daud. (an-Naml\/27: 16)",
      "text_translation": "Dan kepada Dawud Kami karuniakan (anak bernama) Sulaiman; dia adalah sebaik-baik hamba. Sungguh, dia sangat taat (kepada Allah).",
      "text": "وَوَهَبْنَا لِدَاوٗدَ سُلَيْمٰنَۗ نِعْمَ الْعَبْدُ ۗاِنَّهٗٓ اَوَّابٌۗ",
      "text_translation_en": "AND UNTO DAVID We granted Solomon [as a son - and] how excellent a servant [of Ours he grew up to be]! Behold, he would always turn unto Us -",
      "juz_number": 23
    },
    "31": {
      "text_tafsir_en": "God mentioned one of the events that faced Solomon, which caused him to deserve praise. The incident occurred when he examined the cavalry which was usually carried out in the afternoon. The horses are trained in order to know the dexterity and ability to move to make it possible to be carried on the battlefield. Also trained in its ability to reduce speed or stop instantly and increased endurance against sudden attacks. The horses are trained in such a way that they can be controlled according to the tactics desired by the forces that drive them. Horse agility determines the success or failure of troops in controlling the battlefield and break enemy attacks",
      "text_tafsir": "Allah menyebutkan salah satu di antara peristiwa yang dihadapi Sulaiman, yang menyebabkan dia pantas mendapat pujian. Peristiwa itu terjadi pada saat beliau memeriksa pasukan berkuda yang biasanya dilakukan pada sore hari. Kuda-kuda itu dilatih agar dapat diketahui ketangkasan dan kemampuan geraknya sehingga memungkinkan untuk dibawa dalam medan pertempuran. Juga dilatih kemampuannya untuk mengurangi kecepatannya atau berhenti seketika dan ditingkatkan daya tahannya menghadapi serangan-serangan mendadak. Kuda-kuda itu dilatih sedemikian rupa agar dapat dikendalikan sesuai dengan taktik yang dikehendaki oleh pasukan yang mengendarainya. Ketangkasan kuda ikut menentukan berhasil tidaknya pasukan dalam menguasai medan perang dan mematahkan serangan musuh",
      "text_translation": "(Ingatlah) ketika pada suatu sore dipertunjukkan kepadanya (kuda-kuda) yang jinak, (tetapi) sangat cepat larinya,",
      "text": "اِذْ عُرِضَ عَلَيْهِ بِالْعَشِيِّ الصّٰفِنٰتُ الْجِيَادُۙ",
      "text_translation_en": "[and even] when, towards the close of day, nobly-bred, swift-footed steeds were brought before him,",
      "juz_number": 23
    },
    "32": {
      "text_tafsir_en": "Then God explained Solomon's condition when watching the horse training. He said he liked horses because it was very useful to use as a means of upholding the truth and defending the religion of God. His enjoyment of training the horse was so great that every evening he visited the horse training grounds until sunset in the western skyline until the sunlight began to fade, and the darkness of night blocked the view of the exercise. In those times of turmoil in itself, which interests should come first between the two interests. The first importance is the awareness of his soul in worshiping God. The second importance is to train horses for the sake of upholding the truth and defending monotheistic sentences. In that situation, he realized that when he saw the horse training until late at night, he was neglecting to worship. In this verse it is not stated in detail whether Solomon's pleasure in examining the horse's training caused him to lose his time in worship or not. Similarly, Solomon did not explain, examine horse training or perform worship. But what can be understood from the verse is that as he continues to watch the horse training, his heart is drawn to the worship of God, when his obedience is obeyed, and it lasts until he has lost the opportunity to worship God. The point that should be taken from this verse is that the turmoil that occurred to Solomon was remorse for not worshiping God in the early days, for he was busy watching horse training. Then he realized and implemented it at the end of time.",
      "text_tafsir": "Kemudian Allah menjelaskan keadaan Sulaiman pada saat menyaksikan latihan kuda itu. Ia mengatakan bahwa ia menyukai kuda karena sangat berguna untuk digunakan sebagai alat menegakkan kebenaran dan membela agama Allah. Kesenangannya melatih kuda itu sedemikian dalamnya, sehingga tiap sore hari ia mengunjungi tempat latihan kuda hingga matahari terbenam di ufuk langit bagian barat yaitu hingga cahaya matahari mulai sirna, dan gelapnya malam menghalangi pemandangannya untuk menyaksikan latihan itu. Pada saat-saat itulah terjadi pergolakan dalam dirinya, kepentingan manakah yang harus didahulukan di antara kedua kepentingan. Kepentingan pertama ialah kesadaran jiwanya untuk beribadah kepada Allah. Sedangkan kepentingan kedua ialah melatih kuda untuk kepentingan menegakkan kebenaran dan membela kalimat tauhid. Dalam keadaan seperti itu, ia menyadari bahwa apabila ia menyaksikan latihan berkuda itu hingga larut malam, berarti ia mengabaikan ibadah yang harus ia lakukan.\n\nPada ayat ini tidak dijelaskan secara terperinci apakah kesenangan Sulaiman memeriksa latihan kuda itu menyebabkan ia kehilangan waktu untuk melakukan ibadah atau tidak. Begitu pula tidak diterangkan mana yang didahulukan oleh Sulaiman, memeriksa latihan kuda atau melaksanakan ibadah. Namun yang dapat dipahami dari ayat tersebut ialah pada saat dia asyik menyaksikan latihan kuda, terbetiklah dalam hatinya kesadaran beribadah kepada Allah, apabila keasyikannya itu dituruti, niscaya berlarut-larut hingga kehilangan kesempatan untuk bermunajat dengan Allah. Maka pengertian yang patut diambil dari ayat ini ialah, pergolakan yang terjadi pada diri Sulaiman itu ialah penyesalan karena tidak melakukan ibadah kepada Allah pada awal waktunya, karena sibuk menyaksikan latihan kuda. Kemudian ia sadar dan melaksanakannya di akhir waktu.",
      "text_translation": "maka dia berkata, “Sesungguhnya aku menyukai segala yang baik (kuda), yang membuat aku ingat akan (kebesaran) Tuhanku, sampai matahari terbenam.”",
      "text": "فَقَالَ اِنِّيْٓ اَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّيْۚ حَتّٰى تَوَارَتْ بِالْحِجَابِۗ",
      "text_translation_en": "he would say, “Verily, I have come to love the love of all that is good because I bear my Sustainer in mind!” [repeating these words as the steeds raced away,] until they were hidden by the veil [of distance - whereupon he would command],",
      "juz_number": 23
    },
    "33": {
      "text_tafsir_en": "In this verse, God explains what Solomon told his horsemen to do. He told his trainer to bring the horses back to him. Once the trainer brought him a horse, he approached. Then he rubbed the horse's feet and neck as a sign of Solomon's satisfaction in the splendid results of the horses. Thus the horse can be used in battle to defeat the enemy or to prevent sudden enemy attacks. From this description it can be said that Solomon's godly, devout, meticulous, and conscientious servant planned the struggle to uphold the words of monotheism and to have a high degree of awareness in deciding which was more important.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan apa yang diperintahkan Sulaiman kepada para pelatih kudanya. Ia menyuruh pelatihnya agar kuda-kuda itu dibawa kembali kepadanya. Setelah pelatih itu membawa kuda kepadanya, ia pun mendekati. Lalu ia mengusap kaki dan leher kuda sebagai tanda kepuasan Sulaiman terhadap hasil gemilang yang dicapai kuda-kuda itu. Dengan demikian kuda itu dapat dipergunakan dalam peperangan untuk menggempur musuh atau untuk mengelakkan serangan-serangan musuh yang datang secara mendadak.\n\nDari uraian tersebut dapat dikatakan bahwa Sulaiman hamba Allah yang saleh, taat beribadah, teliti, dan cermat merencanakan perjuangan untuk menegakkan kalimat tauhid serta mempunyai kesadaran yang tinggi dalam saat-saat menentukan mana yang lebih penting dari yang penting.",
      "text_translation": "”Bawalah semua kuda itu kembali kepadaku.” Lalu dia mengusap-usap kaki dan leher kuda itu.",
      "text": "رُدُّوْهَا عَلَيَّ ۚفَطَفِقَ مَسْحًا ۢبِالسُّوْقِ وَالْاَعْنَاقِ",
      "text_translation_en": "“Bring them back unto me!”- and would [lovingly] stroke their legs and their necks.",
      "juz_number": 23
    },
    "34": {
      "text_tafsir_en": "Then God explained Solomon's condition at the time of the trial and his condition after the end of the trial. God is trying it out with a lot of pain. So great was the attack of his illness that it lost all strength. Her body was weak and lying on her chair as if it were lifeless. Abu Hurairah narrated that the Prophet (saws) said: \"I will go around tonight to gather ninety wives, all of whom will give birth to children who are skilled in horseback riding and jihad fi sabilillah\". And one of his friends said to him. \"Say the insha Allah\", but Prophet Solomon did not say the insha Allah. Solomon then raised all his wives, but none of them became pregnant except a wife, who later gave birth to an imperfect child. For the sake of the Substance in Muhammad, \"If Prophet Solomon said God willing, he would give birth to children who were capable of riding horses and fighting jihad fi sabilillah.\" The trial was about the desire of Solomon to visit his ninety wives in one night and each of them gave birth to a horseman. However, he did not speak the will of God, so God tested him by trying that no one gave birth except for one person and gave birth to a paralyzed baby and placed on Solomon's throne. In times of such trials, he always raised his hope to God and surrendered his heart to such trials. At the end of the verse, God affirmed that Solomon then repented of his weaknesses and surrendered to God.",
      "text_tafsir": "Kemudian Allah menjelaskan keadaan Sulaiman pada saat mendapat cobaan dan keadaannya setelah selesai menghadapi cobaan itu. Allah mencobanya dengan menimpakan sakit keras. Demikian hebatnya serangan penyakitnya itu hingga kehilangan kekuatan sama sekali. Badannya lemah lunglai tergeletak di atas kursinya seolah-olah tak bernyawa lagi.\n\nAbu Hurairah meriwayatkan bahwa Nabi saw bersabda: \n\nNabi Sulaiman berkata, \"Saya akan berkeliling malam ini untuk mengumpuli sembilan puluh istri, semuanya nanti akan melahirkan anak yang mahir menunggang kuda dan berjihad fi sabilillah\". Maka seorang sahabatnya berkata kepadanya. \"Katakan insya Allah\", tetapi Nabi Sulaiman tidak mengatakan insya Allah. Nabi Sulaiman kemudian mengumpuli istri-istrinya itu semua, tetapi tidak ada yang hamil dari mereka kecuali seorang istri, yang kemudian melahirkan anak yang tidak sempurna. Demi Zat yang menguasai diri Muhammad, \"Seandainya Nabi Sulaiman mengatakan insya Allah, niscaya semua istrinya melahirkan anak-anak yang mahir menunggang kuda dan berjihad fi sabilillah\".(Riwayat al-Bukhari dan Muslim dari Abu Hurairah) \n\nKeterangan lain menjelaskan bahwa yang dimaksud dengan cobaan itu ialah berkenaan dengan keinginan Nabi Sulaiman mendatangi sembilan puluh istrinya dalam satu malam dan setiap istrinya melahirkan seorang penunggang kuda. Namun, ia tidak mengucapkan insya Allah, sehingga Allah mengujinya dengan cobaan tidak ada yang melahirkan kecuali hanya satu orang dan melahirkan bayi lumpuh setengah badan dan diletakkan di atas kursi Nabi Sulaiman.\n\nDi saat-saat menerima cobaan seperti itu, ia selalu memanjatkan harapannya kepada Allah serta penyerahan dirinya menerima cobaan itu dengan ikhlas. Pada penghujung ayat, Allah menegaskan bahwa Sulaiman lalu bertobat meminta ampun atas kelemahan-kelemahan yang ada pada dirinya serta berserah diri kepada Allah.",
      "text_translation": "Dan sungguh, Kami telah menguji Sulaiman dan Kami jadikan (dia) tergeletak di atas kursinya sebagai tubuh (yang lemah karena sakit), kemudian dia bertobat.",
      "text": "وَلَقَدْ فَتَنَّا سُلَيْمٰنَ وَاَلْقَيْنَا عَلٰى كُرْسِيِّهٖ جَسَدًا ثُمَّ اَنَابَ",
      "text_translation_en": "But [ere this], indeed, We had tried Solomon by placing upon his throne a [lifeless] body; and thereupon he turned [towards Us; and]",
      "juz_number": 23
    },
    "35": {
      "text_tafsir_en": "God then explained that after Solomon had recovered from his illness, he had realized his weakness. He chose the less important. She lost her prime time to worship because of watching horse training. Then Solomon prayed to Allah for a kingdom of incomparable quality, which no one after him would have. In the hadith of the Prophet (may peace be upon him), it is narrated: The Prophet (may peace be upon him) said: Ifrit from the genie spit on me last night to cancel my prayer but Allah gave me strength so that I could catch it. I meant to tie it to one of the pillars of the mosque so you could see it. But I was reminded of my brother Solomon's prayer, \"O God, forgive me, and give me strength that is not good enough for me to give after me.\" So I drove him away. (Al-Bukhari and Muslim history) Prophet Solomon was raised in a royal and prophetic environment. From childhood he was trained as the son of a king and a prophet. Solomon also inherited his ability and God also gave him that ability. That is why God bestowed upon him a very powerful kingdom and a wealth of riches, incomparable. At the end of the verse Allah mentions the reason Solomon proposes in his prayer is that Allah will truly grant the prayer of every person with the effort and conditions of ability available to him according to His will.",
      "text_tafsir": "Allah lalu menjelaskan bahwa setelah Sulaiman sembuh dari sakitnya, ia menyadari kelemahan yang ada pada dirinya. Ia telah memilih hal yang kurang penting. Dia telah kehilangan waktu yang utama untuk melakukan ibadah karena menyaksikan latihan kuda.\n\nLalu Nabi Sulaiman berdoa kepada Allah agar dianugerahi kerajaan yang tidak ada tandingannya, yang tak akan dimiliki oleh seorang jua pun sesudahnya. Dalam hadis Nabi saw diriwayatkan:\n\nBahwa Nabi saw berkata: Bahwa Ifrit dari golongan jin meludahi aku tadi malam agar aku membatalkan salatku namun Allah memberikan kekuatan kepadaku sehingga aku dapat menangkap jin itu. Aku bermaksud untuk mengikatnya di satu tiang dari tiang-tiang masjid sehingga kamu dapat melihatnya. Tapi aku teringat doa saudaraku Sulaiman, \"Ya Allah ampunilah aku, dan berilah aku kekuatan yang tidak layak untuk diberikan kepada orang sesudahku\". Maka aku usir dia untuk menjauh.(Riwayat al-Bukhari dan Muslim) \n\nNabi Sulaiman dibesarkan dalam lingkungan kerajaan dan kenabian. Sejak kecil ia terlatih sebagai seorang anak dari seorang raja dan nabi. Sulaiman pun mewarisi kemampuan keduanya dan Allah juga menganugerahkan kepadanya kemampuan itu. Itulah sebabnya maka Allah menganugerahkan kepadanya kerajaan yang sangat kuat dan kekayaan yang berlimpah ruah, yang tiada tandingannya.\n\nDi akhir ayat Allah menyebutkan alasan yang dikemukakan Sulaiman dalam doanya yaitu karena Allah benar-benar akan mengabulkan doa setiap orang yang disertai usaha dan syarat kemampuan yang dimiliki sesuai dengan kehendak-Nya.",
      "text_translation": "Dia berkata, “Ya Tuhanku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak dimiliki oleh siapa pun setelahku. Sungguh, Engkaulah Yang Maha Pemberi.”",
      "text": "قَالَ رَبِّ اغْفِرْ لِيْ وَهَبْ لِيْ مُلْكًا لَّا يَنْۢبَغِيْ لِاَحَدٍ مِّنْۢ بَعْدِيْۚ اِنَّكَ اَنْتَ الْوَهَّابُ",
      "text_translation_en": "he prayed: “O my Sustainer! Forgive me my sins, and bestow upon me the gift of a kingdom which may not suit anyone after me: verily, Thou alone art a giver of gifts!”",
      "juz_number": 23
    },
    "36": {
      "text_tafsir_en": "In this verse, Allah explains some of the blessings given to the Prophet Solomon, in answer to his prayer. First: God bestows Solomon the power to subject the wind. With God's permission, the wind blows hard or graceful according to his will too. Allah says: And (We submit) to Solomon a very strong wind blows which blows with his orders to the land that We give him blessings. And we are all-knowing. (al-Anbiya '\/ 21: 81) Second: Allah bestows on him the ability to subdue demons who are builders and dive experts, who carry out their duties according to Sulaiman's orders. If he orders them to build a building such as palace meetinghouses, fortresses, or buildings where Sulaiman's assets are kept and so on, then that task can be completed in a very short time. If Sulaiman ordered them to collect pearls and marjans and other marine wealth, the task could be quickly completed as well. Third: God bestows on him the power to subdue demons who oppose his orders. Their hands and feet are bound in shackles, so as not to be harmful to others, and as a punishment for defiance. The power given by God to Sulaiman to subdue demons means that the power is to move them to do heavy tasks, namely the task of building buildings, and diving to bring out the wealth of the sea. But there is no definite explanation about how Solomon shackles the devil. The most important attitude is that we accept the information contained in the Qur'an and to express its understanding, we leave it to science.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'\/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan.",
      "text_translation": "Kemudian Kami tundukkan kepadanya angin yang berhembus dengan baik menurut perintahnya ke mana saja yang dikehendakinya,",
      "text": "فَسَخَّرْنَا لَهُ الرِّيْحَ تَجْرِيْ بِاَمْرِهٖ رُخَاۤءً حَيْثُ اَصَابَۙ",
      "text_translation_en": "And so We made subservient to him the wind, so that it gently sped at his behest whithersoever he willed,",
      "juz_number": 23
    },
    "37": {
      "text_tafsir_en": "In this verse, Allah explains some of the blessings given to the Prophet Solomon, in answer to his prayer. First: God bestows Solomon the power to subject the wind. With God's permission, the wind blows hard or graceful according to his will too. Allah says: And (We submit) to Solomon a very strong wind blows which blows with his orders to the land that We give him blessings. And we are all-knowing. (al-Anbiya '\/ 21: 81) Second: Allah bestows on him the ability to subdue demons who are builders and dive experts, who carry out their duties according to Sulaiman's orders. If he orders them to build a building such as palace meetinghouses, fortresses, or buildings where Sulaiman's assets are kept and so on, then that task can be completed in a very short time. If Sulaiman ordered them to collect pearls and marjans and other marine wealth, the task could be quickly completed as well. Third: God bestows on him the power to subdue demons who oppose his orders. Their hands and feet are bound in shackles, so as not to be harmful to others, and as a punishment for defiance. The power given by God to Sulaiman to subdue demons means that the power is to move them to do heavy tasks, namely the task of building buildings, and diving to bring out the wealth of the sea. But there is no definite explanation about how Solomon shackles the devil. The most important attitude is that we accept the information contained in the Qur'an and to express its understanding, we leave it to science.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'\/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan.",
      "text_translation": "dan (Kami tundukkan pula kepadanya) setan-setan, semuanya ahli bangunan dan penyelam,",
      "text": "وَالشَّيٰطِيْنَ كُلَّ بَنَّاۤءٍ وَّغَوَّاصٍۙ",
      "text_translation_en": "as well as all the rebellious forces [that We made to work for him] - every kind of builder and diver -",
      "juz_number": 23
    },
    "38": {
      "text_tafsir_en": "In this verse, Allah explains some of the blessings given to the Prophet Solomon, in answer to his prayer. First: God bestows Solomon the power to subject the wind. With God's permission, the wind blows hard or graceful according to his will too. Allah says: And (We submit) to Solomon a very strong wind blows which blows with his orders to the land that We give him blessings. And we are all-knowing. (al-Anbiya '\/ 21: 81) Second: Allah bestows on him the ability to subdue demons who are builders and dive experts, who carry out their duties according to Sulaiman's orders. If he orders them to build a building such as palace meetinghouses, fortresses, or buildings where Sulaiman's assets are kept and so on, then that task can be completed in a very short time. If Sulaiman ordered them to collect pearls and marjans and other marine wealth, the task could be quickly completed as well. Third: God bestows on him the power to subdue demons who oppose his orders. Their hands and feet are bound in shackles, so as not to be harmful to others, and as a punishment for defiance. The power given by God to Sulaiman to subdue demons means that the power is to move them to do heavy tasks, namely the task of building buildings, and diving to bring out the wealth of the sea. But there is no definite explanation about how Solomon shackles the devil. The most important attitude is that we accept the information contained in the Qur'an and to express its understanding, we leave it to science.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'\/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan.",
      "text_translation": "dan (setan) yang lain yang terikat dalam belenggu.",
      "text": "وَّاٰخَرِيْنَ مُقَرَّنِيْنَ فِى الْاَصْفَادِ",
      "text_translation_en": "and others linked together in fetters.",
      "juz_number": 23
    },
    "39": {
      "text_tafsir_en": "Allah further explained that all kinds of blessings were gifts that He gave to Solomon specifically. Favors that include a large kingdom, abundant wealth and power that was never given to others. The favors were bestowed upon him to be used properly. God stressed that the favors were given to Solomon without accountability, because Sulaiman had been given the ability to control all kinds of favors.",
      "text_tafsir": "Allah selanjutnya menjelaskan bahwa segala macam nikmat itu adalah anugerah yang diberikan-Nya kepada Sulaiman secara khusus. Nikmat itu meliputi kerajaan yang besar, kekayaan yang berlimpah dan kekuasaan yang tak pernah diberikan kepada yang lain. Nikmat-nikmat itu dianugerahkan kepadanya agar digunakan sebagaimana mestinya.\n\nAllah menandaskan bahwa nikmat-nikmat itu diberikan kepada Sulaiman tanpa pertanggungjawaban, karena Sulaiman telah diberi kemampuan untuk mengendalikan segala macam nikmat itu.",
      "text_translation": "Inilah anugerah Kami; maka berikanlah (kepada orang lain) atau tahanlah (untuk dirimu sendiri) tanpa perhitungan.",
      "text": "هٰذَا عَطَاۤؤُنَا فَامْنُنْ اَوْ اَمْسِكْ بِغَيْرِ حِسَابٍ",
      "text_translation_en": "[And We told him:] “This is Our gift, for thee to bestow freely on others, or to withhold, without [having to render] account!”",
      "juz_number": 23
    },
    "40": {
      "text_tafsir_en": "God then explained that in addition to the glory he had achieved in the world, that was so wonderful, he would be endowed with a greater grace and a more noble position. God promised him that he would be included in the ranks of His servants who were very close to God, the position that the apostles and prophets had received, a good return home, a Na'im paradise full of all kinds of delights.",
      "text_tafsir": "Kemudian Allah menjelaskan bahwa di samping kemuliaan yang telah dicapainya di dunia, yang sangat menakjubkan itu, ia akan dilimpahi karunia yang lebih nikmat lagi dan kedudukannya yang lebih mulia. Allah menjanjikan kepadanya bahwa ia akan dimasukkan dalam deretan hamba-hamba-Nya yang mempunyai kedudukan yang sangat dekat kepada Allah, yaitu kedudukan yang diperoleh para rasul dan nabi, tempat kembali yang baik yaitu surga Na'im yang penuh dengan segala macam kenikmatan.",
      "text_translation": "Dan sungguh, dia mempunyai kedudukan yang dekat pada sisi Kami dan tempat kembali yang baik.",
      "text": "وَاِنَّ لَهٗ عِنْدَنَا لَزُلْفٰى وَحُسْنَ مَاٰبٍ ࣖ",
      "text_translation_en": "And, verily, nearness to Us awaits him [in the life to come], and the most beauteous of all goals!",
      "juz_number": 23
    },
    "41": {
      "text_tafsir_en": "Allah commanded the Messenger of Allah (may peace be upon him) to tell his people the story of Job, who was very patient in trying to live and obey God. In the face of such a terrible ordeal, he prays to God and pleads for his pain to be relieved. Some interpreters say that Job was a very rich prophet. He was a farmer and a keeper of livestock. In addition, he is also the leader of his people in a country located southeast of the Dead Sea. The country lies between the city of Adum and the Arabian desert, very fertile, overflowing with abundant springs. It lived between the days of Abraham and Moses. He has lived a prosperous and happy life, is very religious, and has many relatives. He was very happy with the results of his efforts, as well as his wealth, his family, and his health. Allah then wants to test his perseverance by inflicting a very severe skin disease. His illness was so severe that it took him a long time to recover his property, and his family traveled to surrounding countries in search of livelihood. In the midst of his misery, he felt very tired and suffering. He felt a demon teasing his soul while worshiping God. Then he asked God to give him instructions to free himself from the suffering and suffering he suffered. God said: And (remember) Job, when he prayed unto his Lord, \"(My Lord), indeed, I am afflicted, but Thou art the Most Merciful of all mercies.\" (al-Anbiya '\/ 21: 83)",
      "text_tafsir": "Allah memerintahkan kepada Rasulullah saw agar menceritakan kepada kaumnya kisah Ayub yang sangat sabar menghadapi cobaan hidup dan taat kepada Allah. Pada saat menghadapi cobaan yang sangat berat itu, ia berdoa kepada Allah dan mengadukan agar penderitaannya itu dihilangkan.\n\nBeberapa ahli tafsir menyebutkan bahwa Ayub adalah seorang nabi yang sangat kaya. Ia adalah seorang petani dan pemelihara ternak. Di samping itu, juga sebagai pemimpin kaumnya di sebuah negeri yang terletak di sebelah tenggara Laut Mati. Negerinya terletak di antara kota Adum dan padang pasir Arab, sangat subur, dialiri oleh mata air yang sangat banyak. Ia hidup di antara zaman Nabi Ibrahim dan Nabi Musa. Semula beliau hidup makmur dan bahagia, amat taat beragama, dan banyak sanak keluarganya. Ia sangat senang atas hasil usaha yang dicapainya, juga atas kekayaan, keluarga, dan kesehatannya. Allah lalu ingin menguji ketabahannya dengan menimpakan penyakit kulit yang sangat parah. Begitu berat penyakitnya dan begitu lama dideritanya hingga harta bendanya habis, dan keluarganya bertebaran ke negeri-negeri sekitarnya untuk mencari penghidupan. Di tengah-tengah penderitaannya itu, ia merasa sangat lelah dan menderita. Ia merasa ada setan yang mengusik jiwanya ketika beribadah kepada Allah. Lalu ia mengadukan kepada Allah agar diberi petunjuk untuk melepaskan dirinya dari penderitaan dan siksaan yang dialaminya.\n\nAllah berfirman:\n\nDan (ingatlah kisah) Ayub, ketika dia berdoa kepada Tuhannya, \"(Ya Tuhanku), sungguh, aku telah ditimpa penyakit, padahal Engkau Tuhan Yang Maha Penyayang dari semua yang penyayang.\" (al-Anbiya'\/21: 83)",
      "text_translation": "Dan ingatlah akan hamba Kami Ayyub ketika dia menyeru Tuhannya, “Sesungguhnya aku diganggu setan dengan penderitaan dan bencana.”",
      "text": "وَاذْكُرْ عَبْدَنَآ اَيُّوْبَۘ اِذْ نَادٰى رَبَّهٗٓ اَنِّيْ مَسَّنِيَ الشَّيْطٰنُ بِنُصْبٍ وَّعَذَابٍۗ",
      "text_translation_en": "AND CALL to mind Our servant Job, [how it was] when he cried out to his Sustainer, “Behold, Satan has afflicted me with [utter] weariness and suffering!”",
      "juz_number": 23
    },
    "42": {
      "text_tafsir_en": "This verse explains that because of Job's obedience and patience in the face of adversity, God answered his prayer by ordering him to lower his feet to the ground. Then from the earth it emits cold springs. Then Job was commanded to wash and drink with the water. At that moment, God healed his illness as if it had never been sick before. Then he brought his scattered family back together, and they were able to spread many descendants, as God's mercy to him and his descendants. At the end of the verse, God emphasizes that Job's obedience and patience are a lesson to the wise and a guide to all mankind that God's mercy is closest to those who always do good. It is also an example that every struggle may seem overwhelming at first, but when it is done with perseverance, it is possible to overcome all difficulties, and victory can be achieved. The valuable experience that can be drawn from the story of Job is that one should not give up trying to find a way out in the face of obstacles, until he can find a way to overcome it, by asking God to give him His guidance.",
      "text_tafsir": "Ayat ini menjelaskan bahwa karena ketaatan dan kesabaran Ayub menghadapi cobaan, Allah mengabulkan doanya dengan memerintahkan kepadanya agar menghentakkan kakinya ke bumi. Kemudian dari bumi itu memancar mata air yang sejuk. Lalu Ayub diperintahkan agar mandi dan minum dengan air itu. Seketika itu, Allah menyembuhkan penyakitnya seakan-akan tidak pernah sakit sebelumnya.\n\nKemudian ia menghimpun kembali keluarganya yang telah terpencar, dan mereka akhirnya dapat menyebarkan keturunan yang banyak, sebagai rahmat Allah kepadanya dan kepada keturunannya.\n\nPada akhir ayat, Allah menegaskan bahwa ketaatan dan kesabaran Ayub itu merupakan pelajaran bagi orang-orang yang berakal dan menjadi petunjuk bagi seluruh manusia bahwa rahmat Allah itu dekat sekali pada orang-orang yang senantiasa melakukan perbuatan yang baik. Hal ini juga menjadi contoh bahwa setiap perjuangan itu meskipun pada mulanya terasa sangat melelahkan, tetapi bila dilakukan dengan penuh ketabahan, niscaya segala kesulitan pasti dapat diatasi, dan kemenangan pasti dapat diraih. Pengalaman berharga yang dapat dipetik dari kisah Ayub ini ialah bahwa orang tidak boleh berputus asa untuk mencari jalan ke luar dalam menghadapi rintangan, hingga ia mendapatkan jalan untuk mengatasi rintangan itu, dengan memohon petunjuk kepada Allah agar diberi limpahan hidayah-Nya.",
      "text_translation": "Allah berfirman), “Hentakkanlah kakimu; inilah air yang sejuk untuk mandi dan untuk minum.”",
      "text": "اُرْكُضْ بِرِجْلِكَۚ هٰذَا مُغْتَسَلٌۢ بَارِدٌ وَّشَرَابٌ",
      "text_translation_en": "[and thereupon was told:] “Strike [the ground] with thy foot: here is cool water to wash with and to drink!”",
      "juz_number": 23
    },
    "43": {
      "text_tafsir_en": "This verse explains that because of Job's obedience and patience in the face of adversity, God answered his prayer by ordering him to lower his feet to the ground. Then from the earth it emits cold springs. Then Job was commanded to wash and drink with the water. At that moment, God healed his illness as if it had never been sick before. Then he brought his scattered family back together, and they were able to spread many descendants, as God's mercy to him and his descendants. At the end of the verse, God emphasizes that Job's obedience and patience are a lesson to the wise and a guide to all mankind that God's mercy is closest to those who always do good. It is also an example that every struggle may seem overwhelming at first, but when it is done with perseverance, it is possible to overcome all difficulties, and victory can be achieved. The valuable experience that can be drawn from the story of Job is that one should not give up trying to find a way out in the face of obstacles, until he can find a way to overcome it, by asking God to give him His guidance.",
      "text_tafsir": "Ayat ini menjelaskan bahwa karena ketaatan dan kesabaran Ayub menghadapi cobaan, Allah mengabulkan doanya dengan memerintahkan kepadanya agar menghentakkan kakinya ke bumi. Kemudian dari bumi itu memancar mata air yang sejuk. Lalu Ayub diperintahkan agar mandi dan minum dengan air itu. Seketika itu, Allah menyembuhkan penyakitnya seakan-akan tidak pernah sakit sebelumnya.\n\nKemudian ia menghimpun kembali keluarganya yang telah terpencar, dan mereka akhirnya dapat menyebarkan keturunan yang banyak, sebagai rahmat Allah kepadanya dan kepada keturunannya.\n\nPada akhir ayat, Allah menegaskan bahwa ketaatan dan kesabaran Ayub itu merupakan pelajaran bagi orang-orang yang berakal dan menjadi petunjuk bagi seluruh manusia bahwa rahmat Allah itu dekat sekali pada orang-orang yang senantiasa melakukan perbuatan yang baik. Hal ini juga menjadi contoh bahwa setiap perjuangan itu meskipun pada mulanya terasa sangat melelahkan, tetapi bila dilakukan dengan penuh ketabahan, niscaya segala kesulitan pasti dapat diatasi, dan kemenangan pasti dapat diraih. Pengalaman berharga yang dapat dipetik dari kisah Ayub ini ialah bahwa orang tidak boleh berputus asa untuk mencari jalan ke luar dalam menghadapi rintangan, hingga ia mendapatkan jalan untuk mengatasi rintangan itu, dengan memohon petunjuk kepada Allah agar diberi limpahan hidayah-Nya.",
      "text_translation": "Dan Kami anugerahi dia (dengan mengumpulkan kembali) keluarganya dan Kami lipatgandakan jumlah mereka, sebagai rahmat dari Kami dan pelajaran bagi orang-orang yang berpikiran sehat.",
      "text": "وَوَهَبْنَا لَهٗٓ اَهْلَهٗ وَمِثْلَهُمْ مَّعَهُمْ رَحْمَةً مِّنَّا وَذِكْرٰى لِاُولِى الْاَلْبَابِ",
      "text_translation_en": "And We bestowed upon him new offspring, doubling their number as an act of grace from Us, and as a reminder unto all who are endowed with insight.",
      "juz_number": 23
    },
    "44": {
      "text_tafsir_en": "Then God decreed the severity of the punishment for his wife given to Job. God told Job to take a piece of grass to give to his wife. This blow of the grass is enough in place of the oath he once uttered. In the verses of the Qur'an it is not mentioned why he swore and what he swore. Only hadith mentions that he swore that his wife, Rahmah the daughter of Ifraim, went for something and came too late. Job swears he will hit him 100 times when he cures. With the blows of the grass, he is considered to have fulfilled his oath, as a blessing to Job himself and to his wife who had served him well in times of sickness. In the mercy of God, Job was spared from breaking the oath. At the end of the verse, God praises Job as his patient, kind, and obedient servant. Patience is facing the trials that are given to him, both the trials that affect him, his wealth, and his family. He was put in the company of his good-hearted servants for not giving up easily, and shedding his hope in God. He was also his obedient servant, for his perseverance in fighting for religious orders and keeping himself, his family, and his people from ruin. Of Job's obedience it is known from history that when he encountered trials he said: \"O God, Thou hast taken it, and Thou hast given it.\" At the time of his death he said: \"My Lord,\" You know well that my license will not be different from my heart, my heart will not follow my vision, my slave will not mock me, I will not eat with orphans and I will not I was full and dressed when someone was hungry or naked next to me. \"",
      "text_tafsir": "Kemudian Allah mengisahkan keringanan hukuman bagi istrinya yang diberikan kepada Ayub. Allah memerintahkan agar Ayub mengambil seberkas rumput untuk dipukulkan kepada istrinya. Pukulan rumput ini cukup sebagai pengganti dari sumpah yang pernah ia ucapkan. Dalam ayat-ayat Al-Qur'an tidak disebutkan apa sebab ia bersumpah dan apa sumpahnya. Hanya hadis sajalah yang menyebutkan bahwa ia bersumpah karena istrinya, yang bernama Rahmah putri Ifraim, pergi untuk sesuatu keperluan dan terlambat datang. Ayub bersumpah akan memukulnya 100 kali apabila ia sembuh. Dengan pukulan seikat rumput itu, ia dianggap telah melaksanakan sumpahnya, sebagai kemurahan bagi Ayub sendiri dan bagi istrinya yang telah melayaninya dengan baik pada saat sakit. Dengan adanya kemurahan Allah itu, Ayub pun terhindar dari melanggar sumpah.\n\nDi akhir ayat, Allah memuji bahwa Ayub adalah hamba-Nya yang sabar, baik, dan taat. Sabar menghadapi cobaan yang diberikan kepadanya, baik cobaan yang menimpa dirinya, hartanya, serta keluarganya. Dia dimasukkan dalam golongan hamba-Nya yang baik perangainya karena tidak mudah berputus asa, dan menumpahkan harapannya kepada Allah. Dia juga sebagai hamba-Nya yang taat, karena kegigihannya memperjuangkan perintah-perintah agama serta memelihara diri, keluarga, dan kaumnya dari kehancuran.\n\nMengenai ketaatan Ayub dapat diketahui dari sebuah riwayat bahwa apabila ia menemui cobaan mengatakan:\n\n\"Ya Allah, Engkaulah yang mengambil dan Engkau pula yang memberi.\"\n\nPada waktu bermujanat ia pun berkata:\n\n\"Ya Tuhanku, \"Engkau telah mengetahui betul bahwa lisanku tidak akan berbeda dengan hatiku, hatiku tidak mengikuti penglihatan, hamba sahaya yang kumiliki tidak akan mempermainkan aku, aku tidak makan terkecuali bersama-sama anak yatim dan aku tidak berada dalam keadaan kenyang dan berpakaian sedang di sampingku ada orang yang lapar atau telanjang.\"",
      "text_translation": "Dan ambillah seikat (rumput) dengan tanganmu, lalu pukullah dengan itu dan janganlah engkau melanggar sumpah. Sesungguhnya Kami dapati dia (Ayyub) seorang yang sabar. Dialah sebaik-baik hamba. Sungguh, dia sangat taat (kepada Allah).",
      "text": "وَخُذْ بِيَدِكَ ضِغْثًا فَاضْرِبْ بِّهٖ وَلَا تَحْنَثْ ۗاِنَّا وَجَدْنٰهُ صَابِرًا ۗنِعْمَ الْعَبْدُ ۗاِنَّهٗٓ اَوَّابٌ",
      "text_translation_en": "[And finally We told him:] “Now take in thy hand a small bunch of grass, and strike therewith, and thou wilt not break thine oath!” for, verily, We found him full of patience in adversity: how excellent a servant [of Ours], who, behold, would always turn unto Us!",
      "juz_number": 23
    },
    "45": {
      "text_tafsir_en": "God commanded His Messenger to tell his people of the struggle of Abraham, his son Isaac who was also appointed a prophet, and his grandson Jacob who also achieved prophetic degrees. They are the servants of God who are known for their perseverance and their glory because of their obedience to God. Because of their persistent struggle in upholding the truth and destroying the falsehood, they were empowered by God to possess vast religious knowledge and the power to lead his people to a path that was clear, far from error. They are also given the ability to perform acts of god-approved acts, which benefit their people's lives on earth and their happiness in the hereafter. In this verse there is a sympathy for the Muslims that if they do not want to learn the lessons of the story then they will remain in error and in the hereafter they will experience very terrible suffering.",
      "text_tafsir": "Allah memerintahkan kepada Rasul-Nya agar mengisahkan kepada kaumnya perjuangan Nabi Ibrahim, dan putra beliau Ishak yang juga diangkat menjadi nabi, serta cucunya Yakub yang mencapai derajat kenabian juga.\n\nMereka itu hamba-hamba Allah yang terkenal ketabahannya dan mencapai kemuliaan karena ketaatannya kepada Allah. Karena perjuangannya yang gigih dalam menegakkan kebenaran dan menghancurkan kebatilan, mereka ini dilimpahi kekuatan oleh Allah untuk memiliki ilmu pengetahuan agama yang luas dan kekuatan untuk memimpin kaumnya ke jalan yang terang, jauh dari kesesatan. Mereka juga diberi kemampuan untuk melaksanakan amal perbuatan yang diridai Allah, yang bermanfaat bagi kepentingan hidup kaumnya di dunia dan kebahagiaan mereka di akhirat.\n\nPada ayat ini terdapat sindiran bagi kaum musyrikin bahwa apabila mereka tidak mau mengambil pelajaran dari kisah tersebut tentulah mereka akan tetap berada dalam kesesatan dan di akhirat nanti mereka akan mengalami penderitaan yang sangat mengerikan.",
      "text_translation": "Dan ingatlah hamba-hamba Kami: Ibrahim, Ishak dan Yakub yang mempunyai kekuatan-kekuatan yang besar dan ilmu-ilmu (yang tinggi).",
      "text": "وَاذْكُرْ عِبٰدَنَآ اِبْرٰهِيْمَ وَاِسْحٰقَ وَيَعْقُوْبَ اُولِى الْاَيْدِيْ وَالْاَبْصَارِ",
      "text_translation_en": "AND CALL to mind Our servants Abraham and Isaac and Jacob, [all of them] endowed with inner strength and vision:",
      "juz_number": 23
    },
    "46": {
      "text_tafsir_en": "In this verse, God explains why these prophets achieved glory both in the world and in the Hereafter is for preserving the purity of the soul and avoiding the sin of sin. As their souls are cleansed from the stains of greed, they sincerely obey God's commandments. Also, because they always abstain from despicable acts, they persist in fighting for the truth and eliminating error. Thus, reflect in their souls high morals, and the virtues that make them adhere. All of their activities are energy, wealth, and mind, solely used for pure worship, with the aim of seeking God's favor and upholding the words of monotheism. With that foundation, they are constantly warning their people of the afterlife. The pleasures of the temporary world should serve as a means of worshiping God, so that they may in the future receive unceasing pleasure, provided for the servants who receive His will. As servants who refuse and often struggle in the misery of life, will experience a painful torment.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan sebab-sebab para nabi tersebut mencapai kemuliaan baik dunia maupun akhirat adalah karena memelihara kebersihan jiwa dan menjauhkan diri dari dosa yang tercela. Karena jiwa mereka bersih dari noda-noda kemusyrikan, maka mereka ikhlas menaati perintah-perintah Allah. Juga karena mereka selalu menjauhi perbuatan-perbuatan tercela, maka mereka gigih dalam memperjuangkan kebenaran dan melenyapkan kebatilan. Dengan demikian, tergambarlah dalam jiwa mereka akhlak yang tinggi, dan sifat yang mulia yang menyebabkan mereka patut diteladani. \n\nSeluruh kegiatan mereka baik berupa tenaga, harta, maupun pikiran, semata-mata dipergunakan untuk peribadatan secara murni, dengan tujuan ingin mendapat rida Allah dan menjunjung tinggi kalimat tauhid. Dengan landasan itu, mereka selalu memperingatkan kaumnya pada kehidupan akhirat yang kekal. Kenikmatan di dunia yang hanya sementara itu hendaknya dijadikan sarana untuk berbakti pada Allah, sehingga dengan demikian mereka di akhirat memperoleh kenikmatan yang tiada putus-putusnya, yang disediakan bagi hamba-hamba yang mendapatkan keridaan-Nya. Sedang hamba-hamba yang ingkar dan selalu bergelimang dalam kesesatan hidup, akan merasakan azab yang sangat pedih.",
      "text_translation": "Sungguh, Kami telah menyucikan mereka dengan (menganugerahkan) akhlak yang tinggi kepadanya yaitu selalu mengingatkan (manusia) kepada negeri akhirat.",
      "text": "اِنَّآ اَخْلَصْنٰهُمْ بِخَالِصَةٍ ذِكْرَى الدَّارِۚ ",
      "text_translation_en": "for, verily, We purified them by means of a thought most pure: the remembrance of the life to come.",
      "juz_number": 23
    },
    "47": {
      "text_tafsir_en": "In this verse, God emphasizes that the servants of His choice, Abraham, Isaac, and Jacob, had a pure soul. Not even in their souls are the virtues, such as envy and arrogance, but from within them radiate admirable qualities that are exemplary and exemplary to their people. The lesson to be learned from this verse is that a clean and healthy soul is a condition that must be met by those who desire the glory of both the world and the hereafter. He who is pure in heart and in good sense will see the signs of God's greatness in him and in heaven and on earth. Those who are filthy in spirit and whose mind is bound by materialism, will not see the signs of God's greatness and will not see the truth of the revelation brought by the apostles.",
      "text_tafsir": "Pada ayat ini, Allah menegaskan bahwa para hamba pilihan-Nya, yaitu Ibrahim, Ishak, dan Yakub, benar-benar mempunyai jiwa yang bersih. Tidak tersirat sedikit pun dalam jiwa mereka sifat-sifat yang tercela, seperti sifat dengki dan takabur, melainkan terpancar dari dalam diri mereka sifat-sifat yang terpuji yang menjadi teladan dan contoh yang baik bagi kaumnya.\n\nPelajaran yang dapat diambil dari ayat ini ialah, jiwa yang bersih dan akal yang sehat merupakan syarat yang harus dipenuhi oleh orang yang menginginkan kemuliaan baik dunia maupun akhirat. Orang yang jiwanya bersih dan akalnya sehat tentu melihat tanda-tanda kebesaran Allah yang ada pada dirinya dan ada di langit dan bumi seisinya. Sedang orang yang jiwanya kotor dan pikirannya terbelenggu oleh kebendaan, tentu tidak akan melihat tanda-tanda kebesaran Allah dan tidak akan melihat kebenaran wahyu yang dibawa oleh rasul.",
      "text_translation": "Dan sungguh, di sisi Kami mereka termasuk orang-orang pilihan yang paling baik.",
      "text": "وَاِنَّهُمْ عِنْدَنَا لَمِنَ الْمُصْطَفَيْنَ الْاَخْيَارِۗ",
      "text_translation_en": "And, behold, in Our sight they were indeed among the elect, the truly good!",
      "juz_number": 23
    },
    "48": {
      "text_tafsir_en": "In this verse, Allah ordered the Messenger of Allah to tell the other prophets, namely Ismail, Ilyasa ', and Zulkifli to his people. These are the prophets who persevere in fighting for the establishment of the religion of God in the midst of his people. This verse separates the mention of Ishmael and his father Ibrahim. This implies a separation between the two. Indeed, the Prophet Ismail separated from his father, after he was left with his mother, Hajar, in Mecca. thahir bin 'Assyria, as quoted by the Quraish Shihab, understood that the separation was due to the Prophet Ismail one day becoming the ancestor of a large people, namely the Arabs. While Isaac and Jacob were united with Ibrahim because they were indeed the ancestors of the Children of Israel. The merger of Ilyasa 'and Ismail because of the similarities between the two, among other things they are both as chosen humans, the position of Ilyasa' among the Children of Israel is similar to the position of Ishmael among Abraham's descendants. The similarity is that Ilyasa 'helped the Prophet Ilyas, as Ismail helped Ibrahim. According to asy-Syaukani in Tafsir Fath al-Qadir, it is stated that the merger of the mention of Zulkifli, Ilyasa 'and Ismail because they have something in common, namely those who are patient. At the end of the verse, Allah confirms that they are the best servants of God, having high morality, virtuous, and guiding their people to obey God and stay away from polytheism.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan kepada Rasulullah saw agar mengisahkan nabi-nabi yang lain, yaitu Ismail, Ilyasa', dan Zulkifli kepada kaumnya. Mereka ini adalah nabi-nabi yang gigih memperjuangkan tegaknya agama Allah di tengah-tengah kaumnya.\n\nAyat ini memisahkan penyebutan Ismail dengan ayahnya Ibrahim. Hal ini mengisyaratkan adanya perpisahan antara keduanya. Memang Nabi Ismail berpisah dengan ayahnya, setelah beliau ditinggal bersama ibunya, Hajar, di Mekah. thahir bin 'Asyur, seperti yang dikutip Quraish Shihab, memahami bahwa pemisahan itu karena Nabi Ismail kelak akan menjadi kakek moyang dari umat yang besar, yaitu bangsa Arab. Sedang Ishak dan Yakub disatukan dengan Ibrahim karena mereka memang menjadi kakek moyang Bani Israil.\n\nPenggabungan Ilyasa' dan Ismail karena adanya persamaan antara keduanya, antara lain mereka sama-sama sebagai manusia pilihan, kedudukan Ilyasa' di kalangan Bani Israil serupa dengan kedudukan Ismail di kalangan keturunan Ibrahim. Kesamaan itu adalah Ilyasa' membantu Nabi Ilyas, sebagaimana Ismail membantu Ibrahim.\n\nMenurut asy-Syaukani dalam Tafsir Fath al-Qadir disebutkan bahwa penggabungan penyebutan Zulkifli, Ilyasa', dan Ismail karena mereka mempunyai kesamaan, yaitu orang-orang penyabar.\n\nPada penghujung ayat, Allah menegaskan bahwa mereka ini adalah hamba-hamba Allah yang paling baik, berakhlak tinggi, berbudi luhur, dan membimbing kaumnya agar taat kepada Allah dan menjauhi kemusyrikan.",
      "text_translation": "Dan ingatlah Ismail, Ilyasa‘ dan Zulkifli. Semuanya termasuk orang-orang yang paling baik.",
      "text": "وَاذْكُرْ اِسْمٰعِيْلَ وَالْيَسَعَ وَذَا الْكِفْلِ ۗوَكُلٌّ مِّنَ الْاَخْيَارِۗ",
      "text_translation_en": "And call to mind Ishmael and Elisha, and every one who [like them] has pledged himself [unto Us]: for, each of them was of the truly good!",
      "juz_number": 23
    },
    "49": {
      "text_tafsir_en": "God explains that the verses that tell of the glory of the prophets and their happiness in the hereafter are an honor for them to always be remembered by men. In addition to gaining the glory of the world, they are also provided a good return place in the hereafter. In this verse, the prophets are included in a group of devout people, so that those who pay attention to the Messenger of Allah upon hearing this word of Allah become aware that if they are to emulate and follow the struggle of the apostles, they will also have the honor in the world and the good in the hereafter. Likewise, those who obey Allah's commands and avoid His prohibitions will surely have the same fate.",
      "text_tafsir": "Allah menjelaskan bahwa ayat-ayat yang menceritakan kemuliaan para nabi dan kebahagiaan mereka di akhirat adalah kehormatan bagi mereka untuk selalu diingat oleh manusia. Di samping memperoleh kemuliaan di dunia, mereka pun disediakan tempat kembali yang baik di akhirat. Pada ayat ini, para nabi dimasukkan ke dalam kelompok orang-orang yang takwa, agar orang-orang yang memperhatikan seruan Rasulullah pada saat mendengar firman Allah ini menjadi sadar bahwa apabila mereka mau mencontoh dan meneladani perjuangan para rasul itu, tentu mereka juga akan memperoleh kehormatan di dunia dan kebaikan di akhirat. Demikian pula orang-orang yang mau melaksanakan perintah Allah serta menjauhi larangan-Nya, tentu akan memperoleh nasib yang sama.",
      "text_translation": "Ini adalah kehormatan (bagi mereka). Dan sungguh, bagi orang-orang yang bertakwa (disediakan) tempat kembali yang terbaik,",
      "text": "هٰذَا ذِكْرٌ ۗوَاِنَّ لِلْمُتَّقِيْنَ لَحُسْنَ مَاٰبٍۙ ",
      "text_translation_en": "LET [all] this be a reminder [to those who believe in God] - for, verily, the most beauteous of all goals awaits the God-conscious:",
      "juz_number": 23
    },
    "50": {
      "text_tafsir_en": "In these verses Allah explains how good the place of return is provided to the apostles and the righteous. The door of heaven 'Adn is always open, and the conditions are always pleasant, as a sign that everything has been prepared to honor God's chosen servants who will inhabit it. The spacious rooms are amazing, the servants are beautiful to the eye, and the atmosphere of the environment is astounding. Everything in the dazzling order of creation, which has never been seen before, has never rang in the ears and never crossed the heart. In heaven their desires are fulfilled, the couches on which they lie down, are available all-satisfying, diverse fruits, types of flavors and aromas, as well as drinks of all kinds, ready to be served. Actually the pleasure found in heaven is the peak of all pleasures. The pleasures that were in heaven were expressed with fruits and drinks as pleasures that were in accordance with the conditions of the Meccan people at that time. If we mention various kinds of fruits and drinks of various kinds, of course their appetites are aroused, and there arises their desire to enjoy. In addition, they were accompanied by very polite angels. Each of the heavenly inhabitants is served by special women of heaven, and does not provide services to other heavenly inhabitants. All the women of heaven are equally beautiful and all are teenagers.",
      "text_tafsir": "Pada ayat-ayat ini Allah menjelaskan betapa nikmatnya tempat kembali yang disediakan kepada para rasul dan orang-orang yang bertakwa itu. Pintu surga 'Adn selalu terbuka, dan keadaannya selalu menyenangkan, sebagai tanda bahwa segalanya telah dipersiapkan untuk menghormati hamba-hamba pilihan Allah yang akan menghuninya. Kamar-kamarnya luas yang mengagumkan, pelayan-pelayannya yang indah dipandang mata, dan suasana lingkungannya yang mencengangkan. Semuanya dalam tata ciptaan yang memesonakan, yang belum pernah terlihat sebelumnya, belum pernah terngiang di telinga dan belum pernah terlintas dalam hati.\n\nDi dalam surga itu keinginan mereka terpenuhi, dipan-dipan tempat mereka membaringkan diri, tersedia serba memuaskan, buah-buahan yang beraneka ragam, jenis rasa dan aromanya, serta minuman dengan segala macamnya, siap disuguhkan.\n\nSebenarnya kenikmatan yang terdapat dalam surga itu adalah puncak dari segala kenikmatan. Kenikmatan yang ada di surga itu diungkapkan dengan buah-buahan dan minuman sebagai kenikmatan yang sesuai dengan keadaan masyarakat Mekah pada waktu itu.\n\nKalau disebutkan buah-buahan yang beraneka ragam dan minuman yang bermacam jenisnya, sudah barang tentu selera mereka terangsang, dan timbullah keinginan mereka untuk menikmati. Di samping itu, mereka didampingi oleh bidadari-bidadari yang sangat sopan. Masing-masing penghuni surga dilayani oleh perempuan-perempuan surga yang khusus untuknya, dan tidak memberikan pelayanannya kepada penghuni surga yang lain. Semua perempuan surga sama-sama cantiknya dan semuanya remaja.",
      "text_translation": "(yaitu) surga ’Adn yang pintu-pintunya terbuka bagi mereka,",
      "text": "جَنّٰتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ الْاَبْوَابُۚ",
      "text_translation_en": "gardens of perpetual bliss, with gates wide-open to them,",
      "juz_number": 23
    },
    "51": {
      "text_tafsir_en": "In these verses Allah explains how good the place of return is provided to the apostles and the righteous. The door of heaven 'Adn is always open, and the conditions are always pleasant, as a sign that everything has been prepared to honor God's chosen servants who will inhabit it. The spacious rooms are amazing, the servants are beautiful to the eye, and the atmosphere of the environment is astounding. Everything in the dazzling order of creation, which has never been seen before, has never rang in the ears and never crossed the heart. In heaven their desires are fulfilled, the couches on which they lie down, are available all-satisfying, diverse fruits, types of flavors and aromas, as well as drinks of all kinds, ready to be served. Actually the pleasure found in heaven is the peak of all pleasures. The pleasures that were in heaven were expressed with fruits and drinks as pleasures that were in accordance with the conditions of the Meccan people at that time. If we mention various kinds of fruits and drinks of various kinds, of course their appetites are aroused, and there arises their desire to enjoy. In addition, they were accompanied by very polite angels. Each of the heavenly inhabitants is served by special women of heaven, and does not provide services to other heavenly inhabitants. All the women of heaven are equally beautiful and all are teenagers.",
      "text_tafsir": "Pada ayat-ayat ini Allah menjelaskan betapa nikmatnya tempat kembali yang disediakan kepada para rasul dan orang-orang yang bertakwa itu. Pintu surga 'Adn selalu terbuka, dan keadaannya selalu menyenangkan, sebagai tanda bahwa segalanya telah dipersiapkan untuk menghormati hamba-hamba pilihan Allah yang akan menghuninya. Kamar-kamarnya luas yang mengagumkan, pelayan-pelayannya yang indah dipandang mata, dan suasana lingkungannya yang mencengangkan. Semuanya dalam tata ciptaan yang memesonakan, yang belum pernah terlihat sebelumnya, belum pernah terngiang di telinga dan belum pernah terlintas dalam hati.\n\nDi dalam surga itu keinginan mereka terpenuhi, dipan-dipan tempat mereka membaringkan diri, tersedia serba memuaskan, buah-buahan yang beraneka ragam, jenis rasa dan aromanya, serta minuman dengan segala macamnya, siap disuguhkan.\n\nSebenarnya kenikmatan yang terdapat dalam surga itu adalah puncak dari segala kenikmatan. Kenikmatan yang ada di surga itu diungkapkan dengan buah-buahan dan minuman sebagai kenikmatan yang sesuai dengan keadaan masyarakat Mekah pada waktu itu.\n\nKalau disebutkan buah-buahan yang beraneka ragam dan minuman yang bermacam jenisnya, sudah barang tentu selera mereka terangsang, dan timbullah keinginan mereka untuk menikmati. Di samping itu, mereka didampingi oleh bidadari-bidadari yang sangat sopan. Masing-masing penghuni surga dilayani oleh perempuan-perempuan surga yang khusus untuknya, dan tidak memberikan pelayanannya kepada penghuni surga yang lain. Semua perempuan surga sama-sama cantiknya dan semuanya remaja.",
      "text_translation": "di dalamnya mereka bersandar (di atas dipan-dipan) sambil meminta buah-buahan yang banyak dan minuman (di surga itu).",
      "text": "مُتَّكِـِٕيْنَ فِيْهَا يَدْعُوْنَ فِيْهَا بِفَاكِهَةٍ كَثِيْرَةٍ وَّشَرَابٍ",
      "text_translation_en": "wherein they will recline, [and] wherein they may [freely] call for many a fruit and drink,",
      "juz_number": 23
    },
    "52": {
      "text_tafsir_en": "In these verses Allah explains how good the place of return is provided to the apostles and the righteous. The door of heaven 'Adn is always open, and the conditions are always pleasant, as a sign that everything has been prepared to honor God's chosen servants who will inhabit it. The spacious rooms are amazing, the servants are beautiful to the eye, and the atmosphere of the environment is astounding. Everything in the dazzling order of creation, which has never been seen before, has never rang in the ears and never crossed the heart. In heaven their desires are fulfilled, the couches on which they lie down, are available all-satisfying, diverse fruits, types of flavors and aromas, as well as drinks of all kinds, ready to be served. Actually the pleasure found in heaven is the peak of all pleasures. The pleasures that were in heaven were expressed with fruits and drinks as pleasures that were in accordance with the conditions of the Meccan people at that time. If we mention various kinds of fruits and drinks of various kinds, of course their appetites are aroused, and there arises their desire to enjoy. In addition, they were accompanied by very polite angels. Each of the heavenly inhabitants is served by special women of heaven, and does not provide services to other heavenly inhabitants. All the women of heaven are equally beautiful and all are teenagers.",
      "text_tafsir": "Pada ayat-ayat ini Allah menjelaskan betapa nikmatnya tempat kembali yang disediakan kepada para rasul dan orang-orang yang bertakwa itu. Pintu surga 'Adn selalu terbuka, dan keadaannya selalu menyenangkan, sebagai tanda bahwa segalanya telah dipersiapkan untuk menghormati hamba-hamba pilihan Allah yang akan menghuninya. Kamar-kamarnya luas yang mengagumkan, pelayan-pelayannya yang indah dipandang mata, dan suasana lingkungannya yang mencengangkan. Semuanya dalam tata ciptaan yang memesonakan, yang belum pernah terlihat sebelumnya, belum pernah terngiang di telinga dan belum pernah terlintas dalam hati.\n\nDi dalam surga itu keinginan mereka terpenuhi, dipan-dipan tempat mereka membaringkan diri, tersedia serba memuaskan, buah-buahan yang beraneka ragam, jenis rasa dan aromanya, serta minuman dengan segala macamnya, siap disuguhkan.\n\nSebenarnya kenikmatan yang terdapat dalam surga itu adalah puncak dari segala kenikmatan. Kenikmatan yang ada di surga itu diungkapkan dengan buah-buahan dan minuman sebagai kenikmatan yang sesuai dengan keadaan masyarakat Mekah pada waktu itu.\n\nKalau disebutkan buah-buahan yang beraneka ragam dan minuman yang bermacam jenisnya, sudah barang tentu selera mereka terangsang, dan timbullah keinginan mereka untuk menikmati. Di samping itu, mereka didampingi oleh bidadari-bidadari yang sangat sopan. Masing-masing penghuni surga dilayani oleh perempuan-perempuan surga yang khusus untuknya, dan tidak memberikan pelayanannya kepada penghuni surga yang lain. Semua perempuan surga sama-sama cantiknya dan semuanya remaja.",
      "text_translation": "dan di samping mereka (ada bidadari-bidadari) yang redup pandangannya dan sebaya umurnya.",
      "text": "وَعِنْدَهُمْ قٰصِرٰتُ الطَّرْفِ اَتْرَابٌ",
      "text_translation_en": "having beside them well-matched mates of modest gaze.”",
      "juz_number": 23
    },
    "53": {
      "text_tafsir_en": "Allah asserted that all kinds of pleasures in heaven were promised to Allah's righteous servants, who must have come after the whole human being was raised again from the grave, and tried in Padang Mahsyar. God confirms that the blessings in heaven are not just pleasures, but eternal blessings.",
      "text_tafsir": "Allah menegaskan bahwa segala macam kenikmatan yang terdapat di surga itulah yang dijanjikan kepada hamba Allah yang bertakwa, yang pasti datang setelah manusia seluruhnya dibangkitkan kembali dari kubur, dan diadili di Padang Mahsyar. Allah menegaskan bahwa nikmat yang ada di surga itu bukan sembarang kenikmatan, tetapi nikmat yang abadi.",
      "text_translation": "Inilah apa yang dijanjikan kepadamu pada hari perhitungan.",
      "text": "هٰذَا مَا تُوْعَدُوْنَ لِيَوْمِ الْحِسَابِ",
      "text_translation_en": "This is what you are promised for the Day of Reckoning:",
      "juz_number": 23
    },
    "54": {
      "text_tafsir_en": "Allah asserted that all kinds of pleasures in heaven were promised to Allah's righteous servants, who must have come after the whole human being was raised again from the grave, and tried in Padang Mahsyar. God confirms that the blessings in heaven are not just pleasures, but eternal blessings.",
      "text_tafsir": "Allah menegaskan bahwa segala macam kenikmatan yang terdapat di surga itulah yang dijanjikan kepada hamba Allah yang bertakwa, yang pasti datang setelah manusia seluruhnya dibangkitkan kembali dari kubur, dan diadili di Padang Mahsyar. Allah menegaskan bahwa nikmat yang ada di surga itu bukan sembarang kenikmatan, tetapi nikmat yang abadi.",
      "text_translation": "Sungguh, inilah rezeki dari Kami yang tidak ada habis-habisnya.",
      "text": "اِنَّ هٰذَا لَرِزْقُنَا مَا لَهٗ مِنْ نَّفَادٍۚ",
      "text_translation_en": "this, verily, shall be Our provision [for you], with no end to it!",
      "juz_number": 23
    },
    "55": {
      "text_tafsir_en": "This verse describes the condition of the infidels in hell. They had a terrible return home, endured endless torment in hell. Everything they find comfortable in their seats, beds, restrooms, and so forth, is a place that they do not enjoy, because in that place they are always under heavy torture. In another verse, describing the state of the infidels in the Fire, Allah says: To them the mats sleep from the fire of hell and above them there is a blanket. Thus We reward the unjust. (al-A.'raf \/ 7: 41)",
      "text_tafsir": "Pada ayat ini diterangkan keadaan orang-orang kafir di dalam neraka. Mereka memperoleh tempat kembali yang buruk, mengalami kesengsaraan yang tiada taranya di dalam neraka. Segala tempat yang mereka tempati baik tempat duduk, tempat tidur, tempat istirahat, dan sebagainya, merupakan tempat yang tidak mereka senangi, karena di tempat itu mereka selalu mengalami siksaan yang berat.\n\nDalam ayat yang lain diterangkan keadaan orang kafir di dalam neraka, Allah berfirman:\n\nBagi mereka tikar tidur dari api neraka dan di atas mereka ada selimut (api neraka). Demikianlah Kami memberi balasan kepada orang-orang yang zalim. (al-A.'raf\/7: 41)",
      "text_translation": "Beginilah (keadaan mereka). Dan sungguh, bagi orang-orang yang durhaka pasti (disediakan) tempat kembali yang buruk,",
      "text": "هٰذَا ۗوَاِنَّ لِلطّٰغِيْنَ لَشَرَّ مَاٰبٍۙ",
      "text_translation_en": "All this [for the righteous]: but, verily, the most evil of all goals awaits those who are wont to transgress the bounds of what is right:",
      "juz_number": 23
    },
    "56": {
      "text_tafsir_en": "This verse describes the condition of the infidels in hell. They had a terrible return home, endured endless torment in hell. Everything they find comfortable in their seats, beds, restrooms, and so forth, is a place that they do not enjoy, because in that place they are always under heavy torture. In another verse, describing the state of the infidels in the Fire, Allah says: To them the mats sleep from the fire of hell and above them there is a blanket. Thus We reward the unjust. (al-A.'raf \/ 7: 41)",
      "text_tafsir": "Pada ayat ini diterangkan keadaan orang-orang kafir di dalam neraka. Mereka memperoleh tempat kembali yang buruk, mengalami kesengsaraan yang tiada taranya di dalam neraka. Segala tempat yang mereka tempati baik tempat duduk, tempat tidur, tempat istirahat, dan sebagainya, merupakan tempat yang tidak mereka senangi, karena di tempat itu mereka selalu mengalami siksaan yang berat.\n\nDalam ayat yang lain diterangkan keadaan orang kafir di dalam neraka, Allah berfirman:\n\nBagi mereka tikar tidur dari api neraka dan di atas mereka ada selimut (api neraka). Demikianlah Kami memberi balasan kepada orang-orang yang zalim. (al-A.'raf\/7: 41)",
      "text_translation": "(yaitu) neraka Jahanam yang mereka masuki; maka itulah seburuk-buruk tempat tinggal.",
      "text": "جَهَنَّمَۚ يَصْلَوْنَهَاۚ فَبِئْسَ الْمِهَادُ",
      "text_translation_en": "hell will they have to endure - and how vile a resting-place!",
      "juz_number": 23
    },
    "57": {
      "text_tafsir_en": "God said to those who disbelieved in the Fire, \"O unbelievers, this is the torment I promised before, then taste how heavy and painful the torment is, drink in that boiling hot water that burns the mouth and intestines - your intestines or the stench of blood flowing from the bodies of the inhabitants of hell are very cold, and you will feel the torments of others that you do not know about the form of torment, except that you only experience great suffering. \" The Messenger of Allah (may peace be upon him) said: From Abu Sa'id al-Khudri, from the Prophet (peace be upon him), he said, \"If one bucket of the beverage of the hell was poured out on the earth, all the inhabitants of the world would stink.\" this verse and related to the previous verses as if it were a balance of the word of God to the experts of heaven. In the previous verse it was said that the inhabitants of heaven were given good fruits and delicious drinks, in this verse it is explained that the people Hell is called to taste the boiling hot water and the heart is flowing. wild-eyed and at such a young age, the people of hell had a terrible and painful torment.",
      "text_tafsir": "Allah menyatakan kepada orang-orang kafir di dalam neraka, \"Hai orang kafir, inilah azab yang pernah Aku janjikan dahulu, maka rasakanlah olehmu bagaimana berat dan pedihnya azab itu, minumlah di dalam neraka itu air panas yang sedang mendidih yang membakar mulut dan usus-ususmu atau nanah busuk yang mengalir dari tubuh-tubuh penghuni neraka yang sangat dingin. Selain dari itu kamu sekalian akan merasakan azab-azab yang lain yang kamu sendiri tidak mengetahui bentuk azab itu, selain kamu hanya merasakan kesengsaraan yang luar biasa.\"\n\nRasulullah saw bersabda:\n\nDari Abu Sa'id al-Khudri, dari Nabi saw, beliau bersabda, \"Seandainya satu timba dari minuman penghuni neraka ditumpahkan di dunia, maka semua penghuni dunia akan berbau busuk.(Riwayat al-hakim)\n\nJika diperhatikan ayat-ayat ini dan dihubungkan dengan ayat-ayat yang sebelumnya seakan-akan ayat ini merupakan imbangan perkataan Allah kepada ahli surga. Pada ayat yang lalu disebutkan bahwa penduduk surga diberikan buah-buahan yang baik dan minuman yang lezat rasanya, sedang pada ayat ini diterangkan bahwa penduduk neraka disuruh merasakan air panas yang mendidih dan nanah yang mengalir. Hal ini berarti bahwa penduduk surga memperoleh semua yang diminta dan diingini, sedang penduduk neraka disuruh bahkan dipaksa melakukan sesuatu yang tidak diingininya.\n\nKalau orang-orang yang beriman di dalam surga memperoleh bidadari yang tidak liar pandangannya dan sebaya umurnya, maka penduduk neraka memperoleh azab yang bermacam-macam yang sangat berat dan pedih.",
      "text_translation": "Inilah (azab neraka), maka biarlah mereka merasakannya, (minuman mereka) air yang sangat panas dan air yang sangat dingin,",
      "text": "هٰذَاۙ فَلْيَذُوْقُوْهُ حَمِيْمٌ وَّغَسَّاقٌۙ",
      "text_translation_en": "This, [then, for them -] so let them taste it: burning despair and ice-cold darkness",
      "juz_number": 23
    },
    "58": {
      "text_tafsir_en": "God said to those who disbelieved in the Fire, \"O unbelievers, this is the torment I promised before, then taste how heavy and painful the torment is, drink in that boiling hot water that burns the mouth and intestines - your intestines or the stench of blood flowing from the bodies of the inhabitants of hell are very cold, and you will feel the torments of others that you do not know about the form of torment, except that you only experience great suffering. \" The Messenger of Allah (may peace be upon him) said: From Abu Sa'id al-Khudri, from the Prophet (peace be upon him), he said, \"If one bucket of the beverage of the hell was poured out on the earth, all the inhabitants of the world would stink.\" this verse and related to the previous verses as if it were a balance of the word of God to the experts of heaven. In the previous verse it was said that the inhabitants of heaven were given good fruits and delicious drinks, in this verse it is explained that the people Hell is called to taste the boiling hot water and the heart is flowing. wild-eyed and at such a young age, the people of hell had a terrible and painful torment.",
      "text_tafsir": "Allah menyatakan kepada orang-orang kafir di dalam neraka, \"Hai orang kafir, inilah azab yang pernah Aku janjikan dahulu, maka rasakanlah olehmu bagaimana berat dan pedihnya azab itu, minumlah di dalam neraka itu air panas yang sedang mendidih yang membakar mulut dan usus-ususmu atau nanah busuk yang mengalir dari tubuh-tubuh penghuni neraka yang sangat dingin. Selain dari itu kamu sekalian akan merasakan azab-azab yang lain yang kamu sendiri tidak mengetahui bentuk azab itu, selain kamu hanya merasakan kesengsaraan yang luar biasa.\"\n\nRasulullah saw bersabda:\n\nDari Abu Sa'id al-Khudri, dari Nabi saw, beliau bersabda, \"Seandainya satu timba dari minuman penghuni neraka ditumpahkan di dunia, maka semua penghuni dunia akan berbau busuk.(Riwayat al-hakim)\n\nJika diperhatikan ayat-ayat ini dan dihubungkan dengan ayat-ayat yang sebelumnya seakan-akan ayat ini merupakan imbangan perkataan Allah kepada ahli surga. Pada ayat yang lalu disebutkan bahwa penduduk surga diberikan buah-buahan yang baik dan minuman yang lezat rasanya, sedang pada ayat ini diterangkan bahwa penduduk neraka disuruh merasakan air panas yang mendidih dan nanah yang mengalir. Hal ini berarti bahwa penduduk surga memperoleh semua yang diminta dan diingini, sedang penduduk neraka disuruh bahkan dipaksa melakukan sesuatu yang tidak diingininya.\n\nKalau orang-orang yang beriman di dalam surga memperoleh bidadari yang tidak liar pandangannya dan sebaya umurnya, maka penduduk neraka memperoleh azab yang bermacam-macam yang sangat berat dan pedih.",
      "text_translation": "dan berbagai macam (azab) yang lain yang serupa itu.",
      "text": "وَّاٰخَرُ مِنْ شَكْلِهٖٓ اَزْوَاجٌۗ",
      "text_translation_en": "and, coupled with it, further [suffering] of a similar nature.",
      "juz_number": 23
    },
    "59": {
      "text_tafsir_en": "The angels said to the infidels who had gone into hell earlier when they had driven out a large number of other infidels, \"This is another group that has been driven into hell to live in it with you.\" The troupe that had already entered hell, saw the new troupe being led, said, \"It is a great multitude that will dwell in hell with us. will burn like us. \"",
      "text_tafsir": "Para malaikat berkata kepada orang-orang kafir yang telah masuk ke dalam neraka lebih dahulu di waktu mereka menghalau rombongan kafir yang lain yang banyak jumlahnya, \"Inilah rombongan yang lain yang dihalau ke dalam neraka agar mereka tinggal di dalamnya bersama-sama dengan kamu.\" Rombongan yang telah masuk dahulu ke dalam neraka, melihat rombongan yang baru yang sedang digiring itu, berkata, \"Itu adalah rombongan yang banyak jumlahnya yang akan menghuni neraka bersama-sama kita, maka kecelakaan akan menimpa mereka pula seperti kecelakaan yang telah menimpa kita dan mereka akan dibakar hangus seperti kita.\"",
      "text_translation": "(Dikatakan kepada mereka), “Ini rombongan besar (pengikut-pengikutmu) yang masuk berdesak-desak bersama kamu (ke neraka).” Tidak ada ucapan selamat datang bagi mereka karena sesungguhnya mereka akan masuk neraka (kata pemimpin-pemimpin mereka).",
      "text": "هٰذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْۚ  لَا مَرْحَبًا ۢبِهِمْ ۗ اِنَّهُمْ صَالُوا النَّارِ",
      "text_translation_en": "[And they will say to one another: “Do you see] this crowd of people who rushed headlong [into sin] with you? No welcome to them! Verily, they [too] shall have to endure the fire!”",
      "juz_number": 23
    },
    "60": {
      "text_tafsir_en": "Hearing these words, the angel-led troupe replied, \"You are the ones who deserve the worst, because you were the one who led us astray, and you are the one who always encouraged and encouraged us to do the work that led us to this hell.\" In another verse, God says: God says, \"Go into the fire of hell with the Gentiles and men before you. Every time a people entered, he cursed his brother\" (al-A.'raf \/ 7: 38 ) As for the inhabitants of heaven, every time a troupe enters them, they are always welcomed with joy and happiness, in the atmosphere of brotherhood and love, and to them \"greetings.\" There is a great difference between receiving believers when they enter heaven. by accepting unbelievers when they go to hell.",
      "text_tafsir": "Mendengar ucapan itu, maka rombongan yang sedang digiring malaikat itu menjawab, \"Sebenarnya kamulah yang lebih pantas mendapat celaka, karena kamulah yang menyesatkan kami dahulu, dan kamulah yang selalu mengajak serta mendorong kami untuk mengerjakan pekerjaan-pekerjaan yang mengakibatkan kami masuk neraka ini.\"\n\nDalam ayat lain, Allah berfirman:\n\nAllah berfirman, \"Masuklah kamu ke dalam api neraka bersama golongan jin dan manusia yang telah lebih dahulu dari kamu. Setiap kali suatu umat masuk, dia melaknat saudaranya¦ (al-A.'raf\/7: 38)\n\nLain halnya penduduk surga, setiap ada rombongan yang masuk ke dalamnya, mereka selalu disambut dengan senang dan gembira, dalam suasana persaudaraan dan kasih sayang, dan kepada mereka diucapkan \"salam\". Sungguh besar perbedaan antara penerimaan orang-orang beriman ketika mereka masuk surga dengan penerimaan orang-orang kafir ketika mereka masuk neraka.",
      "text_translation": "(Para pengikut mereka menjawab), “Sebenarnya kamulah yang (lebih pan-tas) tidak menerima ucapan selamat datang, karena kamulah yang menjerumuskan kami ke dalam azab, maka itulah seburuk-buruk tempat menetap.”",
      "text": "قَالُوْا بَلْ اَنْتُمْ لَا مَرْحَبًاۢ بِكُمْ ۗ اَنْتُمْ قَدَّمْتُمُوْهُ لَنَاۚ فَبِئْسَ الْقَرَارُ",
      "text_translation_en": "[And] they [who had been seduced] will exclaim: “Nay, but it is you! No welcome to you! It is you who have prepared this for us: and how vile a state to abide in!”",
      "juz_number": 23
    },
    "61": {
      "text_tafsir_en": "Even the inhabitants of the new hell prayed to God to inflict heavy torment on those who had misled them by saying, \"O our Lord, take upon us a double torment of our religious leaders and leaders who have caused We suffer because of this terrible torment. Another verse that comprehends this verse, says: \"Our Lord, they have deceived us. Bring the double torment of hell to them\" Allah said, \"They each receive many times, but you do not know (al-A.'raf \/ 7: 38)",
      "text_tafsir": "Bahkan penduduk neraka yang baru datang itu berdoa kepada Tuhan agar menambah azab yang berat kepada orang-orang yang telah menyesatkan mereka dengan mengatakan, \"Wahai Tuhan kami, timpakanlah azab yang berlipat-ganda kepada pemimpin-pemimpin dan pemuka-pemuka agama kami yang telah menyebabkan kami menderita karena azab yang berat ini.\n\nAyat lain yang searti dengan ayat ini firman Allah:\n\n¦Ya Tuhan kami, mereka telah menyesatkan kami. Datangkanlah siksaan api neraka yang berlipat ganda kepada mereka\" Allah berfirman, \"Masing-masing mendapatkan (siksaan) yang berlipat ganda, tapi kamu tidak mengetahui. (al-A.'raf\/7: 38)",
      "text_translation": "Mereka berkata (lagi), “Ya Tuhan kami, barangsiapa menjerumuskan kami ke dalam (azab) ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka.”",
      "text": "قَالُوْا رَبَّنَا مَنْ قَدَّمَ لَنَا هٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِى النَّارِ",
      "text_translation_en": "[And] they will pray: “O our Sustainer! Who­ever has prepared this for us, double Thou his suffering in the fire!”",
      "juz_number": 23
    },
    "62": {
      "text_tafsir_en": "The unbelievers ask one another, after they have not seen any believers whom they consider to be despised in the world, \"Why do we not see any of the people in our world who look foolish, evil, and a despised man who can do no good to him. \" Ibn 'Abbas said, \"They mean fools and wicked men, the companions of the Messenger of Allah. converted to Islam, so did his mother, his brother, himself a heathen. \"",
      "text_tafsir": "Orang-orang kafir itu saling bertanya sesamanya, setelah mereka tidak melihat seorang pun orang-orang yang beriman yang mereka anggap hina sewaktu di dunia, \"Mengapa kita tidak melihat seorang pun dari orang-orang yang sewaktu di dunia kita pandang sebagai orang bodoh, orang jahat, dan orang hina yang tidak ada kebaikan pada dirinya.\"\n\nIbnu 'Abbas berkata, \"Yang mereka maksud dengan orang bodoh dan jahat adalah sahabat Rasul. Abu Jahal berkata, 'Di mana Bilal, di mana shuhaib, di mana Ammar, mereka semuanya di dalam surga. Kasihan Abu Jahal, anaknya 'Ikrimah dan Juwairiyah masuk Islam, demikian pula ibunya, saudaranya, sedang ia sendiri kafir.\"",
      "text_translation": "Dan (orang-orang durhaka) berkata, “Mengapa kami tidak melihat orang-orang yang dahulu (di dunia) kami anggap sebagai orang-orang yang jahat (hina).",
      "text": "وَقَالُوْا مَا لَنَا لَا نَرٰى رِجَالًا كُنَّا نَعُدُّهُمْ مِّنَ الْاَشْرَارِ",
      "text_translation_en": "And they will add: “How is it that we do not see [here any of the] men whom we were wont to count among the wicked,",
      "juz_number": 23
    },
    "63": {
      "text_tafsir_en": "Then they asked one another, \"Is it because we have ridiculed and mocked them in the world, that they are not in this hell, and that they are men who are not worthy of scorn and ridicule? we are in hell, but we do not see them. \" Such are the disbelievers in hell, blaming each other, blaming each other, even arguing with each other.",
      "text_tafsir": "Selanjutnya mereka saling bertanya sesama mereka, \"Apakah karena telah kita ejek dan perolok-olokkan sewaktu di dunia, sehingga mereka tidak masuk neraka ini, sedang mereka adalah orang-orang yang tidak pantas diejek dan diperolok-olokkan. Atau mereka sebenarnya telah masuk bersama-sama kita ke dalam neraka, tetapi kita tidak melihat mereka.\" Demikianlah keadaan orang-orang kafir di dalam neraka, mereka saling salah menyalahkan, saling tuduh-menuduh, bahkan mereka saling bertengkar antara yang satu dengan yang lain.",
      "text_translation": "Dahulu kami menjadikan mereka olok-olokan, ataukah karena penglihatan kami yang tidak melihat mereka?”",
      "text": "اَتَّخَذْنٰهُمْ سِخْرِيًّا اَمْ زَاغَتْ عَنْهُمُ الْاَبْصَارُ",
      "text_translation_en": "[and] whom we made the target of our derision? Or is it that [they are here, and] our eyes have missed them?”",
      "juz_number": 23
    },
    "64": {
      "text_tafsir_en": "In this verse Allah confirms that everything told is really going to happen, no doubt in the slightest. The infidels will always fight among themselves in hell later.",
      "text_tafsir": "Pada ayat ini Allah menegaskan bahwa semua yang diceritakan itu benar-benar akan terjadi, tidak diragukan sedikit pun. Orang-orang kafir itu akan selalu bertengkar sesama mereka di dalam neraka nanti.",
      "text_translation": "Sungguh, yang demikian benar-benar terjadi, (yaitu) pertengkaran di antara penghuni neraka.",
      "text": "اِنَّ ذٰلِكَ لَحَقٌّ تَخَاصُمُ اَهْلِ النَّارِ ࣖ",
      "text_translation_en": "Such, behold, will in truth be the [confusion and] mutual wrangling of the people of the fire!",
      "juz_number": 23
    },
    "65": {
      "text_tafsir_en": "God commanded His Messenger to convey to the Meccans that he was an apostle of God who delivered His promises and threats to mankind. His threat was a painful torment to be inflicted on those who disobeyed His command, just as it was for those who were before, such as' Ad, Samud, and so on. The Messenger of Allah (may peace be upon him) declared that he was only a newsman and not a sorcerer as they were supposed to be nor a liar. He is not a man who has authority over mankind, as it is said in the word of Allah: So be warned, for you are a warner. You are not the ruler over them. (al-Gasyiyah \/ 88: 21-22) Allah describes the task of an apostle and the limits of his ability. He explained the teachings that were to be conveyed to unbelievers: \"No God is worthy of worship except Allah, the Almighty, has no allies with him.\"",
      "text_tafsir": "Allah memerintahkan kepada Rasul-Nya agar menyampaikan kepada orang-orang musyrik Mekah bahwa dirinya adalah rasul Allah yang menyampaikan janji dan ancaman-Nya kepada manusia. Ancaman-Nya ialah azab pedih yang akan ditimpakan kepada orang-orang yang menyalahi perintah-Nya sebagaimana yang telah ditimpakan kepada orang-orang sebelumnya, seperti kaum 'Ad, Samud, dan sebagainya. Selanjutnya Rasulullah saw menyatakan bahwa dia hanya pemberi berita dan bukanlah tukang sihir sebagaimana yang mereka tuduhkan dan bukan pula orang pendusta. Ia bukanlah seorang yang berkuasa atas manusia, sebagaimana diterangkan dalam firman Allah:\n\nMaka berilah peringatan, karena sesungguhnya engkau (Muhammad) hanyalah pemberi peringatan. Engkau bukanlah orang yang berkuasa atas mereka. (al-Gasyiyah\/88: 21-22)\n\nAllah menerangkan tugas seorang rasul dan batas-batas kemampuannya. Dia menerangkan ajaran yang harus disampaikan kepada orang-orang kafir yaitu: Tidak ada satu pun Tuhan yang berhak disembah kecuali Allah, Tuhan Yang Maha Esa, tiada sekutu bagi-Nya.",
      "text_translation": "Katakanlah (Muhammad), “Sesungguhnya aku hanya seorang pemberi peringatan, tidak ada tuhan selain Allah Yang Maha Esa, Mahaperkasa,",
      "text": "قُلْ اِنَّمَآ اَنَا۠ مُنْذِرٌ ۖوَّمَا مِنْ اِلٰهٍ اِلَّا اللّٰهُ الْوَاحِدُ الْقَهَّارُ",
      "text_translation_en": "SAY [O Muhammad]: “I am only a warner; and there is no deity whatever save God, the One, who holds absolute sway over all that exists,",
      "juz_number": 23
    },
    "66": {
      "text_tafsir_en": "He is a God that no one can match. Almighty God, omnipotent, omnipotent, controlling, supervising, and preserving the existence of everything in heaven and earth. He is the Most Forgiving Lord of all the sins of His servant.",
      "text_tafsir": "Dialah Tuhan yang tidak dapat ditandingi oleh siapa pun. Tuhan Yang Maha Esa Mahaperkasa, Mahakuasa, menguasai, mengatur, mengawasi, dan memelihara kelangsungan hidup segala sesuatu yang ada di langit dan bumi. Dialah Tuhan Yang Maha Mengampuni segala dosa-dosa hamba yang dikehendaki-Nya.",
      "text_translation": "(yaitu) Tuhan langit dan bumi dan apa yang ada di antara keduanya, Yang Mahaperkasa, Maha Pengampun.”",
      "text": "رَبُّ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا الْعَزِيْزُ الْغَفَّارُ",
      "text_translation_en": "the Sustainer of the heavens and the earth and all that is between them, the Almighty, the All-Forgiving!”",
      "juz_number": 23
    },
    "67": {
      "text_tafsir_en": "The Prophet Muhammad was told to tell the Muslims that the news of the Messenger or Messenger of God, which warned people and the news of His oneness and power, was of great benefit to all mankind. The news can save mankind from error, it can show humanity a straight path, a way of happiness in life and the hereafter. However, most people do not want to understand even when they turn away from the religion of God.",
      "text_tafsir": "Nabi Muhammad diperintahkan untuk mengatakan kepada orang-orang musyrik bahwa berita tentang rasul atau utusan Allah yang memberi peringatan kepada manusia dan berita keesaan dan kekuasaan-Nya, adalah berita yang sangat besar faedahnya bagi seluruh manusia. Berita itu dapat menyelamatkan manusia dari kesesatan, dapat menunjukkan kepada manusia jalan yang lurus, jalan kebahagiaan hidup di dunia dan akhirat. Akan tetapi, kebanyakan manusia tidak mau mengerti bahkan mereka berpaling dari agama Allah.",
      "text_translation": "Katakanlah, “Itu (Al-Qur'an) adalah berita besar,",
      "text": "قُلْ هُوَ نَبَؤٌا عَظِيْمٌۙ",
      "text_translation_en": "Say: “This is a message tremendous:",
      "juz_number": 23
    },
    "68": {
      "text_tafsir_en": "The Prophet Muhammad was told to tell the Muslims that the news of the Messenger or Messenger of God, which warned people and the news of His oneness and power, was of great benefit to all mankind. The news can save mankind from error, it can show humanity a straight path, a way of happiness in life and the hereafter. However, most people do not want to understand even when they turn away from the religion of God.",
      "text_tafsir": "Nabi Muhammad diperintahkan untuk mengatakan kepada orang-orang musyrik bahwa berita tentang rasul atau utusan Allah yang memberi peringatan kepada manusia dan berita keesaan dan kekuasaan-Nya, adalah berita yang sangat besar faedahnya bagi seluruh manusia. Berita itu dapat menyelamatkan manusia dari kesesatan, dapat menunjukkan kepada manusia jalan yang lurus, jalan kebahagiaan hidup di dunia dan akhirat. Akan tetapi, kebanyakan manusia tidak mau mengerti bahkan mereka berpaling dari agama Allah.",
      "text_translation": "yang kamu berpaling darinya.",
      "text": "اَنْتُمْ عَنْهُ مُعْرِضُوْنَ",
      "text_translation_en": "[how can] you turn away from it?”",
      "juz_number": 23
    },
    "69": {
      "text_tafsir_en": "The Messenger of Allah then commanded Allah to tell the Meccans of the Mecca that if Allah had not sent him a revelation, he would not have known the angels who were always submissive and obedient to Allah. Nor would he know what the angels, Satan, and Adam were talking about before God. The angels and Adam were submissive and obedient to God, while Satan was disobedient and disobedient to him. At the end of this verse, the Prophet emphasized the task given by Allah, \"I am only an apostle who gives guidance and warning, not one who can compel people to convert to Islam.\"",
      "text_tafsir": "Selanjutnya Rasulullah diperintahkan Allah menyatakan kepada orang-orang musyrik Mekah bahwa seandainya Allah tidak menurunkan wahyu kepadanya, tentu ia tidak akan mengetahui para malaikat yang selalu tunduk dan patuh kepada Allah. Ia juga tidak akan mengetahui pembicaraan yang dilakukan para malaikat, Iblis, dan Adam di hadapan Allah. Malaikat dan Adam tunduk dan patuh kepada Allah, sedang Iblis ingkar dan durhaka kepada-Nya.\n\nPada akhir ayat ini Rasulullah menegaskan lagi tugas yang diberikan Allah, \"Aku ini hanyalah seorang rasul yang memberi petunjuk dan peringatan, bukanlah seorang yang dapat memaksa manusia masuk agama Islam.\"",
      "text_translation": "Aku tidak mempunyai pengetahuan sedikit pun tentang al-mala’ul a’la (malaikat) itu ketika mereka berbantah-bantahan.",
      "text": "مَا كَانَ لِيَ مِنْ عِلْمٍۢ بِالْمَلَاِ الْاَعْلٰٓى اِذْ يَخْتَصِمُوْنَ",
      "text_translation_en": "[Say, O Muhammad:] “No knowledge would I have had of [what passed among] the host on high when they argued [against the creation of man],",
      "juz_number": 23
    },
    "70": {
      "text_tafsir_en": "The Messenger of Allah then commanded Allah to tell the Meccans of the Mecca that if Allah had not sent him a revelation, he would not have known the angels who were always submissive and obedient to Allah. Nor would he know what the angels, Satan, and Adam were talking about before God. The angels and Adam were submissive and obedient to God, while Satan was disobedient and disobedient to him. At the end of this verse, the Prophet emphasized the task given by Allah, \"I am only an apostle who gives guidance and warning, not one who can compel people to convert to Islam.\"",
      "text_tafsir": "Selanjutnya Rasulullah diperintahkan Allah menyatakan kepada orang-orang musyrik Mekah bahwa seandainya Allah tidak menurunkan wahyu kepadanya, tentu ia tidak akan mengetahui para malaikat yang selalu tunduk dan patuh kepada Allah. Ia juga tidak akan mengetahui pembicaraan yang dilakukan para malaikat, Iblis, dan Adam di hadapan Allah. Malaikat dan Adam tunduk dan patuh kepada Allah, sedang Iblis ingkar dan durhaka kepada-Nya.\n\nPada akhir ayat ini Rasulullah menegaskan lagi tugas yang diberikan Allah, \"Aku ini hanyalah seorang rasul yang memberi petunjuk dan peringatan, bukanlah seorang yang dapat memaksa manusia masuk agama Islam.\"",
      "text_translation": "Yang diwahyukan kepadaku, bahwa aku hanyalah seorang pemberi peringatan yang nyata.”",
      "text": "اِنْ يُّوْحٰىٓ اِلَيَّ اِلَّآ اَنَّمَآ اَنَا۠ نَذِيْرٌ مُّبِيْنٌ",
      "text_translation_en": "had it not been revealed unto me [by God] - to no other end than that I might convey [unto you] a plain warning.",
      "juz_number": 23
    },
    "71": {
      "text_tafsir_en": "In this verse it is explained that angels and demons ask questions to God after He tells angels that they will create a human being from the ground. Their statement about the benefits of human existence that God will create. This question is explained in the word of Allah: And (remember) when your Lord said to the angels, \"I want to make the caliph on earth.\" They say, \"Do you want to make people who spoil and spill blood there, while we glorify You and cleanse Your name?\" He said, \"Really, I know what you don't know.\" (al-Baqarah \/ 2: 30) Concerning the creation of man from the earth, it is explained here that based on scientific studies the material for the creation of man is earth, more precisely referred to in this verse namely clay. The term clay is commonly used to name soil grains of the smallest size, diameters below 0.5 microns (= 1\/2000 mm). The term clay is also commonly used to name the type of mineral forming the smallest soil grains. Because of its small size, clay when put in water will be colloidal: it does not dissolve but spread evenly and is difficult to separate from water. As a mineral, clay is a group of alumino-silicate hydrates with multiple structures. Because of its structure, clay particles have an electric charge. Other properties of clay minerals are plastic, but this plasticity disappears when heated to a certain temperature because the mineral structure changes. Utilization of clay is traditionally based on its physical properties, partly because it is easily formed and hardens when heated, so it is commonly used as material for pottery or pottery and ceramics. The use of clay in a modern way is based more on its physical-chemical properties, generally used as a catalyst in chemical reactions. Because of its chemical-physical properties, clay is the most likely part of the earth to have a major role in the process of early life on earth including human creation (see also al-An'am \/ 6: 2, Fathir \/ 35: 11; al-hijr \/ 15: 26-28-33; al-Mu'minun \/ 23: 12, 14; ash-shaffat \/ 37: 11)",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa para malaikat dan iblis mengajukan pertanyaan kepada Allah setelah Dia menyampaikan kepada malaikat bahwa akan menciptakan seorang manusia dari tanah. Pernyataan mereka mengenai faedah adanya manusia yang akan diciptakan Allah itu. Pertanyaan ini diterangkan dalam firman Allah:\n\nDan (ingatlah) ketika Tuhanmu berfirman kepada para malaikat, \"Aku hendak menjadikan khalifah di bumi.\" Mereka berkata, \"Apakah Engkau hendak menjadikan orang yang merusak dan menumpahkan darah di sana, sedangkan kami bertasbih memuji-Mu dan menyucikan nama-Mu?\" Dia berfirman, \"Sungguh, Aku mengetahui apa yang tidak kamu ketahui.\" (al-Baqarah\/2: 30)\n\nMengenai penciptaan manusia dari tanah, dijelaskan disini bahwa berdasarkan kajian ilmiah bahan penciptaan manusia adalah tanah, disebut lebih persis pada ayat ini yaitu tanah liat. Istilah liat biasa dipakai untuk menamai butiran tanah dengan ukuran paling kecil, diameter di bawah 0,5 mikron (= 1\/2000 mm). Istilah liat juga biasa dipakai untuk menamai jenis mineral pembentuk butiran tanah paling kecil ini. Karena ukurannya yang kecil, liat bila dimasukkan ke dalam air akan bersifat koloidal: tidak melarut tetapi tersebar merata dan sulit dipisahkan dari air. Sebagai mineral, liat adalah sekelompok alumino-silikat hidrat yang strukturnya berlembar. Karena strukturnya, partikel liat mempunyai muatan elektrik. Sifat-sifat mineral liat lainnya adalah plastis, tetapi plastisitas ini menghilang apabila dipanaskan sampai temperatur tertentu karena struktur mineral berubah. Pemanfaatan liat secara tradisional didasarkan pada sifat-sifat fisiknya, antara lain karena mudah dibentuk dan mengeras jika dipanaskan dipanaskan, sehingga umum dipakai sebagai bahan pembuat barang gerabah atau tembikar dan keramik. Pemanfaatan liat secara modern lebih didasarkan pada sifat kimia-fisiknya, umumnya dipakai sebagai bahan katalis pada reaksi-reaksi kimia. Karena sifat-sifat kimia-fisik yang dimilikinya, liat merupakan bagian tanah yang paling mungkin memiliki peran besar pada proses terbentuknya awal kehidupan di muka bumi termasuk penciptaan manusia (lihat juga al-An'am\/6: 2, Fathir\/35: 11; al-hijr\/15: 26-28-33; al-Mu'minun\/23: 12, 14; ash-shaffat\/37: 11)",
      "text_translation": "(Ingatlah) ketika Tuhanmu berfirman kepada malaikat, “Sesungguhnya Aku akan menciptakan manusia dari tanah.",
      "text": "اِذْ قَالَ رَبُّكَ لِلْمَلٰۤىِٕكَةِ اِنِّيْ خَالِقٌۢ بَشَرًا مِّنْ طِيْنٍ",
      "text_translation_en": "[For,] lo, thy Sustainer said unto the angels: “Behold, I am about to create a human being out of clay;",
      "juz_number": 23
    },
    "72": {
      "text_tafsir_en": "God told the angels that when He had perfected the creation of man and breathed His spirit into His body, they were commanded to bow down to Adam, in honor of Him. This verse describes one of Adam's creation processes, that of the earth. The angels bow in reverence for God, except Satan. He refused to honor Adam, so he was a creature who disobeyed God. Satan's objection to Adam's prostration was stated in his words: And when We said to the angels, \"Bow down to Adam!\" So they bow down except the devil. It rejects and boasts, and it includes the unbelievers. (al-Baqarah \/ 2: 34)",
      "text_tafsir": "Allah menyampaikan kepada malaikat bahwa apabila Ia telah menyempurnakan kejadian manusia dan meniupkan roh ke dalam tubuhnya, mereka diperintahkan untuk sujud kepada Adam, sebagai tanda penghormatan kepadanya.\n\nPada ayat ini diterangkan salah satu proses penciptaan Adam, yaitu dari tanah. Para malaikat bersujud menghormatinya, karena taat kepada Allah, kecuali Iblis. Ia enggan menghormati Adam, sehingga ia termasuk makhluk yang tidak taat kepada Allah. Pembangkangan Iblis terhadap perintah sujud kepada Adam telah disebutkan dalam firmannya:\n\nDan (ingatlah) ketika Kami berfirman kepada para malaikat, \"Sujudlah kamu kepada Adam!\" Maka mereka pun sujud kecuali Iblis. Ia menolak dan menyombongkan diri, dan ia termasuk golongan yang kafir. (al-Baqarah\/2: 34)",
      "text_translation": "Kemudian apabila telah Aku sempurnakan kejadiannya dan Aku tiupkan roh (ciptaan)-Ku kepadanya; maka tunduklah kamu dengan bersujud kepadanya.”",
      "text": "فَاِذَا سَوَّيْتُهٗ وَنَفَخْتُ فِيْهِ مِنْ رُّوْحِيْ فَقَعُوْا لَهٗ سٰجِدِيْنَ",
      "text_translation_en": "and when I have formed him fully and breathed into him of My spirit, fall you down before him in prostration!”",
      "juz_number": 23
    },
    "73": {
      "text_tafsir_en": "God told the angels that when He had perfected the creation of man and breathed His spirit into His body, they were commanded to bow down to Adam, in honor of Him. This verse describes one of Adam's creation processes, that of the earth. The angels bow in reverence for God, except Satan. He refused to honor Adam, so he was a creature who disobeyed God. Satan's objection to Adam's prostration was stated in his words: And when We said to the angels, \"Bow down to Adam!\" So they bow down except the devil. It rejects and boasts, and it includes the unbelievers. (al-Baqarah \/ 2: 34)",
      "text_tafsir": "Allah menyampaikan kepada malaikat bahwa apabila Ia telah menyempurnakan kejadian manusia dan meniupkan roh ke dalam tubuhnya, mereka diperintahkan untuk sujud kepada Adam, sebagai tanda penghormatan kepadanya.\n\nPada ayat ini diterangkan salah satu proses penciptaan Adam, yaitu dari tanah. Para malaikat bersujud menghormatinya, karena taat kepada Allah, kecuali Iblis. Ia enggan menghormati Adam, sehingga ia termasuk makhluk yang tidak taat kepada Allah. Pembangkangan Iblis terhadap perintah sujud kepada Adam telah disebutkan dalam firmannya:\n\nDan (ingatlah) ketika Kami berfirman kepada para malaikat, \"Sujudlah kamu kepada Adam!\" Maka mereka pun sujud kecuali Iblis. Ia menolak dan menyombongkan diri, dan ia termasuk golongan yang kafir. (al-Baqarah\/2: 34)",
      "text_translation": "Lalu para malaikat itu bersujud semuanya,",
      "text": "فَسَجَدَ الْمَلٰۤىِٕكَةُ كُلُّهُمْ اَجْمَعُوْنَۙ",
      "text_translation_en": "Thereupon the angels prostrated themselves, all of them together,",
      "juz_number": 23
    },
    "74": {
      "text_tafsir_en": "God told the angels that when He had perfected the creation of man and breathed His spirit into His body, they were commanded to bow down to Adam, in honor of Him. This verse describes one of Adam's creation processes, that of the earth. The angels bow in reverence for God, except Satan. He refused to honor Adam, so he was a creature who disobeyed God. Satan's objection to Adam's prostration was stated in his words: And when We said to the angels, \"Bow down to Adam!\" So they bow down except the devil. It rejects and boasts, and it includes the unbelievers. (al-Baqarah \/ 2: 34)",
      "text_tafsir": "Allah menyampaikan kepada malaikat bahwa apabila Ia telah menyempurnakan kejadian manusia dan meniupkan roh ke dalam tubuhnya, mereka diperintahkan untuk sujud kepada Adam, sebagai tanda penghormatan kepadanya.\n\nPada ayat ini diterangkan salah satu proses penciptaan Adam, yaitu dari tanah. Para malaikat bersujud menghormatinya, karena taat kepada Allah, kecuali Iblis. Ia enggan menghormati Adam, sehingga ia termasuk makhluk yang tidak taat kepada Allah. Pembangkangan Iblis terhadap perintah sujud kepada Adam telah disebutkan dalam firmannya:\n\nDan (ingatlah) ketika Kami berfirman kepada para malaikat, \"Sujudlah kamu kepada Adam!\" Maka mereka pun sujud kecuali Iblis. Ia menolak dan menyombongkan diri, dan ia termasuk golongan yang kafir. (al-Baqarah\/2: 34)",
      "text_translation": "kecuali Iblis; ia menyombongkan diri dan ia termasuk golongan yang kafir.",
      "text": "اِلَّآ اِبْلِيْسَۗ اِسْتَكْبَرَ وَكَانَ مِنَ الْكٰفِرِيْنَ",
      "text_translation_en": "save Iblis: he gloried in his arrogance, and [thus] became one of those who deny the truth.",
      "juz_number": 23
    },
    "75": {
      "text_tafsir_en": "God said to the devil, \"O Satan, why do you refuse to bow down in honor of Adam, the creature I created by my own power? you have made yourself higher and more honorable than the creatures I have created, so that you think you have the right and authority to do what you want? \" Satan answers and gives his reasons for dissenting. He says he is better than Adam because God made him from fire, and Adam from the ground. According to Satan, fire is better than earth because the nature of fire is always high and the earth is always below. In fact, the original cannot be an indication of the glory of the creature. The glory depends on obedience and obedience to God. The above conversation is stated in the Word of God: (Allah) said, \"What hindered you (that you) could not bow (to Adam) when I sent you?\" (Satan) replied, \"I am better than he is. You created me from fire, but you created him from the earth.\" (Al-A.'raf \/ 7: 12)",
      "text_tafsir": "Allah berkata kepada Iblis, \"Hai Iblis, apa yang menyebabkanmu enggan sujud menghormati Adam, makhluk yang telah Aku ciptakan sendiri dengan kekuasaan-Ku? Aku sendirilah yang menciptakan Adam itu, bukan makhluk-Ku yang menciptakannya. Kenapa kamu berlaku angkuh dan sombong. Apakah kamu telah merasa dirimu lebih tinggi dan lebih terhormat di antara makhluk-makhluk yang telah Aku ciptakan, sehingga kamu berpendapat bahwa kamu berhak dan berwenang berbuat apa yang kamu inginkan?\"\n\nIblis menjawab dan memberikan alasan pembangkangannya. Ia mengatakan bahwa ia lebih baik daripada Adam karena Allah menjadikannya dari api, sedang Adam dari tanah. Menurut Iblis, api lebih baik daripada tanah karena sifat api selalu meninggi dan tanah selalu di bawah. Padahal, materi asal itu tidak bisa dijadikan indikator kemuliaan makhluk. Kemuliaan itu tergantung pada ketaatan dan kepatuhan kepada Allah. Percakapan di atas disebutkan dalam firman Allah:\n\n(Allah) berfirman, \"Apakah yang menghalangimu (sehingga) kamu tidak bersujud (kepada Adam) ketika Aku menyuruhmu?\" (Iblis) menjawab, \"Aku lebih baik daripada dia. Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.\"(al-A.'raf\/7: 12)",
      "text_translation": "(Allah) berfirman, “Wahai Iblis, apakah yang menghalangi kamu sujud kepada yang telah Aku ciptakan dengan kekuasaan-Ku. Apakah kamu menyombongkan diri atau kamu (merasa) termasuk golongan yang (lebih) tinggi?”",
      "text": "قَالَ يٰٓاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ ۗ اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ",
      "text_translation_en": "Said He: “O Iblis! What has kept thee from prostrating thyself before that [being] which I have created with My hands? Art thou too proud [to bow down before another created being], or art thou of those who think [only] of themselves as high?”",
      "juz_number": 23
    },
    "76": {
      "text_tafsir_en": "God said to the devil, \"O Satan, why do you refuse to bow down in honor of Adam, the creature I created by my own power? you have made yourself higher and more honorable than the creatures I have created, so that you think you have the right and authority to do what you want? \" Satan answers and gives his reasons for dissenting. He says he is better than Adam because God made him from fire, and Adam from the ground. According to Satan, fire is better than earth because the nature of fire is always high and the earth is always below. In fact, the original cannot be an indication of the glory of the creature. The glory depends on obedience and obedience to God. The above conversation is stated in the Word of God: (Allah) said, \"What hindered you (that you) could not bow (to Adam) when I sent you?\" (Satan) replied, \"I am better than he is. You created me from fire, but you created him from the earth.\" (Al-A.'raf \/ 7: 12)",
      "text_tafsir": "Allah berkata kepada Iblis, \"Hai Iblis, apa yang menyebabkanmu enggan sujud menghormati Adam, makhluk yang telah Aku ciptakan sendiri dengan kekuasaan-Ku? Aku sendirilah yang menciptakan Adam itu, bukan makhluk-Ku yang menciptakannya. Kenapa kamu berlaku angkuh dan sombong. Apakah kamu telah merasa dirimu lebih tinggi dan lebih terhormat di antara makhluk-makhluk yang telah Aku ciptakan, sehingga kamu berpendapat bahwa kamu berhak dan berwenang berbuat apa yang kamu inginkan?\"\n\nIblis menjawab dan memberikan alasan pembangkangannya. Ia mengatakan bahwa ia lebih baik daripada Adam karena Allah menjadikannya dari api, sedang Adam dari tanah. Menurut Iblis, api lebih baik daripada tanah karena sifat api selalu meninggi dan tanah selalu di bawah. Padahal, materi asal itu tidak bisa dijadikan indikator kemuliaan makhluk. Kemuliaan itu tergantung pada ketaatan dan kepatuhan kepada Allah. Percakapan di atas disebutkan dalam firman Allah:\n\n(Allah) berfirman, \"Apakah yang menghalangimu (sehingga) kamu tidak bersujud (kepada Adam) ketika Aku menyuruhmu?\" (Iblis) menjawab, \"Aku lebih baik daripada dia. Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.\"(al-A.'raf\/7: 12)",
      "text_translation": "(Iblis) berkata, “Aku lebih baik daripadanya, karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.”",
      "text": "قَالَ اَنَا۠ خَيْرٌ مِّنْهُ خَلَقْتَنِيْ مِنْ نَّارٍ وَّخَلَقْتَهٗ مِنْ طِيْنٍ",
      "text_translation_en": "Answered [Iblis]: “I am better than he: Thou hast created me out of fire, whereas him Thou hast created out of clay.”",
      "juz_number": 23
    },
    "77": {
      "text_tafsir_en": "Because of the rebellion of Satan who refused to obey God's command, God cast him out of heaven, and made him a cursed creature. That curse will continue until the Day of Judgment, the day of vengeance on all human acts. The Word of God says: \"Come down from it, for you ought not to boast in it.",
      "text_tafsir": "Karena kedurhakaan Iblis yang enggan menaati perintah Allah, maka Allah mengusir Iblis dari surga, dan menjadikannya sebagai makhluk yang terkutuk. Kutukan itu tetap berlaku sampai hari Kiamat, yaitu hari pembalasan terhadap semua perbuatan manusia.\n\nFirman Allah:\n\n(Allah) berfirman, \"Maka turunlah kamu darinya (surga); karena kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah! Sesungguhnya kamu termasuk makhluk yang hina.\"( al-A.'raf\/7: 13)",
      "text_translation": "(Allah) berfirman, “Kalau begitu keluarlah kamu dari surga! Sesungguhnya kamu adalah makhluk yang terkutuk.",
      "text": "قَالَ فَاخْرُجْ مِنْهَا فَاِنَّكَ رَجِيْمٌۖ",
      "text_translation_en": "Said He: “Go forth, then, from this [angelic state] - for, behold, thou art henceforth accursed,",
      "juz_number": 23
    },
    "78": {
      "text_tafsir_en": "Because of the rebellion of Satan who refused to obey God's command, God cast him out of heaven, and made him a cursed creature. That curse will continue until the Day of Judgment, the day of vengeance on all human acts. The Word of God says: \"Come down from it, for you ought not to boast in it.",
      "text_tafsir": "Karena kedurhakaan Iblis yang enggan menaati perintah Allah, maka Allah mengusir Iblis dari surga, dan menjadikannya sebagai makhluk yang terkutuk. Kutukan itu tetap berlaku sampai hari Kiamat, yaitu hari pembalasan terhadap semua perbuatan manusia.\n\nFirman Allah:\n\n(Allah) berfirman, \"Maka turunlah kamu darinya (surga); karena kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah! Sesungguhnya kamu termasuk makhluk yang hina.\"( al-A.'raf\/7: 13)",
      "text_translation": "Dan sungguh, kutukan-Ku tetap atasmu sampai hari pembalasan.”",
      "text": "وَّاِنَّ عَلَيْكَ لَعْنَتِيْٓ اِلٰى يَوْمِ الدِّيْنِ",
      "text_translation_en": "and My rejection shall be thy due until the Day of Judgment!”",
      "juz_number": 23
    },
    "79": {
      "text_tafsir_en": "After being cursed, Satan begged God, \"My Lord, if You have made me a cursed being and are far from Your mercy, then I ask that my life may be extended, until the time of resurrection. I am as long as the world exists. \"",
      "text_tafsir": "Setelah menjadi makhluk yang terkutuk, Iblis memohon kepada Allah, \"Wahai Tuhanku, jika Engkau telah menjadikan aku sebagai makhluk-Mu yang terkutuk dan telah terjauh dari rahmat-Mu, maka aku mohon agar umurku dipanjangkan, hingga sampai hari kebangkitan nanti. Janganlah engkau wafatkan aku selama dunia masih ada.\"",
      "text_translation": "(Iblis) berkata, “Ya Tuhanku, tangguhkanlah aku sampai pada hari mereka dibangkitkan.”",
      "text": "قَالَ رَبِّ فَاَنْظِرْنِيْٓ اِلٰى يَوْمِ يُبْعَثُوْنَ",
      "text_translation_en": "Said [Iblis]: “Then, O my Sustainer, grant me a respite till the Day when all shall be raised from the dead!”",
      "juz_number": 23
    },
    "80": {
      "text_tafsir_en": "God granted Satan's request by letting him live until the appointed time, as the word of God: (Satan) replied, \"Give me a delay of time, until the day they are resurrected.\" (al-A.'raf \/ 7: 14-15)",
      "text_tafsir": "Allah mengabulkan permohonan Iblis itu dengan membiarkannya hidup sampai waktu yang ditentukan, sebagaimana firman Allah:\n\n(Iblis) menjawab, \"Berilah aku penangguhan waktu, sampai hari mereka dibangkitkan.\"(Allah) berfirman, \"Benar, kamu termasuk yang diberi penangguhan waktu.\"( al-A.'raf\/7: 14-15)",
      "text_translation": "(Allah) berfirman, “Maka sesungguhnya kamu termasuk golongan yang diberi penangguhan,",
      "text": "قَالَ فَاِنَّكَ مِنَ الْمُنْظَرِيْنَۙ",
      "text_translation_en": "Answered He: “Verily, so [be it:] thou shalt be among those who are granted respite",
      "juz_number": 23
    },
    "81": {
      "text_tafsir_en": "God granted Satan's request by letting him live until the appointed time, as the word of God: (Satan) replied, \"Give me a delay of time, until the day they are resurrected.\" (al-A.'raf \/ 7: 14-15)",
      "text_tafsir": "Allah mengabulkan permohonan Iblis itu dengan membiarkannya hidup sampai waktu yang ditentukan, sebagaimana firman Allah:\n\n(Iblis) menjawab, \"Berilah aku penangguhan waktu, sampai hari mereka dibangkitkan.\"(Allah) berfirman, \"Benar, kamu termasuk yang diberi penangguhan waktu.\"( al-A.'raf\/7: 14-15)",
      "text_translation": "sampai pada hari yang telah ditentukan waktunya (hari Kiamat).”",
      "text": "اِلٰى يَوْمِ الْوَقْتِ الْمَعْلُوْمِ",
      "text_translation_en": "till the Day the time whereof is known [only to Me].”",
      "juz_number": 23
    },
    "82": {
      "text_tafsir_en": "Then the devil begs again, \"My Lord, for Your power and glory give me the opportunity to seduce and mislead mankind from Your way, by making them look good in the evil and evil deeds that they do.\"",
      "text_tafsir": "Selanjutnya Iblis memohon lagi, \"Wahai Tuhanku, demi kekuasaan dan kemuliaan Engkau, berilah aku kesempatan untuk menggoda dan menyesatkan manusia dari jalan Engkau, dengan menjadikan mereka memandang baik perbuatan buruk dan maksiat yang mereka kerjakan.\"",
      "text_translation": "(Iblis) menjawab, “Demi kemuliaan-Mu, pasti aku akan menyesatkan mereka semuanya,",
      "text": "قَالَ فَبِعِزَّتِكَ لَاُغْوِيَنَّهُمْ اَجْمَعِيْنَۙ",
      "text_translation_en": "[Whereupon Iblis] said: “Then [I swear] by Thy very might: I shall most certainly beguile them all into grievous error –",
      "juz_number": 23
    },
    "83": {
      "text_tafsir_en": "Then the devil said, \"Of course your faithful servants, who are submissive and obedient to you, cannot deceive and mislead. Only unbelievers like me and those who are weak in my faith may fall away.\"",
      "text_tafsir": "Selanjutnya Iblis mengatakan, \"Tentu saja hamba-hamba Engkau yang kuat imannya, yang tunduk dan patuh kepada Engkau, tidak dapat aku goda dan sesatkan. Hanya orang-orang kafir seperti aku dan orang-orang yang lemah imannya yang mungkin aku sesatkan.\"",
      "text_translation": "kecuali hamba-hamba-Mu yang terpilih di antara mereka.”",
      "text": "اِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِيْنَ",
      "text_translation_en": "[all] save such of them as are truly Thy servants!”",
      "juz_number": 23
    },
    "84": {
      "text_tafsir_en": "God granted Satan's request and said, \"That is my right. Indeed, that is what I am saying. threatening those who make demons their leaders and disregarding the commands of God that bring them happiness into the world and the hereafter, God says: the ears of livestock, and I will tell them to change the creation of Allah, and they will turn the devil into a protector other than God, and indeed he suffered a great loss. -Nisa '\/ 4: 119)",
      "text_tafsir": "Allah mengabulkan permintaan Iblis dan berkata, \"Yang hak itu ada pada-Ku. Sungguh, yang hak itulah Aku katakan. Neraka Jahanam itu aku penuhi dengan engkau dan anak cucumu yang datang kemudian dan yang mengikuti engkau dalam kesesatan dari sebagian anak cucu Adam. Allah mengancam orang-orang yang menjadikan setan sebagai pemimpin-pemimpin mereka dan mengabaikan perintah Allah yang menghantarkan mereka kepada kebahagiaan di dunia dan akhirat, Allah berfirman:\n\ndan pasti kusesatkan mereka, dan akan kubangkitkan angan-angan kosong pada mereka dan akan kusuruh mereka memotong telinga-telinga binatang ternak, (lalu mereka benar-benar memotongnya), dan akan aku suruh mereka mengubah ciptaan Allah, (lalu mereka benar-benar mengubahnya). Barangsiapa menjadikan setan sebagai pelindung selain Allah, maka sungguh, dia menderita kerugian yang nyata.(an-Nisa'\/4: 119)",
      "text_translation": "(Allah) berfirman, “Maka yang benar (adalah sumpahku), dan hanya kebenaran itulah yang Aku katakan.",
      "text": "قَالَ فَالْحَقُّۖ وَالْحَقَّ اَقُوْلُۚ",
      "text_translation_en": "[And God] said: “This, then, is the truth! And this truth do I state:",
      "juz_number": 23
    },
    "85": {
      "text_tafsir_en": "God granted Satan's request and said, \"That is my right. Indeed, that is what I am saying. threatening those who make demons their leaders and disregarding the commands of God that bring them happiness into the world and the hereafter, God says: the ears of livestock, and I will tell them to change the creation of Allah, and they will turn the devil into a protector other than God, and indeed he suffered a great loss. -Nisa '\/ 4: 119)",
      "text_tafsir": "Allah mengabulkan permintaan Iblis dan berkata, \"Yang hak itu ada pada-Ku. Sungguh, yang hak itulah Aku katakan. Neraka Jahanam itu aku penuhi dengan engkau dan anak cucumu yang datang kemudian dan yang mengikuti engkau dalam kesesatan dari sebagian anak cucu Adam. Allah mengancam orang-orang yang menjadikan setan sebagai pemimpin-pemimpin mereka dan mengabaikan perintah Allah yang menghantarkan mereka kepada kebahagiaan di dunia dan akhirat, Allah berfirman:\n\ndan pasti kusesatkan mereka, dan akan kubangkitkan angan-angan kosong pada mereka dan akan kusuruh mereka memotong telinga-telinga binatang ternak, (lalu mereka benar-benar memotongnya), dan akan aku suruh mereka mengubah ciptaan Allah, (lalu mereka benar-benar mengubahnya). Barangsiapa menjadikan setan sebagai pelindung selain Allah, maka sungguh, dia menderita kerugian yang nyata.(an-Nisa'\/4: 119)",
      "text_translation": "Sungguh, Aku akan memenuhi neraka Jahanam dengan kamu dan dengan orang-orang yang mengikutimu di antara mereka semuanya.”",
      "text": "لَاَمْلَئَنَّ جَهَنَّمَ مِنْكَ وَمِمَّنْ تَبِعَكَ مِنْهُمْ اَجْمَعِيْنَ",
      "text_translation_en": "Most certainly will I fill hell with thee and such of them as shall follow thee, all together!”",
      "juz_number": 23
    },
    "86": {
      "text_tafsir_en": "Allah commanded the Messenger of Allah (may peace be upon him) to convey to the Muslims that he did not expect them to ask for their wages in return for the task of conveying the religion of Allah. Even the Messenger did not expect it. Only Allah will reward him. The people knew the Prophet so well that he never invented and did what is not. \" Even though he knew little, the Muslim Imam narrated that Ibn Mas'ud said: \"O mankind, whoever among you has knowledge, let him say it. Allah Taala said to the Messenger of Allah, \"Qul ma'as' alukum. . \"until the end of the verse\".",
      "text_tafsir": "Allah memerintahkan kepada Rasulullah saw agar menyampaikan kepada orang-orang musyrik bahwa ia tidak mengharapkan apalagi meminta upah kepada mereka sebagai imbalan dari tugas menyampaikan agama Allah. Sedikit pun Rasul tidak mengharapkannya. Hanya Allah yang akan memberi upah padanya. Orang-orang telah mengenal rasul dengan sebaik-baiknya bahwa ia tidak pernah mengada-ada dan membuat yang bukan-bukan.\"\n\nDari ayat ini dipahami agar orang-orang yang beriman meniru apa yang telah diperbuat Rasulullah, yaitu selalu menyampaikan agama Allah kepada manusia, walaupun hanya sedikit yang diketahuinya. Imam Muslim meriwayatkan bahwa Ibnu Mas'ud berkata:\n\nWahai sekalian manusia, barangsiapa di antara kamu yang memperoleh pengetahuan, maka hendaklah ia mengatakannya. Dan barangsiapa yang tidak mengetahui hendaklah ia menyatakan, \"Allah Taala lebih mengetahui,\". Allah Taala berfirman kepada Rasulullah saw, \"Qul ma'as 'alukum . . .\" sampai akhir ayat\".",
      "text_translation": "Katakanlah (Muhammad), “Aku tidak meminta imbalan sedikit pun kepadamu atasnya (dakwahku); dan aku bukanlah termasuk orang yang mengada-ada.",
      "text": "قُلْ مَآ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ وَّمَآ اَنَا۠ مِنَ الْمُتَكَلِّفِيْنَ",
      "text_translation_en": "SAY [O Prophet]: “No reward whatever do I ask of you for this [message]; and I am not one of those who claim to be what they are not.",
      "juz_number": 23
    },
    "87": {
      "text_tafsir_en": "Allah confirms that this Qur'an contains instructions and teachings for jinn and humans. All people who are healthy mind, certainly recognize the truth. The Qur'an is a guide to the straight path and the difference between the right and the vanity.",
      "text_tafsir": "Allah menegaskan bahwa Al-Qur'an ini berisi petunjuk dan pengajaran bagi jin dan manusia. Semua orang yang sehat akal pikirannya, tentu mengakui kebenarannya. Al-Qur'an merupakan petunjuk ke jalan yang lurus dan pembeda antara yang hak dan yang batil.",
      "text_translation": "(Al-Qur'an) ini tidak lain hanyalah peringatan bagi seluruh alam.",
      "text": "اِنْ هُوَ اِلَّا ذِكْرٌ لِّلْعٰلَمِيْنَ",
      "text_translation_en": "This [divine writ], behold, is no less than a reminder to all the worlds —",
      "juz_number": 23
    },
    "88": {
      "text_tafsir_en": "At the end of this chapter, Allah tells those who disregard the Messenger's message that they will soon find out whether their actions are right or wrong.",
      "text_tafsir": "Pada akhir surah ini, Allah menyampaikan kepada orang-orang yang tidak mengindahkan seruan Rasulullah, bahwa kelak mereka setelah mati akan mengetahui apakah tindakan mereka itu salah atau benar.",
      "text_translation": "Dan sungguh, kamu akan mengetahui (kebenaran) beritanya (Al-Qur'an) setelah beberapa waktu lagi.”",
      "text": "وَلَتَعْلَمُنَّ نَبَاَهٗ بَعْدَ حِيْنٍ ࣖ",
      "text_translation_en": "and you will most certainly grasp its purport after a lapse of time!”",
      "juz_number": 23
    }
  },
  "name": "ص",
  "name_translation_en": "The letter Saad",
  "name_translation": "Sad",
  "name_latin": "Sad"
}