{
  "number": 39,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 75,
  "ayat": {
    "1": {
      "text_tafsir_en": "Allah explains that this precious Qur'an, descended from the Almighty, the Almighty. It is mentioned in the nature of the Almighty and the Almighty in this verse that it may be illustrated to those who hear or read that the Qur'an contains the correct instructions. The values of truth cannot be denied or denied by anyone, and the values of wisdom therein cannot be doubted. The proofs of the truth that the Qur'an is derived from Allah and contains correct instructions are also explained in other verses. Allah says: And indeed, this (Qur'an) is actually sent down by the Lord of the whole world, brought down by ar-Ruh al-Amin (Gabriel), into your heart (Muhammad) that you may be among those who warn , in clear Arabic. (asy-Syu'ara '\/ 26: 192-195) And He says: Those who disbelieve in the Qur'an when it is revealed (to them) and indeed, it is a glorious Book, which will not be visited by falsehood both from the front and the back (from the past and the future), which is revealed from the Almighty, the Blessed One. (Fushshilat \/ 41: 41-42)",
      "text_tafsir": "Allah menjelaskan bahwa Al-Qur'an yang bernilai tinggi ini, diturunkan dari sisi Allah Yang Mahaperkasa lagi Mahabijaksana. Disebutkan sifat Allah Yang Mahaperkasa dan Mahabijaksana dalam ayat ini agar tergambar bagi orang yang mendengar atau membacanya bahwa Al-Qur'an itu mengandung petunjuk-petunjuk yang benar. Nilai-nilai kebenarannya tidak dapat disanggah atau dibantah oleh siapa pun juga, dan nilai-nilai kebijaksanaan di dalamnya tidak dapat diragukan.\n\nBukti-bukti kebenaran bahwa Al-Qur'an itu diturunkan dari Allah dan mengandung petunjuk yang benar dijelaskan juga dalam ayat-ayat yang lain.\n\nAllah berfirman:\n\nDan sungguh, (Al-Qur'an) ini benar-benar diturunkan oleh Tuhan seluruh alam, yang dibawa turun oleh ar-Ruh al-Amin (Jibril), ke dalam hatimu (Muhammad) agar engkau termasuk orang yang memberi peringatan, dengan bahasa Arab yang jelas. (asy-Syu'ara'\/26: 192-195)\n\nDan firman-Nya:\n\nSesungguhnya orang-orang yang mengingkari Al-Qur'an ketika (Al-Qur'an) itu disampaikan kepada mereka (mereka itu pasti akan celaka), dan sesungguhnya (Al-Qur'an) itu adalah Kitab yang mulia, (yang) tidak akan didatangi oleh kebatilan baik dari depan maupun dari belakang (pada masa lalu dan yang akan datang), yang diturunkan dari Tuhan Yang Mahabijaksana, Maha Terpuji. (Fushshilat\/41: 41-42)",
      "text_translation": "Kitab (Al-Qur'an) ini diturunkan oleh Allah Yang Mahamulia, Mahabijaksana.",
      "text": " تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ ",
      "text_translation_en": "THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the Wise:",
      "juz_number": 23
    },
    "2": {
      "text_tafsir_en": "God explains that He revealed to His Messenger the Book of the Qur'an, with the truth and justice. The purpose of \"bringing the truth\" in this verse is to command all people to worship only the One True God. Then God explained that the true way of worship was to worship God alone, by purifying his obedience, purifying from the influence of shirk and joy. The truth found in the Qur'an is in accordance with the truth contained in the scriptures revealed to the previous apostles. Thus, all worship directed to other than God or indirectly directed to Him is false worship.",
      "text_tafsir": "Allah menjelaskan bahwa Dia menurunkan kepada rasul-Nya Kitab Al-Qur'an, dengan membawa kebenaran dan keadilan. Maksud \"membawa kebenaran\" dalam ayat ini ialah membawa perintah kepada seluruh manusia agar mereka beribadah hanya kepada Allah Yang Maha Esa. Kemudian Allah menjelaskan cara beribadah yang benar itu hanyalah menyembah Allah semata, dengan memurnikan ketaatan kepada-Nya, bersih dari pengaruh syirik dan ria. Kebenaran yang terdapat dalam Al-Qur'an itu sesuai dengan kebenaran yang termuat dalam kitab-kitab yang diturunkan kepada rasul sebelumnya. Dengan demikian, semua peribadatan yang ditujukan kepada selain Allah atau peribadatan yang tidak langsung ditujukan kepada-Nya adalah peribadatan yang tidak benar.",
      "text_translation": "Sesungguhnya Kami menurunkan Kitab (Al-Qur'an) kepadamu (Muhammad) dengan (membawa) kebenaran. Maka sembahlah Allah dengan tulus ikhlas beragama kepada-Nya.",
      "text": "اِنَّآ اَنْزَلْنَآ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ فَاعْبُدِ اللّٰهَ مُخْلِصًا لَّهُ الدِّيْنَۗ",
      "text_translation_en": "for, behold, it is We who have bestowed this revela­tion upon thee from on high, setting forth the truth: so worship Him, sincere in thy faith in Him alone!",
      "juz_number": 23
    },
    "3": {
      "text_tafsir_en": "God then commanded his apostles to remind his people that the holy religion was the religion of God. The meaning of religion in this verse is worship and obedience. Therefore, worship and obedience should be directed to God alone, purified from shirk and joy. Idolaters believe that God is a substance that is beyond the reach of human senses. Therefore, it is not possible for humans to worship Him directly. If people want to worship Him, they think they should use their assigned mediator to present their worship to God. They are angels and spirits, which sometimes resemble human forms. They are considered Gods. The statues that are carved into the houses of worship are statues depicting the god, but not the true God. Just generally ignorance causes them, no longer distinguishing between a statue and a God so that they worship the statue as worshiping God, just as the people worship the beast. They no longer distinguish between worshiping animals and worshiping the Creator of animals. The Arabs of ignorance painted statues of various shapes, with statues depicting stars, angels, prophets, and the saints. They worshiped the statues as symbols of each worship. Such was the view of the Muslims in the past and ahead of the Messenger of Allah. Then came the Messenger of Allah (may peace be upon him) with orders to destroy their idols and erase their false ideas, and replace them with teachings that led them to be religious. Allah says: And verily, We have sent a messenger to every people, to worship, \"Worship Allah, and be far from it.\" (an-Nahl \/ 16: 36) And He says: We have not sent any Messenger before you (Muhammad), but We have revealed to him that there is no god but me, so worship me. (al-Anbiya '\/ 21: 25) In a broader explanation of the Quraysh's acknowledgment of the existence of God, the Qatadah says that when the Meccans were asked who their God was, who created them, and who created the heavens and the earth and the rain came down from heaven, and they said, \"God.\" Then when they were asked why they worshiped idols, they said, \"That they should draw near to God, and that they should intercede when they needed help from God.\" Then about the attitude of the muslims God said: Then why (idols and gods) do they worship other than Allah to draw near to Him? Even the gods have disappeared from them? (al-A.hqaf \/ 46: 28) Allah threatens their attitudes and actions and shows them the consequences of their feelings. Allah will decide what they will dispute on the day of reckoning. On that day, the truth of the monotheistic religion will no longer be covered up and the falsehood of idolatry will be evident. Each and every one of them will receive a fair reward. Those who adhere to the religion of monotheism will find a happy return. While those who are always wandering in the valleys of solitude will find their place full of misery. At the end of this verse, God states that He will not guide those who deny the truth and reject the religion because of their unjustifiable error. There are various ways in which they associate God with other gods, such as worshiping idols, or assuming that God has children and so on. All that is but their opinion away from the truth and dragging them into the valley of error.",
      "text_tafsir": "Allah lalu memerintahkan kepada rasul-Nya agar mengingatkan kaumnya bahwa agama yang suci adalah agama Allah. Maksud agama dalam ayat ini ialah ibadah dan taat. Oleh sebab itu, ibadah dan taat itu hendaknya ditujukan kepada Allah semata, bersih dari syirik dan ria.\n\nPenyembah berhala berpendapat bahwa Allah adalah Zat yang berada di luar jangkauan indera manusia. Oleh sebab itu, tidak mungkin manusia dapat langsung beribadah kepada-Nya. Apabila manusia ingin beribadah kepada-Nya, menurut mereka, hendaknya memakai perantara yang diserahi tugas untuk menyampaikan ibadah mereka itu kepada Allah. Perantara-perantara itu ialah malaikat dan jin, yang kadang-kadang menyerupai bentuk manusia. Mereka ini dianggap Tuhan. Adapun patung-patung yang dipahat yang diletakkan di rumah-rumah ibadah adalah patung yang menggambarkan tuhan, tetapi bukanlah Tuhan yang sebenarnya. Hanya saja pada umumnya kebodohan menyebabkan mereka, tidak lagi membedakan antara patung dan Tuhan sehingga mereka menyembah patung itu sebagaimana menyembah Allah, seperti keadaan orang-orang yang menyembah binatang. Mereka itu tidak lagi membedakan antara menyembah binatang dan menyembah Pencipta binatang.\n\nOrang-orang Arab Jahiliah melukiskan patung-patung dengan bermacam-macam bentuk, ada patung yang menggambarkan bintang-bintang, malaikat-malaikat, nabi-nabi, dan orang-orang saleh yang telah berlalu. Mereka menyembah patung-patung itu sebagai simbol bagi masing-masing sembahan itu.\n\nDemikianlah anggapan kaum musyrikin di masa lalu dan menjelang diutusnya Muhammad saw sebagai rasul. Kemudian datanglah Rasulullah dengan mengemban perintah untuk membinasakan sembahan-sembahan mereka itu dan mengikis habis anggapan yang salah dari pikiran mereka, serta menggantinya dengan ajaran yang menuntun pikiran agar beragama tauhid.\n\nAllah berfirman:\n\nDan sungguh, Kami telah mengutus seorang rasul untuk setiap umat (untuk menyerukan), \"Sembahlah Allah, dan jauhilah thagut.\" (an-Nahl\/16: 36)\n\nDan firman-Nya:\n\nDan Kami tidak mengutus seorang rasul pun sebelum engkau (Muhammad), melainkan Kami wahyukan kepadanya, bahwa tidak ada tuhan (yang berhak disembah) selain Aku, maka sembahlah Aku. (al-Anbiya'\/21: 25)\n\nSebagai penjelasan lebih luas tentang pengakuan orang-orang Quraisy terhadap adanya Allah, dituturkan oleh Qatadah bahwa apabila orang-orang musyrik Mekah itu ditanya siapa Tuhan mereka, siapa yang menciptakan mereka, dan siapa yang menciptakan langit dan bumi serta menurunkan hujan dari langit, mereka menjawab, \"Allah.\" Kemudian apabila ditanyakan kepada mereka, mengapa mereka menyembah berhala-berhala, mereka pun menjawab, \"Supaya berhala-berhala itu mendekatkan mereka kepada Allah dengan sedekat-dekatnya dan berhala-berhala itu memberi syafaat pada saat mereka memerlukan pertolongan dari sisi Allah.\"\n\nKemudian mengenai sikap kaum musyrikin yang serupa itu Allah berfirman:\n\nMaka mengapa (berhala-berhala dan tuhan-tuhan) yang mereka sembah selain Allah untuk mendekatkan diri (kepada-Nya) tidak dapat menolong mereka? Bahkan tuhan-tuhan itu telah lenyap dari mereka? (al-A.hqaf\/46: 28)\n\nAllah mengancam sikap dan perbuatan mereka serta menampakkan kepada mereka akibat yang akan mereka rasakan. Allah akan memutuskan apa yang mereka perselisihkan itu pada hari perhitungan. Pada hari itu, kebenaran agama tauhid tidak akan dapat ditutup-tutupi lagi dan kebatilan penyembahan berhala akan tampak dengan jelas. Masing-masing pemeluknya akan mendapat imbalan yang setimpal. Orang-orang yang tetap berpegang kepada agama tauhid akan mendapat tempat kembali yang penuh kenikmatan. Sedang orang-orang yang selalu bergelimang dalam lembah kemusyrikan akan mendapat tempat kembali yang penuh dengan penderitaan.\n\nPada bagian akhir ayat ini, Allah menandaskan bahwa Dia tidak akan memberi petunjuk kepada orang-orang yang mendustakan kebenaran dan mengingkari agama tauhid karena kesesatan mereka yang tak dapat dibetulkan lagi. Macam-macam cara yang mereka tempuh untuk menyekutukan Allah dengan tuhan-tuhan yang lain, seperti menyembah berhala, atau beranggapan bahwa Allah mempunyai anak dan sebagainya. Semua itu tiada lain hanyalah anggapan mereka yang jauh dari kebenaran dan menyeret mereka ke lembah kesesatan.",
      "text_translation": "Ingatlah! Hanya milik Allah agama yang murni (dari syirik). Dan orang-orang yang mengambil pelindung selain Dia (berkata), “Kami tidak menyembah mereka melainkan (berharap) agar mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya.” Sungguh, Allah akan memberi putusan di antara mereka tentang apa yang mereka perselisihkan. Sungguh, Allah tidak memberi petunjuk kepada pendusta dan orang yang sangat ingkar.",
      "text": "اَلَا لِلّٰهِ الدِّيْنُ الْخَالِصُ ۗوَالَّذِيْنَ اتَّخَذُوْا مِنْ دُوْنِهٖٓ اَوْلِيَاۤءَۘ مَا نَعْبُدُهُمْ اِلَّا لِيُقَرِّبُوْنَآ اِلَى اللّٰهِ زُلْفٰىۗ اِنَّ اللّٰهَ يَحْكُمُ بَيْنَهُمْ فِيْ مَا هُمْ فِيْهِ يَخْتَلِفُوْنَ ەۗ اِنَّ اللّٰهَ لَا يَهْدِيْ مَنْ هُوَ كٰذِبٌ كَفَّارٌ",
      "text_translation_en": "Is it not to God alone that all sincere faith is due? And yet, they who take for their protectors aught beside Him [are wont to say], “We worship them for no other reason than that they bring us nearer to God.” Behold, God will judge between them [on Resur­rection Day] with regard to all wherein they differ [from the truth]: for, verily, God does not grace with His guidance anyone who is bent on lying [to himself and is] stubbornly ingrate!",
      "juz_number": 23
    },
    "4": {
      "text_tafsir_en": "Allah describes in detail the acts that led them to fall into error. God has said that if He wanted to have children, He would not have taken them as they said. Of course God has the power to choose children according to His will, and the choice is certainly a son. However, why do the Meccans say that God has a daughter, but they themselves do not have daughters? Allah says: Is it right for Him to be daughters, but for you boys? (ath-thur \/ 52: 39) And He says: Is it fit for you men and for women? That is certainly an unfair division. (an-Najm \/ 53: 21-22) The notion that God has children of any kind, includes associating God with other gods. It means dividing the power of God. However the child must inherit the power of the father, and when that power is divided, then the power of God will be lost. This cannot be because God created the heavens and the earth and their contents, of course, and has infinite power, so even His power cannot be divided. That is why Allah affirms that His Holiness is from the attributes presented by the Muslims. Instead, God asserts that He is the One, childless and fatherless. He does not need anything, even He is the Beast. He is in subjection to whatever is in the heavens and on the earth and in all its contents, and compels him to submit to his authority and to obey his will.",
      "text_tafsir": "Allah menjelaskan dengan lebih rinci perbuatan yang menyebabkan mereka terjerumus ke dalam kesesatan. Allah mengemukakan bahwa sekiranya Dia berkeinginan untuk mengambil anak, tentulah Dia tidak akan mengambil anak seperti yang mereka katakan. Sudah tentu Allah berkuasa memilih anak menurut kehendak-Nya, dan yang dipilih itu tentunya anak lelaki. Akan tetapi, mengapa orang-orang kafir Mekah itu mengatakan bahwa Allah mempunyai anak perempuan, padahal mereka sendiri enggan mempunyai anak perempuan?\n\nAllah berfirman:\n\nAtaukah (pantas) untuk Dia anak-anak perempuan sedangkan untuk kamu anak-anak laki-laki? (ath-thur\/52: 39)\n\nDan firman-Nya:\n\nApakah (pantas) untuk kamu yang laki-laki dan untuk-Nya yang perempuan? Yang demikian itu tentulah suatu pembagian yang tidak adil. (an-Najm\/53: 21-22)\n\nAnggapan bahwa Allah mempunyai anak bagaimana pun juga bentuknya, adalah termasuk mempersekutukan Allah dengan tuhan-tuhan yang lain. Hal ini berarti memecah-belah kekuasaan Tuhan. Bagaimana pun juga anak itu tentunya mewarisi kekuasaan dari ayah, dan apabila kekuasaan itu terbagi, maka hilanglah kemahakuasaan Allah. Hal ini tidak bisa terjadi karena Allah yang menciptakan langit dan bumi serta isinya, tentu mempunyai kekuasaan tidak terbatas, sehingga kekuasaan-Nya pun tidak mungkin terbagi-bagi.\n\nItulah sebabnya maka Allah menandaskan bahwa Mahasuci Dia dari sifat-sifat yang dikemukakan oleh orang-orang musyrik itu. Sebaliknya Allah menandaskan bahwa Dia Maha Esa, tidak beranak dan tidak berbapak. Dia tidak memerlukan sesuatu apa pun, bahkan Dia Maha Mengalahkan. Dia berkuasa menundukkan apa saja yang ada di langit dan di bumi serta seluruh isinya, dan memaksanya tunduk takluk di bawah kekuasaan-Nya dan patuh menurut kehendak-Nya.",
      "text_translation": "Sekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang Dia kehendaki dari apa yang telah diciptakan-Nya. Mahasuci Dia. Dialah Allah Yang Maha Esa, Mahaperkasa.",
      "text": "لَوْ اَرَادَ اللّٰهُ اَنْ يَّتَّخِذَ وَلَدًا لَّاصْطَفٰى مِمَّا يَخْلُقُ مَا يَشَاۤءُ ۙ سُبْحٰنَهٗ ۗهُوَ اللّٰهُ الْوَاحِدُ الْقَهَّارُ",
      "text_translation_en": "Had God willed to take Unto Himself a son, He could have chosen anyone that He wanted out of whatever He has created - [but] limitless is He in His glory! He is the One God, the One who holds absolute sway over all that exists!",
      "juz_number": 23
    },
    "5": {
      "text_tafsir_en": "God explained that He created the heavens and the earth with the right purpose. He decorated the sky with the sun and moon. Each has trajectories according to the conditions set by God. Because of the rotation of the earth on its axis, as if the sun is seen circulating in the sky from east to west, so there was a change of day and night. When the sun rises at the eastern horizon comes noon and when the sun sets at the western horizon comes night. So it happens every day. The events that occurred were solely due to God's will, which He had determined when creating the universe. God closes the night over the afternoon is an expression of the parable where the day is marked by bright sunlight likened to an open place, while the night which is marked by closed sunlight is likened to a curtain that covers an open place. So when it is said that night covers the day, the understanding is that the sun's rays are covered by the dark curtain of the night. God closes day and night is the opposite of the parable that is stated otherwise. The day is like a bright light, while the night is like dark places. In the daytime from noon the bright sunlight covers the darkness of the night, until the dense night turns with bright lights. This similar view is a daily view according to layman's observations. However, if people want to think more carefully, they will be able to understand that the length of day and night is not the same. For places around the equator, the length and length of the day and night are always around the same, around 12 hours. However, for places that are north of the equator, when the sun is circulating to the north, the daylight for those areas is getting longer. Increasing daylight is directly proportional to the position of the place on earth and the position of the sun. Until in some places in the north polar region when the sun is in the northernmost hemisphere, these regions will experience continuous daylight. It can be said, the farther a place is from the equator and the farther the sun's position from the celestial equator, the longer the daylight time until certain regions take place continuously daytime. So from the closest place to the farthest from the equator there is a part of the night that is covered by day which is getting longer. Until somewhere day covers the night completely. Means the afternoon spends the entire circle of the sun. In other words day covers the night altogether. After that, God explained that he subjected the sun and moon. Means that the circulation of the sun and moon in accordance with the provisions that have been arranged by God at the time of creation. If what is meant by the daily circulation of the sun is pseudo, then when the sun culminates to the next culmination, it takes approximately 24 hours. But if what is meant by annual circulation, namely the apparent circulation of the sun between the stars, takes one year. As for the circulation of months from ijtima 'to the next ijtima, it takes one month. The time conditions are one month according to calendar calculations based on the circulation of the month. The provisions of the circulation time are provisions in general only. To get more precise figures, it requires a more thorough and in-depth discussion. But it can be understood that the sun and moon circulate according to a certain time of circulation; it could even be said to be circulating according to almost certain conditions. That is why Allah insisted that each heavenly body circulates according to the time determined according to their respective circulation. Therefore, when the time comes for the sun and moon to lose their balance, they are increasingly deviating from the provisions of circulation. The same thing will happen on the Day of Judgment, which is the day when heaven and earth and their contents fall apart. Allah says: (Remember) on the day of heaven We roll like rolling up sheets of paper. (al-Anbiya '\/ 21: 104) At the end of the verse, Allah tells His servants to ask forgiveness from Him by rushing to worship and purify His obedience. God also reminded them that He is Almighty and his provisions cannot be denied. Allah is Forgiving for His servants who are aware and like to be guided to the right path.",
      "text_tafsir": "Allah menjelaskan bahwa Dia menciptakan langit dan bumi dengan tujuan yang benar. Dihiasi-Nya langit dengan matahari dan bulan. Masing-masing mempunyai lintasan-lintasan menurut ketentuan yang telah ditetapkan Allah. Karena perputaran bumi pada porosnya, seolah-olah matahari terlihat beredar di langit dari arah Timur ke Barat, sehingga terjadilah pergantian siang dan malam. Apabila matahari muncul di kaki langit bagian Timur datanglah siang dan bila matahari tenggelam di kaki langit bagian Barat datanglah malam. Demikianlah yang terjadi setiap hari. Peristiwa yang terjadi itu semata-mata karena kehendak Allah, yang telah ditetapkan-Nya pada saat menciptakan alam semesta. \n\nAllah menutupkan malam atas siang adalah ungkapan dari perumpamaan dimana siang yang ditandai oleh terangnya sinar matahari diumpamakan tempat yang terbuka, sedang malam yang ditandai oleh tertutupnya sinar matahari diumpamakan sebagai tirai yang menutupi tempat yang terbuka. Jadi apabila dikatakan malam menutupi siang, pengertiannya ialah terangnya sinar matahari tertutup oleh tirai gelapnya malam. Allah menutupkan siang atas malam adalah lawan perumpamaan yang disebutkan sebaliknya. Siang diumpamakan cahaya yang terang-benderang sedang malam diumpamakan tempat-tempat yang gelap gulita. Di waktu hari mulai siang cahaya matahari yang terang benderang menutupi kegelapan malam, hingga pekatnya malam berganti dengan terang-benderang. Pandangan serupa ini adalah pandangan sehari-hari menurut pengamatan orang awam.\n\nAkan tetapi apabila orang mau berpikir lebih teliti, ia akan dapat memahami bahwa panjang siang dan malam tidaklah sama. Untuk tempat-tempat yang berada di sekitar khatulistiwa panjang dan pendeknya siang dan malam selalu berkisar sama, sekitar 12 jam. Akan tetapi, bagi tempat-tempat yang berada di sebelah utara khatulistiwa, pada saat matahari beredar di sebelah utara, waktu siang untuk daerah-daerah itu bertambah panjang. Bertambahnya waktu siang berbanding lurus dengan kedudukan tempat di bumi dan kedudukan matahari. Hingga di beberapa tempat di daerah kutub utara apabila matahari berada di belahan langit yang paling utara, daerah-daerah tersebut akan mengalami siang terus-menerus. \n\nDapat dikatakan, makin jauh satu tempat dari khatulistiwa dan makin jauh kedudukan matahari dari khatulistiwa langit, makin panjanglah waktu siang hingga pada daerah-daerah tertentu berlangsung siang terus-menerus. Maka dari tempat yang terdekat hingga yang terjauh dari khatulistiwa ada bagian malam yang ditutupi siang yang waktunya makin panjang. Hingga pada suatu tempat siang sama sekali menutupi malam. Berarti siang menghabiskan seluruh lingkaran peredaran matahari. Dengan kata lain siang menutupi malam sama sekali.\n\nSesudah itu, Allah menjelaskan bahwa dia menundukkan matahari dan bulan. Berarti bahwa peredaran matahari dan bulan itu sesuai dengan ketentuan yang telah diatur oleh Allah pada saat diciptakan. Apabila yang dimaksud peredaran harian matahari semu, maka saat matahari berkulminasi ke saat berkulminasi berikutnya diperlukan waktu selama kira-kira 24 jam. Tetapi apabila yang dimaksud peredaran tahunan, yaitu peredaran semu matahari di antara bintang-bintang diperlukan waktu satu tahun. Sedang untuk peredaran bulan dari ijtima' hingga ijtima berikutnya diperlukan waktu sebanyak satu bulan. Ketentuan-ketentuan waktu sebanyak satu bulan menurut perhitungan kalender yang berdasarkan pada peredaran bulan. \n\nKetentuan-ketentuan waktu peredaran tersebut adalah ketentuan secara garis besarnya saja. Untuk mendapatkan angka-angka yang lebih teliti, memerlukan pembahasan yang lebih teliti dan mendalam. Tetapi yang dapat dipahami bahwa matahari dan bulan itu beredar menurut waktu peredaran yang tertentu; bahkan boleh dikatakan beredar menurut ketentuan yang hampir pasti. Itulah sebabnya maka Allah menandaskan bahwa masing-masing benda langit itu beredar menurut waktu yang ditentukan menurut peredarannya masing-masing. Oleh karena itu, apabila tiba saatnya matahari dan bulan itu akan kehilangan keseimbangannya, makin lama makin menyimpang dari ketentuan peredarannya. Hal yang serupa itu akan terjadi pada hari Kiamat, yaitu hari ketika langit dan bumi serta isinya hancur berantakan.\n\nAllah berfirman:\n\n(Ingatlah) pada hari langit Kami gulung seperti menggulung lembaran-lembaran kertas. (al-Anbiya'\/21: 104)\n\nDi akhir ayat, Allah menyuruh hamba-Nya agar memohon ampun kepada-Nya dengan cara bergegas untuk beribadah dan memurnikan ketaatan kepada-Nya. Allah juga mengingatkan mereka bahwa Ia Mahaperkasa dan ketentuan-ketentuannya tidak dapat dibantah. Allah Maha Pengampun bagi para hamba-Nya yang sadar dan suka dibimbing ke jalan yang benar.",
      "text_translation": "Dia menciptakan langit dan bumi dengan (tujuan) yang benar; Dia memasukkan malam atas siang dan memasukkan siang atas malam dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan. Ingatlah! Dialah Yang Mahamulia, Maha Pengampun.",
      "text": "خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّۚ يُكَوِّرُ الَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى الَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَۗ كُلٌّ يَّجْرِيْ لِاَجَلٍ مُّسَمًّىۗ  اَلَا هُوَ الْعَزِيْزُ الْغَفَّارُ",
      "text_translation_en": "He it is who has created the heavens and the earth in accordance with [an inner] truth. He causes the night to flow into the day, and causes the day to flow into the night; and He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him]. Is not He the Almighty, the All-Forgiving?",
      "juz_number": 23
    },
    "6": {
      "text_tafsir_en": "God shows the signs of His power that exist in human self-creation. God explained that He created a human being in the beginning. God created humans in various colors and languages from Adam. Then God created her partner Eve. God also explained that He also created eight livestock in pairs. A pair of goats, a pair of sheep, a pair of camels, and a pair of cows. Allah explained further about human events. Humans were created through a process of incident after incident. The process of the first occurrence is as germination, after that it goes through the process for the process as thick blood and then as a fetus. At the perfect moment to be a fetus, God created the spirit in it so that it becomes a living creature. The signs of his life can be known from his heartbeat by sticking his ear to the mother's stomach. Regarding the process of human events in the mother's abdomen, the Prophet Muhammad said: Surely the incident of someone among you in the mother's stomach is the first 40 days of semen (sperm), then becomes' alaqah (something that hangs) at such times again (40 days) , then becomes \"Mudhgah\" (lump of flesh) in such a period (40 days. Then the angel is sent (by Allah), then he blows the spirit to the fetus, and Allah commands to determine 4 things: His sustenance, his age, his charity, whether he Woeful or happy person (Muslim history of Ibn Mas'ud) Besides, Allah explains that when the baby is in the womb, he is in the three darkness, namely on the inside of the membrane covering the baby in the womb so that the baby is protected from the influence decay According to the eye, at first glance the membrane is as if only a layer, but when examined closely, the membrane there are three layers.Scientists explain that three layers make ions that can secure the fetus while in the womb are: 1. The amniotic membrane layer that contains fluids so that the fetus is in a state of swimming. This condition protects the fetus if there is a collision from the outside. In addition, this swimming position provides an opportunity for the fetus to position themselves when they are born. 2. Chorion membrane layer 3. Decidua membrane layer Some researchers connect the three layers of darkness in the above paragraph with the amniotic membrane layer that surrounds the uterus, the uterine wall itself, and the abdominal wall in the abdomen. Allah stresses that the one who does this is Allah, the Creator of man and who rules the heavens and the earth and their contents. Therefore, He has the right to be worshiped. There is no God worthy of worship except Him, the One and Only and has no partners. At the end of the verse, Allah asks the polytheists questions that contain ridicule against them, why they can be turned away from worship only to God, become worshipers of statues, even though they already have the ability to read the signs of oneness and power of God in nature universe and exist in themselves.",
      "text_tafsir": "Allah menunjukkan tanda-tanda kekuasaan-Nya yang ada pada penciptaan diri manusia. Allah menjelaskan bahwa Dia menciptakan manusia pada mulanya seorang saja. Allah menciptakan manusia yang beraneka ragam warna dan bahasanya dari diri Adam. Kemudian Allah menciptakan pasangannya Hawa. \n\nAllah juga menjelaskan bahwa Dia pula yang menciptakan delapan ekor binatang ternak yang berpasang-pasangan. Kambing sepasang, biri-biri sepasang, unta sepasang, dan sapi sepasang.\n\nAllah menjelaskan lebih jauh tentang kejadian manusia. Manusia diciptakan melalui proses kejadian demi kejadian. Proses kejadiannya yang pertama ialah sebagai nutfah, sesudah itu melalui proses demi proses sebagaimana darah kental kemudian sebagai janin. Pada saat sempurna menjadi janin itulah Allah menciptakan roh di dalamnya sehingga menjadi makhluk hidup. Tanda-tanda kehidupannya dapat diketahui dari detak jantungnya dengan menempelkan telinga ke perut sang ibu. Tentang proses kejadian manusia dalam perut ibu, Nabi Muhammad bersabda:\n\nSesungguhnya kejadian seseorang di antara kamu dalam perut ibunya adalah 40 hari pertama berupa air mani (sperma), kemudian menjadi 'alaqah (sesuatu yang menggantung)pada masa seperti itu lagi (40 hari), lalu menjadi \"Mudhgah\"(segumpal daging) dalam masa seperti itu (40 hari. Kemudian malaikat di utus (oleh Allah), lalu dia meniupkan roh kepada janin, dan Allah memerintahkan untuk menetapkan 4 hal: Rezekinya, umurnya, amalnya, apakah dia orang yang celaka atau bahagia.( Riwayat Muslim dari Ibnu Mas'ud)\n\nDi samping itu, Allah menjelaskan bahwa ketika bayi berada dalam kandungan, ia berada dalam tiga kegelapan, yaitu pada bagian dalam selaput yang menutupi bayi dalam rahim sehingga bayi itu terlindung dari pengaruh pembusukan. Menurut pandangan mata, sepintas kilas selaput itu seakan-akan hanya selapis saja, namun bila diteliti dengan seksama, selaput itu ada tiga lapis. \n\nPara ilmuwan menjelaskan bahwa tiga lapis membran yang dapat mengamankan janin selama berada di dalam rahim, adalah:\n\n1.Lapisan membran amnion yang mengandung cairan sehingga janin dalam keadaan berenang. Kondisi demikian ini melindungi janin apabila ada benturan dari luar. Di samping itu, posisi berenang ini memberikan kesempatan kepada janin dalam memposisikan diri saat akan dilahirkan.\n\n2.Lapisan membran chorion\n\n3.Lapisan membran decidua\n\nBeberapa peneliti menghubungkan tiga lapisan kegelapan dalam ayat di atas dengan lapisan membran amniotik yang mengelilingi rahim, dinding rahim itu sendiri, dan dinding abdomen di bagian perut .\n\nAllah menandaskan bahwa yang berbuat demikian itu ialah Allah Pencipta manusia dan yang menguasai langit dan bumi serta isinya. Oleh sebab itu, Dia yang berhak disembah. Tidak ada Tuhan yang patut disembah kecuali Dia, Yang Maha Esa dan tidak mempunyai sekutu.\n\nPada penghujung ayat, Allah menanyakan kepada kaum musyrikin pertanyaan yang mengandung cemoohan terhadap mereka, mengapa mereka dapat dipalingkan dari beribadah hanya kepada Allah, menjadi penyembah patung-patung, padahal mereka telah mempunyai kemampuan untuk membaca tanda-tanda keesaan dan kekuasaan Allah yang ada di alam semesta dan ada pada diri mereka sendiri.",
      "text_translation": "Dia menciptakan kamu dari diri yang satu (Adam) kemudian darinya Dia jadikan pasangannya dan Dia menurunkan delapan pasang hewan ternak untukmu. Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian dalam tiga kegelapan. Yang (berbuat) demikian itu adalah Allah, Tuhan kamu, Tuhan yang memiliki kerajaan. Tidak ada tuhan selain Dia; maka mengapa kamu dapat dipalingkan?",
      "text": "خَلَقَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَاَنْزَلَ لَكُمْ مِّنَ الْاَنْعَامِ ثَمٰنِيَةَ اَزْوَاجٍ ۗ يَخْلُقُكُمْ فِيْ بُطُوْنِ اُمَّهٰتِكُمْ خَلْقًا مِّنْۢ بَعْدِ خَلْقٍ فِيْ ظُلُمٰتٍ ثَلٰثٍۗ ذٰلِكُمُ اللّٰهُ رَبُّكُمْ لَهُ الْمُلْكُۗ  لَآ اِلٰهَ اِلَّا هُوَۚ فَاَنّٰى تُصْرَفُوْنَ",
      "text_translation_en": "He has created you [all] out of one living entity, and out of it fashioned its mate; and he has be­stowed upon you four kinds of cattle of either sex; [and] He creates you in your mothers’ wombs, one act of creation after another, in threefold depths of darkness. Thus is God, your Sustainer: unto Him belongs all dominion: there is no deity save Him: how, then, can you lose sight of the truth?",
      "juz_number": 23
    },
    "7": {
      "text_tafsir_en": "Allah explains that if the Muslims continue to reject His power, while there is sufficient evidence for it, then it is no harm to God. He does not need anything from all his creatures. Allah says: And Moses said, \"If you and all the inhabitants of the earth are disbelieving, then surely Allah is All-Glorious, All-Glorious.\" (Ibrahim \/ 14: 8) In the Qur'an hadith it is explained: \"My servants, if your former and last ones, men and spirits are all assembled in the hearts of the most evil, then such an attitude will not diminish. my power is small. \" (Muslim History of Abu Dzarr al-Gifari) Allah explains that He does not tolerate disbelief for His servants. Such disobedience is fundamentally contrary to the human soul. The human soul and all of God's creatures are created in accordance with the nature of their creation, which is necessarily subject to the conditions of their Creator. However, if they are grateful for the favor of Allah, He will love it, because the situation is in accordance with the nature of the incident, and according to the Sunatullah. Allah says: If you are grateful, I will add to you, but if you deny (my favor), then My punishment will be very severe. (Ibrahim \/ 14: 7) Then God made it clear that everyone, on the Day of Resurrection, would be required to take responsibility for his actions while living on earth. Every sinner is responsible for his sin. He will not bear the sins of others. Then each person will be brought before his Lord to receive an explanation of his charity record as long as he lives in the world. There is not one good or bad thing left. At that time the deeds of each person will be rewarded accordingly. When a charity record is full of good deeds, it will find its place full of enjoyment. But when the deeds of charity are full of evil deeds they find a place full of misery. As the saying of Allah says: And man will only get what he has earned, and indeed his efforts will be revealed (to him), and then will be rewarded with the most perfect reward. (an-Najm \/ 53: 39-41) Keep in mind that one who commits sin, and then another follows it, will receive the additional sin from the sin of the imitator. In this regard, the Messenger of Allah once said: Whoever performs good deeds in Islam, he will receive his reward plus the reward of those who do it until the Day of Judgment without diminishing the merit of that person. And whoever commits a bad habit in Islam, he will be guilty, plus the sin of the one who committed it until the Day of Judgment, without diminishing that person's sin. (The History of Muslim and An-Nasa'i of Abu dzarr) At the end of this verse Allah explains that He is well-aware of what is in his servants' breasts. Thus there can be no act of charity that is detached from the work of God, either that which is witnessed by others or acts known only to the perpetrator.",
      "text_tafsir": "Allah menjelaskan bahwa apabila kaum musyrikin itu tetap mengingkari kemahaesaan-Nya, padahal sudah cukup bukti-bukti untuk itu, maka hal itu sedikit pun tidak merugikan Allah. Dia tidak memerlukan apa pun juga dari seluruh makhluk-Nya.\n\nAllah berfirman:\n\nDan Musa berkata, \"Jika kamu dan orang yang ada di bumi semuanya mengingkari (nikmat Allah), maka sesungguhnya Allah Mahakaya, Maha Terpuji.\" (Ibrahim\/14: 8)\n\nDalam hadis Qudsi dijelaskan:\n\n\"Wahai hamba-hamba-Ku, sekiranya orang-orang yang terdahulu dan yang terakhir dari kamu, manusia dan jin semuanya berkumpul dalam hati seorang yang paling jahat, maka sikap demikian itu tidaklah mengurangi kekuasaan-Ku sedikit pun.\" (Riwayat Muslim dari Abu dzarr al-Gifari)\n\nAllah menjelaskan bahwa Dia tidak merelakan kekafiran bagi para hamba-Nya. Keingkaran itu pada dasarnya bertentangan dengan jiwa manusia. Jiwa manusia dan seluruh makhluk Allah diciptakan sesuai dengan fitrah kejadiannya, yang semestinya tunduk kepada ketentuan-ketentuan Penciptanya. Akan tetapi, apabila mereka itu mensyukuri nikmat Allah, tentu Dia menyukainya, karena keadaan serupa itu memang sesuai dengan fitrah kejadiannya, dan sesuai dengan sunatullah.\n\nAllah berfirman:\n\nSesungguhnya jika kamu bersyukur, niscaya Aku akan menambah (nikmat) kepadamu, tetapi jika kamu mengingkari (nikmat-Ku), maka pasti azab-Ku sangat berat. (Ibrahim\/14: 7) \n\nKemudian Allah menjelaskan bahwa tiap orang, pada hari Kiamat, akan dituntut untuk mempertanggungjawabkan amal perbuatannya ketika hidup di dunia. Tiap-tiap orang yang berdosa bertanggung jawab atas perbuatan dosanya. Ia tidak akan memikul dosa orang lain. Sesudah itu tiap-tiap orang akan digiring menghadap Tuhannya untuk menerima penjelasan tentang catatan amalnya selama ia hidup di dunia. Tak ada satu perbuatan baik atau buruk yang tertinggal. Pada saat itu amal perbuatan masing-masing orang akan mendapat pembalasan yang setimpal. Apabila catatan amalnya penuh dengan perbuatan baik, niscaya ia mendapat tempat yang penuh dengan kenikmatan. Tetapi apabila catatan-catatan amalnya penuh dengan perbuatan buruk niscaya ia mendapat tempat yang penuh dengan penderitaan. Sebagaimana firman Allah:\n\nDan bahwa manusia hanya memperoleh apa yang telah diusahakannya, dan sesungguhnya usahanya itu kelak akan diperlihatkan (kepadanya), kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna. (an-Najm\/53: 39-41)\n\nPerlu diingat bahwa seseorang yang berbuat kemungkaran, kemudian ada orang lain yang mengikutinya, maka ia akan mendapat tambahan dosa dari kemungkaran yang dilakukan orang yang menirunya. Sehubungan dengan hal ini, Rasulullah pernah mengungkapkan sebagai berikut:\n\nSiapa saja yang membuat kebiasaan yang baik dalam Islam, maka ia akan mendapat pahalanya ditambah pahala orang yang melakukannya sampai hari Kiamat tanpa mengurangi pahala orang itu sedikit pun. Dan siapa saja yang melakukan kebiasaan buruk dalam Islam, maka ia akan mendapat dosanya, ditambah dosa orang yang melakukannya sampai hari Kiamat, tanpa dikurangi dosa orang itu sedikit pun. (Riwayat Muslim dan an-Nasa'i dari Abu dzarr)\n\nPada penghujung ayat ini Allah menjelaskan, bahwa Dia Maha Mengetahui apa yang tersimpan dalam dada para hamba-Nya. Dengan demikian tidak mungkin ada amal perbuatan yang luput dari perbuatan Allah, baik perbuatan yang dapat disaksikan oleh orang lain atau pun perbuatan yang hanya diketahui oleh si pelaku itu sendiri.",
      "text_translation": "Jika kamu kafir (ketahuilah) maka sesungguhnya Allah tidak memerlukanmu dan Dia tidak meridai kekafiran hamba-hamba-Nya. Jika kamu bersyukur, Dia meridai kesyukuranmu itu. Seseorang yang berdosa tidak memikul dosa orang lain. Kemudian kepada Tuhanmulah kembalimu lalu Dia beritakan kepadamu apa yang telah kamu kerjakan. Sungguh, Dia Maha Mengetahui apa yang tersimpan dalam dada(mu).",
      "text": "اِنْ تَكْفُرُوْا فَاِنَّ اللّٰهَ غَنِيٌّ عَنْكُمْ ۗوَلَا يَرْضٰى لِعِبَادِهِ الْكُفْرَۚ وَاِنْ تَشْكُرُوْا يَرْضَهُ لَكُمْۗ وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰىۗ ثُمَّ اِلٰى رَبِّكُمْ مَّرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَۗ اِنَّهٗ عَلِيْمٌ ۢبِذَاتِ الصُّدُوْرِ",
      "text_translation_en": "If you are ingrate behold, God has no need of you; none the less, He does not approve of in­gratitude in His servants: whereas, if you show grati­tude, He approves it in you. And no bearer of burdens shall be made to bear another’s burden. In time, unto your Sustainer you all must return, and then He will make you [truly] understand all that you were doing [in life]: for, verily, He has full knowledge of what is in the hearts [of men].",
      "juz_number": 23
    },
    "8": {
      "text_tafsir_en": "Allah describes the attitude of those who disregard Allah's favor. When he is afflicted with any kind of disease or misery that threatens his life, he asks God for help, so that his illness or suffering will be eliminated. He even professed repentance, apologizing for his past misdeeds. However, when he finds favor in which his illness and suffering are gone, he forgets the words he declared when he prayed. Then they created other gods as allies of Allah. Not only are they misleading themselves, but they are also misleading others, preventing those who claim to be religious. At the end of the verse, God commands His Messenger to say to those who deny the favor of God, \"Satisfy yourself by fulfilling your desire while living in the world; In the day of reckoning, you will know for a certainty that you will be a hell of torment. \"",
      "text_tafsir": "Allah menjelaskan sikap orang yang mengingkari nikmat Allah. Apabila ia ditimpa kemudaratan baik berupa penyakit atau pun penderitaan yang menimpa kehidupannya, ia memohon pertolongan kepada Allah, agar penyakitnya atau penderitaannya dilenyapkan. Ia pun menyatakan diri bertobat, meminta ampun atas perbuatan buruknya di masa yang telah lalu. Akan tetapi, apabila ia mendapatkan nikmat dimana penyakit dan penderitaannya telah hilang lenyap, ia lupa akan perkataan yang diikrarkan pada saat dia berdoa. Kemudian mereka mengada-adakan tuhan-tuhan yang lain sebagai sekutu bagi Allah. Mereka tidak saja menyesatkan diri mereka, tetapi menyesatkan pula orang lain, menghalang-halangi orang yang mengikrarkan dirinya sebagai orang yang beragama tauhid.\n\nDi akhir ayat, Allah memerintahkan kepada rasul-Nya agar mengatakan kepada orang yang mengingkari nikmat Allah itu, \"Puaskanlah dirimu dengan melaksanakan keinginanmu sewaktu hidup di dunia, nikmatilah kelezatannya yang tidak lama masanya, hingga ajal merenggut jiwamu. Pada saat itu kamu akan menyesali perbuatanmu. Pada hari perhitungan nanti, kamu akan mengetahui dengan pasti bahwa kamu akan menjadi penghuni neraka yang penuh dengan siksaan.\"",
      "text_translation": "Dan apabila manusia ditimpa bencana, dia memohon (pertolongan) kepada Tuhannya dengan kembali (taat) kepada-Nya; tetapi apabila Dia memberikan nikmat kepadanya dia lupa (akan bencana) yang pernah dia berdoa kepada Allah sebelum itu, dan diadakannya sekutu-sekutu bagi Allah untuk menyesatkan (manusia) dari jalan-Nya. Katakanlah, “Bersenang-senanglah kamu dengan kekafiranmu itu untuk sementara waktu. Sungguh, kamu termasuk penghuni neraka.”",
      "text": "وَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ دَعَا رَبَّهٗ مُنِيْبًا اِلَيْهِ ثُمَّ اِذَا خَوَّلَهٗ نِعْمَةً مِّنْهُ نَسِيَ مَا كَانَ يَدْعُوْٓا اِلَيْهِ مِنْ قَبْلُ وَجَعَلَ لِلّٰهِ اَنْدَادًا لِّيُضِلَّ عَنْ سَبِيْلِهٖ ۗ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيْلًا ۖاِنَّكَ مِنْ اَصْحٰبِ النَّارِ",
      "text_translation_en": "NOW [thus it is:] when affliction befalls man, he is likely to cry out to his Sustainer, turning unto Him [for help]; but as soon as He has bestowed upon him a boon by His grace, he forgets Him whom he in­voked before, and claims that there are other powers that could rival God - and thus leads [others] astray from His path. Say [unto him who sins in this way]: “Enjoy thyself for a while in this thy denial of the truth; [yet,] verily, thou art of those who are destined for the fire!",
      "juz_number": 23
    },
    "9": {
      "text_tafsir_en": "Then Allah commanded His Messenger to ask the unbelievers of Mecca whether they were more fortunate than those who worshiped at night in prostration and stood up in earnest. In carrying out the worship, he had in his heart a fear of the torment of Allah in the hereafter, and expressed his hope for God's mercy. The same command was given by God to His Messenger to ask them whether those who know and those who do not know. The ones who know it are those who know the reward they will receive, for their good deeds, and the punishment they will receive if they commit iniquity. But those who do not know are those who do not know it at all, for they have no hope of rewarding for their good deeds, and do not expect at all to be punished for their evil deeds. At the end of the verse, God declares that only wise men can take lessons. The lesson is either from his life experience or from the signs of God's greatness in heaven and on earth and its contents, as well as in himself or in the example of the past.",
      "text_tafsir": "Kemudian Allah memerintahkan kepada Rasul-Nya agar menanyakan kepada orang-orang kafir Mekah, apakah mereka lebih beruntung daripada orang yang beribadah di waktu malam dengan sujud dan berdiri dengan sangat khusyuk. Dalam melaksanakan ibadah itu, timbullah dalam hatinya rasa takut kepada azab Allah di akhirat, dan memancarlah harapannya akan rahmat Allah.\n\nPerintah yang sama diberikan Allah kepada Rasul-Nya agar menanyakan kepada mereka apakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui. Yang dimaksud dengan orang-orang yang mengetahui ialah orang-orang yang mengetahui pahala yang akan diterimanya, karena amal perbuatannya yang baik, dan siksa yang akan diterimanya apabila ia melakukan maksiat. Sedangkan orang-orang yang tidak mengetahui ialah orang-orang yang sama sekali tidak mengetahui hal itu, karena mereka tidak mempunyai harapan sedikit pun akan mendapat pahala dari perbuatan baiknya, dan tidak menduga sama sekali akan mendapat hukuman dari amal buruknya.\n\nDi akhir ayat, Allah menyatakan bahwa hanya orang-orang yang berakal yang dapat mengambil pelajaran. Pelajaran tersebut baik dari pengalaman hidupnya atau dari tanda-tanda kebesaran Allah yang terdapat di langit dan di bumi serta isinya, juga yang terdapat pada dirinya atau teladan dari kisah umat yang lalu.",
      "text_translation": "(Apakah kamu orang musyrik yang lebih beruntung) ataukah orang yang beribadah pada waktu malam dengan sujud dan berdiri, karena takut kepada (azab) akhirat dan mengharapkan rahmat Tuhannya? Katakanlah, “Apakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui?” Sebenarnya hanya orang yang berakal sehat yang dapat menerima pelajaran.",
      "text": "اَمَّنْ هُوَ قَانِتٌ اٰنَاۤءَ الَّيْلِ سَاجِدًا وَّقَاۤىِٕمًا يَّحْذَرُ الْاٰخِرَةَ وَيَرْجُوْا رَحْمَةَ رَبِّهٖۗ قُلْ هَلْ يَسْتَوِى الَّذِيْنَ يَعْلَمُوْنَ وَالَّذِيْنَ لَا يَعْلَمُوْنَ ۗ اِنَّمَا يَتَذَكَّرُ اُولُوا الْاَلْبَابِ ࣖ",
      "text_translation_en": "Or [dost thou deem thyself equal to] one who devoutly worships [God] throughout the night, prostrating himself or standing [in prayer], ever- mindful of the life to come, and hoping for his Sustainer’s grace?” Say: “Can they who know and they who do not know be deemed equal?” [But] only they who are endowed with insight keep this in mind!",
      "juz_number": 23
    },
    "10": {
      "text_tafsir_en": "God commanded His Messenger to call upon all His servants and admonish them to remain faithful to Allah, to obey all His commandments and to abstain from all His prohibitions. Humans are commanded to be fearful because those who do good in this world will benefit. They will be rewarded with health, well-being, and success in carrying out their tasks. All this is possible because he is always good-natured and virtuous as is often practiced by the guilty. In addition, he will be benefited in the Hereafter, that is, a place full of enjoyment, and God's will. Allah also commanded the Muslims to prepare for the pilgrimage to Medina, and to encourage them to be resolute because they were separated from their homeland, their relatives, and their people. The order was given by explaining that if the Muslims were to be deprived of their freedom to carry out the command of God in Mecca, they would have to migrate to other countries where they could be at peace in doing the commandments of God. This commandment is written in the short Word of God \"And the earth of God is vast.\" Allah says: \"Is not the earth of Allah so broad that you may migrate (it)?\" (an-Nisa '\/ 4: 97) At the end of the verse, God explains that only those who are patient will receive unlimited reward, as their predecessors felt.",
      "text_tafsir": "Allah memerintahkan kepada Rasul-Nya agar menyeru seluruh hamba Allah dan menasihati mereka agar tetap bertakwa kepada Allah, menaati seluruh perintah-Nya dan menjauhi semua larangan-Nya. Manusia diperintahkan agar bertakwa karena mereka yang berbuat baik di dunia ini akan mendapat kebaikan pula. Mereka akan dianugerahi kesehatan, kesejahteraan, dan kesuksesan dalam melaksanakan tugas-tugas hidupnya. Semua itu dapat dicapai karena ia selalu berakhlak baik dan berbudi luhur seperti yang biasa dilakukan oleh orang-orang yang bertakwa. Di samping itu, ia akan mendapat kebaikan pula di akhirat, yaitu mendapat tempat yang penuh dengan kenikmatan, dan mendapat keridaan Allah.\n\nAllah juga menyuruh kaum Muslimin untuk mempersiapkan diri melakukan hijrah ke Medinah, serta menyuruh mereka agar bersikap tabah karena terpisah dari tanah air, sanak keluarga, dan handai taulan. Perintah itu diberikan dengan penjelasan bahwa apabila kaum Muslimin terganggu kebebasannya dalam melakukan perintah Allah di Mekah, maka hendaklah hijrah ke negeri lain yang memungkinkan untuk memberi ketenangan dalam melakukan perintah-perintah Allah.\n\nPerintah ini terlukis dalam firman Allah yang singkat \"Dan bumi Allah itu adalah luas.\"\n\nAllah berfirman:\n\n\"Bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah (berpindah-pindah) di bumi itu?\" (an-Nisa'\/4: 97)\n\nDi akhir ayat, Allah menjelaskan bahwa hanya orang-orang yang bersabarlah yang akan mendapat pahala yang tak terbatas, seperti dirasakan oleh umat yang terdahulu dari mereka.",
      "text_translation": "Katakanlah (Muhammad), “Wahai hamba-hamba-Ku yang beriman! Bertakwalah kepada Tuhanmu.” Bagi orang-orang yang berbuat baik di dunia ini akan memperoleh kebaikan. Dan bumi Allah itu luas. Hanya orang-orang yang bersabarlah yang disempurnakan pahalanya tanpa batas.",
      "text": "قُلْ يٰعِبَادِ الَّذِيْنَ اٰمَنُوا اتَّقُوْا رَبَّكُمْ ۗلِلَّذِيْنَ اَحْسَنُوْا فِيْ هٰذِهِ الدُّنْيَا حَسَنَةٌ  ۗوَاَرْضُ اللّٰهِ وَاسِعَةٌ  ۗاِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ ",
      "text_translation_en": "Say: “[Thus speaks God:] ‘O you servants of Mine who have attained to faith! Be conscious of your Sustainer! Ultimate good awaits those who per­severe in doing good in this world. And [remember:] wide is God’s earth, [and,] verily, they who are patient in adversity will be given their reward in full, beyond all reckoning!’”",
      "juz_number": 23
    },
    "11": {
      "text_tafsir_en": "In this verse, God commands his apostle to tell the Meccans of the Meccans that he is commanded to worship God and obey his commands by purifying their obedience to him in religious matters. From this evidence it can be understood that worship other than Allah must be eradicated to its roots. Similarly, in matters of religion, the guidelines are commands that come from God, not based on people's opinions.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan kepada rasul-Nya agar mengatakan kepada kaum musyrikin Mekah bahwa dia diperintahkan untuk menyembah Allah dan menaati perintah-Nya dengan memurnikan ketaatan kepada-Nya dalam menjalankan urusan agama. Dari keterangan ini dapat dipahami bahwa sembahan-sembahan selain Allah harus dibasmi sampai ke akar-akarnya. Begitu pula mengenai urusan-urusan keagamaan, pedomannya adalah perintah yang datang dari Allah, tidak boleh berdasarkan pendapat orang.",
      "text_translation": "Katakanlah, “Sesungguhnya aku diperintahkan agar menyembah Allah dengan penuh ketaatan kepada-Nya dalam (menjalankan) agama.",
      "text": "قُلْ اِنِّيْٓ اُمِرْتُ اَنْ اَعْبُدَ اللّٰهَ مُخْلِصًا لَّهُ الدِّيْنَ",
      "text_translation_en": "Say [O Muhammad]: “Behold, I am bidden to worship God, sincere in my faith in Him alone;",
      "juz_number": 23
    },
    "12": {
      "text_tafsir_en": "The Prophet was also ordered to be the first to surrender to Allah. Thus, the Prophet became an exemplary believer who should imitate his actions and avoid what he prohibits. He was exemplary in purifying monotheism, purifying worship, and purifying himself from the conduct and deeds of the Meccans. Self-surrender referred to in this verse is subject to all the provisions of Allah, either in connection with the precepts of the Shari'ah or submissive and abiding by the provisions of Allah in connection with the Sunnah of the Kauniyah.",
      "text_tafsir": "Rasulullah juga diperintahkan menjadi orang yang pertama kali berserah diri kepada Allah. Dengan demikian, Rasulullah menjadi suri teladan yang harus dicontoh seluruh perbuatannya dan dijauhi apa yang dilarangnya. Dia menjadi teladan dalam hal memurnikan tauhid, memurnikan ibadah, dan membersihkan diri dari tingkah laku dan perbuatan orang-orang musyrik Mekah.\n\nBerserah diri yang dimaksud dalam ayat ini ialah tunduk pada seluruh ketentuan Allah, baik yang berhubungan dengan perintah-perintah syara' atau pun tunduk dan patuh terhadap ketentuan Allah yang berhubungan dengan sunnah kauniyah.",
      "text_translation": "Dan aku diperintahkan agar menjadi orang yang pertama-tama berserah diri.”",
      "text": "وَاُمِرْتُ لِاَنْ اَكُوْنَ اَوَّلَ الْمُسْلِمِيْنَ",
      "text_translation_en": "and I am bidden to be foremost among those who surrender themselves unto God.”",
      "juz_number": 23
    },
    "13": {
      "text_tafsir_en": "In this verse, the Messenger of Allah was also ordered to fear the violation of Allah's prohibitions, such as not doing sincerely in carrying out His commands and despising Him. When he is afraid of breaking his restrictions, he is afraid of the terrible punishment that will come on the day of reckoning. On that day all human deeds, good or bad, are examined and rewarded accordingly.",
      "text_tafsir": "Pada ayat ini, Rasulullah juga diperintahkan agar merasa takut melanggar larangan-larangan Allah, seperti tidak berbuat ikhlas dalam menjalankan perintah dan mengesakan-Nya. Apabila ia takut melanggar larangan-larangan-Nya berarti takut akan siksa yang amat dahsyat yang akan ditimpakan pada hari perhitungan. Pada hari itu semua perbuatan manusia baik atau pun buruk diperiksa dan diberi balasan yang setimpal.",
      "text_translation": "Katakanlah, “Sesungguhnya aku takut akan azab pada hari yang besar jika aku durhaka kepada Tuhanku.”",
      "text": "قُلْ اِنِّيْٓ اَخَافُ اِنْ عَصَيْتُ رَبِّيْ عَذَابَ يَوْمٍ عَظِيْمٍ",
      "text_translation_en": "Say: “Behold, I would dread, were I to rebel against my Sustainer, the suffering [which would befall me] on that awesome Day [of Judgment].”",
      "juz_number": 23
    },
    "14": {
      "text_tafsir_en": "Then Allah commanded His Messenger to tell his people that only Allah did he worship and that for Him he purified obedience in religious matters. From this verse it can be understood that in the performance of religious matters there must be a clear dividing line, not to be confused between confessing God and associating Him. Which are ordered by religion and which are not ordered. In matters of faith and worship there is no compromise, in world affairs and prosperity, it can be solved by ijtihad, since its principles are not in conflict with religious teachings.",
      "text_tafsir": "Sesudah itu Allah memerintahkan kepada Rasul-Nya agar mengatakan kepada kaumnya bahwa hanya Allah saja yang ia sembah dan hanya untuk-Nya ia memurnikan ketaatan dalam menjalankan urusan agama. Dari ayat ini dapatlah diambil pengertian bahwa dalam melaksanakan urusan keagamaan harus ada garis pemisah yang tegas, tidak boleh dicampuradukkan antara mengesakan Allah dengan mempersekutukan-Nya. Antara yang diperintahkan oleh agama dan mana yang tidak diperintahkan. Dalam urusan akidah dan ibadah tidak ada kompromi, sedang dalam urusan dunia dan kemaslahatan, boleh dipecahkan dengan ijtihad, asal prinsipnya tidak bertentangan dengan ajaran agama.",
      "text_translation": "Katakanlah, “Hanya Allah yang aku sembah dengan penuh ketaatan kepada-Nya dalam (menjalankan) agamaku.”",
      "text": "قُلِ اللّٰهَ اَعْبُدُ مُخْلِصًا لَّهٗ دِيْنِيْۚ",
      "text_translation_en": "Say: “God alone do I worship, sincere in my faith in Him alone -",
      "juz_number": 23
    },
    "15": {
      "text_tafsir_en": "In this verse, God commands His Messenger to speak to the Meccans, and allow them to worship the statues according to their will. They have been warned over and over and over again and again. However, they are still firm in their stance on following their forefathers based only on ideas that are far from the truth. As a final affirmation, the Prophet was ordered to declare to them that the losers were the ones who were harming themselves. This means that when they are rewarded with a terrible punishment, there is no other suffering for their own actions. The loss and misery do not only affect them, but also their own families. At the end of this verse, God emphasizes that such losses and sufferings are real losses and sufferings, for there is no greater loss and suffering than the loss they suffered on the Day of Judgment.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan Rasul-Nya agar mengatakan kepada kaum musyrik Mekah, dan membiarkan mereka menyembah patung-patung itu menurut kehendak mereka. Mereka telah diberi peringatan berulang-ulang dan diberi bimbingan berkali-kali. Akan tetapi, mereka masih tetap juga pada pendirian mereka mengikuti jejak nenek moyang mereka yang hanya berdasarkan dugaan-dugaan yang jauh dari kebenaran.\n\nSebagai penegasan yang terakhir, Rasulullah diperintahkan untuk menyatakan kepada mereka bahwa orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri. Berarti apabila mereka nanti diberi pembalasan dengan azab yang dahsyat, tiada lain penderitaan itu karena perbuatan mereka sendiri. Kerugian dan penderitaan itu tidak hanya menimpa mereka, tetapi juga menimpa keluarga mereka yang sependirian dengan mereka.\n\nPada penghujung ayat ini, Allah menandaskan bahwa kerugian dan penderitaan serupa itu adalah kerugian dan penderitaan yang nyata, karena tidak ada kerugian dan penderitaan yang lebih dahsyat daripada kerugian yang mereka derita di hari kiamat.",
      "text_translation": "Maka sembahlah selain Dia sesukamu! (wahai orang-orang musyrik). Katakanlah, “Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari Kiamat.” Ingatlah! Yang demikian itu adalah kerugian yang nyata.",
      "text": "فَاعْبُدُوْا مَا شِئْتُمْ مِّنْ دُوْنِهٖۗ قُلْ اِنَّ الْخٰسِرِيْنَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ وَاَهْلِيْهِمْ يَوْمَ الْقِيٰمَةِۗ  اَلَا ذٰلِكَ هُوَ الْخُسْرَانُ الْمُبِيْنُ",
      "text_translation_en": "and [it is up to you, O sinners, to] worship whatever you please instead of Him!” Say: “Behold, the [true] losers will be they who shall have lost their own selves and their kith and kin on Resurrection Day: for is not this, this, the [most] obvious loss?",
      "juz_number": 23
    },
    "16": {
      "text_tafsir_en": "In this verse, God describes the suffering they are experiencing. They will be set in the midst of fiery hell. At the top there is a coating of fire and underneath it. They are on the verge of suffering, as they are surrounded by the fire of hell. Allah says: In the day when the punishment will cover them from above and below their feet, and (Allah) will say, \"Recall what you have done!\" (al-'Ankabut \/ 29: 55) And his word is: To them the mats sleep from the fire of hell, and upon them is a blanket. (al-A.'raf \/ 7: 41) The terrible torments which Allah has brought forth are nothing but to scare His servants, that they may realize and understand and return to the straight path, the way that the Messenger of Allah (may peace be upon him) has shown. ask God for the sins they have committed. At the end of the verse, God commands His Messenger to call upon His servants to be obedient, to obey His commandments, and to abstain from His prohibition. It calls forth the nature of God's love for His servants and His priceless wisdom.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan derita yang mereka alami. Mereka akan diletakkan di tengah-tengah api neraka yang berlapis-lapis. Di bagian atas terdapat api yang berlapis-lapis dan di bawahnya pun demikian pula. Mereka berada di puncak derita, karena mereka dikepung oleh api neraka.\n\nAllah berfirman:\n\nPada hari (ketika) azab menutup mereka dari atas dan dari bawah kaki mereka dan (Allah) berkata (kepada mereka), \"Rasakanlah (balasan dari) apa yang telah kamu kerjakan!\" (al-'Ankabut\/29: 55)\n\nDan firman-Nya:\n\nBagi mereka tikar tidur dari api neraka dan di atas mereka ada selimut (api neraka). (al-A.'raf\/7: 41)\n\nSiksa-siksa yang dahsyat itu dikemukakan Allah tiada lain hanyalah untuk menakut-nakuti hamba-Nya, agar mereka sadar dan insaf serta kembali kepada jalan yang lurus, jalan yang ditunjukkan Rasulullah saw serta suka memohon ampun kepada Allah atas dosa-dosa yang telah mereka kerjakan.\n\nPada akhir ayat, Allah memerintahkan Rasul-Nya agar menyeru para hamba-Nya agar bertakwa, suka menaati perintah-Nya, dan menjauhi larangan-Nya. Seruan itu menunjukkan sifat kasih sayang Allah terhadap hamba-hamba-Nya dan kebijaksanaan-Nya yang tak ternilai tingginya.",
      "text_translation": "Di atas mereka ada lapisan-lapisan dari api dan di bawahnya juga ada lapisan-lapisan yang disediakan bagi mereka. Demikianlah Allah mengancam hamba-hamba-Nya (dengan azab itu). “Wahai hamba-hamba-Ku, maka bertakwalah kepada-Ku.”",
      "text": "لَهُمْ مِّنْ فَوْقِهِمْ ظُلَلٌ مِّنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ  ۗذٰلِكَ يُخَوِّفُ اللّٰهُ بِهٖ عِبَادَهٗ ۗيٰعِبَادِ فَاتَّقُوْنِ",
      "text_translation_en": "Clouds of fire will they have above them, and [similar] clouds beneath them…” In this way does God imbue His servants with fear. O you servants of Mine! Be, then, conscious of Me -",
      "juz_number": 23
    },
    "17": {
      "text_tafsir_en": "This verse describes those who are always watching over themselves and refraining from worshiping idols, idols, and stubbornness in the face of demonic temptations, selfishness and worship of God alone, worshiping none other than Him. They will receive glad tidings from the apostles that they will be spared from the doom of the grave after death, the misery in the Field of Maharsar. They will enjoy eternal happiness in heaven. Therefore, the Prophet Muhammad was commanded to give glad tidings to his people who were always worshiping Allah, and always heard the right words, and to do the best of all the right words. They will also earn what the faithful servants of God earn. They are the people who always follow the guidance of God and always use good sense. Ibn Abi narrated from Zaid bin Aslam that this verse was passed in reference to three companions of the Prophet, namely, Zaid bin 'Amr, Abu dzarr al-Gifari, and Salman al-Farisi, three of whom were people who uttered the phrase \"La ilaha illallah \"in the Arabian period of ignorance.",
      "text_tafsir": "Ayat ini menerangkan orang-orang yang selalu menjaga dirinya dan menghindarkan diri dari menyembah thagut, berhala, serta tabah dalam menghadapi godaan setan, menghambakan diri dan menyembah kepada Allah semata, tidak menyembah selain-Nya. Mereka akan memperoleh kabar gembira dari para rasul bahwa mereka akan terhindar dari azab kubur sesudah mati, kesengsaraan di Padang Mahsyar. Mereka akan mendapat kenikmatan yang abadi di dalam surga. Oleh karena itu, Nabi Muhammad diperintahkan untuk memberi kabar gembira kepada umatnya yang selalu menyembah Allah, dan selalu mendengar perkataan yang benar, serta mengerjakan mana yang paling baik dari semua perkataan yang benar itu. Mereka pun akan memperoleh apa yang diperoleh oleh hamba-hamba Allah yang takwa. Mereka adalah orang-orang yang selalu mengikuti petunjuk Allah dan selalu menggunakan akal yang sehat.\n\nDiriwayatkan oleh Ibnu Abi hatim dari Zaid bin Aslam bahwa ayat ini diturunkan berhubungan dengan tiga sahabat Rasulullah, yaitu Zaid bin 'Amr, Abu dzarr al-Gifari, dan Salman al-Farisi, ketiga orang itu adalah orang-orang yang pernah mengucapkan kalimat \"La ilaha illallah\" di masa Arab Jahiliah.",
      "text_translation": "Dan orang-orang yang menjauhi tagut (yaitu) tidak menyembahnya dan kembali kepada Allah, mereka pantas mendapat berita gembira; sebab itu sampaikanlah kabar gembira itu kepada hamba-hamba-Ku,",
      "text": "وَالَّذِيْنَ اجْتَنَبُوا الطَّاغُوْتَ اَنْ يَّعْبُدُوْهَا وَاَنَابُوْٓا اِلَى اللّٰهِ لَهُمُ الْبُشْرٰىۚ فَبَشِّرْ عِبَادِۙ",
      "text_translation_en": "seeing that for those who shun the powers of evil lest they [be tempted to] worship them, and turn unto God instead, there is the glad tiding [of happiness in the life to come]. Give, then, this glad tiding to [those of] My ser­vants",
      "juz_number": 23
    },
    "18": {
      "text_tafsir_en": "This verse describes those who are always watching over themselves and refraining from worshiping idols, idols, and stubbornness in the face of demonic temptations, selfishness and worship of God alone, worshiping none other than Him. They will receive glad tidings from the apostles that they will be spared from the doom of the grave after death, the misery in the Field of Maharsar. They will enjoy eternal happiness in heaven. Therefore, the Prophet Muhammad was commanded to give glad tidings to his people who were always worshiping Allah, and always heard the right words, and to do the best of all the right words. They will also earn what the faithful servants of God earn. They are the people who always follow the guidance of God and always use good sense. Ibn Abi narrated from Zaid bin Aslam that this verse was passed in reference to three companions of the Prophet, namely, Zaid bin 'Amr, Abu dzarr al-Gifari, and Salman al-Farisi, three of whom were people who uttered the phrase \"La ilaha illallah \"in the Arabian period of ignorance.",
      "text_tafsir": "Ayat ini menerangkan orang-orang yang selalu menjaga dirinya dan menghindarkan diri dari menyembah thagut, berhala, serta tabah dalam menghadapi godaan setan, menghambakan diri dan menyembah kepada Allah semata, tidak menyembah selain-Nya. Mereka akan memperoleh kabar gembira dari para rasul bahwa mereka akan terhindar dari azab kubur sesudah mati, kesengsaraan di Padang Mahsyar. Mereka akan mendapat kenikmatan yang abadi di dalam surga. Oleh karena itu, Nabi Muhammad diperintahkan untuk memberi kabar gembira kepada umatnya yang selalu menyembah Allah, dan selalu mendengar perkataan yang benar, serta mengerjakan mana yang paling baik dari semua perkataan yang benar itu. Mereka pun akan memperoleh apa yang diperoleh oleh hamba-hamba Allah yang takwa. Mereka adalah orang-orang yang selalu mengikuti petunjuk Allah dan selalu menggunakan akal yang sehat.\n\nDiriwayatkan oleh Ibnu Abi hatim dari Zaid bin Aslam bahwa ayat ini diturunkan berhubungan dengan tiga sahabat Rasulullah, yaitu Zaid bin 'Amr, Abu dzarr al-Gifari, dan Salman al-Farisi, ketiga orang itu adalah orang-orang yang pernah mengucapkan kalimat \"La ilaha illallah\" di masa Arab Jahiliah.",
      "text_translation": "(yaitu) mereka yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah orang-orang yang mempunyai akal sehat.",
      "text": "الَّذِيْنَ يَسْتَمِعُوْنَ الْقَوْلَ فَيَتَّبِعُوْنَ اَحْسَنَهٗ ۗ اُولٰۤىِٕكَ الَّذِيْنَ هَدٰىهُمُ اللّٰهُ وَاُولٰۤىِٕكَ هُمْ اُولُوا الْاَلْبَابِ",
      "text_translation_en": "who listen [closely] to all that is said, and follow the best of it: [for] it is they whom God has graced with His guidance, and it is they who are [truly] endowed with insight!",
      "juz_number": 23
    },
    "19": {
      "text_tafsir_en": "In this verse the opposite of the characteristics of the people mentioned in the verse before this verse are those who say they are able to carry out everything and are able to overcome all kinds of difficulties. They denounced God by saying, \"Are you in control of all human affairs, regulating and controlling their situation? Can you change My decision by canceling the punishment that I have set against those who always pollute their souls by doing all kinds of sins. and do the things which I forbid? \" God insists that they can never erase and change any of His decisions in the slightest, because the provisions of all things are in His hands.",
      "text_tafsir": "Pada ayat ini diterangkan kebalikan dari sifat-sifat orang yang disebutkan pada ayat sebelum ayat ini, yaitu mereka yang mengatakan sanggup melaksanakan segala sesuatu dan sanggup pula mengatasi segala macam kesulitan. Mereka dicela Allah dengan mengatakan, \"Apakah kamu yang mengendalikan segala urusan manusia, mengatur dan mengendalikan keadaan mereka? Apakah kamu dapat mengubah keputusan-Ku dengan membatalkan ketetapan azab yang telah Aku tetapkan terhadap orang-orang yang selalu mengotori jiwanya dengan mengerjakan segala macam perbuatan dosa dan mengerjakan perbuatan-perbuatan yang Aku larang?\" Allah menegaskan bahwa mereka sekali-kali tidak dapat menghapus dan mengubah segala macam keputusan-Nya sedikit pun, karena ketentuan segala sesuatu berada di tangan-Nya.",
      "text_translation": "Maka apakah (engkau hendak mengubah nasib) orang-orang yang telah dipastikan mendapat azab? Apakah engkau (Muhammad) akan menyelamatkan orang yang berada dalam api neraka?",
      "text": "اَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِۗ اَفَاَنْتَ تُنْقِذُ مَنْ فِى النَّارِ ۚ",
      "text_translation_en": "On the other hand, could one on whom [God’s] sentence of suffering has been passed [be rescued by man]? Couldst thou, perchance, save one who is [already, as it were,] in the fire?",
      "juz_number": 23
    },
    "20": {
      "text_tafsir_en": "In this verse, we are repeating the deeds of Allah, which are all acts of piety, compulsory acts, and sunah. The people who do these things will be placed later in the rooms of heaven with all the things they want in them and decorated with beautiful gardens that flow into the river. That is the promise of God to all who believe and fear. That promise is a true promise, never to be denied, for God will not break His promise.",
      "text_tafsir": "Pada ayat ini diulangi lagi penyebutan perbuatan-perbuatan yang diridai Allah, yaitu segala perbuatan takwa, perbuatan wajib, dan sunah. Orang yang mengerjakan perbuatan-perbuatan tersebut akan ditempatkan nanti di dalam kamar-kamar surga yang terdapat segala macam yang mereka inginkan di dalamnya dan dihiasi dengan taman-taman yang indah yang mengalir sungai-sungai di dalamnya. Itulah janji Allah kepada setiap orang yang beriman dan bertakwa. Janji itu adalah janji yang benar, tidak akan dimungkiri sedikit pun, karena Allah tidak akan memungkiri janji-Nya.",
      "text_translation": "Tetapi orang-orang yang bertakwa kepada Tuhannya, mereka mendapat kamar-kamar (di surga), di atasnya terdapat pula kamar-kamar yang dibangun (bertingkat-tingkat), yang mengalir di bawahnya sungai-sungai. (Itulah) janji Allah. Allah tidak akan memungkiri janji(-Nya).",
      "text": "لٰكِنِ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِّنْ فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ  ۙتَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ەۗ وَعْدَ اللّٰهِ ۗ لَا يُخْلِفُ اللّٰهُ الْمِيْعَادَ",
      "text_translation_en": "As against this they who of their Sustainer are conscious shall [in the life to come] have man­sions raised upon mansions high, beneath which run­ning waters flow: [this is] God’s promise - [and] never does God fail to fulfill His promise.",
      "juz_number": 23
    },
    "21": {
      "text_tafsir_en": "In this verse God instructs people to think of one of the processes of events in nature, namely the process of rain and the growth of plants on the surface of the earth. If you pay attention as if the event is a cycle that starts at a point in a circle, starts from the existence of something, then develops into a big, then old, then dies or nothing, then begins a new event again and so it goes to the a time determined by God, namely the end of this natural event. According to scientific studies, the distribution and dynamics of water in the soil are described in this verse. In addition to being runaway water that flows directly on the surface of the land, some of the water that falls from the sky either as rain water or melting snow will pour (infiltrate) into the soil and spread in the soil (pores) of the soil. Water will be retained by the pores of the soil with a strength that is inversely proportional to the size of the soil pores. In large sized soil pores, water can be drawn by gravity and can flow (percolate) to the lower layers of soil or rocks or flow laterally in the direction of the slope. Shallow ground water that flows in the direction of the slope of this slope will come out again as a spring. Water flowing into the lower layer will then fill the ground water carrier layer (aquifer) which is a layer of soil or rock composed of coarse grains, mainly sand. If this aquifer emerges to the surface of the ground, for example in buckling slopes, then springs will also be found in the springs. Smaller pores, known as capillary pores, will hold water in them as soil moisture. The water contained in the pores of the capillaries will not be released except by a voltage greater than the force of gravity, generally by evaporation (evaporation), or in the deeper layers by the suction force of plant roots. This soil moisture is then used by plants to metabolize and then evaporate from the stomata of leaves and other plants with chlorophyll. Evaporation of ground water in this way is known as transpiration. Land that has enough moisture will be characterized by plants that cover it with green leaves. If the humidity decreases the leaves will turn yellow and then will dry out. Dry leaves will fall out to reduce the evaporation process. Water that evaporates by the scorching heat of the sun, then becomes a lumpy cloud, repelled by the wind to a place so that it rains. The process of such incidents is a matter of reflection for people who want to use their minds. Of course there is the Almighty Substance which governs all of it, so that everything happens in an orderly and neat manner. It is impossible for humans to do it. The one who does all this is certainly the One Who has the right to be worshiped and obeyed by His commands.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan manusia memikirkan salah satu dari suatu proses kejadian di alam ini, yaitu proses turunnya hujan dan tumbuhnya tanam-tanaman di permukaan bumi ini. Kalau diperhatikan seakan-akan kejadian itu merupakan suatu siklus yang dimulai pada suatu titik dalam suatu lingkaran, dimulai dari adanya sesuatu, kemudian berkembang menjadi besar, kemudian tua, kemudian meninggal atau tiada, kemudian mulai pula suatu kejadian yang baru lagi dan begitulah seterusnya sampai kepada suatu masa yang ditentukan Allah, yaitu masa berakhirnya kejadian alam ini.\n\nMenurut kajian ilmiah, distribusi dan dinamika air di dalam tanah dilukiskan dalam ayat ini. Di samping menjadi air larian yang langsung mengalir di permukaan tanah, sebagian air yang jatuh dari langit baik sebagai air hujan maupun salju yang mencair akan mengimbuh (berinfiltrasi) ke dalam tanah dan menyebar di dalam kesarangan (pori-pori) tanah. Air akan ditahan oleh pori-pori tanah dengan kekuatan yang berbanding terbalik dengan ukuran pori-pori tanah.\n\nPada pori-pori tanah dengan ukuran yang besar, air akan dapat ditarik oleh gaya gravitasi dan dapat mengalir (perkolasi) ke lapisan tanah atau batuan yang lebih bawah atau mengalir secara lateral searah kemiringan lereng. Air tanah dangkal yang mengalir searah kemiringan lereng ini akan keluar lagi sebagai mata air. Air yang mengalir ke lapisan yang lebih bawah kemudian akan mengisi lapisan pembawa air tanah (akifer) yang merupakan lapisan tanah atau batuan yang tersusun oleh butiran-butiran yang kasar, utamanya pasir. Apabila akifer ini muncul ke permukaan tanah, misalnya pada tekuk lereng, maka pada tempat munculnya tersebut akan dijumpai pula mata air.\n\nPori-pori dengan ukuran yang lebih kecil, dikenal dengan istilah pori kapiler, akan menahan air di dalamnya sebagai kelembaban tanah. Air yang terdapat di dalam pori-pori kapiler ini tidak akan dilepaskan kecuali oleh tegangan yang lebih besar dari tenaga gravitasi, umumnya oleh penguapan (evaporasi), atau pada lapisan yang lebih dalam oleh tenaga hisap akar tanaman. Kelembaban tanah inilah yang kemudian dipakai oleh tanaman untuk bermetabolisme dan kemudian menguap dari stomata daun dan bagian tanaman lain yang berkhlorophil. Penguapan air tanah dengan cara ini dikenal dengan istilah transpirasi. Tanah yang memiliki kelembaban cukup akan dicirikan oleh tumbuhan yang menutupinya memiliki daun berwarna hijau. Apabila kelembaban berkurang maka daun lambat laun akan menguning dan kemudian akan mengering. Daun-daun yang mengering akan rontok untuk mengurangi proses penguapan.\n\nAir yang menguap oleh terik panas matahari, kemudian menjadi awan yang bergumpal, dihalau kembali oleh angin ke suatu tempat sehingga menurunkan hujan. Proses kejadian demikian itu menjadi bahan renungan bagi orang yang mau menggunakan pikirannya. Tentu ada Zat Yang Mahakuasa yang mengatur semuanya itu, sehingga segala sesuatu terjadi dengan teratur dan rapi. Tidak mungkin manusia yang melakukannya. Yang melakukan semua itu tentulah Zat yang berhak disembah dan ditaati segala perintah-Nya.",
      "text_translation": "Apakah engkau tidak memperhatikan, bahwa Allah menurunkan air dari langit, lalu diaturnya menjadi sumber-sumber air di bumi, kemudian dengan air itu ditumbuhkan-Nya tanam-tanaman yang bermacam-macam warnanya, kemudian menjadi kering, lalu engkau melihatnya kekuning-kuningan, kemudian dijadikan-Nya hancur berderai-derai. Sungguh, pada yang demikian itu terdapat pelajaran bagi orang-orang yang mempunyai akal sehat.",
      "text": "اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَاۤءِ مَاۤءً فَسَلَكَهٗ يَنَابِيْعَ فِى الْاَرْضِ ثُمَّ يُخْرِجُ بِهٖ زَرْعًا مُّخْتَلِفًا اَلْوَانُهٗ ثُمَّ يَهِيْجُ فَتَرٰىهُ مُصْفَرًّا ثُمَّ يَجْعَلُهٗ حُطَامًا ۗاِنَّ فِيْ ذٰلِكَ لَذِكْرٰى لِاُولِى الْاَلْبَابِ ࣖ ",
      "text_translation_en": "ART THOU NOT aware that it is God who sends down water from the skies, and then causes it to travel through the earth in the shape of springs? And then He brings forth thereby herbage of various hues; and then it withers, and thou canst see it turn yellow; and in the end He causes it to crumble to dust. Verily, in [all] this there is indeed a reminder to those who are endowed with insight!",
      "juz_number": 23
    },
    "22": {
      "text_tafsir_en": "This verse confirms that it is not the same as the one whom God has opened his heart to accept Islam, to the one who has gone astray, so that he has denied the truth. The person's heart has seen the power and greatness of God in the beauty and wonders of nature, and his heart has been opened to the light of divine nature. Instead of those who have lost their hearts, not seeing the signs of God's power and greatness in the creation of nature, they consider it to be nothing more than a process of creation itself, with no one to control it. They feel they can change or improve the process. This is because of their ignorance and their stubborn gaze that keeps their hearts closed, and does not allow the penetration of Divine light into their hearts. The two kinds of people are certainly not the same. In another verse, God emphasizes the two inequalities of that person. Allah said: \"And is it the dead who raised us up, and gave Him a light that made him walk in the midst of many, like those who are in darkness, so that he could not go out? (al-An'am \/ 6: 122) Ibn 'Abbas recounts, \"Among those whom Allah has bestowed upon Islam, Abu Bakr, Ibn Mardawaih narrated from Ibn Mas'ud, he said: Allah's Messenger (may peace be upon him) recited this verse, Then we asked, \"O Prophet of Allah, how is the heart opened?\" He replied, \"When the light illuminates the heart, it becomes open and free.\" We asked, \"What is that sign, O Messenger of Allah?\" \"Facing the life of an eternal state and refraining from the deceitful state of life and preparing to die before it comes.\" \"O Messenger of Allah, which is the best believer?\" The Messenger replied, \"Those who remember most and die most of their preparation for death, and when the light shines on their heart, the heart becomes open and free.\" The Companions asked, \"What is the sign of this, O Prophet of Allah?\" The Prophet replied, \"Set yourself up for an everlasting land and stay away from a land full of deceit and prepare yourself to die before death comes.\" his heart was heavy and he suffered great damage because of the stubborn attitude of those who did not remember him. Their hearts should be soft when the name of God is called before them, but their faces are blackened when they hear the name of God and their hearts grow stronger. At-Tirmidzi narrated from Ibn 'Umar, he said: Allah's Messenger (may peace be upon him) said: Do not multiply your talk without mentioning the name of Allah, for speaking too much without mentioning the name of Allah causes the heart to harden. And verily those who are far from Allah are the ones who are hard-hearted. \"At the end of this verse it is explained that the hard-hearted people are blind-hearted, they are in real error. Everybody easily recognizes their disadvantages. that.",
      "text_tafsir": "Ayat ini menegaskan bahwa tidaklah sama orang yang telah dibukakan Allah hatinya sehingga menerima agama Islam, dengan orang yang sesat hatinya, sehingga ia mengingkari kebenarannya. Hati orang tersebut telah melihat kekuasaan dan kebesaran Allah dalam keindahan dan keajaiban alam ini, lalu terbukalah hatinya menerima pancaran cahaya dari nur Ilahi. Sebaliknya orang-orang yang sesat hatinya, tidak melihat tanda-tanda kekuasaan dan kebesaran Allah dalam kejadian alam ini, mereka menyangka kejadian tersebut tidak lain dari suatu proses kejadian alam itu sendiri, tanpa ada yang mengaturnya. Mereka merasa sanggup mengubah atau memperbaiki proses kejadian tersebut. Hal ini disebabkan karena kebodohan dan pandangan mereka yang picik sehingga hati mereka tetap tertutup, dan tidak memungkinkan masuknya pancaran nur Ilahi ke dalam hatinya. Kedua macam orang itu tentulah tidak sama. Pada ayat yang lain, Allah menegaskan tentang ketidaksamaan kedua macam orang itu. Allah berfirman:\n\nDan apakah orang yang sudah mati lalu Kami hidupkan dan Kami beri dia cahaya yang membuatnya dapat berjalan di tengah-tengah orang banyak, sama dengan orang yang berada dalam kegelapan, sehingga dia tidak dapat keluar dari sana? (al-An'am\/6: 122)\n\nIbnu 'Abbas meriwayatkan, \"Di antara orang yang telah dilapangkan Allah dadanya menerima agama Islam, ialah Abu Bakar r.a. Ibnu Mardawaih meriwayatkan dari Ibnu Mas'ud ia berkata:\n\nRasulullah saw membaca ayat ini, lalu kami bertanya, \"Ya Nabi Allah, bagaimana hati yang terbuka itu?\" Beliau menjawab, \"Apabila cahaya menerangi hati, maka ia menjadi terbuka dan lapang.\" Kami bertanya, \"Apakah tanda yang demikian itu, ya Rasulullah?\" Beliau menjawab, \"Menghadapkan diri kepada kehidupan negeri yang abadi dan menjauhkan diri dari kehidupan negeri yang penuh tipuan dan mempersiapkan diri untuk mati sebelum kematian itu datang.\" (Riwayat Ibnu Mardawaih)\n\nDiriwayatkan oleh at-Tirmidzi dari Ibnu 'Umar, ia berkata:\n\nBahwa seseorang berkata, \"Ya Rasulullah, orang mukmin yang manakah yang paling baik?\" Rasulullah menjawab, \"Mereka yang banyak mengingat mati dan paling banyak persiapannya untuk mati itu, dan bilamana cahaya menyinari hatinya, maka hati itu terbuka dan menjadi lapang.\" Para sahabat bertanya, \"Apa tandanya yang demikian itu ya Nabi Allah?\" Nabi menjawab, \"Menghadapkan diri kepada negeri yang abadi dan menjauhkan diri dari negeri yang penuh dengan tipuan dan menyiapkan diri untuk mati sebelum kematian itu datang.\"\n\nAdapun orang-orang yang kasar hatinya dan membatu akan mengalami kecelakaan yang besar disebabkan sikap mereka yang keras kepala tidak mau ingat kepada-Nya. Seharusnya hati mereka menjadi lembut bila nama Tuhan disebut di hadapan mereka, tetapi muka mereka hitam muram bila mendengar nama Allah disebut dan hati mereka bertambah keras membatu.\n\nDiriwayatkan oleh at-Tirmidzi dari Ibnu 'Umar, ia berkata: Rasulullah saw bersabda: \n\nJanganlah kamu memperbanyak pembicaraan tanpa menyebut nama Allah, karena banyak bicara tanpa menyebut nama Allah menyebabkan hati menjadi keras. Dan sesungguhnya orang yang paling jauh dari Allah ialah orang yang keras hatinya.\" \n\nPada akhir ayat ini diterangkan bahwa orang yang hatinya keras itu adalah orang yang buta mata hatinya, mereka benar-benar berada dalam kesesatan yang nyata. Setiap orang dengan mudah mengetahui keburukan mereka itu.",
      "text_translation": "Maka apakah orang-orang yang dibukakan hatinya oleh Allah untuk (menerima) agama Islam lalu dia mendapat cahaya dari Tuhannya (sama dengan orang yang hatinya membatu)?  Maka celakalah mereka yang hatinya telah membatu untuk mengingat Allah. Mereka itu dalam kesesatan yang nyata.",
      "text": "اَفَمَنْ شَرَحَ اللّٰهُ صَدْرَهٗ لِلْاِسْلَامِ فَهُوَ عَلٰى نُوْرٍ مِّنْ رَّبِّهٖ ۗفَوَيْلٌ لِّلْقٰسِيَةِ قُلُوْبُهُمْ مِّنْ ذِكْرِ اللّٰهِ ۗ اُولٰۤىِٕكَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
      "text_translation_en": "Could, then, one whose bosom God has opened wide with willingness towards self-surrender unto Him, so that he is illumined by a light [that flows] from his Sustainer, [be likened to the blind and deaf of heart]? Woe, then, unto those whose hearts are hardened against all remembrance of God! They are most obviously lost in error!",
      "juz_number": 23
    },
    "23": {
      "text_tafsir_en": "Allah explains that He revealed the best words, the glorious Qur'an, some of which have a good resemblance in explaining laws, truths, lessons, submitting arguments, wisdoms, etc., as some parts of water resembling some parts of the air, some parts of a country resembling some parts of a country. As there is a story repeated over and over in some places, so do the commandments, the prohibitions, and so on. Believers, when they hear the Qur'an read their romance, and shake their heart for fear of God. It moved their hearts to obey all of God's commandments and to stop His prohibitions. Their souls came to life, their morale increased to carry out righteous deeds and jihad on their way. Through the Qur'an, Allah guides His servants, guides those whom He wills to the straight path and plants faith in their hearts. But those whose hearts are deceived, empty and empty, they will not benefit from the Qur'an.",
      "text_tafsir": "Allah menerangkan bahwa Dia menurunkan perkataan yang paling baik, yaitu Al-Qur'an yang mulia, sebahagian ayat-ayatnya mempunyai kemiripan baik dalam menjelaskan hukum-hukum, kebenaran, pelajaran, mengemukakan hujah, hikmah-hikmah, dan sebagainya, sebagaimana beberapa bagian air menyerupai beberapa bagian udara, beberapa bagian suatu negeri menyerupai beberapa bagian negeri yang lain. Karena ada suatu kisah diulang-ulang menyebutnya di beberapa tempat, demikian pula perintah-perintah, larangan-larangan, dan sebagainya. Orang-orang yang beriman, bila mereka mendengar bacaan Al-Qur'an meremang bulu romanya, dan bergoncang hatinya karena takut kepada Allah. Hal itu mendorong hati mereka mengikuti semua perintah-perintah Allah dan menghentikan larangan-larangan-Nya. Jiwa mereka menjadi hidup, semangat mereka bertambah untuk melaksanakan amal-amal yang saleh dan berjihad di jalan-Nya.\n\nDengan Al-Qur'an, Allah memberikan petunjuk kepada hamba-hamba-Nya, membimbing orang-orang yang dikehendaki-Nya ke jalan yang lurus serta mempertebal iman di dalam hatinya. Tetapi orang yang disesatkan hatinya, mereka hampa dan kosong, mereka tidak akan memperoleh manfaat sedikit pun dari Al-Qur'an itu.",
      "text_translation": "Allah telah menurunkan perkataan yang paling baik (yaitu) Al-Qur'an yang serupa (ayat-ayatnya) lagi berulang-ulang, gemetar karenanya kulit orang-orang yang takut kepada Tuhannya, kemudian menjadi tenang kulit dan hati mereka ketika mengingat Allah. Itulah petunjuk Allah, dengan Kitab itu Dia memberi petunjuk kepada siapa yang Dia kehendaki. Dan barangsiapa dibiarkan sesat oleh Allah, maka tidak seorang pun yang dapat memberi petunjuk.  ",
      "text": "اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِيْثِ كِتٰبًا مُّتَشَابِهًا مَّثَانِيَۙ  تَقْشَعِرُّ مِنْهُ جُلُوْدُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ ۚ ثُمَّ تَلِيْنُ جُلُوْدُهُمْ وَقُلُوْبُهُمْ اِلٰى ذِكْرِ اللّٰهِ ۗذٰلِكَ هُدَى اللّٰهِ يَهْدِيْ بِهٖ مَنْ يَّشَاۤءُ ۗوَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ",
      "text_translation_en": "God bestows from on high the best of all teachings in the shape of a divine writ fully consistent within itself, repeating each statement [of the truth] in manifold forms [a divine writ] whereat shiver the skins of all who of their Sustainer stand in awe: [but] in the end their skins and their hearts do soften at the remembrance of [the grace of] God. Such is God’s guidance: He guides therewith him that wills [to be guided] whereas he whom God lets go astray can never find any guide",
      "juz_number": 23
    },
    "24": {
      "text_tafsir_en": "In this verse, God emphasizes the difference between those who receive guidance and those who do not receive guidance. People who are lost and have no guidance will go to hell on the Day of Judgment. Hellfire burns their faces, and their hands cannot cover their faces from the heat of the fire, because their hands are bound. It's more about the believers. They are safe from the fire of hell and do not need to escape the torment as it is for the disbelievers. On that day the infidels were rebuked by the angels, saying, \"Feel the torment of the burning hell, for the deeds that you did before in the life of the world.\"",
      "text_tafsir": "Pada ayat ini, Allah menegaskan perbedaan keadaan orang yang mendapat petunjuk dengan orang yang tidak mendapat petunjuk. Orang yang sesat dan tidak mendapat petunjuk dihadapkan ke neraka pada hari Kiamat. Api neraka membakar wajah mereka, dan tangan mereka tidak dapat menutupi wajah mereka dari panas api itu, karena kedua tangan mereka terbelenggu. Lain halnya dengan orang-orang yang beriman. Mereka selamat dari api neraka dan tidak perlu menghindarkan diri dari azab seperti yang ditimpakan kepada orang-orang kafir. Pada hari itu, orang-orang kafir dituding oleh para malaikat sambil berkata, \"Rasakanlah olehmu azab neraka yang membakar itu, karena perbuatan-perbuatan yang telah kamu kerjakan dahulu sewaktu hidup di dunia.\"",
      "text_translation": "Maka apakah orang-orang yang melindungi wajahnya menghindari azab yang buruk pada hari Kiamat (sama dengan orang mukmin yang tidak kena azab)? Dan dikatakan kepada orang-orang yang zalim, “Rasakanlah olehmu balasan apa yang telah kamu kerjakan.”",
      "text": "اَفَمَنْ يَّتَّقِيْ بِوَجْهِهٖ سُوْۤءَ الْعَذَابِ يَوْمَ الْقِيٰمَةِ ۗوَقِيْلَ لِلظّٰلِمِيْنَ ذُوْقُوْا مَا كُنْتُمْ تَكْسِبُوْنَ",
      "text_translation_en": "Could, then, one who shall have nothing but is [bare] face to protect him from the awful suffering [that will befall him] on Resurrection Day [be likened to the God-conscious]? [On that Day,] the evildoers will be told: “Taste [now] what you have earned [in life]!”",
      "juz_number": 23
    },
    "25": {
      "text_tafsir_en": "In this verse, God describes the torment that has been inflicted on the ancient people who rejected the messengers sent to them, as the Meccans did to the Prophet. The punishment was inflicted on them after repeatedly being called to the right path by the apostles sent to them, but they did not heed it. Thus they will be punished in the world and in the Hereafter they will receive a great punishment. The torment of the world is much lighter and lighter than the torment of the hereafter.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan azab yang pernah ditimpakan kepada orang-orang terdahulu yang mendustakan para rasul yang diutus kepada mereka, seperti yang dilakukan oleh orang-orang musyrik Mekah kepada Rasulullah. Azab itu ditimpakan kepada mereka setelah berkali-kali diseru ke jalan yang benar oleh para rasul yang diutus kepada mereka, namun mereka tidak mengindahkan seruan itu.\n\nDemikianlah mereka ditimpa azab di dunia dan di akhirat nanti mereka akan memperoleh azab yang sangat. Azab dunia jauh lebih enteng dan ringan jika dibanding dengan azab akhirat.",
      "text_translation": "Orang-orang yang sebelum mereka telah mendustakan (rasul-rasul), maka datanglah kepada mereka azab dari arah yang tidak mereka sangka.",
      "text": "كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ فَاَتٰىهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُوْنَ",
      "text_translation_en": "Those who lived before them did [too] give the lie to the truth - whereupon suffering befell them without their having perceived whence it came:",
      "juz_number": 23
    },
    "26": {
      "text_tafsir_en": "In this verse, God describes the torment that has been inflicted on the ancient people who rejected the messengers sent to them, as the Meccans did to the Prophet. The punishment was inflicted on them after repeatedly being called to the right path by the apostles sent to them, but they did not heed it. Thus they will be punished in the world and in the Hereafter they will receive a great punishment. The torment of the world is much lighter and lighter than the torment of the hereafter.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan azab yang pernah ditimpakan kepada orang-orang terdahulu yang mendustakan para rasul yang diutus kepada mereka, seperti yang dilakukan oleh orang-orang musyrik Mekah kepada Rasulullah. Azab itu ditimpakan kepada mereka setelah berkali-kali diseru ke jalan yang benar oleh para rasul yang diutus kepada mereka, namun mereka tidak mengindahkan seruan itu.\n\nDemikianlah mereka ditimpa azab di dunia dan di akhirat nanti mereka akan memperoleh azab yang sangat. Azab dunia jauh lebih enteng dan ringan jika dibanding dengan azab akhirat.",
      "text_translation": "Maka Allah menimpakan kepada mereka kehinaan pada kehidupan dunia. Dan sungguh, azab akhirat lebih besar, kalau (saja) mereka mengetahui.",
      "text": "فَاَذَاقَهُمُ اللّٰهُ الْخِزْيَ فِى الْحَيٰوةِ الدُّنْيَا ۚوَلَعَذَابُ الْاٰخِرَةِ اَكْبَرُ ۘ لَوْ كَانُوْا يَعْلَمُوْنَ",
      "text_translation_en": "and thus God let them taste ignominy [even] in the life of this world. Yet [how] much greater will be the [sinners’] suffering in the life to come - if they [who now deny the truth] but knew it!",
      "juz_number": 23
    },
    "27": {
      "text_tafsir_en": "God explains in this verse that He has made various examples in the Qur'an such as describing the history of some of the ancient peoples who are reminded of the catastrophe they experienced. These examples and parables are given to them to learn from them, both in relation to worldly life and in relation to the hereafter. By adhering to the Qur'an, they can straighten out their lost beliefs, improve their messy lifestyle, and turn them into civilized lives. It is not difficult for them to understand the Qur'an because it is translated into Arabic, their own language. There is nothing contrary to it. The content is clear and decisive in relation to faith, law, morality, and so on. If they were to believe and follow the guidance of the Qur'an, they would have to protect themselves from any harm that might come to them and they would obey Allah only.",
      "text_tafsir": "Allah menjelaskan pada ayat ini bahwa Dia telah membuat bermacam-macam contoh dalam Al-Qur'an seperti menerangkan sejarah beberapa umat terdahulu yang mengingatkan malapetaka yang mereka alami. Contoh dan perumpamaan itu dikemukakan kepada mereka agar mereka mengambil pelajaran darinya, baik yang berhubungan dengan kehidupan dunia maupun yang berhubungan dengan kehidupan di akhirat nanti. Dengan berpedoman kepada Al-Qur'an, mereka dapat meluruskan kembali kepercayaan mereka yang sesat, memperbaiki tata kehidupan mereka yang kacau, sehingga berubah menjadi kehidupan yang beradab. \n\nTidaklah sukar bagi mereka memahami Al-Qur'an karena diturunkan dalam bahasa Arab, bahasa mereka sendiri. Tidak ada sesuatu yang bertentangan di dalamnya. Isinya jelas dan tegas baik yang berhubungan dengan akidah, hukum, budi pekerti, dan sebagainya. Jika mereka mau beriman dan mengikuti petunjuk Al-Qur'an, pastilah mereka dapat menjaga diri dari malapetaka yang mungkin menimpa mereka dan tentulah mereka akan taat hanya kepada Allah saja.",
      "text_translation": "Dan sungguh, telah Kami buatkan dalam Al-Qur'an ini segala macam perumpamaan bagi manusia agar mereka dapat pelajaran.",
      "text": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِيْ هٰذَا الْقُرْاٰنِ مِنْ كُلِّ مَثَلٍ لَّعَلَّهُمْ يَتَذَكَّرُوْنَۚ",
      "text_translation_en": "THUS, INDEED, have We propounded unto men all kinds of parables in this Qur’an, so that they might bethink themselves; [and We have revealed it]",
      "juz_number": 23
    },
    "28": {
      "text_tafsir_en": "God explains in this verse that He has made various examples in the Qur'an such as describing the history of some of the ancient peoples who are reminded of the catastrophe they experienced. These examples and parables are given to them to learn from them, both in relation to worldly life and in relation to the hereafter. By adhering to the Qur'an, they can straighten out their lost beliefs, improve their messy lifestyle, and turn them into civilized lives. It is not difficult for them to understand the Qur'an because it is translated into Arabic, their own language. There is nothing contrary to it. The content is clear and decisive in relation to faith, law, morality, and so on. If they were to believe and follow the guidance of the Qur'an, they would have to protect themselves from any harm that might come to them and they would obey Allah only.",
      "text_tafsir": "Allah menjelaskan pada ayat ini bahwa Dia telah membuat bermacam-macam contoh dalam Al-Qur'an seperti menerangkan sejarah beberapa umat terdahulu yang mengingatkan malapetaka yang mereka alami. Contoh dan perumpamaan itu dikemukakan kepada mereka agar mereka mengambil pelajaran darinya, baik yang berhubungan dengan kehidupan dunia maupun yang berhubungan dengan kehidupan di akhirat nanti. Dengan berpedoman kepada Al-Qur'an, mereka dapat meluruskan kembali kepercayaan mereka yang sesat, memperbaiki tata kehidupan mereka yang kacau, sehingga berubah menjadi kehidupan yang beradab. \n\nTidaklah sukar bagi mereka memahami Al-Qur'an karena diturunkan dalam bahasa Arab, bahasa mereka sendiri. Tidak ada sesuatu yang bertentangan di dalamnya. Isinya jelas dan tegas baik yang berhubungan dengan akidah, hukum, budi pekerti, dan sebagainya. Jika mereka mau beriman dan mengikuti petunjuk Al-Qur'an, pastilah mereka dapat menjaga diri dari malapetaka yang mungkin menimpa mereka dan tentulah mereka akan taat hanya kepada Allah saja.",
      "text_translation": "(Yaitu) Al-Qur'an dalam bahasa Arab, tidak ada kebengkokan (di dalamnya) agar mereka bertakwa.",
      "text": "قُرْاٰنًا عَرَبِيًّا غَيْرَ ذِيْ عِوَجٍ لَّعَلَّهُمْ يَتَّقُوْنَ",
      "text_translation_en": "as a discourse in the Arabic tongue, free of all devious­ness, so that they might become conscious of God.",
      "juz_number": 23
    },
    "29": {
      "text_tafsir_en": "God created a parable to explain the difference between shirk and monotheism. For this reason God appointed two slaves. The one boy is owned by several masters, they are united in his possession. While the other slaves belonged to only one master, no one else owned them. At one point the first slave received orders from his masters with different orders, as the first lord ordered to clean his house, the second lord commanded to take over his garden, the third lord ordered to clean his house and so on. This command is given at the same time. Which command of the master should the slave do? It is impossible for the boy to carry out every command of his master at the same time. This is so that the boy is always confused in obeying the commands of his master. As for the second slave who is the slave of a master, he can do his master's orders well, he will not be confused in executing the command, and his master will be glad that the slave can do his orders well. What is the condition of the two slaves and the status of the master of each slave? This is the case with religious people and shirkers. Religious people are never confused in carrying out the commands and prohibitions of their Lord, for they are from the One. A religious person is always confused, which of his commandments will he follow? On the other hand religious people worship only the One God, and shirkers are always confused, which one is more worthy of worship than the other gods. After explaining the error of the shirk, God emphasized that all praise is only for him, not for others. He alone is worthy of worship, but most people will not know it.",
      "text_tafsir": "Allah membuat suatu perumpamaan untuk menjelaskan perbedaan antara syirik dengan tauhid. Untuk itu Allah mengumpamakan dua orang budak. Budak yang satu dimiliki oleh beberapa orang tuan, mereka berserikat dalam kepemilikannya. Sedang budak yang lain hanya dimiliki oleh seorang tuan saja, tidak ada orang lain yang memilikinya. Pada suatu saat budak pertama mendapat perintah dari tuan-tuannya itu dengan perintah yang berbeda-beda, seperti tuan pertama memerintahkan membersihkan pekarangan rumahnya, tuan yang kedua menyuruh mencangkul kebunnya, tuan yang ketiga menyuruh membersihkan rumahnya dan sebagainya. Perintah ini diberikan pada saat yang sama. Perintah tuan yang manakah yang harus dikerjakan oleh budak tersebut? Tidak mungkin budak itu melaksanakan tiap-tiap perintah dari tuan-tuannya itu dalam waktu yang sama. Demikianlah seterusnya sehingga budak itu selalu kebingungan dalam menaati perintah-perintah dari masing-masing tuannya.\n\nAdapun budak yang kedua yang hanya dimiliki oleh seorang tuan, ia dapat melaksanakan perintah tuannya dengan baik, ia tidak akan bingung dalam melaksanakan perintah itu, dan tuannya pun berlega hati karena budaknya itu dapat melaksanakan perintahnya dengan baik. Samakah keadaan kedua budak tersebut dan sama pulakah keadaan tuan dari masing-masing budak itu?\n\nDemikianlah halnya dengan orang yang beragama tauhid dan orang yang beragama syirik. Orang yang beragama tauhid tidak pernah bingung dalam melaksanakan perintah dan larangan dari Tuhannya, karena perintah dan larangan itu bersumber dari Yang Maha Esa. Seorang yang beragama syirik selalu dalam keadaan bingung, perintah tuhannya yang manakah yang akan diikutinya. Sebaliknya orang yang beragama tauhid hanya menyembah Tuhan Yang Esa, sedang orang yang beragama syirik selalu bingung, tuhan yang manakah yang lebih patut disembah dari tuhan-tuhan yang lain.\n\nSetelah menerangkan kesesatan syirik, Allah menegaskan bahwa segala puji hanyalah untuk-Nya, tidak untuk yang lain. Hanya Dia sajalah yang berhak disembah, tetapi kebanyakan manusia tidak mau mengetahuinya.",
      "text_translation": "Allah membuat perumpamaan (yaitu) seorang laki-laki (hamba sahaya) yang dimiliki oleh beberapa orang yang berserikat yang dalam perselisihan, dan seorang hamba sahaya yang menjadi milik penuh dari seorang (saja). Adakah kedua hamba sahaya itu sama keadaannya? Segala puji bagi Allah, tetapi kebanyakan mereka tidak mengetahui.",
      "text": "ضَرَبَ اللّٰهُ مَثَلًا رَّجُلًا فِيْهِ شُرَكَاۤءُ مُتَشَاكِسُوْنَ وَرَجُلًا سَلَمًا لِّرَجُلٍ هَلْ يَسْتَوِيٰنِ مَثَلًا ۗ اَلْحَمْدُ لِلّٰهِ ۗبَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ",
      "text_translation_en": "[To this end,] God sets forth a parable: A man who has for his masters several partners, [all of them] at variance with one another, and a man depending wholly on one person: can these two be deemed equal as regards their condition? [Nay,] all praise is due to God [alone]: but most of them do not understand this.",
      "juz_number": 23
    },
    "30": {
      "text_tafsir_en": "God explains that all mankind will return to God and on the Day of Judgment, mankind will be at odds with each other and will speak against each other. On the Day of Judgment the Muslims tried to defend themselves, but Prophet Muhammad (may peace be upon him) rejected their reason, saying that the preaching had been given to them, but they rejected it and denied it. Therefore, they begged Allah for forgiveness, but their request was unacceptable, for repentance was no longer acceptable. Among the arguments between the heathen and their worship is mentioned in this verse. They said to their leaders, \"We are following you, but you have deceived us.\" The leaders answered, \"We have also been deceived by the demons and our forefathers.\"",
      "text_tafsir": "Allah menerangkan bahwa semua manusia akan kembali kepada Tuhan dan di hari Kiamat nanti manusia antara yang satu dengan yang lain akan saling berbantah-bantahan dan saling tuduh-menuduh. Pada hari Kiamat orang-orang musyrik berusaha membela diri mereka masing-masing, tetapi Nabi Muhammad saw dapat menolak alasan mereka itu, dengan menyatakan bahwa dakwah telah disampaikan kepada mereka, tetapi mereka mengingkari dan mendustakannya. Oleh karena itu, mereka mohon ampunan kepada Allah, tetapi permohonan mereka tidak dapat diterima, karena pada hari itu tobat tidak dapat diterima lagi.\n\nDi antara perbantahan antara orang-orang musyrik dengan sembahan-sembahan mereka itu disebutkan dalam ayat ini. Mereka berkata kepada pemimpin-pemimpin mereka, \"Kami ikuti kamu, tetapi kamu menyesatkan kami.\" Para pemimpin menjawab, \"Kami juga telah ditipu oleh setan-setan dan nenek moyang kita dahulu.\"",
      "text_translation": "Sesungguhnya engkau (Muhammad) akan mati dan mereka akan mati (pula).",
      "text": "اِنَّكَ مَيِّتٌ وَّاِنَّهُمْ مَّيِّتُوْنَ ۖ",
      "text_translation_en": "Yet, verily, thou art bound to die, [O Muhammad,] and, verily, they, too, are bound to die:",
      "juz_number": 23
    },
    "31": {
      "text_tafsir_en": "God explains that all mankind will return to God and on the Day of Judgment, mankind will be at odds with each other and will speak against each other. On the Day of Judgment the Muslims tried to defend themselves, but Prophet Muhammad (may peace be upon him) rejected their reason, saying that the preaching had been given to them, but they rejected it and denied it. Therefore, they begged Allah for forgiveness, but their request was unacceptable, for repentance was no longer acceptable. Among the arguments between the heathen and their worship is mentioned in this verse. They said to their leaders, \"We are following you, but you have deceived us.\" The leaders answered, \"We have also been deceived by the demons and our forefathers.\"",
      "text_tafsir": "Allah menerangkan bahwa semua manusia akan kembali kepada Tuhan dan di hari Kiamat nanti manusia antara yang satu dengan yang lain akan saling berbantah-bantahan dan saling tuduh-menuduh. Pada hari Kiamat orang-orang musyrik berusaha membela diri mereka masing-masing, tetapi Nabi Muhammad saw dapat menolak alasan mereka itu, dengan menyatakan bahwa dakwah telah disampaikan kepada mereka, tetapi mereka mengingkari dan mendustakannya. Oleh karena itu, mereka mohon ampunan kepada Allah, tetapi permohonan mereka tidak dapat diterima, karena pada hari itu tobat tidak dapat diterima lagi.\n\nDi antara perbantahan antara orang-orang musyrik dengan sembahan-sembahan mereka itu disebutkan dalam ayat ini. Mereka berkata kepada pemimpin-pemimpin mereka, \"Kami ikuti kamu, tetapi kamu menyesatkan kami.\" Para pemimpin menjawab, \"Kami juga telah ditipu oleh setan-setan dan nenek moyang kita dahulu.\"",
      "text_translation": "Kemudian sesungguhnya kamu pada hari Kiamat akan berbantah-bantahan di hadapan Tuhanmu.",
      "text": "ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُوْنَ ࣖ   ۔",
      "text_translation_en": "and then, behold, on the Day of Resurrection you all shall place your dispute before your Sustainer.",
      "juz_number": 23
    },
    "32": {
      "text_tafsir_en": "This verse explains that no one is more wicked than one who makes a lie against God, by offering another sacrifice, or saying that angels are the daughters of God. They also denied the truth of the Qur'an brought by the Prophet Muhammad, who called on the dead, performed the warning of the holy Prophet and announced the coming day of resurrection and retribution. They pretend to be false when the truth comes to them, as if they were clever and sensible to conduct investigations or to distinguish between right and wrong as they are made by conscious and reasonable human beings. All of this arises out of arrogance and arrogance. Therefore, God expresses a strong threat in the form of the question, \"In hell there is no abode for the disbelievers?\" The way of addressing threats in the form of questions is often found in the Qur'an, as it has great benefits for those seeking the truth. The question poses a surprise or at least some concern to the careless and negligent. In accordance with circumcision, after presenting threats against the disbelievers, Allah gave good news and praise to the Prophet Muhammad and his companions and followers who were always afraid of Him.",
      "text_tafsir": "Ayat ini menerangkan bahwa tidak ada orang yang lebih zalim daripada orang yang membuat-buat dusta terhadap Allah, dengan mengadakan sesembahan yang lain, atau mengatakan bahwa para malaikat adalah anak-anak perempuan Allah. Mereka juga mendustakan kebenaran Al-Qur'an yang dibawa oleh Nabi Muhammad, yang mengajak kepada ketauhidan, melaksanakan amar ma'ruf nahi mungkar dan memberitahu akan datangnya hari kebangkitan dan pembalasan. Mereka bersikap mendustakan justru ketika kebenaran datang kepada mereka, seolah-olah mereka menutup akal dan pancaindra untuk mengadakan penyelidikan atau membedakan mana yang hak dan yang batil seperti yang dilakukan oleh manusia yang sadar dan wajar. \n\nSemua itu timbul karena sifat kesombongan dan keangkuhan. Oleh karena itu, Allah menyampaikan ancaman yang keras dalam bentuk pertanyaan, \"Bukankah di neraka Jahanam tersedia tempat tinggal bagi orang-orang yang kafir?\" Cara menyampaikan ancaman dengan bentuk pertanyaan itu sering dijumpai dalam Al-Qur'an, karena faedahnya besar sekali bagi mereka yang sedang mencari kebenaran. Pertanyaan itu menimbulkan kejutan atau paling sedikit perhatian bagi mereka yang lengah dan lalai. Sesuai dengan sunatullah, setelah menyampaikan ancaman terhadap orang-orang kafir, Allah lalu memberi kabar gembira dan pujian kepada Nabi Muhammad dan para sahabat serta pengikutnya yang selalu bertakwa kepada-Nya.",
      "text_translation": "Maka siapakah yang lebih zalim daripada orang yang membuat-buat kebohongan terhadap Allah dan mendustakan kebenaran yang datang kepadanya? Bukankah di neraka Jahanam tempat tinggal bagi orang-orang kafir?",
      "text": "۞ فَمَنْ اَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللّٰهِ وَكَذَّبَ بِالصِّدْقِ اِذْ جَاۤءَهٗۗ  اَلَيْسَ فِيْ جَهَنَّمَ مَثْوًى لِّلْكٰفِرِيْنَ ",
      "text_translation_en": "And who could be more wicked than he who invents lies about God? and gives the lie to the truth as soon as it has been placed before him? Is not hell the [proper] abode for all who deny the truth?",
      "juz_number": 24
    },
    "33": {
      "text_tafsir_en": "But the one who brought the truth was Muhammad saw and those who justified it, his companions and followers until the Day of Judgment. They always feared Allah, did not worship statues and idols, always fulfilled the obligations of the Shari'ah, and performed amar ma'ruf nahi wrong while hoping for the reward and avoiding His punishment. They are what is meant by those who fear.",
      "text_tafsir": "Adapun orang yang membawa kebenaran yaitu Muhammad saw dan orang-orang yang membenarkannya, yaitu para sahabat dan pengikutnya sampai hari Kiamat. Mereka selalu bertakwa kepada Allah, tidak menyembah patung dan berhala, selalu menunaikan kewajiban syariat, dan melaksanakan amar ma'ruf nahi mungkar sambil mengharapkan pahala dan menghindari azab-Nya. Mereka itulah yang dimaksudkan golongan orang-orang yang bertakwa.",
      "text_translation": "Dan orang yang membawa kebenaran (Muhammad) dan orang yang membenarkannya, mereka itulah orang yang bertakwa.",
      "text": "وَالَّذِيْ جَاۤءَ بِالصِّدْقِ وَصَدَّقَ بِهٖٓ اُولٰۤىِٕكَ هُمُ الْمُتَّقُوْنَ",
      "text_translation_en": "But he who brings the truth, and he who wholeheartedly accepts it as true - it is they, they, who are [truly] conscious of Him!",
      "juz_number": 24
    },
    "34": {
      "text_tafsir_en": "They will receive the reward and honor of Allah which they always obey and worship. In heaven, they will get whatever they want from Allah. In some authentic hadiths it is explained that in heaven they will find favors that have never been seen by the eyes, heard by the ear, and reflected in the heart. That is the reward for those who always value charity, with a sincere heart in secret or outright, who always keep their deeds and their sayings, whether heavy or light, big or small. They deal with it with a sense of responsibility.",
      "text_tafsir": "Mereka akan memperoleh pahala dan kehormatan di sisi Allah yang selalu mereka taati dan sembah. Di dalam surga, mereka akan memperoleh apa saja yang mereka kehendaki di sisi Allah. Dalam beberapa hadis yang sahih dijelaskan bahwa dalam surga mereka akan menjumpai berbagai nikmat yang belum pernah terlihat oleh mata, terdengar oleh telinga, dan terbayang dalam hati. Itulah balasan bagi mereka yang selalu mengutamakan amal kebajikan, dengan hati yang ikhlas dalam keadaan sembunyi atau terang-terangan, yang selalu menjaga amal perbuatan dan ucapan mereka, baik mengenai soal berat atau ringan, yang besar maupun yang kecil. Mereka menghadapi semua itu dengan penuh rasa tanggung jawab.",
      "text_translation": "Mereka memperoleh apa yang mereka kehendaki di sisi Tuhannya. Demikianlah balasan bagi orang-orang yang berbuat baik,",
      "text": "لَهُمْ مَّا يَشَاۤءُوْنَ عِنْدَ رَبِّهِمْ ۗ ذٰلِكَ جَزٰۤؤُا الْمُحْسِنِيْنَۚ",
      "text_translation_en": "All that they have ever yearned for awaits them with their Sustainer: such will be the reward of the doers of good.",
      "juz_number": 24
    },
    "35": {
      "text_tafsir_en": "All grace, reward, and grace were bestowed upon them by God. God also forgives the worst acts they have ever done in the world. God does not repay their sins and their sins with punishment, but covers up their sins and deeds and rewards them better than they did. In this verse comes forgiveness of sins rather than reward, because a person who has been forgiven has felt peace. After all, God's forgiveness is greater than the sins of His servants.",
      "text_tafsir": "Semua rahmat, pahala, dan karunia dilimpahkan Allah kepada mereka. Allah juga mengampuni perbuatan yang paling buruk yang pernah mereka kerjakan di dunia. Allah tidak membalas dosa-dosa dan kesalahan mereka dengan azab, bahkan menutupi dosa dan perbuatan mereka yang buruk itu dan membalas dengan pahala yang lebih baik dari apa yang telah mereka kerjakan. Dalam ayat ini didahulukan ampunan dosa daripada pemberian pahala, karena seseorang yang diampuni dosanya telah merasakan ketenangan. Lagi pula, ampunan Allah lebih luas daripada dosa hamba-hamba-Nya.",
      "text_translation": "agar Allah menghapus perbuatan mereka yang paling buruk yang pernah mereka lakukan dan memberi pahala kepada mereka dengan yang lebih baik daripada apa yang mereka kerjakan.",
      "text": "لِيُكَفِّرَ اللّٰهُ عَنْهُمْ اَسْوَاَ الَّذِيْ عَمِلُوْا وَيَجْزِيَهُمْ اَجْرَهُمْ بِاَحْسَنِ الَّذِيْ كَانُوْا يَعْمَلُوْنَ",
      "text_translation_en": "And to this end, God will efface from their record the worst that they ever did, and give them their reward in accordance with the best that they were doing [in life].",
      "juz_number": 24
    },
    "36": {
      "text_tafsir_en": "In this verse, Allah explains some of the blessings given to the Prophet Solomon, in answer to his prayer. First: God bestows Solomon the power to subject the wind. With God's permission, the wind blows hard or graceful according to his will too. Allah says: And (We submit) to Solomon a very strong wind blows which blows with his orders to the land that We give him blessings. And we are all-knowing. (al-Anbiya '\/ 21: 81) Second: Allah bestows on him the ability to subdue demons who are builders and dive experts, who carry out their duties according to Sulaiman's orders. If he orders them to build a building such as palace meetinghouses, fortresses, or buildings where Sulaiman's assets are kept and so on, then that task can be completed in a very short time. If Sulaiman ordered them to collect pearls and marjans and other marine wealth, the task could be quickly completed as well. Third: God bestows on him the power to subdue demons who oppose his orders. Their hands and feet are bound in shackles, so as not to be harmful to others, and as a punishment for defiance. The power given by God to Sulaiman to subdue demons means that the power is to move them to do heavy tasks, namely the task of building buildings, and diving to bring out the wealth of the sea. But there is no definite explanation about how Solomon shackles the devil. The most important attitude is that we accept the information contained in the Qur'an and to express its understanding, we leave it to science.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'\/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan.",
      "text_translation": "Bukankah Allah yang mencukupi hamba-Nya? Mereka menakut-nakutimu dengan (sesembahan) yang selain Dia. Barangsiapa dibiarkan sesat oleh Allah maka tidak seorang pun yang dapat memberi petunjuk kepadanya.",
      "text": "اَلَيْسَ اللّٰهُ بِكَافٍ عَبْدَهٗۗ وَيُخَوِّفُوْنَكَ بِالَّذِيْنَ مِنْ دُوْنِهٖۗ وَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍۚ",
      "text_translation_en": "IS NOT God enough for His servant? And yet, they would frighten thee with those [imaginary divine powers which they worship] beside Him! But he whom God lets go astray can never find any guide,",
      "juz_number": 24
    },
    "37": {
      "text_tafsir_en": "In this verse, Allah explains some of the blessings given to the Prophet Solomon, in answer to his prayer. First: God bestows Solomon the power to subject the wind. With God's permission, the wind blows hard or graceful according to his will too. Allah says: And (We submit) to Solomon a very strong wind blows which blows with his orders to the land that We give him blessings. And we are all-knowing. (al-Anbiya '\/ 21: 81) Second: Allah bestows on him the ability to subdue demons who are builders and dive experts, who carry out their duties according to Sulaiman's orders. If he orders them to build a building such as palace meetinghouses, fortresses, or buildings where Sulaiman's assets are kept and so on, then that task can be completed in a very short time. If Sulaiman ordered them to collect pearls and marjans and other marine wealth, the task could be quickly completed as well. Third: God bestows on him the power to subdue demons who oppose his orders. Their hands and feet are bound in shackles, so as not to be harmful to others, and as a punishment for defiance. The power given by God to Sulaiman to subdue demons means that the power is to move them to do heavy tasks, namely the task of building buildings, and diving to bring out the wealth of the sea. But there is no definite explanation about how Solomon shackles the devil. The most important attitude is that we accept the information contained in the Qur'an and to express its understanding, we leave it to science.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'\/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan.",
      "text_translation": "Dan barangsiapa diberi petunjuk oleh Allah, maka tidak seorang pun yang dapat menyesatkannya. Bukankah Allah Mahaperkasa dan mempunyai (kekuasaan untuk) menghukum?",
      "text": "وَمَنْ يَّهْدِ اللّٰهُ فَمَا لَهٗ مِنْ مُّضِلٍّ ۗ اَلَيْسَ اللّٰهُ بِعَزِيْزٍ ذِى انْتِقَامٍ",
      "text_translation_en": "whereas he whom God guides aright can never be led astray. Is not God almighty, an avenger of evil?",
      "juz_number": 24
    },
    "38": {
      "text_tafsir_en": "In this verse, Allah explains some of the blessings given to the Prophet Solomon, in answer to his prayer. First: God bestows Solomon the power to subject the wind. With God's permission, the wind blows hard or graceful according to his will too. Allah says: And (We submit) to Solomon a very strong wind blows which blows with his orders to the land that We give him blessings. And we are all-knowing. (al-Anbiya '\/ 21: 81) Second: Allah bestows on him the ability to subdue demons who are builders and dive experts, who carry out their duties according to Sulaiman's orders. If he orders them to build a building such as palace meetinghouses, fortresses, or buildings where Sulaiman's assets are kept and so on, then that task can be completed in a very short time. If Sulaiman ordered them to collect pearls and marjans and other marine wealth, the task could be quickly completed as well. Third: God bestows on him the power to subdue demons who oppose his orders. Their hands and feet are bound in shackles, so as not to be harmful to others, and as a punishment for defiance. The power given by God to Sulaiman to subdue demons means that the power is to move them to do heavy tasks, namely the task of building buildings, and diving to bring out the wealth of the sea. But there is no definite explanation about how Solomon shackles the devil. The most important attitude is that we accept the information contained in the Qur'an and to express its understanding, we leave it to science.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'\/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan.",
      "text_translation": "Dan sungguh, jika engkau tanyakan kepada mereka, “Siapakah yang menciptakan langit dan bumi?” Niscaya mereka menjawab, “Allah.” Katakanlah, “Kalau begitu tahukah kamu tentang apa yang kamu sembah selain Allah, jika Allah hendak mendatangkan bencana kepadaku, apakah mereka mampu menghilangkan bencana itu, atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat mencegah rahmat-Nya?” Katakanlah, “Cukuplah Allah bagiku. Kepada-Nyalah orang-orang yang bertawakal berserah diri.”",
      "text": "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ لَيَقُوْلُنَّ اللّٰهُ ۗ قُلْ اَفَرَءَيْتُمْ مَّا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ اِنْ اَرَادَنِيَ اللّٰهُ بِضُرٍّ هَلْ هُنَّ كٰشِفٰتُ ضُرِّهٖٓ اَوْ اَرَادَنِيْ بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكٰتُ رَحْمَتِهٖۗ قُلْ حَسْبِيَ اللّٰهُ ۗعَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُوْنَ ",
      "text_translation_en": "And thus it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth?” - they will surely answer, “God.” Say: “Have you, then, ever considered what it is that you invoke instead of God? If God wills that harm should befall me, could those [imaginary powers] remove the harm inflicted by Him? Or, if He wills that grace should alight on me, could they withhold His grace [from me]?” Say: “God is enough for me! In Him [alone] place their trust all who have trust [in His existence].”",
      "juz_number": 24
    },
    "39": {
      "text_tafsir_en": "When the Messenger of Allah (may peace be upon him) made an argument which the Muslims could not dispute, Allah commanded him to express his threat by saying, \"O my people, act according to your thinking, that you have strength and skill, and diligently sweat your magic and deceit, I will also do my part in promoting and proclaiming my religion; then you will know which of us is better. \"",
      "text_tafsir": "Setelah Rasulullah saw mengemukakan argumen yang tidak dapat dibantah lagi oleh kaum musyrikin, Allah memerintahkan beliau supaya menyampaikan ancaman dengan berkata, \"Hai kaumku, berbuatlah sesuai dengan anggapanmu, bahwa kamu mempunyai kekuatan dan keterampilan, dan peraslah keringatmu dalam membuat makar dan tipu dayamu, karena aku pun berbuat pula dalam mengokohkan dan menyiarkan agamaku, nanti kamu akan mengetahui, siapakah di antara kita yang lebih baik kesudahannya.\"",
      "text_translation": "Katakanlah (Muhammad), “Wahai kaumku! Berbuatlah menurut kedudukanmu, aku pun berbuat (demikian). Kelak kamu akan mengetahui,",
      "text": "قُلْ يٰقَوْمِ اعْمَلُوْا عَلٰى مَكَانَتِكُمْ اِنِّيْ عَامِلٌ ۚفَسَوْفَ تَعْلَمُوْنَۙ",
      "text_translation_en": "Say: “O my [truth-denying] people! Do yet all that may be within your power, [whereas] I, behold, shall labour [in God’s way]: in time you will come to know",
      "juz_number": 24
    },
    "40": {
      "text_tafsir_en": "In this verse, God threatens us all in the form of questions, who will receive the humiliating torment, and who will continue to receive the torment? Threats in the form of these questions guide us that humans are the only ones who suffer humiliating torments, both in the world and in the hereafter. The disbelievers and the wicked may also receive the torment forever. Therefore, we need to be careful not to suffer such a torment by being obedient and always trusting in God.",
      "text_tafsir": "Pada ayat ini, Allah mengancam kita semua dalam bentuk pertanyaan, yaitu siapa yang akan mendapat azab yang menghinakan, dan siapa yang akan terus menerus memperoleh azab itu? Ancaman dalam bentuk pertanyaan ini memberi petunjuk kepada kita bahwa manusia ada saja yang memperoleh azab yang menghinakan, baik di dunia maupun akhirat. Orang-orang kafir dan durhaka juga dapat saja memperoleh azab itu terus-menerus secara kekal. Oleh karena itu, kita perlu berhati-hati jangan sampai mendapat azab yang diancamkan tersebut dengan cara menjadi mukmin yang taat dan selalu bertawakal kepada Allah.",
      "text_translation": "siapa yang mendapat siksa yang menghinakan dan kepadanya ditimpakan azab yang kekal.”",
      "text": "مَنْ يَّأْتِيْهِ عَذَابٌ يُّخْزِيْهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيْمٌ",
      "text_translation_en": "who it is that shall be visited [in this world] by suffering which will cover him with ignominy, and upon whom long-lasting suffering shall alight [in the life to come]!”",
      "juz_number": 24
    },
    "41": {
      "text_tafsir_en": "This verse explains that Allah has revealed the Qur'an to the Prophet Muhammad with the truth. He was then ordered to convey the teachings of the religion of God to all mankind by announcing the glad tidings of the coming of God's grace and warning of God's punishment for those who rejected it. The Qur'an contains all the guidance that a person needs in managing all aspects of his life. Thus, they become the happiest people in the world and the afterlife for following the straight path. Whoever gets the guidance to practice the contents of the Qur'an, then the benefit of that guidance is for himself, for they will receive the will of God, be admitted into heaven, and be saved from hell. And whoever strays from the straight path and goes astray, then it is a loss to himself. He will be plunged into ruin and destruction because of God's wrath and suffering in the fire of hell. On the Day of Judgment, no one will be saved except for those who truly carry a clean heart according to the word of God: (That is) on the day when property and children are useless, except those who look to God with a pure heart. . (asy-Syu'ara '\/ 26: 88-89) Allah then made it clear that Prophet Muhammad was not the one responsible for their deeds. His task was simply to deliver the brochure as explained in his Word: You are only a warner and God of all things. (Hud \/ 11: 12) He also said: Be warned, for you are a warner. You are not the ruler over them. (al-Gasyiyah \/ 88: 21-22)",
      "text_tafsir": "Ayat ini menjelaskan bahwa sesungguhnya Allah telah menurunkan Al-Qur'an kepada Nabi Muhammad saw dengan kebenaran. Beliau lalu diperintahkan untuk menyampaikan ajaran agama Allah kepada seluruh manusia dengan cara memberikan kabar gembira dengan datangnya rahmat Allah dan memberi peringatan akan tibanya siksa Allah bagi mereka yang mendustakannya. Al-Qur'an mengandung segala petunjuk yang diperlukan oleh manusia dalam mengatur seluruh aspek kehidupannya. Dengan itu, mereka menjadi umat yang berbahagia di dunia dan akhirat karena menempuh jalan yang lurus. \n\nBarang siapa yang mendapat petunjuk untuk mengamalkan isi Al-Qur'an, maka kemanfaatan petunjuk itu adalah untuk dirinya sendiri, karena mereka akan mendapat keridaan Allah, dimasukkan ke dalam surga, dan diselamatkan dari neraka. Dan barang siapa yang menyimpang dari jalan yang lurus itu sehingga tersesat, maka sesungguhnya hal itu semata-mata merugikan dirinya sendiri. Ia akan terjerumus dalam kehancuran dan kebinasaan karena akan mendapat kemurkaan Allah dan mengalami penderitaan dalam api neraka. Pada hari Kiamat, tidak ada yang selamat melainkan orang yang benar-benar membawa hati yang bersih sesuai dengan firman Allah:\n\n(Yaitu) pada hari (ketika) harta dan anak-anak tidak berguna, kecuali orang-orang yang menghadap Allah dengan hati yang bersih. (asy-Syu'ara'\/26: 88-89)\n\nAllah lalu menjelaskan bahwa Nabi Muhammad bukanlah orang yang bertanggung jawab terhadap amal perbuatan mereka. Tugas beliau hanya semata-mata menyampaikan risalah seperti dijelaskan dalam firman-Nya:\n\nSungguh, engkau hanyalah seorang pemberi peringatan dan Allah pemelihara segala sesuatu. (Hud\/11: 12)\n\nFirman-Nya juga:\n\nMaka berilah peringatan, karena sesungguhnya engkau (Muhammad) hanyalah pemberi peringatan. Engkau bukanlah orang yang berkuasa atas mereka. (al-Gasyiyah\/88: 21-22)",
      "text_translation": "Sungguh, Kami menurunkan kepadamu Kitab (Al-Qur'an) dengan membawa kebenaran untuk manusia; barangsiapa mendapat petunjuk maka (petunjuk itu) untuk dirinya sendiri, dan siapa sesat maka sesungguhnya kesesatan itu untuk dirinya sendiri, dan engkau bukanlah orang yang bertanggung jawab terhadap mereka.",
      "text": "اِنَّآ اَنْزَلْنَا عَلَيْكَ الْكِتٰبَ لِلنَّاسِ بِالْحَقِّۚ فَمَنِ اهْتَدٰى فَلِنَفْسِهٖۚ وَمَنْ ضَلَّ فَاِنَّمَا يَضِلُّ عَلَيْهَا ۚوَمَآ اَنْتَ عَلَيْهِمْ بِوَكِيْلٍ ࣖ",
      "text_translation_en": "BEHOLD, from on high have We bestowed upon thee this divine writ, setting forth the truth for [the benefit of all] mankind. And whoever chooses to be guided [thereby], does so for his own good, and whoever chooses to go astray, goes but astray to his own hurt; and thou hast not the power to determine their fate.",
      "juz_number": 24
    },
    "42": {
      "text_tafsir_en": "In this verse, God describes His perfect power and His wonderful nature. He is the one who holds the human soul at the time of his death by severing the spirit's relation to his body and holding the person's soul at his birth so that he cannot direct his body, but the relationship between them remains. God retains the soul of the one whom He appointed to death by not returning the spirit, and frees the other soul by restoring the soul to his body, so that he may rise from his sleep to the appointed time. The dead person is held by God so that he cannot return to his body and the dead person only sleeps, his soul is released to return to his body again. Ibn 'Abbas reported that in the human body there is a soul and a spirit which is like the sun. The mind and the soul can think and make choices, while it is the spirit that enables him to live and move. Both were turned off at the time of his death, and his soul was cut off while he slept, and his spirit was still there. Imam al-Bukhari and Muslim recite a hadith from Abu Hurairah which reads: The Messenger of Allah (may peace be upon him) said, \"If any one of you sleeps, let him blow into his inner garment, because he does not know what is left in it, then let him say, \"My Lord, in your name have I set my mouth, and in your name have I raised it up.\" If you hold back my soul then love him, and if you release him, then treat him as if you were to protect the righteous. \"(Al-Bukhari and Muslim History) The Qur'an narrates a hadith from Abu Qatadah, which reads: Indeed the Prophet (peace and blessings be upon him) said to his companions at night (in his sleep) in the valley, \"Verily Allah restrains your soul when He pleases, and returns it when He pleases.\"",
      "text_tafsir": "Pada ayat ini, Allah menerangkan satu macam kekuasaan-Nya yang sempurna dan sifat-Nya yang mengagumkan. Yaitu Dialah yang memegang roh manusia ketika tiba ajalnya dengan memutuskan hubungan roh dengan raganya dan memegang roh orang itu pada lahirnya saja sehingga tidak dapat mengemudikan raganya, akan tetapi hubungan di antaranya tetap masih ada. Allah menahan jiwa orang yang telah Dia tetapkan kematiannya dengan tidak mengembalikan roh itu, dan melepaskan jiwa yang lain dengan mengembalikan jiwa ke dalam raganya, sehingga ia dapat bangun dari tidurnya sampai kepada waktu yang ditentukan. Orang yang mati itu rohnya ditahan Allah sehingga tidak dapat kembali kepada tubuhnya dan orang yang belum mati hanya tidur saja, rohnya dilepaskan sehingga dapat kembali ke raganya lagi.\n\nDiriwayatkan dari Ibnu 'Abbas bahwa dalam tubuh manusia itu ada jiwa dan roh yang hubungannya seperti sinar matahari. Akal dan jiwa dapat berpikir dan menentukan pilihan, sedang rohnya yang menyebabkan ia dapat hidup dan bergerak. Kedua-duanya dimatikan ketika tiba ajalnya, dan dimatikan jiwanya saja ketika ia tidur, sedang rohnya tetap masih ada.\n\nImam al-Bukhari dan Muslim meriwayatkan sebuah hadis dari Abu Hurairah yang berbunyi:\n\nRasulullah saw bersabda, \"Jika salah seorang di antara kamu akan tidur, maka hendaklah ia meniupkan ke dalam pakaiannya di sebelah dalam, karena ia tidak mengetahui apa yang tertinggal di dalamnya, kemudian hendaklah ia mengucapkan, \"Ya Tuhanku dengan nama-Mu aku meletakkan lambungku ini, dan dengan nama-Mu pula aku mengangkatnya. Jika Engkau menahan jiwaku maka sayangilah dia, dan jika Engkau melepaskannya kembali, maka peliharalah dia seperti Engkau memelihara orang-orang yang saleh.\" (Riwayat al-Bukhari dan Muslim)\n\nImam al-Bukhari, A.hmad, Abu Dawud, dan Ibnu Abi Syaibah meriwayatkan sebuah hadis dari Abu Qatadah. yang berbunyi:\n\nSesungguhnya Nabi saw bersabda kepada para sahabat pada malam (ketika tidur)di lembah, \"Sesungguhnya Allah menahan roh kamu bila dikehendaki-Nya, dan mengembalikannya bila dikehendaki-Nya.\"",
      "text_translation": "Allah memegang nyawa (seseorang) pada saat kematiannya dan nyawa (seseorang) yang belum mati ketika dia tidur; maka Dia tahan nyawa (orang) yang telah Dia tetapkan kematiannya dan Dia lepaskan nyawa yang lain sampai waktu yang ditentukan. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran) Allah bagi kaum yang berpikir.",
      "text": "اَللّٰهُ يَتَوَفَّى الْاَنْفُسَ حِيْنَ مَوْتِهَا وَالَّتِيْ لَمْ تَمُتْ فِيْ مَنَامِهَا ۚ فَيُمْسِكُ الَّتِي قَضٰى عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْاُخْرٰىٓ اِلٰٓى اَجَلٍ مُّسَمًّىۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّتَفَكَّرُوْنَ",
      "text_translation_en": "It is God [alone that has this power - He] who causes all human beings to die at the time of their [bodily] death, and [causes to be as dead], during their sleep, those that have not yet died: thus, He withholds [from life] those upon whom He has decreed death, and lets the others go free for a term set [by Him]. In [all] this, behold, there are messages indeed for people who think!",
      "juz_number": 24
    },
    "43": {
      "text_tafsir_en": "In this verse, God contradicts the assumption that the idolaters worshiped other than Allah can intercede for them on the Day of Judgment, and to help them achieve their goals and hopes. It is not possible for such a person to have a healthy mind. Therefore, the Prophet Muhammad was commanded by Allah to reprove those who believe in this saying, \"Will you regard the idols as beneficial even if they are useless and unreasonable?\" can only intercede for Allah.",
      "text_tafsir": "Pada ayat ini, Allah membantah anggapan kaum musyrik bahwa berhala-berhala yang mereka sembah selain Allah dapat memberikan syafaat kepada mereka pada hari Kiamat, dan memberikan pertolongan kepada mereka untuk mencapai cita-cita dan harapan. Hal yang seperti itu tidak mungkin dibenarkan orang yang mempunyai pikiran yang sehat. Oleh karena itu, Nabi Muhammad disuruh Allah supaya menegur orang-orang musyrik yang beranggapan demikian itu dengan ucapan, \"Apakah kamu akan memandang berhala-berhala itu dapat memberi manfaat meskipun mereka tidak mempunyai apa-apa dan tidak berakal? Kemudian Allah menjelaskan bahwa sebenarnya yang dapat memberikan syafaat hanyalah Allah.",
      "text_translation": "Ataukah mereka mengambil penolong selain Allah. Katakanlah, “Apakah (kamu mengambilnya juga) meskipun mereka tidak memiliki sesuatu apa pun dan tidak mengerti?”",
      "text": "اَمِ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ شُفَعَاۤءَۗ قُلْ اَوَلَوْ كَانُوْا لَا يَمْلِكُوْنَ شَيْـًٔا وَّلَا يَعْقِلُوْنَ ",
      "text_translation_en": "And yet, they choose [to worship], side by side with God, [imaginary] intercessors!” Say: “Why - even though they have no power over anything, and no understanding?”",
      "juz_number": 24
    },
    "44": {
      "text_tafsir_en": "In this verse, Allah tells His Prophet to say that all intercession belongs only to Allah. No one can intercede except by Allah's permission in His word: ¦No one can intercede on His side without His permission. Yes. (al-Baqarah \/ 2: 255) And as He says: ¦ And they do not intercede except those whom He pleases () (21)) (al-Anbiya '\/ 21: 28) the kingdom of heaven and earth and all its contents including idols worshiped by the monks. Therefore, worship only Allah with a perfect kingdom, whose power is infinite. Then you will be restored to him on the day of resurrection. He is the one who will inflict very painful torments on the Muslims. There is no doubt that this verse contains a very painful threat. Then Allah also explained a very bad trait of those who disobeyed Him.",
      "text_tafsir": "Pada ayat ini, Allah menyuruh Nabi-Nya mengatakan bahwa hanya kepunyaan Allah semua syafaat itu.Tak seorang pun yang dapat memberikan syafaat melainkan dengan izin Allah seperti tersebut dalam firman-Nya:\n\n¦Tidak ada yang dapat memberi syafaat di sisi-Nya tanpa izin-Nya¦. (al-Baqarah\/2: 255)\n\nDan seperti firman-Nya:\n\n¦ dan mereka tidak memberi syafaat melainkan kepada orang yang diridai (Allah)¦ (al-Anbiya'\/21: 28)\n\nSemua syafaat itu hanya dimiliki Allah karena Dia yang memiliki kerajaan langit dan bumi dan semua isinya termasuk berhala yang disembah orang-orang musyrik. Oleh karena itu, sembahlah Allah saja yang mempunyai kerajaan yang sempurna, yang kekuasaan-Nya tidak terbatas. Kemudian kepada-Nya kamu sekalian akan dikembalikan pada hari kebangkitan. Dialah nanti yang akan menimpakan siksa yang sangat pedih kepada orang-orang musyrik. Tidak diragukan lagi bahwa ayat ini mengandung ancaman yang pedih sekali. Kemudian Allah menerangkan pula satu sifat yang sangat buruk dari orang-orang yang mengingkari keesaan-Nya.",
      "text_translation": "Katakanlah, “Pertolongan itu hanya milik Allah semuanya. Dia memiliki kerajaan langit dan bumi. Kemudian kepada-Nya kamu dikembalikan.”",
      "text": "قُلْ لِّلّٰهِ الشَّفَاعَةُ جَمِيْعًا ۗ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِۗ ثُمَّ اِلَيْهِ تُرْجَعُوْنَ",
      "text_translation_en": "Say: “God’s alone is [the power to bestow the right of] intercession: His [alone] is the dominion over the heavens and the earth; and, in the end, Unto Him you will all be brought back.”",
      "juz_number": 24
    },
    "45": {
      "text_tafsir_en": "In this verse, God explains that if only God's name is called, and no one has the right to worship but Him, then those who do not believe in the hereafter will be wild and angry. Their hearts are broken and they hear the words of monotheism. However, when names other than Allah are mentioned, they are suddenly happy and happy. 'Abdullah bin' Abbas explained the meaning of this verse, \"It was hard and wild of four unbelievers on the Day of Judgment: Abu Jahal. in his words: And when you call your Lord alone in the Qur'an, they turn back (in disgust). (al-Isra '\/ 17: 46) In the interpretation of Ruh al-Ma'ani, al- Alusi says, \"We often find people in modern times who are like the monks mentioned in this verse, who like to seek the help of the dead, and it's easy to remember and overstate their life history.\" , who walk in harmony with their passions. They really admired the people he trained with. Their hearts are upset if they are called only in the name of God or it is said that only God is worthy of true worship, and that only God can seek His help. \"",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan bahwa jika hanya nama Allah yang disebut, dan tidak ada Tuhan yang berhak disembah dengan sebenarnya melainkan Dia, maka menjadi liar dan marahlah hati orang-orang yang tidak beriman kepada kehidupan akhirat. Hati mereka kesal dan mendengar kalimat tauhid itu. Akan tetapi, apabila nama sembahan-sembahan selain Allah yang disebut, tiba-tiba mereka menjadi gembira dan bersuka ria. 'Abdullah bin 'Abbas menjelaskan pengertian ayat ini, \"Telah menjadi keras dan liarlah hati empat orang yang tidak percaya kepada hari Kiamat, yaitu: Abu Jahal. bin Hisyam, al-Walid bin 'Utbah, shafwan, dan Ubay bin Khalaf, seperti tersebut dalam firman-Nya:\n\nDan apabila engkau menyebut Tuhanmu saja dalam Al-Qur'an, mereka berpaling ke belakang melarikan diri (karena benci). (al-Isra'\/17: 46)\n\nDalam tafsir Ruh al-Ma'ani, al-Alusi berkata, \"Kami sering menjumpai orang-orang pada zaman sekarang yang sifatnya menyerupai orang-orang musyrik yang tersebut dalam ayat ini, yaitu suka memohon pertolongan kepada orang-orang yang telah mati, dan senang sekali mengenang dan mengungkap sejarah hidupnya yang berlebih-lebihan, yang berjalan seirama dengan hawa nafsu mereka. Mereka sangat mengagungkan orang-orang yang dikultuskannya. Hati mereka menjadi kesal jika yang disebut hanya nama Allah atau dikatakan bahwa hanya Allah saja yang berhak disembah dengan sebenarnya, dan hanya Allah saja yang boleh dimohon pertolongan-Nya.\"",
      "text_translation": "Dan apabila yang disebut hanya nama Allah, kesal sekali hati orang-orang yang tidak beriman kepada akhirat. Namun apabila nama-nama sembahan selain Allah yang disebut, tiba-tiba mereka menjadi bergembira.",
      "text": "وَاِذَا ذُكِرَ اللّٰهُ وَحْدَهُ اشْمَـَٔزَّتْ قُلُوْبُ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِۚ وَاِذَا ذُكِرَ الَّذِيْنَ مِنْ دُوْنِهٖٓ اِذَا هُمْ يَسْتَبْشِرُوْنَ",
      "text_translation_en": "And yet, whenever God alone is mentioned, the hearts of those who will not believe in the life to come contract with bitter aversion - whereas, when those [imaginary powers] are mentioned side by side with Him, lo, they rejoice!",
      "juz_number": 24
    },
    "46": {
      "text_tafsir_en": "In this verse, God instructs his prophet to utter the following sentences to deepen his faith and to ask for his further admonition and guidance, \"O Allah, Creator of heaven and earth, Who knows things that are divine and real, You decide all disputes between Your servants concerning what they have always disputed, and you will decide on the Day of Judgment which of us is right and wrong, who can guide and who is astray. wake up for a night prayer: \"O God, the God of Gabriel, Michael, and Israfil, the Creator of heaven and earth, the All-Knower of all things divine and real. You judge between your servants in their disputes. Guide me to the truth at stake with your (basic) permission. You guide whom You desire in a straight path. (History of Muslim, Abu Dawud, and al-Baihaqi)",
      "text_tafsir": "Dalam ayat ini, Allah mengajarkan kepada nabi-Nya supaya mengucapkan kalimat-kalimat berikut ini untuk mempertebal keimanan dan memohon tambahan taufik dan hidayah-Nya, \"Wahai Allah, Pencipta langit dan bumi, Yang mengetahui hal-hal yang gaib dan nyata, Engkau memutuskan segala pertikaian antara hamba-Mu tentang apa yang selalu mereka perselisihkan. Engkaulah yang nanti akan memberi keputusan pada hari Kiamat siapa di antara kami yang benar dan yang salah, siapa yang dapat petunjuk dan siapa yang sesat.\n\nMelalui hadisnya, Rasulullah mengajarkan doa yang dibaca ketika bangun tidur untuk salat malam:\n\n\"Wahai Allah, Tuhan Jibril, Mikail, dan Israfil, Pencipta langit dan bumi, Yang Maha Mengetahui segala hal yang gaib dan nyata. Engkau memutuskan perkara di antara hamba-hamba-Mu dalam hal yang mereka perselisihkan. Tunjukilah aku pada kebenaran yang diperselisihkan dengan (dasar) izin-Mu. Sungguh Engkau menunjuki siapa yang Engkau kehendaki ke jalan yang lurus. (Riwayat Muslim, Abu Dawud, dan al-Baihaqi)",
      "text_translation": "Katakanlah, “Ya Allah, Pencipta langit dan bumi, yang mengetahui segala yang gaib dan yang nyata, Engkaulah yang memutuskan di antara hamba-hamba-Mu tentang apa yang selalu mereka perselisihkan.”",
      "text": "قُلِ اللهم فَاطِرَ السَّمٰوٰتِ وَالْاَرْضِ عٰلِمَ الْغَيْبِ وَالشَّهَادَةِ اَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْ مَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ",
      "text_translation_en": "Say: “O God! Originator of the heavens and the earth! Knower of all that is beyond the reach of a created being’s perception, as well as of all that can be witnessed by a creature’s senses or mind! It is Thou who wilt judge between Thy servants [on Resurrection Day] with regard to all on which they were wont to differ!”",
      "juz_number": 24
    },
    "47": {
      "text_tafsir_en": "In this verse, God explains that if the abusive Muslims had all the wealth in the land and added that they would redeem themselves with that wealth for the terrible and terrible punishment that would befall them on the Day of Judgment . Such threats have been mentioned in Surah ali 'Imran. It was clear to them the torment of Allah that they had never thought about its existence and its horrors. Muslims practice what they consider to be good, but in reality what they do is a bad thing.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan bahwa seandainya orang-orang musyrikin yang zalim itu mempunyai seluruh kekayaan yang ada di muka bumi dan ditambah sebanyak itu pula niscaya mereka akan menebus dirinya dengan kekayaan itu untuk azab yang buruk dan dahsyat yang akan ditimpakan kepada mereka pada hari Kiamat. Ancaman seperti ini pernah pula disebut dalam Surah ali 'Imran. Tampak jelas bagi mereka azab dari Allah yang belum pernah mereka pikirkan tentang adanya dan kedahsyatannya. Kaum musyrikin jika mengamalkan sesuatu dianggapnya sebagai kebaikan, padahal hakikatnya apa yang mereka lakukan itu termasuk suatu keburukan.",
      "text_translation": "Dan sekiranya orang-orang yang zalim mempunyai segala apa yang ada di bumi dan ditambah lagi sebanyak itu, niscaya mereka akan menebus dirinya dengan itu dari azab yang buruk pada hari Kiamat. Dan jelaslah bagi mereka azab dari Allah yang dahulu tidak pernah mereka perkirakan.",
      "text": "وَلَوْ اَنَّ لِلَّذِيْنَ ظَلَمُوْا مَا فِى الْاَرْضِ جَمِيْعًا وَّمِثْلَهٗ مَعَهٗ لَافْتَدَوْا بِهٖ مِنْ سُوْۤءِ الْعَذَابِ يَوْمَ الْقِيٰمَةِۗ وَبَدَا لَهُمْ مِّنَ اللّٰهِ مَا لَمْ يَكُوْنُوْا يَحْتَسِبُوْنَ",
      "text_translation_en": "But if those who are bent on evildoing posses­sed all that is on earth, and twice as much, they would surely offer it as ransom from the awful suffering [that will befall them] on the Day of Resur­rection: for, something with which they had not reckoned before will [by then] have been made obvious to them by God;",
      "juz_number": 24
    },
    "48": {
      "text_tafsir_en": "It seems clear to them that when they were presented with books that contained deeds of charity while living in the world, all their bad deeds were listed there. They believe that the violations will be cached and accounted for individually. As a result, they will receive a painful punishment that covers all corners, all of which are different because they are always mocking the teachings of God's religion.",
      "text_tafsir": "Tampak jelas bagi mereka, ketika disodorkan kepada mereka kitab-kitab yang memuat catatan amal perbuatan ketika hidup di dunia, semua amal perbuatan mereka yang buruk tercantum di sana. Mereka yakin bahwa pelanggaran itu akan dihisab dan diperhitungkan satu demi satu. Sebagai akibatnya, mereka akan menerima azab yang pedih yang meliputi seluruh penjuru, yang semuanya tidak lain karena mereka selalu memperolok-olokkan ajaran agama Allah.",
      "text_translation": "Dan jelaslah bagi mereka kejahatan apa yang telah mereka kerjakan dan mereka diliputi oleh apa yang dahulu mereka selalu memperolok-olokkannya.",
      "text": "وَبَدَا لَهُمْ سَيِّاٰتُ مَا كَسَبُوْا وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
      "text_translation_en": "and obvious to them will have become the evil that they had wrought [in life]: and thus shall they be overwhelmed by the very truth which they were wont to deride.",
      "juz_number": 24
    },
    "49": {
      "text_tafsir_en": "This verse describes the situation of the strange Muslims. When they are in danger of suffering such as illness and illness, they immediately seek protection and pray to God. But when things have changed, like recovering from illness, enjoying good fortune, and neglecting their fortunes, they forget the pain and say it all because of their own service, skills, intelligence, and experience. That's their weird attitude. When they suffered, they ran to God for help. Once things turned out to be fun and enjoyable, they severed ties with their Creator and claimed that all their fortunes were due to their own wisdom and skill. They do not know that the good and bad that Allah has given them is a test to know who is grateful for the gifts of Allah and for those who disbelieve. For those who are thankful it will be added to another's favor, while those who deny it will suffer a painful torment.",
      "text_tafsir": "Ayat ini menerangkan keadaan orang-orang musyrik yang aneh. Jika ditimpa bahaya kemudaratan seperti kefakiran dan penyakit, mereka segera memohon perlindungan dan berdoa kepada Allah. Tapi bila keadaan sudah berubah, seperti sembuh dari penyakit, mendapat nikmat, dan kelapangan rezeki, mereka melupakan masa penderitaan dan mengatakan bahwa semua itu karena jasa, keterampilan, kepintaran, dan pengalaman mereka sendiri. Itulah sikap mereka yang sangat aneh. Ketika mengalami penderitaan, mereka lari menjerit memohon pertolongan kepada Allah. Setelah keadaan berubah menjadi kesenangan dan kenikmatan, mereka memutuskan hubungan dengan Khaliknya dan menyatakan bahwa semua perbaikan nasib itu disebabkan kepandaian dan kemahiran mereka sendiri. Mereka tidak mengetahui bahwa sesungguhnya nasib baik dan buruk yang diberikan Allah kepada mereka merupakan ujian untuk mengetahui siapa yang mensyukuri nikmat-nikmat pemberian Allah dan siapa yang mengufurinya. Bagi yang bersyukur akan ditambah dengan nikmat yang lain, sedangkan bagi yang mengingkarinya akan ditimpakan azab yang pedih.",
      "text_translation": "Maka apabila manusia ditimpa bencana dia menyeru Kami, kemudian apabila Kami berikan nikmat Kami kepadanya dia berkata, “Sesungguhnya aku diberi nikmat ini hanyalah karena kepintaranku.” Sebenarnya, itu adalah ujian, tetapi kebanyakan mereka tidak mengetahui.",
      "text": "فَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ دَعَانَاۖ  ثُمَّ اِذَا خَوَّلْنٰهُ نِعْمَةً مِّنَّاۙ قَالَ اِنَّمَآ اُوْتِيْتُهٗ عَلٰى عِلْمٍ ۗبَلْ هِيَ فِتْنَةٌ وَّلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ",
      "text_translation_en": "NOW [thus it is:] when affliction befalls man, he cries out unto Us for help; but when We bestow upon him a boon by Our grace, he says [to himself], “I have been given [all] this by virtue of [my own] wisdom!” Nay, this [bestowal of grace] is a trial: but most of them understand it not!",
      "juz_number": 24
    },
    "50": {
      "text_tafsir_en": "In this verse, Allah explains that such words have also been heard from the people before them, so that such an assumption is not a new one. What they tried before was useless to deny the coming of the punishment from Allah because they always acted denial and mocked the arrival of God's messenger.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa ucapan seperti itu pernah didengar pula dari umat-umat sebelum mereka, sehingga anggapan seperti itu bukanlah anggapan yang baru. Apa-apa yang mereka usahakan dahulu itu tidak berguna untuk menolak datangnya azab dari Allah karena mereka selalu bersikap mendustakan dan mencemooh kedatangan utusan Allah.",
      "text_translation": "Sungguh, orang-orang yang sebelum mereka pun telah mengatakan hal itu, maka tidak berguna lagi bagi mereka apa yang dahulu mereka kerjakan.",
      "text": "قَدْ قَالَهَا الَّذِيْنَ مِنْ قَبْلِهِمْ فَمَآ اَغْنٰى عَنْهُمْ مَّا كَانُوْا يَكْسِبُوْنَ",
      "text_translation_en": "The same did say [to themselves many of] those who lived before their time; but of no avail to them was all that they had ever achieved:",
      "juz_number": 24
    },
    "51": {
      "text_tafsir_en": "This verse explains that they are plagued by the bad consequences of what they do. Allah hastened to them a punishment like the carved swallows of the earth, the glittering thunder that gripped the people of Luth, and the eternal disaster that would overtake them in the Hereafter. Those who are unjust among them will be affected by the evils of their efforts, including those who have always opposed the Messenger of Allah. They will surely suffer from the consequences of their disbelief as much as those who were before them. Among the examples of the doom was the famine that plagued them for seven years, their leaders being killed and captured during the Badr War. Nor will they escape and escape the torment of Allah on the Day of Resurrection.",
      "text_tafsir": "Ayat ini menjelaskan bahwa mereka ditimpa oleh akibat buruk dari apa yang mereka lakukan. Allah mempercepat datangnya azab kepada mereka seperti Karun yang ditelan bumi, gelegar halilintar yang menyambar kaum Lut, dan bencana abadi yang akan menimpa mereka di akhirat. Orang-orang yang zalim di antara mereka akan ditimpa akibat buruk dari usahanya, termasuk pula orang-orang musyrikin yang selalu menentang Rasulullah saw. Mereka pasti akan ditimpa azab sebagai akibat buruk dari kekafiran mereka seperti azab yang ditimpakan kepada orang-orang terdahulu. Di antara contoh azab itu ialah bencana kelaparan yang melanda mereka selama tujuh tahun, pemuka-pemuka mereka terbunuh dan ditawan pada waktu Perang Badar. Mereka juga tidak akan dapat lolos dan melarikan diri dari azab Allah pada hari Kiamat.",
      "text_translation": "Lalu mereka ditimpa (bencana) dari akibat buruk apa yang mereka perbuat. Dan orang-orang yang zalim di antara mereka juga akan ditimpa (bencana) dari akibat buruk apa yang mereka kerjakan dan mereka tidak dapat melepaskan diri.",
      "text": "فَاَصَابَهُمْ سَيِّاٰتُ مَا كَسَبُوْا ۗوَالَّذِيْنَ ظَلَمُوْا مِنْ هٰٓؤُلَاۤءِ سَيُصِيْبُهُمْ سَيِّاٰتُ مَا كَسَبُوْا ۙوَمَا هُمْ بِمُعْجِزِيْنَ",
      "text_translation_en": "for all the evil deeds that they had wrought fell [back] upon them. And [the same will happen to] people of the present time who are bent on wrongdoing: all the evil deeds that they have ever wrought will fall [back] upon them, and never will they be able to elude [God]!",
      "juz_number": 24
    },
    "52": {
      "text_tafsir_en": "In this verse, God shows evidence of His power, majesty and wisdom. The polytheists did not know that it was Allah who provided sustenance to whomever He wanted and narrowed to whomever He wanted. It is an undeniable fact that human conditions vary in their property and wealth, some are very rich and some are very poor. Such a thing cannot be attributed solely to intelligence or skill. Sometimes those with a high level of education are lacking in life, whereas those with a low level of education are well off. In fact, on that occasion there are signs of Allah's power to the believers. They know that all of that is arranged by God. Nothing in this life is beyond His rules",
      "text_tafsir": "Pada ayat ini, Allah memperlihatkan bukti atas kekuasaan, keagungan dan kebijaksanaan-Nya. Orang-orang musyrikin itu tidak mengetahui bahwa Allah-lah yang melapangkan rezeki kepada siapa yang Ia kehendaki dan menyempitkan bagi siapa yang dikehendaki-Nya. Suatu kenyataan yang tak dapat dibantah bahwa keadaan manusia berbeda-beda tentang milik dan kekayaannya, ada yang sangat kaya dan ada yang sangat miskin. Hal yang demikian itu tidak dapat dikaitkan hanya dengan kepandaian atau keterampilan saja. Kadang-kadang yang berpendidikan tinggi hidupnya serba kekurangan sebaliknya yang berpendidikan rendah hidupnya serba berkecukupan.\n\nSesungguhnya pada kejadian itu terdapat tanda-tanda kekuasaan Allah bagi kaum yang beriman. Mereka mengetahui bahwa semua itu diatur oleh Allah. Tidak ada suatu kejadian pun dalam kehidupan ini yang di luar aturan-Nya",
      "text_translation": "Dan tidakkah mereka mengetahui bahwa Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan membatasinya (bagi siapa yang Dia kehendaki)? Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang beriman.",
      "text": "اَوَلَمْ يَعْلَمُوْٓا اَنَّ اللّٰهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ وَيَقْدِرُ ۗاِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يُّؤْمِنُوْنَ ࣖ",
      "text_translation_en": "Are they, then, not aware that it is God who grants abundant sustenance, or gives it in scant measure, unto whomever He wills? In this, behold, there are messages indeed for peo­ple who will believe!",
      "juz_number": 24
    },
    "53": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad to convey to his people that Allah is Oft-Forgiving, Most Merciful and in His great mercy and love towards His faithful servants, will forgive all the sins they have committed, He or works for His prohibition when truly repent of their wrongdoing. Many people think that because their sins are piled up, God will never forgive them again. Become a despairing person of His forgiveness, mercy, and love. The world has become dark in his eyes because all this time he has ignored his religious teachings and has always turned his back on the principles they contain. His heart is full of impurity and rebellion, and he does not see the path of truth and good that he will come. He was overwhelmed by the hopelessness and hopelessness that he had to return from the misguidedness and cruelty he had always made. But God, in spite of the great sin of his servant, still loves and adores him and forbids him to despair of his mercy and love, but he still views him as his servant who is entitled to his love when he has blamed his wrongdoing and begged for forgiveness. to him. Not for the believers, for the Muslims still open the door of repentance when they convert to Islam and believe in Allah and His Messenger. According to Imam al-Bukhari of Sa'id bin Jubair of Ibn 'Abbas that many of the Muslims had committed many murders and often committed adultery to Prophet Muhammad. They said to him, \"Indeed, whatever you ask of us is good. Can you explain to us that what we did before will be forgiven.\" The Prophet answered by reciting the word of Allah: And those who do not associate with Allah with other worships and do not kill those whom Allah forbids except for the right, and the immoral; and whoever does that, he will receive a severe punishment, (that is) a double punishment for him on the Day of Judgment, and he will remain in that torment, in disgrace except those who repent and believe and do good; then their evil will be replaced by God for good. Allah is Oft-Forgiving, Most Merciful. (al-Furqan \/ 25: 68-70) In the hadith of the Holy Prophet is also explained: 'Amr bin' Anbasah, may Allah be pleased with him, reported that the Prophet (peace be upon him) had come to him on his stick and said to him, \"O Messenger of Allah, Is it possible to be forgiven? \" The Prophet (peace be upon him) said, \"Have you acknowledged that there is no God but God?\" The old man answered, \"Yes, even I admit that you are the messenger of God.\" The Messenger of Allah (may peace be upon him) affirmed that Allah forgives all the sins and sins that you have committed. \"(A.Hmad narration) The hadiths emphasize that Allah forgives all sins, however great and abundant, if one truly repents, will never return to wrongdoing, and will continue to do good deeds. Servants of God cannot despair of His forgiveness, mercy, and mercy, because His door of mercy is wide open to repentant people, as justified in His word. : And whoever does evil and persecutes himself, then he begs for Allah's forgiveness, but he will find Allah Oft-Forgiving, Most Merciful. (4: 110) After forbidding His servants to despair of mercy and love -Yes, God encouraged His servants to seek His forgiveness and repent of all their misdeeds and mistakes. a pardon all sins except the sin of shirk as mentioned in His word: Verily Allah will not forgive (sin) for associating Him (shirk), and He will forgive whatever (sin) that is besides whom He pleases. Whoever associates with Allah, then indeed, he has committed a great sin. (an-Nisa '\/ 4: 48) How great and how generous is God's mercy to his servant. Servants who have rebelled against His command, violated His laws, and wandered in sin and wickedness, are still called as His servants and are counseled not to despair of His forgiveness and mercy.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan kepada Nabi Muhammad agar menyampaikan kepada umatnya bahwa Allah Yang Maha Pengampun, Maha Penyayang dan sangat luas rahmat dan kasih sayang-Nya terhadap hamba-Nya yang beriman, akan mengampuni segala dosa yang telah terlanjur mereka kerjakan seperti meninggalkan perintah-Nya atau mengerjakan larangan-Nya apabila benar-benar tobat dari kesalahan mereka. Banyak orang yang menyangka bahwa karena dosanya telah bertumpuk-tumpuk, tidak akan diampuni Allah lagi. Jadilah ia seorang yang berputus asa terhadap ampunan, rahmat, dan kasih sayang-Nya. Dunia sudah menjadi gelap menurut pandangannya karena selama ini dia tidak mengindahkan ajaran-ajaran agamanya dan selalu membelakangi petunjuk-petunjuk yang terdapat di dalamnya. Hatinya sudah penuh diliputi kekotoran dan kedurhakaan, tak tampak lagi olehnya jalan kebenaran dan kebaikan yang akan ditempuhnya. Dia telah dibingungkan oleh rasa putus asa dan tak ada harapan yang tampak olehnya untuk kembali dari kesesatan dan kemaksiatan yang selalu diperbuatnya. Tetapi Allah, meskipun besar dosa hamba-Nya, Dia tetap mengasihi dan menyantuninya dan melarangnya berputus asa terhadap rahmat dan kasih sayang-Nya, Dia tetap memandangnya sebagai hamba-Nya yang berhak menerima kasih sayang-Nya itu apabila ia telah menginsyafi kesalahannya dan memohon ampun kepada-Nya. Jangankan untuk orang-orang yang beriman, untuk orang-orang musyrik pun masih terbuka pintu tobat apabila mereka masuk Islam dan beriman kepada Allah dan rasul-Nya.\n\nDiriwayatkan oleh Imam al-Bukhari dari Sa'id bin Jubair dari Ibnu 'Abbas bahwa banyak di antara orang-orang musyrik yang telah banyak melakukan pembunuhan dan sering berzina datang kepada Nabi Muhammad. Mereka berkata kepadanya, \"Sesungguhnya apa yang engkau serukan kepada kami adalah baik. Dapatkah engkau terangkan kepada kami bahwa yang kami kerjakan dahulu itu akan diampuni-Nya.\"\n\nNabi menjawab dengan membacakan firman Allah:\n\nDan orang-orang yang tidak mempersekutukan Allah dengan sembahan lain dan tidak membunuh orang yang diharamkan Allah kecuali dengan (alasan) yang benar, dan tidak berzina; dan barang siapa melakukan demikian itu, niscaya dia mendapat hukuman yang berat, (yakni) akan dilipatgandakan azab untuknya pada hari Kiamat dan dia akan kekal dalam azab itu, dalam keadaan terhina, kecuali orang-orang yang bertobat dan beriman dan mengerjakan kebajikan; maka kejahatan mereka diganti Allah dengan kebaikan. Allah Maha Pengampun, Maha Penyayang. (al-Furqan\/25: 68-70)\n\nDalam hadis Nabi saw juga dijelaskan:\n\nDiriwayatkan dari 'Amr bin 'Anbasah bahwa telah datang menemui Nabi saw seorang yang telah tua bangka bertelekan di atas tongkatnya dan berkata kepada beliau, \"Hai Rasulullah, saya banyak mengerjakan kesalahan dan maksiat. Apakah mungkin kesalahan itu diampuni?\" Nabi saw menjawab, \"Apakah engkau telah mengakui bahwa tiada Tuhan selain Allah?\" Orang tua itu menjawab, \"Benar, bahkan aku mengakui bahwa engkau utusan Allah.\" Rasulullah saw menegaskan, Allah mengampuni semua kesalahan dan maksiat yang telah engkau lakukan itu.\" (Riwayat A.hmad)\n\nHadis-hadis tersebut menegaskan bahwa Allah mengampuni semua kesalahan bagaimanapun besar dan banyaknya, bila seseorang itu benar-benar bertobat dengan setulus hati, berikrar tidak akan kembali melakukan kesalahan, dan akan tetap melakukan amal saleh. Hamba Allah tidak boleh berputus asa terhadap ampunan, rahmat, dan kasih sayang-Nya, karena pintu rahmat-Nya terbuka seluas-luasnya bagi orang yang bertobat, sebagai ditegaskan dalam firman-Nya:\n\nDan barang siapa berbuat kejahatan dan menganiaya dirinya, kemudian dia memohon ampunan kepada Allah, niscaya dia akan mendapatkan Allah Maha Pengampun, Maha Penyayang. (an-Nisa'\/4: 110)\n\nSetelah melarang hamba-Nya berputus asa terhadap rahmat dan kasih sayang-Nya, Allah mendorong hamba-Nya agar segera meminta ampun dan bertobat kepada-Nya atas segala ketelanjuran dan kesalahan yang telah dilakukan. Allah juga menegaskan bahwa Dia mengampuni segala dosa kecuali dosa syirik sebagai tersebut dalam firman-Nya:\n\nSesungguhnya Allah tidak akan mengampuni (dosa) karena mempersekutukan-Nya (syirik), dan Dia mengampuni apa (dosa) yang selain (syirik) itu bagi siapa yang Dia kehendaki. Barang siapa mempersekutukan Allah, maka sungguh, dia telah berbuat dosa yang besar. (an-Nisa'\/4: 48)\n\nMemang besar dan luas rahmat Allah terhadap hamba-Nya. Hamba yang telah mendurhakai karena mengabaikan perintah-Nya, melanggar hukum-hukum yang telah ditetapkan-Nya, dan bergelimang dalam dosa dan maksiat, masih saja dipanggil sebagai hamba-Nya dan dinasihati supaya jangan berputus asa terhadap ampunan dan rahmat-Nya.",
      "text_translation": "Katakanlah, “Wahai hamba-hamba-Ku yang melampaui batas terhadap diri mereka sendiri! Janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sungguh, Dialah Yang Maha Pengampun, Maha Penyayang.",
      "text": "۞ قُلْ يٰعِبَادِيَ الَّذِيْنَ اَسْرَفُوْا عَلٰٓى اَنْفُسِهِمْ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ ۗاِنَّ اللّٰهَ يَغْفِرُ الذُّنُوْبَ جَمِيْعًا ۗاِنَّهٗ هُوَ الْغَفُوْرُ الرَّحِيْمُ",
      "text_translation_en": "SAY: “[Thus speaks God:] ‘O you servants of Mine who have transgressed against your own selves! Despair not of God’s mercy: behold, God forgives all sins - for, verily, He alone is much-forgiving, a dis­penser of grace!’”",
      "juz_number": 24
    },
    "54": {
      "text_tafsir_en": "For those who accept this call to repent to God and believe with all their heart the fullness of His mercy and forgiveness, God commands them to return to the straight path which He has set, to submit to Him, and under his protection. In the presence of God there are various gifts and favors that will be bestowed upon him, when he has repented and returned to his glorified servant. Every sinner must take this good opportunity immediately before the Day of Judgment, where repentance and remorse will not be accepted. Do not let this good opportunity go by simply because the one who loses it will lose it. In another verse, God says: It is not yet time for believers to devote themselves to remembering Allah and to obey the revealed truth, and not to be like those who have received the Scripture before, then they went through a long time until their hearts became hard. And many of them became wicked. (al-hadid \/ 57: 16) The golden opportunity that God has given is to be used well before the time when it decides where the door of repentance is close, that is, when the time has come or when the Day of Resurrection has come. At that time, no wicked person could escape the torment of God and no creature could defend and save it from that torment. He must truly follow and obey all the teachings that God has revealed in the Qur'an al-Karim for the good and happiness of man in the world and in the hereafter. Don't let anyone wait until tomorrow to repent because they don't know if they will live until tomorrow. Someone might have promised himself that he would repent tomorrow evening, but who knows, it wasn't until later that he died and he lost that precious opportunity. repeatedly saying words of regret in various ways",
      "text_tafsir": "Bagi orang-orang yang menerima seruan ini dengan bertobat kepada Allah dan percaya dengan sepenuh hatinya kepada keluasan rahmat dan ampunan-Nya, Allah memerintahkan agar dia benar-benar kembali kepada jalan yang lurus yang telah dibentangkan-Nya, berserah diri kepada-Nya, dan bernaung di bawah lindungan-Nya. Di sisi Allah tersedia berbagai macam karunia dan nikmat yang akan dilimpahkan kepadanya, apabila ia telah insaf dan kembali menjadi hamba yang dimuliakan-Nya. Setiap orang berdosa hendaklah mengambil kesempatan baik ini dengan segera sebelum datang hari Kiamat di mana tobat dan penyesalan tidak akan diterima lagi. Janganlah kesempatan yang baik ini dibiarkan berlalu begitu saja karena yang akan rugi ialah orang yang tidak mengindahkannya. Dalam ayat lain, Allah berfirman:\n\nBelum tibakah waktunya bagi orang-orang yang beriman, untuk secara khusyuk mengingat Allah dan mematuhi kebenaran yang telah diwahyukan (kepada mereka), dan janganlah mereka (berlaku) seperti orang-orang yang telah menerima kitab sebelum itu, kemudian mereka melalui masa yang panjang sehingga hati mereka menjadi keras. Dan banyak di antara mereka menjadi orang-orang fasik. (al-hadid\/57: 16)\n\nPeluang emas yang dikaruniakan Allah hendaklah dimanfaatkan sebaik-baiknya sebelum tiba saat yang menentukan di mana pintu tobat telah tertutup rapat, yaitu pada saat ajal telah tiba atau pada saat hari Kiamat telah datang. Pada saat itu, tidak seorang yang durhaka pun yang dapat melepaskan diri dari siksaan Allah dan tak ada suatu makhluk pun yang dapat membela dan menghindarkannya dari azab itu. Hendaklah dia benar-benar mengikuti dan mematuhi semua ajaran yang telah dijelaskan Allah dalam Al-Qur'an al-Karim untuk kebaikan dan kebahagiaan manusia di dunia dan di akhirat. Janganlah seseorang menunggu sampai besok untuk bertobat karena dia tidak mengetahui apakah ia akan hidup sampai besok. Mungkin seseorang berjanji kepada dirinya bahwa dia akan bertobat esok sore harinya, tetapi siapa tahu, belum lagi waktu sore datang dia sudah meninggal dan hilanglah kesempatan yang sangat berharga itu.\n\nberulang-ulang mengucapkan kata-kata penyesalan dengan berbagai macam cara",
      "text_translation": "Dan kembalilah kamu kepada Tuhanmu, dan berserah dirilah kepada-Nya sebelum datang azab kepadamu, kemudian kamu tidak dapat ditolong.",
      "text": "وَاَنِيْبُوْٓا اِلٰى رَبِّكُمْ وَاَسْلِمُوْا لَهٗ مِنْ قَبْلِ اَنْ يَّأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنْصَرُوْنَ",
      "text_translation_en": "Hence, turn towards your Sustainer [alone] and surrender yourselves unto Him ere the suffering [of death and resurrection] comes upon you, for then you will not be succoured.",
      "juz_number": 24
    },
    "55": {
      "text_tafsir_en": "For those who accept this call to repent to God and believe with all their heart the fullness of His mercy and forgiveness, God commands them to return to the straight path which He has set, to submit to Him, and under his protection. In the presence of God there are various gifts and favors that will be bestowed upon him, when he has repented and returned to his glorified servant. Every sinner must take this good opportunity immediately before the Day of Judgment, where repentance and remorse will not be accepted. Do not let this good opportunity go by simply because the one who loses it will lose it. In another verse, God says: It is not yet time for believers to devote themselves to remembering Allah and to obey the revealed truth, and not to be like those who have received the Scripture before, then they went through a long time until their hearts became hard. And many of them became wicked. (al-hadid \/ 57: 16) The golden opportunity that God has given is to be used well before the time when it decides where the door of repentance is close, that is, when the time has come or when the Day of Resurrection has come. At that time, no wicked person could escape the torment of God and no creature could defend and save it from that torment. He must truly follow and obey all the teachings that God has revealed in the Qur'an al-Karim for the good and happiness of man in the world and in the hereafter. Don't let anyone wait until tomorrow to repent because they don't know if they will live until tomorrow. Someone might have promised himself that he would repent tomorrow evening, but who knows, it wasn't until later that he died and he lost that precious opportunity. repeatedly saying words of regret in various ways",
      "text_tafsir": "Bagi orang-orang yang menerima seruan ini dengan bertobat kepada Allah dan percaya dengan sepenuh hatinya kepada keluasan rahmat dan ampunan-Nya, Allah memerintahkan agar dia benar-benar kembali kepada jalan yang lurus yang telah dibentangkan-Nya, berserah diri kepada-Nya, dan bernaung di bawah lindungan-Nya. Di sisi Allah tersedia berbagai macam karunia dan nikmat yang akan dilimpahkan kepadanya, apabila ia telah insaf dan kembali menjadi hamba yang dimuliakan-Nya. Setiap orang berdosa hendaklah mengambil kesempatan baik ini dengan segera sebelum datang hari Kiamat di mana tobat dan penyesalan tidak akan diterima lagi. Janganlah kesempatan yang baik ini dibiarkan berlalu begitu saja karena yang akan rugi ialah orang yang tidak mengindahkannya. Dalam ayat lain, Allah berfirman:\n\nBelum tibakah waktunya bagi orang-orang yang beriman, untuk secara khusyuk mengingat Allah dan mematuhi kebenaran yang telah diwahyukan (kepada mereka), dan janganlah mereka (berlaku) seperti orang-orang yang telah menerima kitab sebelum itu, kemudian mereka melalui masa yang panjang sehingga hati mereka menjadi keras. Dan banyak di antara mereka menjadi orang-orang fasik. (al-hadid\/57: 16)\n\nPeluang emas yang dikaruniakan Allah hendaklah dimanfaatkan sebaik-baiknya sebelum tiba saat yang menentukan di mana pintu tobat telah tertutup rapat, yaitu pada saat ajal telah tiba atau pada saat hari Kiamat telah datang. Pada saat itu, tidak seorang yang durhaka pun yang dapat melepaskan diri dari siksaan Allah dan tak ada suatu makhluk pun yang dapat membela dan menghindarkannya dari azab itu. Hendaklah dia benar-benar mengikuti dan mematuhi semua ajaran yang telah dijelaskan Allah dalam Al-Qur'an al-Karim untuk kebaikan dan kebahagiaan manusia di dunia dan di akhirat. Janganlah seseorang menunggu sampai besok untuk bertobat karena dia tidak mengetahui apakah ia akan hidup sampai besok. Mungkin seseorang berjanji kepada dirinya bahwa dia akan bertobat esok sore harinya, tetapi siapa tahu, belum lagi waktu sore datang dia sudah meninggal dan hilanglah kesempatan yang sangat berharga itu.\n\nberulang-ulang mengucapkan kata-kata penyesalan dengan berbagai macam cara",
      "text_translation": "Dan ikutilah sebaik-baik apa yang telah diturunkan kepadamu (Al-Qur'an) dari Tuhanmu sebelum datang azab kepadamu secara mendadak, sedang kamu tidak menyadarinya,",
      "text": "وَاتَّبِعُوْٓا اَحْسَنَ مَآ اُنْزِلَ اِلَيْكُمْ مِّنْ رَّبِّكُمْ مِّنْ قَبْلِ اَنْ يَّأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَّاَنْتُمْ لَا تَشْعُرُوْنَ ۙ  ",
      "text_translation_en": "And ere that suffering comes upon you of a sudden, without your being aware [of its approach], follow the most goodly [teaching] that has been revealed unto you by your Sustainer,",
      "juz_number": 24
    },
    "56": {
      "text_tafsir_en": "In these verses, God explains how to regret those who do not take advantage of the golden opportunity that God has given them. In the hereafter, they will repeatedly say words of remorse in various ways, including: 1. I am so sorry for my ignorance and neglect in my life that I disregard the teachings of God, always disobeying Him, leaving my obligations to Him as a servant, and in violation of His laws. Why don't I use the opportunity that God has given me to repent and return to the straight path. Why do I always make fun of those who are obedient and obedient in carrying out His instructions and teachings even including those who despise and consider His religion. 2. Why do I not accept His guidance through His messenger, and do not practice His instructions. If I had accepted and practiced these precepts and teachings, I would have been among those who were devoutly prepared for them Jannatun Na'im's paradise full of grace and pleasure and full of the happiness and joy of God. 3. When he saw the fire of hell and all kinds of torments inflicted on his inhabitants, and he felt sure to be thrown into it, he wondered and hoped that he might return to the world so that he could do as much good deeds as possible to supply in the hereafter freed from the torment of hell and into the ranks of those who do good.",
      "text_tafsir": "Pada ayat-ayat ini, Allah menerangkan bagaimana penyesalan orang-orang yang tidak mempergunakan peluang emas yang diberikan Allah kepada mereka. Di akhirat nanti, mereka akan berulang-ulang mengucapkan kata-kata penyesalan dengan berbagai macam cara, di antaranya:\n\n1. Sesungguhnya aku sangat menyesal atas kelalaian dan kealpaanku semasa hidup sehingga aku tidak mengindahkan ajaran-ajaran Allah, selalu durhaka terhadap-Nya, meninggalkan kewajiban-kewajibanku terhadap-Nya sebagai hamba, dan melanggar hukum-hukum yang telah ditetapkan-Nya. Kenapa aku tidak mempergunakan kesempatan yang diberikan Allah kepadaku untuk bertobat dan kembali ke jalan yang lurus. Kenapa aku selalu memperolok-olokkan orang-orang yang telah taat dan patuh menjalankan petunjuk dan ajaran-Nya bahkan termasuk orang-orang yang menghina dan menganggap enteng agama-Nya.\n\n2. Kenapa aku tidak menerima dengan baik petunjuk yang diberikan-Nya dengan perantaraan rasul-Nya, dan tidak mengamalkan petunjuk ajaran-Nya. Kalau sekiranya aku menerima dan mengamalkan petunjuk dan ajaran itu, tentu aku termasuk dalam golongan orang-orang yang bertakwa yang disediakan bagi mereka surga Jannatun Na'im yang penuh dengan nikmat dan kesenangan serta penuh dengan kebahagiaan dan keridaan Allah.\n\n3. Ketika dia melihat api neraka dan berbagai macam siksaan yang ditimpakan kepada penghuninya, dan dia merasa pasti akan dilemparkan ke dalamnya, dia berangan-angan dan mengharapkan kalau dapat kembali ke dunia agar dia dapat berbuat amal saleh sebanyak-banyaknya untuk bekal di akhirat sehingga terbebas dari siksaan neraka dan dimasukkan ke dalam golongan orang-orang yang berbuat baik.",
      "text_translation": "agar jangan ada orang yang mengatakan, ‘Alangkah besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah, dan sesungguhnya aku termasuk orang-orang yang memperolok-olokkan (agama Allah),’",
      "text": "اَنْ تَقُوْلَ نَفْسٌ يّٰحَسْرَتٰى عَلٰى مَا فَرَّطْتُّ فِيْ جَنْۢبِ اللّٰهِ وَاِنْ كُنْتُ لَمِنَ السَّاخِرِيْنَۙ   ",
      "text_translation_en": "lest any human being should say [on Judgment Day], “Alas for me for having been remiss in what is due to God, and for having been indeed one of those who scoffed [at the truth]!”",
      "juz_number": 24
    },
    "57": {
      "text_tafsir_en": "In these verses, God explains how to regret those who do not take advantage of the golden opportunity that God has given them. In the hereafter, they will repeatedly say words of remorse in various ways, including: 1. I am so sorry for my ignorance and neglect in my life that I disregard the teachings of God, always disobeying Him, leaving my obligations to Him as a servant, and in violation of His laws. Why don't I use the opportunity that God has given me to repent and return to the straight path. Why do I always make fun of those who are obedient and obedient in carrying out His instructions and teachings even including those who despise and consider His religion. 2. Why do I not accept His guidance through His messenger, and do not practice His instructions. If I had accepted and practiced these precepts and teachings, I would have been among those who were devoutly prepared for them Jannatun Na'im's paradise full of grace and pleasure and full of the happiness and joy of God. 3. When he saw the fire of hell and all kinds of torments inflicted on his inhabitants, and he felt sure to be thrown into it, he wondered and hoped that he might return to the world so that he could do as much good deeds as possible to supply in the hereafter freed from the torment of hell and into the ranks of those who do good.",
      "text_tafsir": "Pada ayat-ayat ini, Allah menerangkan bagaimana penyesalan orang-orang yang tidak mempergunakan peluang emas yang diberikan Allah kepada mereka. Di akhirat nanti, mereka akan berulang-ulang mengucapkan kata-kata penyesalan dengan berbagai macam cara, di antaranya:\n\n1. Sesungguhnya aku sangat menyesal atas kelalaian dan kealpaanku semasa hidup sehingga aku tidak mengindahkan ajaran-ajaran Allah, selalu durhaka terhadap-Nya, meninggalkan kewajiban-kewajibanku terhadap-Nya sebagai hamba, dan melanggar hukum-hukum yang telah ditetapkan-Nya. Kenapa aku tidak mempergunakan kesempatan yang diberikan Allah kepadaku untuk bertobat dan kembali ke jalan yang lurus. Kenapa aku selalu memperolok-olokkan orang-orang yang telah taat dan patuh menjalankan petunjuk dan ajaran-Nya bahkan termasuk orang-orang yang menghina dan menganggap enteng agama-Nya.\n\n2. Kenapa aku tidak menerima dengan baik petunjuk yang diberikan-Nya dengan perantaraan rasul-Nya, dan tidak mengamalkan petunjuk ajaran-Nya. Kalau sekiranya aku menerima dan mengamalkan petunjuk dan ajaran itu, tentu aku termasuk dalam golongan orang-orang yang bertakwa yang disediakan bagi mereka surga Jannatun Na'im yang penuh dengan nikmat dan kesenangan serta penuh dengan kebahagiaan dan keridaan Allah.\n\n3. Ketika dia melihat api neraka dan berbagai macam siksaan yang ditimpakan kepada penghuninya, dan dia merasa pasti akan dilemparkan ke dalamnya, dia berangan-angan dan mengharapkan kalau dapat kembali ke dunia agar dia dapat berbuat amal saleh sebanyak-banyaknya untuk bekal di akhirat sehingga terbebas dari siksaan neraka dan dimasukkan ke dalam golongan orang-orang yang berbuat baik.",
      "text_translation": "atau (agar jangan) ada yang berkata, ‘Sekiranya Allah memberi petunjuk kepadaku tentulah aku termasuk orang-orang yang bertakwa,’",
      "text": "اَوْ تَقُوْلَ لَوْ اَنَّ اللّٰهَ هَدٰىنِيْ لَكُنْتُ مِنَ الْمُتَّقِيْنَ ۙ",
      "text_translation_en": "or lest he should say, “If God had but guided me, I would surely have been among those who are conscious of Him!”-",
      "juz_number": 24
    },
    "58": {
      "text_tafsir_en": "In these verses, God explains how to regret those who do not take advantage of the golden opportunity that God has given them. In the hereafter, they will repeatedly say words of remorse in various ways, including: 1. I am so sorry for my ignorance and neglect in my life that I disregard the teachings of God, always disobeying Him, leaving my obligations to Him as a servant, and in violation of His laws. Why don't I use the opportunity that God has given me to repent and return to the straight path. Why do I always make fun of those who are obedient and obedient in carrying out His instructions and teachings even including those who despise and consider His religion. 2. Why do I not accept His guidance through His messenger, and do not practice His instructions. If I had accepted and practiced these precepts and teachings, I would have been among those who were devoutly prepared for them Jannatun Na'im's paradise full of grace and pleasure and full of the happiness and joy of God. 3. When he saw the fire of hell and all kinds of torments inflicted on his inhabitants, and he felt sure to be thrown into it, he wondered and hoped that he might return to the world so that he could do as much good deeds as possible to supply in the hereafter freed from the torment of hell and into the ranks of those who do good.",
      "text_tafsir": "Pada ayat-ayat ini, Allah menerangkan bagaimana penyesalan orang-orang yang tidak mempergunakan peluang emas yang diberikan Allah kepada mereka. Di akhirat nanti, mereka akan berulang-ulang mengucapkan kata-kata penyesalan dengan berbagai macam cara, di antaranya:\n\n1. Sesungguhnya aku sangat menyesal atas kelalaian dan kealpaanku semasa hidup sehingga aku tidak mengindahkan ajaran-ajaran Allah, selalu durhaka terhadap-Nya, meninggalkan kewajiban-kewajibanku terhadap-Nya sebagai hamba, dan melanggar hukum-hukum yang telah ditetapkan-Nya. Kenapa aku tidak mempergunakan kesempatan yang diberikan Allah kepadaku untuk bertobat dan kembali ke jalan yang lurus. Kenapa aku selalu memperolok-olokkan orang-orang yang telah taat dan patuh menjalankan petunjuk dan ajaran-Nya bahkan termasuk orang-orang yang menghina dan menganggap enteng agama-Nya.\n\n2. Kenapa aku tidak menerima dengan baik petunjuk yang diberikan-Nya dengan perantaraan rasul-Nya, dan tidak mengamalkan petunjuk ajaran-Nya. Kalau sekiranya aku menerima dan mengamalkan petunjuk dan ajaran itu, tentu aku termasuk dalam golongan orang-orang yang bertakwa yang disediakan bagi mereka surga Jannatun Na'im yang penuh dengan nikmat dan kesenangan serta penuh dengan kebahagiaan dan keridaan Allah.\n\n3. Ketika dia melihat api neraka dan berbagai macam siksaan yang ditimpakan kepada penghuninya, dan dia merasa pasti akan dilemparkan ke dalamnya, dia berangan-angan dan mengharapkan kalau dapat kembali ke dunia agar dia dapat berbuat amal saleh sebanyak-banyaknya untuk bekal di akhirat sehingga terbebas dari siksaan neraka dan dimasukkan ke dalam golongan orang-orang yang berbuat baik.",
      "text_translation": "atau (agar jangan) ada yang berkata ketika melihat azab, ‘Sekiranya aku dapat kembali (ke dunia), tentu aku termasuk orang-orang yang berbuat baik.’",
      "text": "اَوْ تَقُوْلَ حِيْنَ تَرَى الْعَذَابَ لَوْ اَنَّ لِيْ كَرَّةً فَاَكُوْنَ مِنَ الْمُحْسِنِيْنَ",
      "text_translation_en": "or lest he should say, when he becomes aware of the suffering [that awaits him], “Would that I had a second chance [in life], so that I could be among the doers of good!”",
      "juz_number": 24
    },
    "59": {
      "text_tafsir_en": "In this verse, God tells the people who are lost and do not want to use the opportunity to repent that the fate that befalls them cannot be avoided because Allah has provided enough lessons and warnings. God has also given us the opportunity to repent and do good, but they are ignored and ignored. They only follow their lust and greed and become greedy, arrogant, and arrogant. They also belong to the heathen. All their thoughts and requests are rejected and they act upon the justice of God, which is good and righteous is entered into heaven and evil and wicked is cast into hell.",
      "text_tafsir": "Pada ayat ini, Allah menyatakan kepada orang yang telah sesat dan tidak mau mempergunakan kesempatan untuk bertobat itu bahwa nasib yang menimpa mereka tak dapat dihindarkan lagi karena Allah telah cukup memberi pelajaran dan peringatan. Allah juga telah memberikan kesempatan untuk bertobat dan berbuat baik, tetapi semua itu tidak diindahkan dan tidak dipedulikan. \n\nMereka hanya mengikuti hawa nafsu dan keinginan belaka sehingga menjadi orang yang durhaka, sombong, dan takabur. Mereka juga termasuk ke dalam golongan orang-orang kafir. Semua angan-angan dan permohonan mereka ditolak semuanya dan berlakulah terhadap dirinya keadilan Allah, yang berbuat baik dan bertakwa dimasukkan ke dalam surga dan yang berbuat jahat dan durhaka dimasukkan ke dalam neraka.",
      "text_translation": "Sungguh, sebenarnya keterangan-keterangan-Ku telah datang kepadamu, tetapi kamu mendustakannya, malah kamu menyombongkan diri dan termasuk orang kafir.”",
      "text": "بَلٰى قَدْ جَاۤءَتْكَ اٰيٰتِيْ فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنْتَ مِنَ الْكٰفِرِيْنَ",
      "text_translation_en": "[But God will reply:] “Yea, indeed! My mes­sages did come unto thee; but thou gavest them the lie, and wert filled with false pride, and wert among those who deny the truth!”",
      "juz_number": 24
    },
    "60": {
      "text_tafsir_en": "In this verse, Allah explained to the Prophet Muhammad that on the Day of Resurrection, he would see the faces of the infidels turning black as he was terrified to see and feel how great and terrible the chaos of that time was. There was nothing that could save them, as if they were besieged by danger and danger from every corner. Wherever they ran they were always confronted by such scary things that no one thought at that time except for their own safety from the danger of death. It is described in the word of God: In that day shall a man flee from his brother, and from his mother, and from his father, and from his wife, and from his children; Every single one of them that day had an affair. ('Abasa \/ 80: 34-37) And his word: We fear the Lord in the day when (those) with bitter eyes are full of trouble. (al-Insan \/ 76: 10) Besides seeing nothing that could help or save them from danger, they also knew that they would be dragged to hell because of their arrogance and arrogance throughout life. They do not want to believe and even insult the believers, treat them as weak people and just follow the teachings of the Messenger of God. If in the face of the world one becomes pale in the face of danger and may become blue out of fear, then on the Day of Judgment the unbeliever's face will become darker in panic and fear. Such is the fate of those who will surely be dragged and thrown into the flames of hell. The Prophet's Hadith: 'Abdullah bin' Umar, may Allah be pleased with them, reported: The Messenger of Allah (may peace be upon him) said: despised until they were dragged to Hell. \" (History of A.hmad and at-Tirmidzi)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan kepada Nabi Muhammad bahwa nanti pada hari Kiamat, dia akan melihat wajah orang-orang kafir menjadi hitam legam karena sangat ketakutan melihat dan merasakan bagaimana hebat dan dahsyatnya huru-hara waktu itu. Tidak ada sesuatu apa pun yang dapat menyelamatkan mereka, seakan-akan mereka sudah dikepung bahaya dan malapetaka dari segala penjuru. Ke manapun mereka lari selalu dihadang oleh hal-hal yang sangat menakutkan sehingga tak ada yang dipikirkan manusia pada waktu itu kecuali keselamatan dirinya dari mara bahaya maut itu. Hal ini diterangkan dalam firman Allah:\n\nPada hari itu manusia lari dari saudaranya, dan dari ibu dan bapaknya, dan dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. ('Abasa\/80: 34-37)\n\nDan firman-Nya:\n\nSungguh, kami takut akan (azab) Tuhan pada hari (ketika) orang-orang berwajah masam penuh kesulitan. (al-Insan\/76: 10) \n\nSelain tidak melihat apa pun yang dapat menolong atau menghindarkan mereka dari bahaya, mereka juga mengetahui bahwa mereka akan diseret ke dalam neraka karena kedurhakaan dan kesombongan mereka selama hidup di dunia. Mereka tidak mau beriman bahkan selalu menghina dan memperolok-olokkan orang-orang yang beriman, menganggap mereka kaum yang lemah sehingga mau saja mengikuti ajaran rasul yang diutus Allah. Kalau di dunia muka seseorang menjadi pucat-pasi ketika menghadapi bahaya dan mungkin menjadi biru karena ketakutan, maka pada hari Kiamat muka orang kafir itu menjadi hitam legam karena panik dan sangat takut. Begitulah nasib mereka yang pasti akan diseret dan dilemparkan ke dalam api neraka yang menyala-nyala.\n\nHadis Nabi saw:\n\nDiriwayatkan oleh 'Abdullah bin 'Umar bahwa Rasulullah saw bersabda (tentang nasib orang-orang yang kafir yang sombong), \"Pada hari Kiamat dikumpulkan orang-orang yang sombong seakan-akan mereka biji yang tak berharga. Mereka tetap dalam keadaan hina sampai mereka diseret ke dalam neraka Jahanam.\" (Riwayat A.hmad dan at-Tirmidzi)",
      "text_translation": "Dan pada hari Kiamat engkau akan melihat orang-orang yang berbuat dusta terhadap Allah, wajahnya menghitam. Bukankah neraka Jahanam itu tempat tinggal bagi orang yang menyombongkan diri?",
      "text": "وَيَوْمَ الْقِيٰمَةِ تَرَى الَّذِيْنَ كَذَبُوْا عَلَى اللّٰهِ وُجُوْهُهُمْ مُّسْوَدَّةٌ  ۗ اَلَيْسَ فِيْ جَهَنَّمَ مَثْوًى لِّلْمُتَكَبِّرِيْنَ",
      "text_translation_en": "And [so,] on the Day of Resurrection thou wilt see all who invented lies about God [with] their faces darkened [by grief and ignominy]. Is not hell the [proper] abode for all who are given to false pride?",
      "juz_number": 24
    },
    "61": {
      "text_tafsir_en": "Then Allah described the condition of the believers and the righteous. On the Day of Judgment, they were rescued by God from the threat of danger that day. With God's help and good deeds in the world, they can overcome all difficulties and save themselves from all kinds of dangers, until they enter heaven where all kinds of hardship and sorrow end. Their faces were white and radiant with joy and happiness as stated in the verse: On that day there were faces radiant, laughing and joyful. (Job \/ 80: 38-39)",
      "text_tafsir": "Kemudian Allah menerangkan keadaan orang-orang yang beriman dan bertakwa. Pada hari Kiamat, mereka diselamatkan Allah dari huru-hara bahaya yang mengancam pada hari itu. Dengan pertolongan Allah dan amal saleh di dunia, mereka dapat mengatasi segala kesulitan dan menyelamatkan diri dari segala macam bahaya, sampai mereka masuk surga di mana segala macam kesulitan dan kesedihan berakhir. Muka mereka putih berseri-seri karena merasa gembira dan bahagia sebagai tersebut pada ayat:\n\nPada hari itu ada wajah-wajah yang berseri-seri, tertawa dan gembira ria. ('Abasa\/80: 38-39)",
      "text_translation": "Dan Allah menyelamatkan orang-orang yang bertakwa karena kemenangan mereka. Mereka tidak disentuh oleh azab dan tidak bersedih hati.",
      "text": "وَيُنَجِّى اللّٰهُ الَّذِيْنَ اتَّقَوْا بِمَفَازَتِهِمْۖ  لَا يَمَسُّهُمُ السُّوْۤءُ وَلَا هُمْ يَحْزَنُوْنَ",
      "text_translation_en": "But God will safeguard all who were conscious of Him, [and will grant them happiness] by virtue of their [inner] triumphs; no evil shall ever touch them, and neither shall they grieve.",
      "juz_number": 24
    },
    "62": {
      "text_tafsir_en": "In these verses, God emphasizes that He is the Creator of all things, both in heaven and on earth. He is the Creator of the universe, and nothing can be created except Him. This is a fact of truth that no one can deny. No one can claim to be the creator of nature, for it would be unreasonable to assume that one has the power and authority to create this universe, nor can it be assumed that nature exists by itself without its creator. Therefore, it must be that the universe is created by the almighty and omnipotent, that is God. He is the One who governs all things, His knowledge is vast, including all His creatures. He is the one who controls nature from the smallest to the largest. He controls it according to his knowledge, wisdom and wisdom. There is no creature that intervenes in the creation and control. This is what a healthy mind can accept and a human conscience can accept. However, there are still many who deny this fact and claim that it is sovereign, and that it is God, as stated by Pharaoh or put forward a variety of theories about this world to establish that the universe exists by itself without anyone creating it. . Such people are disbelievers who always disregard the evidence of God's sovereignty in heaven and on earth and do not want to use the good sense that God has given them. These are the ones God says are the worst people in the world and in the hereafter. Some disbelievers think that \"Maqalid as-samawati wa al-ardh\" (control of heaven and earth here is his treasury). So, the keys of all the treasury kept in heaven and on earth are in His hands. He is the one who takes care of her. He is the ruler who has the right to share with whom He pleases. The Messenger of Allah (may peace be upon him) said: Usman, may Allah be pleased with him, reported that when he asked the Messenger of Allah to say, \"For Allah alone, the heavens and the earth will be holy.\" he replied, \"O Usman, you ask me something that no one has ever asked me before. Maqalid as- samawati wa al-ardh\" is the saying: There is no God but Allah, Allah is Great, Glory to Allah, all praise to Allah , I beg of God that there is no God but Him, the Beginning and the End, the Inner, the living, the dead, and yet He lives and dies, in His hand all good, and He is all-powerful. \" (History of Abu Ya'la, Ibn Abi atim, and Ibn Mardawaih) Whoever brings this speech will receive the benefits of heaven and earth.",
      "text_tafsir": "Pada ayat-ayat ini, Allah menegaskan bahwa Dialah Pencipta segala sesuatu yang ada, baik di langit maupun di bumi. Dialah Pencipta alam seluruhnya, tak ada sesuatu pun yang dapat menciptakan selain Dia. Ini adalah suatu hakikat kebenaran yang tidak seorang pun dapat mengingkarinya. Tidak ada seorang pun dapat menyatakan bahwa dirinya pencipta alam, karena tak akan diterima akal bahwa seseorang mempunyai kekuatan dan kekuasaan untuk menciptakan jagad raya ini, dan tidak dapat pula diterima akal bahwa alam ini terjadi dengan sendirinya tanpa ada penciptanya. Oleh sebab itu, pastilah alam ini diciptakan oleh Zat Yang Mahakuasa dan Maha Mengetahui segala sesuatu, itulah Dia Allah. \n\nAllah-lah yang mengurus segala yang ada, ilmu-Nya sangat luas, mencakup semua makhluk-Nya. Dialah yang mengendalikan alam sejak dari yang sekecil-kecilnya sampai kepada yang sebesar-besarnya. Dia mengendalikan semua itu sesuai dengan ilmu, hikmah dan kebijaksanaan-Nya. Tak ada suatu makhluk pun yang ikut campur tangan dalam penciptaan dan pengendalian itu. Inilah yang dapat diterima oleh akal yang sehat dan dapat diterima oleh hati nurani manusia. \n\nMeskipun demikian, masih banyak orang yang mengingkari hakikat ini dan mengatakan bahwa dialah yang berkuasa, dan dialah Tuhan, seperti yang dinyatakan oleh Fir'aun atau mengemukakan berbagai macam teori mengenai alam ini untuk menetapkan bahwa alam jagad raya ini terjadi dengan sendirinya tanpa ada yang menciptakannya. Orang yang seperti ini adalah orang-orang kafir yang selalu mengingkari bukti-bukti kekuasaan Allah baik di langit maupun di bumi dan tidak mau mempergunakan akal pikirannya yang sehat yang telah dianugerahkan Allah kepadanya. Mereka inilah yang dikatakan Allah sebagai orang-orang yang paling merugi baik di dunia apalagi di akhirat nanti.\n\nSebagian mufasir berpendapat bahwa yang dimaksud dengan \"Maqalid as-samawati wa al-ardh\" (kendali langit dan bumi di sini ialah perbendaharaannya). Jadi, kunci-kunci semua perbendaharaan yang tersimpan di langit dan di bumi berada di tangan-Nya. Dialah yang memelihara dan menjaganya. Dialah penguasanya yang berhak membagi-bagikan kepada siapa yang dikehendaki-Nya. Rasulullah bersabda:\n\nDiriwayatkan oleh Usman r.a. bahwa ketika ia menanyakan kepada Rasulullah tentang firman Allah \"Hanya bagi Allah, maqalid langit dan bumi.\" beliau menjawab, \"Hai Usman, engkau menanyakan kepadaku sesuatu yang belum pernah ditanyakan seseorang pun kepadaku sebelumnya. Maqalid as- samawati wa al-ardh\" ialah ucapan: Tidak ada Tuhan selain Allah, Allah Maha Besar, Maha Suci Allah, segala puji bagi Allah, aku memohon ampun kepada Allah yang tiada Tuhan selain Dia, Yang Awal Yang Akhir, Yang Lahir, Yang Batin, menghidupkan, mematikan, sedang Dia tetap hidup dan tidak mati, di tangan-Nyalah segala kebaikan, dan Dia Mahakuasa atas segala sesuatu.\" (Riwayat Abu Ya'la, Ibnu Abi hatim, dan Ibnu Mardawaih)\n\nBarang siapa yang membawa ucapan ini dia akan mendapat kebaikan yang ada di langit dan di bumi.",
      "text_translation": "Allah pencipta segala sesuatu dan Dia Maha Pemelihara atas segala sesuatu.",
      "text": "اَللّٰهُ خَالِقُ كُلِّ شَيْءٍ ۙوَّهُوَ عَلٰى كُلِّ شَيْءٍ وَّكِيْلٌ",
      "text_translation_en": "GOD is the Creator of all things, and He alone has the power to determine the fate of all things.",
      "juz_number": 24
    },
    "63": {
      "text_tafsir_en": "In these verses, God emphasizes that He is the Creator of all things, both in heaven and on earth. He is the Creator of the universe, and nothing can be created except Him. This is a fact of truth that no one can deny. No one can claim to be the creator of nature, for it would be unreasonable to assume that one has the power and authority to create this universe, nor can it be assumed that nature exists by itself without its creator. Therefore, it must be that the universe is created by the almighty and omnipotent, that is God. He is the One who governs all things, His knowledge is vast, including all His creatures. He is the one who controls nature from the smallest to the largest. He controls it according to his knowledge, wisdom and wisdom. There is no creature that intervenes in the creation and control. This is what a healthy mind can accept and a human conscience can accept. However, there are still many who deny this fact and claim that it is sovereign, and that it is God, as stated by Pharaoh or put forward a variety of theories about this world to establish that the universe exists by itself without anyone creating it. . Such people are disbelievers who always disregard the evidence of God's sovereignty in heaven and on earth and do not want to use the good sense that God has given them. These are the ones God says are the worst people in the world and in the hereafter. Some disbelievers think that \"Maqalid as-samawati wa al-ardh\" (control of heaven and earth here is his treasury). So, the keys of all the treasury kept in heaven and on earth are in His hands. He is the one who takes care of her. He is the ruler who has the right to share with whom He pleases. The Messenger of Allah (may peace be upon him) said: Usman, may Allah be pleased with him, reported that when he asked the Messenger of Allah to say, \"For Allah alone, the heavens and the earth will be holy.\" he replied, \"O Usman, you ask me something that no one has ever asked me before. Maqalid as- samawati wa al-ardh\" is the saying: There is no God but Allah, Allah is Great, Glory to Allah, all praise to Allah , I beg of God that there is no God but Him, the Beginning and the End, the Inner, the living, the dead, and yet He lives and dies, in His hand all good, and He is all-powerful. \" (History of Abu Ya'la, Ibn Abi atim, and Ibn Mardawaih) Whoever brings this speech will receive the benefits of heaven and earth.",
      "text_tafsir": "Pada ayat-ayat ini, Allah menegaskan bahwa Dialah Pencipta segala sesuatu yang ada, baik di langit maupun di bumi. Dialah Pencipta alam seluruhnya, tak ada sesuatu pun yang dapat menciptakan selain Dia. Ini adalah suatu hakikat kebenaran yang tidak seorang pun dapat mengingkarinya. Tidak ada seorang pun dapat menyatakan bahwa dirinya pencipta alam, karena tak akan diterima akal bahwa seseorang mempunyai kekuatan dan kekuasaan untuk menciptakan jagad raya ini, dan tidak dapat pula diterima akal bahwa alam ini terjadi dengan sendirinya tanpa ada penciptanya. Oleh sebab itu, pastilah alam ini diciptakan oleh Zat Yang Mahakuasa dan Maha Mengetahui segala sesuatu, itulah Dia Allah. \n\nAllah-lah yang mengurus segala yang ada, ilmu-Nya sangat luas, mencakup semua makhluk-Nya. Dialah yang mengendalikan alam sejak dari yang sekecil-kecilnya sampai kepada yang sebesar-besarnya. Dia mengendalikan semua itu sesuai dengan ilmu, hikmah dan kebijaksanaan-Nya. Tak ada suatu makhluk pun yang ikut campur tangan dalam penciptaan dan pengendalian itu. Inilah yang dapat diterima oleh akal yang sehat dan dapat diterima oleh hati nurani manusia. \n\nMeskipun demikian, masih banyak orang yang mengingkari hakikat ini dan mengatakan bahwa dialah yang berkuasa, dan dialah Tuhan, seperti yang dinyatakan oleh Fir'aun atau mengemukakan berbagai macam teori mengenai alam ini untuk menetapkan bahwa alam jagad raya ini terjadi dengan sendirinya tanpa ada yang menciptakannya. Orang yang seperti ini adalah orang-orang kafir yang selalu mengingkari bukti-bukti kekuasaan Allah baik di langit maupun di bumi dan tidak mau mempergunakan akal pikirannya yang sehat yang telah dianugerahkan Allah kepadanya. Mereka inilah yang dikatakan Allah sebagai orang-orang yang paling merugi baik di dunia apalagi di akhirat nanti.\n\nSebagian mufasir berpendapat bahwa yang dimaksud dengan \"Maqalid as-samawati wa al-ardh\" (kendali langit dan bumi di sini ialah perbendaharaannya). Jadi, kunci-kunci semua perbendaharaan yang tersimpan di langit dan di bumi berada di tangan-Nya. Dialah yang memelihara dan menjaganya. Dialah penguasanya yang berhak membagi-bagikan kepada siapa yang dikehendaki-Nya. Rasulullah bersabda:\n\nDiriwayatkan oleh Usman r.a. bahwa ketika ia menanyakan kepada Rasulullah tentang firman Allah \"Hanya bagi Allah, maqalid langit dan bumi.\" beliau menjawab, \"Hai Usman, engkau menanyakan kepadaku sesuatu yang belum pernah ditanyakan seseorang pun kepadaku sebelumnya. Maqalid as- samawati wa al-ardh\" ialah ucapan: Tidak ada Tuhan selain Allah, Allah Maha Besar, Maha Suci Allah, segala puji bagi Allah, aku memohon ampun kepada Allah yang tiada Tuhan selain Dia, Yang Awal Yang Akhir, Yang Lahir, Yang Batin, menghidupkan, mematikan, sedang Dia tetap hidup dan tidak mati, di tangan-Nyalah segala kebaikan, dan Dia Mahakuasa atas segala sesuatu.\" (Riwayat Abu Ya'la, Ibnu Abi hatim, dan Ibnu Mardawaih)\n\nBarang siapa yang membawa ucapan ini dia akan mendapat kebaikan yang ada di langit dan di bumi.",
      "text_translation": "Milik-Nyalah kunci-kunci (perbenda-haraan) langit dan bumi. Dan orang-orang yang kafir terhadap ayat-ayat Allah, mereka itulah orang yang rugi.",
      "text": "لَهٗ مَقَالِيْدُ السَّمٰوٰتِ وَالْاَرْضِۗ وَالَّذِيْنَ كَفَرُوْا بِاٰيٰتِ اللّٰهِ اُولٰۤىِٕكَ هُمُ الْخٰسِرُوْنَ ࣖ ",
      "text_translation_en": "His are the keys [to the mysteries] of the heavens and the earth: and they who are bent on denying the truth of God’s messages - it is they, they, who are the losers!",
      "juz_number": 24
    },
    "64": {
      "text_tafsir_en": "Ibn 'Abbas reported that the Quraysh had offered the Prophet Muhammad that they would give him a great deal of wealth, so that he became the richest man in Mecca and would marry him to any woman he pleased but he should stop criticizing the idols them. The offer was answered by the Messenger of Allah (may peace be upon him). So come down Surah al-Kafirun \/ 109 and verse 64 of this Surah az-Zumar. In this verse, God instructs the Prophet Muhammad to tell the Meccans of the Meccans who asked him to worship the idol, that this request was a very misleading request. The Prophet (peace be upon him) said, \"Could it be that I worship other than Allah, you ignorant people? Can my determination be offered for unreasonable reasons? \" According to Ibn 'Abbas the offer was not just there, they even asked Muhammad to worship idols. Thus they will worship the Lord besides worshiping the idol.",
      "text_tafsir": "Diriwayatkan oleh Ibnu 'Abbas bahwa orang-orang Quraisy telah menawarkan kepada Nabi Muhammad bahwa mereka akan menyerahkan kepadanya harta yang banyak, sehingga ia menjadi orang yang paling kaya di Mekah dan akan mengawinkannya dengan wanita mana saja yang disenanginya tetapi dia harus berhenti mencela berhala-berhala mereka. Tawaran itu dijawab oleh Rasulullah saw, \"Tunggulah sampai datang perintah dari Tuhanku\". Maka turunlah Surah al-Kafirun\/109 dan ayat 64 dari Surah az-Zumar ini.\n\nPada ayat ini, Allah memerintahkan kepada Nabi Muhammad supaya mengatakan kepada kaum musyrikin Mekah yang mengajaknya untuk menyembah berhala, bahwa ajakan itu adalah ajakan yang sangat menyesatkan. Nabi saw berkata, \"Mungkinkah aku menyembah selain Allah hai orang-orang yang jahil? Aku telah menyaksikan bukti-bukti keesaan-Nya dan Dia telah memberi petunjuk kepadaku. Aku telah yakin dengan sepenuh hati dan jiwaku bahwa Dialah Allah Yang Maha Esa dan Mahakuasa. Apakah kebulatan tekadku ini dapat ditawar dengan alasan-alasan yang tidak masuk akal?\"\n\nMenurut Ibnu 'Abbas tawaran itu bukan sampai di situ saja, bahkan mereka mengajak Muhammad menyembah berhala. Dengan demikian mereka mau menyembah Tuhan di samping menyembah berhala itu.",
      "text_translation": "Katakanlah (Muhammad), “Apakah kamu menyuruh aku menyembah selain Allah, wahai orang-orang yang bodoh?”",
      "text": "قُلْ اَفَغَيْرَ اللّٰهِ تَأْمُرُوْۤنِّيْٓ اَعْبُدُ اَيُّهَا الْجٰهِلُوْنَ",
      "text_translation_en": "Say: “Is it, then, something other than God that you bid me to worship, O you who are unaware [of right and wrong]?”",
      "juz_number": 24
    },
    "65": {
      "text_tafsir_en": "In this verse, Allah declares to the Prophet Muhammad that He had revealed to him and the prophets before, that if he had united with Allah, then all his good deeds would have been abolished. This is a severe warning from God to man that he should never associate God with others, for that act is shirk and that sin is shirk that God will not forgive. When a person dies in a state of shirk, the reward of all good deeds will be lost and he will be cast into Hell hell as stated in this verse: Whoever disbelieves among you from his religion and dies in disbelief, then they are in vain in the world. and in the hereafter, and they are the inhabitants of hell, they dwell therein. (al-Baqarah \/ 2: 217) To Prophet Muhammad himself, Allah warned him that he was the Messenger whom He had sent. His beloved apostle will not be able to associate with him. However, God also warned him not to ever cross his mind to embrace shirk. Especially to other people, of course, this warning should be taken seriously. It is not right for a person who knows how great the favor of God is to him, to all mankind, to disregard it and to disobey the order of the favors by associating with him, by seeking aid to idols, graves, trees, and so forth. Allah then affirmed His command by issuing another commandment that only God should worship, only to Him should all His deeds of worship, and to Allah also men pray and give thanks for He is the true giver, as it is read. every Muslim in prayer: Verily my prayer, my worship, my life and my death are for Allah, the Lord of the whole world. (al-An'am \/ 6: 162)",
      "text_tafsir": "Pada ayat ini, Allah menegaskan kepada Nabi Muhammad saw bahwa Dia telah mewahyukan kepadanya dan nabi-nabi sebelumnya, bahwa sesungguhnya apabila dia mempersekutukan Allah, maka terhapuslah segala amal baiknya yang telah lalu. Inilah suatu peringatan keras dari Allah kepada manusia agar jangan sekali-kali mempersekutukan Allah dengan yang lain, karena perbuatan itu adalah syirik dan dosa syirik itu adalah dosa yang tidak akan diampuni oleh Allah. Bila seseorang mati dalam keadaan syirik akan terhapuslah pahala semua amal baiknya dan dia akan dijerumuskan ke dalam neraka Jahanam sebagaimana tersebut dalam ayat ini:\n\nBarang siapa murtad di antara kamu dari agamanya, lalu dia mati dalam kekafiran, maka mereka itu sia-sia amalnya di dunia dan di akhirat, dan mereka itulah penghuni neraka, mereka kekal di dalamnya. (al-Baqarah\/2: 217)\n\nKepada Nabi Muhammad sendiri, Allah memberi peringatan sedangkan dia adalah rasul yang diutus-Nya. Rasul kesayangan-Nya yang tidak mungkin akan mempersekutukan-Nya. Kendati demikian, Allah memberi peringatan juga kepadanya agar jangan sekali-kali terlintas dalam pikirannya untuk menganut agama syirik. Apalagi kepada manusia lainnya tentu peringatan ini harus mendapat perhatian yang serius. Sungguh tidaklah pantas seseorang yang mengetahui betapa besar nikmat Allah terhadapnya, terhadap manusia seluruhnya, akan mengingkari nikmat itu dan melanggar perintah pemberi nikmat itu dengan mempersekutukan-Nya, dengan memohonkan pertolongan kepada berhala, kuburan, pohon, dan sebagainya. \n\nAllah lalu mempertegas perintah-Nya dengan mengeluarkan suatu perintah lagi yaitu hanya Allah sajalah yang harus disembah, hanya kepada-Nya manusia harus mempersembahkan semua amal ibadahnya, dan kepada Allah juga manusia memanjatkan doa dan mengucapkan syukur karena Dialah pemberi nikmat yang sebenarnya, sebagaimana yang dibaca setiap Muslim dalam salat:\n\nSesungguhnya salatku, ibadahku, hidupku dan matiku hanyalah untuk Allah, Tuhan seluruh alam. (al-An'am\/6: 162)",
      "text_translation": "Dan sungguh, telah diwahyukan kepadamu dan kepada (nabi-nabi) yang sebelummu, “Sungguh, jika engkau mempersekutukan (Allah), niscaya akan hapuslah amalmu dan tentulah engkau termasuk orang yang rugi.",
      "text": "وَلَقَدْ اُوْحِيَ اِلَيْكَ وَاِلَى الَّذِيْنَ مِنْ قَبْلِكَۚ  لَىِٕنْ اَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
      "text_translation_en": "And yet, it has already been revealed to thee [O man,] as well as to those who lived before thee, that if thou ever ascribe divine powers to aught but God, all thy works shall most certainly have been in vain: for [in the life to come] thou shalt most certainly be among the lost.",
      "juz_number": 24
    },
    "66": {
      "text_tafsir_en": "In this verse, Allah declares to the Prophet Muhammad that He had revealed to him and the prophets before, that if he had united with Allah, then all his good deeds would have been abolished. This is a severe warning from God to man that he should never associate God with others, for that act is shirk and that sin is shirk that God will not forgive. When a person dies in a state of shirk, the reward of all good deeds will be lost and he will be cast into Hell hell as stated in this verse: Whoever disbelieves among you from his religion and dies in disbelief, then they are in vain in the world. and in the hereafter, and they are the inhabitants of hell, they dwell therein. (al-Baqarah \/ 2: 217) To Prophet Muhammad himself, Allah warned him that he was the Messenger whom He had sent. His beloved apostle will not be able to associate with him. However, God also warned him not to ever cross his mind to embrace shirk. Especially to other people, of course, this warning should be taken seriously. It is not right for a person who knows how great the favor of God is to him, to all mankind, to disregard it and to disobey the order of the favors by associating with him, by seeking aid to idols, graves, trees, and so forth. Allah then affirmed His command by issuing another commandment that only God should worship, only to Him should all His deeds of worship, and to Allah also men pray and give thanks for He is the true giver, as it is read. every Muslim in prayer: Verily my prayer, my worship, my life and my death are for Allah, the Lord of the whole world. (al-An'am \/ 6: 162)",
      "text_tafsir": "Pada ayat ini, Allah menegaskan kepada Nabi Muhammad saw bahwa Dia telah mewahyukan kepadanya dan nabi-nabi sebelumnya, bahwa sesungguhnya apabila dia mempersekutukan Allah, maka terhapuslah segala amal baiknya yang telah lalu. Inilah suatu peringatan keras dari Allah kepada manusia agar jangan sekali-kali mempersekutukan Allah dengan yang lain, karena perbuatan itu adalah syirik dan dosa syirik itu adalah dosa yang tidak akan diampuni oleh Allah. Bila seseorang mati dalam keadaan syirik akan terhapuslah pahala semua amal baiknya dan dia akan dijerumuskan ke dalam neraka Jahanam sebagaimana tersebut dalam ayat ini:\n\nBarang siapa murtad di antara kamu dari agamanya, lalu dia mati dalam kekafiran, maka mereka itu sia-sia amalnya di dunia dan di akhirat, dan mereka itulah penghuni neraka, mereka kekal di dalamnya. (al-Baqarah\/2: 217)\n\nKepada Nabi Muhammad sendiri, Allah memberi peringatan sedangkan dia adalah rasul yang diutus-Nya. Rasul kesayangan-Nya yang tidak mungkin akan mempersekutukan-Nya. Kendati demikian, Allah memberi peringatan juga kepadanya agar jangan sekali-kali terlintas dalam pikirannya untuk menganut agama syirik. Apalagi kepada manusia lainnya tentu peringatan ini harus mendapat perhatian yang serius. Sungguh tidaklah pantas seseorang yang mengetahui betapa besar nikmat Allah terhadapnya, terhadap manusia seluruhnya, akan mengingkari nikmat itu dan melanggar perintah pemberi nikmat itu dengan mempersekutukan-Nya, dengan memohonkan pertolongan kepada berhala, kuburan, pohon, dan sebagainya. \n\nAllah lalu mempertegas perintah-Nya dengan mengeluarkan suatu perintah lagi yaitu hanya Allah sajalah yang harus disembah, hanya kepada-Nya manusia harus mempersembahkan semua amal ibadahnya, dan kepada Allah juga manusia memanjatkan doa dan mengucapkan syukur karena Dialah pemberi nikmat yang sebenarnya, sebagaimana yang dibaca setiap Muslim dalam salat:\n\nSesungguhnya salatku, ibadahku, hidupku dan matiku hanyalah untuk Allah, Tuhan seluruh alam. (al-An'am\/6: 162)",
      "text_translation": "Karena itu, hendaklah Allah saja yang engkau sembah dan hendaklah engkau termasuk orang yang bersyukur.”",
      "text": "بَلِ اللّٰهَ فَاعْبُدْ وَكُنْ مِّنَ الشّٰكِرِيْنَ",
      "text_translation_en": "Nay, but thou shalt worship God [alone], and be among those who are grateful [to Him]!",
      "juz_number": 24
    },
    "67": {
      "text_tafsir_en": "In this verse, God condemns the deeds of the Meccans for worshiping idols and statues, denying His greatness and power. God also remembers how much He has bestowed upon them. The only ones who have the power and grace are the helpless statues they made with their own hands. How low their minds may be by admiring something despicable and helpless. God further emphasized that the whole earth was in His hand on the Day of Resurrection, and the heavens rolled in His right hand. If the heavens and the earth are all in His hands, then who is greater, greater, more powerful than God? Are they glorifying the statues while the statues are just a fraction of the sky and the earth? About this verse, Imam al-Bukhari narrated from Ibn Mas'ud a hadith: One of the priests came to the Messenger of Allah (may peace be upon him) and said to him, \"O Muhammad, I have found (in our book) that Almighty Allah has placed the heavens in one his finger, the earth on the other finger, the trees on the other finger, the water and the ground on the other finger, and the other creatures on the other finger, and He said, \"I am the king.\" The Messenger of Allah (may peace be upon him) laughed to hear the words of the clergyman, and it seemed that he was in agreement. Then the Prophet saw this verse 67. Regarding the depiction of the heavens and the earth in His hands, it may be understood in the sense that nature is in His power. As to the true nature of the condition of the earth in the grasp of God, we do not know. These include the supernatural problems, which must be accepted as God has explained. What must be fully believed is that God is incomparable to anything. The Word of God: There is nothing like Him. And He is the All-Hearing, the All-Seeing. (asy-Syura \/ 42: 11) Then Allah closed this verse by saying that associating God with other beings, especially with such trivial things as statues, was a misleading and perverted act. Glory to God from all these understandings and inadequate for His power and greatness to associate with others.",
      "text_tafsir": "Pada ayat ini, Allah mencela perbuatan kaum musyrikin Mekah karena menyembah berhala dan patung, mengingkari kebesaran dan kekuasaan-Nya. Allah juga mengingatkan betapa besar nikmat yang telah dikaruniakan-Nya kepada mereka. Seakan-akan yang berkuasa dan memberi karunia itu adalah patung-patung yang tidak berdaya yang mereka buat dengan tangan mereka sendiri. Alangkah rendahnya jalan pikiran mereka dengan mengagungkan suatu yang hina dan tak berdaya. Allah selanjutnya menegaskan bahwa bumi ini seluruhnya berada dalam genggaman-Nya pada hari Kiamat, demikian pula langit tergulung di tangan kanan-Nya. Jika langit dan bumi semuanya berada dalam genggaman-Nya, maka siapakah lagi yang lebih besar, lebih agung, lebih berkuasa dari Allah? Apakah mereka mengagungkan patung-patung itu sedang patung-patung itu adalah sebagian kecil saja dari langit dan bumi? Mengenai ayat ini, Imam al-Bukhari meriwayatkan dari Ibnu Mas'ud sebuah hadis: \n\nTelah datang salah seorang pendeta kepada Rasulullah saw dan berkata kepadanya, \"Hai Muhammad, sesungguhnya aku menemui (dalam kitab kami) bahwa Allah Yang Mahaperkasa meletakkan langit di salah satu jarinya, bumi di jari yang lain, pohon-pohon di jari yang lain, air dan tanah di jari yang lain, dan makhluk-makhluk lainnya di jari yang lain pula, lalu Dia berkata, 'Akulah raja.\" Rasulullah saw tertawa mendengar kata-kata pendeta itu sehingga kelihatan gerahamnya tanda setuju. Kemudian Nabi saw membaca ayat 67 ini.\n\nTentang penggambaran langit dan bumi dalam genggaman-Nya, mungkin dapat dipahami dengan makna bahwa alam ini dalam kekuasaan-Nya. Bagaimana hakikat yang sebenarnya dari keadaan bumi yang berada dalam genggaman Allah, kita tidak tahu. Hal itu termasuk masalah-masalah yang gaib, yang harus diterima sebagaimana yang diterangkan Allah. Yang mesti diyakini sepenuhnya adalah Allah tidak dapat diserupakan dengan suatu apa pun. Firman Allah:\n\nTidak ada sesuatu pun yang serupa dengan Dia. Dan Dia Yang Maha Mendengar, Maha Melihat. (asy-Syura\/42: 11)\n\nKemudian Allah menutup ayat ini dengan menyatakan bahwa mempersekutukan Allah dengan makhluk lainnya apalagi dengan sesuatu yang remeh tak berdaya seperti patung-patung itu adalah perbuatan sesat dan menyesatkan. Maha Suci Allah dari segala paham itu dan tidak layak bagi kekuasaan dan keagungan-Nya untuk dipersekutukan dengan yang lain.",
      "text_translation": "Dan mereka tidak mengagungkan Allah sebagaimana mestinya padahal bumi seluruhnya dalam genggaman-Nya pada hari Kiamat dan langit digulung dengan tangan kanan-Nya. Mahasuci Dia dan Mahatinggi Dia dari apa yang mereka persekutukan.",
      "text": "وَمَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖۖ وَالْاَرْضُ جَمِيْعًا قَبْضَتُهٗ يَوْمَ الْقِيٰمَةِ وَالسَّمٰوٰتُ مَطْوِيّٰتٌۢ بِيَمِيْنِهٖ ۗسُبْحٰنَهٗ وَتَعٰلٰى عَمَّا يُشْرِكُوْنَ",
      "text_translation_en": "And no true understanding of God have they [who worship aught beside Him], inasmuch as the whole of the earth will be as a [mere] handful to Him on Resurrection Day, and the heavens will be rolled up in His right hand: limitless is He in His glory, and sublimely exalted above anything to which they may ascribe a share in His divinity!",
      "juz_number": 24
    },
    "68": {
      "text_tafsir_en": "In this verse, God explains that on the Day of Resurrection there will be two blows of a trumpet. In the first breath shall all the living be in the heavens and in the earth. Because of the harsh sound of the blast, all the living beings became helpless and eventually died like people being hit by lightning or a high-powered electric strum. There were beings who did not die at that time because God did not want their death, but who were they not mentioned in the Qur'an, nor in the authentic hadiths. Therefore, let us give this knowledge to Allah. Perhaps He does not mention His immortal being for some reason or wisdom that we do not know. However, according to an account from Abu Ya'la al-Maushuli, the immortal beings are the Angel Gabriel, Mikail, and Izrail. After that, the creatures died one by one. After the first blow, in which almost all living beings died, the second trumpet blew. With this second blow, all the dead creatures either dead before the first blow or dead at the time of the blow, came back to life. Each stood waiting for what would happen to him. There are several hadiths about this blowing trumpet: 1. The narration narrated by Abu Dawud. from Abu Sa'id al-Khudri: The Prophet once mentioned the blowing of the trumpet and said, \"On his right is Gabriel and on his left is Mikail.\" 2. The hadith narrated by Ibn Majah al-Bazzar and Ibn Mardawaih of Abu Sa'id al-Khudri is: Indeed in the second hand the trumpet has two horns that it will blow. They both keep an eye on their surroundings, and whenever they are ruled. In addition, in the Qur'an the blowing of the trumpet is called az-Zajrah, as stated in the verse: So the resurrection is but a single cry; then they immediately saw it. (ash-shaffat \/ 37: 19) And in the verse: Then the return is but one blow. And then they are living again on the (new) earth. (an-Nazi'at \/ 79: 13-14) In other verses it is also called \"da'wah\" (call), as in verse: And among His signs is the creation of heaven and earth with His will. Then whenever He calls you once from the earth, you will come out immediately (from the grave). (ar-Romans \/ 30: 25)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa nanti pada hari Kiamat akan terjadi dua kali tiupan sangkakala. Pada tiupan pertama akan mati semua yang hidup baik yang di langit maupun yang di bumi. Karena kedahsyatan suara tiupan itu, semua yang bernyawa menjadi lumpuh tak berdaya dan akhirnya mati seperti orang terkena sambaran petir atau strum listrik bertegangan tinggi. Ada makhluk Allah yang tidak mati pada saat itu karena Allah tidak menghendaki kematiannya, tetapi siapakah mereka itu tidak disebutkan dalam Al-Qur'an, begitu pula dalam hadis-hadis sahih. Oleh karena itu, kita serahkan saja pengetahuan tentang ini kepada Allah. Mungkin Dia tidak menyebutkan makhluk-Nya yang tidak mati itu karena suatu sebab atau hikmah yang tidak kita ketahui hakikatnya. Akan tetapi, menurut sebuah riwayat dari Abu Ya'la al-Maushuli, makhluk-makhluk yang tidak mati itu ialah Malaikat Jibril, Mikail, dan Izrail. Setelah itu, makhluk-makhluk itu pun meninggal satu per satu.\n\nSesudah tiupan pertama itu, di mana hampir semua makhluk yang hidup telah mati, maka menyusullah tiupan sangkakala yang kedua. Dengan tiupan yang kedua ini, semua makhluk yang telah mati baik yang mati sebelum terjadinya tiupan pertama maupun yang mati di waktu terjadinya tiupan itu, menjadi hidup kembali. Masing-masing berdiri menunggu apa yang akan terjadi terhadap dirinya. Ada beberapa hadis mengenai tiupan sangkakala ini di antaranya:\n\n1. Hadis yang diriwayatkan oleh Abu Dawud. dari Abu Sa'id al-Khudri yaitu: Rasulullah pernah menyebut tentang yang meniup sangkakala dan berkata, \"Di sebelah kanannya ada Jibril dan sebelah kirinya ada Mikail.\"\n\n2. Hadis yang diriwayatkan oleh Ibnu Majah al-Bazzar dan Ibnu Mardawaih dari Abu Sa'id al-Khudri yaitu: Sesungguhnya di tangan kedua peniup sangkakala itu ada dua buah tanduk yang akan ditiupnya. Mereka berdua selalu mengawasi keadaan sekelilingnya, dan kapan pun keduanya diperintah.\n\nDi samping itu, dalam Al-Qur'an tiupan sangkakala itu disebut dengan az-Zajrah, seperti tersebut dalam ayat:\n\nMaka sesungguhnya kebangkitan itu hanya dengan satu teriakan saja; maka seketika itu mereka melihatnya. (ash-shaffat\/37: 19)\n\nDan dalam ayat:\n\nMaka pengembalian itu hanyalah dengan sekali tiupan saja. Maka seketika itu mereka hidup kembali di bumi (yang baru). (an-Nazi'at\/79: 13-14)\n\nPada ayat-ayat yang lain disebutkan juga dengan \"dakwah\" (panggilan), seperti pada ayat:\n\nDan di antara tanda-tanda (kebesaran)-Nya ialah berdirinya langit dan bumi dengan kehendak-Nya. Kemudian apa-bila Dia memanggil kamu sekali panggil dari bumi, seketika itu kamu keluar (dari kubur). (ar-Rum\/30: 25)",
      "text_translation": "Dan sangkakala pun ditiup, maka matilah semua (makhluk) yang di langit dan di bumi kecuali mereka yang dikehendaki Allah. Kemudian ditiup sekali lagi (sangkakala itu) maka seketika itu mereka bangun (dari kuburnya) menunggu (keputusan Allah).",
      "text": "وَنُفِخَ فِى الصُّوْرِ فَصَعِقَ مَنْ فِى السَّمٰوٰتِ وَمَنْ فِى الْاَرْضِ اِلَّا مَنْ شَاۤءَ اللّٰهُ ۗ ثُمَّ نُفِخَ فِيْهِ اُخْرٰى فَاِذَا هُمْ قِيَامٌ يَّنْظُرُوْنَ",
      "text_translation_en": "And [on that Day,] the trumpet [of judgment] will be sounded, and all [creatures] that are in the heavens and all that are on earth will fall down senseless, unless they be such as God wills [to exempt]. And then it will sound again - and lo! standing [before the Seat of Judgment], they will begin to see [the truth]!",
      "juz_number": 24
    },
    "69": {
      "text_tafsir_en": "After all that happened, the earth shone with the light of the Almighty in the light of God because it upheld God's justice, and weighed in on all good and bad deeds, placed before each of their records of charity, as stated in the verse: And every man We confounded ( note) the deeds of his deeds on his neck. And on the Day of Judgment We have brought forth a book in openness. (al-Isra '\/ 17: 13) And in the verse: And the book (of charity) is laid up, and thou shalt see the sinner in fear of what is written therein, and they will say, \"Woe unto us! what is this, nothing is left, small and great but all written down, \"and they find (all) what they have done (in writing). And your Lord does not harm anyone. (al-Kahf \/ 18: 49) The prophets were also brought to bear witness to the works of their people. This is also explained in another verse: And how (in the case of the disbelievers), if We bring a witness (Messenger) of every people, and We bring thee (Muhammad) as a witness over them. (an-Nisa '\/ 4: 41) In addition to the prophets as witnesses there are also other witnesses, angels who record all their deeds. It is stated in the verse: Everyone will come with (the angel) guide and (angel) witness. (Qaf \/ 50: 21) In addition to the book of charities and trusted witnesses, there are also witnesses made up of their own limbs such as feet and hands. All the members of the body will tell you later what they did, as stated in the verse: On the day, (when) their tongues, their hands and their feet are a witness to them of what they have done. (an-Nur \/ 24:24) Can you imagine how great the trial of God was at that time? A court that can decide every single thing and convince people of their just decisions so that no one is harmed or mistreated. A supreme hearing is complete with a credible witness who cannot be denied the truth as each witness corroborates the testimony of the other witness. It is then that everyone is decided and justified based on the truth and it is not always possible that justice is contrary to justice and can harm or harm a person. This is in the verse: And We will set the proper scales on the Day of Judgment, so that no one will be harmed; even if it is only a mustard seed, We will surely bring it. And We have done enough calculations. (al-Anbiya '\/ 21: 47)",
      "text_tafsir": "Setelah kejadian itu semua, bersinar cemerlanglah bumi Padang Mahsyar bermandikan cahaya Tuhan karena ditegakkannya keadilan Tuhan, dan ditimbanglah semua amal yang baik dan yang buruk, diletakkan di hadapan masing-masing catatan amal mereka, seperti tersebut dalam ayat:\n\nDan setiap manusia telah Kami kalungkan (catatan) amal perbuatannya di lehernya. Dan pada hari Kiamat Kami keluarkan baginya sebuah kitab dalam keadaan terbuka. (al-Isra'\/17: 13)\n\nDan dalam ayat:\n\nDan diletakkanlah kitab (catatan amal), lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata, \"Betapa celaka kami, kitab apakah ini, tidak ada yang tertinggal, yang kecil dan yang besar melainkan tercatat semuanya,\" dan mereka dapati (semua) apa yang telah mereka kerjakan (tertulis). Dan Tuhanmu tidak menzalimi seorang jua pun. (al-Kahf\/18: 49)\n\nJuga dihadirkan para nabi untuk menjadi saksi atas perbuatan umatnya. Hal ini diterangkan pula pada ayat yang lain:\n\nDan bagaimanakah (keadaan orang kafir nanti), jika Kami mendatangkan seorang saksi (Rasul) dari setiap umat dan Kami mendatangkan engkau (Muhammad) sebagai saksi atas mereka. (an-Nisa'\/4: 41)\n\nSelain nabi-nabi sebagai saksi dihadirkan pula saksi lain yaitu malaikat yang mencatat semua amal perbuatan mereka. Hal ini tersebut dalam ayat:\n\nSetiap orang akan datang bersama (malaikat) penggiring dan (malaikat) saksi. (Qaf\/50: 21)\n\nSelain dari kitab catatan amal dan saksi-saksi yang dipercaya itu, ada pula saksi yang terdiri dari anggota tubuh sendiri seperti kaki dan tangan. Semua anggota tubuh itu akan menceritakan nanti apa yang telah dilakukannya, seperti tersebut pada ayat:\n\nPada hari, (ketika) lidah, tangan dan kaki mereka menjadi saksi atas mereka terhadap apa yang dahulu mereka kerjakan. (an-Nur\/24: 24)\n\nDapatlah dibayangkan bagaimana hebatnya sidang pengadilan Tuhan di waktu itu. Sidang yang dapat memutuskan setiap perkara dan memvonis orang dengan keputusan yang seadil-adilnya sehingga tak seorang pun yang dirugikan atau teraniaya karenanya. Sidang tertinggi yang cukup lengkap dengan saksi terpercaya yang tidak dapat dibantah kebenarannya karena setiap saksi saling menguatkan keterangan saksi lainnya. Di saat itulah diputuskan dan ditetapkan nasib setiap orang berdasarkan kebenaran dan sekali-kali tidak mungkin putusan itu bertentangan dengan keadilan dan dapat merugikan atau menjadikan seseorang teraniaya. Hal ini terdapat dalam ayat:\n\nDan Kami akan memasang timbangan yang tepat pada hari Kiamat, maka tidak seorang pun dirugikan walau sedikit; sekalipun hanya seberat biji sawi, pasti Kami mendatangkannya (pahala). Dan cukuplah Kami yang membuat perhitungan. (al-Anbiya'\/21: 47)",
      "text_translation": "Dan bumi (padang Mahsyar) menjadi terang benderang dengan cahaya (keadilan) Tuhannya; dan buku-buku (perhitungan perbuatan mereka) diberikan (kepada masing-masing), nabi-nabi dan saksi-saksi pun dihadirkan, lalu diberikan keputusan di antara mereka secara adil, sedang mereka tidak dirugikan.",
      "text": "وَاَشْرَقَتِ الْاَرْضُ بِنُوْرِ رَبِّهَا وَوُضِعَ الْكِتٰبُ وَجِايْۤءَ بِالنَّبِيّٖنَ وَالشُّهَدَاۤءِ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَهُمْ لَا يُظْلَمُوْنَ",
      "text_translation_en": "And the earth will shine bright with her Sus­tainer’s light. And the record [of everyone’s deeds] will be laid bare, and all the prophets will be brought forward, and all [other] witnesses; and judgment will be passed on them all in justice. And they will not be wronged,",
      "juz_number": 24
    },
    "70": {
      "text_tafsir_en": "After passing through the scales weighed justly, they were rewarded with their respective charities, which were repaid in good measure, and evil in proportion. No one protested the verdict and reply. Rejoice those who believe and do many good deeds and wrongs, and reject those infidels whose lives in the world have always been arrogant and arrogant and committed many sins and sins. There is no need for a very careful and careful procedure and the witnesses are undeniable, for all the deeds of the servant of God were in the knowledge of the Most High God and He was in full force at that day. He can treat his servant with his will without proof of any wrongdoing, but the Almighty wants all his decisions to be seen by his servant at that time based on irrefutable evidence.",
      "text_tafsir": "Sesudah melalui timbangan yang menimbang dengan seadil-adilnya, barulah diberikan balasan terhadap amal masing-masing dengan sempurna, yang baik dibalas dengan berlipat-ganda dan yang jahat dengan yang setimpal. Tak ada seorang pun yang memprotes putusan dan balasan itu. Bergembiralah orang yang beriman dan banyak mengerjakan amal saleh dan celaka serta menyesallah orang-orang kafir yang selama hidupnya di dunia selalu bersikap sombong dan takabur dan banyak melakukan perbuatan dosa dan durhaka. \n\nSebenarnya tidaklah perlu ada prosedur yang amat teliti dan cermat serta saksi-saksi yang tak dapat ditolak, karena semua amal perbuatan hamba Allah telah ada dalam ilmu Allah Yang Mahaluas dan Dialah yang berkuasa mutlak pada hari itu. Dia dapat memperlakukan hamba-Nya dengan kehendak-Nya tanpa ada pembuktian atas kesalahan seseorang, tetapi Allah Yang Mahabijaksana menghendaki supaya semua putusan yang ditetapkan-Nya dapat dilihat oleh hamba-Nya pada waktu itu semuanya berdasarkan bukti-bukti yang tak dapat dibantah lagi.",
      "text_translation": "Dan kepada setiap jiwa diberi balasan dengan sempurna sesuai dengan apa yang telah dikerjakannya dan Dia lebih mengetahui apa yang mereka kerjakan.",
      "text": "وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُوَ اَعْلَمُ بِمَا يَفْعَلُوْنَ ࣖ ",
      "text_translation_en": "for every human being will be repaid in full for whatever [good or evil] he has done: and He is fully aware of all that they do.",
      "juz_number": 24
    },
    "71": {
      "text_tafsir_en": "In this verse, God explains that the disbelievers who associate God with others such as idols and other idolatry are led to hell in a rude way. They were led in groups by the first group of the most perverted and the unruly then followed by the lower group in their rebellion and so on. Each of the entourage reached hell opened the door of hell and pushed them so hard that they fell into it. This is clearly illustrated in the following verse: Woe to that day for those who deny it. Those who play in sin (sin), on that day they are driven to hell with all their might. (It is said to them), \"This is the hell you used to deny.\" (ath-thur \/ 52: 11-14) The gates of hell were shut after they had entered it in the verse: Indeed, the fire was closed over (themselves), and they were fastened to long pillars. (al-Humazah \/ 104: 8-9) They were rebuked, ridiculed, and humiliated by the angels of the Hell-locks by saying that the Messenger of God had come to them from among themselves calling for obedience and obedience to Allah, His with the others. The Apostle also recited to them the proofs of God which proved the truth of his preaching with such strong and clear arguments that it could not be contradicted again? Why do they reject his call with pride and arrogance? They couldn't answer that question because they faced the fact that they were going to hell. They openly admit that they are guilty of denouncing the Messenger of Allah for being driven by lust, fear of losing influence, position, and so on. Such a confession is found in the following verse: Whenever a group of (disbelievers) were thrown into it, the guards (hell) asked them, \"Has no one ever come to warn you (in the world)?\" They said, \"Yes, indeed, a warner has come to us, but we have denied him and we say,\" Allah has not sent down anything, but you are in great error. \"(Al-Mulk \/ 67: 8 -9)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa orang-orang kafir yang mempersekutukan Allah dengan yang lain seperti berhala dan sembahan-sembahan lainnya digiring ke neraka dengan cara kasar. Mereka digiring secara berkelompok dengan mendahulukan kelompok yang paling sesat dan durhaka kemudian diikuti oleh kelompok yang lebih rendah tingkat kedurhakaannya dan demikianlah seterusnya. Setiap satu rombongan sampai ke neraka dibukakan pintu neraka itu dan mereka didorong dengan kuat sehingga terjerumus ke dalamnya. Hal ini jelas tergambar pada ayat berikut ini:\n\nMaka celakalah pada hari itu bagi orang-orang yang mendustakan. Orang-orang yang bermain-main dalam kebatilan (perbuatan dosa), pada hari (ketika) itu mereka didorong ke neraka Jahanam dengan sekuat-kuatnya. (Dikatakan kepada mereka), \"Inilah neraka yang dahulu kamu mendustakannya.\" (ath-thur\/52: 11-14)\n\nTertutuplah pintu neraka sesudah semua masuk ke dalamnya tersebut pada ayat:\n\nSungguh, api itu ditutup rapat atas (diri) mereka, (sedang mereka itu) diikat pada tiang-tiang yang panjang. (al-Humazah\/104: 8-9)\n\nMereka dihardik, dicela, dan dihina oleh malaikat-malaikat pemegang kunci neraka dengan mengatakan bukankah telah datang kepada mereka rasul Allah dari kalangan sendiri yang menyeru supaya patuh dan taat kepada Allah, serta tidak mempersekutukan-Nya dengan yang lain. Rasul itu juga membacakan kepada mereka ayat-ayat Allah yang membuktikan kebenaran dakwahnya dengan dalil dan keterangan yang kuat dan jelas sehingga tidak dapat dibantah lagi? Mengapa mereka menolak seruannya dengan angkuh dan takabur? Mereka tidak dapat menjawab pertanyaan itu karena telah menghadapi kenyataan bahwa mereka akan masuk neraka. Mereka mengaku terus terang bahwa merekalah yang bersalah karena mendustakan rasul Allah karena didorong oleh hawa nafsu, takut kehilangan pengaruh, kedudukan, dan sebagainya. Pengakuan seperti itu terdapat pada ayat berikut:\n\nSetiap kali ada sekumpulan (orang-orang kafir) dilemparkan ke dalamnya, penjaga-penjaga (neraka itu) bertanya kepada mereka, \"Apakah belum pernah ada orang yang datang memberi peringatan kepadamu (di dunia)?\" Mereka menjawab, \"Benar, sungguh, seorang pemberi peringatan telah datang kepada kami, tetapi kami mendustakan(nya) dan kami katakan, \"Allah tidak menurunkan sesuatu apa pun, kamu sebenarnya dalam kesesatan yang besar.\" (al-Mulk\/67: 8-9)",
      "text_translation": "Orang-orang yang kafir digiring ke neraka Jahanam secara berombongan. Sehingga apabila mereka sampai kepadanya (neraka) pintu-pintunya dibukakan dan penjaga-penjaga berkata kepada mereka, “Apakah belum pernah datang kepadamu rasul-rasul dari kalangan kamu yang membacakan ayat-ayat Tuhanmu dan memperingatkan kepadamu akan pertemuan (dengan) harimu ini?” Mereka menjawab, “Benar, ada,” tetapi ketetapan azab pasti berlaku terhadap orang-orang kafir.",
      "text": "وَسِيْقَ الَّذِيْنَ كَفَرُوْٓا اِلٰى جَهَنَّمَ زُمَرًا ۗحَتّٰىٓ اِذَا جَاۤءُوْهَا فُتِحَتْ اَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَآ اَلَمْ يَأْتِكُمْ رُسُلٌ مِّنْكُمْ يَتْلُوْنَ عَلَيْكُمْ اٰيٰتِ رَبِّكُمْ وَيُنْذِرُوْنَكُمْ لِقَاۤءَ يَوْمِكُمْ هٰذَا ۗقَالُوْا بَلٰى وَلٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكٰفِرِيْنَ",
      "text_translation_en": "And those who were bent on denying the truth will be urged on in throngs towards hell till, when they reach it, its gates will be opened, and its keepers will ask them, “Have there not come to you apostles from among yourselves, who conveyed to you your Sustainer’s messages and warned you of the coming of this your Day [of Judgment]?” They will answer: “Yea, indeed!” But the sentence of suffering will [already] have fallen due upon the deniers of the truth;",
      "juz_number": 24
    },
    "72": {
      "text_tafsir_en": "By acknowledging their error, the angel told them to enter Hell. They will remain in it forever, and no one can go out for a moment, for it is a place of abode for the haughty, haughty. Hell is the worst place full of torture and suffering.",
      "text_tafsir": "Dengan pengakuan atas kesalahan mereka itu, malaikat menyuruh mereka untuk masuk ke dalam neraka Jahanam. Mereka akan kekal di dalamnya selama-lamanya, tak ada yang dapat keluar walaupun sejenak, karena neraka itu tempat yang layak untuk kediaman orang-orang yang takabur lagi sombong. Neraka adalah tempat yang paling buruk penuh dengan siksaan dan penderitaan.",
      "text_translation": "Dikatakan (kepada mereka), “Masukilah pintu-pintu neraka Jahanam itu, (kamu) kekal di dalamnya.” Maka (neraka Jahanam) itulah seburuk-buruk tempat tinggal bagi orang-orang yang menyombongkan diri.",
      "text": "قِيْلَ ادْخُلُوْٓا اَبْوَابَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَا ۚفَبِئْسَ مَثْوَى الْمُتَكَبِّرِيْنَ",
      "text_translation_en": "[and] they will be told, “Enter the gates of hell, therein to abide!” And how vile an abode for those who were given to false pride!",
      "juz_number": 24
    },
    "73": {
      "text_tafsir_en": "In this verse it is explained that the believers who reverently revered were led to the paradise of Jannatun Na'im. They found the door wide open and there they waited with respect and wisdom while bidding them 'Assalamu' alaikum. \"It was a welcome greeting and they prayed to Allah to be happy with the grace and favor prepared for them in this heaven. Then they were warmly welcomed into heaven and said to them, \"You shall abide in it forever.\" The believers came together. The first group was the closest ones. to Allah and to the highest degree on his side according to their faith, piety, and righteous deeds in the world, and the second entourage are those who are lower than the first. heaven is open to them as it is stated in another verse: This is honor (to them) gguh, for those who fear (provided) the best return, (that is) 'Adn heaven whose doors are opened to them. (shad \/ 38: 49-50) In that paradise they find all kinds of pleasures and pleasures no one in the world has ever imagined. Such grace and bounty can be attained through the many charities and worships that man has performed throughout his life on earth. According to the hadith narrated by al-Bukhari and Muslim from Umar bin Khaththab, the Messenger of Allah once said, \"Who among you has blossomed? The gates of heaven were opened to him as many as eight and he was allowed to enter from any door he liked. (Muslim History and Other Traditions) Abu Hurairah, may Allah be pleased with him, reported: The first entourage came into heaven like a full moon. Fourth night) The next troupe shone like the brightest star on the horizon. (Al-Bukhari and Muslim) Al-Bukhari and Muslim also recounted from Sahal bin Sa'ad that the Messenger of Allah said: In heaven there are eight doors, one of which is called ar-Rayyan. The door is only for those who fast. \"",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa orang-orang mukmin yang bertakwa dengan penuh penghormatan dituntun menuju surga Jannatun Na'im. Mereka mendapati pintunya telah terbuka lebar dan di sana telah menunggu para penjaga pintu itu dengan penuh hormat dan hikmat sambil mengucapkan kepada mereka 'Assalamu 'alaikum\". Itu adalah ucapan selamat datang bagi mereka dan memohonkan doa kepada Allah semoga tetap berbahagia dengan karunia dan nikmat yang disediakan untuk mereka di dalam surga ini. Kemudian mereka dipersilakan dengan hormat agar segera masuk ke dalam surga dan dikatakan kepada mereka, \"Kamu kekal di dalamnya buat selama-lamanya.\" \n\nPara Mukminin itu datang berombongan. Rombongan pertama ialah orang-orang yang paling dekat kepada Allah dan paling tinggi derajatnya di sisi-Nya sesuai dengan iman, takwa, dan amal saleh mereka di dunia. Rombongan yang kedua adalah orang-orang yang lebih rendah derajatnya dari rombongan yang pertama. Demikianlah seterusnya sampai semua kaum Muslimin masuk ke dalamnya. Pintu surga terbuka bagi mereka sebagaimana disebutkan pula pada ayat lain:\n\nIni adalah kehormatan (bagi mereka). Dan sungguh, bagi orang-orang yang bertakwa (disediakan) tempat kembali yang terbaik, (yaitu) surga 'Adn yang pintu-pintunya terbuka bagi mereka. (shad\/38: 49-50)\n\nDalam surga itu mereka memperoleh berbagai macam kenikmatan dan kesenangan yang belum pernah terpikirkan oleh siapa pun di dunia ini. Nikmat dan karunia yang demikian itu dapat dicapai dengan berbagai macam amal dan ibadah yang dikerjakan oleh manusia selama hidupnya di dunia.\n\nDiterangkan oleh hadis yang diriwayatkan al-Bukhari dan Muslim dari Umar bin Khaththab bahwa Rasulullah pernah bersabda\n\nSiapa di antara kamu yang berwudu dengan sempurna kemudian dia mengucapkan, \"Aku bersaksi tidak ada Tuhan selain Allah, dan sesungguhnya Muhammad adalah hamba dan utusan Allah, niscaya akan dibukakan baginya pintu-pintu surga yang banyaknya delapan buah dan dia dibolehkan masuk dari pintu mana saja yang ia sukai. (Riwayat Muslim dan selainnya)\n\nDiriwayatkan pula dari Abu Hurairah bahwa Rasulullah saw pernah bersabda:\n\nRombongan pertama yang masuk surga mukanya laksana bulan purnama (di malam keempat belas). Rombongan berikutnya mukanya cemerlang seperti bintang yang paling cemerlang di cakrawala (bintang kejora). (Riwayat al-Bukhari dan Muslim)\n\nAl-Bukhari dan Muslim juga meriwayatkan dari Sahal bin Sa'ad bahwa Rasulullah bersabda: \n\nDi dalam surga itu ada delapan buah pintu, salah satu pintu itu bernama ar-Rayyan. Pintu itu hanya dimasuki oleh orang-orang yang berpuasa.\"",
      "text_translation": "Dan orang-orang yang bertakwa kepada Tuhannya diantar ke dalam surga secara berombongan. Sehingga apabila mereka sampai kepadanya (surga) dan pintu-pintunya telah dibukakan, penjaga-penjaganya berkata kepada mereka, “Kesejahteraan (dilimpahkan) atasmu, berbahagialah kamu! Maka masuklah, kamu kekal di dalamnya.”",
      "text": "وَسِيْقَ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ اِلَى الْجَنَّةِ زُمَرًا ۗحَتّٰىٓ اِذَا جَاۤءُوْهَا وَفُتِحَتْ اَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلٰمٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوْهَا خٰلِدِيْنَ",
      "text_translation_en": "But those who were conscious of their Sus­tainer will be urged on in throngs towards paradise till, when they reach it, they shall find its gates wide- open; and its keepers will say unto them, “Peace be upon you! Well have you done: enter, then, this [paradise], herein to abide!”",
      "juz_number": 24
    },
    "74": {
      "text_tafsir_en": "The happy and joyful believers in the joys and pleasures they will enjoy in heaven say, \"Praise be to the God who has fulfilled His promise to us, as it has been given by His apostles and the prayers we always pray for.\" The Word of God: Allah promises to men and women believers, (Paradise) will flow beneath the rivers, they will abide in it, and (a) good place in heaven 'Adn. And God's will is greater. That's a great victory. (at-Taubah \/ 9: 72) And the word of God: Our Lord, give us what You have promised us through Your apostles. And do not despise us on the Day of Resurrection. Indeed, you never break your promise. (ali 'Imran \/ 3: 194 The heavenly beings continue with their thanksgiving, \"All praise be to Allah who has bestowed upon us this sign of heaven so that we may place it, wherever we may enjoy and enjoy all the gifts He has bestowed therein. \"Among the pleasures of heaven is the word of God explained as follows: And its shade (tree) is close to them and made it easy to pluck (its) fruit. And to them were distributed silver bowls and silver cups. crystal clear. (al-Insan \/ 76: 14-15) And there they were given a glass of ginger-mixed drink (from which came) a well (in heaven) called Salsabil (al-Insan \/ 76: 17- 18) And they will be surrounded by young men, and when you see them, you will think of them as scattered pearls, and when you look there, you will see a great variety of delights and kingdoms. (al -Insan \/ 76: 19-20) (75) In this verse, Allah tells the Prophet Muhammad of the hereafter and the beautiful and magnificent scenery in which the angels surround 'the Throne of praise to Allah, ready to carry out the command to be revealed to them. The sound of their beeps was heard around the 'Throne. Among them were those who carried the 'Throne' as stated in the verse: And the angels were in all parts of the heavens. On that day eight angels raised the 'Throne of your Lord on their (head). (al-haqqah \/ 69: 17) They stand in a straight line as described in verse: On that day, when the spirits and the angels stood in silence, they did not speak, except to whom God had given him permission. The Most Merciful and He just said the truth. (an-Naba '\/ 78: 38) On that day God will judge his servant with justice and righteousness. Listen in unison, \"Praise be to the Lord God of the worlds.\" God who created the heavens and the earth, who created man to be the caliph on earth, gave him guidance and guidance. He makes torment and torment hell for those who disobey him, and promises grace and favor to those who obey his commands with obedience and obedience. He also put to death all his creatures on the Day of Judgment and brought him back to receive the reward of his deeds and then held a trial to account for all the deeds of his servants justly, righteously, and wisely and then to render restitution to all his creatures. The wicked are cast into hell and the believers and the righteous are brought into heaven according to His promise. Praise be to God for all his works, justice, and mercy.",
      "text_tafsir": "Para Mukminin yang amat berbahagia dan bergembira melihat nikmat dan kesenangan yang akan mereka nikmati di dalam surga itu mengucapkan, \"Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami, sebagaimana telah disampaikan oleh rasul-Nya dan doa yang selalu kami panjatkan.\" Firman Allah:\n\nAllah menjanjikan kepada orang-orang mukmin laki-laki dan perempuan, (akan mendapat) surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya, dan (mendapat) tempat yang baik di surga 'Adn. Dan keridaan Allah lebih besar. Itulah kemenangan yang agung. (at-Taubah\/9: 72)\n\nDan firman Allah:\n\nYa Tuhan kami, berilah kami apa yang telah Engkau janjikan kepada kami melalui rasul-rasul-Mu. Dan janganlah Engkau hinakan kami pada hari Kiamat. Sungguh, Engkau tidak pernah mengingkari janji. (ali 'Imran\/3: 194\n\nAhli surga melanjutkan ucapan puji syukurnya, \"Segala puji bagi Allah yang telah mewariskan kepada kami tanda surga ini sehingga kami boleh menempatinya, di mana saja kami senangi dan nikmati berbagai macam karunia yang disediakan-Nya di dalamnya.\" Di antara kenikmatan surga itu adalah sebagaimana dijelaskan firman Allah berikut ini:\n\nDan naungan (pepohonan)nya dekat di atas mereka dan dimudahkan semudah-mudahnya untuk memetik (buah)nya. Dan kepada mereka diedarkan bejana-bejana dari perak dan piala-piala yang bening laksana kristal. (al-Insan\/76: 14-15)\n\nDan di sana mereka diberi segelas minuman bercampur jahe. (Yang didatangkan dari) sebuah mata air (di surga) yang dinamakan Salsabil. (al-Insan\/76: 17-18)\n\nDan mereka dikelilingi oleh para pemuda yang tetap muda. Apabila kamu melihatnya, akan kamu kira mereka, mutiara yang bertaburan. Dan apabila engkau melihat (keadaan) di sana (surga), niscaya engkau akan melihat berbagai macam kenikmatan dan kerajaan yang besar. (al-Insan\/76: 19-20)\n\n(75) Pada ayat ini, Allah menerangkan kepada Nabi Muhammad bagaimana suasana di akhirat nanti serta pemandangan yang indah dan menakjubkan di mana para malaikat mengelilingi 'Arasy bertasbih memuji Allah, siap melaksanakan perintah yang akan diturunkan kepada mereka. Dengungan tasbih mereka terdengar di sekeliling 'Arasy. Di antara mereka itu ada yang bertugas memikul 'Arasy sebagaimana tersebut pada ayat:\n\nDan para malaikat berada di berbagai penjuru langit. Pada hari itu delapan malaikat menjunjung 'Arasy (singgasana) Tuhanmu di atas (kepala) mereka. (al-haqqah\/69: 17)\n\nMereka berdiri dalam barisan-barisan yang teratur seperti dijelaskan pada ayat:\n\nPada hari, ketika roh dan para malaikat berdiri bersaf-saf, mereka tidak berkata-kata, kecuali siapa yang telah diberi izin kepadanya oleh Tuhan Yang Maha Pengasih dan dia hanya mengatakan yang benar. (an-Naba'\/78: 38)\n\nPada hari itu Allah memberi keputusan terhadap hamba-Nya dengan adil dan benar. Terdengarlah dengan serentak ucapan tasbih, \"Segala puji bagi Allah Tuhan semesta alam.\" Tuhan yang menciptakan langit dan bumi, yang menciptakan manusia untuk dijadikan khalifah di muka bumi, memberinya petunjuk dan hidayah. Dia yang menjadikan siksa dan azab neraka bagi yang mendurhakai-Nya, dan menjanjikan karunia dan nikmat kepada yang menjalankan perintah-Nya dengan patuh dan taat. Dia juga yang mematikan semua makhluk-Nya pada hari Kiamat dan menghidupkannya kembali untuk menerima balasan amal perbuatannya lalu mengadakan pengadilan untuk memperhitungkan semua amal hamba-Nya dengan adil, benar, dan bijaksana kemudian memberikan balasan bagi semua makhluk-Nya. Yang durhaka dimasukkan ke dalam neraka dan yang mukmin dan bertakwa dimasukkan ke dalam surga sesuai dengan janji-Nya. Segala puji dipanjatkan kepada Allah atas segala perbuatan-Nya, keadilan-Nya dan rahmat-Nya.",
      "text_translation": "Dan mereka berkata, “Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami dan telah memberikan tempat ini kepada kami sedang kami (diperkenankan) menempati surga di mana saja yang kami kehendaki.” Maka (surga itulah) sebaik-baik balasan bagi orang-orang yang beramal.",
      "text": "وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْ صَدَقَنَا وَعْدَهٗ وَاَوْرَثَنَا الْاَرْضَ نَتَبَوَّاُ مِنَ الْجَنَّةِ حَيْثُ نَشَاۤءُ ۚفَنِعْمَ اَجْرُ الْعٰمِلِيْنَ",
      "text_translation_en": "And they will exclaim: “All praise is due to God, who has made His promise to us come true, and has bestowed upon us this expanse [of bliss] as our portion, so that we may dwell in paradise as we please!” And how excellent a reward will it be for those who laboured [in God’s way]!",
      "juz_number": 24
    },
    "75": {
      "text_tafsir_en": "In this verse, Allah explains to the Prophet Muhammad what is the future and the beautiful and wonderful scene in which the angels surround 'the Throne of praise to Allah, ready to carry out the command that will be revealed to them. The sound of their beeps was heard around the 'Throne. Among them were those who carried the 'Throne' as stated in the verse: And the angels were in all parts of the heavens. On that day eight angels raised the 'Throne of your Lord on their (head). (al-haqqah \/ 69: 17) They stand in a straight line as described in verse: On that day, when the spirits and the angels stood in silence, they did not speak, except to whom God had given him permission. The Most Merciful and He just said the truth. (an-Naba '\/ 78: 38) On that day God will judge his servant with justice and righteousness. Listen in unison, \"Praise be to the Lord God of the worlds.\" God who created the heavens and the earth, who created man to be the caliph on earth, gave him guidance and guidance. He makes torment and torment hell for those who disobey him, and promises grace and favor to those who obey his commands with obedience and obedience. He also put to death all his creatures on the Day of Judgment and brought him back to receive the reward of his deeds and then held a trial to account for all the deeds of his servants justly, righteously, and wisely and then to render restitution to all his creatures. The wicked are cast into hell and the believers and the righteous are brought into heaven according to His promise. Praise be to God for all his works, justice, and mercy.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan kepada Nabi Muhammad bagaimana suasana di akhirat nanti serta pemandangan yang indah dan menakjubkan di mana para malaikat mengelilingi 'Arasy bertasbih memuji Allah, siap melaksanakan perintah yang akan diturunkan kepada mereka. Dengungan tasbih mereka terdengar di sekeliling 'Arasy. Di antara mereka itu ada yang bertugas memikul 'Arasy sebagaimana tersebut pada ayat:\n\nDan para malaikat berada di berbagai penjuru langit. Pada hari itu delapan malaikat menjunjung 'Arasy (singgasana) Tuhanmu di atas (kepala) mereka. (al-haqqah\/69: 17)\n\nMereka berdiri dalam barisan-barisan yang teratur seperti dijelaskan pada ayat:\n\nPada hari, ketika roh dan para malaikat berdiri bersaf-saf, mereka tidak berkata-kata, kecuali siapa yang telah diberi izin kepadanya oleh Tuhan Yang Maha Pengasih dan dia hanya mengatakan yang benar. (an-Naba'\/78: 38)\n\nPada hari itu Allah memberi keputusan terhadap hamba-Nya dengan adil dan benar. Terdengarlah dengan serentak ucapan tasbih, \"Segala puji bagi Allah Tuhan semesta alam.\" Tuhan yang menciptakan langit dan bumi, yang menciptakan manusia untuk dijadikan khalifah di muka bumi, memberinya petunjuk dan hidayah. Dia yang menjadikan siksa dan azab neraka bagi yang mendurhakai-Nya, dan menjanjikan karunia dan nikmat kepada yang menjalankan perintah-Nya dengan patuh dan taat. Dia juga yang mematikan semua makhluk-Nya pada hari Kiamat dan menghidupkannya kembali untuk menerima balasan amal perbuatannya lalu mengadakan pengadilan untuk memperhitungkan semua amal hamba-Nya dengan adil, benar, dan bijaksana kemudian memberikan balasan bagi semua makhluk-Nya. Yang durhaka dimasukkan ke dalam neraka dan yang mukmin dan bertakwa dimasukkan ke dalam surga sesuai dengan janji-Nya. Segala puji dipanjatkan kepada Allah atas segala perbuatan-Nya, keadilan-Nya dan rahmat-Nya.",
      "text_translation": "Dan engkau (Muhammad) akan melihat malaikat-malaikat melingkar di sekeliling ‘Arsy, bertasbih sambil memuji Tuhannya; lalu diberikan keputusan di antara mereka (hamba-hamba Allah) secara adil dan dikatakan, “Segala puji bagi Allah, Tuhan seluruh alam.”",
      "text": "وَتَرَى الْمَلٰۤىِٕكَةَ حَاۤفِّيْنَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْۚ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَقِيْلَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ ࣖ",
      "text_translation_en": "And thou wilt see the angels surrounding the throne of [God’s] almightiness, extolling their Sus­tainer’s glory and praise. And judgment will have been passed in justice on all [who had lived and died], and the word will be spoken: “All praise is due to God, the Sustainer of all the worlds!”",
      "juz_number": 24
    }
  },
  "name": "الزمر",
  "name_translation_en": "The Groups",
  "name_translation": "Rombongan",
  "name_latin": "Az-Zumar"
}