{
  "number": 40,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 85,
  "ayat": {
    "1": {
      "text_tafsir_en": "Explanations of the Hijrah letters at the beginning of several surahs in the Qur'an as at the beginning of this surah, have been elaborated at the beginning of Surah al-Baqarah. (See \"The Qur'an and its Interpretation\" Volume I)",
      "text_tafsir": "Penjelasan mengenai huruf-huruf hijaiyah pada awal beberapa surah dalam Al-Qur'an seperti pada awal surah ini, telah diuraikan dengan panjang lebar pada awal Surah al-Baqarah. (Lihat \"Al-Qur'an dan Tafsirnya\" Jilid I)",
      "text_translation": "Ha Mim",
      "text": "حٰمۤ  ۚ ",
      "text_translation_en": "Ha. Mim.",
      "juz_number": 24
    },
    "2": {
      "text_tafsir_en": "In this verse, God explains that the Holy Qur'an is the holy book of the Prophet Muhammad and his people must practice its contents and instructions. It was the last scripture that justified the ancient scriptures, and was truly revealed from God, the Lord of the worlds, the Almighty, there is no creature that can defeat him, the All-knowing God, nothing is hidden for Allah however small and delicate. The Word of God: This book is descended from the Almighty, the Almighty. (al-A.hqaf \/ 46: 2) The Holy Qur'an cannot be made by anyone other than Allah and may not have been made by Muhammad saw as alleged by the enemies of Islam. This has been stated by Allah in the Qur'an by His word: And it is not possible that this Qur'an was made by anyone other than Allah. (Jonah \/ 10:37) And His saying: Is it right that they say He created it? (Jonah \/ 10:38) In fact, the Holy Qur'an is revealed in a richly diverse background, providing guidance for humans to bring mankind out of darkness into the light of day. The Word of God: (This is) The Book We have revealed to you (Muhammad) that you may bring mankind out of darkness into the light of light with the permission of God, (that is) to the way of the Almighty, the Blessed One. (Abraham \/ 14: 1)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Kitab Suci Al-Qur'an yang merupakan kitab suci bagi Nabi Muhammad dan umatnya wajib diamalkan isi dan petunjuknya. Ia merupakan kitab suci terakhir yang membenarkan kitab-kitab suci yang sebelumnya, dan benar-benar diturunkan dari Allah, Tuhan sekalian alam, Tuhan Yang Mahaperkasa, tak ada satu makhluk pun yang dapat mengalahkan-Nya, Tuhan Yang Maha Mengetahui, tiada sesuatu yang tersembunyi bagi Allah bagaimanapun kecil dan halusnya. Firman Allah:\n\nKitab ini diturunkan dari Allah Yang Mahaperkasa, Mahabijaksana. (al-A.hqaf\/46: 2)\n\nKitab Suci Al-Qur'an tidak mungkin dibuat oleh selain Allah dan tidak mungkin juga dibuat oleh Muhammad saw sebagaimana yang dituduhkan oleh musuh-musuh Islam. Hal ini telah ditegaskan Allah di dalam Al-Qur'an dengan firman-Nya:\n\nDan tidak mungkin Al-Qur'an ini dibuat-buat oleh selain Allah. (Yunus\/10: 37)\n\nDan firman-Nya:\n\nApakah pantas mereka mengatakan dia (Muhammad) yang telah membuat-buatnya? (Yunus\/10: 38)\n\nBahkan, Kitab Suci Al-Qur'an itu diturunkan dengan latar belakang yang beraneka ragam, berisi petunjuk bagi manusia untuk mengeluarkan manusia dari kegelapan kepada cahaya terang-benderang. Firman Allah:\n\n(Ini adalah) Kitab yang Kami turunkan kepadamu (Muhammad) agar engkau mengeluarkan manusia dari kegelapan kepada cahaya terang-benderang dengan izin Tuhan, (yaitu) menuju jalan Tuhan Yang Mahaperkasa, Maha Terpuji. (Ibrahim\/14: 1)",
      "text_translation": "Kitab ini (Al-Qur'an) diturunkan dari Allah Yang Mahaperkasa, Maha Mengetahui,",
      "text": "تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْعَلِيْمِۙ",
      "text_translation_en": "THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the All-Know­ing,",
      "juz_number": 24
    },
    "3": {
      "text_tafsir_en": "In this verse five types of God are revealed in the Qur'an: 1. Forgiveness of Sin The nature of God is also emphasized in another verse, as Allah says: Declare to my servants that I am the Forgiving, the Merciful . (al-hijr \/ 15: 49) And His word is: He is Oft-Forgiving, Most Merciful. (az-Zumar \/ 39: 53) No matter how sinful a person is when he earnestly asks forgiveness of Allah, Allah will forgive all his sins as explained in the Qur'an hadith: O my servants, surely you have done wrong day and night, and I forgave them all, and forgave me, and I forgave them. (Muslim History of Abu dzarr) In another Qur'anic hadith, Allah also affirmed: Allah said, \"O son of Adam! As long as you ask and expect me, I will forgive your sins and I will not care. O son of Adam, confess your sins and have ascended to the skies, then ask forgiveness for me to forgive, and I will not care. (At-Tirmidzi History of Anas bin Malik) 2. Recipient of this Nature It is also stated in another verse of the Qur'an: Do they not know that Allah accepts the repentance of His servants? (at-Taubah \/ 9: 104) A person who has committed crimes such as persecution and others, then he repents, repents of his deeds, vindicates his faith, does good, and remains in the way of God, then God will accept his repentance, as he says: But if any one repent after committing a crime and make himself righteous, then surely Allah his repentance. (al-Ma'idah. \/ 5: 39) And His Word: And verily, I am the Forgiving of the repentant, believing and doing good, and remaining in guidance. (thaha \/ 20: 82) And He says: Except those who have repented, made amends and explained (them), they are my recipients and I am the All-Merciful, Most Merciful. (al-Baqarah \/ 2: 160) 3. His punishment is very heavy. In this regard Allah says: ahThe power is all that belongs to Allah and that Allah is very heavy in punishment. (al-Baqarah \/ 2: 165) Those who do evil, sinning like denying and disobeying the precepts of Allah, go astray in ways other than what He has revealed and outlined, they are the ones who suffer the punishment of Allah and hard, as His word says: They have rejected Our Signs, and Allah has tormented them for their sins. God is very heavy on His punishment. (ali 'Imran \/ 3: 11) In another verse, Allah declares: Indeed, those who disobey Allah's revelations will suffer severe punishment. Almighty Allah has his punishment. (ali 'Imran \/ 3: 4) And He also said: Surely those who go astray from the way of Allah will suffer heavy punishment, for they will forget the day of reckoning. (shad \/ 38: 26) 4. The Giver. Every gift and favor we receive is from God as His Word says: It is the gift and favor of God. And Allah is All-Knowing, All-Wise. (al-justification \/ 49: 8) And his word: And all the good that is in thee (from Allah). (an-Nahl \/ 16: 53) No man, by any means, can give a definite account of the many gifts and favors that God has bestowed upon him, as he says: And if you count the favors of God, you have believed won't be able to calculate it. (an-Nahl \/ 16: 18) 5. God is One One of the attributes of God that must be acknowledged is that He is One, there is no God but Him, no ally of Him, nothing similar to Him, as Allah says: There is nothing similar to him. And He is the All-Hearing, the All-Seeing. (asy-Syura \/ 42: 11) If he had an ally, there would be another god with the same power as his, then this world would be destroyed according to the word of Allah: If there were both (in heaven and on earth) there would be gods other than Allah , of course, they both disappeared. The Holy One of Allah has the Throne, from what they describe. (al-Anbiya '\/ 21: 22) Those who say that Allah is one of the three, including those who disobey and disbelieve, for verily Allah is the One, and there is no God but Him, says Allah: Indeed, they have disbelieved those who say, that God is one of the three, but there is no god (one who is worthy of worship) other than the One God. If they had not stopped what they were saying, then surely those who disbelieved among them would have suffered a painful torment. (al-Ma'idah. \/ 5: 73) This verse concludes with an affirmation that all beings will return to Allah and there will be a reward for them according to their deeds, as Allah says: And fear the day. you are all returned to God. Then each person will be rewarded according to what he has done, and they will not be harmed. (al-Baqarah \/ 2: 281)",
      "text_tafsir": "Pada ayat ini dijelaskan lima macam sifat Allah yang menurunkan Al-Qur'an:\n\n1. Pengampun Dosa\n\nSifat Allah ini ditegaskan pula pada ayat yang lain, sebagaimana firman Allah:\n\nKabarkanlah kepada hamba-hamba-Ku, bahwa Akulah Yang Maha Pengampun, Maha Penyayang. (al-hijr\/15: 49)\n\nDan firman-Nya:\n\nSungguh, Dialah Yang Maha Pengampun, Maha Penyayang. (az-Zumar\/39: 53)\n\nBagaimana pun banyaknya dosa seseorang apabila ia meminta ampun kepada Allah dengan sungguh-sungguh, maka Allah akan mengampuni semua dosanya sebagaimana dijelaskan dalam hadis Qudsi sebagai berikut:\n\nHai hamba-hamba-Ku, sesungguhnya kamu melakukan kesalahan di waktu siang dan malam, dan Aku mengampuni dosa-dosa itu semuanya, maka mintalah ampun pada-Ku, niscaya Aku mengampuninya. (Riwayat Muslim dari Abu dzarr)\n\nDi dalam hadis Qudsi yang lain, Allah menegaskan pula:\n\nAllah berfirman, \"Wahai anak Adam! Selagi kamu meminta dan mengharap kepada-Ku, maka Aku akan mengampuni dosa-dosa yang ada padamu dan tidak Aku pedulikan lagi. Wahai anak Adam! Andaikata dosamu (bertumpuk) dan telah sampai ke awan langit, kemudian kamu meminta ampun kepada-Ku niscaya Aku mengampuninya dan tidak Aku pedulikan lagi. (Riwayat at-Tirmidzi dari Anas bin Malik)\n\n2. Penerima Tobat \n\nSifat Allah ini ditegaskan pula pada ayat yang lain di dalam Al-Qur'an:\n\nTidakkah mereka mengetahui, bahwa Allah menerima tobat hamba-hamba-Nya. (at-Taubah\/9: 104)\n\nSeseorang yang telah berbuat kejahatan seperti penganiayaan dan lain-lain, kemudian ia bertobat, menyesali perbuatannya itu, mempertebal imannya, berbuat baik, dan tetap di jalan Allah, maka Allah akan menerima tobatnya, sebagaimana firman-Nya:\n\nTetapi barang siapa bertobat setelah melakukan kejahatan itu dan memperbaiki diri, maka sesungguhnya Allah menerima tobatnya. (al-Ma'idah.\/5: 39)\n\nDan firman-Nya:\n\nDan sungguh, Aku Maha Pengampun bagi yang bertobat, beriman dan berbuat kebajikan, kemudian tetap dalam petunjuk. (thaha\/20: 82)\n\nDan firman-Nya lagi:\n\nKecuali mereka yang telah bertobat, mengadakan perbaikan dan menjelaskan(nya), mereka itulah yang Aku terima tobatnya dan Akulah Yang Maha Penerima tobat, Maha Penyayang. (al-Baqarah\/2: 160)\n\n3. Hukuman-Nya Sangat Berat. \n\nMengenai hal ini Allah berfirman:\n\n¦Bahwa kekuatan itu semuanya milik Allah dan bahwa Allah sangat berat azab-Nya (niscaya mereka menyesal). (al-Baqarah\/2: 165)\n\nOrang-orang yang berbuat jahat, bergelimang dosa seperti mendustakan dan memungkiri ayat-ayat Allah, menempuh jalan yang sesat yaitu selain jalan yang telah ditunjukkan dan digariskan-Nya, mereka itulah yang mendapat siksa Allah yang berat dan keras, sebagaimana firman-Nya:\n\nMereka mendustakan ayat-ayat Kami, maka Allah menyiksa mereka disebabkan dosa-dosanya. Allah sangat berat hukuman-Nya. (ali 'Imran\/3: 11)\n\nPada ayat lain Allah menegaskan:\n\nSungguh, orang-orang yang ingkar terhadap ayat-ayat Allah akan memperoleh azab yang berat. Allah Mahaperkasa lagi mempunyai hukuman. (ali 'Imran\/3: 4)\n\nDan firman-Nya pula:\n\nSungguh, orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan. (shad\/38: 26)\n\n4. Pemberi Karunia. \n\nSetiap karunia dan nikmat yang kita peroleh adalah dari Allah sebagaimana firman-Nya:\n\nSebagai karunia dan nikmat dari Allah. Dan Allah Maha Mengetahui, Mahabijaksana. (al-hujurat\/49: 8)\n\nDan firman-Nya:\n\nDan segala nikmat yang ada padamu (datangnya) dari Allah. (an-Nahl\/16: 53)\n\nTidak ada seorang manusia, dengan jalan apa pun, yang dapat memberi angka yang pasti mengenai banyaknya karunia dan nikmat yang telah diberikan Allah padanya, sebagaimana firman-Nya:\n\nDan jika kamu menghitung nikmat Allah, niscaya kamu tidak akan mampu menghitungnya. (an-Nahl\/16: 18)\n\n5. Allah Maha Esa \n\nSalah satu sifat Allah yang wajib diimani yaitu bahwa Dia Maha Esa, tidak ada Tuhan selain Dia, tiada sekutu bagi-Nya, tiada sesuatu yang serupa dengan Dia, sebagaimana firman Allah:\n\nTidak ada sesuatu pun yang serupa dengan Dia. Dan Dia Yang Maha Mendengar, Maha Melihat. (asy-Syura\/42: 11)\n\nSekiranya Ia mempunyai sekutu, ada tuhan lain yang berkuasa sama dengan kekuasaan-Nya, maka dunia ini akan hancur sebagaimana firman Allah:\n\nSeandainya pada keduanya (di langit dan di bumi) ada tuhan-tuhan selain Allah, tentu keduanya telah binasa. Mahasuci Allah yang memiliki 'Arasy, dari apa yang mereka sifatkan. (al-Anbiya'\/21: 22)\n\nOrang-orang yang mengatakan bahwa Allah itu adalah salah satu dari yang tiga termasuk golongan yang ingkar dan kafir, karena sebenarnya Allah itu Esa, tiada Tuhan selain Dia, firman Allah:\n\nSungguh, telah kafir orang-orang yang mengatakan, bahwa Allah adalah salah satu dari yang tiga, padahal tidak ada tuhan (yang berhak disembah) selain Tuhan Yang Esa. Jika mereka tidak berhenti dari apa yang mereka katakan, pasti orang-orang yang kafir di antara mereka akan ditimpa azab yang pedih. (al-Ma'idah.\/5: 73)\n\nAyat ini diakhiri dengan suatu ketegasan bahwa semua makhluk akan kembali kepada Allah dan di sanalah nanti disempurnakan balasan bagi mereka menurut perbuatan mereka masing-masing sebagaimana firman Allah:\n\nDan takutlah pada hari (ketika) kamu semua dikembalikan kepada Allah. Kemudian setiap orang diberi balasan yang sempurna sesuai dengan apa yang telah dilakukannya, dan mereka tidak dizalimi (dirugikan). (al-Baqarah\/2: 281)",
      "text_translation": "yang mengampuni dosa dan menerima tobat dan keras hukuman-Nya; yang memiliki karunia. Tidak ada tuhan selain Dia. Hanya kepada-Nyalah (semua makhluk) kembali.",
      "text": "غَافِرِ الذَّنْۢبِ وَقَابِلِ التَّوْبِ شَدِيْدِ الْعِقَابِ ذِى الطَّوْلِۗ  لَآ اِلٰهَ اِلَّا هُوَ ۗاِلَيْهِ الْمَصِيْرُ ",
      "text_translation_en": "forgiving sins and accepting repentance, severe in retribution, limitless in His bounty. There is no deity save Him: with Him is all jour­neys’ end.",
      "juz_number": 24
    },
    "4": {
      "text_tafsir_en": "In this verse, God explains that only unbelievers who dislike the truth, argue, oppose, and deny the contents of the Qur'an and accuse it of nothing. Among their words is that the Qur'an is just poetry, magic, folk tales, or other derogatory allegations. In fact, it is clear and well known to the public that all the contents of the Qur'an are true. An argument in the nature of questioning the content of the Qur'an is a very despicable act and is an infidelity, as the Prophet Muhammad said: Debating the content of the Qur'an is unbelief. (History of Abu Hurairah) The contention of a question with a view to seeking and enforcing a right, explaining the ambiguous, obtaining a legal definition, rejecting misunderstandings and beliefs that do not conform to Islamic teachings , as well as opposing the view that undermines the content of the Qur'an, is a good and commendable act. In fact, it is an act that is the duty of the prophets. At the end of this verse, Allah warns Muhammad not to be fooled by the luxury of his opponents, the freedom of movement from one city to another, trading and trading at random and accumulating wealth. However, they all have a limit, and their nature is at least the same age. Then they will have a very painful torment in the hereafter. The Word of God: Do not be deceived by the activities of the infidels throughout the land. It was only a temporary pleasure, and then their return home was hell. (Hell) it's a bad place to live. (ali 'Imran \/ 3: 196-197)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa hanya orang-orang kafir yang tidak senang kepada kebenaran, suka mendebat, menentang, dan mendustakan isi Al-Qur'an serta menuduhnya yang bukan-bukan. Di antara perkataan mereka adalah bahwa Al-Qur'an itu hanya syair, sihir, dongeng orang-orang dahulu, atau tuduhan lainnya yang meremehkan. Padahal, sudah jelas dan diketahui oleh umum bahwa semua isi Al-Qur'an itu adalah benar. Suatu perdebatan yang sifatnya mempertanyakan isi Al-Qur'an adalah perbuatan yang sangat tercela dan merupakan suatu kekafiran, sebagaimana sabda Nabi Muhammad:\n\nMemperdebatkan isi Al-Qur'an adalah kekafiran. (Riwayat A.hmad dari Abu Hurairah) \n\nAdapun perdebatan yang mempersoalkan sesuatu dengan maksud untuk mencari dan menguatkan sesuatu yang hak, menjelaskan yang masih samar-samar, mengambil suatu pengertian hukum, menolak paham-paham dan kepercayaan yang menyimpang dan tidak sesuai dengan ajaran Islam, serta menentang pengertian yang meremehkan isi Al-Qur'an, adalah perbuatan yang baik dan terpuji. Bahkan, yang demikian itu adalah perbuatan yang menjadi tugas para nabi.\n\nPada akhir ayat ini, Allah memperingatkan Nabi Muhammad supaya jangan teperdaya dengan kemewahan yang diperoleh para penentangnya, kebebasan gerak mereka dari satu kota ke kota yang lain, berjual-beli dan berdagang seenaknya sehingga memperoleh kekayaan yang bertumpuk-tumpuk. Bagaimanapun juga, kesemuanya itu mempunyai batas, dan sifatnya sementara paling lama sama dengan umurnya. Sesudah itu mereka akan mendapat siksaan yang amat pedih di akhirat. Firman Allah:\n\nJangan sekali-kali kamu teperdaya oleh kegiatan orang-orang kafir (yang bergerak) di seluruh negeri. Itu hanyalah kesenangan sementara, kemudian tempat kembali mereka ialah neraka Jahanam. (Jahanam) itu seburuk-buruk tempat tinggal. (ali 'Imran\/3: 196-197)",
      "text_translation": "Tidak ada yang memperdebatkan tentang ayat-ayat Allah, kecuali orang-orang yang kafir. Karena itu janganlah engkau (Muhammad) tertipu oleh keberhasilan usaha mereka di seluruh negeri.",
      "text": "مَا يُجَادِلُ فِيْٓ اٰيٰتِ اللّٰهِ اِلَّا الَّذِيْنَ كَفَرُوْا فَلَا يَغْرُرْكَ تَقَلُّبُهُمْ فِى الْبِلَادِ",
      "text_translation_en": "NONE BUT THOSE who are bent on denying the truth would call God’s messages in question. But let it not deceive thee that they seem to be able to do as they please on earth:",
      "juz_number": 24
    },
    "5": {
      "text_tafsir_en": "In this verse, Allah comforts the Prophet Muhammad so that he will not be anxious and angry with his people who always oppose and reject him. This is the same law that applies to every prophet and apostle whom God has sent. The people of Noah rejected Noah, and so did the other people, rejecting the prophets and apostles who were sent to them, such as the 'Ad, Samud, and others. In fact, in addition to refusing the apostles, they also planned treason against the apostles. They tried to fight their apostles and persecute them. They constantly opposed, denounced, and debated the apostles for baseless and baseless reasons. Among their words were the apostles, ordinary men as they were, with the intention of releasing the truth, blurring the right that came from God, and constantly extinguishing and extinguishing the light (religion) of God, as the word of God said: They would extinguish the light (religion) Allah with their mouths (words), but Allah rejects it, even seeking to perfect His light, even though the disbelievers dislike it. (at-Taubah \/ 9:32) God does not keep silent on the evil deeds that show their moral decay. They were tormented with a very painful torture and destroyed by God, some even being destroyed so that they never seemed to be on this earth. The people of Muhammad, especially the people of Mecca, can see their former ruins as stated in the Qur'an: And verily you (the people of Mecca) will go through them in the morning, and at night. . Then why don't you understand? (ash-shaffat \/ 37: 137-138)",
      "text_tafsir": "Pada ayat ini, Allah menghibur Nabi Muhammad agar jangan cemas dan gusar menghadapi kaumnya yang selalu menentang dan mendustakannya. Hal demikian adalah sunatullah yang berlaku pada setiap nabi dan rasul yang diutus Allah. Kaum Nuh mendustakan Nabi Nuh, begitu pula umat-umat yang lain, telah mendustakan para nabi dan rasul yang diutus kepada mereka, seperti kaum 'Ad, Samud, dan lain-lain. Bahkan, selain mendustakan para rasul, mereka juga merencanakan makar terhadap para rasul. Mereka berusaha melawan para rasul mereka dan menganiaya sekehendak hati. Mereka tidak henti-hentinya menentang, mendustakan, dan mendebat rasul-rasul dengan alasan yang batil dan tak berdasar. Di antara perkataan mereka adalah rasul-rasul itu manusia-manusia biasa seperti mereka juga, dengan maksud untuk melepaskan kebenaran, mengaburkan yang hak yang datangnya dari Allah, serta senantiasa mematikan dan memadamkan cahaya (agama) Allah, sebagaimana firman Allah:\n\nMereka hendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka, tetapi Allah menolaknya, malah berkehendak menyempurnakan cahaya-Nya, walaupun orang-orang kafir itu tidak menyukai. (at-Taubah\/9: 32)\n\nAllah tidak tinggal diam melihat perbuatan jahat yang menunjukkan kebejatan akhlak mereka itu. Mereka diazab dengan siksaan yang amat pedih dan dibinasakan oleh Allah, bahkan ada yang dimusnahkan sehingga mereka seakan-akan tak pernah ada di bumi ini. Umat Muhammad saw, terutama penduduk Mekah, dapat menyaksikan bekas-bekas kehancuran mereka sebagaimana dikisahkan dalam Al-Qur'an:\n\nDan sesungguhnya kamu (penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka pada waktu pagi, dan pada waktu malam. Maka mengapa kamu tidak mengerti? (ash-shaffat\/37: 137-138)",
      "text_translation": "Sebelum mereka, kaum Nuh dan golongan-golongan yang bersekutu setelah mereka telah mendustakan (rasul) dan setiap umat telah merencanakan (tipu daya) terhadap rasul mereka untuk menawannya dan mereka membantah dengan (alasan) yang batil untuk melenyapkan kebenaran; karena itu Aku tawan mereka (dengan azab). Maka betapa (pedihnya) azab-Ku?",
      "text": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَّالْاَحْزَابُ مِنْۢ بَعْدِهِمْ ۖوَهَمَّتْ كُلُّ اُمَّةٍۢ بِرَسُوْلِهِمْ لِيَأْخُذُوْهُ وَجَادَلُوْا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ فَاَخَذْتُهُمْ ۗفَكَيْفَ كَانَ عِقَابِ",
      "text_translation_en": "to the truth gave the lie, before their time, the people of Noah and, after them, all those [others] who were leagued together [against God’s message-bearers]; and each of those com­munities schemed against the apostle sent unto them, aiming to lay hands on him; and they contended [against his message] with fallacious arguments, so as to render void the truth thereby: but then I took them to task - and how awesome was My retribution!",
      "juz_number": 24
    },
    "6": {
      "text_tafsir_en": "This verse shows how the ancient people were punished and destroyed for their unkind treatment of their prophets and apostles. Thus, the same applies to the people of Prophet Muhammad who continue to reject, reject, and reject the verses of Allah. In the hereafter, they will be cast into hell. The Word of God: As for those who disbelieve and deny Our Signs, they are the inhabitants of hell. They remain in it. (al-Baqarah \/ 2: 39)",
      "text_tafsir": "Ayat ini menunjukkan bagaimana umat-umat dahulu telah diazab dan dibinasakan karena perlakuan mereka yang tidak wajar kepada para nabi dan rasul mereka. Dengan demikian, hal itu berlaku pula bagi umat Nabi Muhammad yang tetap membangkang, mengingkari, dan mendustakan ayat-ayat Allah. Di akhirat, mereka akan dimasukkan ke dalam neraka. Firman Allah:\n\nAdapun orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itu penghuni neraka. Mereka kekal di dalamnya. (al-Baqarah\/2: 39)",
      "text_translation": "Dan demikianlah telah pasti berlaku ketetapan Tuhanmu terhadap orang-orang kafir, (yaitu) sesungguhnya mereka adalah penghuni neraka.",
      "text": "وَكَذٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى الَّذِيْنَ كَفَرُوْٓا اَنَّهُمْ اَصْحٰبُ النَّارِۘ ",
      "text_translation_en": "And thus shall thy Sustainer’s word come true against all who are bent on denying the truth: they shall find themselves in the fire [of hell].",
      "juz_number": 24
    },
    "7": {
      "text_tafsir_en": "This verse explains that the angels who carry the 'Throne and the angels around him are constantly sanctifying God, thanking him for believing in his favor, and acknowledging that no God is worshiped except him. The angels also begged forgiveness for those who acknowledged the oneness and purity of God from worship besides Him. As to the way the angels take the 'Throne and the number of those who bear it, it is sufficient that we believe it as it is and return it to the knowledge of God, as it includes things not found in detail, either in the Qur'an or in the hadiths worry. In addition to purifying and praising God, angels also pray for believers. These prayers, among others, illustrate the following: First, that the science of God covers everything. God's grace covers the forgiveness of their sins and mistakes, and the knowledge of God covers their actions, speech, and actions. It is easy for God to forgive sins and mistakes because His mercy is broader and greater than sins and mistakes. There is no deed in the dark, no word or speech, no heart or whisper, no gestures or gestures unless it is known to God. Second, ask God for forgiveness of those who repent, stop the sinful act, follow what they are commanded, practice good, and forsake evil things. Third, the angels begged that the believers be protected from the torment of Hell in accordance with God's promise.",
      "text_tafsir": "Ayat ini menerangkan bahwa para malaikat yang memikul 'Arasy dan para malaikat yang ada di sekelilingnya senantiasa menyucikan Allah, mengucapkan syukur atas nikmat-Nya beriman, dan mengakui bahwa tiada Tuhan yang disembah selain Dia. Para malaikat itu juga memohonkan ampun bagi orang yang mengakui keesaan dan kesucian Allah dari sembahan selain-Nya. \n\nMengenai cara malaikat itu memikul 'Arasy dan berapa jumlah mereka yang memikulnya, cukup kita percaya sebagaimana adanya dan mengembalikannya kepada ilmu Tuhan, karena yang demikian termasuk hal-hal yang tidak didapati perinciannya, baik dalam Al-Qur'an maupun dalam hadis-hadis yang mutawatir. \n\nDi samping menyucikan dan memuji Allah, para malaikat juga senantiasa mendoakan orang-orang mukmin. Doa-doa tersebut antara lain menggambarkan hal-hal sebagai berikut:\n\nPertama, bahwa ilmu Tuhan meliputi segala sesuatu. Rahmat Allah meliputi pengampunan dosa-dosa dan kesalahan mereka dan ilmu Tuhan meliputi perbuatan, ucapan, dan gerak mereka. Mudah bagi Allah mengampuni dosa-dosa dan kesalahan-kesalahan karena rahmat-Nya lebih luas dan lebih besar dari dosa-dosa dan kesalahan. Tiada suatu perbuatan sekalipun di tempat yang gelap, tiada suatu kata atau ucapan, sekalipun kata hati atau bisikan sukma, tiada suatu tindak-tanduk atau gerak-gerik kecuali diketahui oleh Allah. \n\nKedua, memintakan ampun kepada Allah bagi orang-orang yang bertobat, menghentikan perbuatan dosa yang telah dilakukan, mengikuti apa yang diperintahkan kepada mereka, mengamalkan yang baik, dan meninggalkan hal-hal yang mungkar. \n\nKetiga, malaikat pun memohon agar orang-orang mukmin itu dilindungi dari siksa neraka Jahanam sesuai dengan janji Allah.",
      "text_translation": "(Malaikat-malaikat) yang memikul ‘Arsy dan (malaikat) yang berada di sekelilingnya bertasbih dengan memuji Tuhannya dan mereka beriman kepada-Nya serta memohonkan ampunan untuk orang-orang yang beriman (seraya berkata), “Ya Tuhan kami, rahmat dan ilmu yang ada pada-Mu meliputi segala sesuatu, maka berilah ampunan kepada orang-orang yang bertobat dan mengikuti jalan (agama)-Mu dan peliharalah mereka dari azab neraka yang menyala-nyala.",
      "text": "اَلَّذِيْنَ يَحْمِلُوْنَ الْعَرْشَ وَمَنْ حَوْلَهٗ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُوْنَ بِهٖ وَيَسْتَغْفِرُوْنَ لِلَّذِيْنَ اٰمَنُوْاۚ رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَّعِلْمًا فَاغْفِرْ لِلَّذِيْنَ تَابُوْا وَاتَّبَعُوْا سَبِيْلَكَ وَقِهِمْ عَذَابَ الْجَحِيْمِ ",
      "text_translation_en": "THEY WHO BEAR [within themselves the knowl­edge of] the throne of [God’s] almightiness, as well as all who are near it, extol their Sustainer’s limitless glory and praise, and have faith in Him, and ask forgiveness for all [others] who have attained to faith: “O our Sustainer! Thou embracest all things within [Thy] grace and knowledge: forgive, then, their sins unto those who repent and follow Thy path, and preserve them from suffering through the blazing fire!",
      "juz_number": 24
    },
    "8": {
      "text_tafsir_en": "In this verse the angelic prayer is further explained to believers: Fourth, the angels pray that the believers be admitted into heaven 'Adn which God has promised through His prophetic utterance. The angels also asked that they be included among the godly men, their wives, and their offspring, that they should rejoice in gathering with their families in a place of joy and gladness, of good cheer and love very effective. Sa'id bin Jubair explained that when a man entered heaven he said, \"My God! Where is my father, grandmother, and mother? Where are my children and grandchildren? Where is my wife?\" It is answered that they do not practice as he did. Then he said, \"My God! I am doing good to myself and them.\" So they equal their position in heaven and read this verse. In accordance with this verse the word of Allah: And those who believe, and their children who follow them in faith, We find them with their grandchildren (in heaven), and We do not diminish the reward of charity. Everyone is tied to what they do. (ath-thur \/ 52: 21) This verse closes with a clear assertion that Allah is the Almighty who can do nothing against His will, the Almighty, and does nothing but act according to the wisdom of His wisdom.",
      "text_tafsir": "Dalam ayat ini dijelaskan doa malaikat selanjutnya bagi orang-orang yang beriman:\n\nKeempat, para malaikat memohon agar orang-orang mukmin dimasukkan ke dalam surga 'Adn yang telah dijanjikan oleh Allah melalui ucapan rasul-Nya. Para malaikat juga memohon agar bersama mereka itu dimasukkan juga orang-orang saleh di antara bapak-bapak, istri-istri, dan keturunan mereka semua, supaya mereka merasa senang karena berkumpul dengan keluarga di tempat yang dapat memberi kegembiraan dan kesenangan, menimbulkan rasa riang dan suka yang amat berkesan.\n\nSa'id bin Jubair menjelaskan bahwa ketika seorang laki-laki masuk surga ia berkata, \"Ya Tuhan! Di mana ayah, nenek, dan ibuku? Di mana anak dan cucuku? Di mana istriku?\" Dijawab bahwa mereka itu tidak beramal seperti amalan yang telah dilakukannya. Ia lalu berkata, \"Ya Tuhan! Saya beramal untuk diriku dan mereka.\" Maka mereka disamakan kedudukannya di surga dan ia lalu membaca ayat ini. Sejalan dengan ayat ini firman Allah:\n\nDan orang-orang yang beriman, beserta anak cucu mereka yang mengikuti mereka dalam keimanan, Kami pertemukan mereka dengan anak cucu mereka (di dalam surga), dan Kami tidak mengurangi sedikit pun pahala amal (kebajikan) mereka. Setiap orang terikat dengan apa yang dikerjakannya. (ath-thur\/52: 21)\n\nAyat ini ditutup dengan satu ketegasan bahwa Allah itu Mahaperkasa tiada sesuatu yang dapat menghalangi kehendak-Nya, Mahabijaksana, tiada sesuatu yang dikerjakan-Nya, kecuali sesuai dengan hikmah kebijaksanaan-Nya.",
      "text_translation": "Ya Tuhan kami, masukkanlah mereka ke dalam surga ‘Adn yang telah Engkau janjikan kepada mereka, dan orang yang saleh di antara nenek moyang mereka, istri-istri, dan keturunan mereka. Sungguh, Engkaulah Yang Mahaperkasa, Mahabijaksana,",
      "text": "رَبَّنَا وَاَدْخِلْهُمْ جَنّٰتِ عَدْنِ ِۨالَّتِيْ وَعَدْتَّهُمْ وَمَنْ صَلَحَ مِنْ اٰبَاۤىِٕهِمْ وَاَزْوَاجِهِمْ وَذُرِّيّٰتِهِمْ ۗاِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُۙ ",
      "text_translation_en": "“And, O our Sustainer, bring them into the gardens of perpetual bliss which Thou hast promised them, together with the righteous from among their forebears, and their spouses, and their offspring - for, verily, Thou alone art almighty, truly wise –",
      "juz_number": 24
    },
    "9": {
      "text_tafsir_en": "This verse still describes the next angelic prayer for the believers. Fifth, angels not only ask forgiveness of believers for their sins after repentance, but also for the sins and rewards of evil deeds that they committed before they repented and were not reproved. Those who have been forgiven, forgiven, and abolished in retaliation for their evil in this world, mean that they have received the gift of God and are freed from His torment and torment on the Day of Judgment. This was a great victory because with little good deeds, he received endless favors and gifts.",
      "text_tafsir": "Ayat ini masih menerangkan doa malaikat selanjutnya bagi orang-orang mukmin.\n\nKelima, para malaikat tidak saja memintakan ampun bagi orang-orang mukmin dari dosa-dosa mereka sesudah tobat, tetapi juga dosa-dosa dan balasan amal jahat yang mereka kerjakan sebelum mereka bertobat supaya dihapuskan dan tidak diazab karenanya. Orang-orang yang dimaafkan, diampuni, dan dihapuskan balasan kejahatannya di dunia ini, berarti mereka telah mendapat karunia dari Allah dan dibebaskan dari azab dan siksa-Nya di hari Kiamat. Hal yang demikian itu merupakan suatu kemenangan yang amat besar karena dengan amal baik yang tidak seberapa itu, ia memperoleh nikmat dan karunia yang berkepanjangan tiada putus-putusnya.",
      "text_translation": "dan peliharalah mereka dari (bencana) kejahatan. Dan orang-orang yang Engkau pelihara dari (bencana) kejahatan pada hari itu, maka sungguh, Engkau telah menganugerahkan rahmat kepadanya dan demikian itulah kemenangan yang agung.”",
      "text": "وَقِهِمُ السَّيِّاٰتِۗ وَمَنْ تَقِ السَّيِّاٰتِ يَوْمَىِٕذٍ فَقَدْ رَحِمْتَهٗ ۗوَذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ ࣖ ",
      "text_translation_en": "and preserve them from [doing] evil deeds: for anyone whom on that Day [of Judgment] Thou wilt have preserved from [the taint of] evil deeds, him wilt Thou have graced with Thy mercy: and that, that will be the triumph supreme!”",
      "juz_number": 24
    },
    "10": {
      "text_tafsir_en": "In this verse, God explains that in the Hereafter the unbelievers who are in hell feel a painful torment, hate and curse each other. They even hated themselves for the things he had done in the world that led to hell. However, the angels said to them, \"Indeed, the hatred of God when you reject the cries of the prophets is greater than your resentment toward yourself in the face of the torment of hell.\" The Word of God: The best friends of the day were at enmity with each other, except those who feared. (az-Zukhruf \/ 43: 67) And He says: \"Then on the Day of Judgment some of you will betray and curse each other (al-'Ankabut \/ 29: 25)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa di akhirat orang-orang kafir yang sedang berada di dalam neraka merasakan azab yang amat pedih, saling membenci dan melaknat antara satu dengan yang lain. Bahkan mereka membenci diri mereka sendiri karena perbuatan yang telah dilakukannya di dunia yang menyebabkannya masuk neraka. Namun, malaikat berkata kepada mereka, \"Sesungguhnya kebencian Allah pada saat kalian menolak seruan para nabi lebih besar dibandingkan dengan kebencianmu terhadap dirimu sendiri ketika menghadapi siksa neraka.\" Firman Allah:\n\nTeman-teman karib pada hari itu saling bermusuhan satu sama lain, kecuali mereka yang bertakwa. (az-Zukhruf\/43: 67)\n\nDan firman-Nya:\n\n¦Kemudian pada hari Kiamat sebagian kamu akan saling mengingkari dan saling mengutuk¦ (al-'Ankabut\/29: 25)",
      "text_translation": "Sesungguhnya orang-orang yang kafir, kepada mereka (pada hari Kiamat) diserukan, “Sungguh, kebencian Allah (kepadamu) jauh lebih besar daripada kebencianmu kepada dirimu sendiri, ketika kamu diseru untuk beriman lalu kamu mengingkarinya.”",
      "text": "اِنَّ الَّذِيْنَ كَفَرُوْا يُنَادَوْنَ لَمَقْتُ اللّٰهِ اَكْبَرُ مِنْ مَّقْتِكُمْ اَنْفُسَكُمْ اِذْ تُدْعَوْنَ اِلَى الْاِيْمَانِ فَتَكْفُرُوْنَ",
      "text_translation_en": "[But,] behold, as for those who are bent on denying the truth - [on that same Day] a voice will call out unto them: “Indeed, greater than your [present] loathing of yourselves was God’s loathing of you [at the time] when you were called unto faith but went on denying the truth!”",
      "juz_number": 24
    },
    "11": {
      "text_tafsir_en": "After hearing the angel's cry and unable to bear the painful torment, the unbelievers said, \"O Lord, You have killed us twice and revived us twice. You have brought us to death and revived us by blowing our souls in the womb of our mother, then put us to death in the world after our death, and in the hereafter we are resurrected by bringing our souls back to life. (Al-Baqarah \/ 2:28) Man died while still in childbirth and in the body of his parents, and was raised from birth into the world, and subsequent death was a must. The Resurrection (the Day of Resurrection) They experienced twice the life and the second death. over and over again, unbelievers become conscious. They acknowledge the wrongs of the world as they deny the Day of Resurrection and commit countless sins, to atone for their sins. They demand that they be released from hell and be returned to the world to practice righteousness and never commit sins and sins again. Such a request is also mentioned in another verse as the word of God: And if you see those sinners bowing their heads before their Lord, (they say), \"Our Lord, we have seen and heard , then return us (to the world), and we will do good. Truly, we are confident people. \" (as-Sajdah \/ 32: 12) O our Lord, bring us out of it, if we return (to disbelief), indeed, we are the wrongdoers. \"(al-Mu'minun \/ 23: 107)",
      "text_tafsir": "Setelah mendengar seruan malaikat dan tidak tahan lagi merasakan azab yang amat pedih, orang-orang kafir berkata, \"Wahai Tuhan, Engkau telah mematikan kami dua kali dan menghidupkan kami dua kali. Engkau menjadikan kami dalam keadaan mati lalu menghidupkan kami dengan meniupkan roh ke dalam rahim ibu kami, kemudian mematikan kami di dunia setelah ajal kami berakhir, dan di akhirat nanti kami dihidupkan kembali dengan mengembalikan roh kami untuk dibangkitkan. Firman Allah:\n\nBagaimana kamu ingkar kepada Allah, padahal kamu (tadinya) mati, lalu Dia menghidupkan kamu, kemudian Dia mematikan kamu lalu Dia menghidupkan kamu kembali. (al-Baqarah\/2: 28)\n\nManusia mati ketika masih janin dan berada dalam tubuh orang tuanya. Kemudian dihidupkan ketika lahir ke dunia, lalu kematian berikutnya sudah merupakan suatu keharusan. Setelah itu dihidupkan pada hari Kebangkitan (hari Kiamat). Mereka mengalami dua kali hidup dan dua kali mati.\n\nSetelah menyaksikan kekuasaan Allah mematikan dan menghidupkan mereka berulang kali, orang-orang kafir menjadi sadar. Mereka mengakui kesalahan-kesalahan di dunia ketika mengingkari hari Kebangkitan dan mengerjakan dosa-dosa yang tak terhitung banyaknya, untuk menebus kesalahan-kesalahan mereka itu. Mereka meminta supaya dikeluarkan dari neraka dan dikembalikan ke dunia untuk beramal saleh dan tidak akan mengerjakan kesalahan dan dosa lagi. Permintaan seperti ini disebutkan juga pada ayat yang lain sebagaimana firman Allah:\n\nDan (alangkah ngerinya), jika sekiranya kamu melihat orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhannya, (mereka berkata), \"Ya Tuhan kami, kami telah melihat dan mendengar, maka kembalikanlah kami (ke dunia), niscaya kami akan mengerjakan kebajikan. Sungguh, kami adalah orang-orang yang yakin.\" (as-Sajdah\/32: 12)\n\nYa Tuhan kami, keluarkanlah kami darinya (kembalikanlah kami ke dunia), jika kami masih juga kembali (kepada kekafiran), sungguh, kami adalah orang-orang yang zalim.\" (al-Mu'minun\/23: 107)",
      "text_translation": "Mereka menjawab, “Ya Tuhan kami, Engkau telah mematikan kami dua kali dan telah menghidupkan kami dua kali (pula), lalu kami mengakui dosa-dosa kami. Maka adakah jalan (bagi kami) untuk keluar (dari neraka)?”",
      "text": "قَالُوْا رَبَّنَآ اَمَتَّنَا اثْنَتَيْنِ وَاَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنَا بِذُنُوْبِنَا فَهَلْ اِلٰى خُرُوْجٍ مِّنْ سَبِيْلٍ",
      "text_translation_en": "[Whereupon] they will exclaim: “O our Sus­tainer! Twice hast Thou caused us to die, just as twice Thou hast brought us to life!",
      "juz_number": 24
    },
    "12": {
      "text_tafsir_en": "In this verse it is explained that their request is impossible to please God. They will not be returned to the world, because their hearts are no longer accepting the truth. In the world, they disbelieve and refuse when called upon to worship only God, but when Allah is united with others, they believe and justify it. Their request to come out of hell and be returned to the world for good deeds was answered by God in His word: He said, \"Abide in her, and do not talk to me.\" (Al-Mu'minun \/ 23: 108) Even if their request is granted and returned to the world, they will continue to do what Allah forbids. They are liars, as God says: \"If they were brought back into the world, they would repeat what they were forbidden to do. They are liars.\" . God hates those who associate with him and has exercised wisdom in keeping them in hell.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa permintaan mereka itu tidak mungkin diperkenankan oleh Allah. Mereka tidak akan dikembalikan ke dunia, karena hati mereka sudah tidak menerima kebenaran lagi. Di dunia, mereka kafir dan ingkar apabila diseru untuk hanya menyembah Allah saja, tetapi apabila Allah dipersekutukan dengan yang lain, mereka percaya dan membenarkannya. Permintaan mereka ke luar dari neraka dan dikembalikan ke dunia untuk beramal saleh, dijawab oleh Allah dengan firman-Nya:\n\nDia (Allah) berfirman, “Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.” (al-Mu’minun\/23: 108)\n\nAndaikata permintaan mereka diperkenankan dan dikembalikan ke dunia, mereka akan tetap mengerjakan hal-hal yang dilarang Allah sebagaimana halnya dahulu. Mereka itu pembohong, sebagaimana firman Allah:\n\n\"Seandainya mereka dikembalikan ke dunia, tentu mereka akan mengulang kembali apa yang telah dilarang mengerjakannya. Mereka itu sungguh pendusta\". (al-An’am\/6: 28)\n\nAyat ini ditutup dengan satu ketegasan bahwa putusan di hari Kiamat berada di tangan Allah yang akan memberi putusan dengan hak dan adil, Tuhan Yang Mahatinggi dan Mahabesar tiada sesuatu yang menyamai-Nya. Tuhan sangat benci kepada yang mempersekutukan-Nya dan telah member¬lakukan kebijaksanaan yaitu mengekalkan mereka di dalam neraka.",
      "text_translation": "Yang demikian itu karena sesungguhnya kamu mengingkari apabila diseru untuk menyembah Allah saja. Dan jika Allah dipersekutukan, kamu percaya. Maka keputusan (sekarang ini) adalah pada Allah Yang Mahatinggi, Mahabesar.",
      "text": "ذٰلِكُمْ بِاَنَّهٗٓ اِذَا دُعِيَ اللّٰهُ وَحْدَهٗ كَفَرْتُمْۚ وَاِنْ يُّشْرَكْ بِهٖ تُؤْمِنُوْا ۗفَالْحُكْمُ لِلّٰهِ الْعَلِيِّ الْكَبِيْرِ",
      "text_translation_en": "[And they will be told:] “This [has befallen you] because, whenever the One God was invoked, you denied this truth; whereas, when divinity was ascribed to aught beside Him, you believed [in it]! But all judgment rests with God, the Exalted, the Great!”",
      "juz_number": 24
    },
    "13": {
      "text_tafsir_en": "This verse explains that God shows signs of His power, such as wind, clouds, thunder, lightning, lightning, sun, moon, stars, and so on. He also caused the rain to fall from the sky, and it grew into trees that produced a great variety of fruits, colors, shapes, and creations. All of this shows the power of God. Only those who return to God and obey Him can take instruction from the above signs, and understand that they are signs and proofs of the power and oneness of God.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah memperlihatkan tanda-tanda kekuasaan-Nya, seperti adanya angin, awan, guruh, kilat, petir, matahari, bulan, bintang, dan lain sebagainya. Dia pula yang menurunkan hujan dari langit, maka tumbuhlah pepohonan yang menghasilkan buah-buahan yang beraneka ragam macam warna, rasa, bentuk, dan kejadiannya. Semua itu menunjukkan kekuasaan Allah. Hanya orang yang kembali kepada Allah dan taat kepada-Nya yang dapat mengambil iktibar dari tanda-tanda tersebut di atas, dan memahami bahwa semua itu adalah tanda-tanda dan bukti-bukti kekuasaan dan keesaan Allah.",
      "text_translation": "Dialah yang memperlihatkan tanda-tanda (kekuasaan)-Nya kepadamu dan menurunkan rezeki dari langit untukmu. Dan tidak lain yang mendapat pelajaran hanyalah orang-orang yang kembali (kepada Allah).",
      "text": "هُوَ الَّذِيْ يُرِيْكُمْ اٰيٰتِهٖ وَيُنَزِّلُ لَكُمْ مِّنَ السَّمَاۤءِ رِزْقًا ۗوَمَا يَتَذَكَّرُ اِلَّا مَنْ يُّنِيْبُ",
      "text_translation_en": "HE IT IS who shows you His wonders [in all nature], and sends down sustenance for you from the sky: but none bethinks himself [thereof] save those who are wont to turn to God.",
      "juz_number": 24
    },
    "14": {
      "text_tafsir_en": "At the end of the verse it is stated that those who are aware of God's power and uniqueness are the only ones who return to Him. We should worship and pray to him sincerely, purify his worship, not associate with others, as explained in the hadith narrated by al-Bukhari and Muslim of 'Abdullah bin Zubair: That the Messenger of Allah (may peace be upon him) recited fardu reciting La ilaha illallah There is no God but God and no ally for Him. Only to Allah is all power, to Him all praise, and to Him the Almighty. There is no power and strength except by God's help. There is no god but allah. We do not worship except Him. To him are all good pleasures, gifts, and compliments. There is no God but God, by devoting himself to his service, even though the disbelievers dislike it. (History of al-Bukhari and Muslim from 'Abdullah bin Zubair)",
      "text_tafsir": "Pada akhir ayat di atas dinyatakan bahwa orang yang menyadari kekuasaan dan keesaan Allah hanyalah orang-orang yang kembali kepada-Nya. Sepatutnya kita menyembah dan memohon kepada-Nya dengan ikhlas, memurnikan ibadah kepada-Nya, tidak mempersekutukannya dengan yang lain, sebagaimana dijelaskan dalam hadis yang diriwayatkan al-Bukhari dan Muslim dari 'Abdullah bin Zubair: \n\nBahwa Rasulullah setelah selesai salat fardu membaca La ilaha illallah¦dan seterusnya (artinya) Tidak ada Tuhan selain Allah tidak ada sekutu bagi-Nya. Hanya bagi Allah seluruh kekuasaan, bagi-Nya segala puji, dan Dia Mahakuasa atas segala sesuatu. Tidak ada daya dan kekuatan kecuali atas pertolongan Allah. Tidak ada Tuhan selain Allah. Kami tidak menyembah kecuali kepada-Nya. Bagi-Nya semua kenikmatan, anugerah, dan pujian yang baik. Tidak ada Tuhan selain Allah, dengan mengikhlaskan diri dalam berbakti kepada-Nya, walaupun orang-orang kafir tidak menyukai. (Riwayat al-Bukhari dan Muslim dari 'Abdullah bin Zubair)",
      "text_translation": "Maka sembahlah Allah dengan tulus ikhlas beragama kepada-Nya, meskipun orang-orang kafir tidak menyukai(nya).",
      "text": "فَادْعُوا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكٰفِرُوْنَ",
      "text_translation_en": "Invoke, then, God, sincere in your faith in Him alone, however hateful this may be to those who deny the truth!",
      "juz_number": 24
    },
    "15": {
      "text_tafsir_en": "In this verse, God mentions his three glories and majesty, after mentioning in the preceding verses the signs of his greatness and purity. a. Higher than his degrees. God is higher and greater than anything else. Because everything other than God intends for Him and not vice versa. He is eternal and eternal, having no beginning and no end. He knows everything, as explained in the Qur'an: And the keys of all the divine are in him; no one knows but him. (al-An'am \/ 6: 59) b. Has' Thrones. Allah has the 'Throne and it is He who controls it. He is the master of nature and the non-being. c. Lower the revelation. God sends down His revelations containing commands, either as instructions or prohibitions to His will, and communicating His laws to His will. The same thing is stated in another verse as the Word of God says: He sends down angels with revelation at His command to whom He wills of His servants, (saying), \"Warn (My servants) , that there is no god but me, then fear me. \" (an-Nahl \/ 16: 2) And his word: And indeed, this (the Qur'an) is truly revealed by the Lord of the whole world, Which was brought down by Ar-Ruh Al-Amin (Gabriel), into your heart (Muhammad) that you may be among those who warn. .",
      "text_tafsir": "Pada ayat ini, Allah menyebutkan tiga kemuliaan dan keagungan-Nya, sesudah menyebutkan pada ayat sebelumnya tanda-tanda kebesaran dan keesaan-Nya.\n\na. Mahatinggi derajat-Nya. Allah jauh lebih Tinggi dan lebih Agung dari segala yang ada. Sebab, segala sesuatu yang selain Allah berhajat kepada-Nya dan tidak sebaliknya. Dia itu azali dan abadi, tidak mempunyai permulaan dan tidak mempunyai akhir. Dia mengetahui segala sesuatu, sebagaimana dijelaskan dalam Al-Qur'an:\n\nDan kunci-kunci semua yang gaib ada pada-Nya; tidak ada yang mengetahui selain Dia. (al-An'am\/6: 59)\n\nb. Mempunyai 'Arasy. Allah memiliki 'Arasy dan Dia yang mengatur-Nya. Dia-lah yang menguasai alam benda dan yang bukan benda.\n\nc. Menurunkan wahyu. Allah menurunkan wahyu-Nya berisi perintah, baik berupa suruhan atau pun larangan kepada yang dikehendaki-Nya dan menyampaikan hukum-hukum-Nya kepada yang dikehendaki-Nya. Hal seperti itu dinyatakan pula pada ayat lain sebagaimana firman Allah:\n\nDia menurunkan para malaikat membawa wahyu dengan perintah-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya, (dengan berfirman) yaitu, \"Peringatkanlah (hamba-hamba-Ku), bahwa tidak ada tuhan selain Aku, maka hendaklah kamu bertakwa kepada-Ku.\" (an-Nahl\/16: 2)\n\nDan firman-Nya:\n\nDan sungguh, (Al-Qur'an) ini benar-benar diturunkan oleh Tuhan seluruh alam, Yang dibawa turun oleh Ar-Ruh Al-Amin (Jibril), ke dalam hatimu (Muhammad) agar engkau termasuk orang yang memberi peringatan. (asy-Syu'ara'\/26: 192-194) \n\nAllah menurunkan wahyu untuk memperingatkan manusia tentang adanya hari Kiamat, yaitu ketika yang menyembah dengan yang disembah bertemu, membereskan segala sesuatunya, segala sangkut pautnya yang belum selesai di dunia.",
      "text_translation": "(Dialah) Yang Mahatinggi derajat-Nya, yang memiliki ’Arsy, yang menurunkan wahyu dengan perintah-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya, agar memperingatkan (manusia) tentang hari pertemuan (hari Kiamat),",
      "text": "رَفِيْعُ الدَّرَجٰتِ ذُو الْعَرْشِۚ يُلْقِى الرُّوْحَ مِنْ اَمْرِهٖ عَلٰى مَنْ يَّشَاۤءُ مِنْ عِبَادِهٖ لِيُنْذِرَ يَوْمَ التَّلَاقِۙ",
      "text_translation_en": "High above all orders [of being] is He, in almightiness enthroned. By His Own will does He bestow inspiration upon whomever He wills of His servants, so as to warn [all human beings of the coming] of the Day when they shall meet Him",
      "juz_number": 24
    },
    "16": {
      "text_tafsir_en": "On the Day of Judgment, mankind will come out of his grave. None of their deeds are hidden from God, but He knows them. Then they will receive a reward according to their deeds, if they are good, good and bad, they will be punished and punished. Allah's Word: On that day you will be confronted (to your Lord), and nothing will be hidden from you. (al-haqqah \/ 69: 18) At that time, Allah said, \"Whose is the kingdom on that day?\" There was no one in the field to answer him. Then God himself answered by saying, \"To the Almighty God, there is no ally of him. The Almighty conquers all with his power and might.\"",
      "text_tafsir": "Pada hari Kiamat nanti manusia keluar dari kuburnya. Tidak sedikit pun perbuatan mereka yang tersembunyi di sisi Allah, semuanya diketahui-Nya. Kemudian mereka menerima balasan sesuai dengan amal mereka, kalau baik, dibalas dengan baik dan kalau jahat, dibalas dengan azab dan siksa. Firman Allah:\n\nPada hari itu kamu dihadapkan (kepada Tuhanmu), tidak ada sesuatu pun dari kamu yang tersembunyi (bagi Allah). (al-haqqah\/69: 18)\n\nPada waktu itu, Allah berfirman, \"Kepunyaan siapakah kerajaan pada hari itu?\" Tidak ada seorang pun di Padang Mahsyar itu yang menjawabnya. Lalu dijawab sendiri oleh Allah dengan firman-Nya, \"Kepunyaan Allah Yang Maha Esa, tiada sekutu bagi-Nya. Yang Maha mengalahkan segala sesuatu dengan kekuasaan dan keperkasaan-Nya.\"",
      "text_translation": "(yaitu) pada hari (ketika) mereka keluar (dari kubur); tidak sesuatu pun keadaan mereka yang tersembunyi di sisi Allah. (Lalu Allah berfirman), “Milik siapakah kerajaan pada hari ini?” Milik Allah Yang Maha Esa, Maha Mengalahkan.",
      "text": "يَوْمَ هُمْ بَارِزُوْنَ ۚ لَا يَخْفٰى عَلَى اللّٰهِ مِنْهُمْ شَيْءٌ ۗلِمَنِ الْمُلْكُ الْيَوْمَ ۗ لِلّٰهِ الْوَاحِدِ الْقَهَّارِ",
      "text_translation_en": "the Day when they shall come forth [from death], with nothing of themselves hidden from God. With whom will sovereignty rest on that Day? With God, the One who holds absolute sway over all that exists!",
      "juz_number": 24
    },
    "17": {
      "text_tafsir_en": "Even though God is almighty and omnipotent, and no one is able and able to thwart His will, yet He is just and fair to His servants. In the hereafter, God rewards everyone according to their efforts and actions in the world. No one was mistreated and harmed that day. Those who do good are rewarded with the least, and those who do evil are rewarded for their evil deeds. There will be no retribution for any crime he has committed. No one has been postponed and postponed for his will and his calculations. Allah is quick to calculate. There is no willab and calculation as fast as Allah's. He burns all his creatures as one man burns, for his knowledge is vast in all things. It makes no difference when He creates and raises people from the grave at the same time, as the Word of God says: Creating and raising you (for Allah) is like (creating and arousing) only one (easy) soul. (Luqman \/ 31: 28) And His word: And Our command is (only) a word like eye catching. (al-Qamar \/ 54: 50)",
      "text_tafsir": "Sekalipun Allah Mahakuasa dan Mahaperkasa, dan tidak seorang pun yang dapat dan sanggup menghalangi kehendak-Nya, namun ia tetap berlaku adil terhadap hamba-hamba-Nya. Di akhirat, Allah memberi balasan bagi setiap orang sesuai dengan usaha dan perbuatan mereka di dunia. Tak seorang pun yang dianiaya dan dirugikan pada hari itu. Orang yang berbuat baik dibalas dengan baik dengan tidak dikurangi sedikit pun, dan orang yang berbuat jahat, dibalas sesuai dengan perbuatan jahatnya. Tidak akan ditambah sedikit pun balasan dari kejahatan yang pernah dilakukannya. Tidak seorang pun yang ditunda dan ditangguhkan hisab dan perhitungan amalnya. Allah cepat sekali perhitungannya. Tidak ada suatu hisab dan perhitungan secepat hisab Allah. Ia menghisab semua makhluk-Nya seperti menghisab seorang saja, karena ilmu-Nya sangat luas meliputi segala sesuatu yang ada. Tiada bedanya ketika Dia menciptakan dan membangkitkan manusia dari dalam kubur secara serentak, sebagaimana firman Allah:\n\nMenciptakan dan membangkitkan kamu (bagi Allah) hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja (mudah). (Luqman\/31: 28)\n\nDan firman-Nya:\n\nDan perintah Kami hanyalah (dengan) satu perkataan seperti kejapan mata. (al-Qamar\/54: 50)",
      "text_translation": "Pada hari ini setiap jiwa diberi balasan sesuai dengan apa yang telah dikerjakannya. Tidak ada yang dirugikan pada hari ini. Sungguh, Allah sangat cepat perhitungan-Nya.",
      "text": "اَلْيَوْمَ تُجْزٰى كُلُّ نَفْسٍۢ بِمَا كَسَبَتْ ۗ لَا ظُلْمَ الْيَوْمَ ۗاِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ",
      "text_translation_en": "On that Day will every human being be requited for what he has earned: no wrong [will be done] on that Day: verily, swift in reckoning is God!",
      "juz_number": 24
    },
    "18": {
      "text_tafsir_en": "In this verse, God explains that He commanded the Messenger of Allah to warn his unbelieving people of the coming Judgment Day. Therefore, they were warned to stop doing evil deeds prohibited by religion, and to repair their perverted creeds, which would cause them to be punished in the hereafter with a painful torment. On that day, the situation was horrific and scary, the sadness unimaginable until the heart felt tight to the esophagus, the breath went up, the breath went in and out until they found death. No one can help those who have wronged themselves by associating with Allah, and no advocate is asking for intercession.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Dia memerintahkan Rasulullah supaya memperingatkan kaumnya yang musyrik akan datangnya hari Kiamat yang tidak lama lagi. Oleh karena itu, mereka diingatkan untuk berhenti melakukan perbuatan jahat yang dilarang oleh agama, dan memperbaiki akidah mereka yang sesat, yang menyebabkan mereka diazab nanti di akhirat dengan azab yang pedih. Pada hari itu, keadaan sangat mengerikan dan menakutkan, kesedihan tak terkirakan lagi sehingga jantung terasa sesak sampai ke kerongkongan, napas turun naik, nyawa keluar masuk sampai mereka menemui ajal. Tidak seorang pun yang dapat menolong orang-orang yang telah menganiaya diri mereka dengan mempersekutukan Allah, dan tidak ada pembela yang memintakan syafaat.",
      "text_translation": "Dan berilah mereka peringatan akan hari yang semakin dekat (hari Kiamat, yaitu) ketika hati (menyesak) sampai di kerongkongan karena menahan kesedihan. Tidak ada seorang pun teman setia bagi orang yang zalim dan tidak ada baginya seorang penolong yang diterima (pertolongannya).",
      "text": "وَاَنْذِرْهُمْ يَوْمَ الْاٰزِفَةِ اِذِ الْقُلُوْبُ لَدَى الْحَنَاجِرِ كَاظِمِيْنَ ەۗ مَا لِلظّٰلِمِيْنَ مِنْ حَمِيْمٍ وَّلَا شَفِيْعٍ يُّطَاعُۗ",
      "text_translation_en": "Hence, warn them of that Day which draws ever nearer, when the hearts will chokingly come up to the throats: no loving friend will the evildoers have, nor any intercessor who would be heeded:",
      "juz_number": 24
    },
    "19": {
      "text_tafsir_en": "In this verse, God explains that He knows the treacherous eyes and the treacherous. The treacherous eye is the sight of things that are secretly forbidden to be known to others. Ibn 'Abbas gives an example of the eyes of a traitor, as narrated by Ibn Abi atim, Ibn Abi Syaibah, and Ibn al-Mundzir that a person is in the midst of his people, so a woman passes by them. He showed his people that he closed his eyes and did not see the woman passing by. When his people didn't notice him, he opened his eyes to the woman. But when his people saw him, they bowed down and hid themselves. God knows that in the heart of the man is hidden the desire to see the passing of the woman. The Word of God: And Allah is full of knowledge. (at-Tagabun \/ 64: 4) And His word is: Say, \"If you hide what is in your heart or you say it, God will know.\" (ali 'Imran \/ 3: 29) If what is hidden as a whisper of the heart is known to God, it is much more real and present in our being, in heaven and on earth, that is descended from heaven and what ascends from it. Allah says: \"He knows what is before them and what is behind them\" (al-Baqarah \/ 2: 255) And He says: He knows what is in the heavens and the earth, and He knows what you conceive and what you you mentioned. (at-Tagabun \/ 64: 4) And again He says: He knows what is in the earth, what is out of it, what is coming down from heaven, and what is ascending to it. (Saba '\/ 34: 2)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Dia mengetahui penglihatan mata yang khianat dan pandangan yang curang. Mata yang khianat adalah penglihatan mata pada hal-hal yang diharamkan dengan sembunyi-sembunyi agar tidak diketahui orang lain.\n\nIbnu 'Abbas memberikan contoh penglihatan mata seorang yang khianat, sebagaimana diriwayatkan oleh Ibnu Abi hatim, Ibnu Abi Syaibah, dan Ibnu al-Mundzir bahwa seseorang berada di tengah-tengah kaumnya, maka lewatlah di dekat mereka seorang perempuan. Ia memperlihatkan kepada kaumnya bahwa ia memejamkan matanya dan tidak melihat wanita yang lewat itu. Kalau kaumnya tidak memerhatikannya, ia membuka matanya melihat wanita itu. Tetapi kalau kaumnya melihat dia, ia menunduk lagi menyembunyikan pandangannya. Allah mengetahui bahwa di dalam hati laki-laki itu tersembunyi niat ingin melihat aurat wanita yang lewat itu. Firman Allah:\n\nDan Allah Maha Mengetahui segala isi hati. (at-Tagabun\/64: 4)\n\nDan firman-Nya:\n\nKatakanlah, \"Jika kamu sembunyikan apa yang ada dalam hatimu atau kamu nyatakan, Allah pasti mengetahuinya.\" (ali 'Imran\/3: 29)\n\nKalau yang tersembunyi seperti bisikan hati diketahui oleh Allah, tentunya lebih-lebih lagi yang nyata dan ada di sekitar kita, yang ada di langit dan di bumi, yang diturunkan dari langit dan apa yang naik daripadanya sebagaimana firman Allah:\n\n¦ Dia mengetahui apa yang di hadapan mereka dan apa yang di belakang mereka¦ (al-Baqarah\/2: 255)\n\nDan firman-Nya:\n\nDia mengetahui apa yang di langit dan di bumi, dan mengetahui apa yang kamu rahasiakan dan apa yang kamu nyatakan. (at-Tagabun\/64: 4)\n\nDan firman-Nya lagi:\n\nDia mengetahui apa yang masuk ke dalam bumi, apa yang keluar darinya, apa yang turun dari langit dan apa yang naik kepadanya. (Saba'\/34: 2)",
      "text_translation": "Dia mengetahui (pandangan) mata yang khianat dan apa yang tersembunyi dalam dada.",
      "text": "يَعْلَمُ خَاۤىِٕنَةَ الْاَعْيُنِ وَمَا تُخْفِى الصُّدُوْرُ",
      "text_translation_en": "[for] He is aware of the [most] stealthy glance, and of all that the hearts would conceal.",
      "juz_number": 24
    },
    "20": {
      "text_tafsir_en": "In this verse, God explains that He will justly punish those who are treacherous and blind, and who hide in their hearts evil thoughts and desires. God rewards those who close their eyes to avoid being banned, and painful rewards for those who repeat their sight and decide in their hearts will do something prohibited in religion. No one was harmed. As a result of one's actions they will return to each other, not to be mistreated as the Word of God says: He who does good will be rewarded to himself and whoever does evil will be responsible for himself. And your Lord never wronged his servants. (Fushshilat \/ 41: 46) As for the idols and other idols worshiped by the muslims, they are powerless and cannot condemn anything, for they know nothing and have no power. At the end of this verse, it is affirmed that Allah is the All-Hearing, whether real or whispered or even whispered in the heart, He hears it. Allah is All-seeing in all that one does in a light or dark place.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Dia akan menghukum dengan adil orang-orang yang khianat dan curang penglihatan matanya, dan yang menyembunyikan dalam hatinya niat-niat dan keinginan yang jahat. Allah memberi balasan surga kepada orang-orang yang memejamkan matanya untuk menghindari melihat yang diharamkan, dan balasan siksa yang pedih bagi orang-orang yang mengulang-ulang penglihatannya dan menetapkan dalam hatinya akan mengerjakan sesuatu yang dilarang agama. Tak seorang pun yang dirugikan. Akibat perbuatan seseorang itu akan kembali kepada dirinya masing-masing, tak akan dianiaya sedikit pun sebagaimana firman Allah:\n\nBarang siapa mengerjakan kebajikan maka (pahalanya) untuk dirinya sendiri dan barang siapa berbuat jahat maka (dosanya) menjadi tanggungan dirinya sendiri. Dan Tuhanmu sama sekali tidak menzalimi hamba-hamba-Nya. (Fushshilat\/41: 46)\n\nAdapun berhala-berhala dan sembahan-sembahan lain yang disembah oleh kaum musyrikin, tidak berdaya dan tidak dapat menghukum dengan sesuatu apa pun, karena mereka itu tidak tahu apa-apa dan tidak mempunyai kekuasaan sedikit pun. Pada akhir ayat ini, ditegaskan bahwa Allah itu Maha Mendengar segala ucapan, baik yang nyata maupun secara berbisik-bisik bahkan bisikan hati pun, Ia mendengarnya. Allah Maha Melihat semua yang diperbuat seseorang baik di tempat yang terang maupun di tempat yang gelap.",
      "text_translation": "Dan Allah memutuskan dengan kebenaran. Sedang mereka yang disembah selain-Nya tidak mampu memutuskan dengan sesuatu apa pun. Sesungguhnya Allah, Dialah Yang Maha Mendengar, Maha Melihat.",
      "text": "وَاللّٰهُ يَقْضِيْ بِالْحَقِّ ۗوَالَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِهٖ لَا يَقْضُوْنَ بِشَيْءٍ ۗاِنَّ اللّٰهَ هُوَ السَّمِيْعُ الْبَصِيْرُ ࣖ",
      "text_translation_en": "And God will judge in accordance with truth and justice, whereas those [beings] whom they invoke beside Him cannot judge at all: for, verily, God alone is all-hearing, all-seeing.",
      "juz_number": 24
    },
    "21": {
      "text_tafsir_en": "In this verse, the disbelievers of Mecca who denied the truth of Muhammad's treatise were asked to come to the ruins of the history of the ancient nations that God had destroyed. They can see it every time they pass the place on a trade trip north or south. They are nations that are physically stronger than the pagans of Mecca, such as the 'Ad, Samud, and others. In addition to being physically stronger, they are also blessed with God of prosperity, abundant population, excellence in building, expertise in agriculture, and so on so that they are advanced and culturally advanced. However, the progress and high culture they possessed made them arrogant and forgot the land and lied to the apostles who were sent to them, even among those whom they hurt and even killed. Because of sin and treatment beyond that limit, God punished them. Their farms were destroyed, the magnificent buildings were laid waste, and the property was destroyed, and they suffered misery. Nothing can stop the devastation they are experiencing, and nothing can save them from suffering. It should be a lesson for the disbelievers of Mecca, and anyone who comes after them, that the disobedient man must be punished by God, both in this world and in the Hereafter.",
      "text_tafsir": "Dalam ayat ini, kaum kafir Mekah yang mengingkari kebenaran risalah Nabi Muhammad diminta untuk mendatangi puing-puing peninggalan sejarah umat-umat terdahulu yang telah dimusnahkan Allah. Mereka dapat menyaksikannya setiap kali melewati tempat tersebut dalam perjalanan dagang ke utara atau selatan. Mereka adalah bangsa-bangsa yang lebih kuat fisiknya daripada kaum kafir Mekah, misalnya kaum 'Ad, kaum Samud, dan lain-lain. Di samping lebih kuat secara fisik, mereka juga dikaruniai Allah kemakmuran, penduduk yang banyak, keunggulan dalam membangun, keahlian dalam pertanian, dan sebagainya sehingga mereka maju dan berkebudayaan tinggi. Akan tetapi, kemajuan dan kebudayaan tinggi yang mereka miliki itu membuat mereka sombong dan lupa daratan lalu mendustai para rasul yang diutus kepada mereka, bahkan di antara para rasul itu ada yang mereka lukai bahkan dibunuh. Karena dosa dan perlakuan di luar batas itulah, Allah menjatuhkan hukuman kepada mereka. Pertanian mereka dihancurkan, bangunan-bangunan megah diluluhlantakkan, dan harta benda dimusnahkan, sehingga mereka menderita dan sengsara. Tidak ada yang dapat menghentikan kehancuran yang mereka alami, dan tidak ada yang dapat menolong mereka dari penderitaan. Hal itu hendaknya menjadi pelajaran bagi kaum kafir Mekah, dan siapa saja yang datang sesudah mereka, bahwa manusia yang ingkar pastilah dihukum Allah, baik di dunia maupun di akhirat.",
      "text_translation": "Dan apakah mereka tidak mengadakan perjalanan di bumi, lalu memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka? Orang-orang itu lebih hebat kekuatannya daripada mereka dan (lebih banyak) peninggalan-peninggalan (peradaban)nya di bumi, tetapi Allah mengazab mereka karena dosa-dosanya. Dan tidak akan ada sesuatu pun yang melindungi mereka dari (azab) Allah.",
      "text": "۞ اَوَلَمْ يَسِيْرُوْا فِى الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ كَانُوْا مِنْ قَبْلِهِمْ ۗ كَانُوْا هُمْ اَشَدَّ مِنْهُمْ قُوَّةً وَّاٰثَارًا فِى الْاَرْضِ فَاَخَذَهُمُ اللّٰهُ بِذُنُوْبِهِمْ ۗوَمَا كَانَ لَهُمْ مِّنَ اللّٰهِ مِنْ وَّاقٍ",
      "text_translation_en": "Have they, then, never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time? Greater were they in power than they are, and in the impact which they left on earth: but God took them to task for their sins, and they had none to defend them against God:",
      "juz_number": 24
    },
    "22": {
      "text_tafsir_en": "The main reason Allah dropped the punishment was their disbelief. They do not want to accept the truth that the apostles brought, that there is no God but Allah, humans need to do good in life in this world, and there is a day later where humans will receive rewards for their actions. What the prophets conveyed is true truth and cannot be denied, but they oppose it. When God punishes, then His punishment is very harsh. Because of that defiance, God destroyed them. That is the result of defiance of religious truth. These events should be a lesson for Meccan infidels who disobeyed the Prophet Muhammad's invitation. They should immediately wake up and stop their iniquity because they too can suffer the same fate as the previous people.",
      "text_tafsir": "Sebab utama Allah menjatuhkan azab itu adalah kekafiran mereka. Mereka tidak mau menerima kebenaran yang dibawa para rasul, bahwa tidak ada Tuhan selain Allah, manusia perlu berbuat baik dalam hidup di dunia ini, dan adanya hari kemudian tempat manusia menerima balasan perbuatannya. \n\nApa yang disampaikan para nabi itu adalah kebenaran sejati dan tidak dapat dibantah, tetapi mereka menentangnya. Bila Allah menghukum, maka hukuman-Nya amat keras. Karena pembangkangan itu, Allah menghancurkan mereka. Itulah akibat pembangkangan terhadap kebenaran agama. Peristiwa-peristiwa itu hendaknya menjadi pelajaran bagi kaum kafir Mekah yang membangkang kepada ajakan Nabi Muhammad. Mereka hendaknya segera sadar dan berhenti dari kedurhakaan mereka karena mereka pun bisa mengalami nasib yang sama seperti umat-umat terdahulu itu.",
      "text_translation": "Yang demikian itu adalah karena sesungguhnya rasul-rasul telah datang kepada mereka dengan membawa bukti-bukti yang nyata lalu mereka ingkar; maka Allah mengazab mereka. Sungguh, Dia Mahakuat, Mahakeras hukuman-Nya.",
      "text": "ذٰلِكَ بِاَنَّهُمْ كَانَتْ تَّأْتِيْهِمْ رُسُلُهُمْ بِالْبَيِّنٰتِ فَكَفَرُوْا فَاَخَذَهُمُ اللّٰهُ ۗاِنَّهٗ قَوِيٌّ شَدِيْدُ الْعِقَابِ",
      "text_translation_en": "this, because their apostles had come to them with all evidence of the truth, and yet they rejected it: and so God took them to task - for, verily, He is powerful, severe in retribution!",
      "juz_number": 24
    },
    "23": {
      "text_tafsir_en": "In these two verses it is stated that Moses was sent by God as His Messenger to Pharaoh, Haman, and Karun to call upon them to believe. Pharaoh was the Egyptian king who viewed himself as God. Haman is his prime minister. Whereas Karun was the richest merchant and wealthy at that time. The three are specifically mentioned in this verse, as they are personally responsible for the influence they placed on the Egyptians to reject Moses and worship Pharaoh. When all three of them believed, the Egyptians would believe again. Moses sent them by the teachings of the scriptures and the miracles that were given to him. The essence of the teaching that Moses conveyed to them was to believe in the One True God, to do good, and to believe in the future of mankind in return for their deeds. His miracles include a stick to a snake and a glowing hand. Instead, they rejected that teaching and rebelled, even declaring themselves God. The sequence of events of Moses' preaching to the Pharaoh is mentioned in the following verses: Has the story of Moses (Muhammad) come to you? When the Lord called him (Moses) in the holy valley, the Old Valley; go to Pharaoh! Verily, he has transgressed. Then say (to Pharaoh), \"Is it your desire to cleanse yourself (from error), and lead me in the path of your Lord that you may fear Him?\" Then (Moses) showed him a great miracle. But he (Pharaoh) refused and refused. Then he turned and tried to challenge (Moses). Then he gathered (his princes) and called out (called his people). (Seraya) said, \"I am your supreme god.\" Then Allah will punish him with the punishment of the hereafter and the torment of the world. Indeed, there is a lesson for those who fear (to Allah). (an-Nazi'at \/ 79: 15-26) Seeing the miracle of Moses and his call for it, Pharaoh accused Moses of being a great witch and a liar. In another verse it is said that Pharaoh accused Moses of witchcraft and madness: But he (Pharaoh) with his army turned and said, \"He is a witch or a madman.\" (adz-dzariyat \/ 51: 39) The accusation was made by Pharaoh after his magicians were unable to defeat the miracle of Moses, his stick that turned into a snake and swallowed snakes that came from mines that were cast by experts the magic. Even the wizards turned away from Pharaoh and believed in God.",
      "text_tafsir": "Dalam dua ayat ini ditegaskan bahwa Nabi Musa diutus Allah sebagai Rasul-Nya kepada Fir'aun, Haman, dan Karun untuk menyeru mereka beriman. Fir'aun adalah Raja Mesir yang memandang dirinya Tuhan. Haman adalah perdana menterinya. Sedangkan Karun adalah saudagar dan hartawan terkaya pada waktu itu. Mereka bertiga disebutkan secara khusus dalam ayat ini, karena merekalah secara pribadi yang bertanggung jawab atas pengaruh yang mereka tanamkan pada penduduk Mesir agar mendustakan Nabi Musa dan menyembah kepada Fir'aun. Bila ketiga orang ini sudah beriman, maka rakyat Mesir akan segera beriman pula.\n\nNabi Musa diutus Allah kepada mereka dengan membawa ajaran-ajaran dalam kitab suci Taurat dan mukjizat-mukjizat yang diberikan kepadanya. Inti ajaran yang disampaikan Nabi Musa kepada mereka adalah agar beriman kepada Tuhan Yang Maha Esa, berbuat baik, dan beriman dengan adanya hari kemudian tempat manusia menerima balasan amalnya. Mukjizatnya antara lain tongkat menjadi ular dan tangannya yang bercahaya. Akan tetapi, mereka menolak ajaran itu dan membangkang, bahkan menyatakan dirinya Tuhan. Rentetan peristiwa dakwah Nabi Musa terhadap Fir'aun itu antara lain diungkapkan dalam ayat-ayat berikut:\n\nSudahkah sampai kepadamu (Muhammad) kisah Musa? Ketika Tuhan memanggilnya (Musa) di lembah suci yaitu Lembah Tuwa; pergilah engkau kepada Fir'aun! Sesungguhnya dia telah melampaui batas, Maka katakanlah (kepada Fir'aun), \"Adakah keinginanmu untuk membersihkan diri (dari kesesatan), dan engkau akan kupimpin ke jalan Tuhanmu agar engkau takut kepada-Nya?\" Lalu (Musa) memperlihatkan kepadanya mukjizat yang besar. Tetapi dia (Fir'aun) mendustakan dan mendurhakai. Kemudian dia berpaling seraya berusaha menantang (Musa). Kemudian dia mengumpulkan (pembesar-pembesarnya) lalu berseru (memanggil kaumnya). (Seraya) berkata, \"Akulah tuhanmu yang paling tinggi.\" Maka Allah menghukumnya dengan azab di akhirat dan siksaan di dunia. Sungguh, pada yang demikian itu terdapat pelajaran bagi orang yang takut (kepada Allah). (an-Nazi'at\/79: 15-26)\n\nMenyaksikan mukjizat Nabi Musa dan ajakannya untuk beriman itu, Fir'aun menuduh bahwa Nabi Musa seorang pesihir dan pembohong besar. Dalam ayat lain disebutkan bahwa Fir'aun menuduh Nabi Musa pesihir dan gila:\n\nTetapi dia (Fir'aun) bersama bala tentaranya berpaling dan berkata, \"Dia adalah seorang pesihir atau orang gila.\" (adz-dzariyat\/51:39) \n\nTuduhan itu disampaikan Fir'aun setelah ahli-ahli sihirnya tidak mampu mengalahkan mukjizat Nabi Musa, yaitu tongkatnya yang berubah menjadi ular dan menelan ular-ular yang berasal dari tambang-tambang yang disihir oleh ahli-ahli sihir tersebut. Bahkan ahli-ahli sihir itu berbalik meninggalkan Fir'aun dan beriman kepada Allah.",
      "text_translation": "Dan sungguh, Kami telah mengutus Musa dengan membawa ayat-ayat Kami dan keterangan yang nyata,",
      "text": "وَلَقَدْ اَرْسَلْنَا مُوسٰى بِاٰيٰتِنَا وَسُلْطٰنٍ مُّبِيْنٍۙ",
      "text_translation_en": "THUS, INDEED, did We send Moses with Our mes­sages and a manifest authority [from Us]",
      "juz_number": 24
    },
    "24": {
      "text_tafsir_en": "In these two verses it is stated that Moses was sent by God as His Messenger to Pharaoh, Haman, and Karun to call upon them to believe. Pharaoh was the Egyptian king who viewed himself as God. Haman is his prime minister. Whereas Karun was the richest merchant and wealthy at that time. The three are specifically mentioned in this verse, as they are personally responsible for the influence they placed on the Egyptians to reject Moses and worship Pharaoh. When all three of them believed, the Egyptians would believe again. Moses sent them by the teachings of the scriptures and the miracles that were given to him. The essence of the teaching that Moses conveyed to them was to believe in the One True God, to do good, and to believe in the future of mankind in return for their deeds. His miracles include a stick to a snake and a glowing hand. Instead, they rejected that teaching and rebelled, even declaring themselves God. The sequence of events of Moses' preaching to the Pharaoh is mentioned in the following verses: Has the story of Moses (Muhammad) come to you? When the Lord called him (Moses) in the holy valley, the Old Valley; go to Pharaoh! Verily, he has transgressed. Then say (to Pharaoh), \"Is it your desire to cleanse yourself (from error), and lead me in the path of your Lord that you may fear Him?\" Then (Moses) showed him a great miracle. But he (Pharaoh) refused and refused. Then he turned and tried to challenge (Moses). Then he gathered (his princes) and called out (called his people). (Seraya) said, \"I am your supreme god.\" Then Allah will punish him with the punishment of the hereafter and the torment of the world. Indeed, there is a lesson for those who fear (to Allah). (an-Nazi'at \/ 79: 15-26) Seeing the miracle of Moses and his call for it, Pharaoh accused Moses of being a great witch and a liar. In another verse it is said that Pharaoh accused Moses of witchcraft and madness: But he (Pharaoh) with his army turned and said, \"He is a witch or a madman.\" (adz-dzariyat \/ 51: 39) The accusation was made by Pharaoh after his magicians were unable to defeat the miracle of Moses, his stick that turned into a snake and swallowed snakes that came from mines that were cast by experts the magic. Even the wizards turned away from Pharaoh and believed in God.",
      "text_tafsir": "Dalam dua ayat ini ditegaskan bahwa Nabi Musa diutus Allah sebagai Rasul-Nya kepada Fir'aun, Haman, dan Karun untuk menyeru mereka beriman. Fir'aun adalah Raja Mesir yang memandang dirinya Tuhan. Haman adalah perdana menterinya. Sedangkan Karun adalah saudagar dan hartawan terkaya pada waktu itu. Mereka bertiga disebutkan secara khusus dalam ayat ini, karena merekalah secara pribadi yang bertanggung jawab atas pengaruh yang mereka tanamkan pada penduduk Mesir agar mendustakan Nabi Musa dan menyembah kepada Fir'aun. Bila ketiga orang ini sudah beriman, maka rakyat Mesir akan segera beriman pula.\n\nNabi Musa diutus Allah kepada mereka dengan membawa ajaran-ajaran dalam kitab suci Taurat dan mukjizat-mukjizat yang diberikan kepadanya. Inti ajaran yang disampaikan Nabi Musa kepada mereka adalah agar beriman kepada Tuhan Yang Maha Esa, berbuat baik, dan beriman dengan adanya hari kemudian tempat manusia menerima balasan amalnya. Mukjizatnya antara lain tongkat menjadi ular dan tangannya yang bercahaya. Akan tetapi, mereka menolak ajaran itu dan membangkang, bahkan menyatakan dirinya Tuhan. Rentetan peristiwa dakwah Nabi Musa terhadap Fir'aun itu antara lain diungkapkan dalam ayat-ayat berikut:\n\nSudahkah sampai kepadamu (Muhammad) kisah Musa? Ketika Tuhan memanggilnya (Musa) di lembah suci yaitu Lembah Tuwa; pergilah engkau kepada Fir'aun! Sesungguhnya dia telah melampaui batas, Maka katakanlah (kepada Fir'aun), \"Adakah keinginanmu untuk membersihkan diri (dari kesesatan), dan engkau akan kupimpin ke jalan Tuhanmu agar engkau takut kepada-Nya?\" Lalu (Musa) memperlihatkan kepadanya mukjizat yang besar. Tetapi dia (Fir'aun) mendustakan dan mendurhakai. Kemudian dia berpaling seraya berusaha menantang (Musa). Kemudian dia mengumpulkan (pembesar-pembesarnya) lalu berseru (memanggil kaumnya). (Seraya) berkata, \"Akulah tuhanmu yang paling tinggi.\" Maka Allah menghukumnya dengan azab di akhirat dan siksaan di dunia. Sungguh, pada yang demikian itu terdapat pelajaran bagi orang yang takut (kepada Allah). (an-Nazi'at\/79: 15-26)\n\nMenyaksikan mukjizat Nabi Musa dan ajakannya untuk beriman itu, Fir'aun menuduh bahwa Nabi Musa seorang pesihir dan pembohong besar. Dalam ayat lain disebutkan bahwa Fir'aun menuduh Nabi Musa pesihir dan gila:\n\nTetapi dia (Fir'aun) bersama bala tentaranya berpaling dan berkata, \"Dia adalah seorang pesihir atau orang gila.\" (adz-dzariyat\/51:39) \n\nTuduhan itu disampaikan Fir'aun setelah ahli-ahli sihirnya tidak mampu mengalahkan mukjizat Nabi Musa, yaitu tongkatnya yang berubah menjadi ular dan menelan ular-ular yang berasal dari tambang-tambang yang disihir oleh ahli-ahli sihir tersebut. Bahkan ahli-ahli sihir itu berbalik meninggalkan Fir'aun dan beriman kepada Allah.",
      "text_translation": "kepada Fir‘aun, Haman dan Karun; lalu mereka berkata, “(Musa) itu seorang pesihir dan pendusta.”",
      "text": "اِلٰى فِرْعَوْنَ وَهَامٰنَ وَقَارُوْنَ فَقَالُوْا سٰحِرٌ كَذَّابٌ",
      "text_translation_en": "unto Pharaoh, and Haman, and Qarun; but they [only] said, “A spellbinder is he, a liar!”",
      "juz_number": 24
    },
    "25": {
      "text_tafsir_en": "Prophet Musa explained to Fir'awn, Haman, and Karun about God as God Almighty and the human obligation to believe and do good, and about His apostolate. However, they were very angry. They did not want to accept what Moses said because it was contrary to the belief that had been instilled in the Egyptian population that God was Fir'awn. Also because the teachings brought by Moses could endanger their power and position. Then they ordered that the sons of the Children of Israel be killed and leave the lives of their daughters. The command to kill the sons of the Children of Israel was the second commandment. The first command was issued by Pharaoh on the advice of his astrologers who envisaged his dream that from the Children of Israel a son would be born who would overthrow him and tear down his kingdom. The purpose of the murder was to weaken the Children of Israel, because their men would be exhausted, while their women would be controlled. It also aims to wipe out the ethnic Children of Israel from the land of Egypt because they can defeat the native Egyptians themselves. However, God has other plans. With His plan, Allah made Moses, who was still a baby, raised and raised in the palace of Pharaoh himself as his son. As an adult, Moses had to get out of Egypt because his life was threatened by killing an Egyptian. The second commandment of the murder of every baby boy of the Children of Israel was issued by Pharaoh after the Prophet Musa returned to Egypt as a prophet who was commanded by Allah to awaken Fir'awn and invite him to believe. According to Ibn Kathir, the aim of Pharaoh to kill the Children of Israel was to instill dissatisfaction among the followers of the Prophet Musa himself against him. Because with the threat of killing the second time, it means that the Prophet Moses had caused two difficulties for them, first when the Prophet Moses was not born and second after he became the prophet who called for Pharaoh. In the mind of Pharaoh, if the Children of Israel were not satisfied with him, then the Prophet Moses would be defeated by his own people. That possibility is related in the Qur'an: They (the people of Musa) said, \"We were oppressed (by Fir'awn) before you came to us and after you came.\" (Moses) replied, \"May your Lord destroy your enemies and make you caliphs on earth; then He will see how you do.\" (al-A.'raf \/ 7: 129). However, that intention was not achieved. The second plan to kill the sons of the Children of Israel failed miserably, because Allah sent down various calamities as His punishment, such as the coming of a typhoon, the appearance of locusts, fleas, frogs, and water that turned into blood (see al-A .'raf \/ 7: 133). The intention to prevent people from believing in the Prophet Moses and the teachings he delivered also did not work, because the truth could not be denied and the will of God must have happened as He said: God has decreed, \"I and my apostles must have won.\" Truly, Allah is all-powerful, almighty. (al-Mujadilah \/ 58: 21)",
      "text_tafsir": "Nabi Musa menjelaskan kepada Fir'aun, Haman, dan Karun tentang Allah sebagai Tuhan Yang Maha Esa dan kewajiban manusia untuk beriman dan berbuat baik, serta tentang kerasulan-Nya. Akan tetapi, mereka marah sekali. Mereka tidak mau menerima apa yang disampaikan Nabi Musa karena bertentangan dengan kepercayaan yang sudah ditanamkan kepada penduduk Mesir bahwa Tuhan itu adalah Fir'aun. Juga karena ajaran yang dibawa Nabi Musa bisa membahayakan kekuasaan dan kedudukan mereka. Lalu mereka memerintahkan agar anak-anak laki-laki Bani Israil dibunuh dan membiarkan hidup anak-anak perempuan mereka.\n\nPerintah membunuh anak-anak laki-laki Bani Israil itu adalah perintah kedua. Perintah pertama dikeluarkan Fir'aun atas nasihat ahli-ahli nujumnya yang menakwil mimpinya bahwa dari kalangan Bani Israil akan lahir seorang anak laki-laki yang akan menggulingkannya dan meruntuhkan kerajaannya. Maksud pembunuhan itu adalah untuk melemahkan Bani Israil, karena kaum laki-laki mereka akan habis, sedangkan kaum perempuan mereka akan dapat dikuasai. Juga bertujuan untuk memusnahkan etnis Bani Israil dari bumi Mesir karena mereka bisa mengalahkan penduduk asli Mesir sendiri. Akan tetapi, Allah mempunyai rencana lain. Dengan rencana-Nya, Allah justru membuat Musa yang masih bayi diasuh dan dibesarkan di istana Fir'aun sendiri sebagai anaknya. Setelah dewasa, Musa harus keluar dari Mesir karena jiwanya terancam akibat membunuh seorang Mesir. \n\nPerintah kedua pembunuhan setiap bayi laki-laki Bani Israil ini dikeluarkan Fir'aun setelah Nabi Musa kembali ke Mesir sebagai nabi yang diperintahkan Allah untuk menyadarkan Fir'aun dan mengajaknya untuk beriman. Menurut Ibnu Katsir, tujuan Fir'aun hendak membunuh anak laki-laki Bani Israil itu adalah untuk menanamkan rasa tidak puas di kalangan para pengikut Nabi Musa sendiri terhadapnya. Sebab dengan ancaman pembunuhan kedua kali itu, berarti Nabi Musa telah mengakibatkan dua kali kesulitan bagi mereka, pertama ketika Nabi Musa belum lahir dan kedua setelah beliau menjadi nabi yang menyeru Fir'aun. Dalam pikiran Fir'aun, bila Bani Israil tidak puas kepadanya, maka Nabi Musa akan dikalahkan oleh bangsanya sendiri. Kemungkinan itu dikisahkan dalam Al-Qur'an:\n\nMereka (kaum Musa) berkata,\"Kami telah ditindas (oleh Fir'aun) sebelum engkau datang kepada kami dan setelah engkau datang.\" (Musa) menjawab, \"Mudah-mudahan Tuhanmu membinasakan musuhmu dan menjadikan kamu khalifah di bumi; maka Dia akan melihat bagaimana perbuatanmu.\" (al-A.'raf\/7: 129). \n\nAkan tetapi, maksud itu tidak tercapai. Rencana kedua kalinya untuk membunuhi anak-anak laki-laki Bani Israil gagal total, karena Allah menurunkan berbagai musibah sebagai azab-Nya, seperti datangnya topan dahsyat, munculnya serangan belalang, kutu, katak, dan air yang berubah menjadi darah (lihat al-A.'raf\/7: 133). Maksud untuk menghalang-halangi manusia dari beriman kepada Nabi Musa dan ajaran yang disampaikannya juga tidak berhasil, karena kebenaran tidak mungkin ditampik dan kehendak Allah pasti terjadi sebagaimana difirmankan-Nya:\n\nAllah telah menetapkan, \"Aku dan rasul-rasul-Ku pasti menang.\" Sungguh, Allah Mahakuat, Mahaperkasa. (al-Mujadilah\/58: 21)",
      "text_translation": "Maka ketika dia (Musa) datang kepada mereka membawa kebenaran dari Kami, mereka berkata, “Bunuhlah anak-anak laki-laki dari orang-orang yang beriman bersama dia dan biarkan hidup perempuan-perempuan mereka.” Namun tipu daya orang-orang kafir itu sia-sia belaka.",
      "text": "فَلَمَّا جَاۤءَهُمْ بِالْحَقِّ مِنْ عِنْدِنَا قَالُوا اقْتُلُوْٓا اَبْنَاۤءَ الَّذِيْنَ اٰمَنُوْا مَعَهٗ وَاسْتَحْيُوْا نِسَاۤءَهُمْ ۗوَمَا كَيْدُ الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ",
      "text_translation_en": "Now [as for Pharaoh and his followers,] when he came to them, setting forth the truth from Us, they said, “Slay the sons of those who share his beliefs, and spare [only] their women!” - but the guile of those deniers of the truth could not lead to aught but failure.",
      "juz_number": 24
    },
    "26": {
      "text_tafsir_en": "Pharaoh not only intended to weaken the children of Israel and eradicate his ethnicity, but also to destroy the monotheistic religion by killing Moses himself. He told his followers that he was the one who was going to commit the murder and for that he asked not to be prevented. He was convinced that he could kill Moses immediately. Therefore, he challenged Moses to ask his God for help. The background of Pharaoh's plan to kill Moses was his concern that Moses would replace the Egyptian religion with the monotheism he taught. Or, he was afraid that Moses would change his people's beliefs, habits, and customs and eventually cause his people to rebel against him and that he would lose his power.",
      "text_tafsir": "Fir'aun tidak hanya bermaksud melemahkan Bani Israil dan melenyapkan etnisnya, tetapi juga hendak memusnahkan agama tauhid dengan membunuh Nabi Musa sendiri. Ia menyatakan kepada pengikut-pengikutnya bahwa ia sendiri yang akan melaksanakan pembunuhan itu dan untuk itu ia meminta supaya tidak dihalang-halangi. Ia yakin sekali dapat segera membunuh Nabi Musa. Oleh karena itu, ia menantang Nabi Musa supaya meminta bantuan kepada Tuhannya. \n\nLatar belakang rencana Fir'aun membunuh Nabi Musa itu adalah kekhawatirannya bahwa Nabi Musa akan menukar agama rakyat Mesir dengan agama tauhid yang diajarkannya. Atau, ia khawatir Nabi Musa akan mengubah kepercayaan, kebiasaan, dan adat istiadat rakyatnya dan akhirnya akan membuat rakyatnya terhasut untuk memberontak kepadanya sehingga ia akan kehilangan kekuasaannya.",
      "text_translation": "Dan Fir‘aun berkata (kepada pembesar-pembesarnya), “Biar aku yang membunuh Musa dan suruh dia memohon kepada Tuhannya. Sesungguhnya aku khawatir dia akan menukar agamamu atau menimbulkan kerusakan di bumi.”",
      "text": "وَقَالَ فِرْعَوْنُ ذَرُوْنِيْٓ اَقْتُلْ مُوْسٰى وَلْيَدْعُ رَبَّهٗ ۚاِنِّيْٓ اَخَافُ اَنْ يُّبَدِّلَ دِيْنَكُمْ اَوْ اَنْ يُّظْهِرَ فِى الْاَرْضِ الْفَسَادَ",
      "text_translation_en": "And Pharaoh said: “Leave it to me to slay Moses - and let him invoke his [alleged] sustainer! Behold, I fear lest he cause you to change your religion, or lest he cause corruption to prevail in the land!”",
      "juz_number": 24
    },
    "27": {
      "text_tafsir_en": "When the Prophet Musa got the news about Pharaoh's evil plan to kill him, he told his people that he was taking refuge in Allah, his Lord and their Lord as well. The prophet Musa was certain that Allah would protect him because he was on the right side, while Pharaoh was arrogant, evil, cruel, doing arbitrarily in Egypt, killing innocent people, and acknowledging himself as a god who must obey all his orders. Pharaoh's action was motivated by mistrust in the existence of the following day, where every act of the smallest would be held accountable. Pharaoh did not believe that there was a day later that he did not believe that if you act cruelly in this world, you will be rewarded later in the hereafter. Such is the result of disbelief. Humans will act arbitrarily in this nature, which can result in this nature being destroyed.",
      "text_tafsir": "Ketika Nabi Musa memperoleh berita tentang rencana jahat Fir'aun untuk membunuhnya, ia berkata kepada kaumnya bahwa ia berlindung kepada Allah, Tuhannya dan Tuhan mereka juga. Nabi Musa yakin bahwa Allah pasti akan melindunginya karena ia berada di pihak yang benar, sedangkan Fir'aun adalah orang sombong, jahat, kejam, berbuat semena-mena di Mesir, membunuhi orang-orang yang tidak bersalah, dan mengakui dirinya sebagai tuhan yang harus dipatuhi semua perintahnya. \n\nTindakan Fir'aun itu dilatarbelakangi ketidakpercayaan kepada adanya hari kemudian, dimana setiap perbuatan sekecil apa pun akan diminta pertanggungjawabannya. Fir'aun tidak percaya adanya hari kemudian itu sehingga ia tidak percaya bahwa bila bertindak kejam di dunia ini akan dibalas nanti di akhirat. Demikianlah akibat kekafiran. Manusia akan berlaku semena-mena di alam ini, yang bisa mengakibatkan alam ini hancur.",
      "text_translation": "Dan (Musa) berkata, “Sesungguhnya aku berlindung kepada Tuhanku dan Tuhanmu dari setiap orang yang menyombongkan diri yang tidak beriman kepada hari perhitungan.”",
      "text": "وَقَالَ مُوْسٰىٓ اِنِّيْ عُذْتُ بِرَبِّيْ وَرَبِّكُمْ مِّنْ كُلِّ مُتَكَبِّرٍ لَّا يُؤْمِنُ بِيَوْمِ الْحِسَابِ ࣖ ",
      "text_translation_en": "But Moses said: “With [Him who is] my Sus­tainer as well as your Sustainer have I indeed found refuge from everyone who, immersed in false pride, will not believe in [the coming of] the Day of Reckon­ing!”",
      "juz_number": 24
    },
    "28": {
      "text_tafsir_en": "The scholars have interpreted that the men of faith mentioned in this verse were Egyptian from the Pharaoh's family. His name is not clear, but Ibn Katsir narrates from Ibn Abi that he was the son of Pharaoh's Pharaoh who secretly believed in Moses. None of the pharaoh's family had faith except for the one mentioned in this verse and the wife of Pharaoh himself was Asiah. This is the man who told Moses about Pharaoh's evil plan to kill him. Such is the history of Ibn 'Abbas. However, al-Khazin, as well as the Nasafi recount from Ibn 'Abbas sources also that the man was named Sam'an or Habib. Others call it Kharbil or Hazbil. All the scholars agreed was that the man was Pharaoh's uncle's son. The man admonished Pharaoh wisely, \"Should he kill a man who claims to believe in God, while he has given his reasons and the clear evidence of what he believes.\" He goes on to say that if Moses lied, the consequences of his lies would be borne by him. However, if Moses was right, while he was tortured or killed, some of those who were tortured or killed would be accepted into this world as well, and he would eventually go to hell. He then asserted that God would not guide the people who do so in vain and in lying. That is, Moses believed and brought the evidence of his faith, while the false and the false were Pharaoh. Therefore, the one who will not receive any guidance is Pharaoh. Not receiving guidance means suffering in the world and in the hereafter will go to hell. Thus the one who will suffer in the world and go to hell in the hereafter is Pharaoh",
      "text_tafsir": "Para ulama tafsir meriwayatkan bahwa laki-laki beriman yang disebutkan dalam ayat ini adalah orang Mesir dari keluarga Fir'aun. Namanya tidak jelas, tetapi Ibnu Katsir meriwayatkan dari Ibnu Abi hatim bahwa ia adalah anak paman Fir'aun yang beriman secara sembunyi-sembunyi kepada Nabi Musa. Tidak ada di antara keluarga Fir'aun yang beriman selain orang yang disebutkan dalam ayat ini dan istri Fir'aun sendiri bernama Asiah. Laki-laki inilah yang menyampaikan kepada Nabi Musa tentang rencana jahat Fir'aun untuk membunuhnya. Demikian riwayat dari sumber Ibnu 'Abbas. Namun, al-Khazin, begitu juga an-Nasafi meriwayatkan dari sumber Ibnu 'Abbas juga bahwa laki-laki itu bernama Sam'an atau Habib. Ada pula yang menyebutnya Kharbil atau Hazbil. Yang disepakati ulama hanyalah bahwa laki-laki itu adalah anak paman Fir'aun. \n\nLaki-laki beriman itu menasihati Fir'aun dengan penuh kebijaksanaan, \"Patutkah membunuh seseorang yang menyatakan dirinya beriman kepada Allah, sedangkan ia telah menyampaikan alasan-alasan dan bukti-bukti nyata tentang yang diimaninya.\" Ia melanjutkan bahwa seandainya Nabi Musa berbohong, maka konsekuensi kebohongannya itu akan dipikul olehnya sendiri. Akan tetapi, bila Nabi Musa benar, sedangkan ia telah disiksa atau dibunuh, maka sebagian yang diancamkan kepada orang yang menyiksa atau membunuh itu akan diterima di dunia ini juga, dan di akhirat ia akan masuk neraka. \n\nIa kemudian menegaskan bahwa Allah tidak akan memberi petunjuk orang yang berbuat semena-semena dan berdusta. Artinya, Nabi Musa beriman dan membawa bukti-bukti imannya, sedangkan yang semena-mena dan dusta adalah Fir'aun. Oleh karena itu, yang tidak akan memperoleh petunjuk adalah Fir'aun. Tidak memperoleh petunjuk berarti akan sengsara di dunia dan di akhirat akan masuk neraka. Dengan demikian yang akan sengsara di dunia dan masuk neraka di akhirat adalah Fir'aun",
      "text_translation": "Dan seseorang yang beriman di antara keluarga Fir‘aun yang menyembunyikan imannya berkata, “Apakah kamu akan membunuh seseorang karena dia berkata, “Tuhanku adalah Allah,” padahal sungguh, dia telah datang kepadamu dengan membawa bukti-bukti yang nyata dari Tuhanmu. Dan jika dia seorang pendusta maka dialah yang akan menanggung (dosa) dustanya itu; dan jika dia seorang yang benar, nis-caya sebagian (bencana) yang diancamkannya kepadamu akan menimpamu. Sesungguhnya Allah tidak memberi petunjuk kepada orang yang melampaui batas dan pendusta.",
      "text": "وَقَالَ رَجُلٌ مُّؤْمِنٌۖ مِّنْ اٰلِ فِرْعَوْنَ يَكْتُمُ اِيْمَانَهٗٓ اَتَقْتُلُوْنَ رَجُلًا اَنْ يَّقُوْلَ رَبِّيَ اللّٰهُ وَقَدْ جَاۤءَكُمْ بِالْبَيِّنٰتِ مِنْ رَّبِّكُمْ ۗوَاِنْ يَّكُ كَاذِبًا فَعَلَيْهِ كَذِبُهٗ ۚوَاِنْ يَّكُ صَادِقًا يُّصِبْكُمْ بَعْضُ الَّذِيْ يَعِدُكُمْ ۗاِنَّ اللّٰهَ لَا يَهْدِيْ مَنْ هُوَ مُسْرِفٌ كَذَّابٌ",
      "text_translation_en": "At that, a believing man of Pharaoh’s family, who [until then] had concealed his faith, exclaimed: “Would you slay a man because he says, ‘God is my Sustainer’ - seeing, withal, that he has brought you all evidence of this truth from your Sustainer? Now if he be a liar, his lie will fall back on him; but if he is a man of truth, something [of the punishment] whereof he warns you is bound to befall you: for, verily, God would not grace with His guidance one who has wasted his own self by lying [about Him].",
      "juz_number": 24
    },
    "29": {
      "text_tafsir_en": "Then the faithful men advised the people of Egypt that they had been given a great favor from God. Egypt has been a respected and influential empire. Therefore, the favor must be maintained by faith in Allah, and if they are disbelievers, then it is feared that the greatness will fall and they will suffer. \"Who will help us when disaster strikes?\" he said. Such was the advice of the believing men to Pharaoh and his people. But Pharaoh's advice was not accepted. He states that what he says is what he should accept and do, and what he says and does is good and right. Thus, Pharaoh pressed his will and acted accordingly. Pharaoh's answer was in fact incorrect, for in his heart he actually justified what Moses said. His words were only driven by his cruelty and arrogance as stated in the following verse: And they rejected him for his cruelty and arrogance, while their hearts believed (the truth). (an-Naml \/ 27: 14) What Pharaoh said that he commanded his people was good, so that Moses should be killed, too far from the truth. That is because it is not true that killing a person will solve the problem, let alone kill the Messenger of God. The act was misguided and misleading, as the following verse states: And Pharaoh deceived his people and gave them no guidance. (thaha \/ 20: 79). However, the followers of Pharaoh accepted and obeyed his orders, even as the following verse states: To Pharaoh and his leaders, but they obeyed Pharaoh's orders, though Pharaoh's orders were not true. (Hud \/ 11: 97) Pharaoh's actions to deceive his people and compel them to obey his commands, and to incite them to defile the Messenger of God, were a lesson for leaders. Leaders who want to hinder and distance the people from their religious teachings may experience the same fate as Pharaoh. In this case, the Messenger of Allah (may peace be upon him) advised: It is not the death of a priest (a leader), on the day of his death he deceived his people, but he would not smell heaven. Indeed the fragrance of heaven can be smelled from a distance of five hundred years. (History of al-Bukhari and Muslim)",
      "text_tafsir": "Selanjutnya laki-laki beriman itu menasihati kaumnya, rakyat Mesir bahwa mereka telah diberi nikmat yang besar oleh Allah. Mesir telah merupakan kerajaan besar yang disegani dan berpengaruh. Oleh karena itu, nikmat itu harus dipelihara dengan beriman kepada Allah, dan bila mereka juga kafir, maka dikhawatirkan kebesaran itu akan runtuh dan mereka akan menderita. \"Siapakah yang akan menolong kita bila bencana itu datang?\" katanya.\n\nDemikianlah nasihat laki-laki beriman itu kepada Fir'aun dan kaumnya. Tetapi nasihat itu tidak diterima Fir'aun. Ia menyatakan bahwa apa yang dikatakannya itulah yang harus diterima dan dilaksanakan, dan apa yang disampaikan dan diperintahkannya itulah yang baik dan benar. Dengan demikian, Fir'aun memaksakan kehendaknya dan lagi-lagi bertindak sewenang-wenang.\n\nJawaban Fir'aun itu sesungguhnya tidak benar, karena dalam hati sanubarinya, sebenarnya ia membenarkan apa yang disampaikan Nabi Musa. Ucapannya itu sesungguhnya hanya didorong oleh kezaliman dan kesombongannya sebagaimana dinyatakan ayat berikut:\n\nDan mereka mengingkarinya karena kezaliman dan kesombongannya, padahal hati mereka meyakini (kebenaran)nya. (an-Naml\/27: 14)\n\nApa yang dikatakan Fir'aun bahwa yang diperintahkannya kepada kaumnya adalah baik, sehingga Nabi Musa harus tetap dibunuh, juga jauh dari kebenaran. Hal itu karena tidaklah benar dengan membunuh seseorang persoalan akan selesai, apalagi yang dibunuh itu seorang rasul Allah. Tindakan itu justru sesat dan menyesatkan, sebagaimana dinyatakan ayat berikut:\n\nDan Fir'aun telah menyesatkan kaumnya dan tidak memberi petunjuk. (thaha\/20: 79).\n\nNamun demikian, para pengikut Fir'aun menerima dan mematuhi perintahnya sekalipun salah, sebagaimana diungkapkan ayat berikut:\n\nKepada Fir'aun dan para pemuka kaumnya, tetapi mereka mengikuti perintah Fir'aun, padahal perintah Fir'aun bukanlah (perintah) yang benar. (Hud\/11: 97)\n\nTindakan Fir'aun membohongi rakyatnya dan memaksa mereka mengikuti perintahnya, serta menghasut mereka untuk mendustai rasul Allah, menjadi pelajaran bagi para pemimpin. Pemimpin yang ingin menghalangi dan menjauhkan masyarakat dari ajaran-ajaran agama mereka boleh jadi akan mengalami nasib yang sama dengan Fir'aun. Dalam hal ini Rasulullah memberi nasihat:Tiadalah mati imam (seorang pemimpin), di mana pada hari kematiannya itu ia telah menipu rakyatnya, melainkan ia tidak akan mencium bau surga. Sesungguhnya keharuman surga itu bisa tercium dari jarak lima ratus tahun perjalanan. (Riwayat al-Bukhari dan Muslim)",
      "text_translation": "Wahai kaumku! Pada hari ini kerajaan ada padamu dengan berkuasa di bumi, tetapi siapa yang akan menolong kita dari azab Allah jika (azab itu) menimpa kita?” Fir‘aun berkata, “Aku hanya mengemukakan kepadamu, apa yang aku pandang baik; dan aku hanya menunjukkan kepadamu jalan yang benar.”",
      "text": "يٰقَوْمِ لَكُمُ الْمُلْكُ الْيَوْمَ ظَاهِرِيْنَ فِى الْاَرْضِۖ فَمَنْ يَّنْصُرُنَا مِنْۢ بَأْسِ اللّٰهِ اِنْ جَاۤءَنَا ۗقَالَ فِرْعَوْنُ مَآ اُرِيْكُمْ اِلَّا مَآ اَرٰى وَمَآ اَهْدِيْكُمْ اِلَّا سَبِيْلَ الرَّشَادِ",
      "text_translation_en": "“O my people! Yours is the dominion today, [and] most eminent are you on earth: but who will rescue us from God’s punishment, once it befalls us?” Said Pharaoh: “I but want to make you see what I see myself; and I would never make you follow any path but that of rectitude!”",
      "juz_number": 24
    },
    "30": {
      "text_tafsir_en": "The faithful men of the Pharaoh's family told his people that he was very worried that they would not believe and instead obeyed Pharaoh's orders. They will experience the same fate that has happened to the past. They opposed and rejected the messengers whom God had sent, such as the people of Noah, the 'Ad, Samud, and the people thereafter. They have all been destroyed by Allah in the form of doom, and no one can repel or save them. That's what yaumul ahzab is saying in this verse. Such is God's punishment for those who disbelieve in the world. God does not do harm to them, but they do harm themselves by taking actions that provoke His wrath. God was punished only when the apostles delivered his preaching perfectly, and they could not be repaired after repeated counsels. The event should be taught by the people. He hoped that his people would accept his advice and believe in Moses, not to oppose or even kill him.",
      "text_tafsir": "Laki-laki beriman dari keluarga Fir'aun itu menyampaikan kepada kaumnya bahwa ia khawatir sekali bila mereka tidak mau beriman dan sebaliknya mengikuti perintah Fir'aun. Mereka akan mengalami nasib yang sama seperti yang telah menimpa umat-umat terdahulu. Umat-umat itu menentang dan mendustakan para rasul yang diutus Allah, seperti umat Nabi Nuh, Kaum 'Ad, Samud, dan umat-umat setelahnya. Mereka semua telah dimusnahkan Allah dengan berbagai bencana sebagai azab, dan tidak ada seorang pun yang dapat menangkis atau menyelamatkan diri. Itulah yang dimaksud yaumul ahzab dalam ayat ini. \n\nDemikianlah hukuman Allah bagi mereka yang kafir di dunia. Allah tidak bertindak aniaya dengan pemusnahan itu, tetapi merekalah yang menganiaya diri mereka sendiri dengan melakukan tindakan-tindakan yang mengakibatkan murka-Nya. Allah baru menjatuhkan hukuman bila rasul telah menyampaikan dakwahnya dengan sempurna, dan mereka tidak dapat diperbaiki lagi setelah dinasihati berkali-kali. Peristiwa itu hendaknya dijadikan pelajaran oleh rakyatnya. Orang itu berharap nasihatnya diterima oleh kaumnya dan mereka beriman kepada Nabi Musa, tidak membangkang apalagi membunuhnya",
      "text_translation": "Dan orang yang beriman itu berkata, “Wahai kaumku! Sesungguhnya aku khawatir kamu akan ditimpa (bencana) seperti hari kehancuran golongan yang bersekutu,",
      "text": "وَقَالَ الَّذِيْٓ اٰمَنَ يٰقَوْمِ اِنِّيْٓ اَخَافُ عَلَيْكُمْ مِّثْلَ يَوْمِ الْاَحْزَابِۙ  ",
      "text_translation_en": "Thereupon exclaimed he who had attained to faith: “O my people! Verily, I fear for you the like of what one day befell those others who were leagued together [against God’s truth] –",
      "juz_number": 24
    },
    "31": {
      "text_tafsir_en": "The faithful men of the Pharaoh's family told his people that he was very worried that they would not believe and instead obeyed Pharaoh's orders. They will experience the same fate that has happened to the past. They opposed and rejected the messengers whom God had sent, such as the people of Noah, the 'Ad, Samud, and the people thereafter. They have all been destroyed by Allah in the form of doom, and no one can repel or save them. That's what yaumul ahzab is saying in this verse. Such is God's punishment for those who disbelieve in the world. God does not do harm to them, but they do harm themselves by taking actions that provoke His wrath. God was punished only when the apostles delivered his preaching perfectly, and they could not be repaired after repeated counsels. The event should be taught by the people. He hoped that his people would accept his advice and believe in Moses, not to oppose or even kill him.",
      "text_tafsir": "Laki-laki beriman dari keluarga Fir'aun itu menyampaikan kepada kaumnya bahwa ia khawatir sekali bila mereka tidak mau beriman dan sebaliknya mengikuti perintah Fir'aun. Mereka akan mengalami nasib yang sama seperti yang telah menimpa umat-umat terdahulu. Umat-umat itu menentang dan mendustakan para rasul yang diutus Allah, seperti umat Nabi Nuh, Kaum 'Ad, Samud, dan umat-umat setelahnya. Mereka semua telah dimusnahkan Allah dengan berbagai bencana sebagai azab, dan tidak ada seorang pun yang dapat menangkis atau menyelamatkan diri. Itulah yang dimaksud yaumul ahzab dalam ayat ini. \n\nDemikianlah hukuman Allah bagi mereka yang kafir di dunia. Allah tidak bertindak aniaya dengan pemusnahan itu, tetapi merekalah yang menganiaya diri mereka sendiri dengan melakukan tindakan-tindakan yang mengakibatkan murka-Nya. Allah baru menjatuhkan hukuman bila rasul telah menyampaikan dakwahnya dengan sempurna, dan mereka tidak dapat diperbaiki lagi setelah dinasihati berkali-kali. Peristiwa itu hendaknya dijadikan pelajaran oleh rakyatnya. Orang itu berharap nasihatnya diterima oleh kaumnya dan mereka beriman kepada Nabi Musa, tidak membangkang apalagi membunuhnya",
      "text_translation": "(yakni) seperti kebiasaan kaum Nuh, ’Ad, samud dan orang-orang yang datang setelah mereka. Padahal Allah tidak menghendaki kezaliman terhadap hamba-hamba-Nya.”",
      "text": "مِثْلَ دَأْبِ قَوْمِ نُوْحٍ وَّعَادٍ وَّثَمُوْدَ وَالَّذِيْنَ مِنْۢ بَعْدِهِمْ ۗوَمَا اللّٰهُ يُرِيْدُ ظُلْمًا لِّلْعِبَادِ",
      "text_translation_en": "the like of what happened to Noah’s people, and to [the tribes of] Ad and Thamud and those who came after them! And, withal, God does not will any wrong for His crea­tures.",
      "juz_number": 24
    },
    "32": {
      "text_tafsir_en": "The faithful men of the Pharaoh's family told his people that he was very worried that they would not believe and instead obeyed Pharaoh's orders. They will experience the same fate that has happened to the past. They opposed and rejected the messengers whom God had sent, such as the people of Noah, the 'Ad, Samud, and the people thereafter. They have all been destroyed by Allah in the form of doom, and no one can repel or save them. That's what yaumul ahzab is saying in this verse. Such is God's punishment for those who disbelieve in the world. God does not do harm to them, but they do harm themselves by taking actions that provoke His wrath. God was punished only when the apostles delivered his preaching perfectly, and they could not be repaired after repeated counsels. The event should be taught by the people. He hoped that his people would accept his advice and believe in Moses, not to oppose or even kill him.",
      "text_tafsir": "Laki-laki beriman dari keluarga Fir'aun itu menyampaikan kepada kaumnya bahwa ia khawatir sekali bila mereka tidak mau beriman dan sebaliknya mengikuti perintah Fir'aun. Mereka akan mengalami nasib yang sama seperti yang telah menimpa umat-umat terdahulu. Umat-umat itu menentang dan mendustakan para rasul yang diutus Allah, seperti umat Nabi Nuh, Kaum 'Ad, Samud, dan umat-umat setelahnya. Mereka semua telah dimusnahkan Allah dengan berbagai bencana sebagai azab, dan tidak ada seorang pun yang dapat menangkis atau menyelamatkan diri. Itulah yang dimaksud yaumul ahzab dalam ayat ini. \n\nDemikianlah hukuman Allah bagi mereka yang kafir di dunia. Allah tidak bertindak aniaya dengan pemusnahan itu, tetapi merekalah yang menganiaya diri mereka sendiri dengan melakukan tindakan-tindakan yang mengakibatkan murka-Nya. Allah baru menjatuhkan hukuman bila rasul telah menyampaikan dakwahnya dengan sempurna, dan mereka tidak dapat diperbaiki lagi setelah dinasihati berkali-kali. Peristiwa itu hendaknya dijadikan pelajaran oleh rakyatnya. Orang itu berharap nasihatnya diterima oleh kaumnya dan mereka beriman kepada Nabi Musa, tidak membangkang apalagi membunuhnya",
      "text_translation": "Dan wahai kaumku! Sesungguhnya aku benar-benar khawatir terhadapmu akan (siksaan) hari saling memanggil,",
      "text": "وَيٰقَوْمِ اِنِّيْٓ اَخَافُ عَلَيْكُمْ يَوْمَ التَّنَادِۙ  ",
      "text_translation_en": "“And, O my people, I fear for you [the coming of] that Day of [Judgment - the Day when you will be] calling unto one another [in distress] –",
      "juz_number": 24
    },
    "33": {
      "text_tafsir_en": "After the man of faith warned his people of the torment of the world, he continued his warning of the terrible events of the Resurrection and the torment of the Hereafter. At the time of the end, the earth was shaking so violently that people ran to it while shouting for help. However, who will help at that time as each person experiences the same fate and is concerned about their own fate. Regarding the yaum at-tanad (call-day), there are several opinions of scholars: a.The Day of Judgment, so-called because the people of that time shouted for help from others as they ran there to watch the earth shake and shake with terror. . b.The day when the disbelievers in the Hereafter were confronted by Hell, they rushed around to escape, but the angels intercepted and drove them back to the Garden of Fire to be thrown into hell. c.The day when angels consider human deeds. When someone turns on the scales of his charitable cause, that person and those who watch him shout for joy and say out loud that Fulan is fortunate, and so on. Likewise, when one receives the scales of goodness less than his sin, he mourns with grief, followed by others. d.Consecrate between the inhabitants of heaven and the inhabitants of hell about what they have gained. When the inhabitants of heaven were asked if they had obtained what God had promised them, they answered firmly that what they had promised. On the other hand, the inhabitants of hell when asked the same thing by the inhabitants of heaven also respond with the same words, but with a fiery voice, which shows that what they get is misery. On the Day of Thanksgiving, the Day of Allah's Judgment, the disbelievers saw Hell in hell. Therefore, they ran to seek refuge, but the angels intercepted and returned them to the Field of Empress. At that time, no one could help anyone. Don't help others, just help yourself is not always possible. The man warned his people that he was worried the event would happen to them. If Pharaoh had hoped, he would have been punished in hell, and could not help himself, let alone help his other followers. The man of faith asked his people to believe. He was worried that their hearts would be closed if they didn't accept the truth. When the heart is closed, no one can open it except God.",
      "text_tafsir": "Setelah laki-laki beriman itu memperingatkan kaumnya mengenai siksaan di dunia, ia melanjutkan peringatannya tentang dahsyatnya peristiwa hari Kiamat dan siksaan di akhirat. Pada waktu kiamat terjadi, bumi ini bergoncang hebat sehingga manusia berlarian ke sana ke mari sambil berteriak-teriak meminta tolong. Akan tetapi, siapakah yang akan menolong pada waktu itu karena setiap manusia mengalami peristiwa yang sama dan dirisaukan oleh nasib masing-masing. \n\nMengenai yaum at-tanad itu (hari panggil-memanggil), terdapat beberapa pendapat ulama:\n\na.Hari Kiamat, dinamakan demikian karena manusia pada waktu itu berteriak meminta bantuan orang lain sambil berlarian ke sana ke mari menyaksikan bumi bergoncang dan terbelah-belah dengan dahsyatnya.\n\nb.Hari ketika orang-orang kafir di akhirat dihadapkan kepada neraka Jahanam, lalu mereka gempar berlarian ke sana sini untuk menghindarkan diri, tetapi malaikat mencegat dan menghalau mereka kembali ke Padang Mahsyar itu untuk dijebloskan ke dalam neraka.\n\nc.Hari ketika malaikat menimbang amal manusia. Bila seseorang ternyata berat timbangan amal kebaikannya, orang itu dan orang-orang yang menyaksikannya bersorak-sorak kegirangan menyatakan dengan suara keras bahwa si Fulan bernasib baik, dan sebagainya. Begitu pula ketika seseorang menerima timbangan kebaikannya lebih ringan dari dosanya, ia pun meratap dengan sedihnya, diikuti oleh orang-orang lainnya.\n\nd.Panggil-memangggil antara penghuni surga dan penghuni neraka tentang apa yang diperoleh masing-masing. Penghuni surga ketika ditanya penghuni neraka apakah sudah memperoleh apa yang dijanjikan Allah kepada mereka, mereka menjawab dengan mantap bahwa apa yang dijanjikan itu telah mereka nikmati. Di sisi lain, penghuni neraka ketika ditanya hal serupa oleh penghuni surga juga menjawab dengan ucapan yang sama, tetapi dengan suara yang getir, yang menunjukkan bahwa yang mereka peroleh adalah kesengsaraan.\n\nPada hari Mahsyar, yaitu hari pengadilan Allah, orang-orang kafir telah melihat adanya neraka Jahanam. Oleh karena itu, mereka berlarian ingin menghindar, tetapi para malaikat mencegat dan mengembalikan mereka lagi ke Padang Mahsyar. Pada waktu itu, tidak ada yang bisa menolong orang lain. Jangankan menolong orang lain, menolong dirinya sendiri saja belum tentu mampu. Laki-laki beriman itu memperingatkan kaumnya bahwa ia khawatir sekali peristiwa itu akan menimpa mereka. Bila Fir'aun yang mereka harapkan, maka ia akan diazab di dalam neraka, tidak akan bisa menolong dirinya, apalagi menolong orang lain pengikut-pengikutnya itu.\n\nLaki-laki beriman itu meminta rakyatnya beriman. Ia khawatir sekali bahwa hati mereka akan tertutup bila mereka tidak mau juga menerima kebenaran. Bila hati sudah tertutup, siapa pun tidak akan mampu membukanya selain Allah.",
      "text_translation": "(yaitu) pada hari (ketika) kamu berpaling ke belakang (lari), tidak ada seorang pun yang mampu menyelamatkan kamu dari (azab) Allah. Dan barangsiapa dibiarkan sesat oleh Allah, niscaya tidak ada sesuatu pun yang mampu memberi petunjuk.”",
      "text": "يَوْمَ تُوَلُّوْنَ مُدْبِرِيْنَۚ مَا لَكُمْ مِّنَ اللّٰهِ مِنْ عَاصِمٍۚ وَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ",
      "text_translation_en": "the Day when you will [wish to] turn your backs and flee, having none to defend you against God: for he whom God lets go astray can never find any guide.",
      "juz_number": 24
    },
    "34": {
      "text_tafsir_en": "The man further states that before Moses, God had sent Joseph to the people of Egypt. The Prophet Joseph invited them to believe and to give their proofs of the teachings of faith in God and good works, and the miracles which God had given him. However, they still do not want to believe him. They only obey him as a minister or a national speaker. It shows that they were more influenced by the greatness of the earthly office than the office of an apostle, and therefore they liked Pharaoh more cruelly than Moses who brought the truth. After Joseph died, they declared that after him there would be no more apostles. That's what they say because they don't want another apostle to bring them to the truth. Apparently the apostle was Moses and therefore they rebelled against him and became astray. Thus, their misdeeds were due to their greed for worldly glory, as Pharaoh did. Their misdeeds are also due to their very nature of doubting the truth, but what is communicated to them is the revelation of God which is surely true.",
      "text_tafsir": "Orang itu selanjutnya menyatakan bahwa dulu sebelum Nabi Musa, Allah telah mengutus Nabi Yusuf kepada rakyat Mesir. Nabi Yusuf telah mengajak mereka beriman dan memberikan bukti-bukti kerasulannya yaitu ajaran-ajaran tentang iman kepada Allah dan berbuat baik, serta mukjizat-mukjizat yang diberikan Allah kepadanya. Akan tetapi, mereka tetap tidak mau percaya kepadanya. Mereka hanya mematuhinya sebagai seorang menteri atau pembesar negara. Hal itu menunjukkan bahwa mereka lebih terpengaruh oleh kebesaran jabatan duniawi daripada jabatan seorang rasul, dan karena itulah mereka lebih menyukai Fir'aun yang kejam daripada Nabi Musa yang membawa kebenaran.\n\nSetelah Nabi Yusuf meninggal, mereka menyatakan bahwa setelah dia tidak akan ada lagi seorang rasul pun. Itu mereka katakan karena tidak ingin ada lagi seorang rasul yang mengajak mereka kepada kebenaran. Ternyata rasul itu ada yaitu Nabi Musa dan karena itulah mereka membangkang kepadanya dan menjadi orang-orang yang sesat. Dengan demikian, kesesatan mereka itu adalah karena ketamakan mereka terhadap kemegahan duniawi, sebagaimana dilakukan Fir'aun. Kesesatan mereka itu juga disebabkan oleh sifat mereka yang selalu meragukan kebenaran, padahal yang disampaikan kepada mereka adalah wahyu Allah yang pasti benar.",
      "text_translation": "Dan sungguh, sebelum itu Yusuf telah datang kepadamu dengan membawa bukti-bukti yang nyata, tetapi kamu senantiasa meragukan apa yang dibawanya, bahkan ketika dia wafat, kamu berkata, “Allah tidak akan mengirim seorang rasul pun setelahnya.” Demikianlah Allah membiarkan sesat orang yang melampaui batas dan ragu-ragu,",
      "text": "وَلَقَدْ جَاۤءَكُمْ يُوْسُفُ مِنْ قَبْلُ بِالْبَيِّنٰتِ فَمَا زِلْتُمْ فِيْ شَكٍّ مِّمَّا جَاۤءَكُمْ بِهٖ ۗحَتّٰىٓ اِذَا هَلَكَ قُلْتُمْ لَنْ يَّبْعَثَ اللّٰهُ مِنْۢ بَعْدِهٖ رَسُوْلًا ۗ كَذٰلِكَ يُضِلُّ اللّٰهُ مَنْ هُوَ مُسْرِفٌ مُّرْتَابٌۙ",
      "text_translation_en": "“And [remember:] it was to you that Joseph came aforetime with all evidence of the truth; but you never ceased to throw doubt on all [the messages] that he brought you - so much so that when he died, you said, ‘Never will God send any apostle [even] after him!’ “In this way God lets go astray such as waste their own selves by throwing suspicion [on His revela­tions] –",
      "juz_number": 24
    },
    "35": {
      "text_tafsir_en": "Then Allah explains how the actions of those who are greedy and always doubt the truth of the revelation. They always reject the truth of God's verses that are delivered to them. They also always question the evidence presented about the truth of the revelation. However, their refusal did not have any strength. Their beliefs are only based on the traditions of their ancestors, and that is just blind obedience without thinking. Compliance like this is not justified because God gives humans hearing, vision, and reason. Therefore, those who reject the truth of revelation and believe more in the traditions of the ancestors no longer know what is right and what is wrong. Thus, they are hated by Allah and those who believe. Next God explained His laws for those who close their hearts to receive the truth of revelation, namely that He will close their hearts. Closed hearts occur because they always reject the truth of revelation and dispute it. Continued rejection leads to pride. Always questioning the truth will lead to arbitrariness. Because they are arrogant and arbitrary, they will always reject and oppose the truth. Finally their hearts closed by themselves. Thus the law determined by God for the closure of human hearts.",
      "text_tafsir": "Kemudian Allah menjelaskan bagaimana tindakan orang-orang yang bersifat tamak dan selalu meragukan kebenaran wahyu itu. Mereka itu selalu menolak kebenaran ayat-ayat Allah yang disampaikan kepada mereka. Mereka juga selalu mempermasalahkan bukti-bukti yang disampaikan mengenai kebenaran wahyu itu. Akan tetapi, penolakan mereka itu tidak memiliki kekuatan apa pun. Kepercayaan mereka hanya berdasar tradisi nenek moyang mereka, dan itu hanyalah kepatuhan membabi buta tanpa dipikirkan. Kepatuhan seperti ini tidak dibenarkan karena Allah memberi manusia pendengaran, penglihatan, dan akal pikiran. Oleh karena itu, orang yang menolak kebenaran wahyu dan lebih percaya pada tradisi nenek moyang itu tidak tahu lagi mana yang benar dan mana yang salah. Dengan demikian, mereka sangat dibenci Allah dan orang-orang yang beriman.\n\nSelanjutnya Allah menerangkan hukum-hukum-Nya bagi orang yang menutup hatinya untuk menerima kebenaran wahyu, yaitu bahwa Ia akan menutup hati mereka. Hati yang tertutup terjadi karena mereka selalu menolak kebenaran wahyu dan mempermasalahkannya. Penolakan yang terus-menerus akan membawa kepada kesombongan. Selalu mempermasalahkan kebenaran akan membawa kepada kesewenang-wenangan. Karena sombong dan sewenang-wenang itu, maka mereka akan selalu menolak dan menentang kebenaran. Akhirnya hati mereka tertutup dengan sendirinya. Demikian hukum yang ditentukan Allah bagi tertutupnya hati manusia.",
      "text_translation": "(yaitu) orang-orang yang memperdebatkan ayat-ayat Allah tanpa alasan yang sampai kepada mereka. Sangat besar kemurkaan (bagi mereka) di sisi Allah dan orang-orang yang beriman. Demikianlah Allah mengunci hati setiap orang yang sombong dan berlaku sewenang-wenang.",
      "text": " ۨالَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِ اللّٰهِ بِغَيْرِ سُلْطٰنٍ اَتٰىهُمْۗ  كَبُرَ مَقْتًا عِنْدَ اللّٰهِ وَعِنْدَ الَّذِيْنَ اٰمَنُوْا ۗ كَذٰلِكَ يَطْبَعُ اللّٰهُ عَلٰى كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ",
      "text_translation_en": "such as would call God’s messages in question without having any evidence therefor: [a sin] exceedingly loathsome in the sight of God and of those who have attained to faith. It is in this way that God sets a seal on every arrogant, self-exalting heart.”",
      "juz_number": 24
    },
    "36": {
      "text_tafsir_en": "Pharaoh still did not accept the advice of one of his family. He continued to defy and did not want to accept the preaching of the Prophet Musa. Therefore, he wanted to mock the Prophet Moses. He ordered Haman, his prime minister, to build a large and majestic palace that soared into the sky. In another verse it is informed that the palace was built of bricks made from burned clay: And Fir'awn said, \"O my people, my lords! I do not know there is a God for you besides me. So, burn clay for me, O Haman (to make bricks), then make a tall building for me so that I can go up to see the Lord Moses, and I am sure that he is a liar. \" (Al-Qashash \/ 28: 38) The purpose of making a large, magnificent building and soaring into the sky is as a place or stairs to spy or witness the existence of the Lord Moses. He stated that the Prophet Moses was actually a liar because he was sure there was no God in the sky. The purpose of this statement is to trick the people, that there really is no God in heaven as the Prophet Moses said. Thus, he wanted his people not to believe in the Prophet Moses and keep following him. Pharaoh acted this way because he was overcome by his ambition to defeat the Prophet Musa. He was also overcome by lust so that his people would not find the truth conveyed by the Prophet Musa. He wants his people to obey him, and for that he does everything, from twisting the truth to mocking. It is ambition and lust that plagues many people, as the following Arabic poetry describes: Lust is like a baby, if you leave it, it will mature with continual desire to suckle, but if you are weaned, it will be weaned. Then this verse concludes with an affirmation that Pharaoh's deception to defeat the Prophet Musa and kill the monotheistic religion which he brought failed and brought great losses. Failed because the preaching of the Prophet Musa still could not be dammed. Loss due to costs incurred is not small, while the results are not there. That is because Allah always destroys the evil done by humans and destroys the consequences left by these vanity acts, as He said: Surely they will be destroyed (by beliefs) they hold and will be in vain what they have done. (al-A'raf \/ 7: 139)",
      "text_tafsir": "Fir'aun tetap tidak menerima nasihat salah seorang keluarganya itu. Ia tetap membangkang dan tidak mau menerima dakwah Nabi Musa. Oleh karena itu, ia ingin mengejek Nabi Musa. Ia memerintahkan Haman, perdana menterinya, untuk membangun sebuah istana besar dan megah yang menjulang ke angkasa. Dalam ayat lain diinformasikan bahwa istana itu dibangun dari batu bata yang dibuat dari tanah liat yang dibakar:\n\nDan Fir'aun berkata, \"Wahai para pembesar kaumku! Aku tidak mengetahui ada Tuhan bagimu selain aku. Maka bakarkanlah tanah liat untukku wahai Haman (untuk membuat batu bata), kemudian buatkanlah bangunan yang tinggi untukku agar aku dapat naik melihat Tuhannya Musa, dan aku yakin bahwa dia termasuk pendusta.\" (al-Qashash\/28: 38)\n\nMaksud pembuatan bangunan besar, megah, dan menjulang ke angkasa itu adalah sebagai tempat atau tangga untuk mengintai atau menyaksikan adanya Tuhan Nabi Musa. Ia menyatakan bahwa Nabi Musa sebenarnya seorang pembohong karena ia yakin tidak ada Tuhan di langit. Maksud ucapannya itu adalah untuk mengelabui rakyatnya, bahwa memang tidak ada Tuhan di langit sebagaimana yang dikatakan Nabi Musa tersebut. Dengan demikian, ia menginginkan agar rakyatnya tidak percaya kepada Nabi Musa dan tetap mengikutinya.\n\nFir'aun bertindak demikian karena ia dikuasai oleh ambisinya untuk mengalahkan Nabi Musa. Ia juga dikuasai oleh nafsu agar rakyatnya tidak menemukan kebenaran yang disampaikan Nabi Musa. Ia ingin agar rakyatnya tetap mematuhinya, dan untuk itu ia berbuat segala cara, dari memutarbalikkan kebenaran sampai mengejek. Ambisi dan nafsu itulah yang banyak menjerumuskan manusia, sebagaimana dilukiskan syair Arab berikut:\n\nNafsu itu bagaikan bayi, jika kau biarkan, ia akan dewasa dengan\n\nterus-menerus ingin menyusu, tapi bila kau sapih, \n\nia akan tersapih sendirinya.\n\nKemudian ayat ini ditutup dengan suatu penegasan bahwa tipu muslihat Fir'aun untuk mengalahkan Nabi Musa dan mematikan agama tauhid yang ia bawa gagal dan membawa kerugian besar. Gagal karena dakwah Nabi Musa tetap tidak dapat dibendungnya. Rugi karena biaya yang dikeluarkannya tidak sedikit, sedangkan hasilnya tidak ada. Hal itu karena Allah selalu membinasakan kebatilan yang dikerjakan manusia dan menghancurkan akibat yang ditinggalkan perbuatan batil itu, sebagaimana difirmankan-Nya:\n\nSesungguhnya mereka akan dihancurkan (oleh kepercayaan) yang dianutnya dan akan sia-sia apa yang telah mereka kerjakan. (al-A.'raf\/7: 139)",
      "text_translation": "Dan Fir‘aun berkata, “Wahai Haman! Buatkanlah untukku sebuah bangunan yang tinggi agar aku sampai ke pintu-pintu,",
      "text": "وَقَالَ فِرْعَوْنُ يٰهَامٰنُ ابْنِ لِيْ صَرْحًا لَّعَلِّيْٓ اَبْلُغُ الْاَسْبَابَۙ",
      "text_translation_en": "But Pharaoh said: “O Haman! Build me a lofty tower, that haply I may attain to the [right] means",
      "juz_number": 24
    },
    "37": {
      "text_tafsir_en": "Pharaoh still did not accept the advice of one of his family. He continued to defy and did not want to accept the preaching of the Prophet Musa. Therefore, he wanted to mock the Prophet Moses. He ordered Haman, his prime minister, to build a large and majestic palace that soared into the sky. In another verse it is informed that the palace was built of bricks made from burned clay: And Fir'awn said, \"O my people, my lords! I do not know there is a God for you besides me. So, burn clay for me, O Haman (to make bricks), then make a tall building for me so that I can go up to see the Lord Moses, and I am sure that he is a liar. \" (Al-Qashash \/ 28: 38) The purpose of making a large, magnificent building and soaring into the sky is as a place or stairs to spy or witness the existence of the Lord Moses. He stated that the Prophet Moses was actually a liar because he was sure there was no God in the sky. The purpose of this statement is to trick the people, that there really is no God in heaven as the Prophet Moses said. Thus, he wanted his people not to believe in the Prophet Moses and keep following him. Pharaoh acted this way because he was overcome by his ambition to defeat the Prophet Musa. He was also overcome by lust so that his people would not find the truth conveyed by the Prophet Musa. He wants his people to obey him, and for that he does everything, from twisting the truth to mocking. It is ambition and lust that plagues many people, as the following Arabic poetry describes: Lust is like a baby, if you leave it, it will mature with continual desire to suckle, but if you are weaned, it will be weaned. Then this verse concludes with an affirmation that Pharaoh's deception to defeat the Prophet Musa and kill the monotheistic religion which he brought failed and brought great losses. Failed because the preaching of the Prophet Musa still could not be dammed. Loss due to costs incurred is not small, while the results are not there. That is because Allah always destroys the evil done by humans and destroys the consequences left by these vanity acts, as He said: Surely they will be destroyed (by beliefs) they hold and will be in vain what they have done. (al-A'raf \/ 7: 139)",
      "text_tafsir": "Fir'aun tetap tidak menerima nasihat salah seorang keluarganya itu. Ia tetap membangkang dan tidak mau menerima dakwah Nabi Musa. Oleh karena itu, ia ingin mengejek Nabi Musa. Ia memerintahkan Haman, perdana menterinya, untuk membangun sebuah istana besar dan megah yang menjulang ke angkasa. Dalam ayat lain diinformasikan bahwa istana itu dibangun dari batu bata yang dibuat dari tanah liat yang dibakar:\n\nDan Fir'aun berkata, \"Wahai para pembesar kaumku! Aku tidak mengetahui ada Tuhan bagimu selain aku. Maka bakarkanlah tanah liat untukku wahai Haman (untuk membuat batu bata), kemudian buatkanlah bangunan yang tinggi untukku agar aku dapat naik melihat Tuhannya Musa, dan aku yakin bahwa dia termasuk pendusta.\" (al-Qashash\/28: 38)\n\nMaksud pembuatan bangunan besar, megah, dan menjulang ke angkasa itu adalah sebagai tempat atau tangga untuk mengintai atau menyaksikan adanya Tuhan Nabi Musa. Ia menyatakan bahwa Nabi Musa sebenarnya seorang pembohong karena ia yakin tidak ada Tuhan di langit. Maksud ucapannya itu adalah untuk mengelabui rakyatnya, bahwa memang tidak ada Tuhan di langit sebagaimana yang dikatakan Nabi Musa tersebut. Dengan demikian, ia menginginkan agar rakyatnya tidak percaya kepada Nabi Musa dan tetap mengikutinya.\n\nFir'aun bertindak demikian karena ia dikuasai oleh ambisinya untuk mengalahkan Nabi Musa. Ia juga dikuasai oleh nafsu agar rakyatnya tidak menemukan kebenaran yang disampaikan Nabi Musa. Ia ingin agar rakyatnya tetap mematuhinya, dan untuk itu ia berbuat segala cara, dari memutarbalikkan kebenaran sampai mengejek. Ambisi dan nafsu itulah yang banyak menjerumuskan manusia, sebagaimana dilukiskan syair Arab berikut:\n\nNafsu itu bagaikan bayi, jika kau biarkan, ia akan dewasa dengan\n\nterus-menerus ingin menyusu, tapi bila kau sapih, \n\nia akan tersapih sendirinya.\n\nKemudian ayat ini ditutup dengan suatu penegasan bahwa tipu muslihat Fir'aun untuk mengalahkan Nabi Musa dan mematikan agama tauhid yang ia bawa gagal dan membawa kerugian besar. Gagal karena dakwah Nabi Musa tetap tidak dapat dibendungnya. Rugi karena biaya yang dikeluarkannya tidak sedikit, sedangkan hasilnya tidak ada. Hal itu karena Allah selalu membinasakan kebatilan yang dikerjakan manusia dan menghancurkan akibat yang ditinggalkan perbuatan batil itu, sebagaimana difirmankan-Nya:\n\nSesungguhnya mereka akan dihancurkan (oleh kepercayaan) yang dianutnya dan akan sia-sia apa yang telah mereka kerjakan. (al-A.'raf\/7: 139)",
      "text_translation": "(yaitu) pintu-pintu langit, agar aku dapat melihat Tuhannya Musa, tetapi aku tetap memandangnya seorang pendusta.” Dan demikianlah dijadikan terasa indah bagi Fir‘aun perbuatan buruknya itu, dan dia tertutup dari jalan (yang benar); dan tipu daya Fir‘aun itu tidak lain hanyalah membawa kerugian.",
      "text": "اَسْبَابَ السَّمٰوٰتِ فَاَطَّلِعَ اِلٰٓى اِلٰهِ مُوْسٰى وَاِنِّيْ لَاَظُنُّهٗ كَاذِبًا ۗوَكَذٰلِكَ زُيِّنَ لِفِرْعَوْنَ سُوْۤءُ عَمَلِهٖ وَصُدَّ عَنِ السَّبِيْلِ ۗوَمَا كَيْدُ فِرْعَوْنَ اِلَّا فِيْ تَبَابٍ ࣖ ",
      "text_translation_en": "the means of approach to the heavens - and that [thus] I may have a look at the god of Moses: for, behold, I am indeed certain that he is a liar!” And thus, goodly seemed unto Pharaoh the evil of his own doings, and so he was barred from the path [of truth]: and Pharaoh’s guile did not lead to aught but ruin.",
      "juz_number": 24
    },
    "38": {
      "text_tafsir_en": "Even though the Pharaohs opposed him, those who believed in Moses still called on his people to follow Moses. He said, \"O my people, if you follow my cry and you believe what I say, then you are following a straight path leading to the happiness of eternal life in the hereafter and you have embraced the religion of God conveyed by Moses. to guide believers who are constantly communicating the religion of God and inviting them to walk in a good way, even if the disbelievers reject it. This is one of the tasks that Allah has given to every believer. be steadfast and steadfast in the preaching of it as did the believers who followed Moses' call.",
      "text_tafsir": "Sekalipun kaum Fir'aun menentangnya, namun orang yang beriman kepada Musa itu tetap menyeru kaumnya agar mengikuti Nabi Musa. Ia berkata, \"Wahai kaumku, jika kamu mengikuti seruanku dan kamu memercayai apa yang telah aku sampaikan, berarti kamu mengikuti jalan yang lurus yang menuju kepada kebahagiaan hidup abadi di akhirat nanti dan berarti pula kamu telah memeluk agama Allah yang disampaikan oleh Musa.\n\nAyat ini memberikan petunjuk kepada orang-orang yang beriman agar selalu menyampaikan agama Allah kepada manusia dan mengajak mereka ke jalan yang lurus dengan cara yang baik, sekalipun orang-orang kafir mengingkarinya. Hal ini termasuk salah satu tugas yang dipikulkan Allah kepada setiap orang yang beriman. Mereka hendaklah tabah dan sabar melakukan dakwah itu seperti yang telah dilakukan oleh orang yang beriman yang mengikuti seruan Musa.",
      "text_translation": "Dan orang yang beriman itu berkata, “Wahai kaumku! Ikutilah aku, aku akan menunjukkan kepadamu jalan yang benar.",
      "text": "وَقَالَ الَّذِيْٓ اٰمَنَ يٰقَوْمِ اتَّبِعُوْنِ اَهْدِكُمْ سَبِيْلَ الرَّشَادِۚ",
      "text_translation_en": "Still, the man who had attained to faith went on: “O my people! Follow me: I shall guide you onto the path of rectitude!",
      "juz_number": 24
    },
    "39": {
      "text_tafsir_en": "In this verse it is explained that the people who believed in Moses said to his people, \"O my people, this world's life is a mortal life, in which the pleasure and happiness found therein are happiness and happiness that is imperfect and eternal. eternal life, the happiness and happiness that come from it are perfect happiness and happiness. Therefore, you must never disregard God in this life so that you will escape his torment in the hereafter. \"",
      "text_tafsir": "Pada ayat ini diterangkan bahwa orang yang beriman kepada Musa berkata kepada kaumnya, \"Wahai kaumku, kehidupan dunia ini adalah kehidupan yang fana, di mana kesenangan serta kebahagiaan yang diperoleh di dalamnya adalah kesenangan dan kebahagiaan yang tidak sempurna serta tidak kekal. Adapun kehidupan akhirat adalah kehidupan yang kekal, kesenangan dan kebahagiaan yang diperoleh adalah kesenangan dan kebahagiaan yang sempurna. Oleh karena itu, janganlah sekali-kali kamu mengingkari Allah dalam kehidupan dunia ini agar kamu terhindar dari siksa-Nya di akhirat nanti.\"",
      "text_translation": "Wahai kaumku! Sesungguhnya kehidupan dunia ini hanyalah kesenangan (sementara) dan sesungguhnya akhirat itulah negeri yang kekal.",
      "text": "يٰقَوْمِ اِنَّمَا هٰذِهِ الْحَيٰوةُ الدُّنْيَا مَتَاعٌ  ۖوَّاِنَّ الْاٰخِرَةَ هِيَ دَارُ الْقَرَارِ",
      "text_translation_en": "“O my people! This worldly life is but a brief enjoyment, whereas, behold, the life to come is the home abiding.",
      "juz_number": 24
    },
    "40": {
      "text_tafsir_en": "The believer explained to his people how important the life of a person's life is to the afterlife. He said to his people, \"O my people, whoever commits a crime both male and female, then he is punished only for the evil that he has done. to put an end to His prohibitions, he will be entered into a paradise of pleasure. God will reward their faith and righteousness with double rewards and infinite sustenance. \" This verse describes the true justice of God and His Merciful and Merciful disposition of His servants. He did not mistreat his servant in the least. If He punishes His servant in the hereafter, then the punishment that is given to him in proportion to the evil and disobedience which he has committed while living in the world, is not exaggerated. However, if He repays his servant's faith and righteousness, he will reward him with double reward.",
      "text_tafsir": "Orang yang beriman itu menerangkan kepada kaumnya bagaimana besar pengaruh kehidupan dunia seseorang kepada kehidupan akhiratnya. Ia berkata kepada kaumnya, \"Wahai kaumku, barang siapa yang mengerjakan suatu kejahatan baik laki-laki maupun perempuan, maka ia hanya diazab sesuai dengan kejahatan yang dilakukannya. Akan tetapi, barang siapa yang beriman dan mengerjakan amal saleh, mengikuti perintah-perintah Allah dan menghentikan larangan-larangan-Nya, maka ia akan dimasukkan ke dalam surga yang penuh kenikmatan. Allah membalas iman dan amal saleh mereka dengan pahala yang berlipat ganda dan rezeki yang tiada terhingga.\"\n\nAyat ini menggambarkan keadilan Allah yang sesungguhnya serta sifat Maha Pengasih dan Maha Penyayang-Nya kepada hamba-hamba-Nya. Dia tidak menganiaya hamba-Nya sedikit pun. Jika Dia mengazab hamba-Nya di akhirat nanti, maka azab yang diberikan itu seimbang dengan perbuatan jahat dan ingkar yang telah dilakukannya selama hidup di dunia, tidak dilebihkan sedikit pun. Akan tetapi, jika Dia membalas iman dan amal saleh hamba-Nya, maka Dia membalasnya dengan pahala yang berlipat ganda.",
      "text_translation": "Barangsiapa mengerjakan perbuatan jahat, maka dia akan dibalas sebanding dengan kejahatan itu. Dan barang siapa mengerjakan kebajikan, baik laki-laki maupun perempuan sedangkan dia dalam keadaan beriman, maka mereka akan masuk surga, mereka diberi rezeki di dalamnya tidak terhingga.",
      "text": "مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزٰىٓ اِلَّا مِثْلَهَاۚ وَمَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَهُوَ مُؤْمِنٌ فَاُولٰۤىِٕكَ يَدْخُلُوْنَ الْجَنَّةَ يُرْزَقُوْنَ فِيْهَا بِغَيْرِ حِسَابٍ ",
      "text_translation_en": "[There,] anyone who has done a bad deed will be requited with no more than the like thereof, whereas anyone, be it man or woman, who has done righteous deeds and is a believer withal - all such will enter paradise, wherein they shall be blest with good beyond all reckoning!",
      "juz_number": 24
    },
    "41": {
      "text_tafsir_en": "The believers of Moses repeated his call to his people, saying, \"O my people, I am amazed at your attitude and your actions. and do good deeds, while you call me to the path of misery that leads to hell. \"",
      "text_tafsir": "Orang yang beriman kepada Musa itu mengulangi lagi seruannya kepada kaumnya dengan mengatakan, \"Wahai kaumku, aku merasa heran dengan sikap dan tindakan kamu sekalian. Aku menyeru kamu mengikuti jalan keselamatan, menghindarkan kamu dari siksa neraka, dan membawamu ke dalam surga dengan beriman kepada Allah dan mengerjakan amal yang saleh, sedangkan kamu menyeruku ke jalan kesengsaraan yang mengantarkan ke dalam neraka.\"",
      "text_translation": "Dan wahai kaumku! Bagaimanakah ini, aku menyerumu kepada keselamatan, tetapi kamu menyeruku ke neraka?",
      "text": "۞ وَيٰقَوْمِ مَا لِيْٓ اَدْعُوْكُمْ اِلَى النَّجٰوةِ وَتَدْعُوْنَنِيْٓ اِلَى النَّارِۗ",
      "text_translation_en": "“And, O my people, how is it that I summon you to salvation, the while you summon me to the fire?",
      "juz_number": 24
    },
    "42": {
      "text_tafsir_en": "Then the believer said, \"All of you call upon me and ask me to turn against Allah and to associate with Him for something that has no justification and no credible proof, which states that the fellowship of God is a true belief. call upon and call upon you to please God, there is no other God besides Him. The Almighty, the Almighty, with clear evidence. He is the Almighty and the Forgiving of His servants' sins. \"",
      "text_tafsir": "Selanjutnya orang mukmin itu menyatakan, \"Kamu sekalian menyeru dan mengajakku mengingkari Allah dan mempersekutukan-Nya dengan sesuatu yang tidak mempunyai alasan yang benar dan tidak ada bukti-bukti yang dapat diyakini kebenarannya, yang menyatakan bahwa menyekutukan Tuhan itu adalah kepercayaan yang benar. Sedangkan aku menyeru dan mengajakmu agar kamu sekalian mengesakan Allah, tidak ada Tuhan yang lain selain Dia. Yang Mahakuasa lagi Mahaperkasa, dengan bukti-bukti yang nyata. Dialah Yang Mahaperkasa lagi Maha Pengampun dosa-dosa hamba-Nya.\"",
      "text_translation": "(Mengapa) kamu menyeruku agar kafir kepada Allah dan mempersekutukan-Nya dengan sesuatu yang aku tidak mempunyai ilmu tentang itu, padahal aku menyerumu (beriman) kepada Yang Mahaperkasa, Maha Pengampun?",
      "text": "تَدْعُوْنَنِيْ لِاَكْفُرَ بِاللّٰهِ وَاُشْرِكَ بِهٖ مَا لَيْسَ لِيْ بِهٖ عِلْمٌ وَّاَنَا۠ اَدْعُوْكُمْ اِلَى الْعَزِيْزِ الْغَفَّارِ",
      "text_translation_en": "- [for] you call upon me to deny [the one­ness of] God and to ascribe a share in His divinity to aught of which I cannot [possibly] have any knowl­edge the while I summon you to [a cognition of] the Almighty, the All-Forgiving!",
      "juz_number": 24
    },
    "43": {
      "text_tafsir_en": "This verse still extends the words of the believers above. He said, \"Surely ye have called upon me to worship idols, which have not heard the voice of those who call upon them, and have not been able to help in this world or the hereafter, for it cannot do any harm or benefit to anyone. . \" God's Word: If you call on them, they will not listen to you, and if they listen, they will not listen to you. And on the Day of Resurrection they will renounce your ignorance and no one can give you the evidence of what Allah (the Almighty) has revealed. (Fathir \/ 35: 14) And the word of Allah: And who is more astray than those who worship other than Allah (worshipers) who cannot answer (prayer) until the Day of Resurrection and neglect their prayer? (al-A.hqaf \/ 46: 5) The believer goes on to say, \"Know my people, that we are all of God and that we return to him after death and rise again.\" with our own deeds and deeds. Those who disbelieve and cross the line will become dwellers of hell. \"",
      "text_tafsir": "Ayat ini masih melanjutkan perkataan dari orang beriman di atas. Dia mengatakan, \"Sebenarnya kamu telah menyeruku menyembah berhala-berhala, yang tidak mendengar seruan orang-orang yang menyerunya, dan tidak dapat memberi pertolongan baik di dunia maupun di akhirat, karena ia tidak dapat memberikan sesuatu mudarat dan tidak pula sesuatu manfaat kepada siapa pun.\" Firman Allah:\n\nJika kamu menyeru mereka, mereka tidak mendengar seruanmu, dan sekiranya mereka mendengar, mereka juga tidak memperkenankan permintaanmu. Dan pada hari Kiamat mereka akan mengingkari kemusyrikanmu dan tidak ada yang dapat memberikan keterangan kepadamu seperti yang diberikan oleh (Allah) Yang Mahateliti. (Fathir\/35: 14)\n\nDan firman Allah:\n\nDan siapakah yang lebih sesat daripada orang-orang yang menyembah selain Allah (sembahan) yang tidak dapat memperkenankan (doa)nya sampai hari Kiamat dan mereka lalai dari (memperhatikan) doa mereka? (al-A.hqaf\/46: 5)\n\nOrang beriman itu melanjutkan perkataannya, \"Ketahuilah kaumku, bahwa kita semua adalah milik Allah dan kepada-Nya pula kita kembali setelah mati dan dibangkitkan kembali. Waktu itu pula Dia memberi balasan kepada kita, sesuai dengan perbuatan dan amal kita masing-masing. Orang-orang yang kafir dan melampaui batas akan menjadi penghuni neraka.\"",
      "text_translation": "Sudah pasti bahwa apa yang kamu serukan aku kepadanya bukanlah suatu seruan yang berguna baik di dunia maupun di akhirat. Dan sesungguhnya tempat kembali kita pasti kepada Allah, dan sesungguhnya orang-orang yang melampaui batas, mereka itu akan menjadi penghuni neraka.",
      "text": "لَا جَرَمَ اَنَّمَا تَدْعُوْنَنِيْٓ اِلَيْهِ لَيْسَ لَهٗ دَعْوَةٌ فِى الدُّنْيَا وَلَا فِى الْاٰخِرَةِ وَاَنَّ مَرَدَّنَآ اِلَى اللّٰهِ وَاَنَّ الْمُسْرِفِيْنَ هُمْ اَصْحٰبُ النَّارِ",
      "text_translation_en": "“There is no doubt that what you summon me to is something that has no claim to being invoked either in this world or in the life to come - as [there is no doubt] that unto God is our return, and that they who have wasted their own selves shall find them­selves in the fire:",
      "juz_number": 24
    },
    "44": {
      "text_tafsir_en": "Then the believers put an end to their counsel by saying, \"O my people, in the hereafter you will know the truth that I am telling you, either in the commandments of God or in His prohibitions. but at that time the remorse was of no avail. I trusted in my Lord, and I surrendered to him all my affairs, and I sought his help, that I might be protected from all the evils which I might do, and from all the evils that might befall me. \" Verily, Allah is well-acquainted with the condition of His servants. He instructs His servants who are worthy of guidance and misleads His servants who desire the wrong by committing unlawful acts and not obeying the commands they must perform.",
      "text_tafsir": "Kemudian orang-orang yang beriman itu mengakhiri nasihatnya kepada kaumnya dengan mengatakan, \"Wahai kaumku, di akhirat kelak kamu sekalian akan mengetahui kebenaran yang aku sampaikan kepadamu baik berupa perintah-perintah Allah maupun berupa larangan-larangan-Nya. Waktu itu kamu akan menyesal, tetapi pada waktu itu penyesalan tiada berguna lagi. Aku bertawakal kepada Tuhanku dan aku menyerahkan kepada-Nya segala urusanku dan aku mohon pertolongan kepada-Nya, agar aku terpelihara dari segala macam kejahatan yang mungkin aku lakukan dan dari segala bencana yang mungkin menimpaku.\"\n\nSesungguhnya Allah Maha Mengetahui keadaan hamba-hamba-Nya. Dia memberi petunjuk hamba-hamba-Nya yang pantas diberi petunjuk dan menyesatkan hamba-hamba-Nya yang menginginkan kesesatan itu dengan mengerjakan perbuatan-perbuatan terlarang dan tidak mengerjakan perintah-perintah yang harus mereka laksanakan.",
      "text_translation": "Maka kelak kamu akan ingat kepada apa yang kukatakan kepadamu. Dan aku menyerahkan urusanku kepada Allah. Sungguh, Allah Maha Melihat akan hamba-hamba-Nya.”",
      "text": "فَسَتَذْكُرُوْنَ مَآ اَقُوْلُ لَكُمْۗ وَاُفَوِّضُ اَمْرِيْٓ اِلَى اللّٰهِ ۗاِنَّ اللّٰهَ بَصِيْرٌ ۢبِالْعِبَادِ",
      "text_translation_en": "and at that time you will [have cause to] remember what I am telling you [now]. “But [as for me,] I commit myself unto God: for, verily, God sees all that is in [the hearts of] His servants.”",
      "juz_number": 24
    },
    "45": {
      "text_tafsir_en": "This verse explains that God helped his faithful servant and destroyed their enemies by declaring that He protected the believers from all the plagiarism and oppression perpetrated by Pharaoh and his followers by saving them and Moses. While Pharaoh and his followers were drowned in the Red Sea. In the hereafter they will be afflicted with a painful torment. Ibn 'Abbas, \"relates that when he learned of the faith, Pharaoh intended to kill him. Therefore, he ran away.\"",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menolong hamba-Nya yang beriman dan menghancurkan musuh-musuh mereka dengan menyatakan bahwa Dia memelihara orang-orang yang beriman itu dari segala usaha tipu daya dan penganiayaan yang dilakukan oleh Fir'aun dan para pengikutnya dengan menyelamatkan mereka beserta Musa. Sedangkan Fir'aun beserta para pengikutnya ditenggelamkan di Laut Merah. Di akhirat nanti mereka akan ditimpa azab yang pedih.\n\nDiriwayatkan oleh Ibnu 'Abbas, \"Tatkala mengetahui keimanan orang itu, maka Fir'aun bermaksud hendak membunuhnya. Oleh karena itu, dia lari menyelamatkan diri.\"",
      "text_translation": "Maka Allah memeliharanya dari kejahatan tipu daya mereka, sedangkan Fir‘aun beserta kaumnya dikepung oleh azab yang sangat buruk.",
      "text": "فَوَقٰىهُ اللّٰهُ سَيِّاٰتِ مَا مَكَرُوْا وَحَاقَ بِاٰلِ فِرْعَوْنَ سُوْۤءُ الْعَذَابِۚ",
      "text_translation_en": "And God preserved him from the evil of their scheming, whereas suffering vile was to encompass Pharaoh’s folk:",
      "juz_number": 24
    },
    "46": {
      "text_tafsir_en": "This verse depicts the fate that will befall Pharaoh and his wicked people in the hereafter. From death to resurrection, they will be brought to hell, morning, evening, and on until the Day of Judgment. On the Day of Resurrection it is said to the guardians of hell, \"Put Pharaoh and his people into hell, and bring upon them a severe torment.\" Jumhur scholars believe that the doom of the grave exists and this is the basis of this verse. Their opinion is reinforced by the hadith narrated by al-Bukhari and Muslim of Ibn 'Umar: That the Messenger of Allah (may peace be upon him) said: \"Indeed, one of you when he died was shown to him the seat of morning and evening. is) the seat of the heavenly, if it is a member of the Fire, then it is said: 'This is your seat until God raises you on the Day of Resurrection.' (The History of al-Bukhari and Muslim from Ibn 'Umar) From the word of Allah and the hadith above it can be concluded that the grave is an undeniable truth and will be experienced by the infidels morning and evening until they are resurrected. But ar-Razi states that the grave do not exist. The verse cannot be used as a basis for the determination of the grave, but rather refers to the continuation of the torment of hell, as the word of God is directed to the astrologers: And in them is morning and evening provision. (Mary \/ 19: 62)",
      "text_tafsir": "Pada ayat ini digambarkan azab yang akan menimpa Fir'aun dan kaumnya yang durhaka di akhirat nanti. Sejak meninggal dunia sampai dibangkitkan kelak, mereka akan dihadapkan ke neraka pagi, petang, dan terus-menerus hingga hari Kiamat.\n\nPada hari Kiamat dikatakan kepada para penjaga neraka, \"Masukkanlah Fir'aun dan kaumnya ke dalam neraka dan timpakanlah kepada mereka siksa yang keras.\"\n\nJumhur ulama berpendapat bahwa azab kubur itu ada dan dasarnya adalah ayat ini. Pendapat mereka dikuatkan oleh hadis yang diriwayatkan al-Bukhari dan Muslim dari Ibnu 'Umar:\n\nBahwasanya Rasulullah saw bersabda, \"Sesungguhnya salah seorang kamu apabila ia meninggal dunia diperlihatkan kepadanya tempat duduknya pagi dan petang. Jika ia termasuk ahli surga, maka (tempat duduknya itu adalah) tempat duduk ahli surga, jika ia termasuk ahli neraka maka (tempat duduknya adalah) tempat duduk ahli neraka. Dikatakan kepadanya, 'Inilah tempat duduk engkau sampai Allah membangkitkan engkau pada hari Kiamat.\" (Riwayat al-Bukhari dan Muslim dari Ibnu 'Umar)\n\nDari firman Allah dan hadis di atas dapat diambil kesimpulan bahwa azab kubur itu adalah suatu kebenaran yang tidak dapat disangkal dan akan dialami oleh orang kafir pagi dan petang sampai mereka dibangkitkan kembali.\n\nNamun ar-Razi menyatakan bahwa azab kubur tidak ada. Ayat tersebut tidak dapat dijadikan sebagai dasar penetapan adanya azab kubur, tetapi hanya menunjukkan kepada terus-menerusnya azab neraka, sama halnya dengan firman Allah yang ditujukan kepada ahli surga:\n\nDan di dalamnya bagi mereka ada rezeki pagi dan petang. (Maryam\/19: 62)",
      "text_translation": "Kepada mereka diperlihatkan neraka, pada pagi dan petang, dan pada hari terjadinya Kiamat. (Lalu kepada malaikat diperintahkan), “Masukkanlah Fir‘aun dan kaumnya ke dalam azab yang sangat keras!”",
      "text": "اَلنَّارُ يُعْرَضُوْنَ عَلَيْهَا غُدُوًّا وَّعَشِيًّا ۚوَيَوْمَ تَقُوْمُ السَّاعَةُ ۗ اَدْخِلُوْٓا اٰلَ فِرْعَوْنَ اَشَدَّ الْعَذَابِ",
      "text_translation_en": "the fire [of the hereafter - that fire] which they had been made to contemplate [in vain], morning and evening: for on the Day when the Last Hour dawns [God will say], “Make Phar­aoh’s folk enter upon suffering most severe!”",
      "juz_number": 24
    },
    "47": {
      "text_tafsir_en": "In this verse, Allah commands Prophet Muhammad to tell the Meccans of the catastrophe that plagued Pharaoh and his people, and the grave and the afterlife that they will suffer. This is to make the news a lesson for them so that they are aware of and believe in God and His apostles. In that order, the Prophet Muhammad was asked to tell the Meccans of the disbelief of the disbelievers who disobeyed the Messenger's call when they were in hell. The followers seek their worship to be saved from the torment of hell that is upon them, or to reduce it. However, the worshipers withdrew their hands from the request because they themselves were powerless to reduce or avoid the torment they were facing. The idolaters sued them, saying, \"We were your worshipers in the world long ago; not worshiping you in the old world, we would have followed the call of the apostles, so that we would not have been cast into hell like this now. If it weren't for you, we would have been believers. \"",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan kepada Nabi Muhammad agar menceritakan kepada orang musyrik Mekah tentang malapetaka yang telah menimpa Fir'aun dan kaumnya, serta azab kubur dan akhirat yang akan mereka derita nanti. Hal ini bertujuan agar berita itu menjadi pelajaran bagi mereka sehingga mereka sadar dan beriman kepada Allah dan rasul-Nya.\n\nDalam perintah itu, Nabi Muhammad diminta untuk menceritakan kepada orang-orang musyrik Mekah tentang perbantahan orang-orang kafir yang mengingkari seruan rasul ketika mereka berada di dalam neraka nanti. Para pengikut memohon pertolongan kepada sembahannya agar diselamatkan dari azab neraka yang sedang menimpa mereka, atau menguranginya. Akan tetapi, sembahan-sembahan itu berlepas tangan dari permintaan itu karena mereka sendiri tidak berdaya mengurangi atau mengelakkan diri dari azab yang sedang menimpa mereka itu. Para penyembah berhala itu menggugat sembahan-sembahan itu dengan mengatakan, \"Kami adalah penyembah-penyembahmu waktu di dunia dahulu, dan kami adalah penjaga-penjagamu yang selalu taat kepadamu dan mencukupkan segala keperluanmu, sehingga kami mengingkari seruan rasul yang disampaikan kepada kami. Sekiranya kami tidak menyembah kamu semasa hidup di dunia dahulu, tentulah kami akan mengikuti seruan rasul, sehingga kami tidak dimasukkan ke dalam neraka seperti sekarang ini. Apakah kamu mau menghindarkan kami dari azab ini atau meringankannya dengan kesediaan kamu memikul sebagian dari azab yang telah menimpa kami ini? Seandainya bukan karena kamu sekalian, tentulah kami menjadi orang-orang yang beriman.\"",
      "text_translation": "Dan (Ingatlah), ketika mereka berbantah-bantahan dalam neraka, maka orang yang lemah berkata kepada orang-orang yang menyombongkan diri, “Sesungguhnya kami dahulu adalah pengikut-pengikutmu, maka dapatkah kamu melepaskan sebagian (azab) api neraka yang menimpa kami?”",
      "text": "وَاِذْ يَتَحَاۤجُّوْنَ فِى النَّارِ فَيَقُوْلُ الضُّعَفٰۤؤُ لِلَّذِيْنَ اسْتَكْبَرُوْٓا اِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ اَنْتُمْ مُّغْنُوْنَ عَنَّا نَصِيْبًا مِّنَ النَّارِ",
      "text_translation_en": "AND LO! They [who in life were wont to deny the truth] will contend with one another in the fire [of the hereafter]; and then the weak will say unto those who had gloried in their arrogance, “Behold, we were but your followers: can you, then, relieve us of some [of our] share of this fire?”",
      "juz_number": 24
    },
    "48": {
      "text_tafsir_en": "In this verse, Allah commands Prophet Muhammad to tell the Meccans of the catastrophe that plagued Pharaoh and his people, and the grave and the afterlife that they will suffer. This is to make the news a lesson for them so that they are aware of and believe in God and His apostles. In that order, the Prophet Muhammad was asked to tell the Meccans of the disbelief of the disbelievers who disobeyed the Messenger's call when they were in hell. The followers seek their worship to be saved from the torment of hell that is upon them, or to reduce it. However, the worshipers withdrew their hands from the request because they themselves were powerless to reduce or avoid the torment they were facing. The idolaters sued them, saying, \"We were your worshipers in the world long ago; not worshiping you in the old world, we would have followed the call of the apostles, so that we would not have been cast into hell like this now. If it weren't for you, we would have been believers. \"",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan kepada Nabi Muhammad agar menceritakan kepada orang musyrik Mekah tentang malapetaka yang telah menimpa Fir'aun dan kaumnya, serta azab kubur dan akhirat yang akan mereka derita nanti. Hal ini bertujuan agar berita itu menjadi pelajaran bagi mereka sehingga mereka sadar dan beriman kepada Allah dan rasul-Nya.\n\nDalam perintah itu, Nabi Muhammad diminta untuk menceritakan kepada orang-orang musyrik Mekah tentang perbantahan orang-orang kafir yang mengingkari seruan rasul ketika mereka berada di dalam neraka nanti. Para pengikut memohon pertolongan kepada sembahannya agar diselamatkan dari azab neraka yang sedang menimpa mereka, atau menguranginya. Akan tetapi, sembahan-sembahan itu berlepas tangan dari permintaan itu karena mereka sendiri tidak berdaya mengurangi atau mengelakkan diri dari azab yang sedang menimpa mereka itu. Para penyembah berhala itu menggugat sembahan-sembahan itu dengan mengatakan, \"Kami adalah penyembah-penyembahmu waktu di dunia dahulu, dan kami adalah penjaga-penjagamu yang selalu taat kepadamu dan mencukupkan segala keperluanmu, sehingga kami mengingkari seruan rasul yang disampaikan kepada kami. Sekiranya kami tidak menyembah kamu semasa hidup di dunia dahulu, tentulah kami akan mengikuti seruan rasul, sehingga kami tidak dimasukkan ke dalam neraka seperti sekarang ini. Apakah kamu mau menghindarkan kami dari azab ini atau meringankannya dengan kesediaan kamu memikul sebagian dari azab yang telah menimpa kami ini? Seandainya bukan karena kamu sekalian, tentulah kami menjadi orang-orang yang beriman.\"",
      "text_translation": "Orang-orang yang menyombongkan diri menjawab, “Sesungguhnya kita semua sama-sama dalam neraka karena Allah telah menetapkan keputusan antara hamba-hamba-(Nya).”",
      "text": "قَالَ الَّذِيْنَ اسْتَكْبَرُوْٓا اِنَّا كُلٌّ فِيْهَآ اِنَّ اللّٰهَ قَدْ حَكَمَ بَيْنَ الْعِبَادِ",
      "text_translation_en": "[to which] they who had [once] been arrogant will reply, “Behold, we are all in it [together]! Verily, God has judged between His creatures!”",
      "juz_number": 24
    },
    "49": {
      "text_tafsir_en": "When the Hellenists failed to seek the help of their leaders, they sought the helper of the Hell, saying, \"O guardian of Hell, ask Allah that He may relieve the torment He has inflicted on If that relief can be given to us by bringing us back to the world to live and worship, then give us back things for a while, hopefully this will ease our suffering. \"",
      "text_tafsir": "Setelah orang-orang musyrik yang sedang dalam neraka itu tidak berhasil mendapatkan pertolongan dari para pemimpinnya, maka mereka mohon pertolongan kepada penjaga neraka dengan mengatakan, \"Wahai penjaga neraka (Malaikat Malik), mohonkanlah kepada Allah agar Dia meringankan siksa yang telah ditimpakan-Nya kepada kami ini. Seandainya keringanan itu dapat diberikan kepada kami dengan mengembalikan kami ke dunia untuk hidup dan beribadah, maka kembalikanlah kami barang sesaat, mudah-mudahan hal ini dapat mengurangi penderitaan kami.\"",
      "text_translation": "Dan orang-orang yang berada dalam neraka berkata kepada penjaga-penjaga neraka Jahanam, “Mohonkanlah kepada Tuhanmu agar Dia meringankan azab atas kami sehari saja.”",
      "text": "وَقَالَ الَّذِيْنَ فِى النَّارِ لِخَزَنَةِ جَهَنَّمَ ادْعُوْا رَبَّكُمْ يُخَفِّفْ عَنَّا يَوْمًا مِّنَ الْعَذَابِ ",
      "text_translation_en": "And they who are in the fire will say to the keepers of hell, “Pray unto your Sustainer that He lighten, [though it be] for one day [only], this suffering of ours!”",
      "juz_number": 24
    },
    "50": {
      "text_tafsir_en": "The keepers of the Fire answered, \"Were not the Apostles sent before you a witness, proof, and proof that revealed the perfection of Allah, giving you directions to the path of happiness and giving you warning, of the consequences of your forbidden acts such as disobedience God.\" The Word of God: \"Have not the Apostles among you ever recited the verses of your Lord and warned you of this (day) meeting?\" (az-Zumar \/ 39: 71) They said, \"Yes, the apostles have come to us, asking us to believe in Allah and His Messenger, but we have rejected that call and we do not believe. and tormented the apostles and those who believed in him. \" The guardian of hell answered, \"If your actions and attitudes toward the world are exactly as you have described, then ask God alone. We will not pray for all unbelievers who deny the apostles. Allah wills it and it will be of no avail. For you, whether you pray or not, it will not diminish, feel the torment as a result of your own doing. \" Concerning the state of the hell, At-Tirmidzi narrated from Abu ad-Darda ', he said: The inhabitants of hell were starving against their torment. They ask for food. They were fed with thorny thistles and could not satisfy their hunger, and they ate the tree, but they became hungry. They ask for more help, and they are given food that can block the throat after they eat. They say that when in the world if they eat and choke, they ask for water, so they ask for a syrup. However, they are given very hot water which is lifted up by the pegs. As the drink approached their faces, their faces burned. When the beverage reaches their stomachs, it destroys their intestines and their stomach contents. Finally they asked the angel for help, saying, \"Pray to your Lord that He will ease the torment upon us one day.\" The angels answered, \"Did not the apostles come to you with clear evidence?\" They said, \"Yes, it's coming.\" (The keepers of Hell) say, \"Pray for (yourselves!)\" But the prayers of the infidels are in vain. (At-Tirmidzi History of Abu ad-Darda ')",
      "text_tafsir": "Para penjaga neraka itu menjawab, \"Bukankah dahulu telah diutus kepadamu rasul-rasul yang memberikan keterangan, bukti, dan dalil yang menunjukkan keesaan Allah, memberimu petunjuk-petunjuk ke jalan kebahagiaan serta menyampaikan kabar peringatan kepadamu, tentang akibat perbuatan terlarang yang kamu kerjakan seperti mengingkari Allah.\" Firman Allah:\n\n\"Apakah belum pernah datang kepadamu rasul-rasul dari kalangan kamu yang membacakan ayat-ayat Tuhanmu dan memperingatkan kepadamu akan pertemuan (dengan) harimu ini?\" (az-Zumar\/39: 71)\n\nOrang-orang musyrik itu menjawab, \"Benar, rasul-rasul telah datang kepada kami, mengajak kami beriman kepada Allah dan rasul-Nya, tetapi kami mengingkari seruan itu dan tidak mau beriman. Bahkan kami menentang dan menyiksa para rasul itu dan orang-orang yang beriman kepadanya.\"\n\nPenjaga neraka menjawab, \"Jika tindakan dan sikapmu terhadap rasul sewaktu hidup di dunia benar-benar seperti yang kamu terangkan itu, maka mohonlah sendiri kepada Allah. Kami tidak akan mendoakan semua orang kafir yang mendustakan rasul. Ingatlah, doa orang yang sepertimu itu tidak akan diperkenankan Allah dan tidak akan ada faedahnya. Bagi kamu sama saja, apakah kamu berdoa atau tidak, azab itu tidak akan berkurang sedikit pun, rasakanlah azab itu sebagai akibat perbuatan kamu sendiri.\"\n\nTentang keadaan penghuni neraka itu, at-Tirmidzi meriwayatkan dari Abu ad-Darda'., ia berkata:Penghuni neraka ditimpa kelaparan yang menandingi azab mereka. Mereka memohon bantuan makanan. Mereka diberi makanan pohon berduri yang tidak dapat menggemukkan dan tidak dapat menghilangkan lapar, lalu mereka makan pohon itu, tetapi mereka bertambah lapar. Mereka minta tolong lagi, lalu mereka diberi makanan yang dapat menyekat di kerongkogan setelah mereka makan. Mereka mengatakan bahwa ketika di dunia jika mereka makan dan tercekik, mereka minta air, maka mereka minta tolong agar diberi minuman sirup. Akan tetapi, mereka diberi air yang sangat panas yang diangkat dengan cantolan-cantolan. Apabila minuman itu mendekati muka mereka, muka mereka pun terbakar. Apabila minuman itu sampai ke perut mereka, maka minuman itu menghancurkan usus dan apa yang ada di perut mereka. Akhirnya mereka minta tolong kepada malaikat, mereka berkata, \"Mohonkanlah kepada Tuhanmu agar Dia meringankan azab atas kami sehari saja.\" Para malaikat menjawab, \"Apakah rasul-rasul belum datang kepadamu dengan membawa bukti-bukti yang nyata?\" Mereka menjawab, \"Benar, sudah datang.\" (Penjaga-penjaga Jahanam) berkata, \"Berdoalah kamu (sendiri!)\" Namun doa orang-orang kafir itu sia-sia belaka. (Riwayat at-Tirmidzi dari Abu ad-Darda')",
      "text_translation": "Maka (penjaga-penjaga Jahanam) berkata, “Apakah rasul-rasul belum datang kepadamu dengan membawa bukti-bukti yang nyata?” Mereka menjawab, “Benar, sudah datang.” (Penjaga-penjaga Jahanam) berkata, “Berdoalah kamu (sendiri!)” Namun doa orang-orang kafir itu sia-sia belaka.",
      "text": "قَالُوْٓا اَوَلَمْ تَكُ تَأْتِيْكُمْ رُسُلُكُمْ بِالْبَيِّنٰتِ ۗقَالُوْا بَلٰىۗ قَالُوْا فَادْعُوْا ۚوَمَا دُعٰۤؤُا الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ ࣖ",
      "text_translation_en": "[But the keepers of hell] will ask, “Is it not [true] that your apostles came unto you with all evidence of the truth?” Those [in the fire] will reply, “Yea, indeed.” [And the keepers of hell] will say, “Pray, then!” - for the prayer of those who deny the truth cannot lead to aught but delusion.",
      "juz_number": 24
    },
    "51": {
      "text_tafsir_en": "In this verse, God promises those who believe in help and victory in the face of their enemies. God says that He will make His apostles victorious over their enemies and will help and bless those who believe in this life and the hereafter. The ways and forms of God's help vary, sometimes by elevating their position and power over their enemies, as given to David and Solomon, sometimes by giving them victory over their enemies, as given to the Prophet Muhammad . Sometimes by inflicting on them misery and calamity, as Pharaoh and his people suffered, and sometimes by destroying the unbelievers and saving the apostles and believers alike, as did Saleh, Hud, Shuaib, and Noah and his people. In the same way, Allah gives aid to the apostles and believers on the Day of Judgment, on the day when witnesses are made up of angels, prophets, and believers. On that day they were witnesses of the deeds of the unbelievers and of the knowledge of the apostles, but they denied it.",
      "text_tafsir": "Dalam ayat ini, Allah menjanjikan kepada orang-orang yang beriman berupa pertolongan dan kemenangan dalam menghadapi musuh-musuh mereka. Allah mengatakan bahwa Dia pasti menjadikan para rasul-Nya orang-orang yang menang atas musuh-musuh mereka dan akan menolong serta membahagiakan orang-orang yang beriman dalam kehidupan dunia dan akhirat.\n\nCara dan bentuk pertolongan Allah itu bermacam-macam, adakalanya dengan meninggikan kedudukan dan kekuasaan mereka atas musuh-musuh mereka, seperti yang diberikan kepada Daud dan Sulaiman, adakalanya dengan memberikan kemenangan kepada mereka atas musuh-musuh mereka, seperti yang diberikan kepada Nabi Muhammad saw. Adakalanya juga dengan menimpakan kepada mereka kesengsaraan dan malapetaka, seperti yang dialami oleh Fir'aun dan kaumnya, dan adakalanya dengan menghancurkan orang-orang kafir dan menyelamatkan para rasul dan orang-orang yang beriman besertanya, seperti yang dialami Nabi Saleh, Hud, Syuaib, dan Nuh beserta kaumnya.\n\nDemikian pula Allah memberikan pertolongan kepada para rasul dan orang-orang yang beriman pada hari Kiamat yaitu pada hari berdirinya saksi-saksi yang terdiri dari para malaikat, para nabi, dan orang-orang yang beriman. Pada hari itu, mereka menjadi saksi atas segala perbuatan orang-orang kafir dan atas pengetahuan para rasul kepada mereka, tetapi mereka mendustakannya.",
      "text_translation": "Sesungguhnya Kami akan menolong rasul-rasul Kami dan orang-orang yang beriman dalam kehidupan dunia dan pada hari tampilnya para saksi (hari Kiamat),",
      "text": "اِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِيْنَ اٰمَنُوْا فِى الْحَيٰوةِ الدُّنْيَا وَيَوْمَ يَقُوْمُ الْاَشْهَادُۙ ",
      "text_translation_en": "BEHOLD, We shall indeed succour Our apostles and those who have attained to faith, [both] in this world’s life and on the Day when all the witnesses shall stand up",
      "juz_number": 24
    },
    "52": {
      "text_tafsir_en": "This verse explains that on the day that the witnesses testified, their reasons were no longer useful and there was no apology they could make, because all they said and did was in the form of slander and lies. Allah says: Then there is no answer to their lies, except to say, \"By Allah, O our Lord, we do not associate partners with Allah.\" (al-An'am \/ 6:23) On that day, the disbelievers were kept away from the mercy of Allah, and they received a very painful punishment in hell.",
      "text_tafsir": "Ayat ini menjelaskan bahwa pada hari dimana saksi-saksi itu mengemukakan kesaksiannya, tidak bermanfaat lagi alasan-alasan yang mereka kemukakan dan tidak ada pula permintaan maaf yang bisa mereka ajukan, karena semua yang mereka katakan dan lakukan hanyalah berupa fitnah dan dusta belaka.\n\nAllah berfirman:\n\nKemudian tidaklah ada jawaban bohong mereka, kecuali mengatakan, \"Demi Allah, ya Tuhan kami, tidaklah kami mempersekutukan Allah.\" (al-An'am\/6: 23)\n\nPada hari itu, orang-orang kafir dijauhkan dari rahmat Allah, dan mereka mendapat azab yang sangat pedih di neraka Jahanam.",
      "text_translation": "(yaitu) hari ketika permintaan maaf tidak berguna bagi orang-orang zalim dan mereka mendapat laknat dan tempat tinggal yang buruk.",
      "text": "يَوْمَ لَا يَنْفَعُ الظّٰلِمِيْنَ مَعْذِرَتُهُمْ وَلَهُمُ اللَّعْنَةُ وَلَهُمْ سُوْۤءُ الدَّارِ ",
      "text_translation_en": "the Day when their excuses will be of no avail to the evildoers, seeing that their lot will be rejection from all that is good, and a woeful hereafter.",
      "juz_number": 24
    },
    "53": {
      "text_tafsir_en": "In these verses, God describes the various helpers He has given to the apostles of the world, including Moses in the various miracles, the laws that govern human life so that they may live happily in the world and in the hereafter, and bring down to him the Scripture is to be a guide for men. Then the Book of the Law was passed on to the descendants and the people after them and served as a warning to those who were wise and kept them from doubts and prejudices. The Word of God: Truly, We have revealed the Book of the Law; in it (there is) a hint of light and light. The Book of the Prophets who surrendered to God gave judgment on the Jews, as did their priests and their priests, for they were commanded to keep the books of God and to bear witness to it. (al-Ma'idah. \/ 5: 44)",
      "text_tafsir": "Pada ayat-ayat ini, Allah menerangkan berbagai macam pertolongan yang telah diberikan-Nya kepada para rasul di dunia, di antaranya memberikan kepada Musa bermacam-macam mukjizat, berbagai hukum yang mengatur hidup manusia agar mereka bahagia hidup di dunia dan di akhirat, dan menurunkan kepadanya Kitab Taurat untuk menjadi petunjuk bagi manusia. Kemudian Kitab Taurat itu diwariskan kepada keturunan dan orang-orang sesudah mereka serta menjadi peringatan bagi orang-orang yang berakal dan menjauhkan mereka dari keragu-raguan dan prasangka yang tidak baik.\n\nFirman Allah:\n\nSungguh, Kami yang menurunkan Kitab Taurat; di dalamnya (ada) petunjuk dan cahaya. Yang dengan Kitab itu para nabi yang berserah diri kepada Allah memberi putusan atas perkara orang Yahudi, demikian juga para ulama dan pendeta-pendeta mereka, sebab mereka diperintahkan memelihara kitab-kitab Allah dan mereka menjadi saksi terhadapnya. (al-Ma'idah.\/5: 44)",
      "text_translation": "Dan sungguh, Kami telah memberikan petunjuk kepada Musa; dan mewariskan Kitab (Taurat) kepada Bani Israil,",
      "text": "وَلَقَدْاٰتَيْنَا مُوْسٰى الْهُدٰى وَاَوْرَثْنَا بَنِيْٓ اِسْرَاۤءِيْلَ الْكِتٰبَۙ ",
      "text_translation_en": "And, indeed, We bestowed aforetime [Our] guidance on Moses, and [thus] made the children of Israel heirs to the divine writ [revealed to him]",
      "juz_number": 24
    },
    "54": {
      "text_tafsir_en": "In these verses, God describes the various helpers He has given to the apostles of the world, including Moses in the various miracles, the laws that govern human life so that they may live happily in the world and in the hereafter, and bring down to him the Scripture is to be a guide for men. Then the Book of the Law was passed on to the descendants and the people after them and served as a warning to those who were wise and kept them from doubts and prejudices. The Word of God: Truly, We have revealed the Book of the Law; in it (there is) a hint of light and light. The Book of the Prophets who surrendered to God gave judgment on the Jews, as did their priests and their priests, for they were commanded to keep the books of God and to bear witness to it. (al-Ma'idah. \/ 5: 44)",
      "text_tafsir": "Pada ayat-ayat ini, Allah menerangkan berbagai macam pertolongan yang telah diberikan-Nya kepada para rasul di dunia, di antaranya memberikan kepada Musa bermacam-macam mukjizat, berbagai hukum yang mengatur hidup manusia agar mereka bahagia hidup di dunia dan di akhirat, dan menurunkan kepadanya Kitab Taurat untuk menjadi petunjuk bagi manusia. Kemudian Kitab Taurat itu diwariskan kepada keturunan dan orang-orang sesudah mereka serta menjadi peringatan bagi orang-orang yang berakal dan menjauhkan mereka dari keragu-raguan dan prasangka yang tidak baik.\n\nFirman Allah:\n\nSungguh, Kami yang menurunkan Kitab Taurat; di dalamnya (ada) petunjuk dan cahaya. Yang dengan Kitab itu para nabi yang berserah diri kepada Allah memberi putusan atas perkara orang Yahudi, demikian juga para ulama dan pendeta-pendeta mereka, sebab mereka diperintahkan memelihara kitab-kitab Allah dan mereka menjadi saksi terhadapnya. (al-Ma'idah.\/5: 44)",
      "text_translation": "untuk menjadi petunjuk dan peringatan bagi orang-orang yang berpikiran sehat.",
      "text": "هُدًى وَّذِكْرٰى لِاُولِى الْاَلْبَابِ",
      "text_translation_en": "as a [means of] guidance and a reminder for those who were endowed with insight:",
      "juz_number": 24
    },
    "55": {
      "text_tafsir_en": "God's help to the apostles and the believers was one of the circumcision as it was given to Moses. Therefore, Prophet Muhammad was asked to be patient with the attitude and actions of the Muslims who mocked Allah's verses. Allah must help him by strengthening the ranks of the Muslims and elevating the position of Islam above the beliefs they adhere to. Prophet Muhammad is commanded to repent and praise morning and evening, as Allah says: And perform the prayers on both ends of the day (morning and evening) and at the beginning night. Good deeds remove mistakes. It is a warning to those who always remember (Allah). (Hud \/ 11: 114) By always praying to Allah and praising him morning and evening, the Messenger worshiped as did the angels. Allah says: And to Him belongs the heavens and the earth. And (the angels) who are with him, have no pride in worshiping him nor are they tired. They (the angels) glorified without ceasing night and day. (al-Anbiya '\/ 21: 19-20) The Messenger of Allah (may peace be upon him) was commanded not to repent of sin, but to mean that he often repented and begged for forgiveness, so that the soul became clean and pure, and no unclean thing defiled it. If the Prophet was freed from all sin, he was told to repent, and for his people and followers. They should be quicker and more repentant. From this verse it can be understood that the Qur'an teaches believers to repent, to ask forgiveness of Allah, and to do good deeds. If a person has repented and begged for forgiveness then his soul becomes pure and clean. Charities performed by those who are clean in their souls will be accepted by God. From this verse, it can be understood that a person who is not pure and pure in his heart for not repenting and begging for forgiveness of Allah, then his deeds are not accepted by God or are not considered righteous deeds",
      "text_tafsir": "Pertolongan Allah kepada para rasul dan orang-orang yang beriman itu adalah salah satu dari sunatullah seperti yang pernah dianugerahkan kepada Musa. Oleh karena itu, Nabi Muhammad diminta untuk bersabar atas sikap dan tindakan orang-orang musyrik yang memperolok-olokkan ayat-ayat Allah. Allah pasti menolongnya dengan mengokohkan barisan kaum Muslimin dan mengangkat posisi agama Islam melebihi kepercayaan yang mereka anut Nabi Muhammad diperintahkan untuk selalu bertobat dan bertasbih pagi dan petang, sebagaimana firman Allah:\n\nDan laksanakanlah salat pada kedua ujung siang (pagi dan petang) dan pada bagian permulaan malam. Perbuatan-perbuatan baik itu menghapus kesalahan-kesalahan. Itulah peringatan bagi orang-orang yang selalu mengingat (Allah). (Hud\/11: 114)\n\nDengan selalu salat mengingat Allah dan bertasbih pagi dan petang itu, maka Rasulullah beribadah seperti yang dilakukan para malaikat. Allah berfirman:\n\nDan milik-Nya siapa yang di langit dan di bumi. Dan (malaikat-malaikat) yang di sisi-Nya, tidak mempunyai rasa angkuh untuk menyembah-Nya dan tidak (pula) merasa letih. Mereka (malaikat-malaikat) bertasbih tidak henti-hentinya malam dan siang. (al-Anbiya'\/21: 19-20)\n\nRasulullah saw diperintahkan bertobat bukan berarti beliau telah melakukan perbuatan dosa, tapi maksudnya ialah dengan sering melakukan tobat dan mohon ampun, maka jiwa semakin suci dan bersih, tidak ada satu pun kotoran yang mengotorinya. Jika Nabi yang terbebas dari segala dosa masih disuruh bertobat, maka bagi umat dan pengikutnya akan lebih lagi. Mereka harus cepat dan lebih sering bertobat.\n\nDari ayat ini dapat dipahami bahwa Al-Qur'an mengajarkan agar orang-orang yang beriman selalu bertobat, memohon ampun kepada Allah, dan mengerjakan amal saleh. Jika seseorang telah bertobat dan memohon ampun maka jiwanya menjadi suci dan bersih. Amal yang dikerjakan oleh orang yang bersih jiwanya akan langsung diterima Allah.\n\nDari ayat ini, dapat dipahami bahwa orang yang tidak suci dan bersih hatinya karena tidak bertobat dan mohon ampun kepada Allah, maka amalnya tidak diterima oleh Allah atau tidak dianggap sebagai amal yang saleh",
      "text_translation": "Maka bersabarlah kamu, sesungguhnya janji Allah itu benar, dan mohonlah ampun untuk dosamu dan bertasbihlah seraya memuji Tuhanmu pada waktu petang dan pagi.",
      "text": "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّاسْتَغْفِرْ لِذَنْۢبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِيِّ وَالْاِبْكَارِ",
      "text_translation_en": "hence, remain thou patient in adversity - for, verily, God’s promise always comes true - and ask forgiveness for thy sins, and extol thy Sustainer’s glory and praise by night and by day.",
      "juz_number": 24
    },
    "56": {
      "text_tafsir_en": "God's help to the apostles and the believers was one of the circumcision as it was given to Moses. Therefore, Prophet Muhammad was asked to be patient with the attitude and actions of the Muslims who mocked Allah's verses. Allah must help him by strengthening the ranks of the Muslims and elevating the position of Islam above the beliefs they adhere to. Prophet Muhammad is commanded to repent and praise morning and evening, as Allah says: And perform the prayers on both ends of the day (morning and evening) and at the beginning night. Good deeds remove mistakes. It is a warning to those who always remember (Allah). (Hud \/ 11: 114) By always praying to Allah and praising him morning and evening, the Messenger worshiped as did the angels. Allah says: And to Him belongs the heavens and the earth. And (the angels) who are with him, have no pride in worshiping him nor are they tired. They (the angels) glorified without ceasing night and day. (al-Anbiya '\/ 21: 19-20) The Messenger of Allah (may peace be upon him) was commanded not to repent of sin, but to mean that he often repented and begged for forgiveness, so that the soul became clean and pure, and no unclean thing defiled it. If the Prophet was freed from all sin, he was told to repent, and for his people and followers. They should be quicker and more repentant. From this verse it can be understood that the Qur'an teaches believers to repent, to ask forgiveness of Allah, and to do good deeds. If a person has repented and begged for forgiveness then his soul becomes pure and clean. Charities performed by those who are clean in their souls will be accepted by God. From this verse, it can be understood that a person who is not pure and pure in his heart for not repenting and begging for forgiveness of Allah, then his deeds are not accepted by God or are not considered righteous deeds",
      "text_tafsir": "Pertolongan Allah kepada para rasul dan orang-orang yang beriman itu adalah salah satu dari sunatullah seperti yang pernah dianugerahkan kepada Musa. Oleh karena itu, Nabi Muhammad diminta untuk bersabar atas sikap dan tindakan orang-orang musyrik yang memperolok-olokkan ayat-ayat Allah. Allah pasti menolongnya dengan mengokohkan barisan kaum Muslimin dan mengangkat posisi agama Islam melebihi kepercayaan yang mereka anut Nabi Muhammad diperintahkan untuk selalu bertobat dan bertasbih pagi dan petang, sebagaimana firman Allah:\n\nDan laksanakanlah salat pada kedua ujung siang (pagi dan petang) dan pada bagian permulaan malam. Perbuatan-perbuatan baik itu menghapus kesalahan-kesalahan. Itulah peringatan bagi orang-orang yang selalu mengingat (Allah). (Hud\/11: 114)\n\nDengan selalu salat mengingat Allah dan bertasbih pagi dan petang itu, maka Rasulullah beribadah seperti yang dilakukan para malaikat. Allah berfirman:\n\nDan milik-Nya siapa yang di langit dan di bumi. Dan (malaikat-malaikat) yang di sisi-Nya, tidak mempunyai rasa angkuh untuk menyembah-Nya dan tidak (pula) merasa letih. Mereka (malaikat-malaikat) bertasbih tidak henti-hentinya malam dan siang. (al-Anbiya'\/21: 19-20)\n\nRasulullah saw diperintahkan bertobat bukan berarti beliau telah melakukan perbuatan dosa, tapi maksudnya ialah dengan sering melakukan tobat dan mohon ampun, maka jiwa semakin suci dan bersih, tidak ada satu pun kotoran yang mengotorinya. Jika Nabi yang terbebas dari segala dosa masih disuruh bertobat, maka bagi umat dan pengikutnya akan lebih lagi. Mereka harus cepat dan lebih sering bertobat.\n\nDari ayat ini dapat dipahami bahwa Al-Qur'an mengajarkan agar orang-orang yang beriman selalu bertobat, memohon ampun kepada Allah, dan mengerjakan amal saleh. Jika seseorang telah bertobat dan memohon ampun maka jiwanya menjadi suci dan bersih. Amal yang dikerjakan oleh orang yang bersih jiwanya akan langsung diterima Allah.\n\nDari ayat ini, dapat dipahami bahwa orang yang tidak suci dan bersih hatinya karena tidak bertobat dan mohon ampun kepada Allah, maka amalnya tidak diterima oleh Allah atau tidak dianggap sebagai amal yang saleh",
      "text_translation": "Sesungguhnya orang-orang yang memperdebatkan ayat-ayat Allah tanpa alasan (bukti) yang sampai kepada mereka, yang ada dalam dada mereka hanyalah (keinginan akan) kebesaran yang tidak akan mereka capai, maka mintalah perlindungan kepada Allah. Sungguh, Dia Maha Mendengar, Maha Melihat.",
      "text": "اِنَّ الَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِ اللّٰهِ بِغَيْرِ سُلْطٰنٍ اَتٰىهُمْ ۙاِنْ فِيْ صُدُوْرِهِمْ اِلَّا كِبْرٌ مَّا هُمْ بِبَالِغِيْهِۚ فَاسْتَعِذْ بِاللّٰهِ ۗاِنَّهٗ هُوَ السَّمِيْعُ الْبَصِيْرُ",
      "text_translation_en": "Behold, as for those who call God’s messages in question without having any evidence therefore in their hearts is nothing but overweening self-con­ceit, which they will never be able to satisfy: seek thou, then, refuge with God - for, verily, He alone is all-hearing, all-seeing!",
      "juz_number": 24
    },
    "57": {
      "text_tafsir_en": "In this verse it is stated that those who deny the apostle's call and refute the verses of Allah are those who in their hearts are full of pride and arrogance. They are reluctant to accept the truth because of the influence of lust. They want to be in power and be a leader in society, and feel as the most powerful people. Their desire is what causes them to deny God's verses. According to them, that desire will not be achieved if they follow the apostle's appeal, because by following the apostle's appeal means they renounce the religion of their ancestors that they have respected so far. Then Allah explained that although the infidels always tried to destroy the Prophet Muhammad and his followers, they would not achieve that goal. Because, Allah always helped the Prophet Muhammad by demeaning, humiliating, and wiping out his enemies and their efforts. Allah then ordered the Prophet to always ask for His protection to break the deceit and effort of the polytheists. Allah is All-Heard in every request and request of His servants, knowing every vibration of the soul and seeing all the actions of His servants. (57) In this verse, Allah presents one proof of the resurrection day on the Day of Judgment. He explained that creating the heavens and the earth was \"heavier\" and \"harder\" than creating humans, both when they first created them and when they repeated them. Heaven and earth and all their contents are infinite in breadth and magnitude. There are countless planets there. There are countless animals and plants in them. Mountains and rivers that flow cannot all be traced by humans. The laws and science related to them cannot be known to all human beings. Therefore, the polytheists should never think that Allah, who created the heavens and the earth and the humans in them, was unable to resurrect humans on the Day of Resurrection or revive the dead. Nothing is difficult for God, everything is easy for Him. Allah says: And do they not notice that Allah created the heavens and the earth, and He did not feel bad about creating them, and He has the power to raise the dead? So truly, He is almighty over everything. (al-A.hqaf \/ 46: 33) Verse 57 Surah az-Zumar seems to emphasize that the creation of the universe is far more complex (large) than human creation (this is certainly in human view because for God nothing is complicated in the slightest ). Whereas from the number of writings of thought and findings, the disclosure of the theory of the creation of the universe is more and more rapid in its development compared to the development of the theory of human events which is still filled with unanswered questions and controversial facts. Judging from the time of its scientific existence, humans (homo sapiens) were estimated to have appeared 40,000 years ago, this period of time is nothing compared to the age of the universe which is estimated to have existed since 7 billion years ago, especially when compared to the history of human civilization whose traces were discovered only around 7000 years ago. It seems that our knowledge of the events of the universe is actually not more than what we know about human events. At the end of this verse, Allah explains the evidence presented and very few people are willing to think in search of the ultimate truth. They are too influenced by the temptations and pleasures of the world that are only temporary. They also do not want to hear and realize that God is almighty, that nothing can defeat Him.",
      "text_tafsir": "Pada ayat ini dinyatakan bahwa orang-orang yang meng-ingkari seruan rasul dan membantah ayat-ayat Allah adalah orang-orang yang dalam hatinya penuh dengan keangkuhan dan takabur. Mereka enggan menerima kebenaran karena pengaruh hawa nafsu. Mereka ingin berkuasa dan dijadikan pemimpin dalam masyarakat, serta merasa sebagai orang yang paling berkuasa. Keinginan mereka inilah yang menyebabkan mereka mengingkari ayat-ayat Allah. Menurut mereka, keinginan itu tidak akan tercapai jika mereka mengikuti seruan rasul, karena dengan mengikuti seruan rasul berarti mereka meninggalkan agama nenek moyang yang mereka hormati selama ini.\n\nKemudian Allah menerangkan bahwa sekalipun orang-orang kafir itu selalu berusaha untuk menghancurkan Nabi Muhammad dan para pengikutnya, namun mereka tidak akan mencapai cita-cita itu. Sebab, Allah selalu membantu Nabi Muhammad dengan merendahkan, menghinakan, dan memusnahkan musuh-musuhnya dan usaha-usaha mereka.\n\nAllah lalu memerintahkan Nabi agar selalu mohon perlindungan kepada-Nya untuk mematahkan tipu daya dan usaha orang-orang musyrik itu. Allah Maha Mendengar segala permintaan dan permohonan hamba-Nya, mengetahui setiap getaran jiwa dan melihat segala perbuatan hamba-hamba-Nya.\n\n(57) Pada ayat ini, Allah mengemukakan salah satu bukti adanya hari kebangkitan pada hari Kiamat nanti. Dia menerangkan bahwa menciptakan langit dan bumi lebih \"berat\" dan \"sukar\" dibanding dengan menciptakan manusia, baik pada waktu pertama kali menciptakannya maupun pada waktu mengulanginya kembali. Langit dan bumi beserta segala isinya tidak terhingga luas dan besarnya. Tidak terhitung jumlah planet-planet di sana. Tidak terhitung jumlah binatang dan tumbuh-tumbuhan yang ada padanya. Gunung-gunung dan sungai-sungai yang mengalir tidak bisa dilacak semua oleh manusia. Hukum-hukum dan ilmu pengetahuan yang berhubungan dengannya tidak bisa diketahui oleh manusia seluruhnya. Oleh karena itu, orang-orang musyrik jangan sekali-kali mengira bahwa Allah yang telah menciptakan langit dan bumi serta manusia yang ada di dalamnya, tidak sanggup membangkitkan manusia kembali pada hari Kiamat atau menghidupkan kembali orang-orang yang telah mati. Tidak sesuatu pun yang sukar bagi Allah, semua mudah bagi-Nya.\n\nAllah berfirman:\n\nDan tidakkah mereka memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi dan Dia tidak merasa payah karena menciptakannya, dan Dia kuasa menghidupkan yang mati? Begitulah; sungguh, Dia Mahakuasa atas segala sesuatu. (al-A.hqaf\/46: 33)\n\nAyat 57 Surah az-Zumar ini seolah menekankan bahwa penciptaan alam semesta ini jauh lebih rumit (besar) daripada penciptaan manusia (hal ini tentu dalam pandangan manusia karena bagi Allah tidak ada yang rumit sedikit pun). Padahal dari jumlah tulisan hasil pemikiran dan temuan, pengungkapan teori terciptanya alam semesta ini lebih banyak dan lebih pesat perkembangannya dibandingkan dengan perkembangan teori kejadian manusia yang sampai saat ini masih dipenuhi oleh pertanyaan-pertanyaan belum terjawab dan fakta-fakta yang kontroversial. Dilihat dari waktu keberadaannya secara ilmu pengetahuan, manusia (homo sapiens) diperkirakan muncul pada 40.000 tahun yang lalu, kurun waktu ini bukan apa-apa dibandingkan umur alam semesta yang diperkirakan telah berada semenjak 7 miliar tahun yang lalu, apalagi jika dibandingkan dengan sejarah peradaban manusia yang jejaknya ditemukan hanya sekitar 7000 tahun yang lalu. Tampaknya pengetahuan kita tentang kejadian alam semesta inipun sebenarnya tidak lebih banyak dari apa yang kita ketahui tentang kejadian manusia.\n\nPada akhir ayat ini, Allah menerangkan bukti-bukti yang dikemukakan itu dan amat sedikit manusia yang mau berpikir untuk mencari kebenaran yang hakiki. Mereka terlalu dipengaruhi hawa nafsu dan kesenangan dunia yang sifatnya hanya sementara. Mereka juga tidak mau mendengar dan menyadari bahwa Allah Mahakuasa, tidak ada sesuatu pun yang dapat mengalahkan-Nya.",
      "text_translation": "Sungguh, penciptaan langit dan bumi itu lebih besar daripada penciptaan manusia, akan tetapi kebanyakan manusia tidak mengetahui.",
      "text": "لَخَلْقُ السَّمٰوٰتِ وَالْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ",
      "text_translation_en": "Greater indeed than the creation of man is the creation of the heavens and the earth: yet most men do not understand [what this implies].",
      "juz_number": 24
    },
    "58": {
      "text_tafsir_en": "This verse explains that unlike those who disbelieve blindly from the truth, do not see and reflect on the signs and power of God in heaven and on earth with believers who seek the truth, try to convince themselves by learning and contemplated the signs of the power and greatness of God, so that they knew that the creation of the earth and the heavens and the things in them were greater and more difficult than that of man. Therefore, raising a human being is an easy task for Allah. The same is true of those who believe and do good deeds with unbelievers who always do what God forbid. It is true that few people want to reflect on the arguments presented to them, and few do. If they were to ponder until they knew the truth, they would have known the mistakes they had made and would not repeat them.",
      "text_tafsir": "Ayat ini menerangkan bahwa tidak sama di sisi Allah orang yang kafir yang buta dari kebenaran, tidak mau melihat dan memikirkan tanda-tanda kekuasaan dan kebesaran Allah di langit dan di bumi dengan orang-orang yang beriman yang mau mencari kebenaran, berusaha meyakinkan dirinya dengan mempelajari dan merenungkan tanda-tanda kekuasaan dan kebesaran Allah, sehingga mereka mengetahui bahwa penciptaan bumi dan langit beserta apa yang ada di dalamnya lebih besar dan sulit dari menciptakan manusia. Oleh karena itu, membangkitkan manusia itu adalah suatu yang mudah bagi Allah. Begitu pula tidak sama orang-orang yang beriman dan beramal saleh dengan orang-orang kafir yang selalu melakukan perbuatan yang dilarang Allah.\n\nMemang hanya sedikit manusia yang mau merenungkan dan memikirkan dalil-dalil yang dikemukakan kepada mereka dan sedikit pula yang mau mengambil pelajaran. Sekiranya mereka mau merenungkan sehingga mereka mengetahui kebenaran, tentulah mereka mengetahui pula kesalahan-kesalahan yang pernah mereka perbuat dan tidak mengulanginya lagi.",
      "text_translation": "Dan tidak sama orang yang buta dengan orang yang melihat, dan tidak (sama) pula orang-orang yang beriman dan mengerjakan kebajikan dengan orang-orang yang berbuat kejahatan. Hanya sedikit sekali yang kamu ambil pelajaran.",
      "text": "وَمَا يَسْتَوِى الْاَعْمٰى وَالْبَصِيْرُ ەۙ وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَلَا الْمُسِيْۤئُ ۗقَلِيْلًا مَّا تَتَذَكَّرُوْنَ",
      "text_translation_en": "But [then,] the blind and the seeing are not equal; and neither [can] they who have attained to faith and do good works and the doers of evil [be deemed equal]. How seldom do you keep this in mind!",
      "juz_number": 24
    },
    "59": {
      "text_tafsir_en": "After God explained the evidence of the Resurrection and the Day of Resurrection, He insisted that the Day of Resurrection must come. At that time, all mankind were brought back to life, every one of them being counted righteously before the courts of God. No one can escape God's judgment. Though the Day of Resurrection must come, it has been pointed out that unbelievers will go to hell and believers will go to heaven, but few people will believe and believe, even if they deny it.",
      "text_tafsir": "Setelah Allah menerangkan bukti-bukti adanya hari Kiamat dan hari kebangkitan, maka Dia menegaskan bahwa hari Kiamat itu pasti datang. Pada waktu itu, seluruh manusia dihidupkan kembali, setiap mereka diperhitungkan amalnya dengan penuh keadilan di hadapan mahkamah Allah. Tidak seorang pun yang dapat mengelakkan diri dari pengadilan Tuhan itu.\n\nSekalipun hari Kiamat itu pasti datang, dan telah ditegaskan bahwa orang-orang kafir akan masuk neraka dan orang-orang yang beriman akan masuk surga, namun sedikit sekali manusia yang mau percaya dan beriman, bahkan mereka mendustakannya.",
      "text_translation": "Sesungguhnya hari Kiamat pasti akan datang, tidak ada keraguan tentangnya, akan tetapi kebanyakan manusia tidak beriman.",
      "text": "اِنَّ السَّاعَةَ لَاٰتِيَةٌ لَّا رَيْبَ فِيْهَا ۖوَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يُؤْمِنُوْنَ",
      "text_translation_en": "Verily, the Last Hour is sure to come: of this there is no doubt; yet most men will not believe it.",
      "juz_number": 24
    },
    "60": {
      "text_tafsir_en": "In this verse, God commands that people pray to him. If they pray in vain He will answer that prayer. Ibn 'Abbas, adh-ahhak, and Mujahid interpreted this verse, \"Your God said,' Worship Me, I will surely reward it.\" According to them, in the Qur'an, the word prayer can also be interpreted with worship as the word of Allah says: They worship other than Allah but nothing but idolatry, and they worship nothing but evil demons. (an-Nisa '\/ 4: 117) In the hadith, the Prophet said: Prayer is worship. (At-Tirmidzi History of An-Nu'man bin Basyir) Some interpreters argue that prayer in this verse means \"prayer\". Actually prayer and worship are the same from the language side. Only the first means special while the second means general. Prayer is one form or form of worship. This is based on the hadith: Prayer is the essence of worship. (At-Tirmidzi's History of Anas bin Malik) And the Prophet's Hadith: Narrated by 'Aisha, he said, \"The Prophet asked people,' Which worship is most important? (History of al-Bukhari) According to the hadith above, the prayer in this verse can be interpreted with worship. This is reinforced by the continuation of the verse which means: \"Those who boast in their worship of Me will go into hell.\" This verse is a warning and a serious threat to those who refuse to worship God. This verse is also a revelation of God to His faithful servants so that they may find good and happiness in this world and the Hereafter. It is as if God said, \"O my servants, worship me, always worship and pray to me.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan agar manusia berdoa kepada-Nya. Jika mereka berdoa niscaya Dia akan memperkenankan doa itu.\n\nIbnu 'Abbas, adh-ahhak, dan Mujahid mengartikan ayat ini, \"Tuhan kamu berfirman, 'Beribadahlah kepada-Ku, niscaya Aku akan membalasnya dengan pahala.\" Menurut mereka, di dalam Al-Qur'an, perkataan doa bisa pula diartikan dengan ibadah seperti pada firman Allah:\n\nYang mereka sembah selain Allah itu tidak lain hanyalah inatsan (berhala), dan mereka tidak lain hanyalah menyembah setan yang durhaka. (an-Nisa'\/4: 117)\n\nDalam hadis, Nabi bersabda:\n\nDoa itu ialah ibadah. (Riwayat at-Tirmidzi dari an-Nu'man bin Basyir)\n\nSebagian ahli tafsir berpendapat bahwa doa dalam ayat ini berarti \"permohonan\".\n\nSebenarnya doa dan ibadah itu adalah sama dari sisi bahasa. Hanya yang pertama berarti khusus sedang yang kedua berarti umum. Doa adalah salah satu bentuk atau cara dari ibadah. Hal ini berdasar hadis:\n\nDoa itu adalah inti ibadah. (Riwayat at-Tirmidzi dari Anas bin Malik) \n\nDan hadis Nabi saw:\n\nDiriwayatkan dari 'aisyah, dia berkata, \"Nabi saw ditanya orang, 'Ibadah manakah yang paling utama? Beliau menjawab, 'Doa seseorang untuk dirinya.\" (Riwayat al-Bukhari) \n\nBerdasarkan hadis di atas, maka doa dalam ayat ini dapat diartikan dengan ibadah. Hal ini dikuatkan oleh lanjutan ayat yang artinya: \"Sesungguhnya orang-orang yang menyombongkan diri dari beribadah kepada-Ku akan masuk ke dalam neraka yang hina.\"\n\nAyat ini merupakan peringatan dan ancaman keras kepada orang-orang yang enggan beribadah kepada Allah. Ayat ini juga merupakan pernyataan Allah kepada hamba-hamba-Nya yang beriman agar mereka memperoleh kebaikan dan kebahagiaan di dunia dan akhirat. Seakan-akan Allah mengatakan, \"Wahai hamba-hamba-Ku, menghambalah kepada-Ku, selalulah beribadah dan berdoa kepada-Ku. Aku akan menerima ibadah dan doa yang kamu lakukan dengan ikhlas, memperkenankan permohonanmu, dan mengampuni dosa-dosamu\".",
      "text_translation": "Dan Tuhanmu berfirman, “Berdoalah kepada-Ku, niscaya akan Aku perkenankan bagimu. Sesungguhnya orang-orang yang sombong tidak mau menyembah-Ku akan masuk neraka Jahanam dalam keadaan hina dina.”",
      "text": "وَقَالَ رَبُّكُمُ ادْعُوْنِيْٓ اَسْتَجِبْ لَكُمْ ۗاِنَّ الَّذِيْنَ يَسْتَكْبِرُوْنَ عَنْ عِبَادَتِيْ سَيَدْخُلُوْنَ جَهَنَّمَ دَاخِرِيْنَ ࣖࣖࣖ ",
      "text_translation_en": "But your Sustainer says: “Call unto Me, [and] I shall respond to you! Verily, they who are too proud to worship Me will enter hell, abased!”",
      "juz_number": 24
    },
    "61": {
      "text_tafsir_en": "In this verse, God commands people to worship Him for the following reasons: 1. The one who commands worship to Him is God who makes the night a time of rest, and prepares new energy so that he can try again the next day. At night, humans generally sleep because it is a body's need that must be met. 2. What makes the light of day, which illuminates the universe so that humans can try to make ends meet. 3. Because God has an infinite number of gifts available to all of His creatures, and that gift will not last forever. At the end of this verse it is explained that most people do not want to be grateful for the favors of Allah that have been bestowed upon him. They deny the blessings, as if they enjoyed the blessings solely because of their own efforts.",
      "text_tafsir": "Pada ayat ini, Allah memerintahkan agar manusia beribadah kepada-Nya dengan alasan-alasan berikut ini:\n\n1. Yang memerintahkan agar beribadah kepada-Nya itu ialah Tuhan yang menjadikan malam sebagai waktu beristirahat, dan mempersiapkan tenaga baru agar dapat berusaha kembali esok harinya. Pada waktu malam, pada umumnya manusia tidur karena merupakan kebutuhan tubuh yang harus dipenuhi.\n\n2. Yang menjadikan siang bercahaya, yang menerangi alam semesta sehingga manusia dapat berusaha untuk mencukupi keperluan hidup.\n\n3. Karena Allah mempunyai karunia yang tidak terhingga banyaknya yang disediakan untuk seluruh makhluk-Nya, dan karunia itu tidak akan habis selama-lamanya.\n\nPada akhir ayat ini diterangkan bahwa kebanyakan manusia tidak mau mensyukuri nikmat-nikmat Allah yang telah dilimpahkan kepadanya. Mereka mengingkari nikmat, seakan-akan nikmat itu mereka peroleh semata-mata karena usaha mereka sendiri.",
      "text_translation": "Allah-lah yang menjadikan malam untukmu agar kamu beristirahat padanya; (dan menjadikan) siang terang benderang. Sungguh, Allah benar-benar memiliki karunia yang dilimpahkan kepada manusia, tetapi kebanyakan manusia tidak bersyukur.",
      "text": "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الَّيْلَ لِتَسْكُنُوْا فِيْهِ وَالنَّهَارَ مُبْصِرًا ۗاِنَّ اللّٰهَ لَذُوْ فَضْلٍ عَلَى النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَشْكُرُوْنَ",
      "text_translation_en": "IT IS GOD who has made the night for you, so that you might rest therein, and the day, to make [you] see. Behold, God is indeed limitless in His bounty unto man - but most men are ungrateful.",
      "juz_number": 24
    },
    "62": {
      "text_tafsir_en": "This verse explains that He who bestows infinite favor upon all beings is God worthy of worship, for He is the creator of all beings. Those who disbelieve will be asked why they turn away, do not worship, and disobey God. But all they worship is the creation of God, which is not worthy of worship.",
      "text_tafsir": "Ayat ini menerangkan bahwa yang melimpahkan nikmat yang tidak terhingga kepada seluruh makhluk itu adalah Tuhan yang berhak disembah, karena Dialah yang menciptakan seluruh makhluk.\n\nKepada orang-orang kafir akan ditanyakan mengapa mereka berpaling, tidak mau menyembah, dan tidak mengesakan Allah. Padahal semua yang mereka sembah itu adalah ciptaan Allah, yang tidak pantas disembah.",
      "text_translation": "Demikianlah Allah, Tuhanmu, Pencipta segala sesuatu, tidak ada tuhan selain Dia; maka bagaimanakah kamu dapat dipalingkan?",
      "text": "ذٰلِكُمُ اللّٰهُ رَبُّكُمْ خَالِقُ كُلِّ شَيْءٍۘ  لَآ اِلٰهَ اِلَّا هُوَ ۖفَاَنّٰى تُؤْفَكُوْنَ",
      "text_translation_en": "Such is God, your Sustainer, the Creator of all that exists: there is no deity save Him. How perverted, then, are your minds!",
      "juz_number": 24
    },
    "63": {
      "text_tafsir_en": "In this verse it is explained that just as the pagans were astray by worshiping gods other than Allah, so were those who preceded them astray. They disregard the verses of Allah and worship other gods solely for their ignorance and for their lust.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa sebagaimana orang-orang musyrik telah sesat karena menyembah tuhan-tuhan selain Allah, demikian juga telah sesat orang-orang yang sebelum mereka. Mereka mengingkari ayat-ayat Allah dan menyembah tuhan-tuhan yang lain semata-mata karena kebodohan mereka dan menuruti hawa nafsu belaka.",
      "text_translation": "Demikianlah orang-orang yang selalu mengingkari ayat-ayat Allah dipalingkan.",
      "text": "كَذٰلِكَ يُؤْفَكُ الَّذِيْنَ كَانُوْا بِاٰيٰتِ اللّٰهِ يَجْحَدُوْنَ",
      "text_translation_en": "[For] thus it is: perverted are the minds of those who knowingly reject God’s messages.",
      "juz_number": 24
    },
    "64": {
      "text_tafsir_en": "In this verse it is explained that God made the earth for humans as a place of residence. They live on it to enjoy the sustenance that He bestows. He also made the sky as a roof and decorated with sparkling stars that appear at night. Because of the regular circulation of the stars, there arises night, day, dark, and bright. In this verse also explained the arguments of the oneness and power of God which is in man himself. Allah has made man in the best form among His creatures and is equipped with limbs that are in accordance with the needs and interests of human life itself. He is also the one who gives humans good food and drink as His sustenance. God is the Most High God, who has the universe. At the end of this verse it is stressed that the God who bestows His mercy on humans is a God who must be worshiped. God is perfect and has a universe. God's Word: O people! Worship your Lord who created you and those who were before you, so that you will fear God. (He) who made the earth as a stretch for you and the sky as a roof, and He is the one who sent water (rain) from the sky, then He produced with (rain) the fruits as sustenance for you. Therefore do not make a match for God, but you know. (al-Baqarah \/ 2: 21-22)",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa Allah yang menjadikan bumi untuk manusia sebagai tempat kediaman. Mereka hidup di atasnya dengan menikmati rezeki yang dilimpahkan-Nya. Dia pula yang menjadikan langit sebagai atap dan dihiasi dengan bintang-bintang yang gemerlapan tampak di malam hari. Karena keteraturan peredaran bintang-bintang, timbullah malam, siang, gelap, dan terang-benderang.\n\nPada ayat ini juga diterangkan dalil-dalil keesaan dan kekuasaan Allah yang terdapat pada diri manusia sendiri. Allah telah menjadikan manusia dalam bentuk yang paling baik di antara para makhluk-Nya dan dilengkapi dengan anggota tubuh yang sesuai dengan keperluan dan kepentingan hidup manusia sendiri. Dia pulalah yang memberikan kepada manusia makanan dan minuman yang baik sebagai rezeki dari-Nya. Allah itu Tuhan yang Mahatinggi, yang memiliki semesta alam.\n\nPada akhir ayat ini ditegaskan bahwa Tuhan yang melimpahkan rahmat-Nya kepada manusia adalah Tuhan yang wajib disembah. Tuhan Yang Mahasempurna dan memiliki semesta alam. Firman Allah:\n\nWahai manusia! Sembahlah Tuhanmu yang telah menciptakan kamu dan orang-orang yang sebelum kamu, agar kamu bertakwa. (Dialah) yang menjadikan bumi sebagai hamparan bagimu dan langit sebagai atap, dan Dialah yang menurunkan air (hujan) dari langit, lalu Dia hasilkan dengan (hujan) itu buah-buahan sebagai rezeki untukmu. Karena itu janganlah kamu mengadakan tandingan-tandingan bagi Allah, padahal kamu mengetahui. (al-Baqarah\/2: 21-22)",
      "text_translation": "Allah-lah yang menjadikan bumi untukmu sebagai tempat menetap dan langit sebagai atap, dan membentukmu lalu memperindah rupamu serta memberimu rezeki dari yang baik-baik. Demikianlah Allah, Tuhanmu, Mahasuci Allah, Tuhan seluruh alam.",
      "text": "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ قَرَارًا وَّالسَّمَاۤءَ بِنَاۤءً وَّصَوَّرَكُمْ فَاَحْسَنَ صُوَرَكُمْ وَرَزَقَكُمْ مِّنَ الطَّيِّبٰتِ ۗذٰلِكُمُ اللّٰهُ رَبُّكُمْ ۚ فَتَبٰرَكَ اللّٰهُ رَبُّ الْعٰلَمِيْنَ",
      "text_translation_en": "It is God who has made the earth a resting- place for you and the sky a canopy, and has formed you - and formed you so well and provided for you sustenance out of the good things of life. Such is God, your Sustainer: hallowed, then, is God, the Sustainer of all the worlds!",
      "juz_number": 24
    },
    "65": {
      "text_tafsir_en": "This verse explains that the God who is worshiped is a God who lives eternally, who never dies. It is he who turns on and kills His creatures, apart from Him not worthy of worship. Therefore, purify submission and obedience to Him alone, never associate Him with anything. At the end of this verse it is explained that all praise is due to Allah, the Most Holy God. He who has all His creatures, both in the form of angels, jinn, humans, and all other creatures that exist in this realm. It all depends on Him, so that all the qualities of greatness and glory are in Him. Therefore, they always say: \"al-hamdulillahi Rabbil 'alamin\".",
      "text_tafsir": "Ayat ini menjelaskan bahwa Tuhan yang disembah itu adalah Tuhan yang hidup kekal, yang tidak pernah mati. Dialah yang menghidupkan dan mematikan makhluk-Nya, selain daripada-Nya tidak pantas disembah. Oleh karena itu, murnikanlah ketundukan dan ketaatan hanya kepada-Nya saja, jangan sekali-kali mempersekutukan-Nya dengan sesuatu pun.\n\nPada akhir ayat ini diterangkan bahwa segala puji bagi Allah, Tuhan Yang Maha Suci. Dialah Yang memiliki segala makhluk-Nya, baik yang berupa malaikat, jin, manusia, dan semua makhluk lain yang ada di alam ini. Semuanya itu tergantung kepada-Nya, sehingga segala sifat kebesaran dan kemuliaan ada pada-Nya. Oleh karena itu, mereka selalu mengucapkan: \"al-hamdulillahi Rabbil 'alamin\".",
      "text_translation": "Dialah yang hidup kekal, tidak ada tuhan selain Dia; maka sembahlah Dia dengan tulus ikhlas beragama kepada-Nya. Segala puji bagi Allah Tuhan seluruh alam.",
      "text": "هُوَ الْحَيُّ لَآ اِلٰهَ اِلَّا هُوَ فَادْعُوْهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ ۗ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ",
      "text_translation_en": "He is the Ever-Living; there is no deity save Him: call, then, unto Him [alone], sincere in your faith in Him. All praise is due to God, the Sustainer of all the worlds!",
      "juz_number": 24
    },
    "66": {
      "text_tafsir_en": "In these verses, Allah commands the Prophet Muhammad to tell the unbelievers and unbelievers that Allah forbids them to worship the god they worship, other than Allah. The idea of worshiping gods other than God is to desire something, to assume it has supernatural powers such as the power of God, to ask for help, and to ask for it. In this verse it is said that the gods are statues. However, this understanding includes all kinds of objects or beings worshiped and asked for help, such as rivers, sacred stones, sacred graves, and so on. Then the Messenger of Allah (may peace be upon him) ordered to declare that Allah forbade worship other than Allah, and provided proofs and interpretations in the form of Qur'anic verses, as well as orders to observe the events of this world. By pondering the events of nature and the Qur'anic verses, one would come to the conclusion that the one who is worthy of worship is Allah alone. At the end of this verse, God commands to obey and obey Him, purifying obedience only to Him, for He is the Lord of the universe.",
      "text_tafsir": "Pada ayat-ayat ini, Allah memerintahkan kepada Nabi Muhammad agar mengatakan kepada orang-orang musyrik dan orang-orang kafir bahwa Allah melarangnya menyembah tuhan yang mereka sembah, selain dari Allah.\n\nPengertian menyembah tuhan-tuhan selain Allah itu ialah menghambakan diri kepada sesuatu, menganggapnya mempunyai kekuatan gaib seperti kekuatan Allah, memohon pertolongan, dan meminta sesuatu kepadanya. Dalam ayat ini disebutkan bahwa tuhan-tuhan itu berupa patung-patung. Akan tetapi, pengertian ini mencakup segala macam benda atau makhluk yang disembah dan dimohon pertolongan kepadanya, seperti sungai-sungai, batu-batu keramat, kuburan yang dianggap keramat, dan sebagainya.\n\nSelanjutnya Rasulullah diperintahkan untuk menyatakan bahwa Allah melarangnya menyembah selain Allah, dan mengemukakan bukti-bukti dan dalil-dalil berupa ayat-ayat Al-Qur'an, maupun berupa perintah agar memperhatikan kejadian alam ini. Dengan merenungkan kejadian alam dan ayat-ayat Al-Qur'an, maka orang akan sampai kepada kesimpulan bahwa yang berhak disembah itu hanyalah Allah semata.\n\nPada akhir ayat ini, Allah memerintahkan agar tunduk dan patuh kepada-Nya, memurnikan ketaatan hanya kepada-Nya, karena Dialah Tuhan Pemilik semesta alam.",
      "text_translation": "Katakanlah (Muhammad), “Sungguh, aku dilarang menyembah sembahan yang kamu sembah selain Allah, setelah datang kepadaku keterangan-keterangan dari Tuhanku; dan aku diperintahkan agar berserah diri kepada Tuhan seluruh alam.”",
      "text": "۞ قُلْ اِنِّيْ نُهِيْتُ اَنْ اَعْبُدَ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ لَمَّا جَاۤءَنِيَ الْبَيِّنٰتُ مِنْ رَّبِّيْ وَاُمِرْتُ اَنْ اُسْلِمَ لِرَبِّ الْعٰلَمِيْنَ",
      "text_translation_en": "Say: “Since all evidence of the truth has come to me from my Sustainer, I am forbidden to worship [any of] those beings whom you invoke instead of God; and I am bidden to surrender myself to the Sustainer of all the worlds.”",
      "juz_number": 24
    },
    "67": {
      "text_tafsir_en": "He made man from the ground, a drop of semen, from a drop of semen into something sticky, and a drop of blood into a lump of flesh, and then was born into the world in human form. Jumhur scholars believe that what God created man from the earth is the human father, Adam, that God created from the earth. Some interpreters explain that what God meant to create man from the ground was that God created man from the essence of the soil. A father and a mother eat food that comes from the soil, from livestock, and from plants. Livestock feed on plants and grow using soil-derived substances. The food that the mother or father eats is the main source of egg or sperm formation. The mother's egg cells meet with the father's sperm in the mother's womb, thus forming a lump of blood and so on. God then explained that man whom He created from the earth lived in three stages; namely: 1. Childhood. 2. Adults. 3. Old age. There are some who have been forgiven by God in childhood, some in adulthood, and some who have been forgiven after adulthood. The condition of when a person dies is in the hands of God alone. The process of human creation is described in this verse to serve as a source of reflection and thought for the wise, so that they believe in the Creator of all beings.",
      "text_tafsir": "Dialah yang menjadikan manusia dari tanah, menjadi setetes mani, dari setetes mani menjadi sesuatu yang melekat, dan segumpal darah menjadi segumpal daging, kemudian dilahirkan ke dunia dalam bentuk manusia.\n\nJumhur ulama berpendapat bahwa yang dimaksud dengan Allah menciptakan manusia dari tanah ialah bapak manusia yaitu Adam yang diciptakan Allah dari tanah.\n\nSebagian ahli tafsir menerangkan bahwa yang dimaksudkan dengan Allah menjadikan manusia dari tanah ialah Allah menjadikan manusia dari sari pati yang berasal dari tanah. Seorang bapak dan seorang ibu memakan makanan yang berasal dari tanah, dari binatang ternak, dan tumbuh-tumbuhan. Binatang ternak memakan tumbuh-tumbuhan dan berkembang dengan menggunakan zat-zat yang berasal dari tanah. Makanan yang dimakan ibu atau bapak itu merupakan sumber utama untuk membentuk sel telur atau sperma. Sel telur ibu bertemu dengan sperma bapak dalam rahim ibu, sehingga menjadi segumpal darah dan seterusnya.\n\nAllah lalu menerangkan bahwa manusia yang diciptakan-Nya dari tanah itu mengalami hidup dalam tiga masa; yaitu:\n\n1. Masa kanak-kanak.\n\n2. Masa dewasa.\n\n3. Masa tua.\n\nDi antara manusia ada yang diwafatkan Allah pada masa kanak-kanak, ada pula pada masa dewasa, dan ada yang diwafatkan setelah berusia lanjut. Ketentuan kapan seorang manusia meninggal itu berada di tangan Allah semata.\n\nProses kejadian manusia itu diterangkan dalam ayat ini agar dapat menjadi bahan renungan dan pemikiran bagi orang-orang yang berakal, sehingga mereka beriman kepada Allah Pencipta seluruh makhluk.",
      "text_translation": "Dialah yang menciptakanmu dari tanah, kemudian dari setetes mani, lalu dari segumpal darah, kemudian kamu dilahirkan sebagai seorang anak, kemudian dibiarkan kamu sampai dewasa, lalu menjadi tua. Tetapi di antara kamu ada yang dimatikan sebelum itu. (Kami perbuat demikian) agar kamu sampai kepada kurun waktu yang ditentukan, agar kamu mengerti.",
      "text": "هُوَ الَّذِيْ خَلَقَكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ يُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْٓا اَشُدَّكُمْ ثُمَّ لِتَكُوْنُوْا شُيُوْخًا ۚوَمِنْكُمْ مَّنْ يُّتَوَفّٰى مِنْ قَبْلُ وَلِتَبْلُغُوْٓا اَجَلًا مُّسَمًّى وَّلَعَلَّكُمْ تَعْقِلُوْنَ",
      "text_translation_en": "It is He who creates you out of dust, and then out of a drop of sperm, and then out of a germ-cell; and then He brings you forth as children; and then [He ordains] that you reach maturity, and then, that you grow old - though some of you [He causes to] die earlier -: and [all this He ordains] so that you might reach a term set [by Him], and that you might [learn to] use your reason.",
      "juz_number": 24
    },
    "68": {
      "text_tafsir_en": "Allah commanded the Messenger to convey to the Muslims that the God who was to be worshiped was a God who revived man from nothing, revived his death, and killed all beings at the appointed time. He is the Almighty and Creator. If you want to create something, God simply says, \"Be,\" then it is something.",
      "text_tafsir": "Allah memerintahkan agar Rasulullah menyampaikan kepada orang-orang musyrik bahwa Allah yang wajib disembah itu adalah Tuhan Yang menghidupkan manusia dari tidak ada kepada ada, menghidupkan kembali sesudah matinya, dan mematikan seluruh makhluk pada waktu-waktu yang telah ditentukan-Nya. Dia adalah Tuhan Yang Mahakuasa dan Maha Pencipta. Jika berkehendak menciptakan sesuatu, Allah cukup mengatakan, \"Jadilah,\" maka jadilah sesuatu itu.",
      "text_translation": "Dialah yang menghidupkan dan mematikan. Maka apabila Dia hendak menetapkan sesuatu urusan, Dia hanya berkata kepadanya, “Jadilah!” Maka jadilah sesuatu itu.",
      "text": "هُوَ الَّذِيْ يُحْيٖ وَيُمِيْتُۚ فَاِذَا قَضٰىٓ اَمْرًا فَاِنَّمَا يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ ࣖ ",
      "text_translation_en": "It is He who grants life and deals death; and when He wills a thing to be, He but says unto it, “Be” - and it is.",
      "juz_number": 24
    },
    "69": {
      "text_tafsir_en": "Allah revealed to the Prophet Muhammad, if he did not pay attention to those who contradicted Allah's revelations which explained and proved his uniqueness and the existence of the Day of Resurrection. The disbelievers argue without giving strong or credible arguments. This shows that their infidelity and disobedience are not unreasonable. If there is a reason they give, then the reason is simply because they want to avoid Muhammad's call. Their attitude is strange and untrue. If they want to find the truth and want to follow the right beliefs, there are many reasons they can learn and pay attention to achieve that desire.",
      "text_tafsir": "Allah menyatakan kepada Nabi Muhammad, apakah ia tidak memerhatikan orang-orang yang membantah ayat-ayat Allah yang menerangkan dan membuktikan keesaan-Nya dan adanya hari kebangkitan. Orang-orang kafir itu membantah tanpa mengemukakan dalil-dalil yang kuat atau yang dapat diterima akal dan pikiran yang benar. Hal ini menunjukkan bahwa kekafiran dan keingkaran mereka itu tidak beralasan sedikit pun. Jika ada alasan yang mereka kemukakan, maka alasan itu semata-mata hanya karena ingin mengelakkan diri dari seruan Muhammad.\n\nSikap mereka yang demikian itu adalah sikap yang aneh dan tidak benar. Jika mereka ingin mencari kebenaran dan ingin mengikuti kepercayaan yang benar, amat banyak dalil-dalil yang dapat mereka pelajari dan perhatikan untuk mencapai keinginan mereka itu.",
      "text_translation": "Apakah kamu tidak memperhatikan orang-orang yang (selalu) membantah ayat-ayat Allah? Bagaimana mereka dapat dipalingkan?",
      "text": "اَلَمْ تَرَ اِلَى الَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِ اللّٰهِ ۗاَنّٰى يُصْرَفُوْنَۚ",
      "text_translation_en": "ART THOU NOT aware of how far they who call God’s messages in question have lost sight of the truth?",
      "juz_number": 24
    },
    "70": {
      "text_tafsir_en": "Those who disputed the revelations of Allah were the ones who rejected the Qur'anic verses which Allah sent to Muhammad and denied all that the Messenger had commanded by His command. In the Qur'anic verses and what the apostles said there was an order to worship God alone, to worship nothing but Him, to believe in the day of resurrection, and the laws and guidelines for the happiness of living in the world and hereafter. Those who disobey will soon find out the consequences of their disobedience. This is a very strong warning, as God says: Woe to that day for those who deny it! (al-Muthaffifin \/ 83: 10)",
      "text_tafsir": "Orang-orang yang membantah ayat-ayat Allah itu ialah orang-orang yang mendustakan ayat-ayat Al-Qur'an yang diturunkan Allah kepada Muhammad saw dan mendustakan semua yang disampaikan rasul-rasul atas perintah-Nya.\n\nDalam ayat-ayat Al-Qur'an dan apa yang disampaikan rasul-rasul itu terdapat perintah untuk menghambakan diri kepada Allah semata, tidak menyembah sesuatu pun selain Dia, meyakini adanya hari kebangkitan, dan hukum-hukum serta petunjuk untuk kebahagiaan hidup di dunia dan akhirat.\n\nOrang-orang yang ingkar itu kelak akan mengetahui akibat keingkaran mereka. Hal ini merupakan peringatan yang sangat keras, sebagaimana firman Allah:\n\nCelakalah pada hari itu, bagi orang-orang yang mendustakan! (al-Muthaffifin\/83: 10)",
      "text_translation": "(Yaitu) orang-orang yang mendustakan Kitab (Al-Qur'an) dan wahyu yang dibawa oleh rasul-rasul Kami yang telah Kami utus. Kelak mereka akan mengetahui,",
      "text": "اَلَّذِيْنَ كَذَّبُوْا بِالْكِتٰبِ وَبِمَآ اَرْسَلْنَا بِهٖ رُسُلَنَا ۗفَسَوْفَ يَعْلَمُوْنَۙ",
      "text_translation_en": "they who give the lie to this divine writ and [thus] to all [the messages] with which We sent forth Our apostles [of old]? But in time they will come to know [how blind they have been: they will know it on Judgment Day],",
      "juz_number": 24
    },
    "71": {
      "text_tafsir_en": "As a result of their disobedience, the unbelievers will suffer torment in the hereafter, when shackles and chains are tied around their necks, and then they are forced away and burned in hell. This verse has the same content and meaning with the word of God: Then surely their place of return to the Hell of hell. (ash-shaffat \/ 37: 68) And the word of Allah Hold her and drag her to the midst of hell, and pour on her head a torment (of) hot water. Feel that you are indeed a mighty, mighty man. Indeed, this is the torment you once suspected. (ad-Dukhan \/ 44: 47-50)",
      "text_tafsir": "Akibat keingkaran mereka, orang-orang kafir akan merasakan siksa di akhirat, ketika belenggu dan rantai-rantai dikalungkan ke leher mereka, kemudian mereka ditarik dengan paksa dan dibakar di dalam neraka.\n\nAyat ini sama isinya dan maksudnya dengan firman Allah:\n\nKemudian pasti tempat kembali mereka ke neraka Jahim. (ash-shaffat\/37: 68)\n\nDan firman Allah\n\nPeganglah dia kemudian seretlah dia sampai ke tengah-tengah neraka, kemudian tuangkanlah di atas kepalanya azab (dari) air yang sangat panas. Rasakanlah, sesungguhnya kamu benar-benar orang yang perkasa lagi mulia. Sungguh, inilah azab yang dahulu kamu ragukan. (ad-Dukhan\/44: 47-50)",
      "text_translation": "ketika belenggu dan rantai dipasang di leher mereka, seraya mereka diseret,",
      "text": "اِذِ الْاَغْلٰلُ فِيْٓ اَعْنَاقِهِمْ وَالسَّلٰسِلُۗ يُسْحَبُوْنَۙ",
      "text_translation_en": "when they shall have to carry the shackles and chains [of their own making] around their necks,",
      "juz_number": 24
    },
    "72": {
      "text_tafsir_en": "As a result of their disobedience, the unbelievers will suffer torment in the hereafter, when shackles and chains are tied around their necks, and then they are forced away and burned in hell. This verse has the same content and meaning with the word of God: Then surely their place of return to the Hell of hell. (ash-shaffat \/ 37: 68) And the word of Allah Hold her and drag her to the midst of hell, and pour on her head a torment (of) hot water. Feel that you are indeed a mighty, mighty man. Indeed, this is the torment you once suspected. (ad-Dukhan \/ 44: 47-50)",
      "text_tafsir": "Akibat keingkaran mereka, orang-orang kafir akan merasakan siksa di akhirat, ketika belenggu dan rantai-rantai dikalungkan ke leher mereka, kemudian mereka ditarik dengan paksa dan dibakar di dalam neraka.\n\nAyat ini sama isinya dan maksudnya dengan firman Allah:\n\nKemudian pasti tempat kembali mereka ke neraka Jahim. (ash-shaffat\/37: 68)\n\nDan firman Allah\n\nPeganglah dia kemudian seretlah dia sampai ke tengah-tengah neraka, kemudian tuangkanlah di atas kepalanya azab (dari) air yang sangat panas. Rasakanlah, sesungguhnya kamu benar-benar orang yang perkasa lagi mulia. Sungguh, inilah azab yang dahulu kamu ragukan. (ad-Dukhan\/44: 47-50)",
      "text_translation": "ke dalam air yang sangat panas, kemudian mereka dibakar dalam api,",
      "text": "فِى الْحَمِيْمِ ەۙ ثُمَّ فِى النَّارِ يُسْجَرُوْنَۚ",
      "text_translation_en": "and are dragged into burning despair, and in the end become fuel for the fire [of hell].",
      "juz_number": 24
    },
    "73": {
      "text_tafsir_en": "To those infidels who are being afflicted with a very painful torment are asked mocking questions to add to the weight of their suffering. These questions are the idols they worship other than Allah. The idols that they thought could deliver and deliver them from the torment and disaster of that day. They replied that the idols had disappeared from them, had followed a different path, and had suffered the disaster and misery that day. They acknowledge that in fact, throughout their lives they have followed false religions and beliefs and worshiped something that is not worthy of worship. At the end of this verse it is pointed out that just as Allah has left the astrologers astray, so that no act is received from them as a righteous act, so is Allah's attitude towards all the deeds done by the infidels. They cannot benefit from their deeds.",
      "text_tafsir": "Kepada orang-orang kafir yang sedang ditimpa azab yang sangat pedih itu diajukan pertanyaan-pertanyaan yang bernada mengejek untuk menambah berat penderitaan yang sedang mereka alami. Pertanyaan-pertanyaan itu ialah manakah berhala-berhala yang mereka sembah selain Allah dahulu. Berhala-berhala yang menurut mereka sanggup melepaskan dan menyelamatkan mereka dari azab dan bencana hari itu.\n\nMereka menjawab bahwa berhala-berhala itu telah menghilang dari mereka, telah mengikuti jalan yang lain, dan membiarkan mereka ditimpa bencana dan kesengsaraan pada hari itu. Mereka mengakui bahwa sebenarnya selama hidup di dunia mereka telah mengikuti agama dan kepercayaan yang salah dan menyembah sesuatu yang tidak layak disembah.\n\nPada akhir ayat ini ditegaskan bahwa sebagaimana Allah telah membiarkan sesat orang-orang musyrik, sehingga tidak ada satu perbuatan pun yang diterima dari mereka sebagai amal saleh, maka demikian pula sikap Allah terhadap semua pekerjaan yang telah dilakukan orang-orang kafir. Mereka tidak dapat mengambil manfaat sedikit pun dari amal-amal mereka.",
      "text_translation": "kemudian dikatakan kepada mereka, “Manakah berhala-berhala yang selalu kamu persekutukan,",
      "text": "ثُمَّ قِيْلَ لَهُمْ اَيْنَ مَا كُنْتُمْ تُشْرِكُوْنَۙ",
      "text_translation_en": "And then they will be asked: “Where now are those [powers] to which you were wont to ascribe divinity",
      "juz_number": 24
    },
    "74": {
      "text_tafsir_en": "To those infidels who are being afflicted with a very painful torment are asked mocking questions to add to the weight of their suffering. These questions are the idols they worship other than Allah. The idols that they thought could deliver and deliver them from the torment and disaster of that day. They replied that the idols had disappeared from them, had followed a different path, and had suffered the disaster and misery that day. They acknowledge that in fact, throughout their lives they have followed false religions and beliefs and worshiped something that is not worthy of worship. At the end of this verse it is pointed out that just as Allah has left the astrologers astray, so that no act is received from them as a righteous act, so is Allah's attitude towards all the deeds done by the infidels. They cannot benefit from their deeds.",
      "text_tafsir": "Kepada orang-orang kafir yang sedang ditimpa azab yang sangat pedih itu diajukan pertanyaan-pertanyaan yang bernada mengejek untuk menambah berat penderitaan yang sedang mereka alami. Pertanyaan-pertanyaan itu ialah manakah berhala-berhala yang mereka sembah selain Allah dahulu. Berhala-berhala yang menurut mereka sanggup melepaskan dan menyelamatkan mereka dari azab dan bencana hari itu.\n\nMereka menjawab bahwa berhala-berhala itu telah menghilang dari mereka, telah mengikuti jalan yang lain, dan membiarkan mereka ditimpa bencana dan kesengsaraan pada hari itu. Mereka mengakui bahwa sebenarnya selama hidup di dunia mereka telah mengikuti agama dan kepercayaan yang salah dan menyembah sesuatu yang tidak layak disembah.\n\nPada akhir ayat ini ditegaskan bahwa sebagaimana Allah telah membiarkan sesat orang-orang musyrik, sehingga tidak ada satu perbuatan pun yang diterima dari mereka sebagai amal saleh, maka demikian pula sikap Allah terhadap semua pekerjaan yang telah dilakukan orang-orang kafir. Mereka tidak dapat mengambil manfaat sedikit pun dari amal-amal mereka.",
      "text_translation": "(yang kamu sembah) selain Allah?”  Mereka menjawab, “Mereka telah hilang lenyap dari kami, bahkan kami dahulu tidak pernah menyembah sesuatu.” Demikianlah Allah membiarkan sesat orang-orang kafir.",
      "text": "مِنْ دُوْنِ اللّٰهِ ۗقَالُوْا ضَلُّوْا عَنَّا بَلْ لَّمْ نَكُنْ نَّدْعُوْا مِنْ قَبْلُ شَيْـًٔاۚ  كَذٰلِكَ يُضِلُّ اللّٰهُ الْكٰفِرِيْنَ",
      "text_translation_en": "side by side with God?” They will answer: “They have forsaken us - or, rather, what we were wont to invoke aforetime did not exist at all!” And they will be told:] “It is thus that God lets the deniers of the truth go astray:",
      "juz_number": 24
    },
    "75": {
      "text_tafsir_en": "This verse explains why Allah inflicts a painful punishment on unbelievers. These are because they are happy and happy without feeling guilty for life in the world performing shirk acts, such as worshiping more than one god, worshiping other gods while worshiping God, or acknowledging that there are beings other than God having supernatural powers to match his strength. In addition, they also committed evil acts, and were proud, arrogant, and cruel to men.",
      "text_tafsir": "Ayat ini menerangkan sebab-sebab Allah menimpakan azab yang pedih kepada orang-orang kafir. Di antaranya adalah karena mereka merasa gembira dan bahagia tanpa merasa berdosa selama hidup di dunia mengerjakan perbuatan-perbuatan syirik, seperti menyembah lebih dari satu tuhan, menyembah tuhan yang lain di samping menyembah Allah, atau mengakui bahwa ada makhluk-makhluk selain Allah mempunyai kekuatan gaib yang menyamai kekuatan-Nya. Di samping itu, mereka juga melakukan perbuatan-perbuatan maksiat, serta berlaku congkak, sombong, dan zalim terhadap manusia.",
      "text_translation": "Yang demikian itu disebabkan karena kamu bersuka ria di bumi (tanpa) mengindahkan kebenaran dan karena kamu selalu bersuka ria (dalam kemaksiatan).",
      "text": "ذٰلِكُمْ بِمَا كُنْتُمْ تَفْرَحُوْنَ فِى الْاَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنْتُمْ تَمْرَحُوْنَ",
      "text_translation_en": "this is an out­come of your having arrogantly exulted on earth without any [concern for what is] right, and of your having been so full of self-conceit!",
      "juz_number": 24
    },
    "76": {
      "text_tafsir_en": "Then the unbelievers were commanded to enter hell through their gates, according to the evil deeds they had done. They were also ordered to remain in Hell because it was a place worthy of those who disobeyed the Scriptures and boasted to Him.",
      "text_tafsir": "Lalu orang-orang kafir itu diperintahkan untuk masuk ke dalam neraka melalui pintu-pintunya, sesuai dengan keadaan perbuatan jahat yang telah mereka lakukan. Mereka juga diperintahkan untuk tetap berada di dalam neraka Jahanam karena itulah tempat yang layak bagi orang-orang yang mengingkari ayat-ayat Allah dan menyombongkan diri kepada-Nya.",
      "text_translation": "(Dikatakan kepada mereka), “Masuklah kamu ke pintu-pintu neraka Jahanam, dan kamu kekal di dalamnya. Maka itulah seburuk-buruk tempat bagi orang-orang yang sombong.”",
      "text": "اُدْخُلُوْٓا اَبْوَابَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَا ۚفَبِئْسَ مَثْوَى الْمُتَكَبِّرِيْنَ",
      "text_translation_en": "Enter [now] the gates of hell, therein to abide: and how vile an abode for all who are given to false pride!”",
      "juz_number": 24
    },
    "77": {
      "text_tafsir_en": "God commands His apostles to be patient in facing the actions of the apostates and to contradict His verses. The apostles were also asked to be patient and responsible for their harassment and threats. Allah declares that His promise to punish the infidels must be true and fulfilled. Allah told the Prophet that if He showed him, in the time of the Prophet, the torment which was inflicted on the Gentiles, or was not shown to the Prophet by desecrating it before the coming of the torment, then it would not mean anything to them. . On the Day of Resurrection all will return to Allah, and they will be given a fair reward. Another verse that is understood in this verse is this: If We will forgive you (before your victory), then surely We will punish them, or We will show you that which we have threatened. Indeed, We have power over them. (az-Zukhruf \/ 43: 41-42)",
      "text_tafsir": "Allah memerintahkan para rasul-Nya agar bersabar dalam menghadapi tindakan orang-orang musyrik yang mendustakan dan membantah ayat-ayat-Nya. Para rasul juga diminta bersabar dan bertawakal menghadapi gangguan dan ancaman-ancaman mereka. Allah menyatakan bahwa janji-Nya untuk mengazab orang-orang kafir pasti benar dan terlaksana.\n\nAllah mengatakan kepada Nabi saw bahwa jika Ia memperlihatkan kepadanya, di waktu Nabi masih hidup, azab yang ditimpakan kepada orang-orang musyrik, atau tidak diperlihatkan kepada Nabi azab itu dengan mewafatkannya sebelum kedatangan azab itu, maka hal itu tidak berarti apa-apa bagi mereka. Pada hari Kiamat semuanya kembali kepada Allah, lalu diberikan kepada mereka balasan yang setimpal.\n\nAyat lain yang searti dengan ayat ini ialah:\n\nMaka sungguh, sekiranya Kami mewafatkanmu (sebelum engkau mencapai kemenangan), maka sesungguhnya Kami akan tetap memberikan azab kepada mereka (di akhirat), atau Kami perlihatkan kepadamu (azab) yang telah Kami ancamkan kepada mereka. Maka sungguh, Kami berkuasa atas mereka. (az-Zukhruf\/43: 41-42)",
      "text_translation": "Maka bersabarlah engkau (Muhammad), sesungguhnya janji Allah itu benar. Meskipun Kami perlihatkan kepadamu sebagian siksa yang Kami ancamkan kepada mereka, atau pun Kami wafatkan engkau (sebelum ajal menimpa mereka), namun kepada Kamilah mereka dikembalikan.",
      "text": "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ ۚفَاِمَّا نُرِيَنَّكَ بَعْضَ الَّذِيْ نَعِدُهُمْ اَوْ نَتَوَفَّيَنَّكَ فَاِلَيْنَا يُرْجَعُوْنَ",
      "text_translation_en": "HENCE, remain thou patient in adversity - for, verily, God’s promise always comes true. And whether We show thee [in this world] something of what We hold in store for those [deniers of the truth], or whether We cause thee to die [ere that retribution takes place - know that, in the end], it is unto Us that they will be brought back.",
      "juz_number": 24
    },
    "78": {
      "text_tafsir_en": "This verse explains that God sent his apostles and prophets to the people before the Prophet Muhammad. Among the prophets and apostles whose stories are described in the Qur'an are 25 apostles, such as Noah, Idris, Abraham, Moses, Solomon, Jesus, and other apostles. In addition, many of those prophets and apostles are not mentioned in the Qur'an. From Abu Dharar he said, \"I asked, 'O Messenger of Allah, how many prophets are there?' (History of Allah) Every messenger sent by God is not capable of performing his own miracles, but can be given by God. The miracle is a proof given to the people who deny it. The form and nature of the miracle was in keeping with the circumstances, times, and places in which the living apostles lived, so that the miracles were truly believed by the people at that time. The miracle is given if God himself wants to give it. If Allah had not been willing to give it, then the miracle would not have been given to him even if the unbelievers asked for it. The miracle was given in accordance with the wisdom and wisdom of God and according to the good of the people. At the end of this verse it is explained that if the punishment of Allah had come upon those who rejected Him, then Allah would justify their case. God saves the apostles and those who believe in him from that torment, and destroys those who disobey and associate him. This can be seen in the time when Allah's punishment was upon the people of 'Ad, Allah saved the prophet Hud and his fellow believers. So is the punishment that afflicts the people of Samud and so on.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah mengutus para rasul dan nabi kepada umat-umat sebelum Nabi Muhammad. Di antara nabi dan rasul itu yang diterangkan kisahnya di dalam Al-Qur'an sebanyak 25 rasul, seperti Nabi Nuh, Idris, Ibrahim, Musa, Sulaiman, Isa, dan rasul-rasul yang lain. Di samping itu, banyak di antara para nabi dan rasul itu yang tidak disebutkan di dalam Al-Qur'an.\n\nDari Abu dzar bahwa ia berkata, \"Aku bertanya, 'Ya Rasulullah berapa jumlah nabi-nabi itu? Rasulullah saw menjawab, '124 ribu dan yang menjadi rasul di antaranya ialah 315 orang. Sebuah jumlah yang banyak.\" (Riwayat A.hmad) \n\nSetiap rasul yang diutus Allah itu tidak sanggup menciptakan mukjizat sendiri, tetapi bisa diberikan oleh Allah. Mukjizat itu sebagai bukti kerasulan yang dikemukakan kepada kaum yang mendustakannya. Bentuk dan sifat mukjizat itu disesuaikan dengan keadaan, masa, dan tempat di mana rasul penerimanya hidup, sehingga mukjizat itu benar-benar diyakini oleh umat pada waktu itu. Mukjizat itu diberikan jika Allah sendiri berkehendak memberikannya. Jika Allah belum berkehendak memberikannya, maka mukjizat itu tidak akan diberikannya walaupun orang-orang kafir memintanya. Mukjizat itu diberikan sesuai dengan hikmah dan kebijaksanaan Allah dan sesuai pula dengan kemaslahatan umat.\n\nPada akhir ayat ini diterangkan bahwa jika azab Allah telah datang menimpa orang-orang yang mendustakan-Nya, maka Allah menyelesaikan perkara mereka dengan seadil-adilnya. Allah menyelamatkan para rasul dan orang-orang yang beriman kepadanya dari azab itu, serta membinasakan orang-orang yang ingkar dan mempersekutukan-Nya. Hal ini dapat dilihat pada waktu azab Allah menimpa kaum 'Ad, Allah menyelamatkan Nabi Hud dan orang-orang yang beriman yang bersamanya. Demikian pula azab yang menimpa kaum Samud dan sebagainya.",
      "text_translation": "Dan sungguh, Kami telah mengutus beberapa rasul sebelum engkau (Muhammad), di antara mereka ada yang Kami ceritakan kepadamu dan di antaranya ada (pula) yang tidak Kami ceritakan kepadamu. Tidak ada seorang rasul membawa suatu mukjizat, kecuali seizin Allah. Maka apabila telah datang perintah Allah, (untuk semua perkara) diputuskan dengan adil. Dan ketika itu rugilah orang-orang yang berpegang kepada yang batil.",
      "text": "وَلَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِكَ مِنْهُمْ مَّنْ قَصَصْنَا عَلَيْكَ وَمِنْهُمْ مَّنْ لَّمْ نَقْصُصْ عَلَيْكَ ۗوَمَا كَانَ لِرَسُوْلٍ اَنْ يَّأْتِيَ بِاٰيَةٍ اِلَّا بِاِذْنِ اللّٰهِ ۚفَاِذَا جَاۤءَ اَمْرُ اللّٰهِ قُضِيَ بِالْحَقِّ وَخَسِرَ هُنَالِكَ الْمُبْطِلُوْنَ ࣖ ",
      "text_translation_en": "And, indeed, [O Muhammad,] We sent forth apostles before thy time; some of them We have mentioned to thee, and some of them We have not mentioned to thee. And it was not given to any apostle to bring forth a miracle other than by God’s leave. Yet when God’s will becomes manifest, judgment will [already] have been passed in all justice, and lost will be, then and there, all who tried to reduce to nothing [whatever they could not understand].",
      "juz_number": 24
    },
    "79": {
      "text_tafsir_en": "Most commentators argue that what is meant by livestock in this verse is camels, because these animals are in accordance with the characteristics mentioned in this verse. Ibn Kathir argues that what is meant is camels, cows, and goats. Camels are useful for eating, milking milk, used for transporting heavy goods and riding on the go. Cows can be used to eat meat, milked milk, and energy used to plow the soil. While the goats can be eaten by the meat and milked milk. All animals can be used fur, skin and hair. The Word of God: anAnd He made for you houses (tents) from the skin of livestock which you felt were light (carrying) when you were traveling and when you settled and (He made also) from sheep's wool, camel hair and goat hair, household appliances and pleasures (certain) times. (an-Nahl \/ 16: 80) And His words: And He has created livestock, for you there are warm (feathers) and various benefits, and some of you eat. And you gain beauty in it, when you bring it back to the stable and when you release it (to the shepherding). And he transports your burdens to a land that you cannot reach, except with difficulty. Truly, your Lord is Most Gracious, Most Merciful. (an-Nahl \/ 16: 5-7) Camels are the animals most used by people who live in the desert, as if they were inseparable from their lives and lives. It was the camel who took them to various countries in the trade business. Camels are their best friends if they are in the middle of a vast desert. Therefore, if the camel was presented by these verses to the Arabs, as one of the animals which had the most benefit, then the purpose of the parable could be understood by their minds. In the Middle Ages, the Arabs were a nation that connected the West and the East. At that time, there was trade from East to West, bringing spices to the West, and bringing handicrafts to the East. In the East, the spices are brought to South Arabia or to the Persian Gulf, then the goods are brought to Turkey through a vast desert. The main means of transportation used by the Arabs at that time were camel animals. In addition to giving examples of the benefits of livestock such as milk, energy, etc., this verse underlines their broad application to transportation, especially in terms of the ark, which generically means the ship's ark, meaning a sea travel vehicle. However, if you see that the Qur'an is the last holy book revealed to humans until the end of time, the word ark needs to be extended to all means of transportation both at sea, lake, river, swamp, or land. Also includes vehicles for transportation in the air (atmosphere) or in space where there is no air. Therefore, transportation vehicles include trains, lightning trains (shinkansen in Japan), sky lift (line) (vehicles that depend and move in the air over a cable, to hovercraft, ie vehicles in marshes or swamps. into it a speedboat vehicle that hovers above the surface of the water and can glide by occasionally touching the surface of the water and moving a few centimeters on it.In this category there is also a levitation train that is lifted a few centimeters above the rail and does not touch it. moving without friction that impedes the movement of the railroad, the train can float without touching the rail because it is loaded with the same magnetism as the rail, so there is a refuse to reject the train and the rail so that as a result the train hovers (levitate) moves without contact with the surface of the rail so that it is free from friction. Rows of vehicles that can be revised again by spacecraft such as airplanes samp ai space vehicles (outer space) in the form of rockets and satellites. Of course this list of vehicles on land, sea, and air needs to be revised with the discovery of new vehicles in accordance with technological advances, but basically all forms and modes of transportation used by humans to move, move, and dynamically to further accelerate the achievement of our life goals God blessed .",
      "text_tafsir": "Kebanyakan ahli tafsir berpendapat bahwa yang dimaksud dengan binatang ternak dalam ayat ini ialah unta, karena binatang itulah yang sesuai dengan sifat-sifat yang disebutkan pada ayat ini. Ibnu Katsir berpendapat bahwa yang dimaksud adalah unta, sapi, dan kambing. Unta berguna untuk dimakan, diperah susunya, digunakan untuk mengangkut barang yang berat dan ditunggangi dalam bepergian. Sapi bisa dimanfaatkan untuk dimakan dagingnya, diperah susunya, dan digunakan tenaganya untuk membajak tanah. Sedangkan kambing bisa dimakan dagingnya dan diperah susunya. Semua binatang itu bisa dimanfaatkan bulu, kulit, dan rambutnya. Firman Allah:\n\n¦Dan Dia menjadikan bagimu rumah-rumah (kemah-kemah) dari kulit hewan ternak yang kamu merasa ringan (membawa)nya pada waktu kamu bepergian dan pada waktu kamu bermukim dan (dijadikan-Nya pula) dari bulu domba, bulu unta, dan bulu kambing, alat-alat rumah tangga dan kesenangan sampai waktu (tertentu). (an-Nahl\/16: 80)\n\nDan firman-Nya:\n\nDan hewan ternak telah diciptakan-Nya, untuk kamu padanya ada (bulu) yang menghangatkan dan berbagai manfaat, dan sebagiannya kamu makan. Dan kamu memperoleh keindahan padanya, ketika kamu membawanya kembali ke kandang dan ketika kamu melepaskannya (ke tempat penggembalaan). Dan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, Tuhanmu Maha Pengasih, Maha Penyayang. (an-Nahl\/16: 5-7)\n\nUnta adalah binatang yang paling banyak digunakan oleh orang-orang yang hidup di padang pasir, seakan-akan unta itu tidak dapat dipisahkan dari hidup dan kehidupan mereka. Untalah yang membawa mereka ke berbagai negeri dalam usaha perdagangan. Unta merupakan sahabat setia mereka jika mereka berada di tengah-tengah padang pasir luas. \n\nOleh karena itu, jika unta dikemukakan oleh ayat-ayat ini kepada orang-orang Arab, sebagai salah satu binatang yang besar manfaatnya, maka maksud perumpamaan itu bisa dipahami oleh pikiran mereka. Pada zaman Pertengahan, bangsa Arab merupakan bangsa yang menghubungkan negeri Barat dan Timur. Pada waktu itu, terjadi perdagangan dari Timur ke Barat, membawa rempah-rempah ke Barat, dan membawa hasil kerajinan ke Timur.\n\nDi Timur, rempah-rempah itu dibawa ke Arab Selatan atau ke Teluk Persia, kemudian barang itu dibawa ke Turki melalui padang pasir yang luas. Sarana angkutan utama yang digunakan oleh orang Arab waktu itu adalah binatang unta.\n\nSelain memberikan contoh manfaat binatang ternak yaitu susu, tenaga, dan lain sebagainya, ayat ini menggarisbawahi penerapannya secara luas untuk transportasi, khususnya dalam istilah bahtera, yang secara generik berarti bahtera kapal laut, artinya wahana perjalanan laut. Akan tetapi, kalau melihat bahwa Al-Qur'an adalah kitab suci terakhir yang diturunkan untuk manusia sampai akhir zaman maka kata bahtera itu perlu diperluas artinya hingga semua wahana transportasi baik di laut, danau, sungai, rawa, maupun darat. Termasuk juga untuk wahana transportasi di udara (atmosfer) atau di luar angkasa dimana tidak ada udara.\n\nOleh karena itu, wahana transportasi itu meliputi kereta api, kereta api kilat (shinkansen di Jepang), sky lift (line) (kendaraan yang bergantung dan bergerak di udara di atas seutas kabel, sampai hovercraft yaitu kendaraan di paya-paya atau rawa. Termasuk ke dalamnya kendaraan speedboat yang melayang di atas permukaan air dan bisa meluncur dengan sesekali menyentuh permukaan air dan bergerak beberapa centimeter di atasnya. Ke dalam kategori ini ada pula levitation train yang terangkat beberapa sentimeter di atas rel dan tidak menyentuhnya. Oleh karena itu, kendaraan itu bergerak tanpa gesekan yang menghambat gerakan dari rel. Kereta api bisa melayang tanpa menyentuh rel karena bermuatan magnit yang sama dengan rel sehingga terjadi tolak menolak antara kereta dengan rel sehingga akibatnya kereta api melayang (levitate) bergerak tanpa bersentuhan dengan permukaan rel sehingga bebas dari gesekan. Deretan wahana itu bisa direvisi ulang dengan kendaraan angkasa seperti pesawat terbang sampai kendaraan luar angkasa (outer space) yang berbentuk roket dan satelit.\n\nTentu saja daftar wahana di darat, laut, maupun udara ini perlu direvisi dengan penemuan kendaraan baru sesuai dengan kemajuan teknologi, tetapi pada dasarnya semua bentuk dan wahana transportasi yang dipakai manusia berpindah, bergerak, dan berdinamika untuk lebih mempercepat mencapai sasaran hidup kita yang diridai Allah.",
      "text_translation": "Allah-lah yang menjadikan hewan ternak untukmu, sebagian untuk kamu kendarai dan sebagian lagi kamu makan.",
      "text": "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الْاَنْعَامَ لِتَرْكَبُوْا مِنْهَا وَمِنْهَا تَأْكُلُوْنَۖ",
      "text_translation_en": "It is God who [at all times works wonders for you: thus, He] provides for you [all manner of] livestock, so that on some of them you may ride, and from some derive your food,",
      "juz_number": 24
    },
    "80": {
      "text_tafsir_en": "Most commentators argue that what is meant by livestock in this verse is camels, because these animals are in accordance with the characteristics mentioned in this verse. Ibn Kathir argues that what is meant is camels, cows, and goats. Camels are useful for eating, milking milk, used for transporting heavy goods and riding on the go. Cows can be used to eat meat, milked milk, and energy used to plow the soil. While the goats can be eaten by the meat and milked milk. All animals can be used fur, skin and hair. The Word of God: anAnd He made for you houses (tents) from the skin of livestock which you felt were light (carrying) when you were traveling and when you settled and (He made also) from sheep's wool, camel hair and goat hair, household appliances and pleasures (certain) times. (an-Nahl \/ 16: 80) And His words: And He has created livestock, for you there are warm (feathers) and various benefits, and some of you eat. And you gain beauty in it, when you bring it back to the stable and when you release it (to the shepherding). And he transports your burdens to a land that you cannot reach, except with difficulty. Truly, your Lord is Most Gracious, Most Merciful. (an-Nahl \/ 16: 5-7) Camels are the animals most used by people who live in the desert, as if they were inseparable from their lives and lives. It was the camel who took them to various countries in the trade business. Camels are their best friends if they are in the middle of a vast desert. Therefore, if the camel was presented by these verses to the Arabs, as one of the animals which had the most benefit, then the purpose of the parable could be understood by their minds. In the Middle Ages, the Arabs were a nation that connected the West and the East. At that time, there was trade from East to West, bringing spices to the West, and bringing handicrafts to the East. In the East, the spices are brought to South Arabia or to the Persian Gulf, then the goods are brought to Turkey through a vast desert. The main means of transportation used by the Arabs at that time were camel animals. In addition to giving examples of the benefits of livestock such as milk, energy, etc., this verse underlines their broad application to transportation, especially in terms of the ark, which generically means the ship's ark, meaning a sea travel vehicle. However, if you see that the Qur'an is the last holy book revealed to humans until the end of time, the word ark needs to be extended to all means of transportation both at sea, lake, river, swamp, or land. Also includes vehicles for transportation in the air (atmosphere) or in space where there is no air. Therefore, transportation vehicles include trains, lightning trains (shinkansen in Japan), sky lift (line) (vehicles that depend and move in the air over a cable, to hovercraft, ie vehicles in marshes or swamps. into it a speedboat vehicle that hovers above the surface of the water and can glide by occasionally touching the surface of the water and moving a few centimeters on it.In this category there is also a levitation train that is lifted a few centimeters above the rail and does not touch it. moving without friction that impedes the movement of the railroad, the train can float without touching the rail because it is loaded with the same magnetism as the rail, so there is a refuse to reject the train and the rail so that as a result the train hovers (levitate) moves without contact with the surface of the rail so that it is free from friction. Rows of vehicles that can be revised again by spacecraft such as airplanes samp ai space vehicles (outer space) in the form of rockets and satellites. Of course this list of vehicles on land, sea, and air needs to be revised with the discovery of new vehicles in accordance with technological advances, but basically all forms and modes of transportation used by humans to move, move, and dynamically to further accelerate the achievement of our life goals God blessed .",
      "text_tafsir": "Kebanyakan ahli tafsir berpendapat bahwa yang dimaksud dengan binatang ternak dalam ayat ini ialah unta, karena binatang itulah yang sesuai dengan sifat-sifat yang disebutkan pada ayat ini. Ibnu Katsir berpendapat bahwa yang dimaksud adalah unta, sapi, dan kambing. Unta berguna untuk dimakan, diperah susunya, digunakan untuk mengangkut barang yang berat dan ditunggangi dalam bepergian. Sapi bisa dimanfaatkan untuk dimakan dagingnya, diperah susunya, dan digunakan tenaganya untuk membajak tanah. Sedangkan kambing bisa dimakan dagingnya dan diperah susunya. Semua binatang itu bisa dimanfaatkan bulu, kulit, dan rambutnya. Firman Allah:\n\n¦Dan Dia menjadikan bagimu rumah-rumah (kemah-kemah) dari kulit hewan ternak yang kamu merasa ringan (membawa)nya pada waktu kamu bepergian dan pada waktu kamu bermukim dan (dijadikan-Nya pula) dari bulu domba, bulu unta, dan bulu kambing, alat-alat rumah tangga dan kesenangan sampai waktu (tertentu). (an-Nahl\/16: 80)\n\nDan firman-Nya:\n\nDan hewan ternak telah diciptakan-Nya, untuk kamu padanya ada (bulu) yang menghangatkan dan berbagai manfaat, dan sebagiannya kamu makan. Dan kamu memperoleh keindahan padanya, ketika kamu membawanya kembali ke kandang dan ketika kamu melepaskannya (ke tempat penggembalaan). Dan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, Tuhanmu Maha Pengasih, Maha Penyayang. (an-Nahl\/16: 5-7)\n\nUnta adalah binatang yang paling banyak digunakan oleh orang-orang yang hidup di padang pasir, seakan-akan unta itu tidak dapat dipisahkan dari hidup dan kehidupan mereka. Untalah yang membawa mereka ke berbagai negeri dalam usaha perdagangan. Unta merupakan sahabat setia mereka jika mereka berada di tengah-tengah padang pasir luas. \n\nOleh karena itu, jika unta dikemukakan oleh ayat-ayat ini kepada orang-orang Arab, sebagai salah satu binatang yang besar manfaatnya, maka maksud perumpamaan itu bisa dipahami oleh pikiran mereka. Pada zaman Pertengahan, bangsa Arab merupakan bangsa yang menghubungkan negeri Barat dan Timur. Pada waktu itu, terjadi perdagangan dari Timur ke Barat, membawa rempah-rempah ke Barat, dan membawa hasil kerajinan ke Timur.\n\nDi Timur, rempah-rempah itu dibawa ke Arab Selatan atau ke Teluk Persia, kemudian barang itu dibawa ke Turki melalui padang pasir yang luas. Sarana angkutan utama yang digunakan oleh orang Arab waktu itu adalah binatang unta.\n\nSelain memberikan contoh manfaat binatang ternak yaitu susu, tenaga, dan lain sebagainya, ayat ini menggarisbawahi penerapannya secara luas untuk transportasi, khususnya dalam istilah bahtera, yang secara generik berarti bahtera kapal laut, artinya wahana perjalanan laut. Akan tetapi, kalau melihat bahwa Al-Qur'an adalah kitab suci terakhir yang diturunkan untuk manusia sampai akhir zaman maka kata bahtera itu perlu diperluas artinya hingga semua wahana transportasi baik di laut, danau, sungai, rawa, maupun darat. Termasuk juga untuk wahana transportasi di udara (atmosfer) atau di luar angkasa dimana tidak ada udara.\n\nOleh karena itu, wahana transportasi itu meliputi kereta api, kereta api kilat (shinkansen di Jepang), sky lift (line) (kendaraan yang bergantung dan bergerak di udara di atas seutas kabel, sampai hovercraft yaitu kendaraan di paya-paya atau rawa. Termasuk ke dalamnya kendaraan speedboat yang melayang di atas permukaan air dan bisa meluncur dengan sesekali menyentuh permukaan air dan bergerak beberapa centimeter di atasnya. Ke dalam kategori ini ada pula levitation train yang terangkat beberapa sentimeter di atas rel dan tidak menyentuhnya. Oleh karena itu, kendaraan itu bergerak tanpa gesekan yang menghambat gerakan dari rel. Kereta api bisa melayang tanpa menyentuh rel karena bermuatan magnit yang sama dengan rel sehingga terjadi tolak menolak antara kereta dengan rel sehingga akibatnya kereta api melayang (levitate) bergerak tanpa bersentuhan dengan permukaan rel sehingga bebas dari gesekan. Deretan wahana itu bisa direvisi ulang dengan kendaraan angkasa seperti pesawat terbang sampai kendaraan luar angkasa (outer space) yang berbentuk roket dan satelit.\n\nTentu saja daftar wahana di darat, laut, maupun udara ini perlu direvisi dengan penemuan kendaraan baru sesuai dengan kemajuan teknologi, tetapi pada dasarnya semua bentuk dan wahana transportasi yang dipakai manusia berpindah, bergerak, dan berdinamika untuk lebih mempercepat mencapai sasaran hidup kita yang diridai Allah.",
      "text_translation": "Dan bagi kamu (ada lagi) manfaat-manfaat yang lain padanya (hewan ternak itu) dan agar kamu mencapai suatu keperluan (tujuan) yang tersimpan dalam hatimu (dengan mengendarainya). Dan dengan mengendarai binatang-binatang itu, dan di atas kapal mereka diangkut.",
      "text": "وَلَكُمْ فِيْهَا مَنَافِعُ وَلِتَبْلُغُوْا عَلَيْهَا حَاجَةً فِيْ صُدُوْرِكُمْ وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُوْنَۗ",
      "text_translation_en": "and find [yet other] benefits in them; and that through them you may attain to the fulfillment of [many] a heartfelt need: for on them, as on ships, you are borne [through life].",
      "juz_number": 24
    },
    "81": {
      "text_tafsir_en": "Thus God shows to men the signs of His power and greatness. In fact, none of these signs are invisible or unreasonable, so there is no way for humans to ignore them. If they deny it, then the reason for the refusal is the only reason they are looking for it.",
      "text_tafsir": "Demikianlah Allah memperlihatkan kepada manusia tanda-tanda kekuasaan dan kebesaran-Nya. Sebenarnya tidak ada satu pun di antara tanda-tanda itu yang tidak dapat dilihat atau tidak sesuai dengan akal pikiran, sehingga tidak ada jalan bagi manusia untuk mengingkarinya. Jika mereka mengingkarinya, maka alasan keingkaran itu hanyalah alasan yang dicari-cari.",
      "text_translation": "Dan Dia memperlihatkan tanda-tanda (kebesaran-Nya) kepadamu. Lalu tanda-tanda (kebesaran) Allah yang mana yang kamu ingkari?",
      "text": "وَيُرِيْكُمْ اٰيٰتِهٖۖ فَاَيَّ اٰيٰتِ اللّٰهِ تُنْكِرُوْنَ",
      "text_translation_en": "And [thus] He displays His wonders before you: which, then, of God’s wonders can you still deny?",
      "juz_number": 24
    },
    "82": {
      "text_tafsir_en": "Through this verse, God asks whether the Meccans of the Mecca, who disbelieved in the revelations of God given to them, never traveled and traveled to other countries? In fact, they are tourists and travelers who have traveled to various countries to trade. They traveled to Yemen, South Arabia, and Syria at every season and time, in accordance with the form of trade at that time. On their way through countries previously inhabited by nations, such as the 'Ad', Samud, Aikah, Egypt, Babylon, and so on. From the ruins they saw in the land, and the stories they received from their ancestors, they know that there were once mighty nations, high culture, and conquering the surrounding country. They carved mountains for their houses, made sturdy pyramids, and so on. However, because of the disobedience to God's messengers, they were punished by Allah. At that time, nothing could save them from the torment of Allah. The Meccans, who have not been able to match the results of the ancient peoples, will suffer the same fate if they disobey Muhammad's message. No one can save them from the torment of Allah.",
      "text_tafsir": "Melalui ayat ini, Allah mempertanyakan apakah orang-orang musyrik Mekah, yang mengingkari ayat-ayat Allah yang disampaikan kepada mereka, tidak pernah berjalan dan bepergian ke negeri-negeri lain? Sebenarnya mereka adalah para perantau dan para musafir yang telah pergi ke berbagai negeri dalam melakukan perdagangan. Mereka pergi ke Yaman, Arab Selatan, dan Syria pada setiap musim dan waktu, sesuai dengan bentuk perdagangan waktu itu. Dalam perjalanan mereka melalui negeri-negeri yang pernah didiami oleh umat-umat dahulu, seperti negeri kaum 'Ad, Samud, penduduk Aikah, Mesir, Babilonia, dan sebagainya. \n\nDari bekas-bekas reruntuhan yang mereka lihat di negeri itu, dan cerita yang mereka terima dari leluhurnya, mereka mengetahui bahwa di negeri-negeri itu pernah ada umat-umat yang gagah perkasa, berkebudayaan tinggi, dan telah menaklukkan negeri-negeri sekitarnya. Mereka memahat gunung untuk rumah-rumah mereka, membuat piramida-piramida yang kokoh, dan sebagainya. Akan tetapi, karena keingkaran kepada rasul-rasul Allah yang diutus, maka mereka pun ditimpa azab Allah. Di saat itu, tidak ada sesuatu pun yang dapat menyelamatkan mereka dari azab Allah. Orang-orang musyrik Mekah, yang belum dapat menandingi hasil yang pernah dicapai oleh umat-umat dahulu itu, akan mengalami nasib seperti mereka jika tetap mengingkari kerasulan Muhammad saw. Tidak seorang pun yang dapat menyelamatkan mereka dari azab Allah itu.",
      "text_translation": "Maka apakah mereka tidak mengadakan perjalanan di bumi, lalu mereka memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka. Mereka itu lebih banyak dan lebih hebat kekuatannya serta (lebih banyak) peninggalan-peninggalan peradabannya di bumi, maka apa yang mereka usahakan itu tidak dapat menolong mereka.",
      "text": "اَفَلَمْ يَسِيْرُوْا فِى الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ مِنْ قَبْلِهِمْ ۗ كَانُوْٓا اَكْثَرَ مِنْهُمْ وَاَشَدَّ قُوَّةً وَّاٰثَارًا فِى الْاَرْضِ فَمَآ اَغْنٰى عَنْهُمْ مَّا كَانُوْا يَكْسِبُوْنَ",
      "text_translation_en": "HAVE THEY, then, never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time? More numerous were they, and greater in power than they are, and in the impact which they left on earth: but all that they ever achieved was of no avail to them –",
      "juz_number": 24
    },
    "83": {
      "text_tafsir_en": "In this verse it is said that to the ancients came the apostles whom God had sent with strong and clear arguments and explanations. However, they continued to reject it even against the apostles' call. They showed the apostles how strong their faith in their religion was. They thought that the knowledge they had was pure knowledge and that they mocked the apostles. Those disbelievers will suffer a heavy torment in the hereafter. Their words are spoken in the word of God: ¦ And nothing can destroy us except time. (al-Jatsiyah \/ 45: 24) And Allah says: 'If Allah wills, we will not associate with Him, nor will our forefathers (al-An'am \/ 6: 148)",
      "text_tafsir": "Dalam ayat ini disebutkan bahwa kepada umat-umat terdahulu telah datang rasul-rasul yang diutus Allah dengan membawa dalil-dalil dan keterangan-keterangan yang kuat dan nyata. Akan tetapi, mereka tetap mengingkarinya bahkan menentang seruan para rasul itu. Mereka memperlihatkan kepada para rasul itu betapa kuatnya keyakinan mereka terhadap agama yang mereka anut. Mereka menyangka bahwa ilmu yang mereka peroleh itu adalah ilmu yang tiada tara sehingga mereka memperolok-olokkan para rasul itu. Orang-orang kafir itu akan ditimpa azab yang berat di akhirat.\n\nUcapan-ucapan mereka itu disebutkan dalam firman Allah:\n\n¦ Dan tidak ada yang membinasakan kita selain masa. (al-Jatsiyah\/45: 24)\n\nDan firman Allah:\n\n¦Jika Allah menghendaki, tentu kami tidak akan mempersekutukan-Nya, begitu pula nenek moyang kami¦ (al-An'am\/6: 148)",
      "text_translation": "Maka ketika para rasul datang kepada mereka dengan membawa bukti-bukti yang nyata, mereka merasa senang dengan ilmu yang ada pada mereka dan mereka dikepung oleh (azab) yang dahulu mereka memperolok-olokkannya.",
      "text": "فَلَمَّا جَاۤءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِ فَرِحُوْا بِمَا عِنْدَهُمْ مِّنَ الْعِلْمِ وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
      "text_translation_en": "for when their apostles came to them with all evidence of the truth, they arrogantly exulted in whatever knowledge they [already] possessed: and [so, in the end,] they were overwhelmed by the very thing which they were wont to deride.",
      "juz_number": 24
    },
    "84": {
      "text_tafsir_en": "This verse describes the true character and belief in God. Humans basically believe that God is the One, the Almighty and the One who delights in His servants. It can be covered by circumstances that affect human life. When they are in power, wealthy, and dominated by their passions, they forget God, even seeking other gods to worship, according to the demands of their passions. When they are in danger, danger, sadness, and so on, they come back to their memories of the God who created them. At the same time, they disobey the gods they invented. There are many examples and parables that God gives in His verses on this subject. There are many people who have such qualities, such as Pharaoh, Karun, and so on.",
      "text_tafsir": "Ayat ini menerangkan watak dan kepercayaan manusia yang sebenarnya kepada Allah. Manusia pada dasarnya mempercayai bahwa Tuhan itu adalah Esa, Dialah Yang Mahakuasa dan yang memberikan nikmat kepada hamba-hamba-Nya. Kepercayaan itu dapat tertutupi oleh keadaan yang memengaruhi kehidupan manusia. Jika sedang berkuasa, kaya, dan dikuasai oleh hawa nafsunya, mereka lupa kepada Allah, bahkan mencari tuhan-tuhan yang lain yang akan disembah, sesuai dengan tuntutan hawa nafsunya. Jika mereka ditimpa bahaya, malapetaka, kesedihan, dan sebagainya, mereka kembali ingat dan menghambakan diri kepada Tuhan yang menciptakannya. Di saat itu pula mereka mengingkari tuhan-tuhan yang mereka ada-adakan.\n\nBanyak contoh dan perumpamaan yang dikemukakan Allah dalam ayat-ayat-Nya sehubungan dengan hal ini. Banyak pula orang-orang yang mempunyai sifat-sifat yang demikian, seperti Fir'aun, Karun, dan sebagainya.",
      "text_translation": "Maka ketika mereka melihat azab Kami, mereka berkata, “Kami hanya beriman kepada Allah saja dan kami ingkar kepada sembahan-sembahan yang telah kami persekutukan dengan Allah.”",
      "text": "فَلَمَّا رَاَوْا بَأْسَنَاۗ قَالُوْٓا اٰمَنَّا بِاللّٰهِ وَحْدَهٗ وَكَفَرْنَا بِمَا كُنَّا بِهٖ مُشْرِكِيْنَ",
      "text_translation_en": "And then, when they [clearly] beheld Our punishment, they said: “We have come to believe in the One God, and we have renounced all belief in that to which we were wont to ascribe a share in His divinity!”",
      "juz_number": 24
    },
    "85": {
      "text_tafsir_en": "This verse confirms that the confession of people's faith as explained above, there is no benefit anymore if the punishment of God has come. The door to repentance has been closed to them, as Allah said to Pharaoh when he would sink: \"So when Pharaoh was almost drowned he said,\" I believe that there is no god but God whom the Children of Israel believe, and I am among those Muslim (surrender). \" Why only now (you believe), when in fact you have been ungodly since long ago, and you are among those who do mischief. (Jonah \/ 10: 90-91) This verse gives a warning that faith will be beneficial to someone if he has faith in God in his life in this mortal world, his mind and heart feel the greatness and power of God and he feels that his life and death depend on -His. If he made a mistake, he immediately repented and promised not to make a mistake again. What is explained is God's laws that apply to everyone. Faith is of no use when they see doom. At that time there is no more use of faith and all those who disbelieve will lose.",
      "text_tafsir": "Ayat ini menegaskan bahwa pengakuan iman orang-orang seperti diterangkan ayat di atas, tidak ada manfaatnya lagi jika azab Allah telah datang. Pintu tobat telah tertutup bagi mereka, seperti firman Allah kepada Fir'aun waktu ia akan tenggelam:\n\n¦Sehingga ketika Fir'aun hampir tenggelam dia berkata, \"Aku percaya bahwa tidak ada tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan aku termasuk orang-orang Muslim (berserah diri).\" Mengapa baru sekarang (kamu beriman), padahal sesungguhnya engkau telah durhaka sejak dahulu, dan engkau termasuk orang yang berbuat kerusakan. (Yunus\/10: 90-91)\n\nAyat ini memberi peringatan bahwa iman itu akan berfaedah bagi seseorang apabila ia beriman kepada Allah dalam kehidupannya di dunia yang fana ini, pikiran dan hatinya merasakan kebesaran dan kekuasaan Allah dan ia merasa bahwa hidup dan matinya bergantung pada-Nya. Jika melakukan kesalahan, ia pun segera bertobat dan berjanji tidak akan melakukan kesalahan lagi.\n\nYang diterangkan itu adalah hukum-hukum Tuhan yang berlaku bagi semua orang. Iman itu tidak ada faedahnya lagi di kala mereka melihat azab. Pada saat itu tidak ada lagi gunanya iman dan semua orang-orang yang kafir akan merugi.",
      "text_translation": "Maka iman mereka ketika mereka telah melihat azab Kami tidak berguna lagi bagi mereka. Itulah (ketentuan) Allah yang telah berlaku terhadap hamba-hamba-Nya. Dan ketika itu rugilah orang-orang kafir.",
      "text": "فَلَمْ يَكُ يَنْفَعُهُمْ اِيْمَانُهُمْ لَمَّا رَاَوْا بَأْسَنَا ۗسُنَّتَ اللّٰهِ الَّتِيْ قَدْ خَلَتْ فِيْ عِبَادِهِۚ وَخَسِرَ هُنَالِكَ الْكٰفِرُوْنَ ࣖ ",
      "text_translation_en": "But their attaining to faith after they had beheld Our punishment could not possibly benefit them such being the way of God that has always obtained for His creatures -: and so, then and there, lost were they who had denied the truth.",
      "juz_number": 24
    }
  },
  "name": "غافر",
  "name_translation_en": "The Forgiver",
  "name_translation": "Maha Pengampun",
  "name_latin": "Gafir"
}