{
  "number": 42,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 53,
  "ayat": {
    "1": {
      "text_tafsir_en": "These two verses consist of letters of pilgrimage, as found at the beginning of several surahs of the Qur'an. Interpreters disagree about the meaning of the letters. Then please consider this issue in \"The Qur'an and its Interpretation\" volume I, which is the first verse of Surah al-Baqarah. \"",
      "text_tafsir": "Kedua ayat ini terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah Al-Qur'an. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya dipersilakan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\"",
      "text_translation": "Ha Mim",
      "text": " حٰمۤ  ۚ ",
      "text_translation_en": "Ha. Mim.",
      "juz_number": 25
    },
    "2": {
      "text_tafsir_en": "These two verses consist of letters of pilgrimage, as found at the beginning of several surahs of the Qur'an. Interpreters disagree about the meaning of the letters. Then please consider this issue in \"The Qur'an and its Interpretation\" volume I, which is the first verse of Surah al-Baqarah. \"",
      "text_tafsir": "Kedua ayat ini terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah Al-Qur'an. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya dipersilakan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\"",
      "text_translation": "Ain Sin Qaf",
      "text": "عۤسۤقۤ  ۗ  ",
      "text_translation_en": "Ayn. Sin. Qaf.",
      "juz_number": 25
    },
    "3": {
      "text_tafsir_en": "In this verse, Almighty Allah, the Almighty explains that what was revealed to the Prophet Muhammad among others so that he preached about the monotheism of Allah, as well as the prophecies, believed in the last days, repaired it with moral code and kept it from low things. and despised, practiced for personal and public happiness, it has been revealed to the prophets before. The Message of Allah: And We did not send a messenger before you (Muhammad), but We revealed to him that there is no god but me, so worship me. (al-Anbiya '\/ 21: 25) In another verse Allah says: We have revealed to you (Muhammad) just as We revealed to Noah and the prophets thereafter, and We revealed (again) to Abraham, Ishmael, Isaac, Jacob and her grandchildren; Jesus, Job, Jonah, Aaron and Solomon. And We have given the Book of Psalms to David. (Nisa '\/ 4: 163)",
      "text_tafsir": "Pada ayat ini, Allah Yang Mahaperkasa lagi Mahabijaksana menjelaskan bahwa apa yang diwahyukan kepada Nabi Muhammad saw antara lain supaya ia berdakwah mengenai tauhid mengesakan Allah, juga mengenai kenabian, beriman kepada hari akhir, memperbaiki diri dengan akhlak karimah dan menjauhkannya dari hal-hal yang rendah dan hina, beramal untuk kebahagiaan pribadi dan masyarakat semuanya itu, hal ini telah diwahyukan pula kepada nabi-nabi sebelumnya. Firman Allah: \n\nDan Kami tidak mengutus seorang rasul pun sebelum engkau (Muhammad), melainkan Kami wahyukan kepadanya, bahwa tidak ada tuhan (yang berhak disembah) selain Aku, maka sembahlah Aku. (al-Anbiya'\/21: 25)\n\nDalam ayat lain Allah berfirman:\n\nSesungguhnya Kami mewahyukan kepadamu (Muhammad) sebagaimana Kami telah mewahyukan kepada Nuh dan nabi-nabi setelahnya, dan Kami telah mewahyukan (pula) kepada Ibrahim, Ismail, Ishak, Yakub dan anak cucunya; Isa, Ayyub, Yunus, Harun dan Sulaiman. Dan Kami telah memberikan Kitab Zabur kepada Daud. (an-Nisa'\/4: 163)",
      "text_translation": "Demikianlah Allah Yang Mahaperkasa, Mahabijaksana mewahyukan kepadamu (Muhammad) dan kepada orang-orang yang sebelummu.",
      "text": "كَذٰلِكَ يُوْحِيْٓ اِلَيْكَ وَاِلَى الَّذِيْنَ مِنْ قَبْلِكَۙ اللّٰهُ الْعَزِيْزُ الْحَكِيْمُ ",
      "text_translation_en": "THUS has God, the Almighty, the Wise, revealed [the truth] unto thee, [O Muhammad,] and unto those who preceded thee:",
      "juz_number": 25
    },
    "4": {
      "text_tafsir_en": "In this verse God explains that He is the One who rules and has all that is in the heavens and all that is in the earth. This shows his unlimited power. He can do whatever he wants with his body. Everything that exists, must submit to Him. He rules everything, He is the Most High, there is no kingdom or power higher than Him. He is great. To Him belongs all that is in the heavens and that which is on the earth, the creation and possession of God without limit to His creatures. He is supreme in all His affairs, law, and preservation. Holy God, there is no God but Him.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Dia-lah yang menguasai dan memiliki semua yang ada di langit dan semua yang ada di bumi. Ini menunjukkan kekuasaan-Nya yang tidak terbatas. Dia bisa saja berbuat sekehendaknya sesuai dengan iradat-Nya. Semua yang ada, harus tunduk kepada-Nya. Dia-lah yang mengatur segala yang ada, Dia Mahatinggi, tiada suatu kerajaan atau kekuasaan yang lebih tinggi daripada-Nya. Dia Mahabesar. \n\nKepunyaan-Nyalah apa yang ada di langit dan apa yang ada di bumi, ciptaan dan pemilikan Allah tanpa terbatas pada makhluk-Nya. Dia Mahaagung akan segala urusan, hukum, dan pemeliharaan-Nya. Mahasuci Allah, tiada Tuhan selain Dia.",
      "text_translation": "Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Dan Dialah Yang Mahaagung, Mahabesar.",
      "text": "لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ وَهُوَ الْعَلِيُّ الْعَظِيْمُ ",
      "text_translation_en": "His is all that is in the heavens and all that is on earth; and most exalted, tremendous is He.",
      "juz_number": 25
    },
    "5": {
      "text_tafsir_en": "In this verse, God explains that because of His greatness and greatness and greatness, the heavens are almost cracked, broken, and fallen. The angels are always glorifying God for all their shortcomings, praising and thanking Him for all the blessings bestowed upon them, obeying and obeying His commands, never doing evil and disobeying Him, as God says: They (angels) (adorable) the endless splendor of night and day. (al-Anbiya '\/ 21: 20) And He says: He is not rebellious against Allah for what He commands them and always does what He commands. (at-Tahrim \/ 66: 6) Angels also continually ask God to forgive the sins of the believers on this earth, and to inspire them so that they are constantly on the path of good that leads to happiness. The angel is likened to a light that gives life its warmth, and guides its light. In accordance with what is said in the Word of God: (the angels) who bear 'the Apostle and (the angels) around him glorify his Lord and believe in him and seek forgiveness for those who believe (say) , \"O our Lord, the grace and the knowledge that is in thee cover all things, so grant forgiveness to those who repent and follow Your way (religion) and keep them from the torment of the flaming fire.\" (7) This fifth verse confirms that Allah is Forgiving, forgiving every one who returns and repents to Him with penance, and every creature has the right to obtain mercy and mercy from Him. unbelievers and the wicked, it is His mercy and mercy toward them.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa karena kemahabesaran dan kemahatinggian serta kehebatan-Nya, maka hampir saja langit retak, pecah berantakan, dan berguguran. Para malaikat senantiasa bertasbih menyucikan Allah dari segala sifat kekurangan, memuji dan mensyukuri-Nya atas segala nikmat yang telah diberikan kepada mereka, taat dan patuh kepada perintah-Nya, tak pernah berbuat maksiat dan durhaka kepada-Nya, sebagaimana firman Allah:\n\nMereka (malaikat-malaikat) bertasbih tidak henti-hentinya malam dan siang. (al-Anbiya'\/21: 20)\n\nDan firman-Nya:\n\nYang tidak durhaka kepada Allah terhadap apa yang Dia perintahkan kepada mereka dan selalu mengerjakan apa yang diperintahkan. (at-Tahrim\/66: 6)\n\nPara malaikat juga selalu memohon kepada Allah supaya mengampuni dosa orang-orang yang beriman di atas bumi ini, dan mengilhami mereka sehingga mereka itu senantiasa melalui jalan-jalan kebaikan yang membawa kepada kebahagiaan.\n\nMalaikat itu diumpamakan laksana cahaya yang memberi kehidupan dengan panas yang ada padanya, dan memberi petunjuk dengan cahayanya.\n\nSejalan dengan apa yang tersebut di atas firman Allah:\n\n(Malaikat-malaikat) yang memikul 'Arsy dan (malaikat) yang berada di sekelilingnya bertasbih dengan memuji Tuhannya dan mereka beriman kepada-Nya serta memohonkan ampunan untuk orang-orang yang beriman (seraya berkata), \"Ya Tuhan kami, rahmat dan ilmu yang ada pada-Mu meliputi segala sesuatu, maka berilah ampunan kepada orang-orang yang bertobat dan mengikuti jalan (agama)-Mu dan peliharalah mereka dari azab neraka yang menyala-nyala. (Gafir\/40: 7)\n\nAyat kelima ini menegaskan bahwa Allah itu Maha Pengampun, mengampuni dosa setiap orang yang kembali dan tobat kepada-Nya dengan tobat nasuha. Setiap makhluk berhak memperoleh rahmat dan kasih sayang daripada-Nya. Ditunda dan ditangguhkannya azab dan siksaan terhadap orang-orang kafir dan orang-orang yang durhaka, adalah satu rahmat dan tanda kasih sayang-Nya terhadap mereka.",
      "text_translation": "Hampir saja langit itu pecah dari sebelah atasnya (karena kebesaran Allah) dan malaikat-malaikat bertasbih memuji Tuhannya dan memohonkan ampunan untuk orang yang ada di bumi. Ingatlah, sesungguhnya Allah Dialah Yang Maha Pengampun, Maha Penyayang.",
      "text": "تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِنْ فَوْقِهِنَّ وَالْمَلٰۤىِٕكَةُ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُوْنَ لِمَنْ فِى الْاَرْضِۗ  اَلَآ اِنَّ اللّٰهَ هُوَ الْغَفُوْرُ الرَّحِيْمُ ",
      "text_translation_en": "The uppermost heavens are well-nigh rent asunder [for awe of Him]; and the angels extol their Sustainer’s limitless glory and praise, and ask for­giveness for all who are on earth. Oh, verily, God alone is truly-forgiving, a dispenser of grace!",
      "juz_number": 25
    },
    "6": {
      "text_tafsir_en": "In this verse God explains that those who associate with Allah and take protectors other than Him, God is the one who oversees the deeds of their deeds, and He alone will reward them in the hereafter for all their deeds in the world. Muhammad saw no burden and was not assigned to oversee their actions. He is only assigned to do what Allah commands him to do, as He says: So it is only your duty to convey, and it is We who account (their deeds). (ar-Ra'd \/ 13: 40) Therefore, he does not need to be agitated and suffocated if they are still disobedient and do not believe, in any case he does not force them to believe and earn their living, except that it is the will of Allah as He says: It is not your duty to give them guidance, but it is Allah who guides whom He wills. (al-Baqarah \/ 2: 272)",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang menyekutukan Allah dan mengambil pelindung-pelindung selain Dia, Allah sendirilah yang mengawasi amal perbuatan mereka, dan Dia pulalah yang akan memberi balasan yang setimpal di akhirat nanti atas segala perbuatan mereka di dunia. Muhammad saw tidak dibebani dan tidak ditugasi mengawasi perbuatan mereka. Ia hanya ditugasi menyampaikan apa yang diperintahkan Allah kepadanya, sebagaimana firman-Nya:\n\nMaka sesungguhnya tugasmu hanya menyampaikan saja, dan Kamilah yang memperhitungkan (amal mereka). (ar-Ra'd\/13: 40)\n\nOleh karena itu, dia tidak perlu gusar dan merasa sesak dada kalau mereka itu masih tetap ingkar dan tidak mau beriman, karena bagaimana pun juga dia tidak memaksa mereka untuk beriman dan memperoleh hidayat, kecuali hal itu dikehendaki Allah sebagaimana firman-Nya:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah\/2: 272)",
      "text_translation": "Dan orang-orang yang mengambil pelindung-pelindung selain Allah, Allah mengawasi (perbuatan) mereka; adapun engkau (Muhammad) bukanlah orang yang diserahi mengawasi mereka.",
      "text": "وَالَّذِيْنَ اتَّخَذُوْا مِنْ دُوْنِهٖٓ اَوْلِيَاۤءَ اللّٰهُ حَفِيْظٌ عَلَيْهِمْۖ وَمَآ اَنْتَ عَلَيْهِمْ بِوَكِيْلٍ ",
      "text_translation_en": "NOW AS FOR those who take aught beside Him for their protectors - God watches them, and thou art not responsible for their conduct.",
      "juz_number": 25
    },
    "7": {
      "text_tafsir_en": "In this verse Allah explains that the revelation that Allah revealed to the Prophet Muhammad was in Arabic, in accordance with the language of the people of Mecca and its surroundings, to make it easier for them to understand the preaching and the shouting and the warnings that Muhammad saw directed to them, just as every messenger sent he used the language of his people to explain to them according to the word of God: And We sent not an apostle, but the language of his people, that he might explain them. (Ibrahim \/ 14: 4) Although only the people of Mecca and its vicinity are mentioned in this verse which was the target of the Prophet Muhammad's preaching and warnings, it does not mean that Muhammad saw was limited to Arabs only. Only the people of Mecca and their surroundings are mentioned, because in accordance with the position of the Prophet who was ruling in Mecca at that time, while in fact Muhammad was the apostle to all mankind, as Allah says: And We have not sent you, but to all the people. human beings as happy newsmen and warners, but most people do not know. (Saba '\/ 34: 28) The Word of the Prophet: Abu Hurairah narrated that the Prophet saw, \"For my soul is in his power, and none of my people are Jews or Christians who hear about me and die but do not believe ( the book) assigned to me, unless it be a resident of hell. \" (Muslim History) Prophet Muhammad, besides being assigned to warn the people of Mecca and the people of the surrounding areas, was also given a warning on the Day of Judgment. The Day of Resurrection is a definite and unquestionable day in which all beings will be gathered to account for their deeds in the world and to be rewarded according to their deeds. This verse 7 concludes with an affirmation that after careful examination and careful calculation of every creature in all its affairs in this world, they are divided into two groups. A group of them, including the blessed and included in heaven, remain in it. Because they believe in Allah and His Messenger and do good deeds in the world, it is only natural that they should have the gift of Allah enjoying eternal happiness in heaven, as Allah says: And as for those who are happy, then. in heaven; they remain in it. (Hud \/ 11: 108) As for the second, including the wicked; they were cast into the flames of hell, abiding in it because they were in the world still disobedient to Allah, against what our Prophet Muhammad saw as the saying of Allah: So are those who are miserable, then (in the place of) hell, where they exhale and breathe, they remain in it. (Hud \/ 11: 106-107)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa wahyu yang diturunkan Allah kepada Nabi Muhammad saw adalah dalam bahasa Arab, sesuai dengan bahasa penduduk negeri Mekah dan sekitarnya, untuk memudahkan mereka mengerti dakwah dan seruan serta peringatan yang ditujukan Muhammad saw kepada mereka, sebagaimana halnya setiap rasul yang diutus ia menggunakan bahasa kaumnya agar mudah memberikan penjelasan kepada mereka sebagaimana firman Allah:\n\nDan Kami tidak mengutus seorang rasul pun, melainkan dengan bahasa kaumnya, agar dia dapat memberi penjelasan kepada mereka. (Ibrahim\/14: 4)\n\nSekalipun hanya penduduk Mekah dan sekitarnya disebut pada ayat ini yang menjadi sasaran dakwah dan peringatan Nabi Muhammad saw, tetapi itu tidaklah berarti bahwa Muhammad saw diutus terbatas hanya kepada orang Arab saja. Hanya penduduk Mekah dan sekitarnya yang disebut, karena sesuai dengan posisi Nabi yang berdomisili di Mekah pada waktu itu, sedangkan pada hakikatnya Muhammad saw itu adalah rasul bagi segenap manusia, sebagaimana firman Allah:\n\nDan Kami tidak mengutus engkau (Muhammad), melainkan kepada semua umat manusia sebagai pembawa berita gembira dan sebagai pemberi peringatan, tetapi kebanyakan manusia tidak mengetahui. (Saba'\/34: 28)\n\nSabda Rasulullah:\n\nAbu Hurairah meriwayatkan bahwa Nabi saw bersabda, \"Demi jiwaku yang berada dalam kekuasaan-Nya, tidaklah seorang pun dari umatku baik Yahudi maupun Nasrani yang mendengarkan tentang aku, lalu mati namun tidak beriman dengan (risalah) yang ditugaskan kepadaku, melainkan ia menjadi penghuni neraka.\" (Riwayat Muslim)\n\nNabi Muhammad selain ditugasi untuk memberi peringatan kepada penduduk Mekah dan penduduk negeri-negeri sekelilingnya, juga ditugasi memberi peringatan tentang hari Kiamat. Hari Kiamat itu merupakan hari yang pasti dan tidak diragukan datangnya, di mana pada hari itu segenap makhluk akan dikumpulkan untuk mempertanggungjawabkan perbuatan mereka di dunia dan mendapat ganjaran sesuai dengan perbuatan mereka.\n\nAyat 7 ini diakhiri dengan satu penegasan bahwa sesudah diadakan pemeriksaan yang amat teliti dan perhitungan yang sangat cermat pada tiap-tiap makhluk atas segala perbuatannya di dunia ini, maka mereka itu dibagi menjadi dua golongan. Segolongan dari mereka termasuk yang berbahagia dan dimasukkan ke dalam surga, kekal di dalamnya. Karena mereka itu beriman kepada Allah dan Rasul-Nya serta berbuat amal saleh di dunia, maka wajarlah kalau mereka itu mendapat karunia dari Allah menikmati kesenangan yang abadi di dalam surga, sebagaimana firman Allah:\n\nDan adapun orang-orang yang berbahagia, maka (tempatnya) di dalam surga; mereka kekal di dalamnya. (Hud\/11: 108)\n\nSedangkan golongan yang kedua, termasuk golongan yang celaka; mereka dimasukkan ke dalam api neraka yang menyala-nyala, kekal di dalamnya karena mereka itu pada waktu berada di dunia tetap ingkar kepada Allah, menentang apa yang didakwakan oleh junjungan kita Nabi Muhammad saw sebagaimana firman Allah:\n\nMaka adapun orang-orang yang sengsara, maka (tempatnya) di dalam neraka, di sana mereka mengeluarkan dan menarik nafas dengan merintih, mereka kekal di dalamnya. (Hud\/11: 106-107)",
      "text_translation": "Dan demikianlah Kami wahyukan Al-Qur'an kepadamu dalam bahasa Arab, agar engkau memberi peringatan kepada penduduk ibukota (Mekah) dan penduduk (negeri-negeri) di sekelilingnya serta memberi peringatan tentang hari berkumpul (Kiamat) yang tidak diragukan adanya. Segolongan masuk surga dan segolongan masuk neraka.",
      "text": "وَكَذٰلِكَ اَوْحَيْنَآ اِلَيْكَ قُرْاٰنًا عَرَبِيًّا لِّتُنْذِرَ اُمَّ الْقُرٰى وَمَنْ حَوْلَهَا وَتُنْذِرَ يَوْمَ الْجَمْعِ لَا رَيْبَ فِيْهِ ۗفَرِيْقٌ فِى الْجَنَّةِ وَفَرِيْقٌ فِى السَّعِيْرِ ",
      "text_translation_en": "[Thou art but entrusted with Our message:] and so We have revealed unto thee a discourse in the Arabic tongue in order that thou mayest warn the foremost of all cities and all who dwell around it to wit, warn [them] of the Day of the Gathering, [the coming of] which is beyond all doubt: [the Day when] some shall find themselves in paradise, and some in the blazing flame.",
      "juz_number": 25
    },
    "8": {
      "text_tafsir_en": "In this verse God explains that if He wills, then all men will believe in being one people, but His wisdom is to entrust the affairs of faith and disbelief to their individual humanity. He did not want to force all people to believe, but gave them the right to choose and decide their own fate. Blessed are those who follow the instructions of the apostles. They are always thankful to God and will be included in His mercy and woe to those who are always opposed and do not follow the instructions of the apostles, they will be tortured in the future and no one will help and protect them. They could not regret anyone except themselves as the Messenger of Allah (may peace be upon him) said: He who receives good will praise Allah and he who acquires it must not blame but himself. (Muslim History of Abu Dzarr al-Giffari) There is not a single verse that corresponds to this verse 8. Among other things is the saying of Allah: And if Allah wills, He will surely make them all follow. (al-An'am \/ 6: 35) And His word: And if We desire, We give to every soul its guidance. (as-Sajdah \/ 32: 13)",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa jika Dia menghendaki, maka semua manusia itu akan beriman sehingga menjadi umat yang satu, tetapi kebijaksanaan yang diambil-Nya adalah dengan menyerahkan urusan iman dan kufur kepada pribadi manusia masing-masing. Dia tidak mau memaksakan agar semua manusia itu beriman, namun memberikan kepada mereka hak memilih dan menentukan nasibnya menurut kemauan mereka sendiri. Berbahagialah orang-orang yang mengikuti petunjuk rasul. Mereka selalu bersyukur memuji Allah dan akan dimasukkan ke dalam rahmat-Nya dan celakalah orang-orang yang selalu menentang dan tidak mau mengikuti petunjuk rasul, mereka akan disiksa di hari kemudian dan tidak seorang pun yang akan menolong dan melindungi mereka. Mereka tidak dapat menyesali siapa-siapa kecuali diri mereka sendiri sebagaimana sabda Rasulullah saw: \n\nSiapa memperoleh kebaikan hendaklah memuji Allah dan siapa memperoleh selain daripada itu janganlah ia menyalahkan melainkan terhadap dirinya sendiri. (Riwayat Muslim dari Abu dzarr al-Giffari)\n\nTidak sedikit ayat yang senada dengan ayat 8 ini. Antara lain firman Allah:\n\nDan sekiranya Allah menghendaki, tentu Dia jadikan mereka semua mengikuti petunjuk. (al-An'am\/6: 35)\n\nDan firman-Nya:\n\nDan jika Kami menghendaki niscaya Kami berikan kepada setiap jiwa petunjuk (bagi)nya. (as-Sajdah\/32: 13)",
      "text_translation": "Dan sekiranya Allah menghendaki niscaya Dia jadikan mereka satu umat, tetapi Dia memasukkan orang-orang yang Dia kehendaki ke dalam rahmat-Nya. Dan orang-orang yang zalim tidak ada bagi mereka pelindung dan penolong.",
      "text": "وَلَوْ شَاۤءَ اللّٰهُ لَجَعَلَهُمْ اُمَّةً وَّاحِدَةً وَّلٰكِنْ يُّدْخِلُ مَنْ يَّشَاۤءُ فِيْ رَحْمَتِهٖۗ وَالظّٰلِمُوْنَ مَا لَهُمْ مِّنْ وَّلِيٍّ وَّلَا نَصِيْرٍ ",
      "text_translation_en": "Now had God so willed, He could surely have made them all one single community: none the less, He admits unto His grace him that wills [to be admitted] whereas the evildoers shall have none to protect them and none to succour them [on Judgment Day].",
      "juz_number": 25
    },
    "9": {
      "text_tafsir_en": "In this verse, God explains that the Meccans have taken refuge besides Allah to help them in matters of need. They are misguided, because they take on creatures as protectors who can neither benefit nor dispose of themselves or others. If they wanted the true protector, who could bring the benefits and avoid the disaster, they would have chosen God as their protector, the Almighty God, the living and dead God. God will raise them up in the hereafter, and they should not choose weak and helpless beings as their protectors, as Allah says: Indeed, all that you call on besides Allah cannot create a fly, even if they are united to create it. And if the fly snatches something from them, they won't be able to take it back. The weak are the worshipers and the worshipers. (al-hajj \/ 22: 73)",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa orang-orang musyrik Mekah telah mengambil pelindung selain Allah untuk menolong mereka dalam hal-hal yang memerlukan pertolongan. Mereka telah sesat, karena mereka mengambil makhluk sebagai pelindung yang tak dapat mendatangkan manfaat atau menolak bencana bagi dirinya apalagi bagi yang lain. Kalau mereka menghendaki pelindung yang benar dan sesungguhnya, yang dapat mendatangkan manfaat dan menolak bencana, tentunya mereka akan memilih Allah sebagai pelindung mereka, Tuhan Yang Mahakuasa atas yang demikian itu, Tuhan yang menghidupkan dan mematikan. Tuhan yang akan membangkitkan mereka kelak di akhirat, dan mestinya mereka tidak akan memilih makhluk yang lemah dan tidak berdaya sebagai pelindung mereka, sebagaimana firman Allah:\n\nSesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. Sama lemahnya yang menyembah dan yang disembah. (al-hajj\/22: 73)",
      "text_translation": "Atau mereka mengambil pelindung-pelindung selain Dia? Padahal Allah, Dialah pelindung (yang sebenarnya). Dan Dia menghidupkan orang yang mati, dan Dia Mahakuasa atas segala sesuatu.",
      "text": "اَمِ اتَّخَذُوْا مِنْ دُوْنِهٖٓ اَوْلِيَاۤءَۚ فَاللّٰهُ هُوَ الْوَلِيُّ وَهُوَ يُحْيِ الْمَوْتٰى ۖوَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ࣖ ",
      "text_translation_en": "Did they, perchance, [think that they could] choose protectors other than Him? But God alone is the Protector [of all that exists], since it is He alone who brings the dead to life, and He alone who has the power to will anything.",
      "juz_number": 25
    },
    "10": {
      "text_tafsir_en": "Allah explains that whatever is at stake in religion, the decision to return it to God means that only God can determine what is right and what is wrong. Man in the life of the world should follow Allah's guidance in the Qur'an and the instructions of the Prophet, as Allah says: Then, if you disagree on something, then return to Allah (the Qur'an) and the Messenger (Sunnah), if you believe in God and in the future. (an-Nisa '\/ 4: 59) But the one who resolves human strife in the hereafter is entirely God alone, for all beings have no power, and only God has power, as the saying says: The owner of the day of vengeance. (al-Fatihah \/ 1: 4) It is he who will establish his law on the Day of Judgment, addressing the issues between those who disagree. This is where it becomes clear to know who is right and who is wrong, who is worthy of heaven and who is hell. The one who has the characteristics of turning on and off, setting the law between two persons at variance is none other than God, the one and only God, not gods other than the God they regard and acknowledge. To him we are dependent and surrendered to avoid the evil efforts of their enemies and to succeed instead of their care only to God, and to Him we repent of all our sins and sins. As He says: And to God all things are restored. (al-Baqarah \/ 2: 210)",
      "text_tafsir": "Allah menerangkan bahwa apa saja yang diperselisihkan mengenai urusan agama, keputusannya supaya dikembalikan kepada Allah, artinya hanya Allah yang menentukan mana yang benar dan mana yang salah. Manusia dalam kehidupan dunia harus mengikuti petunjuk Allah dalam Al-Qur'an dan petunjuk sunah Rasul, sebagaimana firman Allah: \n\nKemudian, jika kamu berbeda pendapat tentang sesuatu, maka kembalikanlah kepada Allah (Al-Qur'an) dan Rasul (sunnahnya), jika kamu beriman kepada Allah dan hari kemudian. (an-Nisa'\/4: 59)\n\nSedangkan yang memutuskan perselisihan manusia di akhirat nanti sepenuhnya hanya Allah saja, karena semua makhluk tidak ada yang memiliki kekuasaan, dan hanya Allah saja yang berkuasa, sebagaimana firman:\n\nPemilik hari pembalasan. (al-Fatihah\/1: 4)\n\nDia-lah yang akan menetapkan hukumnya di hari Kiamat, menangani persoalan antara orang-orang yang berselisih. Di sanalah baru dapat diketahui dengan jelas siapa yang benar dan siapa yang salah, siapa yang layak masuk surga dan siapa yang menjadi penghuni neraka.\n\nYang memiliki sifat-sifat menghidupkan dan mematikan, menetapkan hukum antara dua orang yang berselisih tiada lain hanyalah Allah, Tuhan Yang Maha Esa, bukanlah tuhan-tuhan selain Allah yang dianggap dan diakui mereka. Kepada-Nyalah manusia bertawakal dan berserah diri agar terhindar dari segala usaha jahat musuh-musuh mereka dan berhasil tidaknya urusan mereka hanya kepada Allah-lah segala sesuatunya dikembalikan, dan kepada-Nya-lah kita bertobat atas segala dosa dan maksiat yang telah kita lakukan. Sebagaimana firman-Nya:\n\nDan kepada Allah-lah segala perkara dikembalikan. (al-Baqarah\/2: 210)",
      "text_translation": "Dan apa pun yang kamu perselisihkan padanya tentang sesuatu, keputusannya (terserah) kepada Allah. (Yang memiliki sifat-sifat demikian) itulah Allah Tuhanku. Kepada-Nya aku bertawakal dan kepada-Nya aku kembali.",
      "text": "وَمَا اخْتَلَفْتُمْ فِيْهِ مِنْ شَيْءٍ فَحُكْمُهٗٓ اِلَى اللّٰهِ ۗذٰلِكُمُ اللّٰهُ رَبِّيْ عَلَيْهِ تَوَكَّلْتُۖ وَاِلَيْهِ اُنِيْبُ  ",
      "text_translation_en": "AND ON WHATEVER you may differ, [O believers,] the verdict thereon rests with God. [Say, therefore:] “Such is God, my Sustainer: in Him have I placed my trust, and unto Him do I always turn!”",
      "juz_number": 25
    },
    "11": {
      "text_tafsir_en": "Allah explains that He created the heavens and the earth and all of their contents, as well as strange and wonderful things that we see as the vast horizon that stretches above us without any pillars that support it; therefore. He is the one who deserves and deserves to be relied on in all things and asked for His help and assistance; not the gods of those who are helpless and who cannot do anything. He is the one who makes man of his own kind each mate; one is set up with another so that the offspring of this world prosperity will be born. Likewise, it also applies to livestock that eventually breed to fulfill life on earth. Thus, the life of beings on this earth becomes organized and guaranteed for them. Enough nutritious food, refreshing drinks and other favors that must be thankful for to achieve world and hereafter happiness. All of that shows the truth and power of God. There is no one like Him in everything. He is All-Hearing, He hears everything that every creature says, He is All-Seeing. There is nothing hidden from Him. He sees all the good deeds of His creatures, both good and evil. There is nothing like His power, greatness and wisdom. God created everything in pairs. This verse clearly states so. So are the following verses: Glory to Allah (Allah) who created them all in pairs, both from what the earth grew and from themselves, as well as from what they did not know. (Yasin \/ 36: 36) God's Word: And He who spreads the earth and makes mountains and rivers on it. And to him He made all the fruit in pairs; He closes the night to the afternoon. Truly, in that there are signs (the greatness of God) for those who think (ar-Ra'd \/ 13: 3) and His word And all things We create in pairs so that you will remember (the greatness of God) . (adh-dzariyat \/ 51: 49) According to scientific studies, not only living things are paired but inanimate objects also in pairs. By using science and sophisticated equipment that is available today, it can be known about the existence of pairs from atoms to clouds. Atom, which was thought to be the smallest form and can not be divided, it turns out he also paired up. Atoms consist of electrons and protons. The positively charged protons are surrounded by several electron particles which are negatively charged. The electric charge in these two groups of particles is very balanced. Plants also have pairs for their growth and development. Previously, humans did not know that plants also had differences in male and female sex. Fruit is the final product of high plant reproduction. The stage that precedes the fruit is the flower, which has male and female organs namely benangsari and pistil. When tepungsari is delivered to the pistil, it will produce fruit, which then grows, until finally it ripens and releases the seeds. Therefore all fruits reflect the existence of male and female organs, a fact mentioned in the Qur'an. There are plants that have stems and pistils so they are united in their partners; and in his pollination he does not need a male from another flower. However, there are also those who only have one of them, so to produce, they need a partner from another interest. Only God is not a partner.",
      "text_tafsir": "Allah menerangkan bahwa Dia-lah yang menciptakan langit dan bumi serta segala isinya, begitu juga hal-hal aneh dan ajaib yang mengherankan yang kita saksikan seperti luasnya cakrawala yang membentang luas di atas kita tanpa ada tiang yang menunjangnya; karenanya. Dia-lah yang pantas dan layak dijadikan sandaran dalam segala hal dan dimintai bantuan dan pertolongan-Nya; bukan tuhan-tuhan mereka yang tidak berdaya dan yang tidak dapat berbuat apa-apa. Dia-lah yang menjadikan bagi manusia dari jenisnya sendiri jodohnya masing-masing; yang satu dijodohkan kepada yang lain sehingga lahirlah keturunan turun-temurun memakmurkan dunia ini. Demikian itu berlaku pula pada binatang ternak yang akhirnya berkembang biak memenuhi kehidupan di bumi.\n\nDengan demikian, kehidupan makhluk yang berada di atas bumi ini menjadi teratur dan terjamin bagi mereka. Makanan yang cukup bergizi, minuman yang menyegarkan dan nikmat-nikmat lain yang wajib disyukuri untuk mencapai kebahagiaan dunia dan akhirat. Semuanya itu menunjukkan kebenaran dan kekuasaan Allah. Tidak ada satu pun yang menyamai-Nya dalam segala hal. Dia Maha Mendengar, Dia mendengar segala apa yang diucapkan setiap makhluk, Dia Maha Melihat. Tidak ada sesuatu pun yang tersembunyi bagi-Nya. Dia melihat segala amal perbuatan makhluk-Nya, yang baik maupun yang jahat. Tidak ada sesuatu pun yang menyamai kekuasaan, kebesaran, dan kebijaksanaan-Nya.\n\nAllah menciptakan segala sesuatu berpasang-pasangan. Ayat ini secara jelas menyatakan demikian. Demikian pula beberapa ayat berikut:\n\nMahasuci (Allah) yang telah menciptakan semuanya berpasang-pasangan, baik dari apa yang ditumbuhkan oleh bumi dan dari diri mereka sendiri, maupun dari apa yang tidak mereka ketahui. (Yasin\/36: 36)\n\nFirman Allah:\n\nDan Dia yang menghamparkan bumi dan menjadikan gunung-gunung dan sungai-sungai di atasnya. Dan padanya Dia menjadikan semua buah-buahan berpasang-pasangan; Dia menutupkan malam kepada siang. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang berpikir (ar-Ra'd\/13: 3)\n\nDan firman-Nya\n\nDan segala sesuatu Kami ciptakan berpasang-pasangan agar kamu mengingat (kebesaran Allah). (adh-dzariyat\/51: 49)\n\nMenurut kajian ilmiah, bukan hanya makhluk hidup yang berpasang-pasangan namun benda-benda mati juga berpasang-pasangan. Dengan menggunakan ilmu dan peralatan canggih yang ada saat ini, sudah dapat diketahui mengenai adanya pasangan-pasangan dari atom sampai ke awan. Atom, yang tadinya diduga merupakan wujud yang terkecil dan tidak dapat dibagi, ternyata iapun berpasangan. Atom terdiri dari elektron dan proton. Proton yang bermuatan listrik positif dikelilingi oleh beberapa partikel elektron yang bermuatan listrik negatif. Muatan listrik di kedua kelompok partikel ini sangat seimbang.\n\nTumbuh-tumbuhan pun memiliki pasangan-pasangan guna pertumbuhan dan perkembangannya. Sebelumnya, manusia tidak mengetahui bahwa tumbuh-tumbuhan juga memiliki perbedaan kelamin jantan dan betina. Buah adalah produk akhir dari reproduksi tumbuhan tinggi. Tahap yang mendahului buah adalah bunga, yang memiliki organ jantan dan betina yaitu benangsari dan putik. Bila tepungsari dihantarkan ke putik, akan menghasilkan buah, yang kemudian tumbuh, hingga akhirnya matang dan melepaskan bijinya. Oleh sebab itu seluruh buah mencerminkan keberadaan organ-organ jantan dan betina, suatu fakta yang disebut dalam Al-Qur'an. \n\nAda tumbuhan yang memiliki benangsari dan putik sehingga menyatu dalam diri pasangannya; dan dalam penyerbukannya ia tidak membutuhkan pejantan dari bunga lain. Namun, ada juga yang hanya memiliki salah satunya saja sehingga untuk berproduksi ia membutuhkan pasangannya dari bunga lain. Hanya Allah yang tidak berpasangan.",
      "text_translation": "(Allah) Pencipta langit dan bumi. Dia menjadikan bagi kamu pasangan-pasangan dari jenis kamu sendiri, dan dari jenis hewan ternak pasangan-pasangan (juga). Dijadikan-Nya kamu berkembang biak dengan jalan itu. Tidak ada sesuatu pun yang serupa dengan Dia. Dan Dia Yang Maha Mendengar, Maha Melihat.",
      "text": "فَاطِرُ السَّمٰوٰتِ وَالْاَرْضِۗ جَعَلَ لَكُمْ مِّنْ اَنْفُسِكُمْ اَزْوَاجًا وَّمِنَ الْاَنْعَامِ اَزْوَاجًاۚ يَذْرَؤُكُمْ فِيْهِۗ  لَيْسَ كَمِثْلِهٖ شَيْءٌ ۚوَهُوَ السَّمِيْعُ الْبَصِيْرُ ",
      "text_translation_en": "The Originator [is He] of the heavens and the earth. He has given you mates of your own kind just as [He has willed that] among the beasts [there be] mates - to multiply you thereby: [but] there is nothing like unto Him, and He alone is all-hearing, all-seeing.",
      "juz_number": 25
    },
    "12": {
      "text_tafsir_en": "In this verse God explains that He is the treasurer of heaven and earth. Good thing something is in His hands. Whoever is given grace, no one can hinder him. On the contrary, whoever is not given mercy, no one can bring it to him. It is He who gives sustenance to whom He wills, and He limits to whom He wills. All of this is in accordance with the wisdom of His wisdom based on His vast power and His omnipotent knowledge. Islam commands its followers to work and earn a living for the sake of their lives in the world. As a result, according to the wisdom of God, some succeed in obtaining great wealth as a test, but some earn only a small fortune as a trial for their lives. As Abu Bakr al-Jazairi in his book of Interpretation of Aisar at-Tafasir states: Allah extends the provision for anyone as a test, and narrows it down as a trial.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa Dia-lah yang memiliki perbendaharaan langit dan bumi. Baik buruknya sesuatu ada di tangan Dia. Siapa saja yang dianugerahi rahmat, tidak ada seorang pun yang dapat menghalangi-Nya. Sebaliknya, siapa yang tidak diberi rahmat, tidak seorang pun yang dapat mendatangkan kepadanya. Dialah yang melapangkan rezeki kepada siapa yang dikehendaki-Nya, dan Dia pula yang membatasi rezeki kepada yang dikehendaki-Nya. Semua itu terjadi sesuai dengan hikmat kebijaksanaan-Nya berdasarkan kekuasaan-Nya yang luas dan ilmu-Nya yang meliputi segala sesuatu.\n\nAgama Islam memerintahkan kepada para pemeluknya supaya bekerja dan berusaha mencari nafkah untuk kehidupannya di dunia. Adapun hasilnya sesuai dengan kebijaksanaan Allah, ada yang berhasil memperoleh harta yang banyak sebagai ujian, tetapi ada yang hanya memperoleh rezeki hanya sedikit sebagai cobaan bagi hidupnya. Sebagaimana Abu Bakar al-Jazairi dalam kitab Tafsirnya Aisar at-Tafasir menyatakan:\n\nAllah meluaskan rezeki bagi siapa saja sebagai ujian, dan menyempitkannya sebagai cobaan.",
      "text_translation": "Milik-Nyalah perbendaharaan langit dan bumi; Dia melapangkan rezeki dan membatasinya bagi siapa yang Dia kehendaki. Sungguh, Dia Maha Mengetahui segala sesuatu.",
      "text": "لَهٗ مَقَالِيْدُ السَّمٰوٰتِ وَالْاَرْضِۚ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ وَيَقْدِرُ ۚاِنَّهٗ بِكُلِّ شَيْءٍ عَلِيْمٌ  ",
      "text_translation_en": "His are the keys of the heavens and the earth: He grants abundant sustenance, or gives it in scant measure, unto whomever He wills: for, behold, He has full knowledge of everything.",
      "juz_number": 25
    },
    "13": {
      "text_tafsir_en": "In this verse God explains that He has narrated religion to Muhammad and his people as He also referred to Noah and the prophets who came after him, Abraham, Moses and Jesus. The Shari'ah that was passed on to the Prophet Muhammad and his earlier prophets had similarities in the tenets of faith such as faith in Allah swt, prophetic leaflets and belief in the Day of Judgment or the Day of Judgment. While the foundation of the religion that is the main mission of the apostles is to worship Allah swt and not associate with Him. Allah says: And We did not send any messenger before you (Muhammad), but We revealed to him that there is no god but me, so worship me. (al-Anbiya '\/ 21: 25) While the fundamental differences between the treatises of the prophets are in the field of Shari'ah that is furu'iyyah. Some forms of worship and their details, in keeping with the development of time, needs, and prosperity of mankind. God says: For every people among you, We have given a clear law and a way. (al-Ma'idah \/ 5:48) The hadith of the Prophet narrated by Abu Hurairah reads: The Messenger of Allah (may peace be upon him) said, \"I am the greatest man of Jesus son of Mary in this world and the hereafter.\" The companions asked, \"Why, O Messenger of Allah?\" The Prophet replied, \"The prophets are brothers of many generations. Their mothers are many, but their religion is one. And none of us (Prophet Muhammad and Jesus) is a prophet.\" (History of Ahmad and Muslim) Allah only mentions the names of the above prophets because of their higher position than the other unnamed prophets, who have great responsibilities and heavy duty, and because of their perseverance in the trials and tribulations brought up by their people until they received the title of Ulul Azmi from Allah. With the mention of Moses and Jesus it is hoped that Jews and Christians will be aware of and interested in the religion that Muhammad saw, the Samaritan religion that is very similar to their religion, which is clearly stated in the Bible and the Bible especially on monotheism, prayer, charity , fasting, pilgrimage and good manners such as keeping one's promises, being honest, connecting with others, and more. Allah decreed that the religion of Muhammad's religion be preserved and fully preserved; his followers are forbidden to disagree with one another which may result in disunity and damage the unity. Allah's Word: The believers are brothers and sisters, so make peace between your two brothers and fear Allah so that you may have mercy. (al-justification \/ 49: 10) And His word is: Stand fast in the bonds of Allah, and do not divorce. (Ali 'Imran \/ 3: 103) It seems difficult for the Muslims to embrace the monotheistic religion of Islam that Muhammad saw and to abandon the religion of shirk and to worship idols that had been passed down from their ancestors; their power is immortalized in the Qur'an. Indeed, we find that our forefathers belong to a religion, and we are guided in their footsteps. (az-Zukhruf \/ 43: 22) It is not true that all people can fulfill the call to accept the religion of Islam that Muhammad saw, but Allah determines His servant whom He wills and guides them to convert to Islam.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Dia telah mensyariatkan agama kepada Muhammad saw dan kaumnya sebagaimana Dia telah mewasiatkan pula kepada Nuh dan nabi-nabi yang datang sesudahnya yaitu Ibrahim, Musa dan Isa.\n\nSyariat yang diwasiatkan kepada Nabi Muhammad saw dan nabi-nabi sebelumnya memiliki kesamaan dalam pokok-pokok akidah seperti keimanan kepada Allah swt, risalah kenabian dan keyakinan adanya hari pembalasan atau hari Kiamat.\n\nSedangkan landasan agama yang menjadi misi utama para rasul tersebut adalah beribadah kepada Allah swt dan tidak menyekutukan-Nya. Allah berfirman:\n\nDan Kami tidak mengutus seorang rasul pun sebelum engkau (Muhammad), melainkan Kami wahyukan kepadanya, bahwa tidak ada tuhan (yang berhak disembah) selain Aku, maka sembahlah Aku. (al-Anbiya'\/21: 25)\n\nSedangkan perbedaan yang tidak mendasar di antara risalah para nabi adalah dalam bidang syariat yang bersifat furu'iyyah. Beberapa bentuk ibadah dan rinciannya, sesuai dengan perkembangan masa, kebutuhan, dan kemaslahatan umat manusia. Allah berfirman:\n\nUntuk setiap umat di antara kamu, Kami berikan aturan dan jalan yang terang. (al-Ma'idah\/5: 48)\n\n\n\nHadis Nabi yang diriwayatkan Abu Hurairah berbunyi:\n\nRasulullah saw bersabda, \"Aku adalah manusia yang lebih utama daripada Isa bin Maryam di dunia dan akhirat.\" Para sahabat bertanya, \"Mengapa wahai Rasulullah?\"Nabi menjawab, \"Para Nabi merupakan bersaudara dari berbagai keturunan. Ibu mereka banyak, namun agama mereka hanya satu. Dan tidak ada antara kami (Nabi Muhammad dan Isa) seorang nabi pun.\" (Riwayat Ahmad dan Muslim)\n\nAllah hanya menyebut nama-nama nabi tersebut di atas karena posisi mereka yang lebih tinggi dibandingkan dengan nabi-nabi lain yang tidak disebutkan, mempunyai tanggung jawab yang besar dan berat, dan karena ketabahan mereka menghadapi cobaan dan kesulitan-kesulitan yang ditimbulkan oleh kaum mereka sehingga mereka itu mendapat julukan Ulul Azmi dari Allah. Dengan disebutkan nama Musa dan Isa diharapkan orang-orang Yahudi dan Nasrani bisa sadar dan tertarik kepada agama yang dibawa oleh Muhammad saw, agama Samawi yang banyak persamaannya dengan agama mereka, yang tertera jelas di dalam Kitab Taurat dan Injil terutama mengenai tauhid, salat, zakat, puasa, haji dan akhlak yang baik seperti menepati janji, jujur, menghubungkan silaturahmi, dan lain-lain.\n\nAllah memerintahkan agar agama Islam yang dibawa Muhammad saw itu dipelihara dan ditegakkan sepenuhnya; pengikutnya dilarang berselisih sesamanya yang dapat mengakibatkan perpecahan dan merusak persatuan. Firman Allah:\n\nSesungguhnya orang-orang Mukmin itu bersaudara, karena itu damaikanlah antara kedua saudaramu (yang berselisih) dan bertakwalah kepada Allah agar kamu mendapat rahmat. (al-hujurat\/49: 10)\n\nDan firman-Nya:\n\nDan berpegangteguhlah kamu semuanya pada tali (agama) Allah, dan janganlah kamu bercerai berai. (Ali 'Imran\/3: 103)\n\nNampaknya berat bagi orang-orang musyrik untuk memeluk agama tauhid yaitu agama Islam yang dibawa oleh Muhammad saw dan melepaskan agama syirik dan menyembah berhala mereka yang telah diwarisi turun-temurun dari nenek moyang mereka; kekuatan mereka telah diabadikan di dalam Al-Qur'an.\n\nSesungguhnya kami mendapati nenek moyang kami menganut suatu agama, dan kami mendapat petunjuk untuk mengikuti jejak mereka. (az-Zukhruf\/43: 22)\n\nMemang tidak semua orang dapat memenuhi seruan untuk memeluk agama Islam yang dibawa Muhammad saw itu, tetapi Allah menentukan hamba-Nya yang dikehendaki-Nya dan memberi petunjuk kepada mereka sehingga mereka memeluk agama Islam.",
      "text_translation": "diwasiatkan-Nya kepada Nuh dan apa yang telah Kami wahyukan kepadamu (Muhammad) dan apa yang telah Kami wasiatkan kepada Ibrahim, Musa dan Isa yaitu tegakkanlah agama (keimanan dan ketakwaan) dan janganlah kamu berpecah belah di dalamnya. Sangat berat bagi orang-orang musyrik (untuk mengikuti) agama yang kamu serukan kepada mereka. Allah memilih orang yang Dia kehendaki kepada agama tauhid dan memberi petunjuk kepada (agama)-Nya bagi orang yang kembali (kepada-Nya).",
      "text": "۞ شَرَعَ لَكُمْ مِّنَ الدِّيْنِ مَا وَصّٰى بِهٖ نُوْحًا وَّالَّذِيْٓ اَوْحَيْنَآ اِلَيْكَ وَمَا وَصَّيْنَا بِهٖٓ اِبْرٰهِيْمَ وَمُوْسٰى وَعِيْسٰٓى اَنْ اَقِيْمُوا الدِّيْنَ وَلَا تَتَفَرَّقُوْا فِيْهِۗ  كَبُرَ عَلَى الْمُشْرِكِيْنَ مَا تَدْعُوْهُمْ اِلَيْهِۗ  اَللّٰهُ يَجْتَبِيْٓ اِلَيْهِ مَنْ يَّشَاۤءُ وَيَهْدِيْٓ اِلَيْهِ مَنْ يُّنِيْبُۗ",
      "text_translation_en": "In matters of faith, He has ordained for you that which He had enjoined upon Noah - and into which We gave thee [O Muhammad] insight through revelation as well as that which We had enjoined upon Abraham, and Moses, and Jesus: Steadfastly uphold the [true] faith, and do not break up your unity therein. [And even though] that [unity of faith] to which thou callest them appears oppressive to those who are wont to ascribe to other beings or forces a share in His divinity, God draws unto Himself everyone who is willing, and guides unto Himself everyone who turns unto Him.",
      "juz_number": 25
    },
    "14": {
      "text_tafsir_en": "In this verse Allah explains that the People of the Book both Jews and Christians after knowing the truth of the apostles who were sent to them, then split into several groups, as described by God in His Word: Verily those who divide their religion and they become (split) into groups, not in the least is your responsibility (Muhammad) for them. (al-An'am \/ 6: 159) They did so because of malice and hatred between them so that there arose conflicts between sects among those who were difficult to overcome and resolve. They accuse each other, the Jews are convinced of the truth of their stand and hold, while the Christian assumption believes that the Jew has no stand and hold. Vice versa, the Jews assume that the Christians did not have an attitude, as the word of God: And the Jews said, \"Christians do not have something (hold),\" and the Christians (also) said, \"The Jews do not have anything (hold),\" (al-Baqarah \/ 2: 113) If there were no prior provision from God regarding the suspension of retribution and torture for those who oppose and violate God's commands until a time that He has determined (Judgment Day), surely they have been destroyed in this world and no longer need to be postponed until the hereafter. Disunity among humanity is generally accepted, not only in the People of the Book, but also among Muslims themselves. If there are many divisions in the field of creed experienced by People of the Book, many groups of Islam experience disputes in the fields of fiqh, muamalat, and marriage, which causes divisions among Muslims. The command to unite must be fully realized by Muslims, because the adverse effects of this division are the weak unity and unity of the people so that our bargaining position in various positions and fields in the international world becomes weak. Verse 14 concludes with an affirmation that Jews and Christians who inherited the Book of the Torah and Gospel from their ancestors, who at the time of the Messenger of Allah witnessed the Islamic da'wah, they became doubtful about the truth of their books and truly shaken their beliefs. This is not surprising because in addition to their belief in the Book of Samawi it is not deep, they embrace religion just because they follow along with their ancestors.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Ahli Kitab baik Yahudi maupun Nasrani sesudah mengetahui kebenaran rasul-rasul yang diutus kepada mereka, lalu berpecah-belah menjadi beberapa golongan, sebagaimana digambarkan Allah dalam firman-Nya:\n\nSesungguhnya orang-orang yang memecah belah agamanya dan mereka menjadi (terpecah) dalam golongan-golongan, sedikit pun bukan tanggung jawabmu (Muhammad) atas mereka. (al-An'am\/6: 159)\n\nMereka melakukan yang demikian itu karena kedengkian dan kebencian antara mereka sehingga timbullah pertentangan antar sekte di kalangan mereka yang sukar untuk diatasi dan diselesaikan. Mereka saling menuduh, orang-orang Yahudi meyakinkan kebenaran pendirian dan pegangan mereka, sedangkan anggapan orang Nasrani meyakini bahwa orang Yahudi itu tidak mempunyai pendirian dan pegangan. Begitu pula sebaliknya, orang-orang Yahudi menganggap bahwa orang-orang Nasrani itu tidak mempunyai pendirian, sebagaimana firman Allah:\n\nDan orang Yahudi berkata, \"Orang Nasrani itu tidak memiliki sesuatu (pegangan),\" dan orang-orang Nasrani (juga) berkata, \"Orang-orang Yahudi tidak memiliki sesuatu (pegangan),\" (al-Baqarah\/2: 113)\n\nSekiranya belum ada ketentuan lebih dahulu dari Allah mengenai ditangguhkannya pembalasan dan siksa bagi orang-orang yang menentang dan menyalahi perintah Allah itu sampai kepada waktu yang telah ditentukan-Nya (hari Kiamat), niscaya mereka telah dibinasakan di dunia ini dan tidak perlu lagi ditunda sampai di akhirat nanti.\n\nPerpecahan di antara umat manusia berlaku umum, bukan hanya terjadi pada Ahli Kitab saja, tetapi juga ada di kalangan Muslimin sendiri. Kalau perpecahan dalam bidang akidah banyak dialami Ahli Kitab, kelompok Islam banyak mengalami perselisihan dalam bidang fiqh, muamalat, dan pernikahan, yang menyebabkan perpecahan di kalangan umat Islam. Perintah untuk bersatu harus benar-benar disadari oleh umat Islam, karena dampak buruk perpecahan ini adalah lemahnya persatuan dan kesatuan umat sehingga posisi tawar kita dalam berbagai posisi dan bidang di dunia internasional menjadi lemah.\n\nAyat 14 ini ditutup dengan satu penegasan bahwa orang-orang Yahudi dan Nasrani yang mewarisi Kitab Taurat dan Injil dari nenek moyang mereka, yang pada masa Rasulullah saw menyaksikan dakwah Islamiyah, mereka itu menjadi ragu tentang kebenaran Kitab mereka dan benar-benar mengguncangkan kepercayaan mereka. Hal ini tidak mengherankan karena di samping kepercayaan mereka kepada Kitab Samawi memang tidak mendalam, mereka memeluk agama hanya karena ikut-ikutan kepada nenek moyang mereka.",
      "text_translation": "Dan mereka (Ahli Kitab) tidak berpecah belah kecuali setelah datang kepada mereka ilmu (kebenaran yang disampaikan oleh para nabi) karena kedengkian antara sesama mereka. Jika tidaklah karena suatu ketetapan yang telah ada dahulunya dari Tuhanmu (untuk menangguhkan azab) sampai batas waktu yang ditentukan, pastilah hukuman bagi mereka telah dilaksanakan. Dan sesungguhnya orang-orang yang mewarisi Kitab (Taurat dan Injil) setelah mereka (pada zaman Muhammad), benar-benar berada dalam keraguan yang mendalam tentang Kitab (Al-Qur'an) itu.",
      "text": "وَمَا تَفَرَّقُوْٓا اِلَّا مِنْۢ بَعْدِ مَا جَاۤءَهُمُ الْعِلْمُ بَغْيًاۢ بَيْنَهُمْۗ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ اِلٰٓى اَجَلٍ مُّسَمًّى لَّقُضِيَ بَيْنَهُمْۗ وَاِنَّ الَّذِيْنَ اُوْرِثُوا الْكِتٰبَ مِنْۢ بَعْدِهِمْ لَفِيْ شَكٍّ مِّنْهُ مُرِيْبٍ  ",
      "text_translation_en": "And [as for the followers of earlier revelation,] they broke up their unity, out of mutual jealousy, only after they had come to know [the truth]. And had it not been for a decree that had already gone forth from thy Sustainer, [postponing all decision] until a term set [by Him], all would indeed have been decided between them [from the outset]. As it is, behold, they who have inherited their divine writ from those who preceded them are [now] in grave doubt, amounting to suspicion, about what it por­tends.",
      "juz_number": 25
    },
    "15": {
      "text_tafsir_en": "In this verse Allah commands the Prophet Muhammad to call upon his people not to divide as the Book of Scripture, to unite the monotheistic religion that the prophets had pioneered, which is the religion of Islam and to remain steadfast in facing them. Never be swayed by their doubts about the true religion that has been committed to him. He must always establish his position that he believes in all that God has revealed from heaven, such as the Torah, the Gospel and the Psalms, and he refuses to deny it. The Prophet Muhammad was also ordered to be fair among them in establishing the law and so on, by not diminishing and increasing what God had done to him, and to convey what he had been commanded to convey. This verse also explains that God is your God and our Lord. He is the only one to be worshiped, one who must be trusted with understanding. There is no god except Allah. For us our practice is, well, our responsibility, rewarded or rewarded, and for your actions. We will not be happy because of your good deeds and will not be hurt by your bad deeds. Each is responsible for his or her actions. In line with this verse, Allah says: And if they (Muhammad) deny you (Muhammad), then say, \"For my work and for your work, you are not responsible for what I do and I am not responsible for what you do.\" (Jonah \/ 10:41) Thus there can be no more strife between Muslims and Muslims, whose right and truth have been revealed. Anyone who refuses to believe and refuses to believe that he is in denial. In the future it will be clear and who is right among the converts because God will gather all mankind at a later date, and there He will make a just decision on what is in dispute, as God says: Say, \"Our Lord will bring us all together, and then He will decide between us rightly. And He is the All-Knowing, the All-Knowing. \" (Saba '\/ 34: 26) To him all mankind will return after death and take responsibility for all the deeds of the world. All mankind shall receive a reward according to their deeds, according to the word of God: So he who does good will be heavy, he will see it, and whoever does evil will be heavy, he will see. (az-Zalzalah \/ 99: 7-9) The Prophet Zuhaili in his interpretation al-Munir concluded the ten commandments of Allah and his ban was not only on the Messenger of Allah but on all Muslims. The ten commandments and prohibitions are: 1. It is the duty of the Prophet to continue preaching his message. 2.Items in his presentation. 3. It is forbidden for the apostles not to follow the wishes of the Meccans of the Meccans or the Scriptures, to follow their worship. 4. Command to believe and declare faith in the scriptures that God has revealed. 5. The order to be fair between the Muhajirin and in the face of differences between them. 6.The government declares that only God is worthy of worship, there is no God besides him. 7. Order to declare to the Book of Man that each is responsible for the deeds of his deeds and the good and bad rewards of such deeds. 8. The order to declare that there is no enmity between the prophets and the Book of Scripture, because the truth of God is clearly visible. 9. The order to declare that God will soon gather Muslims and the Book of the Prophet in the Field of Mahsyar to face the judgment of God. 10. Only to Allah all beings will return.",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad saw agar menyeru kaumnya supaya jangan berpecah-belah seperti Ahli Kitab, supaya bersatu memeluk agama tauhid yang telah dirintis oleh para nabi, yaitu agama Islam yang dibawanya dan agar beliau tetap tabah menghadapi mereka. Jangan sekali-kali terpengaruh oleh keraguan mereka terhadap agama yang benar yang telah disyariatkan kepadanya. Ia harus selalu menandaskan pendiriannya bahwa dia tetap percaya kepada semua yang telah diturunkan Allah dari langit seperti Kitab Taurat, Injil dan Zabur, dan tidak didustakannya sedikit pun. Nabi Muhammad juga diperintahkan berlaku adil di antara mereka di dalam menetapkan hukum dan sebagainya, dengan tidak akan mengurangi dan menambah apa yang telah disyariatkan Allah kepadanya, serta akan menyampaikan apa yang telah diperintahkan kepadanya untuk disampaikan.\n\nAyat ini juga menjelaskan bahwa Allah adalah Tuhan kamu dan Tuhan kami sekalian. Dia-lah satu-satunya yang wajib disembah, yang wajib dipercaya dengan penuh pengertian. Tiada Tuhan selain Allah. Bagi kami amalan kami, baik buruknya adalah tanggung jawab kami, diberi pahala atau diazab, dan bagi kamu sekalian amalan kamu. Kami tidak akan berbahagia karena amal baikmu dan tidak akan celaka karena amalan burukmu. Masing-masing bertanggung jawab atas amal perbuatannya. Sejalan dengan ayat ini firman Allah:\n\nDan jika mereka (tetap) mendustakanmu (Muhammad), maka katakanlah, \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu tidak bertanggung jawab terhadap apa yang aku kerjakan dan aku pun tidak bertanggung jawab terhadap apa yang kamu kerjakan.\" (Yunus\/10: 41)\n\nDengan demikian tidak boleh lagi ada pertengkaran di antara kaum Muslimin dan orang-orang musyrikin, yang hak dan yang benar telah nyata. Barang siapa yang masih saja membangkang dan tidak mau percaya berarti dia ingkar. Pada waktunya nanti akan jelas dan tampak siapa yang benar di antara pemeluk agama karena Allah akan mengumpulkan seluruh manusia nanti di hari kemudian, dan di sanalah Dia akan menjatuhkan keputusan yang seadil-adilnya atas apa yang dipersengketakan, sebagaimana firman Allah:\n\nKatakanlah, \"Tuhan kita akan mengumpulkan kita semua, kemudian Dia memberi keputusan antara kita dengan benar. Dan Dia Yang Maha Pemberi keputusan, Maha Mengetahui.\" (Saba'\/34: 26)\n\nKepada-Nyalah semua manusia akan kembali sesudah mati dan mempertanggungjawabkan semua amal di dunia. Seluruh manusia akan menerima balasan sesuai dengan amal masing-masing, sebagaimana firman Allah:\n\nMaka barang siapa mengerjakan kebaikan seberat zarrah, niscaya dia akan melihat (balasan)nya, dan barang siapa mengerjakan kejahatan seberat zarrah, niscaya dia akan melihat (balasan)nya. (az-Zalzalah\/99: 7-9)\n\nWahbah Zuhaili dalam tafsirnya al-Munir menyimpulkan sepuluh perintah Allah dan larangannya bukan hanya bagi Rasulullah tapi juga bagi seluruh umat Islam. Sepuluh perintah dan larangan tersebut adalah:\n\n1.Perintah kepada Nabi untuk terus berdakwah menyampaikan risalahnya. \n\n2.Istiqamah dalam penyampaiannya.\n\n3.Larangan bagi rasul untuk tidak mengikuti keinginan orang-orang musyrikin Mekah atau Ahli Kitab, untuk mengikuti ibadah mereka.\n\n4.Perintah untuk beriman dan menyatakan iman kepada kitab-kitab samawi yang diturunkan Allah.\n\n5.Perintah untuk berlaku adil di antara Muhajirin dan ketika menghadapi perselisihan yang terjadi di antara mereka.\n\n6.Perintah berikrar bahwa hanya Allah yang pantas disembah, tidak ada Tuhan selainnya.\n\n7.Perintah untuk menyatakan kepada Ahli Kitab bahwa masing-masing bertanggung jawab terhadap amal perbuatannya dan balasan baik dan buruk dari amalan tersebut.\n\n8.Perintah untuk menyatakan bahwa tidak ada permusuhan di antara nabi dan Ahli Kitab, karena kebenaran Allah tampak dengan jelas.\n\n9.Perintah untuk menyatakan bahwa Allah kelak akan mengumpulkan umat Islam dan Ahli Kitab di Padang Mahsyar untuk menghadapi pengadilan Allah.\n\n10.Hanya kepada Allah semua makhluk akan kembali.",
      "text_translation": "Karena itu, serulah (mereka beriman) dan tetaplah (beriman dan berdakwah) sebagaimana diperintahkan kepadamu (Muhammad) dan janganlah mengikuti keinginan mereka dan katakanlah, “Aku beriman kepada Kitab yang diturunkan Allah dan aku diperintahkan agar berlaku adil di antara kamu. Allah Tuhan kami dan Tuhan kamu. Bagi kami perbuatan kami dan bagi kamu perbuatan kamu. Tidak (perlu) ada pertengkaran antara kami dan kamu, Allah mengumpulkan antara kita dan kepada-Nyalah  (kita) kembali.”",
      "text": "فَلِذٰلِكَ فَادْعُ ۚوَاسْتَقِمْ كَمَآ اُمِرْتَۚ وَلَا تَتَّبِعْ اَهْوَاۤءَهُمْۚ وَقُلْ اٰمَنْتُ بِمَآ اَنْزَلَ اللّٰهُ مِنْ كِتٰبٍۚ وَاُمِرْتُ لِاَعْدِلَ بَيْنَكُمْ ۗ اَللّٰهُ رَبُّنَا وَرَبُّكُمْ ۗ لَنَآ اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْ ۗ لَاحُجَّةَ بَيْنَنَا وَبَيْنَكُمْ ۗ اَللّٰهُ يَجْمَعُ بَيْنَنَا ۚوَاِلَيْهِ الْمَصِيْرُ ۗ ",
      "text_translation_en": "Because of this, then, summon [all mankind], and pursue the right course, as thou hast been bidden [by God]; and do not follow their likes and dislikes, but say: “I believe in whatever revelation God has be­stowed from on high; and I am bidden to bring about equity in your mutual views. God is our Sustainer as well as your Sustainer. To us shall be accounted our deeds, and to you, your deeds. Let there be no contention between us and you: God will bring us all together - for with Him is all journeys’ end.”",
      "juz_number": 25
    },
    "16": {
      "text_tafsir_en": "In this verse God explains that those who still oppose the truth of Allah's religion, even if it has been accepted by the people, will lose their efforts and arguments. They were enraged by Allah for their courage to deny the truth of Islam, they would be punished at a later date for their arrogance to abandon a religion whose right could be proved. It is reported that the Jews said to the believers, \"O believers! You have all said that accepting and accepting what is agreed is better than taking and accepting what has already been disputed. accepted and agreed to the truth while Muhammad's prophecies were still disputed and disputed. To suppress their reason, God made it clear that the obligation of believing and trusting in the truth of Moses was due to the miracle God had given him to prove and prove his truth. Some of the miracles given to the Prophet Muhammad may be witnessed by the Jews himself. It is therefore obligatory for all of us to acknowledge and believe in the prophecy of Muhammad.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang masih membantah kebenaran agama Allah, sekalipun agama itu telah diterima baik oleh masyarakat, akan sia-sia usaha dan bantahan mereka. Mereka itu dimurkai Allah karena keberanian mereka mengingkari kebenaran agama Islam, mereka akan diazab di hari kemudian karena keangkuhan mereka meninggalkan agama yang hak yang dapat dibuktikan kebenarannya.\n\nDiriwayatkan bahwa orang-orang Yahudi berkata kepada orang-orang Mukmin, \"Wahai orang-orang Mukmin! Kamu sekalian telah mengatakan bahwa mengambil dan menerima yang sudah disepakati, lebih baik daripada mengambil dan menerima yang sudah diperselisihkan. Kenabian Musa dan kitab Taurat-nya telah diterima dan disepakati kebenarannya sedangkan kenabian Muhammad masih diperselisihkan dan dipersengketakan. Jadi agama Yahudilah yang pantas dan layak diambil dan diterima.\" Untuk melumpuhkan alasan mereka itu, Allah mengemukakan hujjah bahwa kewajiban beriman dan mempercayai kebenaran Musa adalah karena adanya mukjizat yang diberikan Allah kepadanya yang menunjukkan dan membuktikan kebenarannya. Beberapa mukjizat yang diberikan kepada Nabi Muhammad saw bisa disaksikan sendiri oleh orang-orang Yahudi. Maka wajiblah atas kita semua mengakui dan mempercayai kenabian Muhammad saw itu.",
      "text_translation": "Dan orang-orang yang berbantah-bantah tentang (agama) Allah setelah (agama itu) diterima, perbantahan mereka itu sia-sia di sisi Tuhan mereka. Mereka mendapat kemurkaan (Allah) dan mereka mendapat azab yang sangat keras.",
      "text": "وَالَّذِيْنَ يُحَاۤجُّوْنَ فِى اللّٰهِ مِنْۢ بَعْدِ مَا اسْتُجِيْبَ لَهٗ حُجَّتُهُمْ دَاحِضَةٌ عِنْدَ رَبِّهِمْ وَعَلَيْهِمْ غَضَبٌ وَّلَهُمْ عَذَابٌ شَدِيْدٌ ",
      "text_translation_en": "And as for those who would [still] argue about God after He has been acknowledged [by them] all their arguments are null and void in their Sustainer’s sight, and upon them will fall [His] condemnation, and for them is suffering severe in store:",
      "juz_number": 25
    },
    "17": {
      "text_tafsir_en": "In this verse God explains that He has revealed His books to His prophets, which contain undoubted truths, far from falsehood and all containing good. He gave orders for justice to serve as a basis for judging those who had been convicted and sentenced them to the punishment prescribed in His Word. The Word of God: Verily, We have sent Our Apostles with clear proofs and we have brought with them the book and the balance of justice so that men may be just. (al-hadid \/ 57: 25) The cover of this verse encourages us to do good and just for the happiness of ukhrawi and to avoid worldly temptations. Since it is unknown when this world will come to an end, of course we must obey and obey the Qur'an, always be fair to our fellow men, practice whatever we are commanded, always alert to the possibility of God's call coming suddenly , then there is no longer any chance of doing good, at the expense of him, and on the Day of Judgment he will regret for wasting his opportunity to do good. Allah's Messenger (may peace be upon him) said: The Messenger of Allah (may peace be upon him) said, \"No one dies but he regrets.\" The companions asked, \"How sorry are they, O Messenger of Allah?\" If he is a bad person then he regrets not being able to release himself from the crime. (History at Tirmidhi)",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa Dia telah menurunkan kitab-kitab-Nya kepada nabi-nabi-Nya, yang memuat kebenaran yang tak diragukan, jauh dari kebatilan dan semuanya mengandung kebaikan. Dia memberikan perintah untuk berbuat adil untuk menjadi acuan menentukan hukuman dalam mengadili orang-orang yang dituduh bersalah dan menghukum mereka dengan hukuman yang telah ditetapkan di dalam Kitab-Nya. Firman Allah:\n\nSungguh, Kami telah mengutus rasul-rasul Kami dengan bukti-bukti yang nyata dan kami turunkan bersama mereka kitab dan neraca (keadilan) agar manusia dapat berlaku adil. (al-hadid\/57: 25)\n\nPenutup ayat ini mendorong kita berbuat baik dan adil untuk kebahagiaan ukhrawi dan menjauhi godaan duniawi. Karena tidak diketahui kapan dunia ini kiamat, maka tentunya kita harus patuh dan taat mengikuti petunjuk Al- Qur'an, selalu berbuat adil di antara sesama manusia, mengamalkan apa-apa yang diperintahkan, selalu waspada terhadap kemungkinan panggilan Allah yang datang dengan tiba-tiba, lalu tidak ada lagi kesempatan untuk berbuat baik, merugilah dia, dan di hari Kiamat nanti dia akan menyesal karena menyia-nyiakan kesempatan yang ada untuk beramal baik. Sabda Nabi saw:\n\nRasulullah saw bersabda,\"Tidak seorang pun yang meninggal dunia melainkan ia menyesal.\"Para sahabat bertanya, Apakah penyesalan mereka wahai Rasulullah?\" Nabi menjawab,\"Jika ia seorang yang berbuat baik maka ia menyesal karena kebaikannya tidak bertambah lagi. Jika ia seorang yang tidak baik maka ia menyesal karena tidak sempat melepaskan dirinya dari kejahatan itu. (Riwayat at-Tirmidhi)",
      "text_translation": "Allah yang menurunkan Kitab (Al-Qur'an) dengan (membawa) kebenaran dan neraca (keadilan). Dan tahukah kamu, boleh jadi hari Kiamat itu sudah dekat?",
      "text": "اَللّٰهُ الَّذِيْٓ اَنْزَلَ الْكِتٰبَ بِالْحَقِّ وَالْمِيْزَانَ ۗوَمَا يُدْرِيْكَ لَعَلَّ السَّاعَةَ قَرِيْبٌ ",
      "text_translation_en": "[for] it is God [Himself] who has bestowed revelation from on high, setting forth the truth, and [thus given man] a balance [wherewith to weigh right and wrong]. And for all thou knowest, the Last Hour may well be near!",
      "juz_number": 25
    },
    "18": {
      "text_tafsir_en": "It was reported that on one occasion the Prophet Muhammad mentioned Doomsday and at that time there were polytheists. So they asked in a tone of mocking and denying the coming of the Day of Judgment, \"When was the Day of Resurrection?\" So this verse comes down, the narration above tells us that those who did not believe the Doomsday were mocking the prophet and denying him. They want the Day of Judgment to come soon to prove who is right, they or Muhammad and his friends are right? Unlike the case with the Believers. The believers are afraid and anxious about the coming of Doomsday. They do not know what their fate will be on that day. They must be responsible for their deeds in the world and receive good and bad rewards for their actions. In line with this verse the word of God: And those who give what they give (almsgiving) with hearts full of fear (because they know) that in fact they will return to their Lord. (Al-Mu'minun \/ 23: 60) This verse closes with a firmness that those who deny and reject the Day of Judgment are people who are misguided, misguided, far from the truth. Because believing on the Day of Judgment is one of the pillars of faith, denying the Day of Judgment means denying the truth of God because justice is only obtained by humans on the Day of Judgment, there are so many injustices on this earth, where again those who are wronged will get their rights if not in God's court. People who want the hereafter in the sense of trusting and preparing to face it are people who have far-sighted vision, while those who deny Doomsday who consider their lives to end with their death are people whose vision of life is narrow. They will never feel spiritual satisfaction, because they are busy pursuing worldly pleasures. One characteristic that distinguishes between religious teachings and human thought that humans have ever applied in this world is the belief in the hereafter or the Day of Judgment, because it can be said the essence of faith in God, is faith in the hereafter, the place and time where humans must be responsible all his deeds in the world. The news of the Day of Resurrection and the resurrection of the dead must come true. God is the creator of the heavens and the earth, He is able and also destroys power and revive people who have died. As God says: And He started the creation, then repeated it again, and that was easier for Him. (ar-Rum \/ 30: 27)",
      "text_tafsir": "Diriwayatkan bahwa pernah di dalam suatu kesempatan Nabi Muhammad saw menyebut-nyebut hari Kiamat dan pada waktu itu ada orang-orang musyrik. Maka mereka bertanya dengan nada mengejek dan mendustakan kedatangan hari Kiamat itu, \"Kapankah hari Kiamat itu?\" Maka turunlah ayat ini, riwayat di atas menceritakan bahwa orang-orang yang tidak percaya akan terjadinya hari Kiamat itu mengejek nabi dan ingkar kepadanya. Mereka menginginkan supaya hari Kiamat itu segera datang untuk membuktikan siapakah yang benar, mereka atau Muhammad dan sahabatnya yang benar? \n\nBerbeda halnya dengan orang-orang Mukmin. Orang-orang Mukmin merasa takut dan cemas akan kedatangan hari Kiamat. Mereka belum tahu bagaimana nasibnya pada hari itu nanti. Mereka harus mempertanggungjawabkan amal perbuatan mereka di dunia dan menerima balasan baik dan buruk dari perbuatan mereka. Sejalan dengan ayat ini firman Allah:\n\nDan mereka yang memberikan apa yang mereka berikan (sedekah) dengan hati penuh rasa takut (karena mereka tahu) bahwa sesungguhnya mereka akan kembali kepada Tuhannya. (al-Mu'minun\/23: 60)\n\nAyat ini ditutup dengan satu ketegasan bahwa orang-orang yang membantah dan menolak akan adanya hari Kiamat adalah orang-orang yang sesat, salah jalan, jauh dari kebenaran.\n\nKarena percaya pada hari Kiamat merupakan salah satu rukun iman maka menafikan hari Kiamat berarti menafikan kebenaran Allah sebab keadilan yang hak hanya diperoleh manusia pada hari Kiamat, banyak sekali terjadi ketidakadilan di muka bumi ini, dimana lagi mereka yang terzalimi akan memperoleh hak-haknya kalau bukan di pengadilan Allah.\n\nOrang yang menginginkan hari akhirat dalam arti mempercayainya dan bersiap-siap menghadapinya adalah orang-orang yang memiliki visi jauh ke depan, sedangkan orang-orang yang mengingkari hari Kiamat yang menganggap kehidupannya berakhir dengan kematiannya adalah orang-orang yang visi hidupnya sempit. Mereka tidak akan pernah merasakan kepuasan rohani, karena sibuk mengejar kenikmatan duniawi.\n\nSalah satu ciri yang membedakan antara ajaran agama dan pemikiran manusia yang pernah diterapkan manusia di dunia ini adalah adanya kepercayaan pada hari akhirat atau hari Kiamat, karena bisa dikatakan inti dari iman kepada Allah, adalah iman kepada hari akhirat, tempat dan waktu dimana manusia harus mempertanggungjawabkan semua amal perbuatannya di dunia. Berita tentang hari Kiamat dan dibangkitkannya kembali orang-orang yang sudah mati itu pasti menjadi kenyataan.\n\nAllah merupakan pencipta langit dan bumi, Dia mampu dan kuasa pula menghancurkannya serta menghidupkan kembali orang-orang yang telah mati. Sebagaimana firman Allah:\n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. (ar-Rum\/30: 27)",
      "text_translation": "Orang-orang yang tidak percaya adanya hari Kiamat meminta agar hari itu segera terjadi, dan orang-orang yang beriman merasa takut kepadanya dan mereka yakin bahwa Kiamat itu adalah benar (akan terjadi). Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya Kiamat itu benar-benar telah tersesat jauh.",
      "text": "يَسْتَعْجِلُ بِهَا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِهَاۚ وَالَّذِيْنَ اٰمَنُوْا مُشْفِقُوْنَ مِنْهَاۙ وَيَعْلَمُوْنَ اَنَّهَا الْحَقُّ ۗ اَلَآ اِنَّ الَّذِيْنَ يُمَارُوْنَ فِى السَّاعَةِ لَفِيْ ضَلٰلٍۢ بَعِيْدٍ ",
      "text_translation_en": "Those who do not believe in it [mockingly] ask for its speedy advent whereas those who have attained to faith stand in awe of it, and know it to be the truth. Oh, verily, they who call the Last Hour in question have indeed gone far astray!",
      "juz_number": 25
    },
    "19": {
      "text_tafsir_en": "God explains that He always does good to His servants. He gave them useful things, kept them from the threatening disaster, gave sustenance to His faithful and infidel servants without any difference between them. God also expands and narrows the provision to His servant whom He wants as a test for the rich in his attitude toward the poor and a test for the poor in his relationship with the rich, so that the relationship between one and the other may be good because they need each other. As the word of God says: Are they the ones who partake of the mercy of your Lord? We are the ones who define their lives in the life of the world, and We have elevated some of them to some degree, so that some may benefit others. And the mercy of your Lord is better than what they gather. (az-Zukhruf \/ 43: 32) It is further explained that Allah is Almighty and Mighty, He does according to His will, and no one can prevent and hinder what He wills.",
      "text_tafsir": "Allah menerangkan bahwa Dia sendiri selalu berbuat baik kepada hamba-Nya. Dia memberi mereka hal-hal yang bermanfaat, menjauhkan mereka dari bencana yang mengancam, menganugerahkan rezeki kepada hamba-Nya yang mukmin dan yang kafir tanpa perbedaan di antara mereka. Allah juga melapangkan dan menyempitkan rezeki kepada hamba-Nya yang dikehendaki-Nya sebagai ujian bagi orang kaya dalam sikapnya terhadap orang fakir dan ujian bagi orang fakir dalam hubungannya dengan orang kaya, agar supaya hubungan antara seseorang dengan yang lain menjadi baik karena mereka saling membutuhkan. Sebagaimana firman Allah:\n\nApakah mereka yang membagi-bagi rahmat Tuhanmu? Kamilah yang menentukan penghidupan mereka dalam kehidupan dunia, dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain. Dan rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan. (az-Zukhruf\/43: 32)\n\nSelanjutnya dijelaskan bahwa Allah Mahakuasa dan Mahaperkasa, Dia berbuat menurut kehendak-Nya, tidak seorang pun yang dapat mencegah dan menghalangi apa yang dikehendaki-Nya.",
      "text_translation": "Allah Mahalembut terhadap hamba-hamba-Nya; Dia memberi rezeki kepada siapa yang Dia kehendaki dan Dia Mahakuat, Mahaperkasa.",
      "text": "اَللّٰهُ لَطِيْفٌۢ بِعِبَادِهٖ يَرْزُقُ مَنْ يَّشَاۤءُ ۚوَهُوَ الْقَوِيُّ الْعَزِيْزُ ࣖ ",
      "text_translation_en": "GOD is most kind unto His creatures: He provides sustenance for whomever He wills - for He alone is powerful, almighty!",
      "juz_number": 25
    },
    "20": {
      "text_tafsir_en": "In this verse it is explained that whoever desires the reward of charity and his efforts, Allah will make it easy for him to do good deeds, and then He will reward his deeds, one good with ten good things, and multiply according to the will of God. On the other hand, anyone who expects from the charity of his or her worldly wealth in all its forms and does not expect the practice and reward of the hereafter, then Allah will give as much as is determined for him, but he will not receive the reward of the hereafter because the charity is in accordance with his intention, and for each one to repay his deeds according to his intentions, as the Prophet saw: That is the charity according to his intention, and that every man should receive according to his intentions. (History of al-Bukhari and Muslim) The Qatadah says, \"Verily Allah gives reward to those whose deeds are intended for the Hereafter besides the pleasures of the world according to His will. This is in line with the word of Allah: Whoever wants the present life (earthly), then We will provide for him in this (world) what We desire for whom We will. Then We prepared for him (Hell) Hell; he will enter into a state of despair and turn away.And whoever desires the hereafter and strives in it earnestly, while he is a believer, they are the ones to whom it is best paid. (al-Isra '\/ 17: 18-19)",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa barang siapa yang menghendaki pahala dengan amal dan usahanya, Allah akan memudahkan baginya untuk beramal saleh, kemudian Dia mengganjar amalnya itu, satu kebaikan dengan sepuluh kebaikan sampai berlipatganda menurut kehendak Allah. Begitu pula sebaliknya, barang siapa mengharapkan dari amal usahanya kemewahan dunia dengan segala bentuknya dan tidak sedikit pun mengharapkan amalan dan pahala akhirat, maka Allah akan memberikan sebanyak apa yang telah ditentukan baginya, tetapi ia tidak akan memperoleh sedikit pun pahala akhirat karena amal itu sesuai dengan niatnya, dan bagi setiap orang balasan amalnya sesuai dengan niatnya, sebagaimana sabda Nabi saw:\n\nBahwasanya amal itu menurut niatnya, dan bahwasanya bagi setiap orang mendapat balasan sesuai dengan apa yang diniatkannya. (Riwayat al-Bukhari dan Muslim)\n\nQatadah berkata, \"Sesungguhnya Allah memberikan pahala kepada orang-orang yang amalnya diniatkan untuk akhirat selain untuk kesenangan dunia menurut kehendaknya. Allah tidak memberikan pahala di akhirat kepada orang yang beramal dengan niat memperoleh kenikmatan dunia saja.\" Hal ini sejalan dengan firman Allah:\n\nBarang siapa menghendaki kehidupan sekarang (duniawi), maka Kami segerakan baginya di (dunia) ini apa yang Kami kehendaki bagi orang yang Kami kehendaki. Kemudian Kami sediakan baginya (di akhirat) neraka Jahanam; dia akan memasukinya dalam keadaan tercela dan terusir.Dan barangsiapa menghendaki kehidupan akhirat dan berusaha ke arah itu dengan sungguh-sungguh, sedangkan dia beriman, maka mereka itulah orang yang usahanya dibalas dengan baik. (al-Isra'\/17: 18-19)",
      "text_translation": "Barangsiapa menghendaki keuntungan di akhirat akan Kami tambahkan keuntungan itu baginya dan barangsiapa menghendaki keuntungan di dunia Kami berikan kepadanya sebagian darinya (keuntungan dunia), tetapi dia tidak akan mendapat bagian di akhirat.",
      "text": "مَنْ كَانَ يُرِيْدُ حَرْثَ الْاٰخِرَةِ نَزِدْ لَهٗ فِيْ حَرْثِهٖۚ وَمَنْ كَانَ يُرِيْدُ حَرْثَ الدُّنْيَا نُؤْتِهٖ مِنْهَاۙ وَمَا لَهٗ فِى الْاٰخِرَةِ مِنْ نَّصِيْبٍ  ",
      "text_translation_en": "To him who desires a harvest in the life to come, We shall grant an increase in his harvest; whereas to him who desires [but] a harvest in this world, We [may] give something thereof - but he will have no share in [the blessings of] the life to come.",
      "juz_number": 25
    },
    "21": {
      "text_tafsir_en": "In this verse God explains that the Muslims do not follow the religion of Allah which Allah has made, but follow what their demons outlined, whether they were jinn or human. They banned something according to their desires, such as banning a camel cut off their ears, and legalizing carcasses, blood, gambling, and so on. So are the things that show their misdeeds that were committed in ignorance. Nevertheless, they were still given the opportunity to repent, for Allah had laid down a condition of holding back their punishment until the Day of Resurrection. If they had not believed they would have been destroyed, as God said: The Day of Resurrection is the day that is promised to them and the Day of Resurrection is more terrible and bitter. (al-Qamar \/ 54: 46) They have done wrong to themselves for doing things which Allah has not done. They will be cast into hell, a place of painful torment and a terrible place to return.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa orang-orang musyrik tidak mengikuti agama Islam yang disyariatkan Allah, tetapi mengikuti apa yang digariskan oleh setan-setan mereka, baik yang berupa jin maupun berupa manusia. Mereka mengharamkan sesuatu menurut nafsu mereka seperti mengharamkan unta yang terpotong telinganya, dan menghalalkan bangkai, darah, judi, dan lain-lain. Begitu pula hal-hal yang menunjukkan kesesatan mereka yang telah dilakukan pada zaman Jahiliah. Sekalipun demikian mereka masih diberi kesempatan untuk bertobat, karena Allah telah menggariskan satu ketentuan yaitu penangguhan azab bagi mereka sampai hari Kiamat. Kalau tidak niscaya mereka itu sudah dibinasakan, sebagaimana firman Allah:\n\nBahkan hari Kiamat itulah hari yang dijanjikan kepada mereka dan hari Kiamat itu lebih dahsyat dan lebih pahit. (al-Qamar\/54: 46)\n\nMereka itu telah berbuat zalim terhadap diri mereka sendiri karena telah mengada-adakan hal-hal yang tidak disyariatkan Allah. Mereka itu akan dimasukkan ke dalam neraka, satu tempat yang penuh siksa yang pedih dan seburuk-buruk tempat kembali.",
      "text_translation": "Apakah mereka mempunyai sesembahan selain Allah yang menetapkan aturan agama bagi mereka yang tidak diizinkan (diridai) Allah? Dan sekiranya tidak ada ketetapan yang menunda (hukuman dari Allah) tentulah hukuman di antara mereka telah dilaksanakan. Dan sungguh, orang-orang zalim itu akan mendapat azab yang sangat pedih.",
      "text": "اَمْ لَهُمْ شُرَكٰۤؤُا شَرَعُوْا لَهُمْ مِّنَ الدِّيْنِ مَا لَمْ يَأْذَنْۢ بِهِ اللّٰهُ ۗوَلَوْلَا كَلِمَةُ الْفَصْلِ لَقُضِيَ بَيْنَهُمْ ۗوَاِنَّ الظّٰلِمِيْنَ لَهُمْ عَذَابٌ اَلِيْمٌ  ",
      "text_translation_en": "Is it that they [who care for no more than this world] believe in forces supposed to have a share in God’s divinity, which enjoin upon them as a moral law something that God has never allowed? Now were it not for [God’s] decree on the final judgment, all would indeed have been decided be­tween them [in this world]: but, verily, grievous suffering awaits the evildoers [in the life to come].",
      "juz_number": 25
    },
    "22": {
      "text_tafsir_en": "In this verse God explains that the wicked are afraid, shadowed by the consequences of all the evil they have done in the world, and the torment that is the reward of their evil deeds which will surely overtake them. Whereas those who believe in God and obey what He commands and forbidden will be admitted into heaven, a place full of beautiful gardens, enjoying all the beauty and enjoyment therein according to their good will. food, beverages, or other forms of sight that have never been seen, heard by the human ear, and which pass through the human heart. It is a great gift that God has given them, far greater than any luxury in the world, as God says: It is the gift of God, given to whom He wills. And Allah has a great gift. (al-hadid \/ 57: 21)",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang zalim itu kelihatan takut, dibayang-bayangi oleh akibat dari berbagai perbuatan jahat yang pernah dilakukannya di dunia, dan siksa yang merupakan balasan dari perbuatan jahatnya yang pasti akan menimpa mereka. Sedangkan orang-orang yang beriman kepada Allah serta taat kepada apa yang diperintahkan dan dilarang-Nya akan dimasukkan ke dalam surga, satu tempat yang penuh dengan taman-taman yang indah, menikmati segala keindahan dan kesenangan yang ada di dalamnya sesuai dengan keinginannya baik yang berupa makanan, minuman, maupun yang berupa pemandangan yang belum pernah dilihat mata, didengar telinga, dan terlintas dalam hati seorang manusia. Semuanya itu adalah suatu kenikmatan besar yang dikaruniakan Allah kepada mereka, yang jauh lebih besar dari kemewahan yang pernah ada di dunia, sebagaimana firman Allah:\n\nItulah karunia Allah, yang diberikan kepada siapa yang Dia kehendaki. Dan Allah mempunyai karunia yang besar. (al-hadid\/57: 21)",
      "text_translation": "Kamu akan melihat orang-orang zalim itu sangat ketakutan karena (kejahatan-kejahatan) yang telah mereka lakukan, dan (azab) menimpa mereka. Dan orang-orang yang beriman dan mengerjakan kebajikan (berada) di dalam taman-taman surga, mereka memperoleh apa yang mereka kehendaki di sisi Tuhan. Yang demikian itu adalah karunia yang besar.",
      "text": "تَرَى الظّٰلِمِيْنَ مُشْفِقِيْنَ مِمَّا كَسَبُوْا وَهُوَ وَاقِعٌۢ بِهِمْ ۗوَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فِيْ رَوْضٰتِ الْجَنّٰتِۚ  لَهُمْ مَّا يَشَاۤءُوْنَ عِنْدَ رَبِّهِمْ ۗذٰلِكَ هُوَ الْفَضْلُ الْكَبِيْرُ ",
      "text_translation_en": "[In that life to come,] thou wilt see the evil­doers full of fear at [the thought of] what they have earned: for [now] it is bound to fall back upon them. And in the flowering meadows of the gardens [of paradise thou wilt see] those who have attained to faith and done righteous deeds: all that they might desire shall they have with their Sustainer: [and] this, this is the great bounty –",
      "juz_number": 25
    },
    "23": {
      "text_tafsir_en": "In this verse God explains that what has been said about the gift of grace and happiness and the glory of the hereafter for his faithful and virtuous servant is one of the glad tidings preached in the world to make it clear to them that this must be true. God then ordered Muhammad to convey to his people that in carrying out the task of calling and declaring the true religion, he did not ask for anything in return, but only hoped for the love of the Muslims towards himself, his relatives and other Muslims. Whoever does good, obeys, and obeys the commandments of God and His Messenger, Allah will multiply good things to him. One good is rewarded at least ten good, up to seven hundred good and even more, as the grace and gift of God, as Allah says: Surely, Allah will not punish a person for the size of a dharrah, and if there is a virtue (small dharrah), God will multiply it and give it a great reward from His side. (an-Nisa '\/ 4: 40) The Word of God: He who does good will receive tenfold for his deeds. (al-An'am \/ 6: 160) Allah says: The parable of those who treasure their way in the way of God is like a grain of grain grow seven stalks, on each stalk a hundred seeds. Allah has multiplied for whom He wills, and Allah is All-Knowing. (al-Baqarah \/ 2: 261) Next to this verse 23 is covered with an explanation that God forgave His servants' sins no matter how many and multiplied the merits of good deeds in the least, because He is the Most Forgiving, Most Merciful.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa apa yang telah diberitakan mengenai pemberian karunia dan kesenangan serta kemuliaan di akhirat bagi hamba-Nya yang beriman dan beramal saleh adalah satu berita gembira yang disampaikan di dunia agar jelas bagi mereka bahwa hal ini pasti menjadi kenyataan. Selanjutnya Allah memerintahkan Muhammad saw menyampaikan kepada kaumnya bahwa di dalam menjalankan tugas menyeru dan menyampaikan agama yang benar, ia tidak meminta balasan apa pun, tetapi ia hanya mengharapkan kasih sayang kaum Muslimin terhadap dirinya, kerabatnya dan kaum Muslimin lainnya.\n\nBarang siapa berbuat baik, taat, dan patuh kepada perintah Allah dan Rasul-Nya, Allah akan melipatgandakan kebaikan kepadanya. Satu kebaikan dibalas sekurang-kurangnya dengan sepuluh kebaikan, sampai tujuh ratus kebaikan bahkan lebih banyak lagi, sebagai rahmat dan karunia dari Allah, sebagaimana firman Allah:\n\nSungguh, Allah tidak akan menzalimi seseorang walaupun sebesar dharrah, dan jika ada kebajikan (sekecil dharrah), niscaya Allah akan melipatgandakannya dan memberikan pahala yang besar dari sisi-Nya. (an-Nisa'\/4: 40)\n\nFirman Allah:\n\nBarang siapa berbuat kebaikan mendapat balasan sepuluh kali lipat amalnya.(al-An'am\/6: 160)\n\nAllah berfirman:\n\nPerumpamaan orang yang menginfakkan hartanya di jalan Allah seperti sebutir biji yang menumbuhkan tujuh tangkai, pada setiap tangkai ada seratus biji. Allah melipatgandakan bagi siapa yang Dia kehendaki, dan Allah Mahaluas, Maha Mengetahui. (al-Baqarah\/2: 261)\n\nSelanjutnya ayat 23 ini ditutup dengan satu penjelasan bahwa Allah mengampuni kesalahan hamba-Nya bagaimana pun banyaknya dan melipatgandakan pahala amal kebaikan meskipun sedikit, karena Dia adalah Tuhan Maha Pengampun lagi Maha Mensyukuri.",
      "text_translation": "Itulah (karunia) yang diberitahukan Allah untuk menggembirakan hamba-hamba-Nya yang beriman dan mengerjakan kebajikan. Katakanlah (Muhammad), “Aku tidak meminta kepadamu sesuatu imbalan pun atas seruanku kecuali kasih sayang dalam kekeluargaan.” Dan barangsiapa mengerjakan kebaikan akan Kami tambahkan kebaikan baginya. Sungguh, Allah Maha Pengampun, Maha Mensyukuri.",
      "text": "ذٰلِكَ الَّذِيْ يُبَشِّرُ اللّٰهُ عِبَادَهُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِۗ قُلْ لَّآ اَسْـَٔلُكُمْ عَلَيْهِ اَجْرًا اِلَّا الْمَوَدَّةَ فِى الْقُرْبٰىۗ وَمَنْ يَّقْتَرِفْ حَسَنَةً نَّزِدْ لَهٗ فِيْهَا حُسْنًا ۗاِنَّ اللّٰهَ غَفُوْرٌ شَكُوْرٌ  ",
      "text_translation_en": "that [bounty] whereof God gives the glad tiding to such of His servants as attain to faith and do righteous deeds. Say [O Prophet]: “No reward do I ask of you for this [message] other than [that you should] love your fellow-men.” For, if anyone gains [the merit of] a good deed, We shall grant him through it an increase of good: and, verily, God is much-forgiving, ever responsive to gratitude.",
      "juz_number": 25
    },
    "24": {
      "text_tafsir_en": "In this verse God rejects the accusations of the Meccans that Muhammad saw to be a lie to Allah. This is a very bad thing. If God had willed, He could have locked your heart out for such a thing, not done except by the unbelievers. But God has already done and will continue to do that He will always destroy and destroy the perverse and strengthen the right and instill that right in the human race according to His purpose. That is why the religion that Muhammad saw day by day has become stronger and stronger, more and more, and more and more of his followers. God is all-knowing, all that is in his heart, and nothing is hidden from him, so everything is based on the knowledge of Allah, which encompasses everything. Therefore, their accusations against the Prophet Muhammad, who is believed to have lied about God, are known to him and have been proved in this verse.",
      "text_tafsir": "Dalam ayat ini Allah menolak tuduhan kaum musyrik Mekah bahwa Muhammad saw itu mengada-adakan dusta terhadap Allah. Ini adalah perbuatan yang amat buruk. Seandainya Allah menghendaki, tentu Dia dapat mengunci mati hatimu karena perbuatan semacam itu, tidak dilakukan kecuali oleh orang musyrikin.\n\nTetapi sunah Allah telah berlaku dan akan terus berlaku bahwa Dia selalu menghancurkan dan menghapuskan yang batil serta menguatkan yang hak dan menanamkan hakikat yang hak itu di kalangan manusia sesuai dengan ketentuan yang telah ditetapkan-Nya. Itulah sebabnya agama yang dibawa oleh Muhammad saw hari demi hari makin bertambah kuat dan mantap, makin tersebar luas, serta semakin bertambah banyak penganutnya.\n\nAllah Maha Mengetahui semua yang tersimpan dalam hati, tidak ada yang tersembunyi bagi-Nya, maka segala sesuatu terjadi berdasarkan ilmu Allah yang amat luas, meliputi segala sesuatu. Oleh sebab itu tuduhan mereka terhadap Nabi Muhammad yang dianggap telah mengada-adakan kebohongan tentang Allah diketahui oleh-Nya dan telah dibuktikan ketidakbenarannya dalam ayat ini.",
      "text_translation": "Ataukah mereka mengatakan, “Dia (Muhammad) telah mengada-adakan kebohongan tentang Allah.” Sekiranya Allah menghendaki niscaya Dia kunci hatimu. Dan Allah menghapus yang batil dan membenarkan yang benar dengan firman-Nya (Al-Qur'an). Sungguh, Dia Maha Mengetahui segala isi hati.",
      "text": "اَمْ يَقُوْلُوْنَ افْتَرٰى عَلَى اللّٰهِ كَذِبًاۚ فَاِنْ يَّشَاِ اللّٰهُ يَخْتِمْ عَلٰى قَلْبِكَ ۗوَيَمْحُ اللّٰهُ الْبَاطِلَ وَيُحِقُّ الْحَقَّ بِكَلِمٰتِهٖ ۗاِنَّهٗ عَلِيْمٌ ۢبِذَاتِ الصُّدُوْرِ  ",
      "text_translation_en": "DO THEY, perchance, say, “[Muhammad] has attri­buted his own lying inventions to God”? But then, had God so willed, He could have sealed thy heart [forever]: for God blots out all falsehood, and by His words proves the truth to be true. Verily, He has full knowledge of what is in the hearts [of men];",
      "juz_number": 25
    },
    "25": {
      "text_tafsir_en": "In this verse God explains that He is the one who receives His servant's repentance, forgiving sin and evil. Sayyidina 'Ali was once asked about repentance. He replied, \"The saddle has six conditions.\" 1. Regrets the evil deeds that have been committed in the past. 2. Perform compulsory worship that has been abandoned. 3. Restore the rights of the person he has abused. 4. Forcing herself to taste the bitterness of obedience as she tastes sweet. 5. Submitting his lust in obedience as if he had spoiled it by committing it. 6. Cry instead of the laughter he has done. This verse closes with the explanation that Allah is the All-Forgiving and knows all that His servants do for good or for evil, and then they are rewarded with rewards and torments.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Dia-lah yang menerima tobat hamba-Nya, memaafkan perbuatan dosa dan kejahatan. Sayyidina 'Ali pernah ditanya tentang tobat. Beliau menjawab, \"Tobat itu ada enam syarat.\"\n\n1. Menyesali perbuatan maksiat yang telah dikerjakan pada masa yang lalu.\n\n2. Mengerjakan ibadah wajib yang telah ditinggalkan.\n\n3. Mengembalikan hak orang yang telah diambilnya secara zalim.\n\n4. Memaksakan diri merasakan pahitnya ketaatan sebagaimana dia merasakan manisnya maksiat.\n\n5. Menundukkan hawa nafsunya dalam ketaatan sebagaimana ia telah memanjakannya dengan berbuat kemaksiatan.\n\n6. Menangis sebagai ganti gelak tawa yang pernah dilakukannya.\n\nAyat ini ditutup dengan penjelasan bahwa Allah itu Maha Mengampuni segala dosa dan mengetahui segala apa yang dikerjakan hamba-Nya baik berupa kebaikan maupun berupa kejahatan, lalu mereka dibalas dengan pahala dan siksa.",
      "text_translation": "Dan Dialah yang menerima tobat dari hamba-hamba-Nya dan memaafkan kesalahan-kesalahan dan mengetahui apa yang kamu kerjakan,",
      "text": "وَهُوَ الَّذِيْ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهٖ وَيَعْفُوْا عَنِ السَّيِّاٰتِ وَيَعْلَمُ مَا تَفْعَلُوْنَۙ  ",
      "text_translation_en": "and it is He who accepts repen­tance from His servants, and pardons bad deeds, and knows all that you do,",
      "juz_number": 25
    },
    "26": {
      "text_tafsir_en": "In this verse, God explains that He is always pleasing (praying) those who believe and do good and increase in their merits and bounties, as Allah says: And your Lord said, \"Pray to me that I may have mercy on you.\" \/ 40: 60) Allah says: And if My servants ask you about me, then I am near. I will grant the prayer of those who pray when they pray to me (al-Baqarah \/ 2: 186)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Dia senantiasa memperkenankan (doa) orang-orang yang beriman dan beramal saleh dan menambah bagi mereka pahala dan karunia, sebagaimana firman Allah:\n\nDan Tuhanmu berfirman, \"Berdoalah kepada-Ku, niscaya akan Aku perkenankan bagimu. (Gafir\/40: 60)\n\nAllah berfirman:\n\nDan apabila hamba-hamba-Ku bertanya kepadamu (Muhammad) tentang Aku, maka sesungguhnya Aku dekat. Aku Kabulkan permohonan orang yang berdoa apabila dia berdoa kepada-Ku. (al-Baqarah\/2: 186)",
      "text_translation": "dan Dia memperkenankan (doa) orang-orang yang beriman dan mengerjakan kebajikan serta menambah (pahala) kepada mereka dari karunia-Nya. Orang-orang yang ingkar akan mendapat azab yang sangat keras.",
      "text": "وَيَسْتَجِيْبُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَيَزِيْدُهُمْ مِّنْ فَضْلِهٖ ۗوَالْكٰفِرُوْنَ لَهُمْ عَذَابٌ شَدِيْدٌ ",
      "text_translation_en": "and responds unto all who attain to faith and do righteous deeds; and [it is He who, in the life to come,] will give them, out of His bounty, far more [than they will have deserved], whereas for the deniers of the truth there is [but] suffering severe in store.",
      "juz_number": 25
    },
    "27": {
      "text_tafsir_en": "In this verse God explains that He will not provide His servants with abundant sustenance, if the gift can lead them to arrogance and arrogance, as God says: Never! Indeed, the man really goes beyond the limits, when he sees himself as self-sufficient. (al-'Alaq \/ 96: 6-7) Allah provides for His servants at a certain rate, according to His will and in accordance with His wisdom. By the nature of God's providence, He provided sustenance even if that person did not believe even when man forgot his Lord, that is when Allah bestowed more and more provision. If they remain ungrateful, and dissolve in pleasure, then Allah will bring down their punishment according to the word of Allah: So when they forget the warnings given to them, We open all the doors for them. So that when they were pleased with what they had been given, We suddenly punished them, and at that moment they fell into despair. (al-An'am \/ 6: 44) From the above explanation, it can be said that one's wealth is not an indication that God loves him, but rather that wealth is a test stone for one's faith. Examples of how a person acts toward his wealth can be seen as using them for the benefit of himself and others, because of the involvement of others in his wealth and as a token of gratitude to the giver, or whether he uses that wealth only for his own pleasure and claims that his wealth acquired through his own efforts, forgetting the God of wealth. Allah says: And know that your wealth and your children are only a trial and that indeed Allah has a great reward. (al-Anfal \/ 8: 28) In this case, Karun and Pharaoh were a real example, for their wealth and success made them both proud of God. Abu Hani 'al-Khaulani said, \"I heard' Amr bin Khurait and others say that this verse (verse 27) was passed down to ahlusuffah (the home of the Prophet's mosque in Medina); ), they deprive the world of its glory.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa Dia tidak akan memberi hamba-Nya rezeki yang berlimpah-limpah, jika pemberian itu bisa membawa mereka kepada keangkuhan dan ketakaburan, sebagaimana firman Allah:\n\nSekali-kali tidak! Sungguh, manusia itu benar-benar melampaui batas, apabila melihat dirinya serba cukup. (al-'Alaq\/96: 6-7)\n\nAllah memberikan rezeki kepada hamba-hamba-Nya dengan kadar tertentu, sesuai dengan kehendak dan selaras dengan kebijaksanaan-Nya. Dengan sifat rahman Allah, Dia tetap memberikan rezeki meskipun orang itu tidak beriman bahkan ketika manusia melupakan Tuhannya, saat itulah Allah melimpahkan lebih banyak lagi rezekinya. Apabila mereka tetap tidak bersyukur, dan larut dalam kesenangan, barulah Allah menjatuhkan azabnya sebagaimana firman Allah:\n\nMaka ketika mereka melupakan peringatan yang telah diberikan kepada mereka, Kami pun membukakan semua pintu (kesenangan) untuk mereka. Sehingga ketika mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka secara tiba-tiba, maka ketika itu mereka terdiam putus asa. (al-An'am\/6: 44)\n\nBerdasarkan penjelasan di atas, dapat dikatakan bahwa kekayaan seseorang bukan indikator bahwa Allah sayang kepadanya, tetapi kekayaan justru menjadi batu ujian bagi keimanan seseorang. Contoh bagaimana sikap seseorang terhadap kekayaannya, dapat dilihat apakah dia menggunakannya untuk memberi manfaat bagi dirinya dan orang lain, karena keterlibatan hak orang lain pada kekayaannya dan sebagai tanda bersyukur kepada sang pemberi kekayaan, atau dia menggunakan kekayaan itu hanya untuk kesenangan dirinya dan mengklaim bahwa kekayaannya diperoleh melalui usahanya sendiri, sehingga lupa kepada Allah yang memberi kekayaan. Allah berfirman:\n\nDan ketahuilah bahwa hartamu dan anak-anakmu itu hanyalah sebagai cobaan dan sesungguhnya di sisi Allah ada pahala yang besar. (al-Anfal\/8: 28)\n\nDalam hal ini, Karun dan Fir'aun menjadi contoh nyata, karena kekayaan dan kejayaannya menyebabkan keduanya sombong kepada Allah. \n\nAbu Hani' al-Khaulani berkata, \"Saya mendengar 'Amr bin Khurait dan lainnya mengatakan bahwasanya ayat ini (ayat 27 ini) diturunkan kepada ahlusuffah (penghuni beranda masjid Nabi di Medinah); mereka berangan-angan memiliki harta benda (yang bertumpuk-tumpuk), mereka mengangankan kemegahan dunia.",
      "text_translation": "Dan sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya niscaya mereka akan berbuat melampaui batas di bumi, tetapi Dia menurunkan dengan ukuran yang Dia kehendaki. Sungguh, Dia Mahateliti terhadap (keadaan) hamba-hamba-Nya, Maha Melihat.",
      "text": "۞ وَلَوْ بَسَطَ اللّٰهُ الرِّزْقَ لِعِبَادِهٖ لَبَغَوْا فِى الْاَرْضِ وَلٰكِنْ يُنَزِّلُ بِقَدَرٍ مَّا يَشَاۤءُ ۗاِنَّهٗ بِعِبَادِهٖ خَبِيْرٌۢ بَصِيْرٌ ",
      "text_translation_en": "For, if God were to grant [in this world] abundant sustenance to [all of] His servants, they would behave on earth with wanton insolence: but as it is, He bestows [His grace] from on high in due measure, as He wills: for, verily, He is fully aware of [the needs of] His creatures, and sees them all.",
      "juz_number": 25
    },
    "28": {
      "text_tafsir_en": "In this verse God explains that it is He who sends down rain from heaven, helping those who are in despair because the water that is expected to come from heaven does not come. It is he who gives the blessing of the rain and brings forth abundant benefits and makes the soil fertile. He is the master of his servant's affairs, giving them evil. He is the one to be commended for the grace bestowed upon them. The Qatadah says, \"It is reported that a man said to 'Umar bin al-Khaththab,\" The rain is not falling, mankind is in despair, Amirul Mukminin. \"",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa Dia-lah yang menurunkan hujan dari langit, membantu mereka yang telah berputus asa karena air yang diharapkan datang dari langit tak kunjung datang. Dia-lah yang memberi berkah hujan itu dan mendatangkan manfaat yang banyak serta menjadikan tanah subur. Dia-lah yang menguasai urusan hamba-Nya, memberikan mereka maslahat. Dia-lah yang wajib dipuji atas rahmat yang telah dikaruniakan kepada mereka.\n\nQatadah berkata, \"Diriwayatkan bahwa seorang laki-laki berkata kepada 'Umar bin al-Khaththab, \"Hujan tidak turun, manusia sudah putus asa wahai Amirul Mukminin.\" Umar menjawab, \"Engkau sekalian akan dikaruniai hujan,\" lalu beliau membaca ayat ini.",
      "text_translation": "Dan Dialah yang menurunkan hujan setelah mereka berputus asa dan menyebarkan rahmat-Nya. Dan Dialah Maha Pelindung, Maha Terpuji.",
      "text": "وَهُوَ الَّذِيْ يُنَزِّلُ الْغَيْثَ مِنْۢ بَعْدِ مَا قَنَطُوْا وَيَنْشُرُ رَحْمَتَهٗ ۗوَهُوَ الْوَلِيُّ الْحَمِيْدُ ",
      "text_translation_en": "And it is He who sends down rain after [men] have lost all hope, and unfolds His grace [thereby]: for He alone is [their] Protector, the One to whom all praise is due.",
      "juz_number": 25
    },
    "29": {
      "text_tafsir_en": "In this verse Allah explains that some of the signs of His power and greatness are the creation of heaven and earth and what is spread between them like creeping and moving animals including humans, jinns, and all animals with various shapes and patterns and colors . God has the power to gather people later, both those who came first and those who came later, as well as other creatures; in Padang Mahsyar then He will give back to them as fairly as possible. As Allah says: And (remember) on the day (when) we run the mountains and you will see that the earth is flat and We gather them (all men), and we will not leave any of them. (al-Kahf \/ 18: 47) When we consider the above verse, we feel that Allah is explaining the existence of other living beings in space. Before discussing the above verse, it is necessary to consider first the related verse below: And He subjected all that is in heaven and what is on earth to you all (as a mercy) from Him. Indeed, in such a case there are truly signs (the greatness of God) for those who think. (al-Jatsiyah \/ 45: 13) The above verse mentions the word \"subdue\". The word can be interpreted that humans can utilize celestial objects, such as planets and stars. Examples are the moon and the sun which have regular orbits. This orbital order is used by humans to make time or calendar dates and other things for their life needs. Another example is about the arrival of iron from outer space which is clearly stated in Surah al-hadid \/ 57: 25. It is clearly stated that Allah has created galaxies, planets and stars and other celestial bodies, and spread them, among them, living things as the results of his creation. That is, it is very possible that He sends creation from one planet to another. Likewise, with the other two verses that discuss livestock that were descended from space (al-An'am \/ 6: 143 and az-Zumar \/ 39: 6) From the standpoint of science, much of the evidence points to what Al-explained The Qur'an. On August 7, 1996, NASA researchers (the US space agency) announced there would be microscopic life findings on the planet Mars three billion years ago. Although many oppose this theory, the Galileo spacecraft's discovery of a red sea beneath the ice on Jupiter's European satellite, is very promising. In the near future the oldest question that will always be ingrained in the minds of humans will be answered: \"Are there living beings up there? Or are we in this world the only living things in the universe?\" If there really is life up there, then where can they be found. Our first guess is on the planets that are there. In \"earths\" in galaxies in the universe. This is reflected in the Quranic Surah ath-thalaq \/ 65: 12 which states, \"Allah created the seven heavens and the earth like them ......\" Thus, because there are millions of galaxies, Allah also created billions of earth, scattered in universe. Whereas the word \"earth\" used here refers to planets that have life. By adhering to the Qur'anic statement and the little evidence obtained by science, we come to the conclusion that extraterrestrials do exist. The next question, will we be able to find it? Allah gave an indication to Surah Fussilat \/ 41: 53 \"We will show them our signs (verses) in the horizon ...\". This indication gives hope that one day we will be able to meet extraterrestrial life, including intelligent beings.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa sebagian dari tanda-tanda kekuasaan dan kebesaran-Nya ialah diciptakan-Nya langit dan bumi serta apa yang tersebar pada keduanya seperti binatang yang melata dan bergerak termasuk manusia, jin, dan semua hewan dengan berbagai bentuk dan corak serta warnanya. \n\nAllah kuasa mengumpulkan manusia di hari kemudian, baik yang datang lebih dulu maupun yang datang kemudian, begitu juga makhluk yang lain; di Padang Mahsyar kemudian Dia akan memberikan balasan kepada mereka dengan seadil-adilnya. Sebagaimana firman Allah:\n\nDan (ingatlah) pada hari (ketika) Kami perjalankan gunung-gunung dan engkau akan melihat bumi itu rata dan Kami kumpulkan mereka (seluruh manusia), dan tidak Kami tinggalkan seorang pun dari mereka. (al-Kahf\/18: 47)\n\nApabila diperhatikan ayat di atas, kita merasa bahwa Allah sedang menjelaskan mengenai adanya makhluk hidup lain di luar angkasa. Sebelum membahas ayat di atas, perlu disimak terlebih dahulu ayat terkait di bawah:\n\nDan Dia menundukkan apa yang ada di langit dan apa yang ada di bumi untukmu semuanya (sebagai rahmat) dari-Nya. Sungguh, dalam hal yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang bepikir. (al-Jatsiyah\/45: 13)\n\nAyat di atas menyebutkan kata \"menundukkan\". Kata tersebut dapat diinterpretasikan bahwa manusia dapat memanfaatkan benda-benda langit, seperti planet dan bintang. Contohnya adalah bulan dan matahari yang mempunyai orbit yang teratur. Keteraturan orbit ini digunakan manusia untuk membuat penanda waktu atau penanggalan dan hal-hal lain untuk keperluan hidupnya. Contoh lain adalah mengenai datangnya besi dari luar angkasa yang secara jelas dinyatakan pada Surah al-hadid\/57: 25. \n\nSecara jelas disebutkan bahwa Allah telah menciptakan galaksi, planet dan bintang dan benda langit lainnya, dan menyebarkan padanya, di antaranya, makhluk hidup sebagai hasil ciptaan-Nya. Artinya, sangatlah memungkinkan bahwa Dia mengirimkan ciptaan dari satu planet ke planet lainnya. Demikian pula halnya dengan dua ayat lain yang membahas mengenai binatang ternak yang diturunkan dari ruang angkasa (al-An'am\/6:143 dan az-Zumar\/39: 6)\n\nDari sudut ilmu pengetahuan, banyak pembuktian mengarah pada apa yang dijelaskan Al-Qur'an. Pada tanggal 7 Agustus 1996, para peneliti NASA (badan antariksa Amerika Serikat) mengumumkan akan adanya temuan kehidupan mikroskopis di planet Mars tiga miliar tahun yang lalu. Walaupun banyak yang menentang teori ini, namun temuan pesawat ruang angkasa Galileo akan adanya laut yang berwarna merah di bawah lapisan es di satelit planet Jupiter, Europe, sangat menjanjikan. Dalam waktu dekat akan terjawab pertanyaan tertua yang selalu tertanam dalam benak manusia: \"Apakah ada makhluk hidup di atas sana? Ataukah kita yang ada di dunia ini adalah satu-satunya makhluk hidup di alam raya?\"\n\nApabila memang ada kehidupan di atas sana, maka di manakah mereka dapat ditemukan. Tebakan kita pertama adalah di planet-planet yang ada di sana. Di \"bumi-bumi\" yang ada pada galaksi-galaksi yang ada di alam semesta. Ini dicerminkan secara Quranik pada Surah ath-thalaq\/65: 12 yang menyatakan, \"Allah yang menciptakan tujuh langit dan bumi seperti mereka ......\" Dengan demikian, karena terdapat jutaan galaksi, maka Allah juga menciptakan miliaran bumi, tersebar di alam semesta. Sedangkan kata \"bumi\" yang digunakan di sini menunjukkan planet yang mempunyai kehidupan. Dengan berpegang pada pernyataan Al-Qur'an dan sedikit bukti yang diperoleh ilmu pengetahuan, kita sampai pada satu kesimpulan bahwa makhluk di luar angkasa memang ada.\n\nPertanyaan selanjutnya, apakah kita akan dapat menemukannya? Allah memberikan indikasinya pada Surah Fussilat\/41: 53 \"Kami akan memperlihatkan kepada mereka tanda-tanda (ayat-ayat) Kami di segenap ufuk ....\". Indikasi ini memberikan harapan bahwa pada suatu waktu kita akan dapat bertemu dengan kehidupan extraterestrial, termasuk di dalamnya makhluk yang cerdas.",
      "text_translation": "Dan di antara tanda-tanda (kebesaran)-Nya adalah penciptaan langit dan bumi dan makhluk-makhluk yang melata yang Dia sebarkan pada keduanya. Dan Dia Mahakuasa mengumpulkan semuanya apabila Dia kehendaki.",
      "text": "وَمِنْ اٰيٰتِهٖ خَلْقُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَثَّ فِيْهِمَا مِنْ دَاۤبَّةٍ ۗوَهُوَ عَلٰى جَمْعِهِمْ اِذَا يَشَاۤءُ قَدِيْرٌ ࣖ",
      "text_translation_en": "And among His signs is the [very] creation of the heavens and the earth, and of all the living creatures which He has caused to multiply throughout them: and [since He has created them,] He has [also] the power to gather them [unto Him­self] whenever He wills.",
      "juz_number": 25
    },
    "30": {
      "text_tafsir_en": "In this verse Allah explains that what happens to people in the world in the form of catastrophic illnesses and others is the result of their own actions, the evil deeds they have committed and the sins they have committed as the Prophet saw: 'Ali said, \"Will you tell me about a very important verse in the Qur'an as the Prophet (peace and blessings be upon him) recited to us. \"And whatever misfortune befalls you is due to the work of your own hands, and Allah forgives many (of his faults). \"O 'Ali, I will explain to you this verse,\" Whatever misfortune befalls you \"that is from sickness and torment or catastrophe in the world,\" due to the doings of your own hand \"(Ahmad's History) , cruelty, hardship, and even a piece of thorns that pierces a Muslim, but God removes his sins. (Al-Bukhari's History) disease or disaster is caused by human error. But on the other hand it can remove sin like the hadith above. It depends on how people react, whether by patience or despair. This verse closes with an affirmation that God forgives most of the wrongs his servants have committed as a great mercy given to his servants, otherwise, human beings will be destroyed according to the heap of sins they have committed, as Allah says: And if Allah punishes men for their unrighteousness, then He will not leave any of the creatures alone, but Allah will hold them back until the appointed time. (an-Nahl \/ 16: 61) And His Word: And if Allah should punish men for what they did, He would not leave any living creature on this earth, but He would suspend it, until time specified. (Fathir \/ 35: 45)",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa apa yang menimpa manusia di dunia berupa bencana penyakit dan lain-lainnya adalah akibat perbuatan mereka sendiri, perbuatan maksiat yang telah dilakukannya dan dosa yang telah dikerjakannya sebagaimana sabda Nabi saw:\n\n'Ali berkata, \"Maukah kalian aku beritahukan mengenai ayat yang sangat utama dalam Al-Qur'an sebagaimana Nabi saw sampaikan kepada kami.(Nabi saw membacakan firman Allah)\"Dan musibah apa pun yang menimpa kamu adalah disebabkan oleh perbuatan tanganmu sendiri, dan Allah memaafkan banyak(dari kesalahan-kesalahannya).\"Wahai 'Ali , aku akan menjelaskan ayat ini kepadamu, \"Musibah apa pun yang menimpa kamu\" yaitu dari penyakit dan siksaan atau bencana di dunia, \"disebabkan oleh perbuatan tanganmu sendiri\" (Riwayat Ahmad)\n\nTidaklah suatu keletihan, penyakit, kesusahan, kesedihan, kezaliman, kesempitan, bahkan sepotong duri pun yang menusuk seorang muslim, melainkan dengan hal itu Allah menghapus dosa-dosanya. (Riwayat al-Bukhari)\n\nDatangnya penyakit atau musibah adalah disebabkan ulah manusia itu sendiri. Tetapi di sisi lain penyakit atau musibah itu dapat menghapus dosa seperti hadis di atas. Hal itu tergantung kepada cara manusia menyikapi, apakah dengan bersabar atau berputus asa. \n\nAyat ini ditutup dengan satu ketegasan bahwa Allah mengampuni sebagian besar dari kesalahan-kesalahan yang telah diperbuat hamba-Nya sebagai satu rahmat besar yang dikaruniakan Allah kepada hamba-Nya, karena kalau tidak, niscaya manusia akan dihancurkan sesuai dengan timbunan dosa yang telah diperbuat mereka, sebagaimana firman Allah:\n\nDan kalau Allah menghukum manusia karena kezalimannya, niscaya tidak akan ada yang ditinggalkan-Nya (di bumi) dari makhluk yang melata sekalipun, tetapi Allah menangguhkan mereka sampai waktu yang sudah ditentukan. (an-Nahl\/16: 61)\n\nDan firman-Nya:\n\nDan sekiranya Allah menghukum manusia disebabkan apa yang telah mereka perbuat, niscaya Dia tidak akan menyisakan satu pun makhluk bergerak yang bernyawa di bumi ini, tetapi Dia menangguhkan (hukuman)nya, sampai waktu yang sudah ditentukan. (Fathir\/35: 45)",
      "text_translation": "Dan musibah apa pun yang menimpa kamu adalah disebabkan oleh perbuatan tanganmu sendiri, dan Allah memaafkan banyak (dari kesalahan-kesalahanmu).",
      "text": "وَمَآ اَصَابَكُمْ مِّنْ مُّصِيْبَةٍ فَبِمَا كَسَبَتْ اَيْدِيْكُمْ وَيَعْفُوْا عَنْ كَثِيْرٍۗ ",
      "text_translation_en": "Now whatever calamity may befall you [on Judgment Day] will be an outcome of what your own hands have wrought, although He pardons much;",
      "juz_number": 25
    },
    "31": {
      "text_tafsir_en": "In this verse God explains that man cannot escape and will not escape the torment of God in this world and wherever they are. They will have no protection, for only Allah will protect them from the punishment that will come upon them because of the evil that they have done. They will find no help other than Allah when they receive punishment. Therefore, it is proper for man to abstain from evil and not to disobey His command because no one can reject the punishment of Allah if He has brought down the punishment to His servant. If a sinful person is not punished in the world, do not think that it is because of one's power or power, but that it is God's will for them to suffer a greater and more painful torment in the hereafter, as God says: the unbelievers think that the time that We have given them is better for them. Indeed, the time limit We have given them is only for their sin to increase; and they will have a humiliating punishment. (Ali 'Imran \/ 3: 178)",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa manusia itu tidak akan dapat melepaskan diri dan tidak akan dapat mengelak dari azab Allah di dunia ini dan di mana pun mereka berada. Mereka tidak akan memperoleh pelindung, karena hanya Allah yang akan dapat melindungi mereka dari azab yang akan menimpa mereka akibat maksiat yang telah diperbuatnya. Mereka tidak akan mendapat penolong selain dari Allah apabila mereka mendapat azab. Oleh karena itu, selayaknya manusia menjauhkan diri dari maksiat dan tidak menyalahi perintah-Nya karena tidak ada seorang pun yang dapat menolak azab Allah, apabila Dia telah menjatuhkan azab kepada hamba-Nya. Kalau manusia yang bergelimang dosa itu tidak diazab di dunia, jangan dikira bahwa itu adalah karena kekuasaan atau keperkasaan seseorang, tetapi adalah karena Allah menghendaki yang demikian itu agar mereka mendapat siksaan lebih keras dan lebih pedih di akhirat, sebagaimana firman Allah:\n\nDan jangan sekali-kali orang-orang kafir itu mengira bahwa tenggang waktu yang Kami berikan kepada mereka lebih baik baginya. Sesungguhnya tenggang waktu yang Kami berikan kepada mereka hanyalah agar dosa mereka semakin bertambah; dan mereka akan mendapat azab yang menghinakan. (Ali 'Imran\/3: 178)",
      "text_translation": "Dan kamu tidak dapat melepaskan diri (dari siksaan Allah) di bumi, dan kamu tidak memperoleh pelindung atau penolong selain Allah.",
      "text": "وَمَآ اَنْتُمْ بِمُعْجِزِيْنَ فِى الْاَرْضِۚ وَمَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ وَّلِيٍّ وَّلَا نَصِيْرٍ ",
      "text_translation_en": "and you cannot elude Him on earth, and you will have none to protect you from God [in the life to come], and none to bring you succour.",
      "juz_number": 25
    },
    "32": {
      "text_tafsir_en": "In this verse Allah explains that some of the signs of His power, greatness and might are His submission to the sea for humans so that ships can sail in the sea like a big mountain or a village on the water. This verse likens ships sailing like mountains. This verse also implies, that the mountains actually move, something that is difficult to digest for ordinary people, but something that has been accepted in geology. As geologists often say, mountains actually float like ships floating in the ocean. In this verse, Allah shows that the sailing ship is like a mountain, which for ordinary people is certainly difficult to understand. To ordinary people the mountains seemed silent. Mountains (in this case as continents \/ continents) do in fact float above the asthenosphere and move like ships that sail (see explanation on Juz 20, An-Naml \/ 27: 88). It is only known that in the sixties of the twentieth century the theory of continental buoyancy, which had already begun in the early 20th century, together with the theory of mid-ocean expansion, underlies the theory of plate tectonics discovered by scientists.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa sebagian dari tanda-tanda kekuasaan, kebesaran dan keperkasaan-Nya ialah ditundukkan-Nya laut bagi manusia hingga kapal bisa berlayar di laut laksana gunung besar atau satu perkampungan di atas air.\n\nAyat ini mengibaratkan kapal-kapal berlayar seperti gunung-gunung. Ayat ini mengisyaratkan pula, bahwa sesungguhnya gunung-gunung itu juga bergerak, sesuatu yang sulit dicerna bagi orang awam, namun sesuatu yang sudah diterima dalam ilmu geologi. Seperti sering dikatakan oleh para ahli geologi bahwa gunung-gunung sesungguhnya mengapung seperti laiknya kapal-kapal mengapung di samudra. Dalam ayat ini, Allah justru memperlihatkan bahwa kapal yang berlayar itu ibarat gunung, yang bagi orang awam tentu sulit memahaminya. Bagi orang awam gunung-gunung itu tampak diam. Gunung-gunung (dalam hal ini sebagai bagian kontinen\/benua) pada kenyataannya memang mengapung di atas astenosfer dan bergerak seperti halnya kapal yang berlayar (lihat penjelasan pada Juz 20, An-Naml\/27: 88). Seperti diketahui baru pada dekade tahun enampuluhan abad ke-20 teori apungan benua, yang cikal bakalnya sudah dimulai pada awal abad 20, bersama teori pemekaran tengah samudra melandasi teori tektonik lempeng ditemukan para ilmuwan.",
      "text_translation": "Dan di antara tanda-tanda (kebesaran)-Nya ialah kapal-kapal (yang berlayar) di laut seperti gunung-gunung.",
      "text": "وَمِنْ اٰيٰتِهِ الْجَوَارِ فِى الْبَحْرِ كَالْاَعْلَامِ ۗ ",
      "text_translation_en": "And among His signs are the ships that sail like [floating] mountains through the seas:",
      "juz_number": 25
    },
    "33": {
      "text_tafsir_en": "If God wanted the ship that sailed no longer to sail, then He would withstand the wind that pushed the ship to move and sail, and the ship remained on the surface of the water can not go forward or backward. People who can understand and realize this are people who have a broad, patient and obedient view of God's command to be always grateful for the blessings that God has given him. Disasters that occur at a place in the form of earthquakes, landslides, waves that wash away and destroy, and others are considered by some people to be just a natural event that has nothing to do with God's power. The Word of God: And how many signs (the greatness of God) in the heavens and the earth they passed, but they turned away from it. (Yusuf \/ 12: 105) This verse is a continuation of the previous verse (ash-Shura \/ 42: 32), that after successfully floating on water, traditional ships need wind energy as a driving force. With the wind the sailboat can be pushed and with it can also be controlled through the use of sails and steering. If the wind stops, the ship cannot move practically. In the absence of sea breeze the wind will also stop.",
      "text_tafsir": "Seandainya Allah menghendaki kapal yang berlayar tadi tidak dapat berlayar lagi, maka Dia akan menahan angin yang mendorong kapal tadi bergerak dan berlayar, dan tinggallah kapal itu tetap di permukaan air tidak dapat maju atau mundur. \n\nOrang-orang yang dapat mengerti dan menyadari hal ini ialah orang-orang yang mempunyai pandangan luas, sabar dan patuh kepada perintah Allah senantiasa mensyukuri nikmat yang dikaruniakan Allah kepadanya. Adanya bencana yang terjadi pada suatu tempat berupa gempa bumi, tanah longsor, ombak yang menghanyutkan dan membinasakan, dan lain-lain dianggap oleh sebagian orang hanya kejadian alam yang tidak ada hubungan sedikit pun dengan kekuasaan Allah. Firman Allah:\n\nDan berapa banyak tanda-tanda (kebesaran Allah) di langit dan di bumi yang mereka lalui, namun mereka berpaling daripadanya. (Yusuf\/12: 105)\n\nAyat ini merupakan kelanjutan ayat sebelumnya (asy-Syura\/42: 32), bahwa setelah berhasil mengapung di atas air, kapal tradisional memerlukan energi angin sebagai penggerak. Dengan adanya angin kapal layar dapat terdorong dan dengannya dapat pula dikendalikan melalui penggunaan layar dan kemudi. Apabila hembusan angin terhenti maka praktis kapal tidak dapat bergerak. Dengan tidak adanya angin gelombang laut pun akan terhenti pula.",
      "text_translation": "Jika Dia menghendaki, Dia akan menghentikan angin, sehingga jadilah (kapal-kapal) itu terhenti di permukaan laut. Sungguh, pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi orang yang selalu bersabar dan banyak bersyukur,",
      "text": "اِنْ يَّشَأْ يُسْكِنِ الرِّيْحَ فَيَظْلَلْنَ رَوَاكِدَ عَلٰى ظَهْرِهٖۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍۙ",
      "text_translation_en": "if He so wills, He stills the wind, and then they lie motion­less on the sea’s surface - [and] herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grateful [to God];",
      "juz_number": 25
    },
    "34": {
      "text_tafsir_en": "In this verse, it is explained that in addition to Allah's power to withstand the wind so that the ship cannot move from its place, He also has the power to destroy the ship by sending a hurricane that makes the ship that sails unstable, erratic direction traveled, will not reach the intended destination , finally sinking to the bottom of the sea due to passengers who are wrapped in sin. However, this is rarely the case because God has forgiven and forgiven most of them, so they survived their journey across the vast sea to the destination.",
      "text_tafsir": "Pada ayat ini diterangkan bahwa selain Allah kuasa menahan angin sehingga kapal itu tidak dapat beranjak dari tempatnya, Dia juga kuasa menghancurkan kapal itu dengan mengirimkan angin topan yang menjadikan kapal yang berlayar itu oleng, tak menentu arah yang ditempuh, tak akan sampai ke sasaran yang dituju, akhirnya tenggelam ke dasar laut akibat penumpangnya yang bergelimang dosa. Tetapi, yang demikian itu jarang terjadi karena Allah telah memberi maaf dan mengampuni sebagian besar dari mereka, sehingga mereka selamat dalam perjalanannya mengarungi laut yang luas ke tempat yang dituju.",
      "text_translation": "atau (Dia akan) menghancurkan kapal-kapal itu karena perbuatan (dosa) mereka, dan Dia memaafkan banyak (dari mereka),",
      "text": "اَوْ يُوْبِقْهُنَّ بِمَا كَسَبُوْا وَيَعْفُ عَنْ كَثِيْرٍۙ ",
      "text_translation_en": "or else He may cause them to perish because of what they have wrought; and [withal,] He pardons much.",
      "juz_number": 25
    },
    "35": {
      "text_tafsir_en": "In this verse God explains that the things described above show His power and might; may those who constantly argue and refuse to acknowledge the power of God realize that it can benefit and bring harm but Allah and if He wills, then no one will be able to escape or escape the punishment he has prescribed.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa hal-hal yang telah digambarkan di atas itu menunjukkan kekuasaan dan keperkasaan-Nya; kiranya orang-orang yang selalu membantah dan tidak mau mengakui kekuasaan Allah dapat menyadari bahwa yang dapat memberikan manfaat dan mendatangkan mudarat tidak lain hanyalah Allah dan kalau Dia menghendaki, maka tidak seorang pun yang dapat menghindar atau luput dari azab yang telah ditetapkannya itu.",
      "text_translation": "dan agar orang-orang yang membantah tanda-tanda (kekuasaan) Kami mengetahui bahwa mereka tidak akan memperoleh jalan keluar (dari siksaan).",
      "text": "وَّيَعْلَمَ الَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِنَاۗ مَا لَهُمْ مِّنْ مَّحِيْصٍ ",
      "text_translation_en": "And let them know, those who call Our mes­sages in question, that for them there is no escape.",
      "juz_number": 25
    },
    "36": {
      "text_tafsir_en": "In this verse God explains that the enjoyment of human life whether in wealth, wealth accumulation, or descent and so forth is a trivial and insignificant pleasure because no matter how accumulated it is, time to own is limited. In time it will be separated because if it were not human who left it, then the things themselves will leave the human being, while the merit and favor of Allah are far better than the pleasures and splendor of the world, for what is with Allah eternal and eternal, while the pleasures of the world are eternal and pass away. This verse closes with a certainty that eternal and lasting pleasure is only for those who believe in God and His Messenger, those who are faithful and surrender to the Lord who has nurtured and treated them well. Al-Qurthubi in his interpretation quotes a story from 'Ali who says that when Abu Bakr collected the wealth of the Children of Murrah he donated all the money for good in hopes of Allah's will. His actions were condemned by the Muslims while the unbelievers blamed his actions, so down to verses 36 and 37 of this chapter.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa kesenangan hidup manusia baik berupa kekayaan, rezeki harta yang bertumpuk, maupun keturunan dan lain-lain adalah kesenangan yang tidak berarti dan kurang bernilai karena bagaimana pun menumpuknya harta, waktu untuk memilikinya terbatas. Pada waktunya nanti akan berpisah karena kalau bukan manusia yang meninggalkannya, maka benda-benda itu sendiri yang akan meninggalkan manusia, sedangkan pahala dan nikmat yang ada pada sisi Allah jauh lebih baik dibandingkan dengan kesenangan dan kemegahan dunia itu, karena apa yang ada di sisi Allah kekal dan abadi, sedangkan kesenangan dunia semuanya fana dan akan lenyap. Ayat ini ditutup dengan satu ketegasan bahwa kesenangan yang kekal dan abadi itu hanya untuk orang-orang yang beriman kepada Allah dan Rasul-Nya, orang-orang yang bertawakal dan berserah diri kepada Tuhan yang telah memelihara dan berbuat baik kepada mereka.\n\nAl-Qurthubi dalam tafsirnya menukil riwayat dari 'Ali yang mengatakan bahwa ketika Abu Bakar mengumpulkan harta dari Bani Murrah beliau mendermakan seluruh uang tersebut untuk kebaikan karena mengharapkan keridaan Allah. Perbuatannya tersebut dicela oleh orang-orang musyrikin sedangkan orang-orang kafir menyalahkan tindakannya, maka turunlah ayat 36 dan 37 surah ini.",
      "text_translation": "Apa pun (kenikmatan) yang diberikan kepadamu, maka itu adalah kesenangan hidup di dunia. Sedangkan apa (kenikmatan) yang ada di sisi Allah lebih baik dan lebih kekal bagi orang-orang yang beriman, dan hanya kepada Tuhan mereka bertawakal,",
      "text": "فَمَآ اُوْتِيْتُمْ مِّنْ شَيْءٍ فَمَتَاعُ الْحَيٰوةِ الدُّنْيَا ۚوَمَا عِنْدَ اللّٰهِ خَيْرٌ وَّاَبْقٰى لِلَّذِيْنَ اٰمَنُوْا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُوْنَۚ ",
      "text_translation_en": "AND [remember that] whatever you are given [now] is but for the [passing] enjoyment of life in this world - whereas that which is with God is far better and more enduring. [It shall be given] to all who attain to faith and in their Sustainer place their trust;",
      "juz_number": 25
    },
    "37": {
      "text_tafsir_en": "In this verse God explains that those who will enjoy eternal happiness in the hereafter are those who abstain from major sins such as killing, adultery and stealing, and avoiding things that are not allowed in syara, good sense, and good moral character. speech or action. So are those who when their anger arises, they hold their anger, forgive the person who causes their anger and do not have the slightest degree of resentment. It is reported that Allah's Messenger (may peace be upon him) never defended his own interests unless the laws of Allah were violated and humiliated. Forgiveness is the very nature of piety and is indeed the rule of God, as He says: Liberation is closer to piety. (al-Baqarah \/ 2: 237) And he says: Be forgiving and bid the people who do what is right, and do not care about the foolish. (al-A'raf \/ 7: 199)",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa yang akan memperoleh kesenangan yang abadi di akhirat nanti ialah orang-orang yang menjauhi dosa-dosa besar seperti membunuh, berzina dan mencuri, serta menghindarkan hal-hal yang tidak dibenarkan syarak, akal sehat, dan akhlak mulia baik berupa ucapan maupun berupa perbuatan. Begitu juga orang-orang yang apabila amarahnya timbul, mereka diam menahan amarahnya, memaafkan orang yang menyebabkan kemarahannya dan tidak ada dalam batinnya sedikit pun rasa dendam. Diriwayatkan bahwa Rasulullah saw tidak pernah membela kepentingan dirinya kecuali apabila hukum-hukum Allah dilanggar dan dihinakan. \n\nSifat pemaaf adalah sifat yang dekat kepada takwa dan memang diperintah Allah, sebagaimana firman-Nya:\n\nPembebasan itu lebih dekat kepada takwa. (al-Baqarah\/2: 237)\n\nDan firman-Nya:\n\nJadilah pemaaf dan suruhlah orang mengerjakan yang makruf, serta jangan pedulikan orang-orang yang bodoh. (al-A'raf\/7: 199)",
      "text_translation": "dan juga (bagi) orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, dan apabila mereka marah segera memberi maaf,",
      "text": "وَالَّذِيْنَ يَجْتَنِبُوْنَ كَبٰۤىِٕرَ الْاِثْمِ وَالْفَوَاحِشَ وَاِذَا مَا غَضِبُوْا هُمْ يَغْفِرُوْنَ ۚ ",
      "text_translation_en": "and who shun the more heinous sins and abominations; and who, whenever they are moved to anger, readily forgive;",
      "juz_number": 25
    },
    "38": {
      "text_tafsir_en": "This verse explains that those who welcomed God's call to his religion are like emptying and purifying His substance from worship other than Him, setting up a fard prayer in perfect time to purify the heart from false religion and to refrain from evil deeds, both good and evil. the visible and the invisible, always deliberating in the face of strange and important things, all of which will have lasting happiness in the hereafter. In the same verse, God says: And consult with them in the matter. (Ali 'Imran \/ 3: 159) Likewise, making a profit in the way of Allah, spending it in a way that is useful and beneficial to the personal, community, country, and nation. They will also enjoy eternal happiness in the hereafter. In another verse God says: O you who believe! Affect some of the sustenance we have given you. (al-Baqarah \/ 2: 254) And his word: O you who believe! Impact some of your good results. (al-Baqarah \/ 2: 267)",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang menyambut baik panggilan Allah kepada agama-Nya seperti mengesakan dan menyucikan Zat-Nya dari penyembahan selain Dia, mendirikan salat fardu pada waktunya dengan sempurna untuk membersihkan hati dari iktikad batil dan menjauhkan diri dari perbuatan mungkar, baik yang tampak maupun yang tidak tampak, selalu bermusyawarah untuk menentukan sikap di dalam menghadapi hal-hal yang pelik dan penting, kesemuanya akan mendapatkan kesenangan yang kekal di akhirat . Dalam ayat yang serupa, Allah berfirman:\n\nDan bermusyawarahlah dengan mereka dalam urusan itu. (Ali 'Imran\/3: 159)\n\nDemikian pula menginfakkan rezeki di jalan Allah, membelanjakannya di jalan yang berguna dan bermanfaat bagi pribadi, masyarakat, nusa, dan bangsa. Mereka juga akan mendapatkan kesenangan yang kekal di akhirat. Dalam ayat lain Allah berfirman:\n\nWahai orang-orang yang beriman! Infakkanlah sebagian dari rezeki yang telah Kami berikan kepadamu. (al-Baqarah\/2: 254)\n\nDan firman-Nya:\n\nWahai orang-orang yang beriman! Infakkanlah sebagian dari hasil usahamu yang baik-baik. (al-Baqarah\/2: 267)",
      "text_translation": "dan (bagi) orang-orang yang menerima (mematuhi) seruan Tuhan dan melaksanakan salat, sedang urusan mereka (diputuskan) dengan musyawarah antara mereka; dan mereka menginfakkan sebagian dari rezeki yang Kami berikan kepada mereka,",
      "text": "وَالَّذِيْنَ اسْتَجَابُوْا لِرَبِّهِمْ وَاَقَامُوا الصَّلٰوةَۖ وَاَمْرُهُمْ شُوْرٰى بَيْنَهُمْۖ وَمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ ۚ ",
      "text_translation_en": "and who respond to [the call of] their Sustainer and are constant in prayer; and whose rule [in all matters of common concern] is consultation among themselves; and who spend on others out of what We provide for them as sustenance;",
      "juz_number": 25
    },
    "39": {
      "text_tafsir_en": "In this verse, God explains that among those who will find eternal happiness in the hereafter are those who, when treated with indignity by others, will defend themselves and repay those who abuse them, on condition of defense. the self does not go beyond the cruelty that has come upon it. In this self-defense they will seek the help of Allah, as He says: Thus, and whoever rewards in accordance with the (cruelty) of the oppression which he has suffered and then suffered (again), surely Allah will help him. (al-hajj \/ 22: 60)",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa di antara sifat orang-orang yang akan memperoleh kebahagiaan yang kekal abadi di akhirat ialah orang-orang yang apabila diperlakukan semena-mena oleh orang lain, ia akan membela diri dan membalas kepada orang yang menzaliminya tersebut, dengan syarat pembelaan diri tersebut tidak melampaui kezaliman yang menimpanya. Dalam pembelaan diri ini mereka akan mendapat pertolongan dari Allah, sebagaimana firman-Nya: \n\nDemikianlah, dan barang siapa membalas seimbang dengan (kezaliman) penganiayaan yang pernah dia derita kemudian dia dizalimi (lagi), pasti Allah akan menolongnya. (al-hajj\/22: 60)",
      "text_translation": "dan (bagi) orang-orang yang apabila mereka diperlakukan dengan zalim, mereka membela diri.",
      "text": "وَالَّذِيْنَ اِذَآ اَصَابَهُمُ الْبَغْيُ هُمْ يَنْتَصِرُوْنَ ",
      "text_translation_en": "and who, whenever tyranny afflicts them, defend themselves.",
      "juz_number": 25
    },
    "40": {
      "text_tafsir_en": "In this verse God explains that the act of self-defense committed by someone who is persecuted by others must be directed at the perpetrator of the oppression and balanced by the light weight of the persecution. Excessive acts of retribution or self-defense are not allowed in the religion, this is according to the word of God: Whoever attacks you, then attack him according to his attacks on you. (al-Baqarah \/ 2: 194) In another verse Allah says: And if ye reply, then respond with the same (retribution) as the punishment inflicted on you. But if you are patient, it is better to be patient. (an-Nahl \/ 16: 126) In the current situation of people being mistreated by others, they may not be able to defend themselves directly or claim their rights against those who mistreat them because of their limitations, so they can seek the assistance of the authorities who can take action to defend his rights, such as the police, the court and so on. Keep in mind that a person's rights must be protected, not just be silent when others take away their rights. Many hadiths describe such rights as: Whoever was killed for maintaining his property, then he was a martyr. Whoever is killed for maintaining (salvation) his life, family, and religion, then he is a martyr. (History of Abu Dawud and at-Tirmidhi) However, this verse also advocates not to avenge others, but forgives and treats those who do evil to us because Allah will reward those who forgive others, besides forgiving others is the atonement. The Word of God: And the wounds have their qisas. Whoever releases his (right) qisas, then (it) becomes the atonement for him. (al-Ma'idah \/ 5: 45) This verse 40 closes with an affirmation that God does not like the wrongdoers who go beyond the limits of retribution for their crimes.",
      "text_tafsir": "Dalam ayat ini Allah menjelaskan bahwa perbuatan membela diri yang dilakukan seseorang yang dianiaya orang lain hendaklah ditujukan kepada pelaku penganiayaan dan seimbang dengan berat ringannya penganiayaan tersebut. Tindakan balasan atau pembelaan diri yang berlebihan tidak dibenarkan agama, hal ini sesuai dengan firman Allah:\n\nBarang siapa menyerang kamu, maka seranglah dia setimpal dengan serangannya terhadap kamu. (al-Baqarah\/2: 194)\n\nDi ayat lain Allah berfirman:\n\nDan jika kamu membalas, maka balaslah dengan (balasan) yang sama dengan siksaan yang ditimpakan kepadamu. Tetapi jika kamu bersabar, sesungguhnya itulah yang lebih baik bagi orang yang sabar. (an-Nahl\/16: 126)\n\nDalam situasi saat ini orang-orang yang teraniaya oleh orang lain, mungkin tidak bisa langsung membela diri atau menuntut haknya kepada orang-orang yang menganiayanya karena berbagai keterbatasannya, maka ia bisa meminta pertolongan pihak-pihak berwajib yang bisa melakukan tindakan untuk membela haknya, seperti polisi, pengadilan dan sebagainya. Perlu diingatkan bahwa hak seseorang harus dipertahankan, jangan hanya berdiam diri ketika orang lain merampas haknya. Banyak hadis yang menerangkan tentang hak-hak seperti:\n\nSiapa yang terbunuh karena mempertahankan hartanya, maka ia adalah seorang yang syahid. Siapa yang terbunuh karena mempertahankan (keselamatan)nyawa, keluarga, dan agamanya, maka ia adalah seorang yang syahid. (Riwayat Abu Dawud dan at-Tirmidhi)\n\nSekalipun demikian, ayat ini juga menganjurkan untuk tidak membalas kejahatan orang lain, tetapi memaafkan dan memperlakukan dengan baik orang yang berbuat jahat kepada kita karena Allah akan memberikan pahala kepada orang-orang yang memaafkan kesalahan orang lain, selain itu memaafkan orang lain adalah penebus dosa. Firman Allah:\n\nDan luka-luka (pun) ada qisas-nya (balasan yang sama). Barangsiapa melepaskan (hak qisas)nya, maka itu (menjadi) penebus dosa baginya. (al-Ma'idah\/5: 45)\n\nAyat 40 ini ditutup dengan satu penegasan bahwa Allah tidak menyukai orang-orang yang zalim yang melampaui batas di dalam melakukan pembalasan atas kejahatan yang pernah dialaminya.",
      "text_translation": "Dan balasan suatu kejahatan adalah kejahatan yang setimpal, tetapi barangsiapa memaafkan dan berbuat baik (kepada orang yang berbuat jahat) maka pahalanya dari Allah. Sungguh, Dia tidak menyukai orang-orang zalim.",
      "text": "وَجَزٰۤؤُا سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا ۚفَمَنْ عَفَا وَاَصْلَحَ فَاَجْرُهٗ عَلَى اللّٰهِ ۗاِنَّهٗ لَا يُحِبُّ الظّٰلِمِيْنَ",
      "text_translation_en": "But [remember that an attempt at] requiting evil may, too, become an evil: hence, whoever par­dons [his foe] and makes peace, his reward rests with God - for, verily, He does not love evildoers.",
      "juz_number": 25
    },
    "41": {
      "text_tafsir_en": "In this verse God explains that a person who commits a crime for the sake of self-defense or for a crime that he has committed, there is no way to prosecute him and he is innocent because he did so by right. But those who do wrong, do evil on earth and go beyond the bounds of retribution, are the ones who will be prosecuted and will suffer painful torments and torments in the hereafter.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa orang yang berbuat sesuatu karena membela diri dari satu penganiayaan atau suatu kejahatan yang menimpanya, tidak ada jalan untuk menuntutnya dari sisi hukum dan ia tidak berdosa karena dia melakukannya berdasarkan hak. Tetapi orang-orang yang berbuat zalim, berbuat kejahatan di muka bumi dan melampaui batas dalam memberikan pembalasan, mereka itulah yang dapat dituntut dan akan mendapat azab dan siksa yang pedih di akhirat kelak.",
      "text_translation": "Tetapi orang-orang yang membela diri setelah dizalimi, tidak ada alasan untuk menyalahkan mereka.",
      "text": "وَلَمَنِ انْتَصَرَ بَعْدَ ظُلْمِهٖ فَاُولٰۤىِٕكَ مَا عَلَيْهِمْ مِّنْ سَبِيْلٍۗ ",
      "text_translation_en": "Yet indeed, as for any who defend themselves after having been wronged - no blame whatever attaches to them:",
      "juz_number": 25
    },
    "42": {
      "text_tafsir_en": "In this verse God rejects the accusations of the Meccans that Muhammad saw to be a lie to Allah. This is a very bad thing. If God had willed, He could have locked your heart out for such a thing, not done except by the unbelievers. But God has already done and will continue to do that He will always destroy and destroy the perverse and strengthen the right and instill that right in the human race according to His purpose. That is why the religion that Muhammad saw day by day has become stronger and stronger, more and more, and more and more of his followers. God is all-knowing, all that is in his heart, and nothing is hidden from him, so everything is based on the knowledge of Allah, which encompasses everything. Therefore, their accusations against the Prophet Muhammad, who is believed to have lied about God, are known to him and have been proved in this verse.",
      "text_tafsir": "Dalam ayat ini Allah menolak tuduhan kaum musyrik Mekah bahwa Muhammad saw itu mengada-adakan dusta terhadap Allah. Ini adalah perbuatan yang amat buruk. Seandainya Allah menghendaki, tentu Dia dapat mengunci mati hatimu karena perbuatan semacam itu, tidak dilakukan kecuali oleh orang musyrikin.\n\nTetapi sunah Allah telah berlaku dan akan terus berlaku bahwa Dia selalu menghancurkan dan menghapuskan yang batil serta menguatkan yang hak dan menanamkan hakikat yang hak itu di kalangan manusia sesuai dengan ketentuan yang telah ditetapkan-Nya. Itulah sebabnya agama yang dibawa oleh Muhammad saw hari demi hari makin bertambah kuat dan mantap, makin tersebar luas, serta semakin bertambah banyak penganutnya.\n\nAllah Maha Mengetahui semua yang tersimpan dalam hati, tidak ada yang tersembunyi bagi-Nya, maka segala sesuatu terjadi berdasarkan ilmu Allah yang amat luas, meliputi segala sesuatu. Oleh sebab itu tuduhan mereka terhadap Nabi Muhammad yang dianggap telah mengada-adakan kebohongan tentang Allah diketahui oleh-Nya dan telah dibuktikan ketidakbenarannya dalam ayat ini.",
      "text_translation": "Sesungguhnya kesalahan hanya ada pada orang-orang yang berbuat zalim kepada manusia dan melampaui batas di bumi tanpa (mengindahkan) kebenaran. Mereka itu mendapat siksa yang pedih.",
      "text": "اِنَّمَا السَّبِيْلُ عَلَى الَّذِيْنَ يَظْلِمُوْنَ النَّاسَ وَيَبْغُوْنَ فِى الْاَرْضِ بِغَيْرِ الْحَقِّۗ اُولٰۤىِٕكَ لَهُمْ عَذَابٌ اَلِيْمٌ  ",
      "text_translation_en": "blame attaches but to those who oppress [other] people and behave outrageously on earth, offending against all right: for them there is grievous suffering in store!",
      "juz_number": 25
    },
    "43": {
      "text_tafsir_en": "In this verse God explains that those who are patient and forgive the evil that others have done to him, while he is able to repay them, they have done something major and they are entitled to great reward. Abu Hurairah reported that a man insulted Abu Bakr, while the Prophet was sitting with him, smiling, so many insults that Abu Bakr retaliated. Then the Prophet got angry and got up from his seat, and Abu Bakr followed him and said, \"O Messenger of Allah, he has mocked me while you were sitting (when I saw him), when I retaliated, you were angry and got up (left me).\" The Messenger then said, \"Indeed (when you are being persecuted) an angel is with you in retaliation against that person, when you reply to that insult, there is a demon (there), then I do not want to sit with the devil.\" Then the Apostle said, O Abu Bakr, there are 3 things which are all true: 1. A slave is persecuted, and he forgives his persecutor, then he will be glorified by Allah and won over his enemies. 2. A man who gives a gift with the purpose of strengthening a relationship of hospitality will be given more and more of Allah's sustenance. 3. Those who ask for the purpose of self-enrichment will be reduced by their provision.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang sabar dan memaafkan perbuatan jahat yang dilakukan orang lain atas dirinya, sedangkan ia sanggup membalasnya, mereka itu telah melakukan sesuatu yang utama dan mereka itu berhak menerima pahala yang banyak. \n\nDiriwayatkan oleh Abu Hurairah bahwa seorang laki-laki mencaci maki Abu Bakar, sedangkan Nabi duduk bersamanya, tersenyum, begitu banyak caci maki itu sehingga Abu Bakar membalas caci maki tersebut. Kemudian Nabi marah dan bangun dari duduknya, lalu Abu Bakar mengikutinya dan berkata, \"Ya Rasulullah, dia telah mencaci makiku sedangkan engkau duduk (melihatnya), ketika aku membalas caci makinya engkau marah dan bangkit (meninggalkanku).\" Rasul kemudian menjawab, \"Sesungguhnya (ketika engkau dicaci) malaikat ada bersamamu membalas caci maki orang tersebut, ketika engkau membalas caci maki itu, hadirlah setan (disitu), maka aku tidak mau duduk bersama setan.\" Kemudian Rasul bersabda, Ya Abu Bakar, ada 3 hal yang semuanya benar, yaitu:\n\n1. Seorang hamba dianiaya, lalu dia memaafkan penganiayanya itu, maka ia akan dimuliakan Allah dan dimenangkan atas musuhnya.\n\n2. Seorang laki-laki yang memberikan suatu pemberian dengan maksud mengeratkan hubungan silaturahmi akan diberi Allah tambahan rezeki yang banyak.\n\n3. Orang-orang yang minta-minta dengan maksud memperkaya diri akan dikurangi Allah rezekinya.",
      "text_translation": "Tetapi barangsiapa bersabar dan memaafkan, sungguh yang demikian itu termasuk perbuatan yang mulia.",
      "text": "وَلَمَنْ صَبَرَ وَغَفَرَ اِنَّ ذٰلِكَ لَمِنْ عَزْمِ الْاُمُوْرِ ࣖ ",
      "text_translation_en": "But withal, if one is patient in adversity and forgives - this, behold, is indeed something to set one’s heart upon!",
      "juz_number": 25
    },
    "44": {
      "text_tafsir_en": "In this verse God explains that what He wills will surely come true and no one can hinder it; but what He does not will, will not happen. Whoever has been given guidance by Allah will not mislead, and whoever has been led astray by Allah, for always committing evil no one will be able to guide him in the right path, which will help him attain happiness and prosperity . The Word of God: And of whom He deceives, you will not find a helper who can guide him. (al-Kahf \/ 18: 17) Those who disbelieve in the Hereafter when they see and see the torment before their eyes, can hope to return to the world for good and to believe. They said, \"Is there still a way for us to return to the world?\" Even if they can return to the world, they will not believe and do good, they will still break God's prohibitions. This is also illustrated by Allah in another verse with His word: And if you (Muhammad) saw them when they were brought to hell, they said, \"If we had been restored (to the world), we would not have denied our Allah , and become believers. \"But (for them) it was clear to them the evil they had hidden before. If they were returned to the world, they would have to repeat what they were forbidden to do. They are really liars. (al-An'am \/ 6: 27-28)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa apa yang dikehendaki-Nya pasti menjadi kenyataan dan tak seorang pun yang dapat menghalangi-Nya; sebaliknya apa yang tidak dikehendaki-Nya, tidak akan terjadi. Barang siapa yang telah diberi petunjuk oleh Allah tidak akan ada yang menyesatkannya, dan barang siapa yang telah dibiarkan sesat oleh Allah, karena selalu berbuat kejahatan tidak akan ada seorang pun yang dapat memberinya petunjuk ke jalan yang benar, yang akan membantunya dia mencapai kebahagiaan dan keberuntungan. Firman Allah:\n\nDan barang siapa disesatkan-Nya, maka engkau tidak akan mendapatkan seorang penolong yang dapat memberi petunjuk kepadanya. (al-Kahf\/18: 17)\n\nOrang-orang kafir di akhirat nanti ketika melihat dan menyaksikan azab di depan matanya, berangan-angan bisa kembali lagi ke dunia untuk berbuat baik dan beriman. Mereka berkata, \"Apakah masih ada jalan bagi kami untuk kembali ke dunia?\" Andaikata mereka itu dapat kembali lagi ke dunia, mereka tidak juga akan beriman dan berbuat baik, mereka akan tetap saja melanggar larangan-larangan Allah. Hal ini digambarkan pula oleh Allah dalam ayat yang lain dengan firman-Nya:\n\nDan seandainya engkau (Muhammad) melihat ketika mereka dihadapkan ke neraka, mereka berkata, \"Seandainya kami dikembalikan (ke dunia), tentu kami tidak akan mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman.\"Tetapi (sebenarnya) bagi mereka telah nyata kejahatan yang mereka sembunyikan dahulu. Seandainya mereka dikembalikan ke dunia, tentu mereka akan mengulang kembali apa yang telah dilarang mengerjakannya. Mereka itu sungguh pendusta. (al-An'am\/6: 27-28)",
      "text_translation": "Dan barangsiapa dibiarkan sesat oleh Allah, maka tidak ada baginya pelindung setelah itu. Kamu akan melihat orang-orang zalim ketika mereka melihat azab berkata, “Adakah kiranya jalan untuk kembali (ke dunia)?”",
      "text": "وَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ وَّلِيٍّ مِّنْۢ بَعْدِهٖ ۗوَتَرَى الظّٰلِمِيْنَ لَمَّا رَاَوُا الْعَذَابَ يَقُوْلُوْنَ هَلْ اِلٰى مَرَدٍّ مِّنْ سَبِيْلٍۚ ",
      "text_translation_en": "AND [thus it is:] he whom God lets go astray has henceforth no protector whatever: and so thou wilt see such evildoers [on Judgment Day, and wilt hear how] they exclaim as soon as they behold the suffering [that awaits them], “Is there any way of return?”",
      "juz_number": 25
    },
    "45": {
      "text_tafsir_en": "In this verse Allah explains that when these disbelievers are confronted with hell, they are very scared and despised because they know and believe that it is the result of the violations and sins they have committed, they know the greatness and power of God that they have disobeyed. . They could not look at the blazing hellfire, they saw it with glances of lethargic eyes, just as the man was led to be killed when he saw the shiny sword that would kill his life. He would not be able to stare at the sword, but he saw it with the lyrics of his eyes and was lethargic and stole vision. At that time the believers said, \"Verily the losers are those who have mistreated themselves so that they are put into hell and do not get the slightest pleasure and pleasure in heaven; they are separated from those who he loves, his friends, and his family. \" This is an unrivaled loss. At the end of this verse it is explained that the disbelievers will be in endless torment. There is no way for them to escape and escape the torment.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa ketika orang-orang kafir ini dihadapkan ke neraka, mereka sangat takut dan merasa hina karena mereka tahu dan yakin bahwa itu adalah akibat dari pelanggaran-pelanggaran dan dosa yang telah dilakukannya, mereka mengetahui kebesaran serta kekuasaan Tuhan yang telah didurhakainya. Mereka tidak dapat menatap api neraka yang menyala-nyala itu, mereka melihatnya dengan lirikan mata yang penuh kelesuan, sama halnya dengan orang yang digiring untuk dibunuh ketika ia melihat pedang yang mengkilat yang akan menghabiskan nyawanya. Dia tidak akan mampu menatap pedang itu, tetapi dia melihatnya dengan lirik mata dan dalam keadaan lesu dan mencuri-curi penglihatan.\n\nDi kala itu orang-orang mukmin berkata, \"Sesungguhnya orang-orang yang merugi ialah orang-orang yang telah menganiaya dirinya sendiri sehingga mereka dimasukkan ke dalam neraka dan tidak memperoleh sedikit pun nikmat dan kesenangan yang abadi di dalam surga; mereka dipisahkan dengan orang yang disayanginya, sahabat-sahabatnya, dan familinya.\" Ini adalah suatu kerugian yang tak ada taranya. \n\nPada akhir ayat ini dijelaskan bahwa orang-orang kafir akan berada dalam siksaan yang berkepanjangan yang tak ada habis-habisnya. Tidak ada jalan bagi mereka untuk lepas dan menghindar dari siksaan itu.",
      "text_translation": "Dan kamu akan melihat mereka dihadapkan ke neraka dalam keadaan tertunduk karena (merasa) hina, mereka melihat dengan pandangan yang lesu. Dan orang-orang yang beriman berkata, “Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari Kiamat.” Ingatlah, sesungguhnya orang-orang zalim itu berada dalam azab yang kekal.",
      "text": "وَتَرٰىهُمْ يُعْرَضُوْنَ عَلَيْهَا خٰشِعِيْنَ مِنَ الذُّلِّ يَنْظُرُوْنَ مِنْ طَرْفٍ خَفِيٍّۗ وَقَالَ الَّذِيْنَ اٰمَنُوْٓا اِنَّ الْخٰسِرِيْنَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ وَاَهْلِيْهِمْ يَوْمَ الْقِيٰمَةِ ۗ اَلَآ اِنَّ الظّٰلِمِيْنَ فِيْ عَذَابٍ مُّقِيْمٍ ",
      "text_translation_en": "And thou wilt see them exposed to that [doom], humbling themselves in abasement, looking [around] with a furtive glance - the while those who had attained to faith will say, “Verily, lost on [this] Day of Resurrection are they who have squandered their own and their followers’ selves!” Oh, verily, the evildoers will fall into long-lasting suffering,",
      "juz_number": 25
    },
    "46": {
      "text_tafsir_en": "In this verse it is explained that no one will receive help from anyone to save them from the torment that befalls them. The idols they once worshiped in the world cannot help at all, but it is impossible to defend them and release them from the torment that is upon them. This verse 46 closes with an affirmation that those whom Allah has left behind have become a character and their habit is always to commit crimes, damages and violations of religious prohibitions; they will never be restored, will never again do the right and right things in this world, and will never enter Jannatun Na'im's paradise in the hereafter.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa seseorang tidak akan mendapat pertolongan dari siapa pun untuk menyelamatkan mereka dari siksa yang menimpa Mereka. Berhala-berhala yang pernah disembah mereka di dunia tidak dapat sama sekali memberi pertolongan, bahkan mustahil akan dapat membela mereka dan melepaskan mereka dari azab yang sedang menimpa mereka. Ayat 46 ini ditutup dengan satu ketegasan bahwa orang yang dibiarkan Allah sesat itu telah menjadi watak dan tabiat mereka akan selalu berbuat kejahatan, kerusakan dan pelanggaran-pelanggaran terhadap larangan agama; mereka tidak akan dapat lagi diperbaiki, tidak akan dapat lagi melakukan hal-hal yang hak dan benar di dunia ini, dan tidak akan dapat memasuki surga Jannatun Na'im di akhirat nanti.",
      "text_translation": "Dan mereka tidak akan mempunyai pelindung yang dapat menolong mereka selain Allah. Barangsiapa dibiarkan sesat oleh Allah tidak akan ada jalan keluar baginya (untuk mendapat petunjuk).",
      "text": "وَمَا كَانَ لَهُمْ مِّنْ اَوْلِيَاۤءَ يَنْصُرُوْنَهُمْ مِّنْ دُوْنِ اللّٰهِ ۗوَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ سَبِيْلٍ ۗ ",
      "text_translation_en": "and will have no protector whatever to succour them against God: for he whom God lets go astray shall find no way [of escape].",
      "juz_number": 25
    },
    "47": {
      "text_tafsir_en": "God explains that He has commanded men to obey and obey and accept the call of His Messenger, the religion of God that was proclaimed before the day when no one could restrain, reject and hinder his coming, which is the Day of Resurrection. On that day they had no place to hide which would save them from trouble, and they could not deny the evils which he had committed in the world, for they were all clearly stated in the book of their deeds and tongues. as well as their members as witnesses. However they will not be able to escape and escape the horrors of that day. In this connection God says: On that day men will say, \"Where is the place to run?\" No! No shelter! Only to your Lord return home on that day. (al-Qiyamah \/ 75: 10-12)",
      "text_tafsir": "Allah menerangkan bahwa Dia telah memerintahkan agar manusia patuh dan taat serta menerima seruan Rasul-Nya, agama Allah yang disampaikan sebelum datang hari dimana tidak seorang pun dapat menahan, menolak dan menghalangi kedatangannya yaitu hari Kiamat. Pada hari itu mereka tidak mempunyai suatu tempat pun untuk berlindung yang akan menyelamatkan mereka dari kesusahan, dan mereka itu tidak dapat mengingkari kejahatan-kejahatan yang telah diperbuatnya di dunia, karena semuanya itu sudah tertera dengan jelas di dalam buku catatan amalan masing-masing dan lidah serta anggota tubuh mereka pun menjadi saksi. Bagaimana pun juga mereka tidak akan dapat melarikan diri dan menghindar dari kedahsyatan hari itu. Dalam hubungan ini Allah berfirman:\n\nPada hari itu manusia berkata, \"Ke mana tempat lari?\" Tidak! Tidak ada tempat berlindung! Hanya kepada Tuhanmu tempat kembali pada hari itu. (al-Qiyamah\/75: 10-12)",
      "text_translation": "Patuhilah seruan Tuhanmu sebelum datang dari Allah suatu hari yang tidak dapat ditolak (atas perintah dari Allah). Pada hari itu kamu tidak memperoleh tempat berlindung dan tidak (pula) dapat mengingkari (dosa-dosamu).",
      "text": "اِسْتَجِيْبُوْا لِرَبِّكُمْ مِّنْ قَبْلِ اَنْ يَّأْتِيَ يَوْمٌ لَّا مَرَدَّ لَهٗ مِنَ اللّٰهِ ۗمَا لَكُمْ مِّنْ مَّلْجَاٍ يَّوْمَىِٕذٍ وَّمَا لَكُمْ مِّنْ نَّكِيْرٍ ",
      "text_translation_en": "[Hence, O men,] respond to your Sustainer before there comes, at God’s behest, a Day on which there will be no turning back: [for] on that Day you will have no place of refuge, and neither will you be able to deny aught [of the wrong that you have done].",
      "juz_number": 25
    },
    "48": {
      "text_tafsir_en": "In this verse Allah explains that when the Prophet Muhammad (saw) fulfilled the task of delivering the brochures calling on the Muslims to the truth and the straight path, but they did not respond and would not accept it but they still refused and turned away from the truth, The apostles let their attitude go without worry and anxiety. This is because the Apostle was not given the task of overseeing and examining the deeds of the unbelievers, but he was only given the task of conveying what God had revealed and commanded him. When the Prophet Muhammad (saw) fulfilled his duty, he was considered to have fulfilled his mission, as Allah said: \"Indeed, your duty is to convey, and it is We who account (their deeds). (ar-Ra'd \/ 13: 40) And He says: Be warned, for you are a warner. You are not a ruler over them, (al-Gasyiyah \/ 88: 21-22) And He also says: It is not your duty to guide them, but it is Allah who guides whom He wills. (al-Baqarah \/ 2: 272) Furthermore, God describes human nature and character as when they are given wealth, blessed with life, physical well-being, peaceful feeling, they are happy and happy with the gift, and often create arrogance and arrogance. But when they are afflicted with poverty, sickness, disasters, floods, fire and the consequences of sin and evil they commit, they forfeit all the gifts that God has given them, forget the gift, and even forget the good. Such is the nature of unbelievers and disbelievers in Allah. In contrast to those who truly believe in God, they are grateful, believing and worshiping steadfastly. When they do not or do not have the gift, they are patient because they believe in the provisions of God; all things are returned to God, they conform to the word of God: And to God all things are restored. (al-Baqarah \/ 2: 210)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa apabila Nabi Muhammad saw telah menunaikan tugas menyampaikan risalah menyeru orang-orang musyrik kepada kebenaran dan kepada jalan yang lurus, tetapi mereka itu tidak menyambut baik dan tidak mau menerimanya bahkan mereka itu tetap menolak dan berpaling dari kebenaran, maka hendaklah Rasul membiarkan sikap mereka tanpa perlu gusar dan cemas. Hal ini dikarenakan Rasul tidak diberi tugas mengawasi dan meneliti amal perbuatan orang-orang musyrik itu, tetapi dia hanya diberi tugas menyampaikan apa yang diturunkan dan diperintahkan Allah kepadanya. Apabila Nabi Muhammad saw telah melaksanakan kewajibannya, maka beliau sudah dianggap menunaikan misinya, sebagaimana firman Allah:\n\nMaka sesungguhnya tugasmu hanya menyampaikan saja, dan Kamilah yang memperhitungkan (amal mereka). (ar-Ra'd\/13: 40)\n\nDan firman-Nya:\n\nMaka berilah peringatan, karena sesungguhnya engkau (Muhammad) hanyalah pemberi peringatan. Engkau bukanlah orang yang berkuasa atas mereka, (al-Gasyiyah\/88: 21-22)\n\nDan firman-Nya pula:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah\/2: 272)\n\nSelanjutnya Allah menerangkan tabiat dan watak manusia yaitu apabila manusia itu diberi kekayaan, dikaruniai kesenangan hidup, kesejahteraan jasmani, perasaan aman sentosa, mereka senang dan gembira atas karunia tersebut, bahkan sering menimbulkan perasaan angkuh dan takabur. Tetapi sebaliknya apabila mereka ditimpa kemiskinan, penyakit, musibah yang bermacam-macam berupa banjir, kebakaran dan akibat dosa dan maksiat yang dikerjakannya, mereka mengingkari semua karunia yang telah diberikan Allah kepadanya, lupa akan karunia itu, malah mereka lupa mengerjakan kebaikan. Demikianlah sifat orang kafir dan tidak beriman kepada Allah. Berbeda dengan orang-orang yang benar-benar beriman kepada Allah, mereka bersyukur, beriman dan beribadah semakin mantap. Apabila mereka tidak atau belum memperoleh karunia, mereka bersabar karena mereka percaya kepada ketentuan Allah; segala sesuatu dikembalikan kepada Allah, mereka menyesuaikan diri dengan firman Allah:\n\nDan kepada Allah-lah segala perkara dikembalikan. (al-Baqarah\/2: 210)",
      "text_translation": "Jika mereka berpaling, maka (ingatlah) Kami tidak mengutus engkau sebagai pengawas bagi mereka. Kewajibanmu tidak lain hanyalah menyampaikan (risalah). Dan sungguh, apabila Kami merasakan kepada manusia suatu rahmat dari Kami, dia menyambutnya dengan gembira; tetapi jika mereka ditimpa kesusahan disebabkan perbuatan tangan mereka sendiri (niscaya mereka ingkar), sungguh, manusia itu sangat ingkar (kepada nikmat).",
      "text": "فَاِنْ اَعْرَضُوْا فَمَآ اَرْسَلْنٰكَ عَلَيْهِمْ حَفِيْظًا ۗاِنْ عَلَيْكَ اِلَّا الْبَلٰغُ ۗوَاِنَّآ اِذَآ اَذَقْنَا الْاِنْسَانَ مِنَّا رَحْمَةً فَرِحَ بِهَا ۚوَاِنْ تُصِبْهُمْ سَيِّئَةٌ ۢبِمَا قَدَّمَتْ اَيْدِيْهِمْ فَاِنَّ الْاِنْسَانَ كَفُوْرٌ ",
      "text_translation_en": "BUT IF they turn away [from thee, O Prophet, know that] We have not sent thee to be their keeper: thou art not bound to do more than deliver the message [entrusted to thee]. And, behold, [such as turn away from Our mes­sages are but impelled by the weakness and incon­stancy of human nature: thus,] when We give man a taste of Our grace, he is prone to exult in it; but if misfortune befalls [any of] them in result of what their own hands have sent forth, then, behold, man shows how bereft he is of all gratitude!",
      "juz_number": 25
    },
    "49": {
      "text_tafsir_en": "In this verse God explains that He is the creator of the heavens and the earth, having, ruling and doing His will over all that is in heaven and on earth. Whatever He wants will surely come to pass, and what He does will not come to pass. He gives favor to whom He pleases. No one can interfere with what He wants, nor can anyone give favor to whom He does not desire. He created everything according to His will. It is He who gives the offspring of the daughter to whom He pleases, He gives the offspring to whom He pleases, and He gives the offspring of the sons and of the daughters, and there are those who are barren, who have no offspring, there is wisdom. They all show the power of God that no one can oppose. He does His will according to His requirements and no one is able to oppose Him or help to fulfill His will. This verse closes with a certain assertion that Allah is the All-Knower who deserves and is entitled to each of the above gifts. He is the Almighty who created what He wanted and did according to His wisdom and knowledge.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Dia-lah yang menciptakan langit dan bumi, memiliki, berkuasa dan berbuat sekehendak-Nya terhadap apa yang ada di langit dan di bumi. Apa saja yang Dia kehendaki pasti terwujud dan menjadi kenyataan, dan apa yang tidak Dia kehendaki tidak terwujud. Dia memberikan nikmat kepada siapa yang dikehendaki-Nya. Tidak seorang pun dapat menghalangi apa yang dikehendaki-Nya tidak seorang pun dapat memberikan nikmat kepada siapa yang tidak dikehendaki-Nya. Dia-lah yang menciptakan segala sesuatu menurut kehendak-Nya. Dia-lah yang memberikan keturunan anak perempuan kepada siapa yang dikehendaki-Nya, memberikan keturunan anak laki-laki kepada siapa yang dikehendaki-Nya, dan memberikan keturunan anak laki-laki dan perempuan, dan ada pula yang dijadikannya mandul, tidak memiliki keturunan, semua itu ada hikmahnya.\n\nSemuanya itu menunjukkan kemahakuasaan Allah yang tidak seorang pun dapat menentang-Nya. Dia berbuat sekehendak-Nya sesuai dengan kodrat-Nya dan tidak seorang pun yang sanggup merintangi-Nya atau turut membantu mengatur keinginan-Nya.\n\nAyat ini ditutup dengan satu ketegasan, bahwa Allah Maha Mengetahui siapa-siapa yang layak dan berhak dianugerahi tiap-tiap macam karunia tersebut di atas. Dia Mahakuasa menciptakan apa yang dikehendaki dan berbuat sekehendak-Nya menurut kebijaksanaan dan ilmu-Nya.",
      "text_translation": "Milik Allah-lah kerajaan langit dan bumi; Dia menciptakan apa yang Dia kehendaki, memberikan anak perempuan kepada siapa yang Dia kehendaki dan memberikan anak laki-laki kepada siapa yang Dia kehendaki,",
      "text": "لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِۗ يَخْلُقُ مَا يَشَاۤءُ ۗيَهَبُ لِمَنْ يَّشَاۤءُ اِنَاثًا وَّيَهَبُ لِمَنْ يَّشَاۤءُ الذُّكُوْرَ ۙ",
      "text_translation_en": "God’s alone is the dominion over the heavens and the earth. He creates whatever He wills: He bestows the gift of female offspring on whomever He wills, and the gift of male offspring on whomever He wills;",
      "juz_number": 25
    },
    "50": {
      "text_tafsir_en": "In this verse God explains that He is the creator of the heavens and the earth, having, ruling and doing His will over all that is in heaven and on earth. Whatever He wants will surely come to pass, and what He does will not come to pass. He gives favor to whom He pleases. No one can interfere with what He wants, nor can anyone give favor to whom He does not desire. He created everything according to His will. It is He who gives the offspring of the daughter to whom He pleases, He gives the offspring to whom He pleases, and He gives the offspring of the sons and of the daughters, and there are those who are barren, who have no offspring, there is wisdom. They all show the power of God that no one can oppose. He does His will according to His requirements and no one is able to oppose Him or help to fulfill His will. This verse closes with a certain assertion that Allah is the All-Knower who deserves and is entitled to each of the above gifts. He is the Almighty who created what He wanted and did according to His wisdom and knowledge.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Dia-lah yang menciptakan langit dan bumi, memiliki, berkuasa dan berbuat sekehendak-Nya terhadap apa yang ada di langit dan di bumi. Apa saja yang Dia kehendaki pasti terwujud dan menjadi kenyataan, dan apa yang tidak Dia kehendaki tidak terwujud. Dia memberikan nikmat kepada siapa yang dikehendaki-Nya. Tidak seorang pun dapat menghalangi apa yang dikehendaki-Nya tidak seorang pun dapat memberikan nikmat kepada siapa yang tidak dikehendaki-Nya. Dia-lah yang menciptakan segala sesuatu menurut kehendak-Nya. Dia-lah yang memberikan keturunan anak perempuan kepada siapa yang dikehendaki-Nya, memberikan keturunan anak laki-laki kepada siapa yang dikehendaki-Nya, dan memberikan keturunan anak laki-laki dan perempuan, dan ada pula yang dijadikannya mandul, tidak memiliki keturunan, semua itu ada hikmahnya.\n\nSemuanya itu menunjukkan kemahakuasaan Allah yang tidak seorang pun dapat menentang-Nya. Dia berbuat sekehendak-Nya sesuai dengan kodrat-Nya dan tidak seorang pun yang sanggup merintangi-Nya atau turut membantu mengatur keinginan-Nya.\n\nAyat ini ditutup dengan satu ketegasan, bahwa Allah Maha Mengetahui siapa-siapa yang layak dan berhak dianugerahi tiap-tiap macam karunia tersebut di atas. Dia Mahakuasa menciptakan apa yang dikehendaki dan berbuat sekehendak-Nya menurut kebijaksanaan dan ilmu-Nya.",
      "text_translation": "atau Dia menganugerahkan jenis laki-laki dan perempuan, dan menjadikan mandul siapa yang Dia kehendaki. Dia Maha Mengetahui, Mahakuasa.",
      "text": "اَوْ يُزَوِّجُهُمْ ذُكْرَانًا وَّاِنَاثًا ۚوَيَجْعَلُ مَنْ يَّشَاۤءُ عَقِيْمًا ۗاِنَّهٗ عَلِيْمٌ قَدِيْرٌ ",
      "text_translation_en": "or He gives both male and female [to whomever He wills], and causes to be barren whomever He wills: for, verily, He is all-knowing, infinite in His power.",
      "juz_number": 25
    },
    "51": {
      "text_tafsir_en": "In this verse Allah explains that God will not speak with His servants except in one of three ways as follows: 1. With revelation, namely God implanted into the heart of a prophet an understanding that there is no doubt that what he received was from Allah. As was the case with the Prophet Muhammad. He said: Verily Ruhul Qudus has breathed into the depths of my heart that a person will not die until he perfectly receives sustenance and death, then fear Allah and try in the best possible way. (History of Ibn hibban) 2. Behind the veil that is by listening and not seeing who is saying, but the words are heard, just as God spoke with the Prophet Moses, the Word of God: And when Moses came to (munajat) at the time that We determine and the Lord has said (directly) to him, (Moses) said, \"O my Lord, show (Yourself) to me so that I may see You.\" (Allah) said, \"You will not (be able) to see Me. (Al-A'raf \/ 7: 143) 3. Sent a messenger, that is, God sent the Angel Gabriel, then the messenger delivered revelations to whom he wanted , as did Gabriel down to the Holy Prophet and other prophets. 'Aisha narrated that al-Harith bin Hisham asked the Holy Prophet, \"How did the revelation come to you?\" The Prophet replied, \"Sometimes revelations come to me like the sound bell. This method is very hard for me. After he stopped, I understood what He had said; sometimes angels manifest themselves to me as a man, then he speaks to me, then I understand what he is talking about \". Saying 'Aisha, actually I saw the Prophet when he came down to the revelation on a very cold day, then after the revelation stopped His forehead was dripping with sweat. (Al-Bukhari's History) This verse concludes with the affirmation that Allah is the Most High and Glorious of the attributes of His creatures He is called according to His wisdom, speaking with His servants, sometimes without good intermediaries in the form of inspiration or in the form of conversations from behind the veil.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa Allah tidak akan berkata-kata dengan hamba-Nya kecuali dengan salah satu dari tiga cara seperti berikut ini:\n\n1. Dengan wahyu, yakni Allah menanamkan ke dalam hati sanubari seorang nabi suatu pengertian yang tidak diragukannya bahwa yang diterimanya adalah dari Allah. Seperti halnya yang terjadi dengan Nabi Muhammad saw. Sabda beliau:\n\nSesungguhnya Ruhul Qudus telah menghembuskan ke dalam lubuk hatiku bahwasanya seseorang tidak akan meninggal dunia hingga dia menerima dengan sempurna rezeki dan ajalnya, maka bertakwalah kepada Allah dan berusahalah dengan cara yang sebaik-baiknya. (Riwayat Ibnu hibban)\n\n2. Di belakang tabir yakni dengan cara mendengar dan tidak melihat siapa yang berkata, tetapi perkataannya itu didengar, seperti halnya Allah berbicara dengan Nabi Musa, Firman Allah :\n\nDan ketika Musa datang untuk (munajat) pada waktu yang telah Kami tentukan dan Tuhan telah berfirman (langsung) kepadanya, (Musa) berkata, \"Ya Tuhanku, tampakkanlah (diri-Mu) kepadaku agar aku dapat melihat Engkau.\" (Allah) berfirman, \"Engkau tidak akan (sanggup) melihat-Ku. (al-A'raf\/7: 143)\n\n3. Mengutus seorang utusan, yakni Allah mengutus Malaikat Jibril, maka utusan itu menyampaikan wahyu kepada siapa yang dikehendaki-Nya, sebagaimana halnya Jibril turun kepada Nabi Muhammad saw dan kepada nabi-nabi yang lain.\n\n'Aisyah meriwayatkan bahwa al-harits bin Hisyam bertanya kepada Nabi saw, \"Bagaimana cara wahyu datang kepadamu?\" Rasulullah saw menjawab, \"Terkadang wahyu datang kepadaku seperti bunyi lonceng. Cara inilah yang sangat berat bagiku. Setelah ia berhenti, aku telah mengerti apa yang telah dikatakan-Nya; kadang-kadang malaikat mewujudkan dirinya kepadaku sebagai seorang laki-laki, lalu dia berbicara kepadaku, maka aku mengerti apa yang dibicarakannya\". Berkata 'Aisyah ra, sesungguhnya saya lihat Nabi ketika turun kepadanya wahyu di hari yang sangat dingin, kemudian setelah wahyu itu berhenti terlihat dahinya bercucuran keringat. (Riwayat al-Bukhari)\n\nAyat ini ditutup dengan penegasan bahwa Allah itu Mahatinggi lagi Mahasuci dari sifat-sifat makhluk ciptaan-Nya. Dia disebut menurut kebijaksanaan-Nya, berbicara dengan hamba-hamba-Nya, adakalanya tanpa perantara baik berupa ilham atau berupa percakapan dari belakang tabir.",
      "text_translation": "Dan tidaklah patut bagi seorang manusia bahwa Allah akan berbicara kepadanya kecuali dengan perantaraan wahyu atau dari belakang tabir atau dengan mengutus utusan (malaikat) lalu diwahyukan kepadanya dengan izin-Nya apa yang Dia kehendaki. Sungguh, Dia Mahatinggi, Mahabijaksana.",
      "text": "۞ وَمَا كَانَ لِبَشَرٍ اَنْ يُّكَلِّمَهُ اللّٰهُ اِلَّا وَحْيًا اَوْ مِنْ وَّرَاۤئِ حِجَابٍ اَوْ يُرْسِلَ رَسُوْلًا فَيُوْحِيَ بِاِذْنِهٖ مَا يَشَاۤءُ ۗاِنَّهٗ عَلِيٌّ حَكِيْمٌ ",
      "text_translation_en": "And it is not given to mortal man that God should speak unto him otherwise than through sudden inspiration, or [by a voice, as it were,] from behind a veil, or by sending an apostle to reveal, by His leave, whatever He wills [to reveal]: for, verily, He is exalted, wise.",
      "juz_number": 25
    },
    "52": {
      "text_tafsir_en": "Allah explains that just as He revealed the revelation to the previous prophets, He also sent the revelation to the Prophet Muhammad in the form of the Qur'an as His mercy. God then explained that Muhammad saw before he was forty years old and in the midst of his people, did not know what the Qur'an was and what faith it was, and also did not know what the Shari'a was in detail and what it meant. which is about the revelation that he revealed, but Allah has made the Qur'an a bright light in which Allah guides His servants and compares it to the true religion of Islam. As the saying of Allah says: You (Muhammad) never intended that the Book should be revealed to you, but it is a Mercy of your Lord, so do not be a helper to the disbelievers. (al-Qasas \/ 28: 86) And his word: Say, \"The Qur'an is a guide and a healer for the believers. And those who do not believe in their ears have a fault, and (Al- (Fussilat \/ 41: 44) The Word of God: Indeed, this Qur'an guides the most straightforward (al-Isra '\/ 17: 9) light. The Qur'an is that, Allah guides the straight path which is the true religion.",
      "text_tafsir": "Allah menerangkan bahwa sebagaimana Dia menurunkan wahyu kepada rasul-rasul terdahulu Dia juga menurunkan wahyu kepada Nabi Muhammad saw berupa Al-Qur'an sebagai rahmat-Nya. Selanjutnya Allah menjelaskan bahwa Muhammad saw sebelum mencapai umur empat puluh tahun dan berada di tengah-tengah kaumnya, belum tahu apa Al-Qur'an itu dan apa iman itu, dan begitu juga belum tahu apa syariat itu secara terperinci dan pengertian tentang hal-hal yang mengenai wahyu yang diturunkannya, tetapi Allah menjadikan Al-Qur'an itu cahaya terang benderang yang dengannya Allah memberi petunjuk kepada hamba-hamba yang dikehendaki-Nya dan membandingkan kepada agama yang benar yaitu agama Islam. Sebagaimana firman Allah:\n\nDan engkau (Muhammad) tidak pernah mengharap agar Kitab (Al-Qur'an) itu diturunkan kepadamu, tetapi ia (diturunkan) sebagai rahmat dari Tuhanmu, sebab itu janganlah sekali-kali engkau menjadi penolong bagi orang-orang kafir. (al-Qasas\/28: 86)\n\nDan firman-Nya:\n\nKatakanlah, \"Al-Qur'an adalah petunjuk dan penyembuh bagi orang-orang yang beriman. Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan (Al-Qur'an) itu merupakan kegelapan bagi mereka. (Fussilat\/41: 44)\n\nFirman Allah:\n\nSungguh, Al-Qur'an ini memberi petunjuk ke (jalan) yang paling lurus. (al-Isra'\/17: 9)\n\nDengan cahaya Al-Qur'an itulah, Allah memberikan petunjuk kepada jalan yang lurus yaitu agama yang benar.",
      "text_translation": "Dan demikianlah Kami wahyukan kepadamu (Muhammad) ruh (Al-Qur'an) dengan perintah Kami. Sebelumnya engkau tidaklah mengetahui apakah Kitab  (Al-Qur'an) dan apakah iman itu, tetapi Kami jadikan Al-Qur'an itu cahaya, dengan itu Kami memberi petunjuk siapa yang Kami kehendaki di antara hamba-hamba Kami. Dan sungguh, engkau benar-benar membimbing (manusia) kepada jalan yang lurus,",
      "text": "وَكَذٰلِكَ اَوْحَيْنَآ اِلَيْكَ رُوْحًا مِّنْ اَمْرِنَا ۗمَا كُنْتَ تَدْرِيْ مَا الْكِتٰبُ وَلَا الْاِيْمَانُ وَلٰكِنْ جَعَلْنٰهُ نُوْرًا نَّهْدِيْ بِهٖ مَنْ نَّشَاۤءُ مِنْ عِبَادِنَا ۗوَاِنَّكَ لَتَهْدِيْٓ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍۙ ",
      "text_translation_en": "And thus, too, [O Muhammad,] have We revealed unto thee a life-giving message, [coming] at Our behest. [Ere this message came unto thee,] thou didst not know what revelation is, nor what faith [implies]: but [now] We have caused this [message] to be a light, whereby We guide whom We will of Our ser­vants: and, verily, [on the strength thereof] thou, too, shalt guide [men] onto the straight way –",
      "juz_number": 25
    },
    "53": {
      "text_tafsir_en": "In this verse God explains that the straight path is the path by which Allah, the owner of the heavens and the earth and their second sovereign, has done his will, and is a judge whose judgment cannot be challenged. This verse concludes with a warning that all affairs on the Day of Judgment will be returned to God and not to others. Then each of them should be placed in a place worthy of him, in heaven or in hell. The Word of God: And to Allah belongeth all that is in the heavens and all that is in the earth, and to Allah all things are restored. (Ali 'Imran \/ 3: 109)",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa jalan yang lurus itu ialah jalan yang telah disyariatkan Allah pemilik langit dan bumi serta penguasa keduanya, berbuat sekehendak-Nya, dan sebagai hakim yang tidak dapat digugat keputusan-Nya.\n\nAyat ini diakhiri dengan satu peringatan bahwa semua urusan makhluk pada hari Kiamat nanti dikembalikan kepada Allah tidak kepada yang lain. Maka ditempatkanlah setiap mereka itu pada tempat yang layak baginya, di surga atau di neraka. Firman Allah:\n\nDan milik Allah-lah apa yang ada di langit dan apa yang ada di bumi, dan hanya kepada Allah segala urusan dikembalikan. (Ali 'Imran\/3: 109)",
      "text_translation": "(Yaitu) jalan Allah yang milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Ingatlah, segala urusan kembali kepada Allah.",
      "text": "صِرَاطِ اللّٰهِ الَّذِيْ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ  اَلَآ اِلَى اللّٰهِ تَصِيْرُ الْاُمُوْرُ ࣖ ",
      "text_translation_en": "the way that leads to God, to whom all that is in the heavens and all that is on earth belongs. Oh, verily, with God is the beginning and the end of all things!",
      "juz_number": 25
    }
  },
  "name": "الشورى",
  "name_translation_en": "Consultation",
  "name_translation": "Musyawarah",
  "name_latin": "Asy-Syura"
}