{
  "number": 43,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 89,
  "ayat": {
    "1": {
      "text_tafsir_en": "The beginning of this verse is composed of letters of pilgrimage, as found at the beginning of several other chapters. Interpreters disagree about the meaning of the letters. Next, consider this issue in \"The Qur'an and its Interpretation\" volume I, which is the first verse of Surah al-Baqarah. \"",
      "text_tafsir": "Permulaan ayat ini terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah lainnya. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya silakan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\"",
      "text_translation": "Ha Mim",
      "text": " حٰمۤ  ۚ ",
      "text_translation_en": "Ha. Mim.",
      "juz_number": 25
    },
    "2": {
      "text_tafsir_en": "God swears, for the Holy Qur'an, which explains the guidance and guidance, and the explanation of the needs of men in the world and in the hereafter to attain happiness. Whoever obeys the guidelines outlined in the Qur'an, he will prosper and be saved, and whoever deviates from it, he will be lost and lost from the right path.",
      "text_tafsir": "Allah bersumpah, demi Kitab Suci Al-Qur'an yang menerangkan petunjuk dan hidayah, dan penjelasan hal-hal yang diperlukan manusia di dunia dan di akhirat untuk mencapai kebahagiaan. Barang siapa mengikuti petunjuk-petunjuk yang telah digariskan di dalam Al-Qur'an, dia akan beruntung dan selamat, dan barang siapa yang menyimpang daripadanya, maka dia akan merugi dan sesat dari jalan yang benar.",
      "text_translation": "Demi Kitab (Al-Qur'an) yang jelas.",
      "text": "وَالْكِتٰبِ الْمُبِيْنِ ۙ ",
      "text_translation_en": "CONSIDER this divine writ, clear in itself and clearly showing the truth:",
      "juz_number": 25
    },
    "3": {
      "text_tafsir_en": "Allah explains that He has made the Qur'an in Arabic not in 'Ajam (foreign languages) because the Arabs are to be warned first so that they can easily understand the lessons and advice contained therein. , and they can easily think of their meaning and meaning. He did not translate the Qur'an in 'Ajam' so that they would have no reason to say how they could understand the Qur'an because it was not Arabic, our language, as Allah says: And if the Qur'an We read it in languages other than Arabic and they said, \"Why not explain the verses?\" Is it appropriate (in the Qur'an) in languages other than Arabic being (apostles), Arabs? Say, \"The Qur'an is a guide and a healing for believers.\" (Fussilat \/ 41: 44)",
      "text_tafsir": "Allah menerangkan bahwa Dia telah menjadikan Al-Qur'an dalam bahasa Arab bukan dalam bahasa 'Ajam (bahasa-bahasa asing) karena yang akan diberi peringatan pertama kali adalah orang-orang Arab agar mereka mudah memahami pelajaran dan nasihat-nasihat yang terkandung di dalamnya, dan dengan mudah mereka dapat memikirkan arti dan maknanya. Dia tidak menurunkan Al-Qur'an dalam bahasa 'Ajam agar tidak ada alasan bagi mereka untuk mengatakan bagaimana mereka dapat memahami isi Al-Qur'an karena bahasanya bukan bahasa Arab, bahasa kami, sebagaimana firman Allah:\n\nDan sekiranya Al-Qur'an Kami jadikan sebagai bacaan dalam bahasa selain bahasa Arab niscaya mereka mengatakan, \"Mengapa tidak dijelaskan ayat-ayatnya?\" Apakah patut (Al-Qur'an) dalam bahasa selain bahasa Arab sedang (rasul), orang Arab? Katakanlah, \"Al-Qur'an adalah petunjuk dan penyembuh bagi orang-orang yang beriman. (Fussilat\/41: 44)",
      "text_translation": "Kami menjadikan Al-Qur'an dalam bahasa Arab agar kamu mengerti.",
      "text": "اِنَّا جَعَلْنٰهُ قُرْاٰنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُوْنَۚ ",
      "text_translation_en": "behold, We have caused it to be a discourse in the Arabic tongue, so that you might encompass it with your reason.",
      "juz_number": 25
    },
    "4": {
      "text_tafsir_en": "Allah explained the position of the Qur'an in the Mahfudz Farewell that he was in his knowledge of wisdom, of great value because he contained secrets and wisdom that explained human happiness, and the guidance that led them to the path true. This is in accordance with the word of Allah: And (indeed) the glorious Qur'an, in the Book of the Preserved (Far Mahfudz), touches none other than the sanctified servants. Derived from the Lord of the whole world. (al-Waqi'ah \/ 56: 77-80)",
      "text_tafsir": "Allah menerangkan kedudukan Al-Qur'an di Lauh Mahfudz bahwa ia telah ada dalam ilmu-Nya yang azali, amat tinggi nilainya karena dia mengandung rahasia-rahasia dan hikmah-hikmah yang menerangkan kebahagiaan manusia, dan petunjuk-petunjuk yang membawa mereka ke jalan yang benar. Hal ini sesuai dengan firman Allah:\n\nDan (ini) sesungguhnya Al-Qur'an yang sangat mulia, dalam Kitab yang terpelihara (Lauh Mahfudz), tidak ada yang menyentuhnya selain hamba-hamba yang disucikan. Diturunkan dari Tuhan seluruh alam. (al-Waqi'ah\/56: 77-80)",
      "text_translation": "Dan sesungguhnya Al-Qur'an itu dalam Ummul Kitab (Lauh Mahfuzh) di sisi Kami, benar-benar (bernilai) tinggi dan penuh hikmah.",
      "text": "وَاِنَّهٗ فِيْٓ اُمِّ الْكِتٰبِ لَدَيْنَا لَعَلِيٌّ حَكِيْمٌ ۗ ",
      "text_translation_en": "And, verily, [originating as it does] in the source, with Us, of all revelation, it is indeed sublime, full of wisdom.",
      "juz_number": 25
    },
    "5": {
      "text_tafsir_en": "Allah reproves the Meccans of the Meccans by saying: Shall we cease to warn you of the Qur'an because you have become so deep in your infidelity, always abandoning Our command and doing our prohibition? No! We will never do that, because of our mercy and love for you, even if you are doomed, or left to die, because your actions are too much and go beyond limits. The Qatadah says, \"If the Qur'an was adopted or rejected when it was rejected by the first people of the ancient people, then they would perish, but Allah always bestowed His mercy and love on them and Muhammad twenty years more according to the will and will of God. \"",
      "text_tafsir": "Allah mencela kaum musyrik Mekah dengan mengatakan: Apakah Kami akan berhenti memperingatkan kamu dengan Al-Qur'an karena kamu sudah begitu mendalam dalam kekafiranmu, selalu meninggalkan perintah Kami dan melakukan larangan Kami? Tidak! Kami sekali-sekali tidak akan berbuat demikian, karena rahmat dan kasih sayang Kami kepadamu, meskipun kamu seharusnya dibinasakan, atau dibiarkan sesat sampai mati, karena perbuatanmu sudah keterlaluan dan melampaui batas.\n\nQatadah berkata, \"Sekiranya Al-Qur'an itu telah diangkat atau ditiadakan ketika ia ditolak orang-orang pertama dari umat terdahulu, maka pasti mereka binasa, tetapi Allah selalu memberikan rahmat dan kasih sayang-Nya kepada mereka dan Muhammad saw senantiasa menyeru mereka selama duapuluh tahun lebih menurut izin dan kehendak Allah.\"",
      "text_translation": "Maka apakah Kami akan berhenti menurunkan ayat-ayat (sebagai peringatan) Al-Qur'an kepadamu, karena kamu kaum yang melampaui batas?",
      "text": "اَفَنَضْرِبُ عَنْكُمُ الذِّكْرَ صَفْحًا اَنْ كُنْتُمْ قَوْمًا مُّسْرِفِيْنَ",
      "text_translation_en": "[O YOU who deny the truth!] Should We, perchance, withdraw this reminder from you altogether, seeing that you are people bent on wasting your own selves?",
      "juz_number": 25
    },
    "6": {
      "text_tafsir_en": "In this verse, God consoled his beloved Prophet Muhammad saw, because he was rejected by his people, and Allah commanded him to be patient. Not a few of the apostles whom God had sent before were rejected and ridiculed by his people as he was disowned and ridiculed. Thus is Sunatullah, a decree of God that cannot be changed, as Allah says: As the Sunnah of Allah (the same is true) for those who have gone before (you), and you will not find any change in the Sunnah of Allah. (al-Ahzab \/ 33: 62)",
      "text_tafsir": "Pada ayat ini Allah menghibur Rasul-Nya Muhammad saw yang sedang duka, karena ia didustakan oleh kaumnya, dan Allah memerintahkan kepadanya supaya dia bersabar. Tidak sedikit rasul yang telah diutus oleh Allah sejak dahulu diingkari dan diejek oleh kaumnya sebagaimana ia diingkari dan diejek pula.\n\nDemikianlah Sunatullah yang merupakan satu ketentuan dari Allah yang tidak dapat diubah lagi, sebagaimana firman Allah:\n\nSebagai sunah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunnah Allah. (al-Ahzab\/33: 62)",
      "text_translation": "Dan betapa banyak nabi-nabi yang telah Kami utus kepada umat-umat yang terdahulu.",
      "text": "وَكَمْ اَرْسَلْنَا مِنْ نَّبِيٍّ فِى الْاَوَّلِيْنَ ",
      "text_translation_en": "And how many a prophet did We send to people of olden times!",
      "juz_number": 25
    },
    "7": {
      "text_tafsir_en": "In this verse, God consoled his beloved Prophet Muhammad saw, because he was rejected by his people, and Allah commanded him to be patient. Not a few of the apostles whom God had sent before were rejected and ridiculed by his people as he was disowned and ridiculed. Thus is Sunatullah, a decree of God that cannot be changed, as Allah says: As the Sunnah of Allah (the same is true) for those who have gone before (you), and you will not find any change in the Sunnah of Allah. (al-Ahzab \/ 33: 62)",
      "text_tafsir": "Pada ayat ini Allah menghibur Rasul-Nya Muhammad saw yang sedang duka, karena ia didustakan oleh kaumnya, dan Allah memerintahkan kepadanya supaya dia bersabar. Tidak sedikit rasul yang telah diutus oleh Allah sejak dahulu diingkari dan diejek oleh kaumnya sebagaimana ia diingkari dan diejek pula.\n\nDemikianlah Sunatullah yang merupakan satu ketentuan dari Allah yang tidak dapat diubah lagi, sebagaimana firman Allah:\n\nSebagai sunah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunnah Allah. (al-Ahzab\/33: 62)",
      "text_translation": "Dan setiap kali seorang nabi datang kepada mereka, mereka selalu memperolok-olokkannya.",
      "text": "وَمَا يَأْتِيْهِمْ مِّنْ نَّبِيٍّ اِلَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ ",
      "text_translation_en": "But never yet came a prophet to them without their deriding him –",
      "juz_number": 25
    },
    "8": {
      "text_tafsir_en": "Allah explained that He destroyed those who rejected the apostles and that they could not avoid and avoid it when disaster came, but they were much stronger and more powerful than the people of the Prophet Muhammad. That should be the concern of Muhammadans. The Word of God: So if they do not travel on earth, then they consider the fate of those before them. They are more and more powerful and (more) the remnants of his civilization on earth. (Apocalypse \/ 40: 82) This verse closes with a warning to the people of Muhammad that God's provision for the people who rejected the apostles would be a lesson to them because it would be impossible for them to be affected as well as the previous people. The Word of God: So We made them the first (people) and a lesson for those who came after. (az-Zukhruf \/ 43: 56) Allah also says: That is the provision of Allah for His servants. (Infidel \/ 40: 85)",
      "text_tafsir": "Allah menerangkan bahwa Dia menghancurkan orang-orang yang mendustakan rasul-rasul dan mereka tak dapat mengelak dan menghindar apabila bencana itu datang, padahal mereka jauh lebih kuat dan perkasa dibandingkan dengan kaum Nabi Muhammad saw. Yang demikian itu hendaknya menjadi perhatian umat Muhammad. Firman Allah:\n\nMaka apakah mereka tidak mengadakan perjalanan di bumi, lalu mereka memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka. Mereka itu lebih banyak dan lebih hebat kekuatannya serta (lebih banyak) peninggalan-peninggalan peradabannya di bumi. (Gafir\/40: 82)\n\nAyat ini ditutup dengan satu peringatan kepada umat Muhammad bahwa ketentuan Allah yang berlaku pada umat yang mendustakan rasul, kiranya menjadi pelajaran bagi mereka karena tidak mustahil mereka itu juga akan ditimpa bencana sebagaimana halnya umat yang terdahulu itu. Firman Allah:\n\nMaka Kami jadikan mereka sebagai (kaum) terdahulu dan pelajaran bagi orang-orang yang kemudian. (az-Zukhruf\/43: 56)\n\nAllah juga berfirman:\n\nItulah (ketentuan) Allah yang telah berlaku terhadap hamba-hamba-Nya. (Gafir\/40: 85)",
      "text_translation": "Karena itu Kami binasakan orang-orang yang lebih besar kekuatannya di antara mereka dan telah berlalu contoh umat-umat terdahulu.",
      "text": "فَاَهْلَكْنَٓا اَشَدَّ مِنْهُمْ بَطْشًا وَّمَضٰى مَثَلُ الْاَوَّلِيْنَ ",
      "text_translation_en": "and so, [in the end,] We destroyed them [even though they were] of greater might than these: and the [very] image of those people of old became a thing of the past.",
      "juz_number": 25
    },
    "9": {
      "text_tafsir_en": "This verse is directed by Allah to His Messenger that when he asks the people of the world, who created the universe such as heaven, earth and the like, they will answer, that all things were created by Allah, the Mighty, the All-Knowing after all, nothing was hidden from him. God's Word: For Allah there is nothing hidden on earth and in heaven. (Ali 'Imran \/ 3: 5)",
      "text_tafsir": "Ayat ini ditujukan Allah kepada Rasul-Nya bahwa apabila dia bertanya kepada orang-orang musyrik kaumnya, siapakah yang menjadikan alam semesta seperti langit, bumi dan lainnya, mereka dengan tandas menjawab, bahwa semuanya itu diciptakan oleh Allah, Tuhan yang Maha Perkasa, Maha Mengetahui segalanya, tidak satu pun yang tersembunyi bagi-Nya. Firman Allah:\n\nBagi Allah tidak ada sesuatu pun yang tersembunyi di bumi dan di langit. (Ali 'Imran\/3: 5)",
      "text_translation": "Dan jika kamu tanyakan kepada mereka, “Siapakah yang menciptakan langit dan bumi?” Pastilah mereka akan menjawab, “Semuanya diciptakan oleh Yang Mahaperkasa, Maha Mengetahui.”",
      "text": "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ لَيَقُوْلُنَّ خَلَقَهُنَّ الْعَزِيْزُ الْعَلِيْمُۙ",
      "text_translation_en": "Yet thus it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth?” - they will surely answer, “The Almighty, the All-Knowing has created them.”",
      "juz_number": 25
    },
    "10": {
      "text_tafsir_en": "Allah explained that He was the one who made the earth as a stretch and prepared it for His creatures for their place of residence, footing and swinging feet, equipped with roads so that they could visit from one place to another, both near and far for the sake of life and livelihood, economic and trade interests, and others. In line with this verse the word of God: Did not We have made the earth as a stretch. (an-Naba '\/ 78: 6) The Word of God: And We made (there) wide ways, so that they might be guided. (al-Anbiya '\/ 21: 31)",
      "text_tafsir": "Allah menerangkan bahwa Dia-lah yang menjadikan bumi sebagai hamparan dan menyiapkannya bagi makhluk-Nya untuk tempat mereka menetap, berpijak dan mengayunkan kaki, diperlengkapi dengan jalan-jalan agar mereka dapat berkunjung dari satu tempat ke tempat yang lain, baik yang dekat maupun yang jauh untuk kepentingan hidup dan penghidupan, kepentingan ekonomi dan perdagangan, dan lain-lain. Sejalan dengan ayat ini firman Allah:\n\nBukankah Kami telah menjadikan bumi sebagai hamparan. (an-Naba'\/78: 6)\n\nFirman Allah:\n\nDan Kami jadikan (pula) di sana jalan-jalan yang luas, agar mereka mendapat petunjuk. (al-Anbiya'\/21: 31)",
      "text_translation": "Yang menjadikan bumi sebagai tempat menetap bagimu dan Dia menjadikan jalan-jalan di atas bumi untukmu agar kamu mendapat petunjuk.",
      "text": "الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ مَهْدًا وَّجَعَلَ لَكُمْ فِيْهَا سُبُلًا لَّعَلَّكُمْ تَهْتَدُوْنَ ۚ ",
      "text_translation_en": "He it is who has made the earth a cradle for you, and has provided for you ways [of livelihood] thereon, so that you might follow the right path.",
      "juz_number": 25
    },
    "11": {
      "text_tafsir_en": "God sends rain from the sky according to the need to cultivate plants and plants. He sent rain no more than necessary so that it did not overflow to the limit and eventually become a disaster, as floods that destroy and destroy, and not too little so that it is not sufficient for the fertility of plants and plants that cause dry and withered, and resulted in a famine that befell God's creatures everywhere. With the rain falling from the sky in accordance with the levels needed, the life and prosperity of a dead land which is no longer overgrown with plants and trees. As God has the power to raise a dead country, so He has the power to raise and remove dead people from the grave in a state of life, as God said: And He sent down water (rain) from heaven, then with that water he revived the earth after death ( dry). (ar-Rum \/ 30: 24) And His words: So We directed the cloud to a dead (barren) land and then with the rain We revive the earth after death (dry). Such was the resurrection. (Fathir \/ 35: 9) What is stated by this verse is proven by the science found in humans today. It is estimated that in one second, as many as 16 million tons of water evaporate from the earth. Using this number, it is calculated that there will be 513 trillion tons of water that evaporates from the earth in a year. This figure turns out to be the same as the calculation of the amount of rain that falls in a year. Thus, water conducts a continuous balanced circulation. Life on earth is very dependent on the continuity of this water cycle. Although many technologies try to intervene in this natural cycle, such as making artificial rain, in reality the water cycle cannot be made artificially. The proportion of rainwater is not only important in terms of numbers, but also the speed at which raindrops fall [according to the required size]. Rainwater grain speed does not exceed the standard speed, no matter what the size of the rainwater grain. Generally rainwater beads have a diameter of 4.5 mm. The speed is around 8 meters per second. At smaller sizes, of course, the speed is slower. At grain size larger than 4.5 mm, it does not mean that the speed is higher. The speed is fixed, which is around 8 meters per second. This is caused by the liquid form of the granules that will interact with air and wind so that the shape of the grain of water changes in such a way that it causes the falling speed to decrease and not to exceed the standard speed. Reviving a dead country with water (rain) from the sky has been said to Surah Fussilat \/ 41: 39, that with rain falling in a barren area, that area will (can, by Allah's will) be overgrown with trees. In this verse it is emphasized that water from the sky is lowered according to certain levels. Human resurrection after the grave is often compared to turning on a barren land with rainwater. We can compare this parable with the growth of wild grains or spores carried by the wind and scattered on dry soil. If this dry soil gets a sufficient amount of rain [according to the required size], the seeds will grow into sprouts and then become plants. If there is a lot of rainfall, the seeds or spores which will become the seeds of plants will be washed away by the flow of water. If the flow of water does not wash away, but if the moisture content in the soil is too excessive, the seeds will not grow into sprouts, instead it will rot. Everything according to size.",
      "text_tafsir": "Allah menurunkan hujan dari langit sesuai dengan keperluan untuk menghidup-suburkan tanam-tanaman dan tumbuh-tumbuhan. Dia menurunkan hujan tidak lebih dari yang diperlukan sehingga tidak melimpah ruah melampaui batas dan akhirnya menjadi bencana, seperti halnya air bah yang merusak dan membinasakan, dan tidak pula terlalu sedikit sehingga tidak mencukupi kebutuhan untuk kesuburan tanam-tanaman dan tumbuh-tumbuhan yang menyebabkan kering dan layu, dan mengakibatkan timbulnya bencana kelaparan yang menimpa makhluk Allah di mana-mana.\n\nDengan turunnya hujan dari langit sesuai dengan kadar yang diperlukan, maka hidup dan makmurlah negeri yang telah mati yang tidak lagi ditumbuhi tanam-tanaman dan pohon-pohonan. Sebagaimana Allah kuasa menghidupkan negeri yang telah mati, begitu pula Dia kuasa menghidupkan dan mengeluarkan orang-orang mati itu dari kubur dalam keadaan hidup, sebagaimana firman Allah:\n\nDan Dia menurunkan air (hujan) dari langit, lalu dengan air itu dihidupkannya bumi setelah mati (kering). (ar-Rum\/30: 24)\n\nDan firman-Nya:\n\nMaka Kami arahkan awan itu ke suatu negeri yang mati (tandus) lalu dengan hujan itu Kami hidupkan bumi setelah mati (kering). Seperti itulah kebangkitan itu. (Fathir\/35: 9)\n\nApa yang dikemukakan oleh ayat ini dibuktikan oleh ilmu pengetahuan yang ditemukan manusia saat ini. Diperkirakan dalam waktu satu detik, sebanyak 16 juta ton air menguap dari bumi. Menggunakan angka ini, maka diperhitungkan akan adanya 513 triliun ton air yang menguap dari bumi dalam setahun. Angka ini ternyata sama dengan perhitungan mengenai jumlah air hujan yang turun dalam setahun. Dengan demikian, air melakukan sirkulasi yang seimbang secara terus-menerus. Kehidupan di bumi sangat bergantung pada keberlanjutan siklus air yang demikian ini. Walaupun banyak teknologi mencoba mengintervensi siklus alami ini, seperti membuat hujan buatan, pada kenyataannya siklus air tidak dapat dibuat secara artifisial.\n\nProporsi air hujan tidak hanya penting dalam bentuk jumlahnya, tetapi juga kecepatan turunnya butir air hujan [menurut ukuran yang diperlukan]. Kecepatan butir air hujan tidak melebihi kecepatan standar, tidak peduli berapa ukuran butir air hujan itu. Umumnya butiran air hujan mempunyai diameter 4,5 mm. Kecepatannya sekitar 8 meter per detik. Pada ukuran yang lebih kecil, tentunya kecepatannya lebih rendah. Pada ukuran butiran yang lebih besar dari 4,5 mm, tidak berarti kecepatannya makin tinggi. Kecepatannya tetap, yaitu sekitar 8 meter per detik. Hal ini disebabkan karena bentuk butiran yang cair itu akan berinteraksi dengan udara dan angin sehingga bentuk butir air itu berubah sedemikian rupa yang mengakibatkan kecepatan jatuhnya menurun dan tidak melebihi kecepatan standar. \n\nMenghidupkan negeri yang mati dengan air (hujan) dari langit telah difirmankan pada Surah Fussilat\/41: 39, bahwasanya dengan diturunkan hujan di daerah yang tandus maka daerah tersebut akan (bisa, dengan kehendak Allah) ditumbuhi pepohonan. Pada ayat ini ditekankan bahwa air dari langit diturunkan menurut kadar tertentu. Kebangkitan manusia setelah alam kubur sering diibaratkan dengan menghidupkan tanah yang tandus dengan air hujan. Perumpamaan ini dapat kita bandingkan dengan tumbuhnya biji-bijian atau spora liar yang terbawa tiupan angin dan terserak di atas tanah yang kering. Apabila tanah yang kering ini mendapat siraman hujan dengan jumlah yang cukup [menurut ukuran yang diperlukan], maka biji-biji tersebut akan tumbuh menjadi kecambah-kecambah dan kemudian menjadi tumbuhan. Apabila curah hujan sangat banyak maka biji-bijian atau spora yang menjadi bakal benih tumbuh-tumbuhan akan hanyut terbawa aliran air. Seandainya aliran air tidak sampai menghanyutkan, tetapi bila kadar kelembaban air dalam tanah terlalu berlebih maka biji-bijian tidak akan tumbuh menjadi kecambah, malahan akan membusuk. Semuanya menurut ukuran.",
      "text_translation": "Dan yang menurunkan air dari langit menurut ukuran (yang diperlukan) lalu dengan air itu Kami hidupkan negeri yang mati (tandus). Seperti itulah kamu akan dikeluarkan (dari kubur).",
      "text": "وَالَّذِيْ نَزَّلَ مِنَ السَّمَاۤءِ مَاۤءًۢ بِقَدَرٍۚ فَاَنْشَرْنَا بِهٖ بَلْدَةً مَّيْتًا ۚ كَذٰلِكَ تُخْرَجُوْنَ ",
      "text_translation_en": "And He it is who sends down, again and again, waters from the sky in due measure: and [as] We raise therewith dead land to life, even thus will you be brought forth [from the dead].",
      "juz_number": 25
    },
    "12": {
      "text_tafsir_en": "Among the attributes of God mentioned in this verse is that He created all beings, male, female, male, of all kinds of plants, trees, fruits, flowers and others both human and animal. He also made vehicles such as boats, vessels that could be used to transport people and the necessities of sea merchandise, and livestock, such as camels, horses, rams, cows and others that could be used as land transport equipment, others can connect from one place to another, whether on land or at sea with various means of communication. In accordance with the word of Allah: And (He created) horses, mules, and donkeys, for you to ride and (be) ornaments. Allah created what you do not know. (an-Nahl \/ 16: 8) The explanation of Allah creating everything in pairs can be seen in his explanation of Surah asy-Syura \/ 42:11. Other verses that speak of the same are Yasin \/ 36: 36, ar-Ra ' d \/ 13: 3, and adh-dzariyat \/ 51: 49.",
      "text_tafsir": "Di antara sifat Allah yang disebut dalam ayat ini ialah Dia-lah yang menciptakan semua makhluk berpasang-pasangan, laki-laki perempuan, jantan-betina, baik dari jenis tumbuh-tumbuhan, pohon-pohonan, buah-buahan, bunga-bungaan dan lain-lain maupun dari jenis hewan dan manusia. Dia pula yang menjadikan kendaraan berupa perahu, kapal yang dapat dipergunakan untuk mengangkut manusia dan keperluan barang dagangan di laut, dan binatang ternak, seperti unta, kuda, himar, sapi dan lain-lain yang dapat dipergunakan sebagai alat pengangkutan di darat, dan lain-lain yang dapat menghubungkan satu tempat dengan tempat yang lain, baik di darat maupun di laut dengan macam alat perhubungan.\n\nSesuai dengan firman Allah:\n\nDan (Dia telah menciptakan) kuda, bagal, dan keledai, untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui. (an-Nahl\/16: 8)\n\nPenjelasan mengenai Allah menciptakan segala sesuatunya berpasang-pasangan dapat dilihat penjelasannya pada Surah asy-Syura\/42: 11. Beberapa ayat lain yang membicarakan hal yang sama adalah Yasin\/36: 36, ar-Ra'd\/13: 3, dan adh-dzariyat\/51: 49.",
      "text_translation": "Dan yang menciptakan semua berpasang-pasangan dan menjadikan kapal untukmu dan hewan ternak yang kamu tunggangi.",
      "text": "وَالَّذِيْ خَلَقَ الْاَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُمْ مِّنَ الْفُلْكِ وَالْاَنْعَامِ مَا تَرْكَبُوْنَۙ ",
      "text_translation_en": "And He it is who has created all opposites. And He [it is who] has provided for you all those ships and animals whereon you ride,",
      "juz_number": 25
    },
    "13": {
      "text_tafsir_en": "In this verse Allah explains that if humans are on the backs of animals, boats, ships, trains, airplanes and others, they must remember the blessings that Allah has given them, should glorify God and cleanse Him from attributes that are not worthy of what the polytheists accuse Him of, and let them read this verse as a prayer: Glory be to Allah (Allah) who has subjected all this to us even though we were previously unable to master it, and indeed we will return to our Lord. (az-Zukhruf \/ 43: 13-14) If God did not subdue the universe with the knowledge he bestowed, surely humans could not do it, because that is beyond their capacity. The prayer readings remind people to always get ready for the day of vengeance when all humans will face and experience it and do not neglect to remember God, whether traveling or not, when sailing or staying at home. In connection with the above interpretation, narrated by Imam Muslim, Abu Dawud, and an-Nasa'i that the Messenger of Allah, when traveling and driving say three times and read the prayer above. If the Holy Prophet was driving his vehicle to make a journey, then he bertakbir three times. Then he read, \"Glory (Allah) who has subdued all this for us even though we were previously unable to master it, and indeed we will return to our Lord.\" (Muslim History, Abu Dawud, and an-Nasa'i) The above verse teaches humans to be grateful for the blessings of God that have been given in the form of animals and treat them well. Equality between creatures, especially between animals and humans, is highly emphasized by God. One of the verses below explains that animals are also God's people, the same as humans. Although they have different characteristics, specificities and systems, in essence, they are the same as humans in God's eyes. And humans are obliged to remember it. And there is not an animal on the earth or birds that fly with both wings, but all are people (also) like you. There is nothing that we escape in the Book, then to God they are gathered. \"(Al-An'am \/ 6: 38) Some verses of the Qur'an allude to animals, including how humans should behave towards animals, the use of animals for humans, animal behavior that humans must imitate, and many others.In the relationship of equality between these creatures, there is the writing of a wise man, Muhammad Fazlur Rahman Ansari, saying thus, \"Everything on this earth was created for us, then it is already it is our natural duty to: protect everything from damage; use it while maintaining its dignity as God's creation; preserve it as much as possible, which is thus, grateful for God's favor in the form of real deeds. \"Regarding animals or pets, the Qur'an in Surah an-Nahl \/ 16: 5 mentions some of the benefits of animals for humans: And farm animals have been created- It is for you, there are warm (feathers) and various benefits, and some of it you eat. (An-Nahl \/ 16: 5) In connection with the verse from Surah an-Nahl above, we must pay attention that, for example, the skin and livestock fur may be used, but the Prophet Muhammad continued with one very wise thing, he forbade the use of wild animal skin even if it was only for a floor mat.If the rules or appeals from the Prophet were obeyed by all people, then the vain killing of several types of wild animals for the sake of profit alone would not have happened.Also, although Muslims are allowed to consume the meat of certain animals, but It must be remembered that this does not justify the cruel and unrestrained slaughter of them. One of the benefits of animals is as a ride. We must remember that the Arabs in the past were totally dependent on camels to help carry goods on their way. The Lord states this in the verse below: And he transports your burdens to a land which you cannot reach, except with difficulty. Truly, your Lord is Most Gracious, Most Merciful. And (He has created) horses, mules, and donkeys for you to ride and (become) jewels. God created what you don't know. (an-Nahl \/ 16: 7-8) Basically Islam teaches its people to love animals and preserve their lives. In the Qur'an, Allah emphasizes that He has granted man the realm of power that encompasses everything in this world. And He has subjected everything in the heavens and everything on earth to you all (as a mercy) from Him. (al-Jatsiyah \/ 45: 13). In this verse, the Qur'an does not at all show that humans have absolute power to do as they please everything in heaven and earth. Nor do they have unlimited rights to use nature, thereby damaging their ecological balance. \"... all of that from Him ...\" The fragment of the verse here should be realized and understood as a reminder from God, that humans have nothing in this world. So how should we treat other people's things must always be kept in mind \"... people who think ...\" Islam basically does not support humans to abuse animals for sporting purposes or to make animals as objects of experimentation carelessly. This verse reminds mankind that the Creator has made everything in nature (including animals) a mandate that they must guard.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa apabila manusia berada di atas punggung binatang, perahu, kapal, kereta api, pesawat terbang dan lain-lain hendaklah mengingat nikmat yang telah dikaruniakan Allah kepada mereka, hendaklah mengagungkan Allah dan menyucikan-Nya dari sifat-sifat yang tidak layak yang dituduhkan orang-orang musyrik kepada-Nya, dan hendaklah mereka membaca ayat ini sebagai doa:\n\nMahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami. (az-Zukhruf\/43: 13-14)\n\nAndaikata Allah tidak menundukkan alam semesta dengan ilmu yang dianugerahkan-Nya tentu manusia tidak dapat melakukannya, karena yang demikian itu di luar kemampuan mereka.\n\nBacaan doa itu mengingatkan manusia supaya selalu bersiap-siap menghadapi hari pembalasan saat seluruh manusia akan menghadapi dan mengalaminya dan jangan lalai mengingat Allah, baik di waktu bepergian atau tidak, di waktu berlayar atau tinggal di kampung halaman.\n\nSehubungan dengan tafsir di atas, diriwayatkan oleh Imam Muslim, Abu Dawud, dan an-Nasa'i bahwa Rasulullah saw, apabila bepergian dan berkendaraan mengucapkan tiga kali dan membaca doa tersebut di atas.\n\nApabila Nabi saw mengendarai kendaraannya untuk melakukan suatu perjalanan, maka beliau bertakbir tiga kali. Kemudian beliau membaca, \"Mahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami.\"(Riwayat Muslim, Abu Dawud, dan an-Nasa'i)\n\nAyat di atas mengajarkan agar manusia mensyukuri nikmat Allah yang telah diberikan berupa binatang dan memperlakukannya dengan baik. Kesetaraan di antara makhluk, terutama antara binatang dan manusia, sangat ditekankan Tuhan. Salah satu ayat di bawah ini menjelaskan bahwa binatang juga umat Tuhan, sama dengan manusia. Walau mereka mempunyai ciri, kekhususan dan sistem yang berbeda-beda, pada hakikatnya, mereka sama dengan manusia di mata Tuhan. Dan manusia diwajibkan untuk mengingatnya.\n\nDan tidak ada seekor binatang pun yang ada di bumi dan burung-burung yang terbang dengan kedua sayapnya, melainkan semuanya merupakan umat-umat (juga) seperti kamu. Tidak ada sesuatu pun yang Kami luputkan di dalam Kitab, kemudian kepada Tuhan mereka dikumpulkan.\" (al-An'am\/6: 38)\n\nBeberapa ayat Al-Qur'an menyinggung mengenai binatang, antara lain tentang bagaimana manusia harus bersikap terhadap binatang, kegunaan binatang untuk manusia, perilaku binatang yang harus ditiru manusia, dan banyak lagi lainnya. Dalam hubungan kesetaraan antar makhluk ini, ada tulisan seorang arif, Muhammad Fazlur Rahman Ansari, berbunyi demikian, \"Segala yang di muka bumi ini diciptakan untuk kita, maka sudah menjadi kewajiban alamiah kita untuk: menjaga segala sesuatu dari kerusakan; memanfaatkannya dengan tetap menjaga martabatnya sebagai ciptaan Tuhan; melestarikannya sebisa mungkin, yang dengan demikian, mensyukuri nikmat Tuhan dalam bentuk perbuatan nyata.\" \n\nMenyangkut hewan atau satwa peliharaan, Al-Qur'an dalam Surah an-Nahl\/16: 5 menyebutkan beberapa manfaat binatang untuk manusia:\n\nDan hewan ternak telah diciptakan-Nya untuk kamu, padanya ada (bulu) yang menghangatkan dan berbagai manfaat, dan sebagiannya kamu makan. (an-Nahl\/16: 5)\n\nDalam hubungannya dengan ayat dari Surah an-Nahl di atas, kita harus memperhatikan bahwa, misalnya, kulit dan bulu binatang ternak boleh dimanfaatkan. Namun Nabi Muhammad saw melanjutkannya dengan satu hal yang sangat bijaksana. Beliau melarang penggunaan kulit binatang liar walaupun sekedar untuk alas lantai. Jika aturan atau himbauan yang dikemukakan Nabi ini ditaati oleh semua orang, maka pembunuhan sia-sia terhadap beberapa jenis binatang liar demi meraih keuntungan semata niscaya tidak terjadi. Demikian pula, kendati umat Islam diperbolehkan mengkonsumsi daging beberapa binatang tertentu, tapi perlu diingat bahwa hal ini tidak menghalalkan pembantaian secara kejam dan tak terkendali terhadap mereka. \n\nSalah satu manfaat binatang adalah sebagai tunggangan. Kita harus ingat bahwa orang-orang Arab di masa lalu sepenuhnya bergantung pada unta untuk membantu membawa barang dalam perjalanan. Tuhan menyatakan hal tersebut dalam ayat di bawah: \n\nDan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, Tuhanmu Maha Pengasih, Maha Penyayang. Dan (Dia telah menciptakan) kuda, bagal, dan keledai untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui. (an-Nahl\/16: 7-8)\n\nPada hakikatnya Islam mengajarkan pada umatnya untuk menyayangi binatang dan melestarikan kehidupannya. Di dalam Al-Qur'an, Allah menekankan bahwa Dia telah menganugerahi manusia wilayah kekuasaan yang mencakup segala sesuatu di dunia ini. \n\nDan Dia telah menundukkan apa yang ada di langit dan apa yang ada di bumi untukmu semuanya (sebagai rahmat) dari-Nya. (al-Jatsiyah\/45: 13). \n\nDalam ayat ini, Al-Qur'an sama sekali tidak menunjukan bahwa manusia memiliki kekuasaan mutlak untuk berbuat sekehendak hatinya segala sesuatu yang ada di langit dan bumi. Mereka juga tidak pula memiliki hak tanpa batas untuk menggunakan alam sehingga merusak keseimbangan ekologisnya. \n\n\" .... semua itu dari Dia ....\" Penggalan ayat di sini seharusnya disadari dan dimengerti sebagai pengingat-ingat dari Tuhan, bahwa manusia tidak memiliki apa-apa di dunia ini. Jadi bagaimana seharusnya kita memperlakukan barang orang lain harus selalu diingat di dalam benak \"...orang-orang yang berpikir....\"\n\nIslam pada dasarnya tidak mendukung manusia untuk menyalahgunakan binatang untuk tujuan olahraga maupun untuk menjadikan binatang sebagai objek eksperimen yang sembarangan. Ayat ini mengingatkan umat manusia bahwa Sang Pencipta telah menjadikan semua yang ada di alam ini (termasuk satwa) sebagai amanah yang harus mereka jaga.",
      "text_translation": "Agar kamu duduk di atas punggungnya kemudian kamu ingat nikmat Tuhanmu apabila kamu telah duduk di atasnya; dan agar kamu mengucapkan, “Maha-suci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya,",
      "text": "لِتَسْتَوٗا عَلٰى ظُهُوْرِهٖ ثُمَّ تَذْكُرُوْا نِعْمَةَ رَبِّكُمْ اِذَا اسْتَوَيْتُمْ عَلَيْهِ وَتَقُوْلُوْا سُبْحٰنَ الَّذِيْ سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهٗ مُقْرِنِيْنَۙ ",
      "text_translation_en": "in order that you might gain mastery over them, and that, whenever you have mastered them, you might remember your Sustainer’s blessings and say: “Limitless in His glory is He who has made [all] this subservient to our use - since [but for Him,] we would not have been able to attain to it.",
      "juz_number": 25
    },
    "14": {
      "text_tafsir_en": "In this verse Allah explains that if humans are on the backs of animals, boats, ships, trains, airplanes and others, they must remember the blessings that Allah has given them, should glorify God and cleanse Him from attributes that are not worthy of what the polytheists accuse Him of, and let them read this verse as a prayer: Glory be to Allah (Allah) who has subjected all this to us even though we were previously unable to master it, and indeed we will return to our Lord. (az-Zukhruf \/ 43: 13-14) If God did not subdue the universe with the knowledge he bestowed, surely humans could not do it, because that is beyond their capacity. The prayer readings remind people to always get ready for the day of vengeance when all humans will face and experience it and do not neglect to remember God, whether traveling or not, when sailing or staying at home. In connection with the above interpretation, narrated by Imam Muslim, Abu Dawud, and an-Nasa'i that the Messenger of Allah, when traveling and driving say three times and read the prayer above. If the Holy Prophet was driving his vehicle to make a journey, then he bertakbir three times. Then he read, \"Glory (Allah) who has subdued all this for us even though we were previously unable to master it, and indeed we will return to our Lord.\" (Muslim History, Abu Dawud, and an-Nasa'i) The above verse teaches humans to be grateful for the blessings of God that have been given in the form of animals and treat them well. Equality between creatures, especially between animals and humans, is highly emphasized by God. One of the verses below explains that animals are also God's people, the same as humans. Although they have different characteristics, specificities and systems, in essence, they are the same as humans in God's eyes. And humans are obliged to remember it. And there is not an animal on the earth or birds that fly with both wings, but all are people (also) like you. There is nothing that we escape in the Book, then to God they are gathered. \"(Al-An'am \/ 6: 38) Some verses of the Qur'an allude to animals, including how humans should behave towards animals, the use of animals for humans, animal behavior that humans must imitate, and many others.In the relationship of equality between these creatures, there is the writing of a wise man, Muhammad Fazlur Rahman Ansari, saying thus, \"Everything on this earth was created for us, then it is already it is our natural duty to: protect everything from damage; use it while maintaining its dignity as God's creation; preserve it as much as possible, which is thus, grateful for God's favor in the form of real deeds. \"Regarding animals or pets, the Qur'an in Surah an-Nahl \/ 16: 5 mentions some of the benefits of animals for humans: And farm animals have been created- It is for you, there are warm (feathers) and various benefits, and some of it you eat. (An-Nahl \/ 16: 5) In connection with the verse from Surah an-Nahl above, we must pay attention that, for example, the skin and livestock fur may be used, but the Prophet Muhammad continued with one very wise thing, he forbade the use of wild animal skin even if it was only for a floor mat.If the rules or appeals from the Prophet were obeyed by all people, then the vain killing of several types of wild animals for the sake of profit alone would not have happened.Also, although Muslims are allowed to consume the meat of certain animals, but It must be remembered that this does not justify the cruel and unrestrained slaughter of them. One of the benefits of animals is as a ride. We must remember that the Arabs in the past were totally dependent on camels to help carry goods on their way. The Lord states this in the verse below: And he transports your burdens to a land which you cannot reach, except with difficulty. Truly, your Lord is Most Gracious, Most Merciful. And (He has created) horses, mules, and donkeys for you to ride and (become) jewels. God created what you don't know. (an-Nahl \/ 16: 7-8) Basically Islam teaches its people to love animals and preserve their lives. In the Qur'an, Allah emphasizes that He has granted man the realm of power that encompasses everything in this world. And He has subjected everything in the heavens and everything on earth to you all (as a mercy) from Him. (al-Jatsiyah \/ 45: 13). In this verse, the Qur'an does not at all show that humans have absolute power to do as they please everything in heaven and earth. Nor do they have unlimited rights to use nature, thereby damaging their ecological balance. \"... all of that from Him ...\" The fragment of the verse here should be realized and understood as a reminder from God, that humans have nothing in this world. So how should we treat other people's things must always be kept in mind \"... people who think ...\" Islam basically does not support humans to abuse animals for sporting purposes or to make animals as objects of experimentation carelessly. This verse reminds mankind that the Creator has made everything in nature (including animals) a mandate that they must guard.",
      "text_tafsir": "Pada ayat ini Allah menerangkan bahwa apabila manusia berada di atas punggung binatang, perahu, kapal, kereta api, pesawat terbang dan lain-lain hendaklah mengingat nikmat yang telah dikaruniakan Allah kepada mereka, hendaklah mengagungkan Allah dan menyucikan-Nya dari sifat-sifat yang tidak layak yang dituduhkan orang-orang musyrik kepada-Nya, dan hendaklah mereka membaca ayat ini sebagai doa:\n\nMahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami. (az-Zukhruf\/43: 13-14)\n\nAndaikata Allah tidak menundukkan alam semesta dengan ilmu yang dianugerahkan-Nya tentu manusia tidak dapat melakukannya, karena yang demikian itu di luar kemampuan mereka.\n\nBacaan doa itu mengingatkan manusia supaya selalu bersiap-siap menghadapi hari pembalasan saat seluruh manusia akan menghadapi dan mengalaminya dan jangan lalai mengingat Allah, baik di waktu bepergian atau tidak, di waktu berlayar atau tinggal di kampung halaman.\n\nSehubungan dengan tafsir di atas, diriwayatkan oleh Imam Muslim, Abu Dawud, dan an-Nasa'i bahwa Rasulullah saw, apabila bepergian dan berkendaraan mengucapkan tiga kali dan membaca doa tersebut di atas.\n\nApabila Nabi saw mengendarai kendaraannya untuk melakukan suatu perjalanan, maka beliau bertakbir tiga kali. Kemudian beliau membaca, \"Mahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami.\"(Riwayat Muslim, Abu Dawud, dan an-Nasa'i)\n\nAyat di atas mengajarkan agar manusia mensyukuri nikmat Allah yang telah diberikan berupa binatang dan memperlakukannya dengan baik. Kesetaraan di antara makhluk, terutama antara binatang dan manusia, sangat ditekankan Tuhan. Salah satu ayat di bawah ini menjelaskan bahwa binatang juga umat Tuhan, sama dengan manusia. Walau mereka mempunyai ciri, kekhususan dan sistem yang berbeda-beda, pada hakikatnya, mereka sama dengan manusia di mata Tuhan. Dan manusia diwajibkan untuk mengingatnya.\n\nDan tidak ada seekor binatang pun yang ada di bumi dan burung-burung yang terbang dengan kedua sayapnya, melainkan semuanya merupakan umat-umat (juga) seperti kamu. Tidak ada sesuatu pun yang Kami luputkan di dalam Kitab, kemudian kepada Tuhan mereka dikumpulkan.\" (al-An'am\/6: 38)\n\nBeberapa ayat Al-Qur'an menyinggung mengenai binatang, antara lain tentang bagaimana manusia harus bersikap terhadap binatang, kegunaan binatang untuk manusia, perilaku binatang yang harus ditiru manusia, dan banyak lagi lainnya. Dalam hubungan kesetaraan antar makhluk ini, ada tulisan seorang arif, Muhammad Fazlur Rahman Ansari, berbunyi demikian, \"Segala yang di muka bumi ini diciptakan untuk kita, maka sudah menjadi kewajiban alamiah kita untuk: menjaga segala sesuatu dari kerusakan; memanfaatkannya dengan tetap menjaga martabatnya sebagai ciptaan Tuhan; melestarikannya sebisa mungkin, yang dengan demikian, mensyukuri nikmat Tuhan dalam bentuk perbuatan nyata.\" \n\nMenyangkut hewan atau satwa peliharaan, Al-Qur'an dalam Surah an-Nahl\/16: 5 menyebutkan beberapa manfaat binatang untuk manusia:\n\nDan hewan ternak telah diciptakan-Nya untuk kamu, padanya ada (bulu) yang menghangatkan dan berbagai manfaat, dan sebagiannya kamu makan. (an-Nahl\/16: 5)\n\nDalam hubungannya dengan ayat dari Surah an-Nahl di atas, kita harus memperhatikan bahwa, misalnya, kulit dan bulu binatang ternak boleh dimanfaatkan. Namun Nabi Muhammad saw melanjutkannya dengan satu hal yang sangat bijaksana. Beliau melarang penggunaan kulit binatang liar walaupun sekedar untuk alas lantai. Jika aturan atau himbauan yang dikemukakan Nabi ini ditaati oleh semua orang, maka pembunuhan sia-sia terhadap beberapa jenis binatang liar demi meraih keuntungan semata niscaya tidak terjadi. Demikian pula, kendati umat Islam diperbolehkan mengkonsumsi daging beberapa binatang tertentu, tapi perlu diingat bahwa hal ini tidak menghalalkan pembantaian secara kejam dan tak terkendali terhadap mereka. \n\nSalah satu manfaat binatang adalah sebagai tunggangan. Kita harus ingat bahwa orang-orang Arab di masa lalu sepenuhnya bergantung pada unta untuk membantu membawa barang dalam perjalanan. Tuhan menyatakan hal tersebut dalam ayat di bawah: \n\nDan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, Tuhanmu Maha Pengasih, Maha Penyayang. Dan (Dia telah menciptakan) kuda, bagal, dan keledai untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui. (an-Nahl\/16: 7-8)\n\nPada hakikatnya Islam mengajarkan pada umatnya untuk menyayangi binatang dan melestarikan kehidupannya. Di dalam Al-Qur'an, Allah menekankan bahwa Dia telah menganugerahi manusia wilayah kekuasaan yang mencakup segala sesuatu di dunia ini. \n\nDan Dia telah menundukkan apa yang ada di langit dan apa yang ada di bumi untukmu semuanya (sebagai rahmat) dari-Nya. (al-Jatsiyah\/45: 13). \n\nDalam ayat ini, Al-Qur'an sama sekali tidak menunjukan bahwa manusia memiliki kekuasaan mutlak untuk berbuat sekehendak hatinya segala sesuatu yang ada di langit dan bumi. Mereka juga tidak pula memiliki hak tanpa batas untuk menggunakan alam sehingga merusak keseimbangan ekologisnya. \n\n\" .... semua itu dari Dia ....\" Penggalan ayat di sini seharusnya disadari dan dimengerti sebagai pengingat-ingat dari Tuhan, bahwa manusia tidak memiliki apa-apa di dunia ini. Jadi bagaimana seharusnya kita memperlakukan barang orang lain harus selalu diingat di dalam benak \"...orang-orang yang berpikir....\"\n\nIslam pada dasarnya tidak mendukung manusia untuk menyalahgunakan binatang untuk tujuan olahraga maupun untuk menjadikan binatang sebagai objek eksperimen yang sembarangan. Ayat ini mengingatkan umat manusia bahwa Sang Pencipta telah menjadikan semua yang ada di alam ini (termasuk satwa) sebagai amanah yang harus mereka jaga.",
      "text_translation": "dan sesungguhnya kami akan kembali kepada Tuhan kami.”",
      "text": "وَاِنَّآ اِلٰى رَبِّنَا لَمُنْقَلِبُوْنَ ",
      "text_translation_en": "Hence, verily, it is unto Him that we must always turn.”",
      "juz_number": 25
    },
    "15": {
      "text_tafsir_en": "God explained that although the Muslims acknowledged that it was God who created the heavens and the earth, yet they also determined that God had children, and angels were His daughters. They say, God is not like a creature, has children, but humbles himself because God is said to have daughters, while they have sons. The Arabs at that time considered the one who had daughters to be despised. So, it is no wonder that the verse closes with a certain affirmation that man is truly the undoing of the favor of God, which has been bestowed upon them.",
      "text_tafsir": "Allah menerangkan bahwa sekalipun orang musyrik mengakui bahwa Allah yang menciptakan langit dan bumi, namun di samping itu mereka pun menetapkan bahwa Allah mempunyai anak, dan malaikat merupakan anak perempuan-Nya.\n\nMereka mengatakan, Allah tidak azali seperti makhluk, sama-sama mempunyai anak, malah merendahkan-Nya karena Allah dikatakan mempunyai anak perempuan, sedang mereka mempunyai anak laki-laki. Orang-orang Arab pada waktu itu menganggap orang yang mempunyai anak-anak perempuan itu hina. Jadi, tidak heran kalau ayat itu ditutup dengan satu ketegasan bahwa manusia benar-benar pengingkar nikmat Tuhan, yang telah dikaruniakan kepada mereka.",
      "text_translation": "Dan mereka menjadikan sebagian dari hamba-hamba-Nya sebagai bagian dari-Nya. Sungguh, manusia itu pengingkar (nikmat Tuhan) yang nyata.",
      "text": "وَجَعَلُوْا لَهٗ مِنْ عِبَادِهٖ جُزْءًا ۗاِنَّ الْاِنْسَانَ لَكَفُوْرٌ مُّبِيْنٌ ۗ ࣖ ",
      "text_translation_en": "AND YET, they attribute to Him offspring from among some of the beings created by Him! Verily, most obviously bereft of all gratitude is man!",
      "juz_number": 25
    },
    "16": {
      "text_tafsir_en": "God has opened the door for the misdeeds of the unbelievers and the utterance of their speech. Does it make sense that God has something for himself that is worse (in their opinion) while others are good and choose for themselves daughters, while others are boys? The Word of God: Is it for you men and for women? That is certainly an unfair division. (an-Najm \/ 53: 21-22) And he says: Does He (Allah) choose daughters over sons? Why are you doing this? How did you decide? Then why don't you think? (ash-shaffat \/ 37: 153-155) And again He says: If God were to take children, He would choose what He wills from His creation. He is holy. He is the Almighty, the Almighty. (az-Zumar \/ 39: 4)",
      "text_tafsir": "Allah membuka tabir kesesatan orang musyrik dan kebatilan ucapan mereka. Apakah masuk akal bahwa Allah memiliki sesuatu untuk diri-Nya yang lebih buruk (menurut anggapan mereka) sedangkan yang lain memiliki yang baik dan memilih untuk diri-Nya anak perempuan, sedangkan untuk orang lain anak laki-laki? Firman Allah:\n\nApakah (pantas) untuk kamu yang laki-laki dan untuk-Nya yang perempuan?\n\nYang demikian itu tentulah suatu pembagian yang tidak adil. (an-Najm\/53: 21-22)\n\nDan firman-Nya:\n\nApakah Dia (Allah) memilih anak-anak perempuan daripada anak-anak laki-laki? Mengapa kamu ini? Bagaimana (caranya) kamu menetapkan? Maka mengapa kamu tidak memikirkan? (ash-shaffat\/37: 153-155)\n\nDan firman-Nya lagi:\n\nSekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang Dia kehendaki dari apa yang telah diciptakan-Nya. Mahasuci Dia. Dialah Allah Yang Maha Esa, Mahaperkasa. (az-Zumar\/39: 4)",
      "text_translation": "Pantaskah Dia mengambil anak perempuan dari yang diciptakan-Nya dan memberikan anak laki-laki kepadamu?",
      "text": "اَمِ اتَّخَذَ مِمَّا يَخْلُقُ بَنٰتٍ وَّاَصْفٰىكُمْ بِالْبَنِيْنَ ۗ ",
      "text_translation_en": "Or [do you think], perchance, that out of all His creation He has chosen for Himself daughters, and favoured you with sons?",
      "juz_number": 25
    },
    "17": {
      "text_tafsir_en": "God shows the ignorance of the unbelievers and their ignorance. When one of them is blessed with a daughter, his face is immediately saddened by the sadness, the deep humiliation, the loss of face-to-face contact with his friends. He was alone in confusion. What would he do? Will the daughter he has just left behind, be it shameful and humiliating, or will he bury her alive? A very despicable act, as the word of God says: When one of them is informed of a daughter (birth), his face becomes black (red), and he is very angry. He hid from the crowd, because of the bad news that was being reported to him. Will he protect it with humiliation or will it sink into the ground (alive)? Remember what a bad decision they made. (Nahl \/ 16: 58-59)",
      "text_tafsir": "Allah menunjukkan kebodohan orang-orang musyrik dan kecurangan mereka. Apabila salah seorang dari mereka dikaruniai anak perempuan, dengan serta-merta mukanya menjadi sangat muram karena sedih, menanggung malu yang amat dalam, tak kuat rasanya berhadapan muka dengan teman-temannya. Dia menyendiri dalam kebingungan. Apakah kiranya yang akan diperbuatnya? Apakah anak perempuan yang diperolehnya itu akan dibiarkan begitu saja, sekalipun ia harus menanggung malu dan hina, ataukah akan menguburkannya hidup-hidup? Suatu perbuatan yang sangat tercela, sebagaimana firman Allah:\n\nPadahal apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, wajahnya menjadi hitam (merah padam), dan dia sangat marah. Dia bersembunyi dari orang banyak, disebabkan kabar buruk yang disampaikan kepadanya. Apakah dia akan memeliharanya dengan (menanggung) kehinaan atau akan membenamkannya ke dalam tanah (hidup-hidup)? Ingatlah alangkah buruknya (putusan) yang mereka tetapkan itu. (an-Nahl\/16: 58-59)",
      "text_translation": "Dan apabila salah seorang di antara mereka diberi kabar gembira dengan apa (kelahiran anak perempuan) yang dijadikan sebagai perumpamaan bagi (Allah) Yang Maha Pengasih, jadilah wajahnya hitam pekat, karena menahan sedih (dan marah).",
      "text": "وَاِذَا بُشِّرَ اَحَدُهُمْ بِمَا ضَرَبَ لِلرَّحْمٰنِ مَثَلًا ظَلَّ وَجْهُهٗ مُسْوَدًّا وَّهُوَ كَظِيْمٌ ",
      "text_translation_en": "For [thus it is:] if any of them is given the glad tiding of [the birth of] what he so readily attributes to the Most Gracious, his face darkens, and he is filled with suppressed anger:",
      "juz_number": 25
    },
    "18": {
      "text_tafsir_en": "God contradicts the notion that Muslims have daughters while they have sons. The objection is: Is a person born and raised for decoration and when he exchanges thoughts and discussions is incapable of expressing reason or reason, since he is more influenced by feelings than to use reason and thought, should such a person be considered a child of God?",
      "text_tafsir": "Allah membantah anggapan kaum musyrik bahwa Allah mempunyai anak perempuan sedangkan mereka mempunyai anak laki-laki. Bantahan itu ialah: Apakah orang yang dilahirkan dan dibesarkan untuk berhias dan bila ia dalam bertukar pikiran dan berdiskusi tidak sanggup mengemukakan hujjah atau alasan yang kuat, karena dia lebih terpengaruh oleh perasaan daripada mempergunakan akal dan pikiran, adakah orang seperti ini patut dianggap anak Tuhan?",
      "text_translation": "Dan apakah patut (menjadi anak Allah) orang yang dibesarkan sebagai perhiasan sedang dia tidak mampu memberi alasan yang tegas dan jelas dalam pertengkaran.",
      "text": "اَوَمَنْ يُّنَشَّؤُا فِى الْحِلْيَةِ وَهُوَ فِى الْخِصَامِ غَيْرُ مُبِيْنٍ ",
      "text_translation_en": "“What! [Am I to have a daughter -] one who is to be reared [only] for the sake of ornament?” and thereupon he finds himself torn by a vague inner conflict.",
      "juz_number": 25
    },
    "19": {
      "text_tafsir_en": "This verse explains that the monks have committed four major sins that show their disbelief. First, it says that God has children; second, the daughters of God; and third, the sons of God are angels, whereas angels are His glorified servants, who worship God day and night, and do not transgress as He is commanded. An angel of that nature is called a woman. Fourth, they think that they become idolaters because they are destined by God. All of those statements are a great sin and a baseless lie. Do they see the creation of the angels so that they dare to say that and believe that they are women? Allah says: Or do We create angels as women when they see (them)? Remember, in fact, among their lies they say, \"Allah has a son.\" And really, they're really liars. (as-shaffat \/ 37: 150-152) Verse 19 closes with a threat to the monks that what they say about angels will all be recorded and will be asked for their responsibility in the hereafter. Another is shown by heresy and idolatry. They said in a mocking tone, \"If the Most Gracious God wills, we would not worship the angel.\" It is as if they worship angels by the will of God. Allah says: The hypocrites will say, \"If Allah wills, we will not associate with Him.\" (Al-An'am \/ 6: 148) Their position is very erroneous and misleading, because Allah never approves of any worship of anything. besides Him, Allah commands that men worship only Him, as He says: And verily, We have sent an Apostle to every people (to proclaim), \"Worship Allah, and stay away from the devil\" (an-Nahl \/ 16: 36) And He says: And ask Our messengers whom We sent before thee, \"Do we determine gods besides Allah, the Merciful to worship?\" (Az-Zukhruf \/ 43: 45 ) Verse 20 closes with one firmness, rejecting the words of the monk, that they have no knowledge of the facts and that they have little knowledge of what they are saying, and that they are merely suspicious and not based on rights and truth.",
      "text_tafsir": "Ayat ini menerangkan bahwa kaum musyrik telah berbuat empat kesalahan besar yang menunjukkan kekafiran mereka. Pertama, dikatakannya bahwa Allah mempunyai anak; kedua, anak-anak Allah perempuan; dan ketiga, anak-anak Allah itu adalah malaikat, padahal malaikat adalah hamba yang dimuliakan-Nya, yang senantiasa menyembah Tuhan siang dan malam, dan tidak pernah menyalahi apa yang diperintahkan kepadanya. Malaikat yang bersifat demikian dikatakannya perempuan. Keempat, anggapan mereka bahwa mereka menjadi musyrik karena ditakdirkan oleh Allah. Semua pernyataan mereka itu adalah dosa besar dan kebohongan yang tidak berdasar sama sekali.\n\nApakah mereka menyaksikan penciptaan malaikat-malaikat itu sehingga mereka berani menetapkan yang demikian dan yakin bahwa malaikat itu perempuan? Allah berfirman:\n\nAtau apakah Kami menciptakan malaikat-malaikat berupa perempuan sedangkan mereka menyaksikan(nya)?Ingatlah, sesungguhnya di antara kebohongannya mereka benar-benar mengatakan,\"Allah mempunyai anak.\" Dan sungguh, mereka benar-benar pendusta. (as-shaffat\/37: 150-152)\n\nAyat 19 ini ditutup dengan satu ancaman kepada orang musyrik bahwa apa yang mereka katakan mengenai malaikat, semua itu akan dicatat dan akan dimintai pertanggungjawaban mereka di akhirat kelak.\n\nSatu lagi diperlihatkan perbuatan sesat dan orang musyrik. Mereka berkata dengan nada mengejek, \"Sekiranya Allah yang Maha Pemurah menghendaki, niscaya kami tidak menyembah malaikat itu.\" Seakan-akan mereka menyembah malaikat karena kehendak Allah. Allah berfirman:\n\nOrang-orang musyrik akan berkata, \"Jika Allah menghendaki, tentu kami tidak akan mempersekutukan-Nya. (al-An'am\/6: 148)\n\nPendirian mereka sangat keliru dan sesat, karena Allah tidak pernah merestui suatu penyembahan terhadap sesuatu selain Dia, Allah hanya memerintahkan agar manusia hanya menyembah kepada-Nya, sebagaimana firman-Nya:\n\nDan sungguh, Kami telah mengutus seorang rasul untuk setiap umat (untuk menyerukan), \"Sembahlah Allah, dan jauhilah thagut\" (an-Nahl\/16: 36)\n\nDan firman-Nya:\n\nDan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, \"Apakah Kami menentukan tuhan-tuhan selain (Allah) Yang Maha Pengasih untuk disembah?\" (az-Zukhruf\/43: 45)\n\nAyat 20 ini ditutup dengan satu ketegasan, menolak ucapan orang musyrik itu, bahwa mereka tidak tahu sama sekali keadaan yang sebenarnya dan tidak mempunyai pengetahuan sedikit pun mengenai hal itu. Apa yang dikatakan mereka hanya dugaan belaka dan tidak berdasarkan hak dan kebenaran.",
      "text_translation": "Dan mereka menjadikan malaikat-malaikat hamba-hamba (Allah) Yang Maha Pengasih itu sebagai jenis perempuan. Apakah mereka menyaksikan penciptaan (malaikat-malaikat itu)? Kelak akan dituliskan kesaksian mereka dan akan dimintakan pertanggungjawaban.",
      "text": "وَجَعَلُوا الْمَلٰۤىِٕكَةَ الَّذِيْنَ هُمْ عِبٰدُ الرَّحْمٰنِ اِنَاثًا ۗ اَشَهِدُوْا خَلْقَهُمْ ۗسَتُكْتَبُ شَهَادَتُهُمْ وَيُسْٔـَلُوْنَ ",
      "text_translation_en": "And [yet] they claim that the angels - who in themselves are but beings created by the Most Gracious - are females: [but] did they witness their creation? This false claim of theirs will be recorded, and they will be called to account [for it on Judgment Day]!",
      "juz_number": 25
    },
    "20": {
      "text_tafsir_en": "This verse explains that the monks have committed four major sins that show their disbelief. First, it says that God has children; second, the daughters of God; and third, the sons of God are angels, whereas angels are His glorified servants, who worship God day and night, and do not transgress as He is commanded. An angel of that nature is called a woman. Fourth, they think that they become idolaters because they are destined by God. All of those statements are a great sin and a baseless lie. Do they see the creation of the angels so that they dare to say that and believe that they are women? Allah says: Or do We create angels as women when they see (them)? Remember, in fact, among their lies they say, \"Allah has a son.\" And really, they're really liars. (as-shaffat \/ 37: 150-152) Verse 19 closes with a threat to the monks that what they say about angels will all be recorded and will be asked for their responsibility in the hereafter. Another is shown by heresy and idolatry. They said in a mocking tone, \"If the Most Gracious God wills, we would not worship the angel.\" It is as if they worship angels by the will of God. Allah says: The hypocrites will say, \"If Allah wills, we will not associate with Him.\" (Al-An'am \/ 6: 148) Their position is very erroneous and misleading, because Allah never approves of any worship of anything. besides Him, Allah commands that men worship only Him, as He says: And verily, We have sent an Apostle to every people (to proclaim), \"Worship Allah, and stay away from the devil\" (an-Nahl \/ 16: 36) And He says: And ask Our messengers whom We sent before thee, \"Do we determine gods besides Allah, the Merciful to worship?\" (Az-Zukhruf \/ 43: 45 ) Verse 20 closes with one firmness, rejecting the words of the monk, that they have no knowledge of the facts and that they have little knowledge of what they are saying, and that they are merely suspicious and not based on rights and truth.",
      "text_tafsir": "Ayat ini menerangkan bahwa kaum musyrik telah berbuat empat kesalahan besar yang menunjukkan kekafiran mereka. Pertama, dikatakannya bahwa Allah mempunyai anak; kedua, anak-anak Allah perempuan; dan ketiga, anak-anak Allah itu adalah malaikat, padahal malaikat adalah hamba yang dimuliakan-Nya, yang senantiasa menyembah Tuhan siang dan malam, dan tidak pernah menyalahi apa yang diperintahkan kepadanya. Malaikat yang bersifat demikian dikatakannya perempuan. Keempat, anggapan mereka bahwa mereka menjadi musyrik karena ditakdirkan oleh Allah. Semua pernyataan mereka itu adalah dosa besar dan kebohongan yang tidak berdasar sama sekali.\n\nApakah mereka menyaksikan penciptaan malaikat-malaikat itu sehingga mereka berani menetapkan yang demikian dan yakin bahwa malaikat itu perempuan? Allah berfirman:\n\nAtau apakah Kami menciptakan malaikat-malaikat berupa perempuan sedangkan mereka menyaksikan(nya)?Ingatlah, sesungguhnya di antara kebohongannya mereka benar-benar mengatakan,\"Allah mempunyai anak.\" Dan sungguh, mereka benar-benar pendusta. (as-shaffat\/37: 150-152)\n\nAyat 19 ini ditutup dengan satu ancaman kepada orang musyrik bahwa apa yang mereka katakan mengenai malaikat, semua itu akan dicatat dan akan dimintai pertanggungjawaban mereka di akhirat kelak.\n\nSatu lagi diperlihatkan perbuatan sesat dan orang musyrik. Mereka berkata dengan nada mengejek, \"Sekiranya Allah yang Maha Pemurah menghendaki, niscaya kami tidak menyembah malaikat itu.\" Seakan-akan mereka menyembah malaikat karena kehendak Allah. Allah berfirman:\n\nOrang-orang musyrik akan berkata, \"Jika Allah menghendaki, tentu kami tidak akan mempersekutukan-Nya. (al-An'am\/6: 148)\n\nPendirian mereka sangat keliru dan sesat, karena Allah tidak pernah merestui suatu penyembahan terhadap sesuatu selain Dia, Allah hanya memerintahkan agar manusia hanya menyembah kepada-Nya, sebagaimana firman-Nya:\n\nDan sungguh, Kami telah mengutus seorang rasul untuk setiap umat (untuk menyerukan), \"Sembahlah Allah, dan jauhilah thagut\" (an-Nahl\/16: 36)\n\nDan firman-Nya:\n\nDan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, \"Apakah Kami menentukan tuhan-tuhan selain (Allah) Yang Maha Pengasih untuk disembah?\" (az-Zukhruf\/43: 45)\n\nAyat 20 ini ditutup dengan satu ketegasan, menolak ucapan orang musyrik itu, bahwa mereka tidak tahu sama sekali keadaan yang sebenarnya dan tidak mempunyai pengetahuan sedikit pun mengenai hal itu. Apa yang dikatakan mereka hanya dugaan belaka dan tidak berdasarkan hak dan kebenaran.",
      "text_translation": "Dan mereka berkata, “Sekiranya (Allah) Yang Maha Pengasih menghendaki, tentulah kami tidak menyembah mereka (malaikat).” Mereka tidak mempunyai ilmu sedikit pun tentang itu. Tidak lain mereka hanyalah menduga-duga belaka.",
      "text": "وَقَالُوْا لَوْ شَاۤءَ الرَّحْمٰنُ مَا عَبَدْنٰهُمْ ۗمَا لَهُمْ بِذٰلِكَ مِنْ عِلْمٍ اِنْ هُمْ اِلَّا يَخْرُصُوْنَۗ ",
      "text_translation_en": "Yet they say, “Had [not] the Most Gracious so willed, we would never have worshipped them!” [But] they cannot have any knowledge of [His having willed] such a thing: they do nothing but guess.",
      "juz_number": 25
    },
    "21": {
      "text_tafsir_en": "God added to the explanation of his refusal to believe that the idolaters were worshiping angels for the sake of Allah, saying, \"Have we ever given them a book before the Qur'an, then they hold fast to the book No, not at all. Their stand is based on speculation and hypocrisy, says Allah: They follow mere assumptions and they are only liars (al-An'am \/ 6: 116).",
      "text_tafsir": "Allah menambahkan penjelasan dalam rangka penolakan-Nya terhadap anggapan orang-orang musyrik bahwa mereka menyembah malaikat karena kehendak Allah, dengan firman-Nya, \"Apakah memang pernah kami memberikan kepada mereka sebuah kitab sebelum Al-Qur'an, lalu mereka berpegang teguh kepada kitab itu? Tidak, sama sekali tidak. Pendirian mereka hanya didasarkan atas dugaan dan sangkaan yang mengandung dusta, firman Allah:\n\nYang mereka ikuti hanya persangkaan belaka dan mereka hanyalah membuat kebohongan. (al-An'am\/6: 116)",
      "text_translation": "Atau apakah pernah Kami berikan sebuah kitab kepada mereka sebelumnya, lalu mereka berpegang (pada kitab itu)?",
      "text": "اَمْ اٰتَيْنٰهُمْ كِتٰبًا مِّنْ قَبْلِهٖ فَهُمْ بِهٖ مُسْتَمْسِكُوْنَ ",
      "text_translation_en": "Or have We, perchance, vouchsafed them, before this one, a revelation [to the contrary,] to which they are still holding fast?",
      "juz_number": 25
    },
    "22": {
      "text_tafsir_en": "God explains that what is thought to be a reason to associate with God is completely false, and has no credible reason. They simply follow the example of their forefathers, because they believe that their forefathers are knowledgeable, and will not mislead those who follow them, but will be guided. They turn things around, for in reality they have gone astray, without guidance, as God says: Indeed, they have gone astray and have no guidance. (al-An'am \/ 6: 140)",
      "text_tafsir": "Allah menerangkan bahwa apa yang disangka sebagai alasan untuk mempersekutukan Allah, sama sekali tidak benar, dan tidak mempunyai alasan yang dapat diandalkan. Mereka semata-mata hanya bertaklid mengikuti dan berpegang teguh kepada apa yang telah diperbuat oleh nenek moyang mereka, karena mereka yakin bahwa nenek moyang mereka berpengetahuan luas, dan tidak akan menyesatkan orang-orang yang mengikutinya, malahan mereka akan mendapat petunjuk. Mereka memutarbalikkan keadaan, karena sebenarnya mereka telah sesat, tidak mendapat petunjuk, sebagaimana firman Allah:\n\nSungguh, mereka telah sesat dan tidak mendapat petunjuk. (al-An'am\/6: 140)",
      "text_translation": "Bahkan mereka berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu agama, dan kami mendapat petunjuk untuk mengikuti jejak mereka.”",
      "text": "بَلْ قَالُوْٓا اِنَّا وَجَدْنَآ اٰبَاۤءَنَا عَلٰٓى اُمَّةٍ وَّاِنَّا عَلٰٓى اٰثٰرِهِمْ مُّهْتَدُوْنَ ",
      "text_translation_en": "Nay, but they say, “Behold, We found our forefathers agreed on what to believe - and, verily, it is in their footsteps that we find our guidance!”",
      "juz_number": 25
    },
    "23": {
      "text_tafsir_en": "In this verse Allah comforts the Prophet Muhammad (peace be upon him) that no messenger was sent to any country before Muhammad (peace be upon him) received his kind words. They all get very bad answers and are very annoying. Such an attitude comes from those who are used to living a life of luxury, pride and arrogance. They say, \"We have found our ancestors in a religion and we are in fact their footsteps.\" So, if Muhammad saw such an answer, he would not have to worry and feel tight. What was said to Muhammad (saw) has been said to the apostles before, as Allah says: What (the disbelievers) say to you is nothing but what was said to the apostles before you. . people before them, they (people) must say, \"He is a witch or a madman.\" (adh-dzariyat \/ 51: 52)",
      "text_tafsir": "Pada ayat ini Allah menghibur Nabi Muhammad saw bahwa tidak seorang rasul pun yang diutus ke suatu negeri sebelum Muhammad saw mendapat sambutan dengan kata-kata yang menyenangkan hati. Mereka semua mendapat jawaban yang tidak enak didengar dan sangat menjengkelkan hati. Sikap yang demikian berasal dari orang-orang yang terbiasa hidup mewah, sombong dan angkuh. Mereka berkata, \"Sesungguhnya kami mendapatkan nenek moyang kami menganut suatu agama dan sesungguhnya kami adalah pengikut jejak mereka.\" Jadi, kalau Muhammad saw mendapat jawaban seperti itu tidak perlu gusar dan merasa sesak dada. Apa yang dikatakan kepada Muhammad saw telah dikatakan pula kepada rasul-rasul sebelumnya, sebagaimana firman Allah:\n\nApa yang dikatakan (oleh orang-orang kafir) kepadamu tidak lain adalah apa yang telah dikatakan kepada rasul-rasul sebelummu. (Fussilat\/41: 43)\n\nBegitu pula kalau dikatakan bahwa Nabi Muhammad saw tukang sihir, atau gila oleh kaumnya, itu pun karena rasul-rasul sebelumnya telah dituduh seperti itu juga oleh kaumnya, firman Allah:\n\nDemikianlah setiap kali seorang rasul yang datang kepada orang-orang yang sebelum mereka, mereka (kaumnya) pasti mengatakan, \"Dia itu pesihir atau orang gila.\" (adh-dzariyat\/51: 52)",
      "text_translation": "Dan demikian juga ketika Kami mengutus seorang pemberi peringatan sebelum engkau (Muhammad) dalam suatu negeri, orang-orang yang hidup mewah (di negeri itu) selalu berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu (agama) dan sesungguhnya kami sekedar pengikut jejak-jejak mereka.”",
      "text": "وَكَذٰلِكَ مَآ اَرْسَلْنَا مِنْ قَبْلِكَ فِيْ قَرْيَةٍ مِّنْ نَّذِيْرٍۙ اِلَّا قَالَ مُتْرَفُوْهَآ  ۙاِنَّا وَجَدْنَآ اٰبَاۤءَنَا عَلٰٓى اُمَّةٍ وَّاِنَّا عَلٰٓى اٰثٰرِهِمْ مُّقْتَدُوْنَ",
      "text_translation_en": "And thus it is: whenever We sent, before thy time, a warner to any community, those of its people who had lost themselves entirely in the pursuit of pleasures would always say, “Behold, we found our forefathers agreed on what to believe - and, verily, it is but in their footsteps that we follow!”",
      "juz_number": 25
    },
    "24": {
      "text_tafsir_en": "God explained that Prophet Muhammad addressed his people by saying, \"Do you still follow in the footsteps of your ancestors, even if I bring you a religion that is real and better than what your forefathers carried?\" His people proudly replied that they would follow in the footsteps of their ancestors and would not follow the religion they had been led to believe, and they would still reject it, as the word of God said: The proud do say: we reject what you believe. \" (al-A'raf \/ 7: 76)",
      "text_tafsir": "Allah menerangkan bahwa Nabi Muhammad menghimbau kaumnya dengan ucapan, \"Apakah kamu masih tetap mengikuti jejak nenek moyang kamu, sekalipun aku membawa untukmu suatu agama yang nyata dan lebih baik daripada apa yang telah dianut oleh nenek moyangmu itu?\" Kaumnya menjawab dengan sombong, bahwa mereka akan tetap mengikuti jejak nenek moyang mereka dan tidak akan mengikuti agama yang dibawanya, yakni agama yang ditugaskan kepadanya untuk menyampaikannya, dan mereka tetap akan mengingkarinya, sebagaimana firman Allah:\n\nOrang-orang yang menyombongkan diri berkata, \"Sesungguhnya kami mengingkari apa yang kamu percayai.\" (al-A'raf\/7: 76)",
      "text_translation": "(Rasul itu) berkata, “Apakah (kamu akan mengikutinya juga) sekalipun aku membawa untukmu (agama) yang lebih baik daripada apa yang kamu peroleh dari (agama) yang dianut nenek moyangmu.” Mereka menjawab, “Sesungguhnya kami mengingkari (agama) yang kamu diperintahkan untuk menyampaikannya.”",
      "text": "۞ قٰلَ اَوَلَوْ جِئْتُكُمْ بِاَهْدٰى مِمَّا وَجَدْتُّمْ عَلَيْهِ اٰبَاۤءَكُمْۗ قَالُوْٓا اِنَّا بِمَآ اُرْسِلْتُمْ بِهٖ كٰفِرُوْنَ ",
      "text_translation_en": "[Whereupon each prophet] would say, “Why, even though I bring you guidance better than that which you found your forefathers believing in?” - [to which] the others would reply, “Behold, we deny that there is any truth in [what you claim to be] your messages!”",
      "juz_number": 25
    },
    "25": {
      "text_tafsir_en": "God explains that those who still rebel and continually reject the apostles sent to them and disobey God, will be destroyed as a result of their actions which have always rejected God's revelations; let it be witnessed and taught according to His word: So go ye forth on the earth, and see what the end of the people is (the apostles). (Nahl \/ 16: 36)",
      "text_tafsir": "Allah menerangkan bahwa orang-orang yang tetap membangkang dan senantiasa mendustakan rasul-rasul yang diutus kepada mereka dan mengingkari ketuhanan Allah, akan dibinasakan sebagai akibat dari perbuatan mereka yang selalu mendustakan ayat-ayat Allah; kiranya hal itu dapat disaksikan dan menjadi iktibar sesuai dengan firman-Nya:\n\nMaka berjalanlah kamu di bumi dan perhatikanlah bagaimana kesudahan orang yang mendustakan (rasul-rasul). (an-Nahl\/16: 36)",
      "text_translation": "Lalu Kami binasakan mereka, maka perhatikanlah bagaimana kesudahan orang-orang yang mendustakan (kebenaran).",
      "text": "فَانْتَقَمْنَا مِنْهُمْ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِيْنَ ࣖ",
      "text_translation_en": "And so We inflicted Our retribution on them: and behold what happened in the end to those who gave the lie to the truth!",
      "juz_number": 25
    },
    "26": {
      "text_tafsir_en": "Allah ordered Muhammad (peace be upon him) to warn his fanatical people to his forefathers that Abraham had turned away from his father and his people when he saw them sincerely worshiping idols, because that was an unreasonable thing and led to a misconception of the word. Allah: And (remember) when Abraham said to his father Azar, \"Do you think that you make idols to be gods? Indeed, I see you and your people in error.\" (al-An'am \/ 6: 74)",
      "text_tafsir": "Allah memerintahkan kepada Muhammad saw supaya dia memperingatkan kaumnya yang fanatik kepada nenek moyangnya bahwa Nabi Ibrahim telah berlepas diri dari bapak dan kaumnya ketika dia melihat mereka bersungguh-sungguh menyembah berhala, karena yang demikian itu adalah satu hal yang tidak pantas dan membawa kepada kesesatan sebagaimana firman Allah:\n\nDan (ingatlah) ketika Ibrahim berkata kepada ayahnya Azar, \"Pantaskah engkau menjadikan berhala-berhala itu sebagai tuhan? Sesungguhnya aku melihat engkau dan kaummu dalam kesesatan yang nyata.\" (al-An'am\/6: 74)",
      "text_translation": "Dan (ingatlah) ketika Ibrahim berkata kepada ayahnya dan kaumnya, “Sesungguhnya aku berlepas diri dari apa yang kamu sembah,",
      "text": "وَاِذْ قَالَ اِبْرٰهِيْمُ لِاَبِيْهِ وَقَوْمِهٖٓ اِنَّنِيْ بَرَاۤءٌ مِّمَّا تَعْبُدُوْنَۙ",
      "text_translation_en": "AND WHEN Abraham spoke to his father and his people, [he had this very truth in mind:] “Verily, far be it from me to worship what you worship!",
      "juz_number": 25
    },
    "27": {
      "text_tafsir_en": "In this verse the Prophet Ibrahim affirmed his stand after he was separated from his father and his people, that he only worshiped the God who created him and who created all mankind. He who will show the good and right way, which will bring man to the happiness of the world and the hereafter. He who provides and feeds and drinks, heals the sick. God is deadly and alive, God is expected to forgive sins in the hereafter. The affirmation of the Prophet Ibrahim is enshrined in the Qur'an as the word of God: (ie) Who created me, then He who guides me, and Who feeds and drinks me; and if I am sick, it is he who heals me, and the one who will kill me, and then will raise me up (again), and what I really desire will forgive my mistakes on the Day of Resurrection. \"",
      "text_tafsir": "Dalam ayat ini Nabi Ibrahim menegaskan pendiriannya setelah dia berlepas diri dari bapak dan kaumnya, bahwa dia hanya menyembah Allah yang menciptakannya dan yang menciptakan seluruh manusia. Dia yang akan menunjukkan jalan yang baik dan benar, yang akan membawa manusia kepada kebahagiaan dunia dan akhirat. Dia yang menyediakan dan memberi makan dan minum, menyembuhkan orang sakit. Tuhan yang mematikan dan menghidupkan, Tuhan yang diharapkan mengampuni dosa di akhirat. Penegasan Nabi Ibrahim diabadikan di dalam Al-Qur'an sebagaimana firman Allah:\n\n(yaitu) Yang telah menciptakan aku, maka Dia yang memberi petunjuk kepadaku, dan Yang memberi makan dan minum kepadaku; dan apabila aku sakit, Dialah yang menyembuhkan aku, dan Yang akan mematikan aku, kemudian akan menghidupkan aku (kembali), dan Yang sangat kuinginkan akan mengampuni kesalahanku pada hari Kiamat.\" (asy-Syura\/26: 78-82)",
      "text_translation": "kecuali (kamu menyembah) Allah yang menciptakanku; karena sungguh, Dia akan memberi petunjuk kepadaku.”",
      "text": "اِلَّا الَّذِيْ فَطَرَنِيْ فَاِنَّهٗ سَيَهْدِيْنِ ",
      "text_translation_en": "None [do I worship] but Him who has brought me into being: and, behold, it is He who will guide me!”",
      "juz_number": 25
    },
    "28": {
      "text_tafsir_en": "Allah made it clear that Abraham made the monotheistic phrase everlasting, so that the people of Mecca could realize it, abandoning the religion of their forefathers and following the monotheistic religion of their non-Abrahamic ancestors, especially if they remembered that Abraham was their pride. for building the Temple of the Qur'an of the Muslims during the prayer. The Qatadah says, \"From the descendants of Abraham there are those who worship Allah until the Day of Resurrection.\" And Ibn 'Arabi said, \"That the seed of Abraham may be hereditary, because of the two prayers which Allah has granted, first:\" Verily I have made you the leader of all mankind. \"He (Abraham) said,\" And (also) ) of my grandchildren? \"Allah said,\" (True, but) My promise is not to the wicked. \"(al-Baqarah \/ 2: 124) and secondly: And leave me and my children from idolatry. (Ibrahim \/ 14: 35)",
      "text_tafsir": "Allah menerangkan bahwa Nabi Ibrahim menjadikan kalimat tauhid itu kalimat yang kekal, agar penduduk Mekah dapat menyadarinya, lalu meninggalkan agama nenek moyangnya yang sesat dan mengikuti agama tauhid yang dianut nenek moyang mereka yang tidak sesat yaitu Ibrahim apalagi jika mereka mengingat, bahwa Nabi Ibrahimlah kebanggaan mereka karena membangun Baitullah yang menjadi kiblat umat Islam sedunia ketika mendirikan salat.\n\nQatadah berkata, \"Dari keturunan Ibrahim itu senantiasa ada yang menyembah Allah sampai hari Kiamat.\" Dan Ibnu 'Arabi berkata, \"Bahwasanya keturunan Ibrahim dapat turun-temurun beragama tauhid, karena dua doanya yang telah diperkenankan oleh Allah, pertama:\n\n\"Sesungguhnya Aku menjadikan engkau sebagai pemimpin bagi seluruh manusia.\" Dia (Ibrahim) berkata, \"Dan (juga) dari anak cucuku?\" Allah berfirman, \"(Benar, tetapi) janji-Ku tidak berlaku bagi orang-orang zalim.\" (al-Baqarah\/2: 124) \n\ndan kedua:\n\nDan jauhkanlah aku beserta anak cucuku agar tidak menyembah berhala. (Ibrahim\/14: 35)",
      "text_translation": "Dan (Ibrahim) menjadikan (kalimat tauhid) itu kalimat yang kekal pada keturunannya agar mereka kembali (kepada kalimat tauhid itu).",
      "text": "وَجَعَلَهَا كَلِمَةً ۢ بَاقِيَةً فِيْ عَقِبِهٖ لَعَلَّهُمْ يَرْجِعُوْنَۗ ",
      "text_translation_en": "And he uttered this as a word destined to endure among those who would come after him, so that they might [always] return [to it].",
      "juz_number": 25
    },
    "29": {
      "text_tafsir_en": "God explains that He has given pleasure to the Gentiles and their ancestors long ago, extending their life, giving them a variety of favors; demon and forget the words of monotheism. So Allah made from the seed of Abraham those who disbelieved in Allah, sent the disbelievers among them to believe in him, then he chose Muhammad as the Messenger and sent down the Qur'an as a book with guidance the right way, calling on them to do good deeds for the benefit and happiness of the world and the hereafter.",
      "text_tafsir": "Allah menerangkan bahwa Dia telah memberikan kenikmatan kepada orang-orang musyrik dan nenek moyang mereka sejak dahulu kala, memanjangkan umur mereka, menganugerahkan beraneka ragam nikmat, tetapi mereka itu terpesona oleh nikmat yang ada pada mereka, terpengaruh oleh kehendak hawa nafsu mereka, lalu menuruti ajakan setan dan melupakan kalimat tauhid. Maka Allah menjadikan dari keturunan Ibrahim orang-orang yang mengesakan Allah, menyuruh orang-orang kafir di antara mereka agar beriman kepada-Nya, maka dipilih-Nyalah Muhammad saw sebagai Rasul dan diturunkan-Nya Al-Qur'an sebagai kitab yang berisi petunjuk ke jalan yang benar, menyeru mereka untuk berbuat amal baik demi kemaslahatan dan kebahagiaan dunia dan akhirat.",
      "text_translation": "Bahkan Aku telah memberikan kenikmatan hidup kepada mereka dan nenek moyang mereka sampai kebenaran (Al-Qur'an) datang kepada mereka beserta seorang Rasul yang memberi penjelasan.",
      "text": "بَلْ مَتَّعْتُ هٰٓؤُلَاۤءِ وَاٰبَاۤءَهُمْ حَتّٰى جَاۤءَهُمُ الْحَقُّ وَرَسُوْلٌ مُّبِيْنٌ ",
      "text_translation_en": "Now [as for those who did come after him,] I allowed them - as [I had allowed] their forebears - to enjoy their lives freely until the truth should come unto them through an apostle who would make all things clear:",
      "juz_number": 25
    },
    "30": {
      "text_tafsir_en": "Allah explained that when delivered to them the Qur'an and miracles as proof of the truth of the Apostle, they welcomed him with a bad reception. They say that what is brought to them is magic and not revelation from God, so they deny it.",
      "text_tafsir": "Allah menerangkan bahwa ketika disampaikan kepada mereka Al-Qur'an dan mukjizat sebagai bukti kebenaran Rasul, mereka menyambutnya dengan sambutan yang tidak baik. Mereka berkata bahwa apa yang didatangkan kepada mereka adalah sihir dan bukan wahyu dari Allah, oleh karena itu mereka mengingkarinya.",
      "text_translation": "Tetapi ketika kebenaran (Al-Qur'an) itu datang kepada mereka, mereka berkata, “Ini adalah sihir dan sesungguhnya kami mengingkarinya.”",
      "text": "وَلَمَّا جَاۤءَهُمُ الْحَقُّ قَالُوْا هٰذَا سِحْرٌ وَّاِنَّا بِهٖ كٰفِرُوْنَ ",
      "text_translation_en": "but now that the truth has come to them, they say, “All this is mere spellbinding eloquence” - and, behold, we deny that there is any truth in it!”",
      "juz_number": 25
    },
    "31": {
      "text_tafsir_en": "They said, \"The position of an apostle is a noble one, so it is natural that the man who holds the office is a man of great stature, of great wealth and rank, while Muhammad saw no such. two persons possessing these things from the two noble cities are al-Walid bin al-Mugirah of Mecca or 'Urwah bin Mas'ud ats-saqafi of thaif.",
      "text_tafsir": "Mereka berkata, \"Kedudukan sebagai rasul adalah kedudukan yang mulia, maka sepantasnyalah orang yang memangku jabatan itu adalah orang yang mulia pula, mempunyai kekayaan dan kedudukan yang tinggi, sedangkan Muhammad saw tidak memiliki yang demikian itu. Yang pantas menduduki jabatan ini adalah salah satu dari dua orang yang memiliki hal-hal tersebut dari dua kota yang mulia pula yaitu al-Walid bin al-Mugirah dari Mekah atau 'Urwah bin Mas'ud ats-saqafi dari thaif.",
      "text_translation": "Dan mereka (juga) berkata, “Mengapa Al-Qur'an ini tidak diturunkan kepada orang besar (kaya dan berpengaruh) dari salah satu dua negeri ini (Mekah dan Taif)?”",
      "text": "وَقَالُوْا لَوْلَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ",
      "text_translation_en": "And they say, too, “Why was not this Qur’an bestowed from on high on some great man of the two cities?”",
      "juz_number": 25
    },
    "32": {
      "text_tafsir_en": "This verse shows the rejection of the desire of the Muslims who would not accept the appointment of Muhammad as an apostle; as if they were the most entitled and able to divide and determine who deserved God's grace. Allah declares, \"This is not the case, we are the ones who have the authority and authority over the life of the slave in the life of the world. stupid, some advanced and some behind, because if We equate among the servants in the above, there will be competition between them, or there will be no mutual support for each other, and they will not take advantage of each other, but they will scoff at one another, all of which will lead to the ruin and destruction of the world. This verse is closed with the emphasis on God's mercy and priorities give to those who are destined to take up the office of prophecy and follow the revelation of the revealed Quran, far better and more glorious than the wealth and wealth of the world they have accumulated. Thus the world with all its wealth lies on the brink of collapse and will disappear in no time.",
      "text_tafsir": "Ayat ini menunjukkan penolakan terhadap keinginan orang-orang musyrik yang tak mau menerima pengangkatan Muhammad saw sebagai rasul; seakan-akan merekalah yang paling berhak dan berwenang membagi-bagi dan menentukan siapa yang pantas menerima rahmat Tuhan. Allah menyatakan, \"Sekali-kali tidaklah demikian halnya, Kamilah yang berhak dan berwenang mengatur dan menentukan penghidupan hamba dalam kehidupan dunia. Kami-lah yang melebihkan sebagian hamba atas sebagian yang lain; ada yang kaya dan ada yang lemah, ada yang pandai dan ada yang bodoh, ada yang maju dan ada yang terbelakang, karena apabila Kami menyamakan di antara hamba di dalam hal-hal tersebut di atas, maka akan terjadi persaingan di antara mereka, atau tidak terjadi situasi saling bantu-membantu antara satu dengan yang lain, dan tidak akan terjadi saling memanfaatkan antara satu dengan yang lain, sebaliknya mereka saling mengejek. Semuanya itu akan membawa kepada kehancuran dan kerusakan dunia. Kalau mereka tidak mampu berbuat seperti tersebut di atas mengenai urusan keduniaan, mengapa mereka berani menentang berbagai kebijaksanaan Allah di dalam menentukan siapa yang pantas diserahi tugas kerasulan itu. \n\nAyat ini ditutup dengan penegasan bahwa rahmat Allah dan keutamaan yang diberikan kepada orang yang telah ditakdirkan memangku jabatan kenabian dan mengikuti petunjuk wahyu dalam Al-Qur'an yang telah diturunkan, jauh lebih baik dan mulia daripada kemewahan dan kekayaan dunia yang ditimbun mereka. Demikian dikarenakan dunia dengan segala kekayaannya itu berada di tepi jurang yang akan runtuh dan akan lenyap tidak berbekas sedikit pun.",
      "text_translation": "Apakah mereka yang membagi-bagi rahmat Tuhanmu? Kamilah yang menentukan penghidupan mereka dalam kehidupan dunia, dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain. Dan rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan.",
      "text": "اَهُمْ يَقْسِمُوْنَ رَحْمَتَ رَبِّكَۗ نَحْنُ قَسَمْنَا بَيْنَهُمْ مَّعِيْشَتَهُمْ فِى الْحَيٰوةِ الدُّنْيَاۙ وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ لِّيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا ۗوَرَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُوْنَ ",
      "text_translation_en": "But is it they who distribute thy Sustainer’s grace? [Nay, as] it is We who distribute their means of livelihood among them in the life of this world, and raise some of them by degrees above others, to the end that they might avail themselves of one another’s help - [so, too, it is We who bestow gifts of the spirit upon whomever We will]: and this thy Sustainer’s grace is better than all [the worldly wealth] that they may amass.",
      "juz_number": 25
    },
    "33": {
      "text_tafsir_en": "This verse argues that if it were not for Allah to turn all mankind into one people in disbelief as they saw the unbelievers for free provision, for thinking that the abundance of wealth was proof of God's love for them, then Allah would have given it to the people. The unbelievers were luxurious houses made of gold and silver, but God wanted their faith.",
      "text_tafsir": "Ayat ini menegaskan sekiranya bukan karena Allah hendak menghindarkan semua manusia menjadi umat yang satu dalam kekafiran akibat mereka melihat orang-orang kafir memperoleh rezeki yang lapang, karena mengira bahwa harta yang banyak adalah bukti cinta Allah kepada mereka, maka akan Allah berikan kepada orang-orang kafir itu rumah-rumah mewah yang terbuat dari emas dan perak, tetapi Allah menghendaki keimanan mereka.",
      "text_translation": "Dan sekiranya bukan karena menghindarkan manusia menjadi umat yang satu (dalam kekafiran), pastilah sudah Kami buatkan bagi orang-orang yang kafir kepada (Allah) Yang Maha Pengasih, loteng-loteng rumah mereka dari perak, demikian pula tangga-tangga yang mereka naiki,",
      "text": "وَلَوْلَآ اَنْ يَّكُوْنَ النَّاسُ اُمَّةً وَّاحِدَةً لَّجَعَلْنَا لِمَنْ يَّكْفُرُ بِالرَّحْمٰنِ لِبُيُوْتِهِمْ سُقُفًا مِّنْ فِضَّةٍ وَّمَعَارِجَ عَلَيْهَا يَظْهَرُوْنَۙ ",
      "text_translation_en": "And were it not that [with the prospect of boundless riches before them] all people would become one [evil] community, We might indeed have provided for those who [now] deny the Most Gracious roofs of silver for their houses, and [silver] stairways whereon to ascend,",
      "juz_number": 25
    },
    "34": {
      "text_tafsir_en": "So also are the doors of the house of the unbelievers, and their beds made of silver. They are all jewelery that human beings are proud of; they are but temporary pleasures of worldly life, and can only last for a moment and then disappear, while the hereafter is full of countless pleasures and pleasures and immortality prepared for those who fear God, who disobeyed Him, who did no evil by breaking His commandments, but obeying and obeying His commands. The Word of God: While you (the disbelievers) choose the life of the world, it is better and eternal. (al-A'la \/ 87: 16-17)",
      "text_tafsir": "Begitu juga pintu-pintu rumah orang-orang kafir, dan tempat tidur yang mereka tiduri akan dijadikan dari perak. Semua itu adalah perhiasan tempat manusia berbangga-bangga; semua itu hanya merupakan kesenangan kehidupan dunia yang sifatnya sementara, dan hanya dapat bertahan beberapa saat saja lalu hilang lenyap, sedangkan kehidupan akhirat yang penuh dengan kesenangan dan kenikmatan yang beraneka ragam dan tak terhitung banyaknya serta kekal abadi telah dipersiapkan untuk orang yang bertakwa kepada Allah, yang tidak menyekutukan-Nya, yang tidak berbuat maksiat dengan melanggar perintah-Nya, tetapi taat dan patuh melaksanakan perintah-Nya. Firman Allah:\n\nSedangkan kamu (orang-orang kafir) memilih kehidupan dunia, padahal kehidupan akhirat itu lebih baik dan lebih kekal. (al-A'la\/87: 16-17)",
      "text_translation": "dan (Kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka, dan (begitu pula) dipan-dipan tempat mereka bersandar,  ",
      "text": "وَلِبُيُوْتِهِمْ اَبْوَابًا وَّسُرُرًا عَلَيْهَا يَتَّكِـُٔوْنَۙ ",
      "text_translation_en": "and [silver] doors for their houses, and [silver] couches whereon to recline,",
      "juz_number": 25
    },
    "35": {
      "text_tafsir_en": "So also are the doors of the house of the unbelievers, and their beds made of silver. They are all jewelery that human beings are proud of; they are but temporary pleasures of worldly life, and can only last for a moment and then disappear, while the hereafter is full of countless pleasures and pleasures and immortality prepared for those who fear God, who disobeyed Him, who did no evil by breaking His commandments, but obeying and obeying His commands. The Word of God: While you (the disbelievers) choose the life of the world, it is better and eternal. (al-A'la \/ 87: 16-17)",
      "text_tafsir": "Begitu juga pintu-pintu rumah orang-orang kafir, dan tempat tidur yang mereka tiduri akan dijadikan dari perak. Semua itu adalah perhiasan tempat manusia berbangga-bangga; semua itu hanya merupakan kesenangan kehidupan dunia yang sifatnya sementara, dan hanya dapat bertahan beberapa saat saja lalu hilang lenyap, sedangkan kehidupan akhirat yang penuh dengan kesenangan dan kenikmatan yang beraneka ragam dan tak terhitung banyaknya serta kekal abadi telah dipersiapkan untuk orang yang bertakwa kepada Allah, yang tidak menyekutukan-Nya, yang tidak berbuat maksiat dengan melanggar perintah-Nya, tetapi taat dan patuh melaksanakan perintah-Nya. Firman Allah:\n\nSedangkan kamu (orang-orang kafir) memilih kehidupan dunia, padahal kehidupan akhirat itu lebih baik dan lebih kekal. (al-A'la\/87: 16-17)",
      "text_translation": "dan (Kami buatkan pula) perhiasan-perhiasan dari emas. Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia, sedangkan kehidupan akhirat di sisi Tuhanmu disediakan bagi orang-orang yang bertakwa.",
      "text": "وَزُخْرُفًاۗ وَاِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَيٰوةِ الدُّنْيَا ۗوَالْاٰخِرَةُ عِنْدَ رَبِّكَ لِلْمُتَّقِيْنَ ࣖ ",
      "text_translation_en": "and gold [beyond count]. Yet all this would have been nothing but a [brief] enjoyment of life in this world - whereas [happiness in] the life to come awaits the God-conscious with thy Sustainer.",
      "juz_number": 25
    },
    "36": {
      "text_tafsir_en": "In this verse it is pointed out that whoever turns away from the warnings and teachings of God, which blinds his heart to faith and believes his teachings contained in the Qur'an, then the devil will always accompany him and will always be able to bring him to error, so that Allah will eventually make the demon his friend. According to az-Zajjaj, the purpose of this verse is that whoever turns away from the Qur'an and refuses to follow the instructions therein, the devil will continue to tempt him until he falls into the wrong path, therefore he will surely get the torment of Allah. In a hadith, the Messenger of Allah (may peace be upon him) said: The Messenger of Allah (may peace be upon him) said, \"None of you is to be accompanied by a companion of the jinn.\" (Muslim History) In another verse Allah says that those who disregard Allah's words, their hearts and their minds will be turned back by Allah so that they will not believe and remain in their error: And (so) We turn our hearts and their sight was as if they had not first believed in him (the Qur'an), and We left them in confusion. (al-An'am \/ 6: 110) A perverted man will sin, and the more he goes astray, the more he will hide himself from the faith and do good, as the Messenger of Allah (may peace be upon him) said: The Messenger of Allah (may peace be upon him) said: sinning has a black spot in his heart, if he repents and forsakes and begs for forgiveness in return for his sin. But if his sin increases, then the black dot increases to cover his heart. \" (Ahmad's History",
      "text_tafsir": "Dalam ayat ini ditegaskan bahwa siapa yang berpaling dari peringatan dan pengajaran Allah, yaitu membutakan hatinya untuk beriman dan mempercayai ajaran-ajaran-Nya yang terdapat dalam Al-Qur'an, maka setan akan selalu menemaninya dan akan selalu berupaya membawanya kepada kesesatan, sehingga Allah akhirnya akan menjadikan setan itu menjadi teman setianya. \n\nMenurut az-Zajjaj, maksud ayat ini adalah bahwa siapa yang berpaling dari Al-Qur'an dan tidak mau mengikuti petunjuk-petunjuk yang terdapat di dalamnya, setan akan terus-menerus menggodanya sampai ia terjerumus ke jalan yang sesat, karena itu ia pasti akan mendapat siksaan Allah. Dalam sebuah hadis Rasulullah saw bersabda:\n\nRasulullah saw bersabda, \"Tidaklah ada salah seorang dari kalian melainkan didampingi oleh pendamping dari golongan jin.\" (Riwayat Muslim)\n\nDi dalam ayat lain Allah berfirman bahwa orang yang selalu mengingkari ayat-ayat Allah, maka hati dan pandangan mereka akan dibolak-balik oleh Allah sehingga mereka tidak jadi beriman dan tetap dalam kesesatan mereka:\n\nDan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti pertama kali mereka tidak beriman kepadanya (Al-Qur'an), dan Kami biarkan mereka bingung dalam kesesatan. (al-An'am\/6: 110)\n\nManusia yang sesat akan berbuat dosa, lalu semakin ia bergelimang dosa, semakin tertutup hatinya sehingga tidak mungkin lagi beriman dan berbuat baik, sebagaimana sabda Rasulullah saw: \n\nRasulullah saw bersabda, \"Sesungguhnya seorang mukmin jika berbuat dosa niscaya ada titik hitam di dalam hatinya, jika ia bertobat dan meninggalkan dan memohon ampun niscaya hatinya kembali bersih. Namun jika dosanya bertambah, niscaya bertambah titik hitam tersebut sehingga meliputi hatinya.\" (Riwayat Ahmad)",
      "text_translation": "Dan barangsiapa berpaling dari pengajaran Allah Yang Maha Pengasih   (Al-Qur'an), Kami biarkan setan (menyesatkannya) dan menjadi teman karibnya.",
      "text": "وَمَنْ يَّعْشُ عَنْ ذِكْرِ الرَّحْمٰنِ نُقَيِّضْ لَهٗ شَيْطٰنًا فَهُوَ لَهٗ قَرِيْنٌ ",
      "text_translation_en": "But as for anyone who chooses to remain blind to the remembrance of the Most Gracious, to him We assign an [enduring] evil impulse, to become his other self:",
      "juz_number": 25
    },
    "37": {
      "text_tafsir_en": "In this verse the consequences of making Satan a friend are explained, namely that the devil will always try to prevent them from finding the right path, which is to believe in the teachings of God contained in the Qur'an. They finally did not find the right path, but felt that the misguided path they were taking was true, and the truth of the verses of the Qur'an delivered to them were wrong. Such is the power of Satan over that person.",
      "text_tafsir": "Dalam ayat ini diterangkan konsekuensi menjadikan setan sebagai teman, yaitu bahwa setan itu akan selalu berupaya menghalangi mereka untuk menemukan jalan yang benar, yaitu mengimani ajaran-ajaran Allah yang terdapat di dalam Al-Qur'an. Mereka akhirnya memang tidak menemukan jalan yang benar itu, tetapi merasa bahwa jalan sesat yang mereka tempuh adalah benar, dan kebenaran ayat-ayat Al-Qur'an yang disampaikan kepada mereka adalah salah. Begitulah hebatnya kekuasaan setan atas diri orang itu.",
      "text_translation": "Dan sungguh, mereka (setan-setan itu) benar-benar menghalang-halangi mereka dari jalan yang benar, sedang mereka menyangka bahwa mereka mendapat petunjuk.",
      "text": "وَاِنَّهُمْ لَيَصُدُّوْنَهُمْ عَنِ السَّبِيْلِ وَيَحْسَبُوْنَ اَنَّهُمْ مُّهْتَدُوْنَ ",
      "text_translation_en": "whereupon, behold, these [evil impulses] bar all such from the path [of truth], making them think that they are guided aright!",
      "juz_number": 25
    },
    "38": {
      "text_tafsir_en": "In this verse it describes the fate of human beings who are friendly to the devil in the hereafter before God. It was then that the man realized that he had been misled by the demons. Before God he regretted why he was so close to those demons while on earth. He regrets why their time in the world before them with the devil was not as far apart as the east and the west, such as between one end and the other. But regret is useless, as the world has rolled over and will never be returned. In the afterlife demons who have been their loyal friends while on earth will leave them. In the presence of Allah the devils disbelieved and lost their hands, as stated in Surah Ibrahim \/ 14:22. I have no power over you, except I call upon you and you obey my voice, therefore do not despise me, but try yourself, I cannot help you, and you cannot help me. justify your actions in fellowship with me (with Allah) from the beginning. \" Truly, the unjust will receive a painful torment. (Abraham \/ 22: 22) Thus, demons are clearly the worst friends: in the world they are seducing, but in the hereafter they open their hands and even torment humans.",
      "text_tafsir": "Dalam ayat ini diterangkan nasib manusia yang bersahabat dengan setan itu di hari akhirat ketika menghadap Allah. Di saat itulah orang itu baru menyadari bahwa ia telah disesatkan oleh setan-setan itu. Di hadapan Allah ia menyesali mengapa ia terlalu dekat dengan setan-setan itu sewaktu di dunia. Ia menyesal mengapa waktu di dunia dulu mereka dengan setan itu tidak berjauhan sebagaimana jauhnya timur dan barat, yaitu seperti antara satu ujung dengan ujung yang lainnya. Tetapi penyesalan itu tidak berguna, karena dunia sudah digulung dan tidak akan mungkin dikembalikan lagi. \n\nDi akhirat setan-setan yang menjadi teman-teman setia mereka waktu di dunia akan meninggalkan mereka. Di depan Allah setan-setan itu mengingkari persahabatan dan berlepas tangan, sebagaimana diinformasikan dalam Surah Ibrahim\/14: 22.\n\nDan setan berkata ketika perkara (hisab) telah diselesaikan, \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan aku pun telah menjanjikan kepadamu tetapi aku menyalahinya. Tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri. Aku tidak dapat menolongmu, dan kamu pun tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.\" Sungguh, orang yang zalim akan mendapat siksaan yang pedih. (Ibrahim\/14: 22)\n\nDemikianlah, setan-setan jelas merupakan teman yang paling jahat: di dunia mereka merayu, tetapi di akhirat mereka berlepas tangan bahkan menjerumuskan manusia.",
      "text_translation": "Sehingga apabila orang–orang yang berpaling itu datang kepada Kami (pada hari Kiamat) dia berkata, “Wahai! Sekiranya (jarak) antara aku dan kamu seperti jarak antara timur dan barat! Memang (setan itu) teman yang paling jahat (bagi manusia).”",
      "text": "حَتّٰىٓ اِذَا جَاۤءَنَا قَالَ يٰلَيْتَ بَيْنِيْ وَبَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِيْنُ",
      "text_translation_en": "But in the end, when he [who has thus sinned] appears before us [on Judgment Day], he will say [to his other self], “Would that between me and thee there had been the distance of east and west!” for, evil indeed [has proved] that other self!",
      "juz_number": 25
    },
    "39": {
      "text_tafsir_en": "Furthermore, Allah made it clear to them that whatever their regrets and whatever reasons they would not be accepted. That is because they have persecuted, that is not to believe in Him and not carry out His commands. They will eventually be thrown into hell with their friends' demons.",
      "text_tafsir": "Selanjutnya Allah menegaskan kepada mereka bahwa bagaimana pun penyesalan mereka dan apa pun alasan mereka tidak akan diterima. Hal itu karena mereka telah berbuat aniaya, yaitu tidak mengimani-Nya dan tidak menjalankan perintah-perintah-Nya. Mereka akhirnya akan dijebloskan ke dalam neraka bersama setan-setan teman-teman mereka itu.",
      "text_translation": "Dan (harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu pada hari itu karena kamu telah menzalimi (dirimu sendiri). Sesungguhnya kamu pantas bersama-sama dalam azab itu.",
      "text": "وَلَنْ يَّنْفَعَكُمُ الْيَوْمَ اِذْ ظَّلَمْتُمْ اَنَّكُمْ فِى الْعَذَابِ مُشْتَرِكُوْنَ ",
      "text_translation_en": "On that Day it will not profit you in the least [to know] that, since you have sinned [together], you are now to share your suffering [as well].",
      "juz_number": 25
    },
    "40": {
      "text_tafsir_en": "In this verse Allah asks the Prophet Muhammad who always wanted the unbelievers to believe, whether he could make the deaf hear the call to believe and do good, and whether he could open the hearts of those whose eyes were closed. Of course the Prophet saw. will not be able to do so, for God is the only one who can do it, but Allah will not return those who are lost if they themselves are not willing to return to the right path. The question of Allah swt to the Prophet Muhammad was not for the purpose of asking, but rather to assert that their inner ear and eyes were deaf and blind, therefore they would not accept any truth they were told. Therefore his duty as an apostle is only to convey. In delivering the word of Allah to the disbelievers of Mecca, the Prophet (saws) carried it with all his might and effort, but some opposed it. The Prophet and his people were boycotted, even threatened with death. In order to save the Prophet, he ordered his followers to migrate, first to Abessinia, and second to Medinah. Such resistance and threats sometimes made the Prophet's heart broken. frustrated and almost desperate. But by dropping verses like this, his heart was comforted again. He knew he was innocent, but they were the ones who closed his heart. The only one who can open it is God, so he no longer despises, but continues to preach, hoping that someday God will send his guidance to them. In another verse God says about the guidance given by Allah: It is not your (Muhammad's) duty to guide them, but it is Allah who guides whom He wills. (al-Baqarah \/ 2: 272)",
      "text_tafsir": "Pada ayat ini Allah bertanya kepada Nabi Muhammad saw yang selalu ingin agar orang-orang kafir itu beriman, apakah ia mampu membuat orang yang tuli mendengar ajakan untuk beriman dan berbuat baik, dan apakah ia mampu membuka hati orang yang telah tertutup mata hatinya. Tentu saja Nabi saw. tidak akan mampu, karena yang mampu melakukannya hanyalah Allah, sedangkan Allah tidak akan mengembalikan mereka yang sesat itu bila mereka sendiri tidak bersedia kembali kepada jalan yang benar. \n\nPertanyaan Allah swt kepada Nabi Muhammad saw itu bukanlah untuk maksud bertanya, tetapi justru untuk menegaskan bahwa telinga dan mata batin mereka sebenarnya sudah tuli dan buta, karena itu kebenaran apa pun yang disampaikan kepada mereka tidak akan mereka terima. Oleh karena itu tugas beliau sebagai seorang rasul hanya menyampaikan. Dalam menyampaikan firman-firman Allah kepada kaum kafir Mekah itu, Nabi saw telah melaksanakannya dengan segenap tenaga dan upaya, namun sebagian mereka menentangnya. Nabi saw dan umatnya diboikot, bahkan diancam akan dibunuh. Untuk menyelamatkan diri Nabi saw memerintahkan pengikut-pengikutnya untuk berhijrah, pertama ke Abessinia, dan kedua ke Medinah. Penentangan dan ancaman itu kadang-kadang membuat hati Nabi saw. kecewa dan hampir-hampir putus asa. Namun dengan turunnya ayat-ayat seperti ayat ini, hati beliau terhibur kembali. Beliau sadar bahwa ia tidak bersalah, tetapi merekalah yang tertutup hatinya. Yang mampu membukanya hanyalah Allah, karena itu beliau tidak lagi berputus asa, tetapi terus berdakwah, dengan harapan pada suatu saat Allah akan menurunkan hidayah-Nya kepada mereka.\n\nDi dalam ayat lain Allah berfirman mengenai pemberian hidayah yang merupakan wewenang Allah itu:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah\/2: 272)",
      "text_translation": "Maka apakah engkau (Muhammad) dapat menjadikan orang yang tuli bisa mendengar, atau (dapatkah) engkau memberi petunjuk kepada orang yang buta (hatinya) dan kepada orang yang tetap dalam kesesatan yang nyata?",
      "text": "اَفَاَنْتَ تُسْمِعُ الصُّمَّ اَوْ تَهْدِى الْعُمْيَ وَمَنْ كَانَ فِيْ ضَلٰلٍ مُّبِيْنٍ ",
      "text_translation_en": "CANST THOU, perchance, [O Muhammad,] make the deaf hear, or show the right way to the blind or to such as are obviously lost in error?",
      "juz_number": 25
    },
    "41": {
      "text_tafsir_en": "In these two verses it is explained that the Prophet saw did not have to worry too much about the opposition of the Meccans. They will surely be punished by Allah at His will. The possibility of punishment is twofold. First, Allah will punish them after the Prophet's death; thus he could not witness the world on his own. Secondly, the punishment of those who disbelieved was carried out by God today, even when the Prophet was alive. The evidence of such punishment is that, according to some scholars, the massacre of Meccans in the Battle of Badr was killed. This is God's threat to the unbelievers. The statement reaffirmed the Prophet's heart that those who opposed him were indeed blinded by his heart because it needed to be taken more seriously.",
      "text_tafsir": "Di dalam dua ayat ini dijelaskan bahwa Nabi saw tidak perlu terlalu merisaukan penentangan orang-orang musyrikin Mekah. Mereka pasti akan dihukum oleh Allah pada saat yang dikehendaki-Nya. Kemungkinan hukuman itu dalam dua cara. Pertama, Allah akan menghukum mereka setelah Nabi saw meninggal; dengan demikian hukuman itu tidak sempat beliau saksikan sendiri di dunia. Kedua, hukuman terhadap orang-orang yang kafir itu dilaksanakan Allah sekarang juga yaitu pada saat Nabi saw masih hidup. Bukti hukuman seperti itu adalah, menurut sebagian ulama, terbunuhnya banyak pemimpin kaum kafir Mekah pada Perang Badar. Demikianlah ancaman Allah terhadap kaum kafir itu. Pernyataan itu kembali menguatkan hati Nabi saw bahwa mereka yang menentang itu memang betul-betul membutakan mata hatinya karena itu perlu didakwahi lebih intensif lagi.",
      "text_translation": "Maka sungguh, sekiranya Kami mewafatkanmu (sebelum engkau mencapai kemenangan), maka sesungguhnya Kami akan tetap memberikan azab kepada mereka (di akhirat),",
      "text": "فَاِمَّا نَذْهَبَنَّ بِكَ فَاِنَّا مِنْهُمْ مُّنْتَقِمُوْنَۙ ",
      "text_translation_en": "But whether We do [or do not] take thee away [ere thy message prevails] - verily, We shall inflict Our retribution on them;",
      "juz_number": 25
    },
    "42": {
      "text_tafsir_en": "In these two verses it is explained that the Prophet saw did not have to worry too much about the opposition of the Meccans. They will surely be punished by Allah at His will. The possibility of punishment is twofold. First, Allah will punish them after the Prophet's death; thus he could not witness the world on his own. Secondly, the punishment of those who disbelieved was carried out by God today, even when the Prophet was alive. The evidence of such punishment is that, according to some scholars, the massacre of Meccans in the Battle of Badr was killed. This is God's threat to the unbelievers. The statement reaffirmed the Prophet's heart that those who opposed him were indeed blinded by his heart because it needed to be taken more seriously.",
      "text_tafsir": "Di dalam dua ayat ini dijelaskan bahwa Nabi saw tidak perlu terlalu merisaukan penentangan orang-orang musyrikin Mekah. Mereka pasti akan dihukum oleh Allah pada saat yang dikehendaki-Nya. Kemungkinan hukuman itu dalam dua cara. Pertama, Allah akan menghukum mereka setelah Nabi saw meninggal; dengan demikian hukuman itu tidak sempat beliau saksikan sendiri di dunia. Kedua, hukuman terhadap orang-orang yang kafir itu dilaksanakan Allah sekarang juga yaitu pada saat Nabi saw masih hidup. Bukti hukuman seperti itu adalah, menurut sebagian ulama, terbunuhnya banyak pemimpin kaum kafir Mekah pada Perang Badar. Demikianlah ancaman Allah terhadap kaum kafir itu. Pernyataan itu kembali menguatkan hati Nabi saw bahwa mereka yang menentang itu memang betul-betul membutakan mata hatinya karena itu perlu didakwahi lebih intensif lagi.",
      "text_translation": "atau Kami perlihatkan kepadamu (azab) yang telah Kami ancamkan kepada mereka. Maka sungguh, Kami berkuasa atas mereka.",
      "text": "اَوْ نُرِيَنَّكَ الَّذِيْ وَعَدْنٰهُمْ فَاِنَّا عَلَيْهِمْ مُّقْتَدِرُوْنَ ",
      "text_translation_en": "and whether We show thee [or do not show thee in this world] the fulfillment of what We have promised them - verily, We have full power over them!",
      "juz_number": 25
    },
    "43": {
      "text_tafsir_en": "In this verse the Prophet (saws) asked Allah to hold fast to the Qur'an, which is to increase his faith in him and to more fully convey the teachings of Allah therein. That is because the teachings contained in the Bible are absolutely true and guarantee the happiness of human life in this world and the hereafter. For those who persist in opposition, Allah will determine their punishment.",
      "text_tafsir": "Pada ayat ini Nabi saw diminta Allah untuk berpegang teguh pada Al-Qur'an, yaitu lebih meningkatkan iman kepadanya dan lebih giat menyampaikan ajaran-ajaran Allah di dalamnya. Hal itu karena ajaran-ajaran yang terdapat di dalam Kitab itu mutlak benar dan menjamin kebahagiaan hidup manusia di dunia dan akhirat. Sedangkan bagi mereka yang tetap membangkang tentu Allah akan menentukan hukuman buat mereka.",
      "text_translation": "Maka berpegang teguhlah engkau kepada (agama) yang telah diwahyukan kepadamu. Sungguh, engkau berada di jalan yang lurus.",
      "text": "فَاسْتَمْسِكْ بِالَّذِيْٓ اُوْحِيَ اِلَيْكَ ۚاِنَّكَ عَلٰى صِرَاطٍ مُّسْتَقِيْمٍ ",
      "text_translation_en": "So hold fast to all that has been revealed to thee: for, behold, thou art on a straight way;",
      "juz_number": 25
    },
    "44": {
      "text_tafsir_en": "Allah emphasized that the descent of the Qur'an was indeed a glory to the Prophet and his people, the Quraysh in particular and the Arabs in general. That's because the Qur'an is revealed in their language. Thus the Arabs, especially the Quraysh, were of the highest understanding, so they should be the first to believe in it and apply its teachings. In another verse Allah declares the Qur'an as the honor bestowed upon them: Indeed, We have sent unto you a Book (Qur'an) in which is a warning to you. Then don't you understand? (al-Anbiya '\/ 21: 10) Furthermore, the Meccanic Muslims should take the lead in spreading the teachings found in the Qur'an. For that they will all be asked for their responsibility. If they do not believe in it, do not practice it, and do not distribute it, then their position will be replaced by other nations, as Allah has said: Remember, you are the ones who are invited to invest in your way. So there are some of you who think, and whoever thinks, he cares about himself. And Allah is the Almighty, and you are the One who needs it. And if you turn (from the right path) He will replace (you) with the rest of the people, and they will not be like you. (Muhammad \/ 47: 38) Since the Qur'an was revealed in Arabic, Muslims who are not Arab and do not speak Arabic have to learn Arabic in order to understand the teachings of the Qur'an by Yes. Among them there is a need to absorb the teachings contained in them, to apply them, and to proclaim them. When they did so, they ranked in the highest rank with the Quraysh endowed as the first people to accept Islam and spread it to other nations. They are scholars. Thus on the shoulders of the scholars there is a great responsibility and they will also be asked for the responsibility later on by Allah swt.",
      "text_tafsir": "Allah menegaskan bahwa turunnya Al-Qur'an itu sesungguhnya adalah kemuliaan bagi Nabi saw dan kaumnya, yaitu suku Quraisy pada khususnya dan bangsa Arab pada umumnya. Hal itu karena Al-Qur'an itu diturunkan dalam bahasa mereka. Dengan begitu bangsa Arab, khususnya suku Quraisy, tentu yang paling paham maknanya, karena itu seharusnya mereka menjadi yang pertama dalam mengimaninya dan melaksanakan ajaran-ajaran yang terdapat di dalamnya. Dalam ayat lain Allah menyatakan Al-Qur'an sebagai kehormatan yang telah diberikan kepada mereka:\n\nSungguh, telah Kami turunkan kepadamu sebuah Kitab (Al-Qur'an) yang di dalamnya terdapat peringatan bagimu. Maka apakah kamu tidak mengerti? (al-Anbiya'\/21: 10)\n\nSelanjutnya, orang-orang musyrikin Mekah seharusnya menjadi pelopor dalam menyebarkan ajaran-ajaran yang terdapat dalam Al-Qur'an. Untuk itu semua mereka akan diminta pertanggungjawabannya. Bila mereka tidak mengimaninya, tidak menjalankannya, dan tidak menyebarluaskannya, maka kedudukan mereka akan digantikan oleh kaum-kaum lain, sebagaimana difirmankan Allah:\n\nIngatlah, kamu adalah orang-orang yang diajak untuk menginfakkan (hartamu) di jalan Allah. Lalu di antara kamu ada orang yang kikir, dan barangsiapa kikir maka sesungguhnya dia kikir terhadap dirinya sendiri. Dan Allah-lah Yang Mahakaya dan kamulah yang membutuhkan (karunia-Nya). Dan jika kamu berpaling (dari jalan yang benar) Dia akan menggantikan (kamu) dengan kaum yang lain, dan mereka tidak akan (durhaka) seperti kamu (ini). (Muhammad\/47: 38)\n\nKarena Al-Qur'an diturunkan dalam bahasa Arab, kaum muslimin yang bukan bangsa Arab dan tidak berbahasa Arab berarti perlu belajar bahasa Arab supaya dapat memahami ajaran-ajaran yang terdapat di dalam Al-Qur'an itu dengan baik. Di antara mereka perlu ada yang mendalami ajaran-ajaran yang terdapat di dalamnya, melaksanakannya, dan mendakwahkannya. Bila mereka melakukan yang demikian itu, maka kedudukan mereka setingkat dengan suku Quraisy yang dianugerahi kemulian sebagai umat pertama yang menerima Islam dan menyebarluaskannya kepada bangsa-bangsa lain. Mereka adalah para ulama. Dengan demikian di pundak para ulama terletak tanggung jawab besar dan mereka juga akan diminta pertanggungjawaban nanti di akhirat oleh Allah swt.",
      "text_translation": "Dan sungguh, Al-Qur'an itu benar-benar suatu peringatan bagimu dan bagi kaummu, dan kelak kamu akan diminta pertanggungjawaban.",
      "text": "وَاِنَّهٗ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ ۚوَسَوْفَ تُسْٔـَلُوْنَ ",
      "text_translation_en": "and, verily, this [revelation] shall indeed become [a source of] eminence for thee and thy people: but in time you all will be called to account [for what you have done with it].",
      "juz_number": 25
    },
    "45": {
      "text_tafsir_en": "This verse contains contempt for the disbelievers of Mecca who still do not believe and still worship idols. The reproof was directed at them because the Qur'an came down in their language, where they should understand it and believe it first. That is why Allah asked Prophet Muhammad to ask the former apostles, has Allah ever made worship besides Him? The order for the Prophet to ask the ancient prophets, in the opinion of some scholars, occurred at the time of the Prophet saw 'Isra'im. Some argue that the question of the apostles was done by examining the contents of the ancient scriptures, the Torah and the Gospel. The prophets will surely answer that they have never witnessed the existence of God other than God. Thus Allah's command to the Prophet Muhammad to ask the ancient prophets was not to ask ignorance, but to ask to show that the Quraysh worshipers were mistaken because it had never been taught in the previous religions. That's why they should believe.",
      "text_tafsir": "Ayat ini mengandung celaan terhadap kaum kafir Mekah yang masih belum mau beriman dan masih tetap menyembah berhala-berhala. Celaan itu ditujukan kepada mereka karena Al-Qur'an turun dalam bahasa mereka, dimana merekalah seharusnya yang lebih memahaminya dan mengimaninya terlebih dahulu.\n\nUntuk itulah Allah meminta Nabi Muhammad bertanya kepada rasul-rasul terdahulu, pernahkah Allah menjadikan sembahan selain-Nya. Perintah agar Nabi saw bertanya kepada nabi-nabi terdahulu itu, menurut pendapat sebagian ulama, terjadi pada waktu Nabi saw melakukan Isra' Mi'raj. Ada pula yang berpendapat bahwa pertanyaan kepada rasul-rasul itu dilakukan dengan memeriksa isi kitab-kitab suci terdahulu, yaitu Taurat dan Injil. Para nabi itu pasti akan menjawab bahwa mereka tidak pernah menyaksikan adanya Tuhan selain Allah. Dengan demikian perintah Allah kepada Nabi Muhammad untuk bertanya kepada nabi-nabi terdahulu itu bukanlah bertanya karena tidak tahu, tetapi bertanya untuk menunjukkan bahwa kaum Quraisy yang menyembah berhala-berhala itu keliru karena hal itu tidak pernah diajarkan dalam agama-agama terdahulu. Oleh sebab itu mereka seharusnya beriman.",
      "text_translation": "Dan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, “Apakah Kami menentukan tuhan-tuhan selain (Allah) Yang Maha Pengasih untuk disembah?”",
      "text": "وَسْٔـَلْ مَنْ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رُّسُلِنَآ  ۖ اَجَعَلْنَا مِنْ دُوْنِ الرَّحْمٰنِ اٰلِهَةً يُّعْبَدُوْنَ ࣖ",
      "text_translation_en": "Yet [above all else,] ask any of Our apostles whom We sent forth before thy time whether We have ever allowed that deities other than the Most Gracious be worshipped!",
      "juz_number": 25
    },
    "46": {
      "text_tafsir_en": "In this verse it is explained that God sent Moses to Pharaoh and his people to convey the teachings of God. Moses was sent to Pharaoh with some miracles, such as a snake stick, a shining hand, and so on. The essence of Moses' call to Pharaoh was that Pharaoh should acknowledge God as the creator and protector of the whole world, and acknowledge it as His messenger. The affirmation of Moses also contains the affirmation of the Prophet Muhammad. The unbelievers of Mecca should also believe in Allah Almighty as the One True God, believe in Muhammad as His Messenger and believe in his greatest miracle, the Qur'an. The assertion further implies that the religion that Muhammad claimed was the same as that of Moses and all the prophets, namely Islam. Allah says: The religion of Allah is Islam. (Ali 'Imran \/ 3: 19)",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa Allah telah mengutus Nabi Musa kepada Fir'aun dan rakyatnya untuk menyampaikan ajaran-ajaran Allah. Nabi Musa diutus kepada Fir'aun dengan dilengkapi beberapa mukjizat, misalnya tongkat menjadi ular, tangan yang bercahaya, dan sebagainya. Inti seruan Nabi Musa kepada Fir'aun adalah agar Fir'aun mengakui Allah sebagai Tuhan yang menciptakan dan memelihara seluruh alam ini, dan mengakuinya sebagai utusan-Nya.\n\nPenegasan berkenaan dengan Nabi Musa itu mengandung pula penegasan mengenai Nabi Muhammad saw. Kaum kafir Mekah hendaknya juga mengimani Allah swt sebagai Tuhan Yang Maha Esa, mengimani Muhammad saw sebagai Rasul-Nya dan mengimani mukjizatnya yang utama yaitu Al-Qur'an. Selanjutnya penegasan itu mengandung arti bahwa agama yang diserukan Nabi Muhammad sama dengan yang diserukan Nabi Musa dan seluruh nabi, yaitu Islam. Allah berfirman: \n\nSesungguhnya agama di sisi Allah ialah Islam. (Ali 'Imran\/3:19)",
      "text_translation": "Dan sungguh, Kami telah mengutus Musa dengan membawa mukjizat-mukjizat Kami kepada Fir’aun dan pemuka-pemuka kaumnya. Maka dia (Musa) berkata, “Sesungguhnya aku adalah utusan dari Tuhan seluruh alam.”",
      "text": "وَلَقَدْ اَرْسَلْنَا مُوْسٰى بِاٰيٰتِنَآ اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖ فَقَالَ اِنِّيْ رَسُوْلُ رَبِّ الْعٰلَمِيْنَ ",
      "text_translation_en": "THUS, INDEED, have We sent Moses with Our messages unto Pharaoh and his great ones; and he said: “Behold, I am an apostle of the Sustainer of all the worlds!”",
      "juz_number": 25
    },
    "47": {
      "text_tafsir_en": "This verse describes the attitude of Pharaoh and his people to Moses' call. They asked Moses to present his proofs, and then Moses performed his miracles, among them sticks of snakes, shining hands, and so forth. But they made fun of him and made fun of him. Prophet Muhammad was treated thus by the infidels of Mecca. They accused him of witchcraft and falsehood (shad \/ 38: 4), and accused the Qur'an of being a dream, a fabrication, or a composition of the Prophet Muhammad. (al-Anbiya '\/ 21: 5). What is conveyed in this verse eases the inner pressure that the Prophet saw as a result of the harsh opposition of the unbelievers of Mecca. From the contents of this verse the Prophet saw learned that it was customary for a prophet to be opposed by his people, therefore opposed not only him, but the whole prophet. He had to be patient and steadfast in facing every challenge, just as Moses was patient and steadfast in facing Pharaoh and his people, so that he could win. Similarly, the Prophet Muhammad, if patient and steadfast, would gain victory over the Meccans in this world too, which was later proved by the destruction of the Meccans in the Badr War.",
      "text_tafsir": "Ayat ini menerangkan sikap Fir'aun dan kaumnya terhadap seruan Nabi Musa. Mereka meminta Nabi Musa menyampaikan bukti-bukti kerasulannya, lalu Nabi Musa menyampaikan mukjizat-mukjizatnya, di antaranya tongkat menjadi ular, tangan bercahaya, dan lain-lain. Tetapi mereka menertawakannya dan mengejeknya. Nabi Muhammad pun diperlakukan demikian oleh kaum kafir Mekah. Mereka menuduhnya pesihir dan pembohong (shad\/38: 4), dan menuduh Al-Qur'an itu mimpi, rekayasa, atau syair gubahan Nabi Muhammad saw. (al-Anbiya'\/21: 5).\n\nApa yang disampaikan dalam ayat ini meringankan tekanan batin yang diderita Nabi saw akibat penentangan yang keras dari kaum kafir Mekah. Dari isi ayat itu Nabi saw memperoleh pelajaran bahwa sudah menjadi kebiasaan seorang nabi ditentang oleh kaumnya, karena itu yang ditentang bukan hanya dia, tetapi seluruh nabi. Ia harus sabar dan tabah menghadapi segala tantangan, sebagaimana Nabi Musa sabar dan tabah menghadapi Fir'aun dan balatentaranya, sehingga ia memperoleh kemenangan. Begitu pula Nabi Muhammad saw, bila sabar dan tabah, maka ia juga akan memperoleh kemenangan atas kaum kafir Mekah di dunia ini juga, yang kemudian dibuktikan dengan hancurnya pasukan kafir Mekah pada Perang Badar.",
      "text_translation": "Maka ketika dia (Musa) datang kepada mereka membawa mukjizat-mukjizat Kami, seketika itu mereka menertawakannya.",
      "text": "فَلَمَّا جَاۤءَهُمْ بِاٰيٰتِنَآ اِذَا هُمْ مِّنْهَا يَضْحَكُوْنَ ",
      "text_translation_en": "But as soon as he came before them with Our [miraculous] signs, lo! they derided them,",
      "juz_number": 25
    },
    "48": {
      "text_tafsir_en": "In this verse it is explained that a miracle is a great event or something that is given to a prophet as proof of his prophecy. But a miracle given to a prophet is greater than a miracle given to a previous prophet. So is the miracle given to Moses. In Surah al-Isra '\/ 17: 101 it is stated that Moses was given nine kinds of miracles, namely, a stick to a snake, a glowing hand, a long drought, a broken sea, a terrible typhoon, a grasshopper that destroys a plant, a flea that causes disease, a frog that becomes pests, and drinking water turned into blood that God sent to Pharaoh and his people in the form of disasters to wake them up, as Allah said: So We sent them hurricanes, grasshoppers, lice, frogs and blood (drinking water turned into blood) as clear evidence, but they still brag and they are sinful people. (al-A'raf \/ 7: 133) By inflicting such disasters on Pharaoh and his followers, they are expected to return, the believers. But they did not. As well as Prophet Muhammad, he conveyed to his greatest pagan Meccah, the Qur'an. But they still rejected it and claimed that the Qur'an was a dream, an engine, or a composition of the Prophet Muhammad.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa mukjizat adalah sesuatu peristiwa atau sesuatu yang besar dan luar biasa yang diberikan kepada seorang nabi sebagai bukti kenabiannya. Namun mukjizat yang diberikan kepada seorang nabi lebih hebat dari mukjizat yang diberikan kepada nabi sebelumnya. Begitu pula mukjizat yang diberikan kepada Nabi Musa. Dalam Surah al-Isra'\/17: 101 dinyatakan bahwa Nabi Musa diberi sembilan macam mukjizat, yaitu tongkat menjadi ular, tangan bercahaya, kemarau panjang, laut terbelah, topan yang dahsyat, belalang yang memusnahkan tanaman, kutu yang menimbulkan penyakit, kodok yang menjadi hama, dan air minum yang berubah menjadi darah yang Allah turunkan kepada Fir'aun dan kaumnya dalam bentuk bencana untuk menyadarkan mereka, sebagaimana firman Allah:\n\nMaka Kami kirimkan kepada mereka topan, belalang, kutu, katak dan darah (air minum berubah menjadi darah) sebagai bukti-bukti yang jelas, tetapi mereka tetap menyombongkan diri dan mereka adalah kaum yang berdosa. (al-A'raf\/7: 133)\n\nDengan ditimpakannya bencana-bencana itu kepada Fir'aun dan pengikut-pengikutnya diharapkan mereka akan kembali, yaitu beriman. Tetapi tidak demikian, mereka tetap membangkang.\n\nBegitu pula dengan Nabi Muhammad saw, beliau telah menyampaikan kepada kafir Mekah mukjizatnya yang terbesar, yaitu Al-Qur'an. Tetapi mereka tetap menolaknya dan menyatakan bahwa Al-Qur'an itu adalah mimpi, rekayasa, atau syair gubahan Nabi Muhammad saw.",
      "text_translation": "Dan tidaklah Kami perlihatkan suatu mukjizat kepada mereka kecuali (mukjizat itu) lebih besar dari mukjizat-mukjizat (yang sebelumnya). Dan Kami timpakan kepada mereka azab agar mereka kembali (ke jalan yang benar).",
      "text": "وَمَا نُرِيْهِمْ مِّنْ اٰيَةٍ اِلَّا هِيَ اَكْبَرُ مِنْ اُخْتِهَاۗ وَاَخَذْنٰهُمْ بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُوْنَ ",
      "text_translation_en": "although each sign that We showed them was weigh­tier than the preceding one: and [each time] We took them to task through suffering, so that they might return [to Us].",
      "juz_number": 25
    },
    "49": {
      "text_tafsir_en": "The Pharaohs and his followers felt the calamity that was upon them, and they begged Moses to pray to Allah to deliver them from the torment. \"O witch!\" They said, \"Pray to your Lord as He promised you. We will surely accept what you say.\" Calling Moses the sorcerer had shown that they despised him and did not believe him. But Moses still granted their request, for God had promised him that if they believed, the punishment would be stopped. Moses prayed after they had promised to believe, and Allah stopped the torment.",
      "text_tafsir": "Fir'aun dan pengikut-pengikutnya merasakan bencana-bencana yang ditimpakan kepada mereka sangat dahsyat, lalu mereka memohon kepada Nabi Musa agar berdoa kepada Allah supaya melepaskan mereka dari azab itu. \"Wahai tukang sihir!\" kata mereka, \"Berdoalah kepada Tuhanmu sesuai dengan apa yang Ia janjikan kepadamu! Kami pasti menerima apa yang kau sampaikan.\" Memanggil Nabi Musa tukang sihir sudah menunjukkan bahwa mereka menghina beliau dan tidak mempercayainya. Tetapi Nabi Musa tetap mengabulkan permintaan mereka, karena Allah memang telah menjanjikan kepadanya bahwa bila mereka beriman, azab itu akan dihentikan. Nabi Musa pun berdoa setelah mereka berjanji akan beriman, lalu Allah pun menghentikan azab tersebut.",
      "text_translation": "Dan mereka berkata, “Wahai pesihir! Berdoalah kepada Tuhanmu untuk (melepaskan) kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu; sesungguhnya kami (jika doamu dikabulkan) akan menjadi orang yang mendapat petunjuk.”",
      "text": "وَقَالُوْا يٰٓاَيُّهَ السّٰحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَۚ اِنَّنَا لَمُهْتَدُوْنَ ",
      "text_translation_en": "And [every time] they exclaimed: “O thou sorcerer! Pray for us to thy Sustainer on the strength of the covenant [of prophethood] which He has made with thee: for, verily, we shall now follow the right way!”",
      "juz_number": 25
    },
    "50": {
      "text_tafsir_en": "After the torment was stopped, it turned out they had broken their promise. They are still in opposition, In another verse it is explained: And when they were afflicted, they said, \"O Moses! Pray for us to your Lord according to his promise to you. from us, we will believe in you and will certainly let the children of Israel go with you. \" But after We had taken away the torment from them until the deadline for their fulfillment, they had broken their promise. (Surah al-A'raf \/ 7: 134-135) In the verse it is stated that they promised that if they were released from the catastrophe, they would believe and release the Children of Israel from the torture and slavery they inflicted on them. But those are just promises. They did not keep the promise, but wanted to harm Moses and his people.",
      "text_tafsir": "Setelah azab dihentikan, ternyata mereka memungkiri janji mereka. Mereka tetap membangkang, Di dalam ayat lain peristiwa itu diterangkan pula:\n\nDan ketika mereka ditimpa azab (yang telah diterangkan itu) mereka pun berkata, \"Wahai Musa! Mohonkanlah untuk kami kepada Tuhanmu sesuai dengan janji-Nya kepadamu. Jika engkau dapat menghilangkan azab itu dari kami, niscaya kami akan beriman kepadamu dan pasti akan kami biarkan Bani Israil pergi bersamamu.\" Tetapi setelah Kami hilangkan azab itu dari mereka hingga batas waktu yang harus mereka penuhi ternyata mereka ingkar janji. (Surah al-A'raf\/7: 134-135)\n\nDi dalam ayat itu diterangkan bahwa mereka berjanji bahwa bila mereka dilepaskan dari bencana-bencana itu, mereka akan beriman dan akan membebaskan Bani Israil dari siksaan dan perbudakan yang mereka perlakukan terhadap mereka. Tetapi semuanya itu hanyalah janji. Mereka tidak menepati janji itu, bahkan ingin mencelakakan Nabi Musa dan kaumnya.",
      "text_translation": "Maka ketika Kami hilangkan azab itu dari mereka, seketika itu (juga) mereka ingkar janji.",
      "text": "فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ اِذَا هُمْ يَنْكُثُوْنَ",
      "text_translation_en": "But whenever We removed the suffering from them, lo! they would break their word.",
      "juz_number": 25
    },
    "51": {
      "text_tafsir_en": "Pharaoh is increasingly showing his arrogance and authority. He asked his people, asking to emphasize, was it not that the great Egyptian government belonged to him. Do not the rivers as the source of life in the land flow under their palaces and in their gardens. That question is to show his arrogance. With that speech he was about to declare that he was the greatest and only ruler in the land, which was impossible to fight and defeat. Therefore he would not believe and would not submit to Moses. The words at once contained a threat to anyone who followed Moses that they would have an unfortunate fate.",
      "text_tafsir": "Fir'aun semakin menunjukkan kesombongannya dan kesewenang-wenangannya. Ia bertanya kepada kaumnya, bertanya untuk menegaskan, bukankah kerajaan Mesir yang besar itu milik dia bukan milik orang lain. Bukankah sungai-sungai sebagai sumber kehidupan di negeri itu mengalir di bawah istananya dan di dalam kebun-kebunnya. Pertanyaan itu untuk menunjukan kesombongannya. Dengan ucapan itu ia hendak menyatakan bahwa dialah penguasa besar dan satu-satunya di negeri itu, yang tidak mungkin dilawan dan dikalahkan. Oleh karena itu ia tidak akan beriman dan dan tidak akan tunduk kepada Nabi Musa. Ucapannya itu sekaligus mengandung ancaman kepada siapa saja yang mengikuti Nabi Musa bahwa mereka akan memperoleh nasib yang tidak menguntungkan.",
      "text_translation": "Dan Fir‘aun berseru kepada kaumnya (seraya) berkata, “Wahai kaumku! Bukankah kerajaan Mesir itu milikku dan (bukankah) sungai-sungai ini mengalir di bawahku; apakah kamu tidak melihat?",
      "text": "وَنَادٰى فِرْعَوْنُ فِيْ قَوْمِهٖ قَالَ يٰقَوْمِ اَلَيْسَ لِيْ مُلْكُ مِصْرَ وَهٰذِهِ الْاَنْهٰرُ تَجْرِيْ مِنْ تَحْتِيْۚ اَفَلَا تُبْصِرُوْنَۗ ",
      "text_translation_en": "And Pharaoh issued a call to his people, say­ing: “O my people! Does not the dominion over Egypt belong to me, since all these running waters flow at my feet? Can you not, then, see [that I am your lord supreme]?",
      "juz_number": 25
    },
    "52": {
      "text_tafsir_en": "Pharaoh is showing his arrogance. He insulted Moses. He asked his people, once again to emphasize, was it not his best, while Moses was a despicable man because he had nothing, such as power, position, and wealth as he had. And was not Moses so desperate to explain something in words that he could not. What he meant was Moses' inability to speak clearly because of his tongue as he admitted in his prayer to God to strengthen him by sending his brother, Aaron. Allah said: And my brother Aaron, he is more eloquent than I am, so send him with me to help me (my word); Really, I'm afraid they'll reject me. (al-Qasas \/ 28: 34) The purpose of Pharaoh asking his people by addressing Moses' weaknesses was not to ask questions but for the purpose of humiliating him. He hoped that by presenting Moses' shortcomings, his people had a bad view of him and did not believe him.",
      "text_tafsir": "Fir'aun semakin menunjukkan kecongkakannya. Ia menghina Nabi Musa. Ia bertanya kepada kaumnya, sekali lagi untuk menegaskan, bukankah yang terbaik adalah dia, sedangkan Nabi Musa adalah seorang yang hina karena ia tidak memiliki apa-apa, seperti kekuasaan, jabatan, dan kekayaan seperti yang ia miliki. Dan bukankah Nabi Musa itu begitu hinanya mengingat untuk menjelaskan sesuatu dengan kata-kata saja ia tidak mampu. Yang dimaksudkannya adalah ketidakmampuan Nabi Musa berbicara secara jelas karena lidahnya kelu sebagaimana diakuinya dalam doanya kepada Allah agar memperkuatnya dengan mengutus saudaranya, Nabi Harun. Allah berfirman:\n\nDan saudaraku Harun, dia lebih fasih lidahnya daripada aku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan (perkataan)ku; sungguh, aku takut mereka akan mendustakanku. (al-Qasas\/28: 34)\n\nTujuan Fir'aun bertanya kepada kaumnya dengan menyampaikan kekurangan-kekurangan Nabi Musa bukanlah untuk bertanya tetapi untuk tujuan menghina beliau. Ia berharap dengan mengemukakan kekurangan Nabi Musa, rakyatnya memiliki pandangan yang tidak baik kepadanya dan tidak mempercayainya.",
      "text_translation": "Bukankah aku lebih baik dari orang (Musa) yang hina ini dan yang hampir tidak dapat menjelaskan (perkataannya)?",
      "text": "اَمْ اَنَا۠ خَيْرٌ مِّنْ هٰذَا الَّذِيْ هُوَ مَهِيْنٌ ەۙ وَّلَا يَكَادُ يُبِيْنُ ",
      "text_translation_en": "Am I not better than this contemptible man who can hardly make his meaning clear?",
      "juz_number": 25
    },
    "53": {
      "text_tafsir_en": "Pharaoh gave the reason why Moses did not deserve glory and was not worthy of being an apostle, because he had no gold rings as a sign that he was rich, and that he was not accompanied by angels as a sign that he was an apostle. Thus Pharaoh set the standard of glory for wealth, and the standard of truth in matters of sight. God does not place the standard of glory on material but on godliness, as God says: O man! Indeed, We created you from man and woman, and then We made you nations and tribes to know one another. Indeed, the most honorable of you in the sight of God is the most fearful. Indeed, Allah is All-Knowing, All-Knowing. (al-hujurat \/ 49: 13) God does not set the standard of truth as an apostle on something that can be sensed, but on the truth of the path he takes, in the truth of the revelation he receives from God. Allah says: Say, \"I am but a man like you, who has received a revelation that your Lord is truly the One and Only God.\" Whoever wishes to meet with his Lord, let him do good and not associate with anything in worship of his Lord. \"(Al-Kahf \/ 18: 110) Prophet Muhammad saw the unworthy treatment even more. They asked him, in addition to being a rich man, to be able to create extraordinary events that made him want to see God and angels in the eyes. because he is beyond his power and impossible to fill. He simply responds, \"My holiness is holy, and I am only a man who is an apostle.\" Say (Muhammad) Israel '(17: 93)",
      "text_tafsir": "Fir'aun memberikan alasan mengapa Nabi Musa tidak pantas memperoleh kemuliaan dan tidak layak diimani sebagai rasul, karena ia tidak memiliki gelang-gelang emas sebagai tanda ia kaya, dan tidak didampingi malaikat-malaikat sebagai tanda ia seorang rasul. Dengan demikian Fir'aun membuat tolok ukur kemuliaan itu adalah dengan kekayaan, dan tolok ukur kebenaran pada hal-hal yang kasat mata. Allah tidak meletakkan tolok ukur kemuliaan itu pada materi tetapi pada ketakwaan, sebagaimana firman Allah:\n\nWahai manusia! Sungguh, Kami telah menciptakan kamu dari seorang laki-laki dan seorang perempuan, kemudian Kami jadikan kamu berbangsa-bangsa dan bersuku-suku agar kamu saling mengenal. Sungguh yang paling mulia di antara kamu di sisi Allah ialah orang yang paling bertakwa. Sungguh, Allah Maha Mengetahui, Mahateliti. (al-hujurat\/49: 13) \n\nAllah tidak meletakkan tolok ukur kebenaran sebagai seorang rasul itu pada sesuatu yang dapat diindera, namun pada kebenaran jalan yang ditempuhnya, yaitu pada kebenaran wahyu yang diperolehnya dari Allah. Allah berfirman:\n\nKatakanlah (Muhammad), \"Sesungguhnya aku ini hanya seorang manusia seperti kamu, yang telah menerima wahyu, bahwa sesungguhnya Tuhan kamu adalah Tuhan Yang Maha Esa.\" Maka barang siapa mengharap pertemuan dengan Tuhannya maka hendaklah dia mengerjakan kebajikan dan janganlah dia mempersekutukan dengan sesuatu pun dalam beribadah kepada Tuhannya.\" (al-Kahf\/18: 110) \n\nPerlakuan yang tidak layak juga dialami Nabi Muhammad saw bahkan lebih hebat lagi. Kaumnya tidak mempercayainya sebagai seorang rasul karena ia tidak memiliki apa-apa. Mereka memintanya, di samping menjadi orang kaya, juga dapat menciptakan peristiwa-peristiwa yang luar biasa sampai-sampai mereka ingin melihat Allah dan malaikat secara kasat mata. Permintaan itu tentu tidak mungkin ia penuhi karena sudah di luar kuasanya dan mustahil dipenuhi. Beliau hanya menjawab, \"Mahasuci Tuhanku, dan saya hanya seorang manusia yang menjadi rasul.\" \n\nKatakanlah (Muhammad), \"Mahasuci Tuhanku, bukankah aku ini hanya seorang manusia yang menjadi rasul?\" (al-Isra'\/17: 93)",
      "text_translation": "Maka mengapa dia (Musa) tidak dipakaikan gelang dari emas atau malaikat datang bersama-sama dia untuk mengiringkannya?”",
      "text": "فَلَوْلَٓا اُلْقِيَ عَلَيْهِ اَسْوِرَةٌ مِّنْ ذَهَبٍ اَوْ جَاۤءَ مَعَهُ الْمَلٰۤىِٕكَةُ مُقْتَرِنِيْنَ ",
      "text_translation_en": "“And then - why have no golden armlets been bestowed on him? or why have no angels come together with him?”",
      "juz_number": 25
    },
    "54": {
      "text_tafsir_en": "Pharaoh's efforts to influence and deceive his people succeeded. The people of Egypt obeyed him and refused to believe Moses even hated him. They are classified by God as the wicked, that is, those who violate the teachings of religion and depart from the truth.",
      "text_tafsir": "Upaya Fir'aun mempengaruhi dan mengelabui rakyatnya berhasil. Rakyat Mesir patuh kepadanya dan tidak mau beriman kepada Nabi Musa bahkan membencinya. Mereka digolongkan oleh Allah sebagai orang-orang fasik, yaitu orang-orang yang benar-benar telah melanggar ajaran-ajaran agama dan keluar dari kebenaran.",
      "text_translation": "Maka (Fir‘aun) dengan perkataan itu telah mempengaruhi kaumnya, sehingga mereka patuh kepadanya. Sungguh, mereka adalah kaum yang fasik.",
      "text": "فَاسْتَخَفَّ قَوْمَهٗ فَاَطَاعُوْهُ ۗاِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِيْنَ ",
      "text_translation_en": "Thus he incited his people to levity, and they obeyed him: for, behold, they were people depraved!",
      "juz_number": 25
    },
    "55": {
      "text_tafsir_en": "The imperfection of Pharaoh and his people has grown. They are increasingly forgetting the land and even looking at Pharaoh as a god. The action reached its climax, which was impossible for God to forgive and deeply regretted. God also punished him, when Pharaoh and his people pursued Moses and his people to the Red Sea, and he drowned them in the sea. Thus he died because of his arrogance of power and power, and the truth was revealed even when he was raised only by an ordinary human being who had no power. The suspension of the punishment of the wicked is called imprisonment, which means that the perpetrator of the crime is allowed to commit the crime so that the crime increases steadily to its peak, if the culprit is no longer counseled. When those sins are at their peak, God cannot forgive them anymore, and He will punish them. The Prophet said in a history of Ahmad, at-Tirmidhi, ath-thabrani and al-Baihaqi: 'Uqbah bin' Amir recounted that the Prophet saw, \"When you see Allah give a servant the worldly pleasure he wants from the world while he is always active then it is actually a stereotype. \" Then the Prophet (peace and blessings be upon him) read the verse, \"And when they forgot the warnings which were given to them, We opened all the doors for them. So when they rejoiced in what they had been given, We suddenly punished them, at that moment they fell into despair. \" (History of Ahmad, at-Tirmidhi, ath-thabrani and al-Baihaqi)",
      "text_tafsir": "Kefasikan Fir'aun dan kaumnya semakin menjadi-jadi. Mereka semakin lupa daratan bahkan memandang Fir'aun adalah tuhan. Tindakan itu sudah sampai ke puncaknya, yang tidak mungkin lagi dimaafkan oleh Allah dan sangat disesalkan. Allah pun menjatuhkan hukuman-Nya, ketika Fir'aun dan balatentaranya mengejar Nabi Musa dan kaumnya sampai ke Laut Merah, Allah menenggelamkannya di laut itu. Dengan demikian ia tewas karena kesombongannya memiliki kekayaan dan kekuasaan, dan kebenaran pun terungkap walaupun diusung hanya oleh seorang manusia biasa yang tidak punya kekuasaan apa-apa. \n\nPenundaan hukuman terhadap orang yang jahat itu disebut istidraj, yaitu pelaku perbuatan dosa dibiarkan melakukan kejahatan sehingga dosanya meningkat terus sampai ke puncaknya, bila pelakunya tidak mempan lagi dinasehati. Bila dosa-dosa itu sudah sampai di puncaknya, maka Allah tidak mungkin memaafkannya lagi, lalu Ia akan menjatuhkan hukuman-Nya. Nabi bersabda dalam sebuah riwayat Ahmad, at-Tirmidhi, ath-thabrani dan al-Baihaqi:\n\n'Uqbah bin 'Amir meriwayatkan bahwa Nabi saw bersabda, \"Apabila engkau melihat Allah memberikan kepada seorang hamba kenikmatan duniawi yang ia inginkan dari dunia sedangkan ia selalu bermaksiatm maka sesungguhnya hal tersebut merupakan istidraj.\" Kemudian Nabi saw membaca ayat, \"Maka ketika mereka melupakan peringatan yang telah diberikan kepada mereka, Kami pun membukakan semua pintu (kesenangan) untuk mereka. Sehingga ketika mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka secara tiba-tiba, maka ketika itu mereka terdiam putus asa.\" (Riwayat Ahmad, at-Tirmidhi, ath-thabrani dan al-Baihaqi)",
      "text_translation": "Maka ketika mereka membuat Kami murka, Kami hukum mereka, lalu Kami tenggelamkan mereka semuanya (di laut),",
      "text": "فَلَمَّآ اٰسَفُوْنَا انْتَقَمْنَا مِنْهُمْ فَاَغْرَقْنٰهُمْ اَجْمَعِيْنَۙ ",
      "text_translation_en": "But when they continued to challenge Us, We inflicted Our retribution on them, and drowned them all:",
      "juz_number": 25
    },
    "56": {
      "text_tafsir_en": "The case of Pharaoh is an example that should be used as a lesson by subsequent generations until the Day of Judgment. The lesson is for anyone not to imitate Pharaoh's arrogant and ungodly behavior. And that whoever is arrogant and ungodly will suffer the same fate as that Pharaoh.",
      "text_tafsir": "Kasus Fir'aun itu merupakan contoh yang patut dijadikan pelajaran oleh generasi-generasi berikutnya sampai hari Kiamat. Pelajarannya adalah agar siapa pun tidak meniru tingkah laku Fir'aun yang congkak dan durhaka. Dan bahwa siapa pun yang congkak dan durhaka akan mengalami nasib yang sama seperti Fir'aun itu.",
      "text_translation": "maka Kami jadikan mereka sebagai (kaum) terdahulu dan pelajaran bagi orang-orang yang kemudian.",
      "text": "فَجَعَلْنٰهُمْ سَلَفًا وَّمَثَلًا لِّلْاٰخِرِيْنَ ࣖ",
      "text_translation_en": "and so We made them a thing of the past, and an example to those who would come after them.",
      "juz_number": 25
    },
    "57": {
      "text_tafsir_en": "This verse explains that the Prophet Jesus son of Mary was used as an example by the Meccan monks to bring down and mock the Prophet Muhammad. It happened when he uttered the verse, \"\" Indeed, you (disbelievers) and that which you worship besides Allah, is the fuel of Hell, \"(al-Anbiya '\/ 21: 98). presumably to find a reason to prove that Muhammad acted wrongly on the basis of that verse, because Jesus was worshiped by some people, and that he would go to hell with those who worshiped him. those who have (our) good will will be kept away (from Hell), \"(al-Anbiya '\/ 21: 101). Then Jesus,' Uzair, and his priests and the monks, obedient monks who worship only God, will go to heaven, and those who turn their backs on gods other than God will go to hell. About Jesus himself they worshiped the devil, this verse goes down to contradict him, is restricted the parable, suddenly your people, Muhammad, cheered for it, \"that is to cheer you up for His word. God then explained, \"He is none other than the servant to whom we have given grace and made it a sign for the children of Israel. And if We will, We have made you some of the angels of the earth forever.\" (Jesus) is indeed proof of the Day of Resurrection. \"",
      "text_tafsir": "Ayat ini menerangkan bahwa Nabi Isa putra Maryam dijadikan contoh oleh kaum musyrikin Mekah untuk menjatuhkan dan memperolok-olokkan Nabi Muhammad saw. Hal itu terjadi ketika beliau menyampaikan ayat,\" \"Sungguh, kamu (orang kafir) dan apa yang kamu sembah selain Allah, adalah bahan bakar Jahanam.,\" (al-Anbiya'\/21: 98). Mereka bersorak-sorai kegirangan, karena menyangka memperoleh alasan untuk membuktikan bahwa Nabi Muhammad bertindak salah berdasarkan ayat itu. Hal itu karena Nabi Isa disembah oleh sebagian manusia. Dengan begitu beliau juga akan masuk neraka bersama mereka yang menyembahnya. Untuk membantah pandangan itu Allah menurunkan ayat, \"Sungguh, sejak dahulu bagi orang-orang yang telah ada (ketetapan) yang baik dari Kami, mereka itu akan dijauhkan (dari neraka),\" (al-Anbiya'\/21:101). Dengan demikian Nabi Isa, 'Uzair, dan pendeta-pendeta serta rahib-rahib yang taat dan hanya menyembah Allah, akan masuk surga, dan orang-orang sesat yang kemudian menjadikan mereka tuhan-tuhan selain Allah akan masuk neraka. Mengenai Isa sendiri yang disembah mereka yang sesat itu turun ayat ini untuk membantahnya, \"Dan tatkala putra Maryam dijadikan perumpamaan, tiba-tiba kaummu, ya Muhammad, bersorak karenanya,\" yaitu menyoraki kamu karena firman-Nya itu. Selanjutnya Allah menjelaskan, \"Dia (Isa) tidak lain hanyalah seorang hamba yang Kami anugerahi nikmat dan Kami jadikan tanda untuk Bani Israil. Dan jika Kami kehendaki, benar-benar Kami jadikan sebagian kalian malaikat-malaikat di bumi yang turun-temurun. Dan ia (Isa) sungguh merupakan bukti tentang adanya hari Kiamat¦.\"",
      "text_translation": "Dan ketika putra Maryam (Isa) dijadikan perumpamaan, tiba-tiba kaummu (Suku Quraisy) bersorak karenanya.",
      "text": "وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا اِذَا قَوْمُكَ مِنْهُ يَصِدُّوْنَ",
      "text_translation_en": "NOW WHENEVER [the nature of] the son of Mary is set forth as an example, [O Muhammad,] lo! thy people raise an outcry on this score,",
      "juz_number": 25
    },
    "58": {
      "text_tafsir_en": "In this verse it is explained that the monks of Meccah compared their gods, the idols, with Jesus, whom the pagans had previously held, which is better. They think Jesus is no better than the idols they worship, because Jesus will go to hell with them and their gods. Then God broke that view by explaining that they were just arguing and arguing, because that was the nature they had instilled in them.",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa kaum musyrikin Mekah itu membandingkan tuhan-tuhan mereka, yaitu berhala-berhala, dengan Nabi Isa yang telah dipertuhankan oleh orang-orang sesat sebelumnya, manakah yang lebih baik. Menurut pandangan mereka Nabi Isa tidak lebih baik dari berhala-berhala yang mereka sembah, karena Nabi Isa juga akan masuk neraka bersama mereka dan tuhan-tuhan mereka. Lalu Allah mematahkan pandangan itu dengan menerangkan bahwa mereka sebenarnya hanya berdebat dan menyanggah tak menentu, karena memang begitulah sifat yang sudah tertanam dalam diri mereka.",
      "text_translation": "Dan mereka berkata, “Manakah yang lebih baik tuhan-tuhan kami atau dia (Isa)?” Mereka tidak memberikan (perumpamaan itu) kepadamu melainkan dengan maksud membantah saja, sebenarnya mereka adalah kaum yang suka bertengkar.",
      "text": "وَقَالُوْٓا ءَاٰلِهَتُنَا خَيْرٌ اَمْ هُوَ ۗمَا ضَرَبُوْهُ لَكَ اِلَّا جَدَلًا ۗبَلْ هُمْ قَوْمٌ خَصِمُوْنَ",
      "text_translation_en": "and say, “Which is better - our deities or he?” [But] it is only in the spirit of dispute that they put this comparison before thee: yea, they are conten­tious folk!",
      "juz_number": 25
    },
    "59": {
      "text_tafsir_en": "Allah confirmed that the Prophet Jesus was actually His servant, not His child and not God. He has been blessed with glory, to be a prophet who conveys the teachings of God in the Gospels. In addition, the Prophet Jesus made Him as an example for the Children of Israel about the evidence of His power, that He created something through an unnatural process, namely creating humans without fathers. By giving this example, the Children of Israel and anyone afterwards must not view him as a child of God and adopt him as a god.",
      "text_tafsir": "Allah menegaskan bahwa Nabi Isa sesungguhnya adalah hamba-Nya, bukan anak-Nya dan bukan Tuhan. Ia telah dikaruniai kemuliaan, yaitu menjadi nabi yang menyampaikan ajaran-ajaran Allah dalam kitab Injil. Di samping itu Nabi Isa dijadikan-Nya sebagai contoh bagi Bani Israil tentang bukti kekuasaan-Nya, bahwa Ia menciptakan sesuatu melalui proses yang tidak wajar, yaitu menciptakan manusia tanpa ayah. Dengan mengemukakan contoh itu, Bani Israil dan siapa pun sesudahnya tidak boleh memandangnya sebagai anak Tuhan dan mengangkatnya sebagai tuhan.",
      "text_translation": "Dia (Isa) tidak lain hanyalah seorang hamba yang Kami berikan nikmat (kenabian) kepadanya dan Kami jadikan dia sebagai contoh pelajaran bagi Bani Israil.",
      "text": "اِنْ هُوَ اِلَّا عَبْدٌ اَنْعَمْنَا عَلَيْهِ وَجَعَلْنٰهُ مَثَلًا لِّبَنِيْٓ اِسْرَاۤءِيْلَ ۗ  ",
      "text_translation_en": "[As for Jesus,] he was nothing but [a human being -] a servant [of Ours] whom We had graced [with prophethood], and whom We made an example for the children of Israel.",
      "juz_number": 25
    },
    "60": {
      "text_tafsir_en": "God contradicts the belief of the Meccanic monks that angels are the children of God to be worshiped. This belief is similar to the belief of some of the Children of Israel and of their people after Jesus. God asserts that if He wished, He could make man an angel to dwell on this earth for generations, or to replace man on the earth who also had children till the day of Judgment. Then are these angels the children of God and worthy of worship? By that explanation God wanted to convey to the Meccans of the Meccans that He was able to create anything including the greater of Jesus' creation, because it is only God who is worthy of worship, not His creation.",
      "text_tafsir": "Allah membantah kepercayaan kaum musyrikin Mekah bahwa malaikat adalah anak Allah yang harus disembah. Kepercayaan itu sama dengan kepercayaan sebagian Bani Israil dan orang-orang sesudah mereka tentang Nabi Isa. Allah menegaskan bahwa bila Ia mau, Ia dapat menciptakan manusia menjadi malaikat yang menghuni bumi ini secara turun-temurun, atau menggantikan manusia di bumi yang juga hidup beranak pinak sampai hari kiamat. Lalu apakah malaikat itu adalah anak-anak Allah dan pantas disembah? Dengan penjelasan itu Allah hendak menyampaikan kepada kaum musyrikin Mekah bahwa Ia mampu menciptakan apa saja termasuk yang jauh lebih hebat dari penciptaan Nabi Isa, karena itu hanya Allahlah yang pantas disembah, bukan ciptaan-Nya itu.",
      "text_translation": "Dan sekiranya Kami menghendaki, niscaya ada di antara kamu yang Kami jadikan malaikat-malaikat (yang turun temurun) sebagai pengganti kamu di bumi.",
      "text": "وَلَوْ نَشَاۤءُ لَجَعَلْنَا مِنْكُمْ مَّلٰۤىِٕكَةً فِى الْاَرْضِ يَخْلُفُوْنَ ",
      "text_translation_en": "And had We so willed, [O you who worship angels,] We could indeed have made you into angels succeeding one another on earth!",
      "juz_number": 25
    },
    "61": {
      "text_tafsir_en": "Allah explained further about the advantages given to the Prophet Jesus, which will be evidence of the Day of Judgment. That is because the Prophet Jesus had great miracles, such as raising the dead, healing blindness, and so on. These miracles are proof that God who gave them was able to create the Day of Judgment. In addition, authentic traditions inform the coming of the Prophet Jesus before the Day of Judgment. The hadith is narrated from various sources, including Abu Hurairah, Ibn 'Abbas,' Ikrimah, al-hasan, Qatadah, and adh-ahhak, so that they are considered mut worried by some scholars. Among these hadiths are: The Holy Prophet said, \"By Allah (Allah) who controlled my soul, it almost came down to you Isa bin Maryam as a just judge. (History of al-Bukhari and Muslim) Thus the purpose of this verse is that the appearance of the Prophet Isa approaching the Day of Judgment is a sign that the Doomsday will come, then Allah asks people not to doubt the coming of Doomsday, so they must prepare themselves by faith and do good, so that they can reap the fruits of their faith and charity in the hereafter. be happy forever in the hereafter, Allah asks the Children of Israel to follow the teachings that He conveyed to Prophet Jesus about the Day of Judgment, the teachings about the Resurrection ask people to do good in preparation to deal with it, it is a straight path that is absolutely right and can certainly bring people to a happy life in the afterlife.That straight path is taught n Islam, which is the religion of all the prophets, including the last prophet, Muhammad.",
      "text_tafsir": "Allah menerangkan lebih lanjut tentang kelebihan yang diberikan kepada Nabi Isa, yang akan menjadi bukti tentang adanya hari Kiamat. Hal itu karena Nabi Isa memiliki mukjizat-mukjizat besar, seperti menghidupkan orang mati, menyembuhkan kebutaan, dan sebagainya. Mukjizat-mukjizat itu merupakan bukti bahwa Allah yang memberikannya mampu menciptakan hari Kiamat. \n\nDi samping itu hadis-hadis sahih menginformasikan akan datangnya Nabi Isa menjelang hari Kiamat. Hadis itu diriwayatkan dari berbagai sumber, di antaranya Abu Hurairah, Ibnu 'Abbas , 'Ikrimah, al-hasan, Qatadah, dan adh-ahhak, sehingga dipandang mutawatir oleh sebagian ulama. Hadis itu di antaranya adalah: \n\nNabi saw bersabda, \"Demi (Allah)yang menguasai jiwaku, hampir saja turun kepada kalian Isa bin Maryam sebagai hakim yang adil. (Riwayat al-Bukhari dan Muslim)\n\nDengan demikian maksud ayat ini adalah bahwa munculnya Nabi Isa menjelang hari Kiamat merupakan tanda bahwa Kiamat akan datang.\n\nSelanjutnya Allah meminta manusia agar tidak meragukan datangnya hari Kiamat. Karena itu mereka harus mempersiapkan diri dengan cara beriman dan berbuat baik, supaya dapat memetik buah iman dan amalnya nanti di akhirat. Dengan begitu manusia akan hidup bahagia selamanya di hari akhirat nanti.\n\nAllah meminta Bani Israil agar mengikuti ajaran-ajaran yang Ia sampaikan kepada Nabi Isa mengenai adanya hari Kiamat. Ajaran tentang adanya kiamat meminta manusia agar berbuat baik sebagai persiapan untuk menghadapinya. Ajaran itu merupakan jalan yang lurus yang mutlak benar dan pasti dapat mengantarkan manusia ke kehidupan yang bahagia di akhirat. Jalan yang lurus itulah yang diajarkan Islam, yang merupakan agama yang dibawa semua nabi, termasuk nabi terakhir yaitu Muhammad saw.",
      "text_translation": "Dan sungguh, dia (Isa) itu benar-benar menjadi pertanda akan datangnya hari Kiamat. Karena itu, janganlah kamu ragu-ragu tentang (Kiamat) itu dan ikutilah Aku. Inilah jalan yang lurus.",
      "text": "وَاِنَّهٗ لَعِلْمٌ لِّلسَّاعَةِ فَلَا تَمْتَرُنَّ بِهَا وَاتَّبِعُوْنِۗ هٰذَا صِرَاطٌ مُّسْتَقِيْمٌ ",
      "text_translation_en": "AND, BEHOLD, this [divine writ] is indeed a means to know [that] the Last Hour [is bound to come]; hence, have no doubt whatever about it, but follow Me: this [alone] is a straight way.",
      "juz_number": 25
    },
    "62": {
      "text_tafsir_en": "Then God warns people not to be trapped by the devil's deception. Man's duty is to worship, which is to serve God by offering the good of the whole world. In his struggle he will always be prevented and confronted by demons. Humans must fight against it so that their efforts and struggles in creating good will not be stopped by the devil. Thus the devil also works hard, to bring down mankind. Because he is a true enemy of man. The real hostility came from the devil's revenge and was banished from heaven, because he did not want to bow to the human ancestor, Adam.",
      "text_tafsir": "Selanjutnya Allah memperingatkan manusia agar tidak terjebak oleh tipu daya setan. Tugas manusia adalah beribadah, yaitu mengabdi kepada Allah dengan mempersembahkan kebaikan kepada seluruh alam. Dalam perjuangannya itu ia akan selalu dihalang-halangi dan dihadang oleh setan. Manusia harus melawannya supaya usaha dan perjuangannya dalam mewujudkan kebaikan tidak sampai dihentikan setan.\n\nDengan demikian setan juga bekerja keras, untuk menjatuhkan manusia. Karena ia memang musuh sejati manusia. Permusuhan sejati itu terjadi karena setan dendam akibat dilaknat Allah dan diusir dari surga, karena ia tidak mau sujud kepada nenek moyang manusia, yaitu Adam.",
      "text_translation": "Dan janganlah kamu sekali-kali dipalingkan oleh setan; sungguh, setan itu musuh yang nyata bagimu.",
      "text": "وَلَا يَصُدَّنَّكُمُ الشَّيْطٰنُۚ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِيْنٌ ",
      "text_translation_en": "And let not Satan bars you [from it] - for, verily, he is your open foe!",
      "juz_number": 25
    },
    "63": {
      "text_tafsir_en": "This verse explains how Jesus truly preached to the Children of Israel. Jesus conveyed the doctrines he received from God Almighty, including faith in God as the One True God, faith in his future, good deeds toward others, and no evil deeds. He emphasized that the tenets of his teaching were wisdom, which is the religion of piety that needs to be practiced, that of doing good deeds and avoiding evil acts that will determine the happiness of mankind in the world and the hereafter. (For details of what wisdom is, read Surah al-Isra '\/ 17: 23-39). Jesus also explained his other task, which was to explain what the Children of Israel disputed. Such disputes have to do with religious matters, such as whether animals are claws and fat of cattle and sheep illegally (al-An'am \/ 6: 146). Jesus came to explain the details of it all (Ali 'Imran \/ 3: 50). According to Ibn Jarir, the dispute was about world issues, not religion. It seems to be about dividing the Children of Israel into different sects that have always been at odds with one another. Then Jesus asked them to do what He commanded and to avoid what He forbade. Fear is the consequence of faith, which is the exercise of the values contained in the above wisdom. That is, faith needs to be proven by the implementation of good works. And Jesus asked his people to obey him by doing everything he said and not always contradicting religious teachings.",
      "text_tafsir": "Ayat ini menjelaskan bagaimana sesungguhnya dakwah Nabi Isa kepada Bani Israil. Nabi Isa menyampaikan pokok-pokok ajaran yang diterimanya dari Allah swt, antara lain tentang iman kepada Allah sebagai Tuhan yang Maha Esa, iman kepada adanya hari kemudian, berbuat baik kepada sesama manusia, dan tidak melakukan perbuatan jahat. Nabi lsa menegaskan bahwa pokok-pokok ajaran yang disampaikannya itu adalah hikmah, yaitu beragama tauhid yang perlu dijalankan, yakni melakukan perbuatan-perbuatan mulia dan menjauhi perbuatan-perbuatan jahat yang akan menentukan kebahagiaan umat manusia di dunia dan akhirat. (Mengenai rincian apa itu hikmah, bacalah Surah al-Isra'\/17: 23-39).\n\nNabi Isa juga menjelaskan tugasnya yang lain, yaitu menjelaskan apa yang diperselisihkan oleh Bani Israil. Perselisihan itu ada yang berkenaan dengan masalah agama, misalnya mengenai apakah hewan yang berkuku dan lemak sapi dan domba haram (al-An'am\/6:146). Nabi Isa datang menjelaskan kehalalan semuanya itu (Ali 'Imran\/3:50). Menurut Ibn Jarir, perselisihan itu mengenai persoalan-persoalan dunia, bukan mengenai agama. Hal itu tampaknya berkenaan dengan perpecahan Bani Israil menjadi berbagai sekte yang selalu baku hantam satu sama lainnya. \n\nSetelah itu Nabi Isa meminta mereka bertakwa yaitu mengerjakan apa yang diperintahkan Allah dan menjauhi apa yang dilarang-Nya. Takwa adalah konsekuensi iman, yaitu menjalankan nilai-nilai yang terkandung dalam hikmah di atas. Artinya, iman perlu dibuktikan dengan pelaksanaan perbuatan-perbuatan baik tersebut. Dan Nabi Isa meminta umatnya agar mematuhinya, yaitu menjalankan segala yang ia sampaikan dan tidak selalu memperselisihkan ajaran-ajaran agama.",
      "text_translation": "Dan ketika Isa datang membawa keterangan, dia berkata, “Sungguh, aku datang kepadamu dengan membawa hikmah dan untuk menjelaskan kepadamu sebagian dari apa yang kamu perselisihkan, maka bertakwalah kepada Allah dan taatlah kepadaku.",
      "text": "وَلَمَّا جَاۤءَ عِيْسٰى بِالْبَيِّنٰتِ قَالَ قَدْ جِئْتُكُمْ بِالْحِكْمَةِ وَلِاُبَيِّنَ لَكُمْ بَعْضَ الَّذِيْ تَخْتَلِفُوْنَ فِيْهِۚ فَاتَّقُوا اللّٰهَ وَاَطِيْعُوْنِ ",
      "text_translation_en": "NOW WHEN Jesus came [to his people] with all evidence of the truth, he said: “I have now come unto you with wisdom, and to make clear Unto you some of that on which you are at variance: hence, be conscious of God, and pay heed unto me.",
      "juz_number": 25
    },
    "64": {
      "text_tafsir_en": "Jesus emphasized the essence of his teaching, that God is God. God is the God of all beings, the Lord of them and also their God. The consequence of obeying God is worshiping Him and serving Him. To worship God is to worship Him, and to serve Him is to do good works. So do not worship other than Allah, for it will lead people astray. That is the straight path, the true way of life that guarantees happiness in the world and in the hereafter. The \"straight path\" in this verse is monotheism and good deeds. The \"straight path\" in verse 61 is to believe in the afterlife that also requires good deeds. Thus the \"straight path\" in both verses is the same, because faith in God requires men of faith in the Hereafter and good works, and faith in the Hereafter also requires men to believe in God and do good.",
      "text_tafsir": "Nabi Isa menegaskan inti ajaran yang disampaikannya, yaitu bahwa Tuhan hanyalah Allah. Allah adalah Tuhan semua makhluk, Tuhan dia dan Tuhan mereka juga. Konsekuensi mempertuhankan Allah adalah menyembah-Nya dan mengabdi kepada-Nya. Menyembah Allah adalah mengerjakan ibadah untuk-Nya, dan mengabdi kepada-Nya adalah melakukan perbuatan-perbuatan baik. Maka jangan menyembah selain dari Allah, karena hal itu akan membawa manusia kepada kesesatan. Itulah jalan yang lurus, yaitu jalan hidup benar yang menjamin kebahagiaan di dunia dan di akhirat. \"Jalan lurus\" dalam ayat ini adalah tauhid dan perbuatan baik. \"Jalan lurus\" dalam ayat 61 adalah percaya kepada adanya hari akhirat yang juga menghendaki perbuatan baik. Dengan demikian \"jalan yang lurus\" dalam kedua ayat itu sama hakikatnya, karena iman kepada Allah menghendaki manusia iman kepada hari akhirat dan berbuat baik, dan iman kepada hari akhirat juga menghendaki manusia iman kepada Allah dan berbuat baik.",
      "text_translation": "Sungguh Allah, Dia Tuhanku dan Tuhanmu, maka sembahlah Dia. Ini adalah jalan yang lurus.”",
      "text": "اِنَّ اللّٰهَ هُوَ رَبِّيْ وَرَبُّكُمْ فَاعْبُدُوْهُۗ هٰذَا صِرَاطٌ مُّسْتَقِيْمٌ ",
      "text_translation_en": "“Verily, God is my Sustainer as well as your Sustainer; so worship [none but] Him: this [alone] is a straight way!”",
      "juz_number": 25
    },
    "65": {
      "text_tafsir_en": "The children of Israel disagreed with Jesus about his life and death. The source of contention when he was alive, was that he accepted it as a prophet and a holy man, some accusing him of being the son of an illicit relationship his mother had made. And after his death there were those who looked upon him as the son of God, or God himself, and there were those who looked upon the common man as an apostle. The dispute was so sharp that so many sects were formed. They not only split up but also killed (in battle). The wrong view among the sects is wrong about Jesus as explained in the above verses, unfortunate, a painful torment in hell in the hereafter.",
      "text_tafsir": "Bani Israil berselisih pendapat mengenai Nabi Isa baik semasa ia hidup maupun setelah meninggal. Yang menjadi ajang perselisihan waktu ia masih hidup, adalah yang menerimanya sebagai nabi dan manusia suci, ada yang menuduhnya sebagai anak dari hubungan haram yang dilakukan ibunya. Dan setelah ia meninggal ada yang memandangnya anak Tuhan, atau Tuhan itu sendiri, dan ada yang memandangnya manusia biasa yang diutus sebagai rasul.\n\nPerselisihan itu sangat tajam sehingga terbentuk banyak sekali sekte yang berseberangan. Mereka tidak hanya berpecah belah tetapi juga berbunuh-bunuhan (berperang-perangan). Yang berpandangan salah di antara sekte-sekte itu berpandangan salah mengenai Nabi Isa sebagimana dijelaskan dalam ayat-ayat di atas, akan bernasib malang, yaitu azab yang pedih di dalam neraka di hari akhirat.",
      "text_translation": "Tetapi golongan-golongan (yang ada) saling berselisih di antara mereka; maka celakalah orang-orang yang zalim karena azab pada hari yang pedih (Kiamat).",
      "text": "فَاخْتَلَفَ الْاَحْزَابُ مِنْۢ بَيْنِهِمْ ۚفَوَيْلٌ لِّلَّذِيْنَ ظَلَمُوْا مِنْ عَذَابِ يَوْمٍ اَلِيْمٍ ",
      "text_translation_en": "But factions from among those [who came after Jesus] began to hold divergent views: woe, then, unto those who are bent on evildoing - [woe] for the suffering [that will befall them] on a grie­vous Day!",
      "juz_number": 25
    },
    "66": {
      "text_tafsir_en": "This verse argues that the Meccans of Mecca misunderstood Surah al-Anbiya '\/ 21: 98, saying that those who worship other than Allah will be with their worship. Jesus was worshiped, so they thought, too, would go to hell with those who worshiped him. God has contradicted him by explaining the length of Jesus in the above verses. Jesus was worshiped, but those who worshiped him were astray. Therefore Jesus will not go to hell. The ones who will go to hell are the lost. So do the pagans who worship idols, the Meccans of the Meccans. They with their idols will go to hell. In this verse it is explained that if the Meccans of the Meccans still refused to accept such a clear explanation, God asked if they would not regret it. Because the end will surely come, and when it comes it will happen suddenly when they are overwhelmed by worldly pleasures. Before it was too late, God asked them to believe in the Prophet Muhammad and the religion he proclaimed.",
      "text_tafsir": "Ayat ini membantah kaum musyrikin Mekah yang salah memahami Surah al-Anbiya'\/21: 98, bahwa orang yang menyembah selain Allah akan bersama sembahannya itu nanti masuk neraka. Nabi Isa disembah, karena itu, menurut mereka, juga akan masuk neraka bersama mereka yang menyembahnya. Allah telah membantahnya dengan menjelaskan tentang Nabi Isa secara panjang lebar dalam ayat-ayat di atas. Nabi Isa memang disembah, tetapi yang menyembahnya adalah mereka yang sesat. Oleh karena itu Nabi Isa tidak akan masuk neraka. Yang akan masuk neraka adalah mereka yang sesat. Begitu juga orang-orang sesat yang menyembah berhala-berhala, yaitu kaum musyrikin Mekah. Mereka bersama sembahan-sembahan mereka itu yang akan masuk neraka. \n\nDalam ayat ini dijelaskan bahwa bila kaum musyrikin Mekah itu tetap tidak mau menerima penjelasan yang begitu gamblang, Allah bertanya apakah mereka tidak akan menyesal. Sebab kiamat pasti datang, dan bila datang ia akan terjadi secara tiba-tiba di saat mereka terlena oleh kenikmatan duniawi. Sebelum terlambat, di sini Allah meminta mereka agar beriman kepada Nabi Muhammad dan agama yang didakwahkannya.",
      "text_translation": "Apakah mereka hanya menunggu saja kedatangan hari Kiamat yang datang kepada mereka secara mendadak sedang mereka tidak menyadarinya?",
      "text": "هَلْ يَنْظُرُوْنَ اِلَّا السَّاعَةَ اَنْ تَأْتِيَهُمْ بَغْتَةً وَّهُمْ لَا يَشْعُرُوْنَ ",
      "text_translation_en": "ARE THEY [who are lost in sin] but waiting for the Last Hour - [waiting] that it come upon them of a sudden, without their being aware [of its approach]?",
      "juz_number": 25
    },
    "67": {
      "text_tafsir_en": "This verse explains that on the Day of Judgment, the friendship and intimate relationship between the unbelievers, both the relationship of friendship that exists between them and their relationship with the worship they worship other than Allah; will turn into hostility, and they will accuse each other. One friend accused another of his friends for being hell and miserable on that day, while the idols disregarded the worship of his worshipers while living on the earth because the idols were a dead thing to know little about what was his worshipers performed while living on earth. Each withdrew from the other party's allegations. The above is revealed by Abraham to his people as follows: And he said: \"The idols that you worship besides Allah, only to create love among you in the life of the world, then on the Day of Resurrection and ye shall know that I am the LORD your God: ye shall therefore love one another, and shall curse one another; (al-'Ankabut \/ 29: 25) 'Ali bin Abi bible said, \"Those who are friends (while in the world) will be hostile to some of them and to others on the Day of Judgment except those who fear.\" 'Ali continued, \"There were two believers, and two unbelievers were friends. Then one of the two believers died. He was informed that he had come to heaven, and he remembered his friends. He said,\" Yes Allah, verily, my friend's friend used to ask me to obey You and Your Messenger. He asked me for good, and rebuked me for the bad, and told me that I would meet you soon. Therefore, O Allah, do not deny Him after my departure, until You have shown him (Paradise), as You have shown me, until You have pleased him as You have pleased me. \" what I have provided for him by my side will surely make you laugh and cry a little. \"'Ali continued,\" Then another believer died, so that they met. After that, it was said to them, \"Let every one of you praise his friend.\" Then each one said, \"(You) are the best brother, friend, and friend.\" And if one of the two unbelieving friends dies, it is reported that he will go to hell. Then he remembered his friend, and he said, \"O God, surely my friend's friend has asked me to do evil to you and your apostle. He has asked me to do evil and to do good, telling me that I will not meet you. Therefore, O God, do not give him guidance after my departure, until you show him (Hell) as you showed me, and be angry with him as you were angry with me. \" Then 'Ali went on, \"and the other disbelievers, then they met, and then it was said to them,\" Let every one of you praise his friend. \"Then each one said,\" (You) are the worst brother , friends and lovers. (History of Ibn Abi's heart)",
      "text_tafsir": "Ayat ini menerangkan bahwa pada hari Kiamat, persahabatan dan hubungan akrab antara orang-orang kafir, baik hubungan persahabatan yang terjadi antara mereka maupun hubungan mereka dengan sembahan-sembahan yang mereka sembah selain Allah; akan berubah menjadi permusuhan, dan mereka akan saling tuduh satu dengan yang lain. Seorang teman menuduh temannya yang lain yang menjadi sebab ia masuk neraka dan sengsara pada hari itu, sedangkan berhala-berhala mengingkari penyembahan yang dilakukan penyembah-penyembahnya semasa hidup di dunia karena berhala-berhala itu sebagai benda mati tidak tahu-menahu sedikit pun tentang apa yang telah dilakukan penyembah-penyembahnya semasa hidup di dunia. Masing-masing berlepas diri dari tuduhan pihak yang lain.\n\nApa yang disebutkan di atas diungkapkan Nabi Ibrahim kepada kaumnya sebagai berikut: \n\nDan dia (Ibrahim) berkata, \"Sesungguhnya berhala-berhala yang kamu sembah selain Allah, hanya untuk menciptakan perasaan kasih sayang di antara kamu dalam kehidupan di dunia, kemudian pada hari Kiamat sebagian kamu akan saling mengingkari dan saling mengutuk; dan tempat kembalimu ialah neraka, dan sama sekali tidak ada penolong bagimu.\" (al-'Ankabut\/29: 25)\n\n'Ali bin Abi thalib berkata,\"Orang-orang yang berteman (sewaktu di dunia) akan menjadi bermusuhan antara sebagian mereka dengan sebagian yang lain pada hari Kiamat, kecuali orang-orang yang bertakwa.\" 'Ali melanjutkan, \"Ada dua orang Mukmin yang berteman, dan dua orang kafir yang berteman. Lalu salah seorang dari dua orang Mukmin itu meninggal dunia. Ia diberi kabar gembira dengan masuk surga, maka ia teringat teman-temannya. Ia berkata, \"Ya Allah, sesungguhnya si fulan temanku dahulu pernah mengajakku untuk taat kepada-Mu dan rasul-Mu. Ia mengajakku untuk kebaikan, serta melarangku dari keburukan, dan mengabarkan kepadaku bahwa kelak aku akan bertemu dengan-Mu. Oleh karena itu, ya Allah, jangan sesatkan dirinya setelah kepergianku, sampai saat Engkau memperlihatkan (surga)kepadanya, sebagaimana telah Engkau perlihatkan kepadaku, sampai Engkau rida kepadanya sebagaimana Engkau rida kepadaku.\" Kemudian dikatakan kepada Mukmin tersebut, \"Pergilah, seandainya kamu tahu apa yang Aku sediakan baginya disisi-Ku tentulah kamu akan banyak tertawa dan sedikit menangis.\" 'Ali melanjutkan, \"Lalu mukmin yang satu lagi meninggal, sehingga ruh mereka bertemu. Setelah itu, dikatakan kepada mereka, \"Hendaklah masing-masing kalian memuji temannya.\" Maka masing-masing mereka berkata, \"(Engkau)adalah sebaik-baiknya saudara, sahabat, dan teman.\" \n\nDan apabila meninggal dunia satu diantara dua teman yang kafir, maka ia dikabari akan masuk neraka. Lalu ia teringat temannya, maka ia berkata, \"Ya Allah, sesungguhnya si fulan temanku pernah mengajakku untuk durhaka kepada-Mu dan rasul-Mu.Ia mengajakku untuk berbuat jahat dan melarangku berbuat baik, memberitahu kepadaku bahwa aku tidak akan bertemu dengan-Mu. Oleh karena itu ya Allah, janganlah Engkau beri petunjuk kepadanya setelah kepergianku, sampai Engkau tunjukkan sesuatu (neraka) seperti yang Engkau tunjukkan kepadaku, dan murkailah dia seperti Engkau murka kepadaku.\" lalu 'Ali melanjutkan, \"lalu orang kafir yang satu lagi, maka ruh mereka bertemu. Setelah itu dikatakan kepada mereka, \"Hendaklah masing-masing kalian memuji temannya.\" Maka masing-masing mereka berkata, \"(Engkau) adalah seburuk-buruk saudara, teman dan kekasih. (Riwayat Ibn Abi hatim)",
      "text_translation": "Teman-teman karib pada hari itu saling bermusuhan satu sama lain, kecuali mereka yang bertakwa.",
      "text": "اَلْاَخِلَّاۤءُ يَوْمَىِٕذٍۢ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ اِلَّا الْمُتَّقِيْنَ ۗ ࣖ",
      "text_translation_en": "On that Day, [erstwhile] friends will be foes unto one another - [all] save the God-conscious.",
      "juz_number": 25
    },
    "68": {
      "text_tafsir_en": "In this verse is explained God's statement to the believers, at the time of the Resurrection, when all mankind is in confusion and fear. Allah said to them, \"My servants, you have nothing to fear and fear on the Day of Judgment; you have all walked the straight path of life in the world and have done everything because of your love for me and because You are seeking my happiness. Therefore, today, you are under my protection and in the security of my safety. My servants, do not grieve for the separation of the world and do not worry about living on You must be sure that from this moment on, you have escaped every trial and disaster that may come upon you, and at this time you will be in the most unfathomable place, a paradise of perfect enjoyment. \"",
      "text_tafsir": "Dalam ayat ini diterangkan pernyataan Allah kepada orang-orang yang beriman, di waktu terjadinya hari Kiamat, yang pada saat itu semua manusia berada dalam kebingungan dan ketakutan. Allah berkata kepada mereka, \"Wahai hamba-hamba-Ku, tidak ada sesuatu pun yang perlu kamu takutkan dan khawatirkan pada hari Kiamat, kamu semua telah menempuh jalan yang lurus selama hidup di dunia dan telah melakukan segala sesuatu karena cintamu kepada-Ku dan karena kamu mencari keridaan-Ku. Karena itu, pada hari ini, kamu semua berada di bawah perlindungan-Ku dan dalam jaminan keamanan dari-Ku. Wahai hamba-hamba-Ku, janganlah kamu bersedih hati karena berpisah dengan dunia dan janganlah khawatir menghadapi hidup pada masa yang akan datang. Hendaklah kamu yakin bahwa sejak saat ini, kamu telah lepas dari segala cobaan dan malapetaka yang akan menimpamu, dan pada saat ini pula kamu akan menempati tempat yang paling baik yang tak ada tandingannya, yaitu surga yang mempunyai kenikmatan yang sempurna.\"",
      "text_translation": "”Wahai hamba-hamba-Ku! Tidak ada ketakutan bagimu pada hari itu dan tidak pula kamu bersedih hati.",
      "text": "يٰعِبَادِ لَاخَوْفٌ عَلَيْكُمُ الْيَوْمَ وَلَآ اَنْتُمْ تَحْزَنُوْنَۚ ",
      "text_translation_en": "[And God will say:] “O you servants of Mine! No fear need you have today, and neither shall you grieve –",
      "juz_number": 25
    },
    "69": {
      "text_tafsir_en": "In this verse, it is explained that the servants whom God called on that day were the servants who believed in His revelations, whose souls were submissive and obedient to Him, who kept all His commandments and removed the prohibitions -Yes. In the Commentary Ibn Katsir is quoted as saying that al-Mu'tamir bin Sulaiman from his father said, \"At the time of the Resurrection, when mankind was raised from the grave, no one was afraid and worried and confused. At that time there was a sound.\" My servants, you have nothing to fear and worry about today and do not worry. \"Upon hearing this, all people hoped that he would be among the servants of God referred to in that call, again a second cry. , \"O you who believe in our Signs, who are submissive and surrender to God.\" Hearing this cry, the believers rejoice and their sorrow, their fear and their confusion are lost. .",
      "text_tafsir": "Dalam ayat ini, diterangkan tentang hamba-hamba yang diseru Allah pada hari itu yaitu hamba-hamba yang telah beriman kepada ayat-ayat-Nya, yang jiwanya telah tunduk dan patuh kepada-Nya, yang melaksanakan semua perintah-Nya dan menjauhkan larangan-larangan-Nya.\n\nDalam Tafsir Ibnu Katsir disebutkan bahwa al-Mu'tamir bin Sulaiman dari ayahnya berkata, \"Pada waktu terjadinya hari Kiamat, ketika manusia dibangkitkan dari kuburnya, tidak ada seorang pun yang tidak merasa takut dan khawatir serta bingung. Ketika itu, terdengarlah suara, \"Wahai hamba-hamba-Ku, tidak ada yang perlu kamu takuti dan khawatirkan pada hari ini dan janganlah kamu risau hati.\" Setelah mendengar itu, semua manusia mengharapkan agar ia termasuk hamba-hamba Allah yang dimaksud dalam seruan itu, terdengar lagi seruan yang kedua, \"Wahai orang-orang yang beriman kepada ayat-ayat Kami, yang tunduk dan berserah diri kepada Allah.\" Mendengar seruan itu, maka orang-orang yang beriman bergembira dan hilanglah kesedihan, ketakutan dan kebingungan mereka. Sedangkan orang-orang kafir berputus asa.",
      "text_translation": "(Yaitu) orang-orang yang beriman kepada ayat-ayat Kami dan mereka berserah diri.",
      "text": "اَلَّذِيْنَ اٰمَنُوْا بِاٰيٰتِنَا وَكَانُوْا مُسْلِمِيْنَۚ ",
      "text_translation_en": "[O you] who have attained to faith in Our messages and have surrendered your own selves unto Us!",
      "juz_number": 25
    },
    "70": {
      "text_tafsir_en": "Then came the next cry, \"O you who believe! Enter you and your wives into the heaven which was promised to you, and rejoice and rejoice in it, enjoying the grace of God which has been given to you all. In another verse, it is explained that believers, along with their wives and grandchildren who believe, will be raised in heaven, just as their fathers were strong and faithful. And those who believe, with their grandchildren who follow them in faith, We find them with their grandchildren (in heaven), and We do not diminish the deeds of their charity. Everyone is bound by what he does. . (ath-thur \/ 52: 21)",
      "text_tafsir": "Kemudian terdengar pula seruan berikutnya, \"Wahai orang-orang yang beriman, masuklah kamu dan istri-istrimu ke dalam surga yang telah dijanjikan kepadamu dahulu, bersenang-senang dan bersuka-rialah di dalamnya menikmati karunia Allah yang telah dilimpahkan kepada kamu semua. Karena Allah memuliakan mereka dengan memasukkan ke dalam surga.\n\nDalam ayat yang lain, diterangkan bahwa orang-orang yang beriman beserta istri dan anak cucu mereka yang beriman akan ditinggikan derajatnya di dalam surga, seperti derajat bapak-bapak mereka yang mantap dan kuat imannya. Allah berfirman:\n\nDan orang-orang yang beriman, beserta anak cucu mereka yang mengikuti mereka dalam keimanan, Kami pertemukan mereka dengan anak cucu mereka (di dalam surga), dan Kami tidak mengurangi sedikit pun pahala amal (kebajikan) mereka. Setiap orang terikat dengan apa yang dikerjakannya. (ath-thur\/52: 21)",
      "text_translation": "Masuklah kamu ke dalam surga, kamu dan pasanganmu akan digembirakan.”",
      "text": "اُدْخُلُوا الْجَنَّةَ اَنْتُمْ وَاَزْوَاجُكُمْ تُحْبَرُوْنَ ",
      "text_translation_en": "Enter paradise, you and your spouses, with happiness blest!”",
      "juz_number": 25
    },
    "71": {
      "text_tafsir_en": "After believers and their families enter heaven, the waitresses come to them carrying golden plates of delicious food and tropical and spiritual refreshments. In that paradise they have everything they want, everything that warms and calms their hearts, all that is beautiful in their sight and hearing. It is impossible to describe the state of heaven before, for all of it has never been compared and compared to earthly life. It is also said that those who believe and do good will remain in heaven to enjoy the pleasures of life.",
      "text_tafsir": "Setelah orang-orang yang beriman beserta keluarga mereka masuk surga, datanglah kepada mereka pelayan-pelayan membawa piring-piring emas yang berisi makanan-makanan yang lezat dan piala-piala yang berisi minuman yang menyegarkan jasmani dan rohani. Di dalam surga itu mereka memperoleh semua yang mereka inginkan, semua yang menyejukkan dan menenteramkan hati mereka, semua yang indah menurut pandangan dan pendengaran mereka. Tidaklah dapat digambarkan keadaan surga itu sebelumnya, karena semuanya itu belum pernah ada contoh dan bandingannya dalam kehidupan duniawi. Dinyatakan pula bahwa orang-orang yang beriman dan beramal saleh akan kekal di dalam surga mengecap kenikmatan hidup di dalamnya.",
      "text_translation": "Kepada mereka diedarkan piring-piring dan gelas-gelas dari emas, dan di dalam surga itu terdapat apa yang diingini oleh hati dan segala yang sedap (dipandang) mata. Dan kamu kekal di dalamnya.",
      "text": "يُطَافُ عَلَيْهِمْ بِصِحَافٍ مِّنْ ذَهَبٍ وَّاَكْوَابٍ ۚوَفِيْهَا مَا تَشْتَهِيْهِ الْاَنْفُسُ وَتَلَذُّ الْاَعْيُنُ ۚوَاَنْتُمْ فِيْهَا خٰلِدُوْنَۚ ",
      "text_translation_en": "[And there] they will be waited upon with trays and goblets of gold; and there will be found all that the souls might desire, and [all that] the eyes might delight in. And therein shall you abide, [O you who believe:]",
      "juz_number": 25
    },
    "72": {
      "text_tafsir_en": "Such is the paradise that believers will receive in return for their faith and righteousness. Believers and virtuous people go to heaven, solely by the grace of God and His grace. Because the faith and deeds of the believers are different, they will receive different responses. Those who have the best faith and deeds will be placed in the highest heaven, and those who lack faith and charity will be in the least heaven. Abu Hurairah narrated that the Messenger of Allah (may peace be upon him) said, \"There is no one but a place in heaven and a place in hell. This is what the word of God says, \"And this is the heaven which is given to you. . . \"(History of Ibn Abi atim)",
      "text_tafsir": "Demikianlah surga yang akan diperoleh oleh orang-orang yang beriman sebagai balasan keimanan dan amal saleh yang telah mereka lakukan. Orang-orang yang beriman dan beramal saleh itu masuk surga, semata-mata karena rahmat Allah dan karunia-Nya. Karena iman dan amal yang dilakukan orang mukmin itu berbeda-beda, maka mereka akan menerima balasan yang berbeda-beda pula. Orang yang paling baik iman dan amalnya akan ditempatkan di dalam surga yang paling tinggi pula derajatnya, dan orang yang kurang iman dan amalnya akan ditempatkan di surga yang kurang pula derajatnya.\n\nAbu Hurairah meriwayatkan bahwa Rasulullah saw bersabda, \"Tidak ada seorang pun melainkan mempunyai sebuah tempat di dalam surga dan sebuah tempat di dalam neraka. Maka tempat orang Mukmin di dalam neraka diwariskan kepada orang kafir, dan tempat orang kafir di dalam surga diwariskan kepada orang Mukmin. Demikianlah yang dimaksud dengan firman Allah, \"Dan itulah surga yang diwariskan kepada kamu . . .\" (Riwayat Ibnu Abi hatim)",
      "text_translation": "Dan itulah surga yang diwariskan kepada kamu disebabkan amal perbuatan yang telah kamu kerjakan.",
      "text": "وَتِلْكَ الْجَنَّةُ الَّتِيْٓ اُوْرِثْتُمُوْهَا بِمَا كُنْتُمْ تَعْمَلُوْنَ ",
      "text_translation_en": "for such will be the paradise which you shall have inherited by virtue of your past deeds:",
      "juz_number": 25
    },
    "73": {
      "text_tafsir_en": "This verse describes the fruits that believers in heaven will receive. They will produce an infinite number of fruits and varieties of different kinds. They can eat it at the time, place, and situation they want.",
      "text_tafsir": "Dalam ayat ini diterangkan macam-macam buah-buahan yang akan diperoleh oleh orang-orang yang beriman di dalam surga. Mereka akan memperoleh buah-buahan yang tidak terhingga banyak dan jenisnya dengan bermacam-macam rasa. Mereka dapat memakannya pada waktu, tempat, dan keadaan yang mereka kehendaki.",
      "text_translation": "Di dalam surga itu terdapat banyak buah-buahan untukmu yang sebagiannya kamu makan.",
      "text": "لَكُمْ فِيْهَا فَاكِهَةٌ كَثِيْرَةٌ مِّنْهَا تَأْكُلُوْنَ",
      "text_translation_en": "fruits [of those deeds] shall you have in abundance, [and] thereof shall you partake!",
      "juz_number": 25
    },
    "74": {
      "text_tafsir_en": "This verse explains that those who disobey God in the world, do the prohibition and break the commandments of God, will be cast into Hell, in return for their disbelief; they remain in it and cannot go out for a moment. The doom of the disbelievers will not be alleviated in the least, so that they will continue in pain and confusion. They were desperate because their request to Allah for their release from the torment was not granted.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang mengingkari Allah di dunia, mengerjakan larangan dan mengingkari perintah-perintah Allah, mereka akan dimasukkan ke dalam neraka Jahanam, sebagai balasan kekafiran mereka; mereka kekal di dalamnya dan tidak dapat keluar walaupun sesaat.\n\nAzab yang ditimpakan kepada orang-orang kafir itu tidak akan diringankan walau sedikit pun, sehingga mereka terus-menerus dalam kesakitan dan kebingungan. Mereka putus asa karena permohonan yang mereka ajukan kepada Allah agar mereka dibebaskan dari azab itu tidak dikabulkan.",
      "text_translation": "Sungguh, orang-orang yang berdosa itu kekal di dalam azab neraka Jahanam.",
      "text": "اِنَّ الْمُجْرِمِيْنَ فِيْ عَذَابِ جَهَنَّمَ خٰلِدُوْنَۖ ",
      "text_translation_en": "[But,] behold, they who are lost in sin shall abide in the suffering of hell:",
      "juz_number": 25
    },
    "75": {
      "text_tafsir_en": "This verse explains that those who disobey God in the world, do the prohibition and break the commandments of God, will be cast into Hell, in return for their disbelief; they remain in it and cannot go out for a moment. The doom of the disbelievers will not be alleviated in the least, so that they will continue in pain and confusion. They were desperate because their request to Allah for their release from the torment was not granted.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang mengingkari Allah di dunia, mengerjakan larangan dan mengingkari perintah-perintah Allah, mereka akan dimasukkan ke dalam neraka Jahanam, sebagai balasan kekafiran mereka; mereka kekal di dalamnya dan tidak dapat keluar walaupun sesaat.\n\nAzab yang ditimpakan kepada orang-orang kafir itu tidak akan diringankan walau sedikit pun, sehingga mereka terus-menerus dalam kesakitan dan kebingungan. Mereka putus asa karena permohonan yang mereka ajukan kepada Allah agar mereka dibebaskan dari azab itu tidak dikabulkan.",
      "text_translation": "Tidak diringankan (azab) itu dari mereka, dan mereka berputus asa di dalamnya.",
      "text": "لَا يُفَتَّرُ عَنْهُمْ وَهُمْ فِيْهِ مُبْلِسُوْنَ ۚ ",
      "text_translation_en": "it will not be lightened for them; and therein they will be lost in hopeless despair.",
      "juz_number": 25
    },
    "76": {
      "text_tafsir_en": "In this verse explaining why they were punished, Allah declares, \"We do not intend to persecute the unbelievers by punishing them, for We have given them sufficient warning throughout their lives, but they have ignored them. denying the Messengers whom We sent and persecuting them even when they were given sufficient evidence, for their actions were punished, which meant that they themselves were persecuting themselves.",
      "text_tafsir": "Dalam ayat ini diterangkan apa sebabnya mereka ditimpa azab itu, Allah menyatakan, \"Kami tidak bermaksud menganiaya orang-orang kafir dengan mengazab mereka, karena Kami telah memberikan peringatan yang cukup kepada mereka selama hidup di dunia, tetapi mereka tidak menghiraukannya sedikit pun. Bahkan mereka mendustakan rasul-rasul yang Kami utus kepada mereka dan menganiaya para rasul itu walaupun telah dikemukakan bukti-bukti yang cukup kepada mereka. Karena tindakan mereka itulah, mereka diazab, ini berarti bahwa mereka sendirilah yang menganiaya diri mereka sendiri.",
      "text_translation": "Dan tidaklah Kami menzalimi mereka, tetapi merekalah yang menzalimi diri mereka sendiri.",
      "text": "وَمَا ظَلَمْنٰهُمْ وَلٰكِنْ كَانُوْا هُمُ الظّٰلِمِيْنَ",
      "text_translation_en": "And it is not We who will be doing wrong unto them, but it is they who will have wronged them­selves.",
      "juz_number": 25
    },
    "77": {
      "text_tafsir_en": "Because of the severity of the torture they suffered, they called on the angel of Malik, the keeper of the hell, to ask the angel of God that they should be put to death; us, until we miss or miss this torture. \" The angel answered, \"There is no way for you to come out of this hell because God has decided that you will live in hell forever.\" Allah says: And those who disbelieve, to them Hell. They are not destroyed until they die, and their punishment is not lightened. Thus We reward every disbeliever. (Fathir \/ 35: 36) In another verse: And those who are unfaithful (disbelievers) will avoid it, (that is) those who will enter the great fire (Fire), and there he will not die and will not (live). (al-A'la \/ 87: 11-13)",
      "text_tafsir": "Karena beratnya siksaan yang diderita mereka, maka mereka memanggil malaikat Malik, penjaga neraka, agar malaikat itu meminta kepada Allah supaya mereka dimatikan saja, sehingga mereka terbebas dari siksaan itu, mereka mengatakan, \"Hai malaikat Malik, mohonkanlah kepada Allah agar Dia mencabut saja nyawa kami, sehingga kami terlepas atau tidak merasakan lagi siksaan ini.\" Malaikat itu menjawab, \"Tidak ada satu jalan pun bagimu untuk keluar dari neraka ini karena Allah telah memutuskan, bahwa kamu tinggal di dalam neraka selama-lamanya.\"\n\nAllah berfirman:\n\nDan orang-orang yang kafir, bagi mereka neraka Jahanam. Mereka tidak dibinasakan hingga mereka mati, dan tidak diringankan dari mereka azabnya. Demikianlah Kami membalas setiap orang yang sangat kafir. (Fathir\/35: 36)\n\nDalam ayat lain:\n\nDan orang-orang yang celaka (kafir) akan menjauhinya,(yaitu) orang yang akan memasuki api yang besar (neraka), selanjutnya dia di sana tidak mati dan tidak (pula) hidup. (al-A'la\/87: 11-13)",
      "text_translation": "Dan mereka berseru, “Wahai (Malaikat) Malik! Biarlah Tuhanmu mematikan kami saja.” Dia menjawab, “Sungguh, kamu akan tetap tinggal (di neraka ini).”",
      "text": "وَنَادَوْا يٰمٰلِكُ لِيَقْضِ عَلَيْنَا رَبُّكَۗ قَالَ اِنَّكُمْ مَّاكِثُوْنَ",
      "text_translation_en": "And they will cry: “O thou [angel] who rulest [over hell]! Let thy Sustainer put an end to us!” - whereupon] he will reply: “Verily, you must live on [in this state]",
      "juz_number": 25
    },
    "78": {
      "text_tafsir_en": "To those who were tormented in hell it was said, \"O unbelievers! We have made clear all the truth and the straight path through the mediation of our apostles and our books when ye were in the world. even though you hate the truth and those who follow it, so mourn yourself now and regret yourself, when all regret is worthless and repentance is gone.",
      "text_tafsir": "Kepada orang-orang yang sedang diazab dalam neraka itu dikatakan, \"Hai orang-orang kafir, sesungguhnya Kami telah menerangkan semua yang benar dan jalan yang lurus dengan perantaraan rasul-rasul dan kitab-kitab Kami waktu kamu di dunia dahulu. Akan tetapi kamu tidak menerima kebenaran itu, bahkan kamu membenci kebenaran itu serta orang-orang yang mengikuti kebenaran itu. Karena itu, celakalah dirimu sekarang dan sesalilah sendiri, pada saat semua penyesalan tidak berguna lagi dan tobat telah pula tertutup.",
      "text_translation": "Sungguh, Kami telah datang membawa kebenaran kepada kamu tetapi kebanyakan di antara kamu benci pada kebenaran itu.",
      "text": "لَقَدْ جِئْنٰكُمْ بِالْحَقِّ وَلٰكِنَّ اَكْثَرَكُمْ لِلْحَقِّ كٰرِهُوْنَ",
      "text_translation_en": "INDEED, [O you sinners,] We have conveyed the truth unto you; but most of you abhor the truth.",
      "juz_number": 25
    },
    "79": {
      "text_tafsir_en": "In this verse, it is explained that the unbelievers are put into hell because they have been living in the world constantly trying to reject all truth by resorting to various forms of deception. So Allah destroyed and thwarted all their deceit. In another verse God says: And they devise deceit, and We devise deceptions, and they know it not. (an-Naml \/ 27: 50) The Word of God: Or do they intend to deceive? But those who disbelieve, it is they who are deceived. (ath-thur \/ 52: 42)",
      "text_tafsir": "Dalam ayat ini, diterangkan sebab orang-orang kafir dimasukkan ke dalam neraka yaitu karena mereka selama hidup di dunia selalu berusaha menolak semua kebenaran dengan melakukaan bermacam tipu daya. Maka Allah menghancurkan dan menggagalkan semua tipu daya mereka itu.\n\nDalam ayat yang lain Allah berfirman:\n\nDan mereka membuat tipu daya, dan Kami pun menyusun tipu daya, sedang mereka tidak menyadari. (an-Naml\/27: 50)\n\nFirman Allah:\n\nAtaukah mereka hendak melakukan tipu daya? Tetapi orang-orang yang kafir itu, justru merekalah yang terkena tipu daya. (ath-thur\/52: 42)",
      "text_translation": "Ataukah mereka telah merencanakan suatu tipu daya (jahat), maka sesungguhnya Kami telah berencana (mengatasi tipu daya mereka).",
      "text": "اَمْ اَبْرَمُوْٓا اَمْرًا فَاِنَّا مُبْرِمُوْنَۚ",
      "text_translation_en": "Why - can they [who deny the truth ever] determine what [the truth] should be?",
      "juz_number": 25
    },
    "80": {
      "text_tafsir_en": "Narrated by Ibn Jarir that Muhammad ibn Ka'ab al-Quradzi said, \"When three people are between the Kaaba and its lambs, two are from the Quraysh tribe and one from the Saqafi tribe, then one of them said,\" What is your opinion, Did God hear our conversation? \"The second person answered,\" If you raise your voice, He hears it, whereas if you whisper, He does not hear it. \" if you whisper. \"Then this verse comes down. Looking at the attitudes and actions of unbelievers while living in the world, it is as if they do not believe that God knows everything; then it is said about them.\" whisper their hearts, and do not know all that they are discussing in secret in compiling the deception? \"With this verse Allah confirms by saying,\" We know all they planned and heard all their whispers, there was nothing that we did not know, besides, the angel hafadzah always wrote and recorded all their behavior in the form of words and deeds. God's Word: (Remember) when two angels record (his deeds), one sitting on the right and the other on the left. There was not a word he said but there was on his side the guardian angel who was always ready (taking notes). (Qaf \/ 50: 17-18)",
      "text_tafsir": "Diriwayatkan oleh Ibnu Jarir bahwa Muhammad bin Ka'ab al-Quradzi berkata, \"Ketika tiga orang berada di antara Ka'bah dan kelambunya, dua orang dari suku Quraisy dan seorang dari suku Saqafi, maka salah seorang dari mereka berkata, \"Bagaimanakah pendapatmu, apakah Allah mendengar pembicaraan kita?\" Orang yang kedua menjawab, \"Apabila kamu keraskan suaramu, Dia mendengarnya, sedangkan apabila engkau berbisik, Dia tidak mendengarnya.\" Orang yang ketiga berkata, \"Jika Dia mendengar bila kamu keraskan suaramu, tentu Dia mendengar pula, bila kamu berbisik.\" Maka turunlah ayat ini.\n\nMelihat sikap dan tindakan orang-orang kafir semasa hidup di dunia, mereka seakan-akan tidak percaya bahwa Allah mengetahui segala sesuatu; maka dikatakan tentang mereka. \"Apakah mereka menyangka bahwa Kami tidak mendengar bisikan-bisikan hati mereka, dan tidak mengetahui semua yang mereka perbincangkan secara rahasia dalam menyusun tipu daya itu?\"\n\nDengan ayat ini Allah menegaskan dengan mengatakan, \"Kami mengetahui segala yang mereka rencanakan dan mendengar semua bisikan-bisikan mereka, tidak ada sesuatu pun yang tidak kami ketahui, di samping itu, malaikat hafadzah selalu menulis dan mencatat semua perilaku mereka baik berupa perkataan maupun perbuatan. Firman Allah:\n\n(Ingatlah) ketika dua malaikat men-catat (perbuatannya), yang satu duduk di sebelah kanan dan yang lain di sebelah kiri. Tidak ada suatu kata yang diucapkannya melainkan ada di sisinya malaikat pengawas yang selalu siap (mencatat). (Qaf\/50: 17-18)",
      "text_translation": "Ataukah mereka mengira, bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka? Sebenarnya (Kami mendengar), dan utusan-utusan Kami (malaikat) selalu mencatat di sisi mereka.",
      "text": "اَمْ يَحْسَبُوْنَ اَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوٰىهُمْ ۗ بَلٰى وَرُسُلُنَا لَدَيْهِمْ يَكْتُبُوْنَ ",
      "text_translation_en": "Or do they, perchance, think that We do not hear their hidden thoughts and their secret confabulations? Yea, indeed, [We do,] and Our heavenly forces are with them, recording [all].",
      "juz_number": 25
    },
    "81": {
      "text_tafsir_en": "Allah ordered Prophet Muhammad (peace be upon him) to tell the Meccans of the Mecca that if Allah had Mercy had children and they could prove his truth with strong reasons, then Muhammad would be the first to acknowledge and respect- He is, as one honors the son of a king for honoring his father. This opinion is based on the fact that the son of God is part of God, and therefore his son's position is the same as his own. The above sense shows an assertion that it is impossible for God. God's Word: If God were to raise children, then He would choose what He wanted from what He created. He is holy. He is the Almighty, the Almighty. (az-Zumar \/ 39: 4)",
      "text_tafsir": "Allah memerintahkan kepada Nabi Muhammad saw untuk mengatakan kepada orang-orang musyrik Mekah, bahwa seandainya ar-Rahman, Tuhan Yang Maha Pemurah mempunyai anak dan mereka dapat membuktikan kebenarannya dengan alasan-alasan yang kuat, maka Nabi Muhammad adalah orang pertama yang mengakui dan mengagungkan-Nya, sebagaimana orang memuliakan anak seorang raja karena memuliakan bapaknya. Pendapat ini berdasar karena bahwa anak tuhan merupakan bagian dari Tuhan, karena itu kedudukan putranya itu sama dengan kedudukan-Nya sendiri.\n\nPengertian di atas menunjukkan suatu penegasan bahwa hal tersebut sangat mustahil bagi Allah. Firman Allah:\n\nSekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang Dia kehendaki dari apa yang telah diciptakan-Nya. Mahasuci Dia. Dialah Allah Yang Maha Esa, Mahaperkasa. (az-Zumar\/39: 4)",
      "text_translation": "Katakanlah (Muhammad), “Jika benar Tuhan Yang Maha Pengasih mempunyai anak, maka akulah orang yang mula-mula memuliakan  (anak itu).",
      "text": "قُلْ اِنْ كَانَ لِلرَّحْمٰنِ وَلَدٌ  ۖفَاَنَا۠ اَوَّلُ الْعٰبِدِيْنَ ",
      "text_translation_en": "Say [O Prophet]: “If the Most Gracious [truly] had a son, I would be the first to worship him!”",
      "juz_number": 25
    },
    "82": {
      "text_tafsir_en": "This verse expresses the purity of God from the point of view of those who say, \"The holiness of God who has heaven and earth and all that is therein, He has a 'Great God, it is impossible for Allah to have a child as they say.\"",
      "text_tafsir": "Ayat ini menyatakan kesucian Allah dari anggapan orang-orang musyrik itu dengan menyatakan, \"Mahasuci Allah yang memiliki langit dan bumi beserta semua yang ada di dalamnya, Dia memiliki 'Arsy yang agung, mustahil bagi Allah mempunyai seorang anak seperti yang dikatakan mereka.\"",
      "text_translation": "Mahasuci Tuhan pemilik langit dan bumi, Tuhan pemilik ‘Arsy, dari apa yang mereka sifatkan itu.”",
      "text": "سُبْحٰنَ رَبِّ السَّمٰوٰتِ وَالْاَرْضِ رَبِّ الْعَرْشِ عَمَّا يَصِفُوْنَ ",
      "text_translation_en": "Utterly remote, in His glory, is the Sustainer of the heavens and the earth - the Sustainer, in almigh­tiness enthroned from all that they may attribute to Him by way of definition!",
      "juz_number": 25
    },
    "83": {
      "text_tafsir_en": "Because the disbelievers did not want to change their faithless and perverted faith, Allah sent a message to the Messenger of Allah, \"O Muhammad, let those who make lies about Allah say that He has children, discuss their lies and let them live in bliss in this world, until the punishment that God has promised them.",
      "text_tafsir": "Karena orang-orang musyrik itu tidak mau mengubah kepercayaan mereka yang batil dan sesat itu, maka Allah menyampaikan pesan kepada Rasulullah, \"Ya Muhammad, biarkanlah orang-orang yang membuat dusta tentang Allah dengan mengatakan bahwa Dia mempunyai anak, membincangkan kebohongan mereka dan biarkanlah mereka hidup bersenang-senang dalam kekafiran di dunia ini, sampai datang azab yang dijanjikan Allah kepada mereka.",
      "text_translation": "Maka biarkanlah mereka tenggelam (dalam kesesatan) dan bermain-main sampai mereka menemui hari yang dijanjikan kepada mereka.",
      "text": "فَذَرْهُمْ يَخُوْضُوْا وَيَلْعَبُوْا حَتّٰى يُلٰقُوْا يَوْمَهُمُ الَّذِيْ يُوْعَدُوْنَ",
      "text_translation_en": "But leave them to indulge in idle talk and play [with words] until they face that [Judgment] Day of theirs which they have been promised:",
      "juz_number": 25
    },
    "84": {
      "text_tafsir_en": "In this verse it is reiterated that God has a child by declaring, \"He is the worshiper of the heavens and the inhabitants of the earth; He alone is worthy of worship; something according to nature, purpose and benefit, and He alone knows their condition, whether they see it or not, and He knows all the hearts of men. In this verse there are two types of God, namely, the judge and the pious. If God had the attributes of the judges and the pious, his sons would have those same qualities, but given the nature of what they call the sons of God, they are different from the attributes of God. -Lata, al-Uzza and Manat worshiped by the Meccan monks, are all dead beings who cannot do and know anything. Jesus also admits that the Christians are believed to be the children of God by the Christians, whereas the Christians themselves admit that he sometimes does not know and does not have the wisdom to carry out all his actions. It was not Jesus who wept when he heard the news of the death of an innocent man and asked his followers to reveal the body of the slain. Such behavior is certainly not appropriate for someone who is believed to be the son of God.",
      "text_tafsir": "Dalam ayat ini ditegaskan lagi kemustahilan Allah mempunyai anak dengan menyatakan, \"Hanya Dialah yang disembah oleh penghuni langit dan penghuni bumi, hanya Dia sajalah yang berhak disembah, tidak ada yang lain, karena Dialah Tuhan yang segala tindakan-Nya mempunyai hikmah dalam menciptakan dan melakukan sesuatu sesuai dengan sifat, guna dan faedahnya, dan hanya Dia pula yang Maha Mengetahui keadaan mereka, baik yang nampak maupun yang tidak nampak, dan Dia Maha Mengetahui segala isi hati manusia.\n\nDalam ayat ini disebutkan dua macam sifat Allah yaitu hakim dan 'alim. Bila Allah mempunyai sifat hakim dan 'alim, tentulah putra-Nya mempunyai sifat-sifat itu pula. Namun jika diperhatikan sifat-sifat yang dipunyai oleh yang mereka katakan anak Tuhan itu, ternyata sifatnya berbeda dengan sifat-sifat Tuhan. Sebagaimana patung-patung al-Lata, al-Uzza dan Manat yang disembah oleh orang-orang musyrik Mekah, semuanya adalah benda-benda mati yang tidak dapat berbuat dan mengetahui sesuatu pun. Demikian pula Nabi Isa yang dipercayai sebagai anak Allah oleh orang Nasrani, padahal orang Nasrani sendiri mengakui bahwa Isa itu kadang-kadang tidak mengetahui dan tidak mempunyai hikmah dalam melakukan segala tindakan-tindakannya. Bukanlah Isa pernah menangis ketika mendengar berita terbunuhnya seseorang yang tidak bersalah sehingga ia minta kepada pengikut-pengikutnya supaya menunjukkan kuburan orang yang terbunuh itu. Sifat yang demikian tentu tidak wajar pada seseorang yang diyakini sebagai putra Allah.",
      "text_translation": "Dan Dialah Tuhan (yang disembah) di langit dan Tuhan (yang disembah) di bumi dan Dialah Yang Mahabijaksana, Maha Mengetahui.",
      "text": "وَهُوَ الَّذِيْ فِى السَّمَاۤءِ اِلٰهٌ وَّ فِى الْاَرْضِ اِلٰهٌ ۗوَهُوَ الْحَكِيْمُ الْعَلِيْمُ ",
      "text_translation_en": "for [then they will come to know that] it is He [alone] who is God in heaven and God on earth, and [that] He alone is truly wise, all-knowing.",
      "juz_number": 25
    },
    "85": {
      "text_tafsir_en": "The Holy of God who possesses and rules the kingdom of heaven and earth and all its contents, and other realms that are not or are not yet known. He is the one who has knowledge of the Day of Judgment. No one knows when that day will come. All things were restored to Him, and then He rewarded all human deeds with a fair reward.",
      "text_tafsir": "Mahasuci Allah yang memiliki dan menguasai kerajaan langit dan bumi beserta semua isinya, dan alam-alam lain yang tidak atau belum diketahui hakikat dan keadaannya. Dialah yang mempunyai pengetahuan tentang hari Kiamat. Tidak seorang pun yang mengetahui kapan terjadinya hari Kiamat itu. Kepada-Nyalah kembali segala sesuatu, kemudian Dia membalas semua amal perbuatan manusia dengan balasan yang setimpal.",
      "text_translation": "Dan Mahasuci (Allah) yang memiliki kerajaan langit dan bumi, dan apa yang ada di antara keduanya; dan di sisi-Nyalah ilmu tentang hari Kiamat dan hanya kepada-Nyalah kamu dikembalikan.",
      "text": "وَتَبٰرَكَ الَّذِيْ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا ۚوَعِنْدَهٗ عِلْمُ السَّاعَةِۚ وَاِلَيْهِ تُرْجَعُوْنَ",
      "text_translation_en": "And hallowed be He unto whom the dominion over the heavens and the earth and all that is between them belongs, and with whom the knowledge of the Last Hour rests, and unto whom you all shall be brought back!",
      "juz_number": 25
    },
    "86": {
      "text_tafsir_en": "This verse explains that all idols and gods are worshiped by the idolaters for their intercession, while the idols have no power to do and have nothing, even they themselves are controlled and possessed by their worshipers. Could they have interceded in such a situation? As for those who speak the words of monotheism, understand it and believe it, it is in accordance with the guidance of God, like the angel, Jesus, so their intercession benefits God, and Allah will intercede for those who deserve it. Sa'id bin Jubair said, \"The purpose of this verse is: the idols do not intercede in the least, they can only intercede for those who confess the truth, believe in God based on their learned knowledge, and their vision.",
      "text_tafsir": "Ayat ini menerangkan bahwa semua berhala dan dewa-dewa disembah oleh orang-orang musyrik untuk mendapat syafaatnya, padahal berhala itu tidak kuasa berbuat dan tidak memiliki sesuatu pun, bahkan mereka itu sendiri dikuasai dan dimiliki oleh penyembah-penyembahnya. Mungkinkah mereka memberikan syafaat dalam keadaan demikian? Adapun orang-orang yang mengucapkan kalimat tauhid, memahami serta meyakininya, ia berjalan sesuai dengan petunjuk Allah, seperti malaikat, Nabi Isa, maka syafaat mereka berfaedah di sisi Allah, dan Allah akan memberikan syafaat kepada orang-orang yang pantas menerimanya.\n\nSa'id bin Jubair berkata, \"Maksud ayat ini ialah: berhala-berhala itu tidak memberi syafaat sedikit pun, yang bisa memberi syafaat itu hanyalah orang yang mengakui kebenaran, beriman kepada Allah berdasarkan ilmu yang dipelajari, dan pandangannya yang jauh.",
      "text_translation": "Dan orang-orang yang menyeru kepada selain Allah tidak mendapat syafaat (pertolongan di akhirat); kecuali orang yang mengakui yang hak (tauhid) dan mereka meyakini.",
      "text": "وَلَا يَمْلِكُ الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِهِ الشَّفَاعَةَ اِلَّا مَنْ شَهِدَ بِالْحَقِّ وَهُمْ يَعْلَمُوْنَ",
      "text_translation_en": "And those [beings] whom some invoke beside God have it not in their power to intercede [on Judgment Day] for any but such as have [in their lifetime] borne witness to the truth, and have been aware [that God is one and unique].",
      "juz_number": 25
    },
    "87": {
      "text_tafsir_en": "In this verse it is explained that the words and deeds of the unbelievers are contrary. When they were asked, who created all these beings, they answered and said, \"Only God alone created it, not united to anyone.\" They could not refute the statement, but their actions and actions proved that they were associating with God. Why do the Muslims turn away to worship other than Allah or simply worship God according to their confession? It shows their ignorance.",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa perkataan dan perbuatan orang-orang musyrik itu saling bertentangan. Jika ditanyakan kepada mereka, siapakah yang menciptakan seluruh makhluk ini, maka mereka menjawab dan mengakui, \"Hanya Allah sajalah yang menciptakannya, tidak berserikat dengan seorang pun.\" Mereka tidak sanggup membantah kenyataan itu, tetapi perbuatan dan tindakan mereka membuktikan bahwa mereka mempersekutukan Allah. Mengapa orang-orang musyrik itu berpaling sehingga menyembah selain Allah atau hanya menyembah Allah saja sesuai dengan pengakuan mereka. Hal tersebut menunjukkan kebodohan mereka.",
      "text_translation": "Dan jika engkau bertanya kepada mereka, “Siapakah yang menciptakan mereka, niscaya mereka menjawab, “Allah,” jadi bagaimana mereka dapat dipalingkan (dari menyembah Allah),”",
      "text": "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَهُمْ لَيَقُوْلُنَّ اللّٰهُ فَاَنّٰى يُؤْفَكُوْنَۙ",
      "text_translation_en": "Now if thou ask those [who worship any being other than God] as to who it is that has created them, they are sure to answer, “God.” How perverted, then, are their minds!",
      "juz_number": 25
    },
    "88": {
      "text_tafsir_en": "Muhammad saw, \"O my Lord! Surely the people whom I call to follow your teachings according to your command are those who are locked in their hearts so that they will not believe.\" , you (Muhammad) warn or you do not give warning, they will not believe. (al-Baqarah \/ 2: 6)",
      "text_tafsir": "Muhammad saw berkata, \"Wahai Tuhanku, sesungguhnya orang-orang yang aku seru untuk mengikuti ajaranmu sesuai dengan perintahmu adalah orang-orang yang telah terkunci mati hatinya sehingga mereka tidak mau beriman.\"Firman Allah:\n\nSesungguhnya orang-orang kafir, sama saja bagi mereka, engkau (Muhammad) beri peringatan atau tidak engkau beri peringatan, mereka tidak akan beriman. (al-Baqarah\/2: 6)",
      "text_translation": "dan (Allah mengetahui) ucapannya (Muhammad), “Ya Tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman.”",
      "text": "وَقِيْلِهٖ يٰرَبِّ اِنَّ هٰٓؤُلَاۤءِ قَوْمٌ لَّا يُؤْمِنُوْنَۘ",
      "text_translation_en": "[But God has full knowledge of the true be­liever] and of his [despairing] cry: “O my Sustainer! Verily, these are people who will not believe!”",
      "juz_number": 25
    },
    "89": {
      "text_tafsir_en": "When Allah heard the Messenger of Allah (may peace be upon him), He said, \"O Muhammad, turn away from them, do not despair because of their arrogance to believe, do not attend to their blasphemous words, and the actions that dishonor you and your followers, forgive them, they will admit their guilt and feel the consequences of their disbelief. \" This verse is a promise of God to the Muslims, and it is fulfilled by Him, with the conquest of Mecca. These events caused people to convert to Islam in large numbers. So Islam spreads all over the world in no time. Allah says: When Allah's help and victory come, and you see people flocking to the religion of Allah, then glorify your Lord and seek His forgiveness. Indeed, He is the Benefactor of repentance. (Nasr \/ 110: 1-3)",
      "text_tafsir": "Setelah Allah mendengar ucapan Rasulullah saw itu, Dia berfirman, \"Hai Muhammad, berpalinglah engkau dari mereka, janganlah engkau berputus asa karena keangkuhan mereka untuk beriman, janganlah engkau melayani perkataan-perkataan mereka yang buruk itu, dan tindakan-tindakan yang menghinakanmu dan pengikutmu, maafkanlah mereka, kelak mereka akan mengakui kesalahannya dan merasakan akibat kekafiran mereka.\"\n\nAyat ini merupakan janji Allah kepada kaum Muslimin, dan janji itu ditepati-Nya, dengan penaklukan kota Mekah. Peristiwa tersebut menyebabkan manusia masuk Islam secara berbondong-bondong. Maka tersebarlah agama Islam ke seluruh penjuru dunia dalam waktu yang singkat.\n\nAllah berfirman:\n\nApabila telah datang pertolongan Allah dan kemenangan, dan engkau melihat manusia berbondong-bondong masuk agama Allah, maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampunan kepada-Nya. Sungguh, Dia Maha Penerima tobat. (an-Nasr\/110: 1-3)",
      "text_translation": "Maka berpalinglah dari mereka dan katakanlah, “Salam (selamat tinggal).” Kelak mereka akan mengetahui (nasib mereka yang buruk).",
      "text": "فَاصْفَحْ عَنْهُمْ وَقُلْ سَلٰمٌۗ فَسَوْفَ يَعْلَمُوْنَ ࣖ",
      "text_translation_en": "Yet bear thou with them, and say, “Peace [be upon you]!” - for in time they will come to know [the truth].",
      "juz_number": 25
    }
  },
  "name": "الزخرف",
  "name_translation_en": "Ornaments of gold",
  "name_translation": "Perhiasan",
  "name_latin": "Az-Zukhruf"
}