{
  "number": 45,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 37,
  "ayat": {
    "1": {
      "text_tafsir_en": "The first verse consists of letters of pilgrimage, as found at the beginning of several surahs of the Qur'an. Interpreters disagree about the meaning of the letters. It is further suggested that this issue be considered in \"The Qur'an and its Interpretation\" volume I, which is the first verse of Surah al-Baqarah. \" His name, Muhammad saw, is mentioned in the verse of Allah \"Almighty\" in order to draw in the mind of the reader or hearer, that which revealed the Book of the Qur'an is a substance of infinite power, incomparable and indisputable. His will and will must be carried out in accordance with his plan, and no other power can thwart it and change it, and thus the \"Wise\" nature of this verse is emphasized to understand that in the exercise of His will and power that is, He executes justice for each of His creatures. He acts, creates and executes according to his merits and benefits. This realization can be seen in all actions and all beings He created, from the simplest to the most perfect. In plants, animals, humans, and the arrangement and conditions of the solar system, one can know that in every being there are laws and conditions that cannot be violated; all must submit and be obedient both voluntarily and compulsively. Not a single creature violates the laws and conditions which God has decreed for him, except to the point of causing damage and destruction. If one were to use his clear and healthy mind he would have recognized the power and wisdom of God over all his creatures. And if he had been convinced of that, he would have accepted and practiced the Qur'an as a revelation and guidance of Allah. It also means that the Qur'an was passed down to the Prophet Muhammad in Arabic, delivered for the first time to the Quraysh, and then spread to the rest of the world, with wisdom and usefulness. Wisdom, its use and its benefits are known to man through the Qur'an itself. Some are known based on the knowledge and experience that a person has, and some are not known to man, for the One who knows is Allah.",
      "text_tafsir": "Ayat pertama terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah Al-Qur'an. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya dipersilahkan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\"\n\nPada ayat berikutnya Allah Yang Mahaperkasa dan Mahabijaksana menjelaskan bahwa kitab Al-Qur'an yang sempurna itu diturunkan kepada Rasul-Nya, Muhammad saw. Disebutkan sifat Allah \"Mahaperkasa\" dalam ayat ini agar tergambar dalam pikiran orang yang membaca atau mendengarnya, bahwa yang menurunkan kitab Al-Qur'an itu ialah Zat yang mempunyai kekuasaan yang tidak terbatas, tidak dapat ditandingi dan tidak dapat dibantah kehendak-Nya. Keinginan dan kehendak-Nya pasti terlaksana sesuai dengan rencana-Nya, tidak ada kekuasaan lain yang mampu menghalang-halangi dan mengubahnya.\n\nDemikian pula ditonjolkan sifat \"Mahabijaksana\" dalam ayat ini agar dipahami, bahwa dalam melaksanakan kehendak dan kekuasaan-Nya itu, Dia melaksanakan keadilan yang merata pada setiap makhluk-Nya. Dia bertindak, menciptakan dan melaksanakan sesuatu sesuai dengan guna dan faedahnya. Kebijaksanaan ini dapat disaksikan pada seluruh tindakan dan semua makhluk yang diciptakan-Nya, dari tingkat yang paling sederhana sampai ke tingkat yang paling sempurna.\n\nPada tumbuh-tumbuhan, binatang, manusia, dan susunan serta ketentuan-ketentuan yang berlaku pada tata surya, orang dapat mengetahui bahwa pada tiap-tiap makhluk ada hukum-hukum dan ketentuan-ketentuan yang tidak dapat dilanggar; semuanya harus tunduk dan patuh baik secara sukarela maupun terpaksa. Tidak satu makhluk pun yang melanggar dan menyalahi hukum dan ketentuan yang telah ditetapkan Allah baginya, kecuali akan mengakibatkan kerusakan dan kehancuran.\n\nApabila orang mau menggunakan pikirannya yang jernih dan sehat tentu akan mengakui kekuasaan dan kebijaksanaan Allah terhadap semua makhluk-Nya. Dan apabila ia telah yakin akan hal itu, tentu ia akan menerima dan mengamalkan Al-Qur'an sebagai wahyu dan petunjuk Allah. Hal ini juga berarti bahwa diturunkannya Al-Qur'an kepada Nabi Muhammad saw dalam bahasa Arab, disampaikan untuk pertama kalinya kepada orang-orang Quraisy, kemudian baru tersebar ke seluruh penjuru dunia, ada hikmatnya sesuai dengan guna dan faedahnya. Hikmah, guna dan faedahnya itu diketahui manusia dengan perantaraan Al-Qur'an sendiri. Ada yang diketahui berdasarkan pengetahuan dan pengalaman yang dipunyai oleh seseorang, dan ada yang belum diketahui oleh manusia, karena Yang Mahatahu hanyalah Allah.",
      "text_translation": "Ha Mim",
      "text": "حٰمۤ  ",
      "text_translation_en": "Ha. Mim.",
      "juz_number": 25
    },
    "2": {
      "text_tafsir_en": "The first verse consists of letters of pilgrimage, as found at the beginning of several surahs of the Qur'an. Interpreters disagree about the meaning of the letters. It is further suggested that this issue be considered in \"The Qur'an and its Interpretation\" volume I, which is the first verse of Surah al-Baqarah. \" His name, Muhammad saw, is mentioned in the verse of Allah \"Almighty\" in order to draw in the mind of the reader or hearer, that which revealed the Book of the Qur'an is a substance of infinite power, incomparable and indisputable. His will and will must be carried out in accordance with his plan, and no other power can thwart it and change it, and thus the \"Wise\" nature of this verse is emphasized to understand that in the exercise of His will and power that is, He executes justice for each of His creatures. He acts, creates and executes according to his merits and benefits. This realization can be seen in all actions and all beings He created, from the simplest to the most perfect. In plants, animals, humans, and the arrangement and conditions of the solar system, one can know that in every being there are laws and conditions that cannot be violated; all must submit and be obedient both voluntarily and compulsively. Not a single creature violates the laws and conditions which God has decreed for him, except to the point of causing damage and destruction. If one were to use his clear and healthy mind he would have recognized the power and wisdom of God over all his creatures. And if he had been convinced of that, he would have accepted and practiced the Qur'an as a revelation and guidance of Allah. It also means that the Qur'an was passed down to the Prophet Muhammad in Arabic, delivered for the first time to the Quraysh, and then spread to the rest of the world, with wisdom and usefulness. Wisdom, its use and its benefits are known to man through the Qur'an itself. Some are known based on the knowledge and experience that a person has, and some are not known to man, for the One who knows is Allah.",
      "text_tafsir": "Ayat pertama terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah Al-Qur'an. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya dipersilahkan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\"\n\nPada ayat berikutnya Allah Yang Mahaperkasa dan Mahabijaksana menjelaskan bahwa kitab Al-Qur'an yang sempurna itu diturunkan kepada Rasul-Nya, Muhammad saw. Disebutkan sifat Allah \"Mahaperkasa\" dalam ayat ini agar tergambar dalam pikiran orang yang membaca atau mendengarnya, bahwa yang menurunkan kitab Al-Qur'an itu ialah Zat yang mempunyai kekuasaan yang tidak terbatas, tidak dapat ditandingi dan tidak dapat dibantah kehendak-Nya. Keinginan dan kehendak-Nya pasti terlaksana sesuai dengan rencana-Nya, tidak ada kekuasaan lain yang mampu menghalang-halangi dan mengubahnya.\n\nDemikian pula ditonjolkan sifat \"Mahabijaksana\" dalam ayat ini agar dipahami, bahwa dalam melaksanakan kehendak dan kekuasaan-Nya itu, Dia melaksanakan keadilan yang merata pada setiap makhluk-Nya. Dia bertindak, menciptakan dan melaksanakan sesuatu sesuai dengan guna dan faedahnya. Kebijaksanaan ini dapat disaksikan pada seluruh tindakan dan semua makhluk yang diciptakan-Nya, dari tingkat yang paling sederhana sampai ke tingkat yang paling sempurna.\n\nPada tumbuh-tumbuhan, binatang, manusia, dan susunan serta ketentuan-ketentuan yang berlaku pada tata surya, orang dapat mengetahui bahwa pada tiap-tiap makhluk ada hukum-hukum dan ketentuan-ketentuan yang tidak dapat dilanggar; semuanya harus tunduk dan patuh baik secara sukarela maupun terpaksa. Tidak satu makhluk pun yang melanggar dan menyalahi hukum dan ketentuan yang telah ditetapkan Allah baginya, kecuali akan mengakibatkan kerusakan dan kehancuran.\n\nApabila orang mau menggunakan pikirannya yang jernih dan sehat tentu akan mengakui kekuasaan dan kebijaksanaan Allah terhadap semua makhluk-Nya. Dan apabila ia telah yakin akan hal itu, tentu ia akan menerima dan mengamalkan Al-Qur'an sebagai wahyu dan petunjuk Allah. Hal ini juga berarti bahwa diturunkannya Al-Qur'an kepada Nabi Muhammad saw dalam bahasa Arab, disampaikan untuk pertama kalinya kepada orang-orang Quraisy, kemudian baru tersebar ke seluruh penjuru dunia, ada hikmatnya sesuai dengan guna dan faedahnya. Hikmah, guna dan faedahnya itu diketahui manusia dengan perantaraan Al-Qur'an sendiri. Ada yang diketahui berdasarkan pengetahuan dan pengalaman yang dipunyai oleh seseorang, dan ada yang belum diketahui oleh manusia, karena Yang Mahatahu hanyalah Allah.",
      "text_translation": "Kitab (ini) diturunkan dari Allah Yang Mahaperkasa, Mahabijaksana.",
      "text": "تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ",
      "text_translation_en": "THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the Wise.",
      "juz_number": 25
    },
    "3": {
      "text_tafsir_en": "This verse explains that as evidence of Almighty God the Almighty, it can be seen in the creation of the heavens, the earth, in human beings and in animals of all kinds. It is emphasized that in heaven and on earth there are many signs of God's power and power. A simple-minded person will surely conclude that behind the creation of heaven and earth and everything in between, there is a substance of the Creator, the Almighty. The more knowledgeable he is, the better he can understand it. Creation of heaven, earth and its contents is a wonderful sign of God's greatness and power for believers, and shows that it is God who is worthy of worship other than Him. In this verse is mentioned believers who are not others, because they are the beneficiaries of the Creator of the heavens and the earth, that they are God, so they do not worship except Him. At the end of this verse, God explains that the signs of God's sovereignty in heaven and on earth are signs and proofs of God's existence and power for believers. By observing the signs of God's sovereignty in heaven and on the earth, a pure, healthy-minded person who seeks the truth and is not influenced by the devil's temptations will surely be the one who accepts the fact that the Qur'an passed down to Muhammad The saw is truly a revelation from God to be fulfilled by every human being who wants to live happily in the world and in the hereafter. On the other hand, the soul of a person who has been stained by the stains of actuality, the mind which is bound by shrewd belief has been tempted by the devil's deception, however clear and bright are the signs of God's power and greatness, they will not be able to feel and live it. Because of this, they are still wandering in disbelief and rebellion. Signs of the power of God are spreading in heaven and on earth. For example it is related to celestial objects as described in Surah al-An'am \/ 6: 96-97. He wakes up the morning and makes the night rest, and (makes) the sun and the moon for counting. That is the decree of the Almighty, the All-Knowing. And it is He Who made the stars for you, To guide you in the darkness of the land and of the sea. We have explained our signs to those who know. (al-An'am \/ 6: 96-97). According to scientists, humans from the beginning of civilization have used celestial objects such as the sun and the earth as calculations. The calculations based on 'the motion and position of the sun in the earth's sky, or known as the Solar Calendar, have been performed by Western civilization (derived from Roman and Greek), India; in the Jewish, Arab, Chinese, and Indian civilizations using the Lunar Calendar, which is a calculation based on 'the motion and position of the moon in the sky. In astronomical terms, the Solar Calendar is based on the orbit of the earth toward the sun's position, and the Lunar Calendar is based on the moon's orbit on the positions of the earth and the sun. This is how the stars in the sky are used as navigation indicators. In scientific terms, the navigation indicator using or positioning the stars in the sky is called stellar navigation. Stellar navigation has also been used by land travelers to determine their destination. In the modern world, it appears that stellar navigation has also been used by spacecraft, such as the Space Shuttle: Columbia, Challenger, and Enterprise. Look for the signs of God's power to be found on earth. One of them is as mentioned in Surah asy-Syura \/ 42: 32 above, where the mountains which the common people hold in their place, appear to float and move.",
      "text_tafsir": "Ayat ini menerangkan bahwa sebagai bukti Allah Mahaperkasa lagi Mahabijaksana, dapat dilihat pada kejadian langit, bumi, pada diri manusia dan pada binatang yang beraneka ragam macamnya. Ditegaskan bahwa di langit dan di bumi, banyak sekali terdapat tanda-tanda kekuasaan dan keperkasaan Allah. Orang yang berpikiran sederhana, pasti akan berkesimpulan bahwa di balik kejadian langit dan bumi beserta semua yang ada di antaranya, tentu ada zat yang Maha Pencipta lagi Mahakuasa. Apalagi orang yang tinggi ilmunya, tentu lebih dapat memahaminya lagi.\n\nPenciptaan langit, bumi dan isinya yang sangat menakjubkan sebagai tanda keagungan dan kekuasaan Allah bagi orang beriman, dan menunjukkan Allah-lah yang berhak disembah bukan selain Dia.\n\nDalam ayat ini disebutkan orang yang beriman bukan yang lainnya, karena merekalah yang dapat mengambil manfaat bahwa pencipta langit dan bumi adalah Allah, maka mereka tidak menyembah kecuali kepada-Nya.\n\nPada akhir ayat ini, Allah menjelaskan bahwa tanda-tanda kekuasaan Allah yang ada di langit dan di bumi itu menjadi tanda dan bukti wujud dan kekuasaan Allah bagi orang-orang yang beriman. Dengan memperhatikan tanda-tanda kekuasaan Allah yang ada di langit dan di bumi itu, orang yang berjiwa bersih, berpikiran sehat yang ingin mencari kebenaran dan tidak dipengaruhi oleh godaan setan tentulah akan menjadi orang yang menerima kenyataan bahwa Al-Qur'an yang diturunkan kepada Muhammad saw itu benar-benar wahyu dari Allah yang harus dilaksanakan oleh setiap manusia yang ingin hidup bahagia di dunia dan di akhirat nanti. Sebaliknya, jiwa seseorang yang dikotori oleh noda-noda kemaksiatan, pikiran yang telah dibelenggu oleh kepercayaan syirik telah tergoda oleh tipu daya setan, maka bagaimana pun jelas dan cerahnya tanda-tanda kekuasaan dan kebesaran Allah, mereka tidak akan dapat merasakan dan menghayatinya. Karena itu, mereka tetap bergelimang dalam kekafiran dan kemaksiatan.\n\nTanda-tanda kekuasaan Allah tersebar baik di langit maupun di bumi. Sebagai contoh adalah berkaitan dengan benda-benda langit seperti terurai pada Surah al-An'am\/6: 96-97. \n\nDia menyingsingkan pagi dan menjadikan malam untuk beristirahat, dan (menjadikan) matahari dan bulan untuk perhitungan. Itulah ketetapan Allah Yang Mahaperkasa, Maha Mengetahui. Dan Dialah yang menjadikan bintang-bintang bagimu, agar kamu menjadikannya petunjuk dalam kegelapan di darat dan di laut. Kami telah menjelaskan tanda-tanda (kekuasaan Kami) kepada orang-orang yang mengetahui. (al-An'am\/6: 96-97).\n\nMenurut kajian saintis, manusia sejak awal peradaban telah mengunakan benda-benda di langit seperti matahari dan bumi sebagai perhitungan penanggalan. Penanggalan berbasis pada 'gerak dan posisi matahari di langit bumi, atau yang dikenal dengan Solar Calendar, telah dilakukan oleh peradaban Barat (berasal dari Romawi dan Yunani), India; sedang peradaban Yahudi, Arab, Cina, juga India menggunakan Lunar Calendar, yaitu perhitungan berbasiskan kepada 'gerak dan posisi bulan di langit bumi. Dalam bahasa astronomi, Solar Calendar berbasiskan pada lintasan-orbit bumi terhadap posisi matahari, sedang Lunar Calendar berbasis pada lintasan-orbit bulan terhadap posisi bumi dan matahari. Demikian halnya bintang-bintang di langit sebagai yang digunakan sebagai indikator navigasi. Dalam bahasa ilmiah, indikator navigasi yang menggunakan atau berbasiskan posisi bintang-bintang di langit ini disebut stellar navigation. Stellar navigation juga telah digunakan oleh para pengembara darat untuk menentukan arah perjalanannya. Dalam dunia modern sekarang ini, ternyata stellar navigation juga telah digunakan oleh pesawat antariksa, seperti jenis pesawat Ulang-alik (Space Shuttle): Columbia, Challenger, dan Enterprise.\n\nDemikan halnya tanda-tanda kekuasaan Allah yang dapat dijumpai di bumi. Salah satunya adalah seperti disebut dalam Surah asy-Syura\/42: 32 di atas, di mana gunung-gunung yang menurut awam tetap di tempatnya, ternyata mengapung dan bergerak.",
      "text_translation": "Sungguh, pada langit dan bumi benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang mukmin.",
      "text": "اِنَّ فِى السَّمٰوٰتِ وَالْاَرْضِ لَاٰيٰتٍ لِّلْمُؤْمِنِيْنَۗ",
      "text_translation_en": "Behold, in the heavens as well as on earth there are indeed messages for all who [are willing to] believe.",
      "juz_number": 25
    },
    "4": {
      "text_tafsir_en": "God shows signs of His power and greatness in human creation and in the creation of animals of all kinds and shapes. Humans are created by God from the elements found in the earth. The various substances consisting of carbohydrates, proteins, fats, sugars, sugars, salts, various vitamins, iron, and so on are accumulated in the human body, through foods and beverages derived from plants and animals. These plants and animals all come from the soil. Allah says: And among His Signs is that He created you out of the earth, and then you became (a) breed. (ar-Romans \/ 30: 20) Some of the substances consumed by humans contain spermatozoa in the male and the ovum in the female. The sperm and the ovum meet, at the time of intercourse between men and women. And so it comes to fruition. The seed is getting bigger and bigger. Forty days later, tissues filled with blood vessels are formed. Forty days later, you see a fetus shaped like blood dripping. Then after forty days a fetus forms on the wall of the uterus. At that moment, the signs of life and the baby's heart began to swell. The baby's heartbeat could have been heard when someone put his ear to the part of the pregnant mother's stomach. From birth to maternal fertility to the signs of life, it takes four months. Five months and ten days later, the baby is born. Since then the baby was breathing with his lungs starting to work, and since then he has gradually escaped his dependence on his parents, especially his mother. He was given the intellect, the feeling and the ability to work so with that ability he was able to carry out his life's work as the caliph of God on earth. Eventually he grew old and died. The human creation of God is explained in His word: He created you from the ground, then from a drop of semen, then from a drop of blood, then you were born as a child, then you were left to adulthood, then you grew old. But some of you were killed before that. So that you may reach the appointed time, that you may understand. (Apocalypse \/ 40: 67) By observing the process of human creation, how difficult and intricate the laws of creation are, the conscious will recognize the power and majesty of God, the One and Only God. God also shows the signs of His power and greatness in the creation and life of animals of all kinds, types, types, and ways of life. By looking at the shape, people can distinguish between animals. There are animals that have a spinal cord in Life Sciences called \"vertebrates\", some do not have spiders (invertebrates). Spinal cord animals are divided into parts such as mammals, aves, reptiles, reptiles, amphibians, pisces. Non-spinal animals are further subdivided into parts such as bugs (insectivores), soft animals (mollusca), and single-celled animals (protozoa). Each species and animal has its own set of laws and rules, such as its way of life, its food, its breeding, its survival, its grandeur and its benefits. And the things described will be a lesson and a lesson for those who want to think and know how great their Creator is; thus, it will strengthen the faith in his heart.",
      "text_tafsir": "Allah menunjukkan tanda-tanda kekuasaan dan kebesaran-Nya pada kejadian manusia sendiri dan pada penciptaan binatang yang beraneka ragam jenis dan bentuknya.\n\nManusia diciptakan Allah dari unsur-unsur yang terdapat di dalam tanah. Berbagai zat yang terdiri dari karbohidrat, protein, zat lemak, zat gula, berbagai macam garam, berbagai macam vitamin, zat besi, dan sebagainya terkumpul dalam tubuh manusia, melalui makanan dan minuman yang berasal dari tumbuh-tumbuhan dan hewan. Tumbuh-tumbuhan dan hewan itu semua berasal dari tanah. Allah berfirman:\n\nDan di antara tanda-tanda (kebesaran)-Nya ialah Dia menciptakan kamu dari tanah, kemudian tiba-tiba kamu (menjadi) manusia yang berkembang biak. (ar-Rum\/30: 20)\n\nSebagian dari zat yang dimakan manusia itu ada yang menjadi spermatozoa pada diri laki-laki dan ovum pada diri perempuan. Sperma dan ovum itu bertemu, pada saat terjadinya senggama antara laki-laki dan perempuan. Dengan demikian terjadilah pembuahan. Benih itu makin lama makin besar. Empatpuluh hari kemudian, terbentuklah jaringan-jaringan yang dipenuhi pembuluh-pembuluh darah. Empatpuluh hari kemudian, terlihatlah calon janin yang berbentuk seperti darah yang mengental. Kemudian setelah empatpuluh hari terbentuklah janin yang melekat pada dinding rahim. Pada saat itulah, mulai terlihat tanda-tanda kehidupan dan jantung bayi itu mulai berdenyut. Denyut jantung bayi itu telah dapat didengar apabila orang menempelkan telinganya ke bagian perut ibu yang sedang mengandung. Sejak terjadinya pembuahan dalam kandungan ibu sampai kepada terlihatnya tanda-tanda kehidupan, diperlukan waktu empat bulan. Lima bulan sepuluh hari setelah itu, lahirlah janin dari kandungan. Sejak itulah bayi itu bernapas dengan paru-parunya yang telah mulai bekerja, dan sejak itu pula ia berangsur-angsur melepaskan diri dari ketergantungannya kepada orang tuanya, terutama kepada ibunya. Dia telah diberi akal, perasaan dan kemampuan bekerja sehingga dengan kemampuan yang diberikan itu, ia telah dapat melaksanakan tugas hidupnya sebagai khalifah Allah di muka bumi. Akhirnya ia menjadi tua dan meninggal dunia.\n\nPenciptaan manusia Allah jelaskan dalam firman-Nya:\n\nDialah yang menciptakanmu dari tanah, kemudian dari setetes mani, lalu dari segumpal darah, kemudian kamu dilahirkan sebagai seorang anak, kemudian dibiarkan kamu sampai dewasa, lalu menjadi tua. Tetapi di antara kamu ada yang dimatikan sebelum itu. (Kami perbuat demikian) agar kamu sampai kepada kurun waktu yang ditentukan, agar kamu mengerti. (Gafir\/40: 67)\n\nDengan memperhatikan proses penciptaan manusia, bagaimana sulit dan ruwetnya hukum-hukum yang berlaku dalam penciptaan itu, orang yang sadar akan mengakui kekuasaan dan keagungan Allah, Tuhan Yang Maha Esa.\n\nAllah menunjukkan juga tanda-tanda kekuasaan dan keagungan-Nya yang terdapat pada kejadian dan kehidupan binatang melata yang beraneka ragam, jenis, macamnya, dan cara-cara kehidupannya. Dengan memperhatikan bentuknya, orang dapat membedakan binatang. Ada binatang yang beruas tulang belakang yang dalam Ilmu Hayat disebut \"vertebrata\", ada yang tidak beruas tulang belakang (invertebrata). Binatang yang beruas tulang belakang dibagi atas beberapa bagian seperti mamalia (binatang menyusui), jenis burung (aves), jenis binatang melata (reptilia), jenis binatang yang hidup di darat dan di air (amphibia), jenis ikan (pisces).\n\nBinatang yang tidak beruas tulang belakang dibeda-bedakan lagi menjadi beberapa bahagian seperti binatang berkutu (insektifora), binatang lunak (mollusca), hingga binatang yang bersel satu (protozoa). Tiap-tiap jenis dan macam binatang itu mempunyai hukum-hukum dan ketentuan-ketentuan sendiri-sendiri yang disusun dengan rapi seperti cara hidup, makanannya, cara berkembang biak, cara mempertahankan hidup, sampai kepada keagungan dan faedahnya. Dan hal-hal yang diterangkan itu akan menjadi i'tibar dan pelajaran bagi orang-orang yang mau berpikir dan ingin mengetahui betapa Maha Tingginya Ilmu penciptanya; dengan demikian, akan memperkuat iman di hatinya.",
      "text_translation": "Dan pada penciptaan dirimu dan pada makhluk bergerak yang bernyawa yang bertebaran (di bumi) terdapat tanda-tanda (kebesaran Allah) untuk kaum yang meyakini,",
      "text": "وَفِيْ خَلْقِكُمْ وَمَا يَبُثُّ مِنْ دَاۤبَّةٍ اٰيٰتٌ لِّقَوْمٍ يُّوْقِنُوْنَۙ",
      "text_translation_en": "And in your own nature, and in [that of] all the animals which He scatters [over the earth] there are messages for people who are endowed with inner certainty.",
      "juz_number": 25
    },
    "5": {
      "text_tafsir_en": "In this verse, Allah reminds man of the signs of His greatness and power that are found at the turn of the day and night both in terms of their long and short terms. In terms of change, one can watch from sunrise on the eastern horizon to the sunset on the western horizon. During the day, people do not see anything in the sky, except the sun that shines with the light. At that time, most people worked and tried to make a living, fulfilling their needs. The sun moves leaving the eastern horizon increasingly higher and higher. Then he looks at the meridian. After that, it went downhill to the western sky. Finally he sank in the western horizon. Since then, the day gradually darkened, sometimes visible reddish clouds, then began to appear animals one by one, from the brightest stars to the brightest stars. After darkness completely covered the earth's surface, it became clear that the stars were scattered in the sky, various kinds of constellations and various colors of light. At the end of the night, the dawn begins to appear in the eastern horizon, as a sign that the sun will soon rise again. Since then, starlight began to dim again because its light began to be defeated by sunlight. And so on, people can witness the situation over and over again. Such an atmosphere occurs in countries that are in the equator, while the southern and northern hemisphere hemisphere will experience a state of day longer or shorter than night, according to the latitude and declination of the sun. In terms of the short length of the night and day, people who are at the equator will forever witness the length of the day and night which is almost the same. The area to the south of the equator will experience a longer afternoon when the sun is to the south, but will experience a shorter afternoon when the sun is to the north of the equator. Similarly, people who are north of the equator will experience a longer day when the sun is to the south. The farther a place is both north and south of the equator, the further the difference in the short length of time between night and day. For people who are in the north and south poles, in one year there is a continuous night and there is also a continuous day. During the daytime the sun is always above the horizon, it always seems never to go under the horizon, while at night continuously, the sun is always under the horizon, never seen and never passed above the horizon. By paying attention to the changes of day and night, and the short length that always changes throughout the year, there will be signs of God's power and greatness, and there will be laws that govern them very neatly, never deviating from the provisions that have been determined. Then Allah showed signs of His power and greatness which were seen in the rain falling from the sky. Because of the sun's heat, water evaporates upwards. The wind that always blew accelerated the evaporation process and drove it to a place and gradually the water vapor was gathered in the sky as clouds. If the cloud that is scattered by the wind is blocked by the mountain, then it is gathered there, getting thicker and deeper. The color that was originally whitish turned black. And if the temperature of the air has reached such a cold, the water vapor will fall as rain will water the earth's surface. Because of the rainwater, various kinds of plants grow, and because of the rainwater, animals and humans can live. Humans with the results of their thinking can regulate the flow of water so that it does not flow entirely into the sea. Some are used and some can be used in the dry season. In each region, on the surface of the earth, rainfall is not the same; depends on the determining factors. There are areas where rainfall is very heavy and some are very thin and some are moderate. By observing the rain and its benefits for the life of beings, one can know how vast the power of its creator is. After that, God also showed signs of His power that can be seen in the range of winds, that is the range of land winds and sea winds that always blow in different directions. It has become a law of nature that land becomes hotter faster when it is overwritten by the sun compared to oceans which are slow to heat up when they are overtaken by sunlight. Conversely the land also releases heat at night faster, when the sun's heat is no longer compared to the ocean which is slow to release it. Thus, there is a maximum and minimum air area. During the day the land is hotter than the ocean so the air becomes minimum, while the ocean is less hot compared to the land so the air becomes maximum. Air flows from the maximum area to the minimum area, so blow in the afternoon sea breeze into the mainland. However, at night, the opposite happens; land becomes maximum and ocean becomes minimum because land becomes colder faster than ocean so winds blow from land to sea. Such circumstances benefit the fishermen. They departed at night, sailed into the sea in the direction of the sea breeze. In addition, changes in the location of the sun are in the latitudes of the southern hemisphere. Therefore, the maximum air in the southern hemisphere. Then the wind blows from the southern hemisphere to the northern hemisphere. At that time in Indonesia experienced a dry season. However, if the sun is at the southern latitudes, the southern hemisphere receives more heat than the northern hemisphere. Therefore, the maximum air in the north, then the wind blows from north to south. For Indonesia, the wind blows from the Gobi desert to China, along the Peninsular Malaysia due to the influence of the earth's rotation turning east, to Indonesia, towards the Victoria Desert in Australia. At that time, Indonesia experienced a rainy season. In addition, there is a wind that blows from the north pole and south pole permanently, because the polar region always experiences air cooler than the equator, the polar regions, the air is always maximum. However, due to the rotation of the earth on its axis from west to east, the winds that blow from the poles experience a deflection to the west. That is why the wind in Indonesia blows from the southeast. For the polar regions themselves, there is always a constant west wind that is forever. From the wind range, people will know how the Almighty and Almighty God created the universe. That is why at the end of this surah, Allah confirms that the signs of His power that can be seen in the universe, in man, in the range of the wind, in the rain, and so on become evidence of His power for those who use their minds and for people who really want to find the truth. With these various appeals, God shows signs of His power so that people believe in His Almighty and omnipotence. By knowing all of that correctly, their faith will certainly increase and their passion will also increase to use their knowledge for the welfare of humanity. From the information above, it is also understood that there is so much that can be used as evidence of Allah, Almighty and All-wise, as long as people want to follow the way of thinking outlined by God in the Qur'an, this also means that in fact, the higher the knowledge a person has, the more he has the evidence. If there is a knowledgeable person who does not believe in God, it means he has not yet used his knowledge according to what he should. In these verses there are three different sentences, first yu'minun, second yuqinun, and third ya'qilun, this is meant; if you have faith then understand these signs of Allah's majesty and if you do not believe but seek truth and belief then understand these signs, and if you do not have faith and are not looking for reality then you people are understanding and understand these signs. This verse briefly describes the mechanisms of earth's rotation and circulation related to weather changes and wind range. Science now explains the existence of day and night on earth caused by the rotation (rotation) of the earth on its axis. Besides rotating, the earth also circulates on its elliptical (evolution) path. It took the Earth one year to circulate at this point until it was back in the same position. The process of rotation and evolution of the earth, in addition to relating to weather and climate in various places on the surface of the earth, is also related to changes in wind direction. Local rains generally occur after noon, when temperatures begin to cool, after the previous morning and afternoon the earth's surface gets a lot of solar heat and enough steam to produce clouds that make rain fall. The earth's rotation axis makes an angle of 23.5o to its circular path, so that the amount of sunlight intensity received by the northern and southern hemisphere is always different, except in the position of the plane perpendicular to the plane of the half-globe, when the sun is directly above equator. The existence of places that get different light intensities causes the earth's surface heat to vary. With the difference in heat on the surface of the earth there will be air flow (wind) from a cold place to a hotter place. In the area around the equator (equatorial) there is a wind that blows throughout the year toward the equator that is always hot, known as trade winds. In Indonesia, located between two large oceans and two continents blowing winds that change direction every half year, known as the monsoon (moonsoon). In October to April, the wind blows from the northwest to the southeast (west wind) which brings moisture and causes the rainy season. In April to October, the wind that blows from the southeast to the northwest, is dry, causing a dry season. At sea level, this difference in heat from sunlight causes ocean currents and differences in water vapor production. The combination of the dynamics of the wind direction and the production of water vapor on the earth's surface produces a cycle of climate change, which basically will repeat every year. In certain repetition periods, extreme cases are also common, such as the El Nino and La Nina phenomena.",
      "text_tafsir": "Pada ayat ini, Allah mengingatkan manusia akan tanda-tanda kebesaran dan kekuasaan-Nya yang terdapat pada pergantian siang dan malam baik dari segi panjang dan pendeknya.\n\nDari segi pergantian, orang dapat menyaksikan sejak matahari terbit di kaki langit sebelah timur hingga terbenam di kaki langit sebelah barat. Di siang hari, orang tidak menyaksikan apa pun di langit, terkecuali matahari yang bersinar dengan terangnya. Pada waktu itu, kebanyakan manusia bekerja dan berusaha mencari nafkah, memenuhi kebutuhan hidupnya.\n\nMatahari bergerak meninggalkan ufuk sebelah timur makin lama makin meninggi. Kemudian ia terlihat di meridian. Sesudah itu, makin menurun menuju ufuk langit sebelah barat. Akhirnya ia tenggelam di ufuk sebelah barat. Sejak itu, hari berangsur-angsur gelap, kadang-kadang terlihat awan kemerah-merahan, lalu mulailah bermunculan binatang-binatang satu demi satu, dari bintang yang paling terang cahayanya sampai kepada bintang yang bercahaya redup. Setelah gelap menyelubungi permukaan bumi seluruhnya, bertambah jelaslah nampak bintang-bintang bertaburan di angkasa raya, berbagai macam rasi dan aneka warna cahayanya. Pada penghujung malam, mulailah kelihatan fajar menyingsing di ufuk timur, sebagai tanda tidak lama lagi matahari akan terbit kembali. Sejak itulah, cahaya bintang mulai redup kembali karena cahayanya mulai dikalahkan oleh cahaya matahari.\n\nBegitulah seterusnya orang dapat menyaksikan keadaan itu berulang-ulang. Suasana yang seperti itu terjadi di negeri-negeri yang berada di daerah khatulistiwa, sedangkan belahan bumi bahagian selatan dan utara akan mengalami keadaan siang lebih panjang atau lebih pendek dari malam, sesuai dengan lintang dan deklinasi matahari.\n\nDari segi panjang pendeknya malam dan siang, orang yang berada di khatulistiwa selamanya akan menyaksikan panjang pendeknya siang malam yang hampir sama. Daerah yang berada di selatan khatulistiwa akan mengalami siang lebih panjang apabila matahari berada di sebelah selatan, tetapi akan mengalami siang yang lebih pendek apabila matahari berada di sebelah utara khatulistiwa. Demikian pula orang yang berada di sebelah utara khatulistiwa akan mengalami siang yang lebih panjang apabila matahari berada di sebelah selatan. Makin jauh suatu tempat baik ke utara maupun selatan khatulistiwa, makin jauh pula perbedaan panjang pendek waktu antara malam dan siang. Bagi orang yang berada di kutub utara dan kutub selatan, dalam satu tahun ada masa malam yang terus menerus dan ada pula masa siang yang terus menerus. Pada masa siang terus menerus matahari selalu berada di atas cakrawala, selalu kelihatan tidak pernah masuk ke bawah kaki langit, sedangkan pada masa malam terus menerus, matahari selalu berada di bawah kaki langit, tidak pernah kelihatan dan tidak pernah melewati kaki langit ke atas.\n\nDengan memperhatikan pergantian siang dan malam, dan panjang pendeknya yang selalu berubah-ubah sepanjang tahun, akan terlihat tanda-tanda kekuasaan dan kebesaran Allah, serta akan nampak adanya hukum-hukum yang mengaturnya dengan sangat rapi, tidak pernah menyimpang dari ketentuan-ketentuan yang telah ditentukan.\n\nKemudian Allah menunjukkan tanda-tanda kekuasaan dan kebesaran-Nya yang terlihat pada turunnya hujan dari langit. Karena panas matahari, air pun menguap ke atas. Angin yang selalu bertiup mempercepat proses penguapan itu dan menghalaunya ke suatu tempat dan lama-kelamaan terkumpullah uap air itu di angkasa sebagai awan. Apabila awan yang berarak dihalau angin itu tertahan oleh gunung, maka terkumpullah ia di sana, semakin lama semakin tebal. Warnanya yang semula keputih-putihan berubah menjadi hitam. Dan apabila suhu udara telah mencapai kedinginan sedemikian rupa, turunlah uap air itu sebagai hujan yang menyirami permukaan bumi. Karena air hujan itu, tumbuhlah beraneka macam tumbuh-tumbuhan, dan karena air hujan itu pula, binatang dan manusia dapat hidup. Manusia dengan hasil pemikirannya dapat mengatur aliran air itu sehingga tidak mengalir seluruhnya ke laut. Sebahagian dimanfaatkan dan sebagian lagi dapat digunakan pada musim kemarau. Pada tiap daerah, di permukaan bumi, curah hujan tidak sama; bergantung kepada faktor-faktor yang menentukan. Ada daerah yang curah hujannya sangat lebat dan ada pula yang sangat tipis dan ada yang sedang. Dengan memperhatikan turunnya hujan itu dan manfaatnya bagi kehidupan makhluk, orang dapat mengetahui betapa luasnya kekuasaan penciptanya.\n\nSesudah itu Allah menunjukkan pula tanda-tanda kekuasaan-Nya yang dapat dilihat pada perkisaran tiupan angin yaitu perkisaran angin darat dan angin laut yang selalu berhembus berganti arah. Telah menjadi hukum alam bahwa daratan lebih cepat menjadi panas bila ditimpa sinar matahari dibandingkan dengan lautan yang lambat menjadi panas bila ditimpa sinar matahari. Sebaliknya daratan lebih cepat pula melepaskan panas di malam hari, pada waktu panas matahari tidak ada lagi dibandingkan dengan lautan yang lambat melepasnya. Dengan demikian, terdapatlah daerah maksimum dan minimum udaranya. Pada siang hari daratan lebih panas dari lautan sehingga udaranya menjadi minimum, sedangkan lautan kurang panas udaranya dibandingkan dengan daratan sehingga udaranya menjadi maksimum. Udara mengalir dari daerah maksimum ke daerah minimum, maka bertiuplah pada siang hari angin laut menuju daratan. Akan tetapi, di waktu malam, terjadi kebalikannya; daratan menjadi maksimum dan lautan menjadi minimum karena daratan lebih cepat menjadi dingin daripada lautan sehingga bertiuplah angin dari daratan menuju lautan.\n\nKeadaan yang demikian menguntungkan para nelayan. Mereka berangkat pada waktu malam, berlayar ke tengah lautan mengikuti arah hembusan angin laut. Di samping itu, perubahan letak matahari berada di lintang- balik -utara belahan bumi bagian selatan. Karena itu, udara maksimum di belahan bumi bahagiana selatan. Maka bertiuplah angin dari belahan bumi selatan ke belahan bumi bagian utara. Waktu itu di Indonesia mengalami musim kemarau. Akan tetapi, bila matahari berada pada lintang balik selatan, belahan bumi bagian selatan menerima panas lebih banyak dari bagian bumi sebelah utara. Karena itu, udara maksimum di bagian utara, maka bertiuplah angin dari utara ke selatan. Untuk Indonesia, angin bertiup dari padang pasir Gobi ke Tiongkok, menyusur Semenanjung Malaysia karena pengaruh perputaran bumi membelok ke timur, ke Indonesia, menuju Padang Pasir Victoria di Australia. Pada saat itu, di Indonesia mengalami musim hujan.\n\nDi samping itu, terdapat angin yang bertiup dari kutub utara dan kutub selatan secara tetap, karena daerah kutub selalu mengalami udara yang lebih dingin daripada khatulistiwa maka daerah-daerah kutub, udaranya selalu maksimum. Akan tetapi karena perputaran bumi pada porosnya dari barat ke timur, maka angin yang bertiup dari kutub itu mengalami pembelokan ke barat. Itulah sebabnya angin itu di Indonesia bertiup dari tenggara. Untuk daerah-daerah kutub sendiri, bertiuplah selalu angin barat yang tetap sepanjang masa.\n\nDari perkisaran angin itu, orang akan mengetahui betapa Mahabijaksana dan Mahaperkasa-Nya Allah yang menciptakan alam semesta ini.\n\nItulah sebabnya pada bagian akhir surah ini, Allah menegaskan bahwa tanda-tanda kekuasaan-Nya yang dapat dilihat pada jagat raya, pada diri manusia, pada perkisaran angin, pada turunnya hujan, dan sebagainya menjadi bukti kekuasaan-Nya bagi orang yang mempergunakan akalnya dan bagi orang yang benar-benar mau mencari kebenaran.\n\nDengan bermacam-macam himbauan itulah, Allah menunjukkan tanda-tanda kekuasaan-Nya agar manusia meyakini Kemahaesaan dan kemahakuasaan-Nya. Dengan mengetahui semuanya itu dengan benar, niscaya bertambah mantaplah iman mereka dan bertambah pulalah gairahnya untuk memanfaatkan pengetahuannya itu bagi kemaslahan umat manusia.\n\nDari keterangan di atas, dipahami pula amat banyak yang dapat dijadikan bukti adanya Allah, Mahakuasa dan Mahabijaksana, asal saja orang mau mengikuti cara berpikir yang digariskan Allah dalam Al-Qur'an, hal ini juga berarti bahwa sebenarnya, semakin tinggi ilmu seseorang semakin banyak ia mempunyai bukti-bukti itu. Jika ada seorang yang berilmu yang tidak mempercayai adanya Tuhan, berarti ia belum lagi mempergunakan ilmunya itu menurut yang semestinya.\n\nDalam ayat-ayat ini terdapat tiga kalimat berbeda, pertama yu'minun, kedua yuqinun, dan ketiga ya'qilun, hal ini dimaksudkan; jika kalian beriman maka pahamilah tanda-tanda keagungan Allah ini dan jika tidak beriman namun mencari kebenaran dan keyakinan maka pahamilah tanda-tanda ini, dan jika tidak beriman dan tidak mencari kenyataan maka jadilah kalian orang yang berakal dan pahamilah tanda-tanda ini. \n\nAyat ini dengan singkat menggambarkan adanya mekanisme-mekanisme perputaran dan peredaran bumi yang berkaitan dengan perubahan cuaca serta perkisaran angin. Ilmu pengetahuan saat ini menerangkan adanya siang dan malam di bumi disebabkan oleh perputaran (rotasi) bumi pada porosnya. Disamping berotasi, bumi juga beredar pada garis lintasannya (evolusi) yang berbentuk elips. Bumi memerlukan waktu satu tahun untuk beredar pada lintasan ini sampai berada kembali pada posisi yang sama. Proses rotasi dan evolusi bumi, di samping berkaitan dengan cuaca dan iklim di berbagai tempat di permukaan bumi, berkaitan pula dengan perubahan-perubahan arah angin. Hujan-hujan setempat umumnya terjadi setelah tengah hari, ketika suhu mulai mendingin, setelah pada pagi dan siang hari sebelumnya permukaan bumi mendapatkan panas matahari yang banyak dan cukup menghasilkan uap air untuk menghasilkan awan yang menurunkan hujan. \n\nPoros perputaran bumi membuat sudut sebesar 23,5o terhadap garis lintasan peredarannya, sehingga jumlah intensitas cahaya matahari yang diterima belahan bumi utara dan selatan selalu berbeda, kecuali pada posisi bidang lintasan tegak lurus terhadap bidang penampang setengah bola bumi, ketika itu matahari berada persis di atas khatulistiwa. Adanya tempat-tempat yang mendapatkan intensitas cahaya yang berbeda menyebabkan panas permukaan bumi berbeda-beda pula. Dengan adanya perbedaan panas di permukaan bumi maka terjadilah aliran udara (angin) dari tempat yang dingin ke tempat yang lebih panas. Di daerah sekitar khatulistiwa (ekuatorial) terdapat angin yang berhembus sepanjang tahun ke arah khatulistiwa yang selalu panas yang dikenal dengan angin pasat. Di Indonesia yang terletak di antara dua samudera besar dan dua benua berhembus angin yang berganti arah setiap setengah tahun, dikenal dengan angin muson (moonsoon). Pada bulan Oktober sampai April, angin berhembus dari barat laut ke arah tenggara (angin barat) yang membawa serta kelembaban dan menyebabkan musim hujan. Pada bulan April sampai Oktober, angin yang berhembus dari tenggara ke arah barat laut, bersifat kering, menyebabkan musim kemarau. \n\nDi permukaan laut, perbedaan panas cahaya matahari ini menyebabkan adanya arus laut dan perbedaan produksi uap air. Perpaduan dinamika arah angin dan produksi uap air di permukaan bumi menghasilkan siklus perubahan iklim, yang pada dasarnya akan berulang setiap tahun. Pada perioda perulangan tertentu biasa terjadi pula kasus-kasus ekstrim seperti misalnya fenomena El Nino dan La Nina.",
      "text_translation": "dan pada pergantian malam dan siang dan hujan yang diturunkan Allah dari langit lalu dengan (air hujan) itu dihidupkan-Nya bumi setelah mati (kering); dan pada perkisaran angin terdapat pula tanda-tanda (kebesaran Allah) bagi kaum yang mengerti.",
      "text": "وَاخْتِلَافِ الَّيْلِ وَالنَّهَارِ وَمَآ اَنْزَلَ اللّٰهُ مِنَ السَّمَاۤءِ مِنْ رِّزْقٍ فَاَحْيَا بِهِ الْاَرْضَ بَعْدَ مَوْتِهَا وَتَصْرِيْفِ الرِّيٰحِ اٰيٰتٌ لِّقَوْمٍ يَّعْقِلُوْنَ",
      "text_translation_en": "And in the succession of night and day, and in the means of subsistence which God sends down from the skies, giving life thereby to the earth after it had been lifeless, and in the change of the winds: [in all this] there are messages for people who use their reason.",
      "juz_number": 25
    },
    "6": {
      "text_tafsir_en": "Allah revealed to the Messenger of Allah, that the Qur'anic verses that were read to him were verses containing evidence, and strong arguments both in terms of the Qur'an (of Allah) and in terms of content and his language style. The Messenger of Allah (may peace be upon him) had passed on to the Meccans, but they could not accept it, and they disobeyed the Messenger of Allah. At the time the Qur'an was read to the disbelievers of Mecca, their hearts acknowledged the height and content of their language. The confession was immediately pronounced 'Utbah bin Rabi'ah and Abu al-Walid, the Arabian literary hero of the time. To them they are commanded to observe the events of this universe, their own events, the pouring rain from the sky that watered the earth to the barren land, the wind blowing, and so on, all of which can be evidence that God is the One, the Almighty more Powerful. To them was sent an apostle who would preach the religion of God to all mankind. The apostles were the people they trusted the most, the people they trusted and the people they always sought advice in resolving disputes between them. The messenger may also prove that he is indeed the Messenger whom God has sent to man, for example by presenting some of the miracles God has given him. There is already a lot of evidence presented to them, but they also do not believe. In fact, for a person who wants to use his mind, there is enough evidence to make him a believer. That is why the Messenger of Allah (may peace be upon him) asked Allah to ask the Meccans for more information and to ask that they change their hearts and become believers. The details given to them are complete. There are no more powerful arguments and evidence than those presented. If they don't want to understand it and don't accept the evidence and the arguments, it's up to them. They will get a fair answer for their stubbornness.",
      "text_tafsir": "Allah menyatakan kepada Rasulullah saw, bahwa ayat Al-Qur'an yang dibacakan kepadanya itu adalah ayat-ayat yang mengandung bukti, dan dalil-dalil yang kuat baik dari segi asal Al-Qur'an itu (dari Allah) maupun dari segi isi dan gaya bahasanya. Pernyataan Allah itu telah disampaikan oleh Nabi Muhammad saw kepada kaum musyrik Mekah, tetapi semuanya itu tidak dapat mereka terima, bahkan mereka bertambah ingkar kepada Rasulullah saw.\n\nPada waktu Al-Qur'an dibacakan kepada orang kafir Mekah, hati mereka mengakui ketinggian isi dan gaya bahasanya. Pengakuan ini langsung diucapkan 'Utbah bin Rabi'ah dan Abu al-Walid, sastrawan kenamaan orang Arab waktu itu. Kepada mereka diperintahkan agar memperhatikan kejadian alam semesta ini, kejadian diri mereka sendiri, air hujan yang turun dari langit yang menyirami bumi sehingga bumi yang tandus menjadi subur, angin yang bertiup, dan sebagainya, semuanya itu dapat dijadikan bukti bahwa Allah adalah Maha Esa, Mahakuasa lagi Mahaperkasa. \n\nKepada mereka pun telah diutus seorang rasul yang akan menyampaikan agama Allah kepada seluruh manusia. Rasul itu adalah orang yang paling mereka percayai di antara mereka, orang yang mereka segani dan orang yang selalu mereka mintai nasihat dalam menyelesaikan perselisihan-perselisihan yang terjadi di antara mereka. Rasul yang diutus itu dapat pula membuktikan bahwa ia benar-benar Rasul yang diutus Allah kepada manusia, misalnya dengan mengemukakan beberapa mukjizat yang diberikan Allah kepadanya. Sudah banyak bukti yang dikemukakan kepada mereka, tetapi mereka tidak juga beriman. Sebenarnya, bagi orang yang mau menggunakan pikirannya, cukup banyak bukti untuk menjadikan dia seorang yang beriman.\n\nItulah sebabnya maka Rasulullah saw diperintahkan oleh Allah menanyakan kepada kaum musyrik Mekah tentang keterangan apalagi yang mereka minta yang dapat mengubah hati mereka sehingga menjadi beriman.\n\nTelah lengkap keterangan yang diberikan kepada mereka. Tidak ada lagi dalil-dalil dan bukti-bukti yang lebih kuat daripada yang telah dikemukakan itu. Jika mereka tidak mau juga memahaminya dan tidak mau menerima bukti dan dalil-dalil itu, terserah kepada mereka sendiri. Mereka akan mendapatkan balasan yang setimpal akibat sikap kepala batu mereka itu.",
      "text_translation": "Itulah ayat-ayat Allah yang Kami bacakan kepadamu dengan sebenarnya; maka dengan perkataan mana lagi mereka akan beriman setelah Allah dan ayat-ayat-Nya.",
      "text": "تِلْكَ اٰيٰتُ اللّٰهِ نَتْلُوْهَا عَلَيْكَ بِالْحَقِّۚ فَبِاَيِّ حَدِيْثٍۢ بَعْدَ اللّٰهِ وَاٰيٰتِهٖ يُؤْمِنُوْنَ",
      "text_translation_en": "These messages of God do We convey unto thee, setting forth the truth. In what other tiding, if not in God’s messages, will they, then, believe?",
      "juz_number": 25
    },
    "7": {
      "text_tafsir_en": "Then God threatened the unbelievers who always denied the truth of the Qur'anic verses with horrible threats. They still deny the truth of the Qur'anic verses, though it contains evidence of the arguments and proofs of His uniqueness and power. They have heard the evidence and the evidence themselves. By their very nature, they must have understood it. However, what happened was the opposite. That is why they are referred to in this verse as people who lie and commit many sins. It is further explained that the state of the Muslims before and after hearing the Qur'anic verses remained the same, there was no change in their attitude and behavior, and even they became more and more arrogant. That is why in this verse they are said to have never heard the Qur'anic verses conveyed to them. In another verse, it is explained that they themselves admit they have never heard the Qur'an given to them. Allah says: And they say, \"Our hearts are covered by what you call upon us and our ears are closed, and between us and you there is a wall, so do it (as you wish), surely we will do it.\" ). \" (Fussilat \/ 41: 5) In another verse: And those who do not believe in their ears have a fault, and (the Qur'an) is darkness for them. (Fussilat \/ 44: 44) At the end of this verse, God commands His Messenger to tell them glad tidings that they will receive a painful torment in hell. In this verse it is said that proclaiming a painful torment is a happy news, not a sad news. These expressions are intended to respond to those who mock the Qur'anic verses presented to him and to show that their attitude is beyond their limits. Therefore, what is meant by the good news here is the opposite of the good news, which is sad news as an insult to them.",
      "text_tafsir": "Kemudian Allah mengancam kaum musyrikin yang selalu mengingkari kebenaran ayat-ayat Al-Qur'an dengan ancaman yang sangat mengerikan. Mereka tetap mendustakan kebenaran ayat-ayat Al-Qur'an, padahal di dalamnya terdapat keterangan tentang dalil-dalil dan bukti-bukti keesaan dan kekuasaan-Nya yang cukup jelas. Bukti dan keterangan itu telah mereka dengar sendiri. Menurut ukuran yang wajar, tentu mereka telah memahaminya. Akan tetapi, yang terjadi adalah sebaliknya. Itulah sebabnya mereka disebut dalam ayat ini orang-orang yang banyak berdusta dan banyak melakukan perbuatan dosa.\n\nSelanjutnya diterangkan bahwa keadaan orang-orang musyrik sebelum dan sesudah mendengar ayat-ayat Al-Qur'an tetap sama, tidak ada perubahan dalam sikap dan perilaku mereka, bahkan mereka bertambah ingkar dan menyombongkan diri. Itulah sebabnya dalam ayat ini mereka dikatakan seolah-olah tidak pernah mendengar ayat-ayat Al-Qur'an yang disampaikan kepada mereka.\n\nDalam ayat yang lain, diterangkan bahwa mereka sendiri mengakui tidak pernah merasa mendengar Al-Qur'an yang disampaikan kepada mereka. Allah berfirman:\n\nDan mereka berkata, \"Hati kami sudah tertutup dari apa yang engkau seru kami kepadanya dan telinga kami sudah tersumbat, dan di antara kami dan engkau ada dinding, karena itu lakukanlah (sesuai kehendakmu), sesungguhnya kami akan melakukan (sesuai kehendak kami).\" (Fussilat\/41: 5)\n\nDalam ayat lain:\n\nDan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan (Al-Qur'an) itu merupakan kegelapan bagi mereka. (Fussilat\/41: 44)\n\nPada akhir ayat ini, Allah memerintahkan kepada Rasul-Nya menyampaikan kabar gembira kepada mereka bahwa mereka akan memperoleh azab yang pedih di neraka nanti. Dalam ayat ini disebutkan bahwa memberitakan adanya azab yang pedih merupakan suatu berita gembira, bukan suatu berita duka. Ungkapan ini sengaja dibuat demikian untuk membalas sikap mereka yang memperolok-olokkan ayat-ayat Al-Qur'an yang disampaikan kepadanya dan untuk menunjukkan bahwa sikap mereka itu merupakan sikap yang sudah melampaui batas. Karena itu, yang dimaksud dengan kabar gembira di sini ialah lawan daripada kabar gembira itu, yaitu kabar sedih sebagai penghinaan kepada mereka.",
      "text_translation": "Celakalah bagi setiap orang yang banyak berdusta lagi banyak berdosa,",
      "text": "وَيْلٌ لِّكُلِّ اَفَّاكٍ اَثِيْمٍۙ",
      "text_translation_en": "Woe unto every sinful self-deceiver",
      "juz_number": 25
    },
    "8": {
      "text_tafsir_en": "Then God threatened the unbelievers who always denied the truth of the Qur'anic verses with horrible threats. They still deny the truth of the Qur'anic verses, though it contains evidence of the arguments and proofs of His uniqueness and power. They have heard the evidence and the evidence themselves. By their very nature, they must have understood it. However, what happened was the opposite. That is why they are referred to in this verse as people who lie and commit many sins. It is further explained that the state of the Muslims before and after hearing the Qur'anic verses remained the same, there was no change in their attitude and behavior, and even they became more and more arrogant. That is why in this verse they are said to have never heard the Qur'anic verses conveyed to them. In another verse, it is explained that they themselves admit they have never heard the Qur'an given to them. Allah says: And they say, \"Our hearts are covered by what you call upon us and our ears are closed, and between us and you there is a wall, so do it (as you wish), surely we will do it.\" ). \" (Fussilat \/ 41: 5) In another verse: And those who do not believe in their ears have a fault, and (the Qur'an) is darkness for them. (Fussilat \/ 44: 44) At the end of this verse, God commands His Messenger to tell them glad tidings that they will receive a painful torment in hell. In this verse it is said that proclaiming a painful torment is a happy news, not a sad news. These expressions are intended to respond to those who mock the Qur'anic verses presented to him and to show that their attitude is beyond their limits. Therefore, what is meant by the good news here is the opposite of the good news, which is sad news as an insult to them.",
      "text_tafsir": "Kemudian Allah mengancam kaum musyrikin yang selalu mengingkari kebenaran ayat-ayat Al-Qur'an dengan ancaman yang sangat mengerikan. Mereka tetap mendustakan kebenaran ayat-ayat Al-Qur'an, padahal di dalamnya terdapat keterangan tentang dalil-dalil dan bukti-bukti keesaan dan kekuasaan-Nya yang cukup jelas. Bukti dan keterangan itu telah mereka dengar sendiri. Menurut ukuran yang wajar, tentu mereka telah memahaminya. Akan tetapi, yang terjadi adalah sebaliknya. Itulah sebabnya mereka disebut dalam ayat ini orang-orang yang banyak berdusta dan banyak melakukan perbuatan dosa.\n\nSelanjutnya diterangkan bahwa keadaan orang-orang musyrik sebelum dan sesudah mendengar ayat-ayat Al-Qur'an tetap sama, tidak ada perubahan dalam sikap dan perilaku mereka, bahkan mereka bertambah ingkar dan menyombongkan diri. Itulah sebabnya dalam ayat ini mereka dikatakan seolah-olah tidak pernah mendengar ayat-ayat Al-Qur'an yang disampaikan kepada mereka.\n\nDalam ayat yang lain, diterangkan bahwa mereka sendiri mengakui tidak pernah merasa mendengar Al-Qur'an yang disampaikan kepada mereka. Allah berfirman:\n\nDan mereka berkata, \"Hati kami sudah tertutup dari apa yang engkau seru kami kepadanya dan telinga kami sudah tersumbat, dan di antara kami dan engkau ada dinding, karena itu lakukanlah (sesuai kehendakmu), sesungguhnya kami akan melakukan (sesuai kehendak kami).\" (Fussilat\/41: 5)\n\nDalam ayat lain:\n\nDan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan (Al-Qur'an) itu merupakan kegelapan bagi mereka. (Fussilat\/41: 44)\n\nPada akhir ayat ini, Allah memerintahkan kepada Rasul-Nya menyampaikan kabar gembira kepada mereka bahwa mereka akan memperoleh azab yang pedih di neraka nanti. Dalam ayat ini disebutkan bahwa memberitakan adanya azab yang pedih merupakan suatu berita gembira, bukan suatu berita duka. Ungkapan ini sengaja dibuat demikian untuk membalas sikap mereka yang memperolok-olokkan ayat-ayat Al-Qur'an yang disampaikan kepadanya dan untuk menunjukkan bahwa sikap mereka itu merupakan sikap yang sudah melampaui batas. Karena itu, yang dimaksud dengan kabar gembira di sini ialah lawan daripada kabar gembira itu, yaitu kabar sedih sebagai penghinaan kepada mereka.",
      "text_translation": "(yaitu) orang yang mendengar ayat-ayat Allah ketika dibacakan kepadanya namun dia tetap menyombongkan diri seakan-akan dia tidak mendengarnya. Maka peringatkanlah dia dengan azab yang pedih.",
      "text": "يَّسْمَعُ اٰيٰتِ اللّٰهِ تُتْلٰى عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِرًا كَاَنْ لَّمْ يَسْمَعْهَاۚ فَبَشِّرْهُ بِعَذَابٍ اَلِيْمٍ",
      "text_translation_en": "who hears God’s messages when they are conveyed to him, and yet, as though he had not heard them, persists in his haughty disdain! Hence, announce unto him grievous suffering –",
      "juz_number": 25
    },
    "9": {
      "text_tafsir_en": "This verse describes another attitude of the Meccan monks as they listened to the Qur'anic verses presented to them. When some of their friends spread the word about the Qur'anic verses, they mocked those verses. It is narrated that when Abu Jahal heard the word of Allah: The tree of zaqqum, it is food for the guilty. (ad-Dukhan \/ 44: 43-44) He asked for palm and cheese, and said to his friends, \"Eat this zaqqum fruit, which Muhammad saw to you is nothing but sweet food like honey.\" And when he heard the word of Allah: There were nineteen (guardian angels) on it. (al-Muddatstsir \/ 74: 30) Abu Jahal said, \"If his guardian is only nineteen, then I will throw them myself.\" There are many other ways and attitudes that derive from the disbelievers of Mecca when they hear the Qur'anic reading. Even Abu Jahal challenged what the Qur'an describes: And (remember), when they said, \"O Allah, if this (Qur'an) is true of You, then rain down.\" us with stones from the sky, or bring us a painful torment. \" (al-Anfal \/ 8:32) Because they have always rejected Allah's revelations and ridiculed them, in this verse Allah affirms the reward they will receive in the hereafter. They will be cast into a humiliating hell and torture them in return for their attitude and actions.",
      "text_tafsir": "Pada ayat ini diterangkan sikap yang lain dari orang musyrik Mekah sewaktu mendengar ayat-ayat Al-Qur'an disampaikan kepada mereka. Apabila ada di antara kawan-kawan mereka yang menyampaikan berita tentang ayat-ayat Al-Qur'an, mereka pun memperolok-olok ayat-ayat itu.\n\nDiriwayatkan bahwa ketika Abu Jahal mendengar firman Allah:\n\nSungguh pohon zaqqum itu, makanan bagi orang yang banyak dosa. (ad-Dukhan\/44: 43-44)\n\nia meminta korma dan keju, seraya berkata kepada kawan-kawannya, \"Makanlah buah zaqqum ini, yang diancamkan Muhammad saw kepadamu itu tidak lain adalah makanan yang manisnya seperti madu.\" Dan ketika ia mendengar firman Allah:\n\nDi atasnya ada sembilan belas (malaikat penjaga). (al-Muddatstsir\/74: 30)\n\nAbu Jahal berkata, \"Kalau penjaganya hanya sembilan belas, maka saya sendiri akan melemparkan mereka itu.\" Banyak lagi cara-cara dan sikap lain yang bernada menghina dari orang-orang kafir Mekah pada waktu mereka mendengar bacaan Al-Qur'an. Bahkan Abu Jahal menantang sebagaimana yang diterangkan Al-Qur'an:\n\nDan (ingatlah), ketika mereka (orang-orang musyrik) berkata, \"Ya Allah, jika (Al-Qur'an) ini benar (wahyu) dari Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih.\" (al-Anfal\/8: 32)\n\nKarena mereka selalu mendustakan ayat-ayat Allah dan memperolok-olokkannya, maka dalam ayat ini Allah menegaskan balasan yang akan mereka terima nanti di akhirat. Mereka akan dimasukkan ke dalam neraka yang menghinakan dan menyiksa mereka sebagai balasan dari sikap dan perbuatan mereka itu.",
      "text_translation": "Dan apabila dia mengetahui sedikit tentang ayat-ayat Kami, maka (ayat-ayat itu) dijadikan olok-olok. Merekalah yang akan menerima azab yang menghinakan.",
      "text": "وَاِذَا عَلِمَ مِنْ اٰيٰتِنَا شَيْـًٔا ۨاتَّخَذَهَا هُزُوًاۗ اُولٰۤىِٕكَ لَهُمْ عَذَابٌ مُّهِيْنٌۗ ",
      "text_translation_en": "for when he does become aware of any of Our messages, he makes them a target of his mockery! For all such there is shameful suffering in store.",
      "juz_number": 25
    },
    "10": {
      "text_tafsir_en": "In this verse Allah explains that the Muslims in the Hereafter will face the Hell that has been provided for them, because they are always arrogant to accept the instructions given by the Prophet Muhammad. Everything they do in the world will not save them from hell, nor will they worship anything other than Allah, which will not give them any protection and they will receive a great punishment.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan bahwa kaum musyrikin di akhirat kelak akan berhadapan dengan neraka Jahanam yang telah disediakan untuk mereka, sebab mereka selalu bersikap sombong untuk menerima petunjuk yang disampaikan oleh Nabi Muhammad. Segala sesuatu yang mereka usahakan di dunia sedikit pun tidak dapat menyelamatkan mereka dari Jahanam, demikian pula apa yang mereka sembah selain Allah, tidak dapat memberikan perlindungan sedikit pun dan mereka akan memperoleh azab yang sangat besar.",
      "text_translation": "Di hadapan mereka neraka Jahanam dan tidak akan berguna bagi mereka sedikit pun apa yang telah mereka kerjakan, dan tidak pula (bermanfaat) apa yang mereka jadikan sebagai pelindung-pelindung (mereka) selain Allah. Dan mereka akan mendapat azab yang besar.",
      "text": "مِنْ وَّرَاۤىِٕهِمْ جَهَنَّمُ ۚوَلَا يُغْنِيْ عَنْهُمْ مَّا كَسَبُوْا شَيْـًٔا وَّلَا مَا اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اَوْلِيَاۤءَۚ وَلَهُمْ عَذَابٌ عَظِيْمٌۗ ",
      "text_translation_en": "Hell is ahead of them; and all that they may have gained [in this world] shall be of no avail whatever to them, and neither shall any of those things which, instead of God, they have come to regard as their protectors: for, awesome suffering awaits them.",
      "juz_number": 25
    },
    "11": {
      "text_tafsir_en": "In this verse it is explained that the Qur'an is a direct reference from Allah, which He passed on to Muhammad, to be passed on to all mankind. It is the lead that leads people to the right path to happiness and the hereafter. It is said that those who disregard the Qur'an's guidance will find their way astray, the path leading to the suffering of this world and the hereafter. The Qur'an as a guide can lead mankind from error to truth, from unbelief to faith. Therefore, the unbeliever will suffer a very painful torment.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa Al-Qur'an adalah petunjuk yang berasal dari Allah, yang disampaikan-Nya kepada Muhammad saw, agar disampaikan kepada seluruh umat manusia. Petunjuk itu yang menuntun manusia ke jalan yang benar menuju kebahagiaan dunia dan akhirat.\n\nDiterangkan orang yang mengingkari petunjuk Al-Qur'an itu akan menempuh jalan yang sesat, jalan yang menuju kepada penderitaan hidup dunia dan akhirat.\n\nAl-Qur'an sebagai petunjuk dapat mengeluarkan manusia dari kesesatan menuju kebenaran, dari kekafiran menuju keimanan. Oleh karena itu, orang yang tidak beriman akan mendapat siksa yang sangat pedih.",
      "text_translation": "Ini (Al-Qur'an) adalah petunjuk. Dan orang-orang yang mengingkari ayat-ayat Tuhannya mereka akan mendapat azab berupa siksaan yang sangat pedih.",
      "text": "هٰذَا هُدًىۚ وَالَّذِيْنَ كَفَرُوْا بِاٰيٰتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِّنْ رِّجْزٍ اَلِيْمٌ ࣖ",
      "text_translation_en": "[To pay heed to God’s signs and messages:] this is [the meaning of] guidance; on the other hand, for those who are bent on denying the truth of their Sustainer’s messages there is grievous suffering in store as an outcome of [their] vileness.",
      "juz_number": 25
    },
    "12": {
      "text_tafsir_en": "God declares that He is the one who bows the sea for human needs. This means that God created the sea only for humans. In another verse it is explained that God made the earth and all of its contents for humans. Allah says: He (Allah) created all that is on earth for you then He went to heaven, then He perfected it into seven heavens. And He is All-Knowing everything. (al-Baqarah \/ 2: 29) Therefore, this verse seems to encourage humans to try and think as much as possible, where the sea and all its contents can be used to share needs, as well as the universe. As an example, several results of human thought that have been used in utilizing the oceans are presented, for example ships sailing from one country to another, transporting people and their daily necessities. Of course traffic at sea will be able to strengthen relations between residents of one country and residents of other countries. Humans can also use this sea as a source of livelihood. Inside there are ingredients that can be used as food, such as fish, seaweed, and so on. There are also jewelry materials such as pearls, marjan, and the like. Sea water can be evaporated so that it produces salt which is useful to add energy and to taste food, and can be cultivated as fresh water to be used as drinking water and to irrigate plants, and so on. Coral stones of various colors and various shapes and types are removed from the sea, used as chalk for household building materials. At present, more and more are found from the sea such as oil, iron and various metals. In the face of an explosion of population development today, people have begun to turn their minds to the ocean. They have begun to think about the possibilities of utilizing and extracting marine products as a source of food, because food production on land is expected in the near future to be reduced and not balanced with the number and increase of population. All of that is a gift of God bestowed upon humans as a sign of His mercy, so that people will give thanks. Very many other gifts of God that have not been found by humans, because that let people try and think how to find them. God subdues the sea so ships can sail to it. One of his many gifts is the ability of humans with God's permission to dive on submarines. The submarine, which is now also widely used in research, is a water vehicle that can operate in water at pressures that humans can withstand. The submarine is in a positive floating state and weighs less than the volume of water it transfers. To dive hydrostatically, a ship must get a negative buoyancy by increasing its own weight or by reducing the volume of water transferred. To control its weight, a submarine must be equipped with a ballast tank that can be filled either with water from its surroundings, or with compressed air. For general diving and floats, submarines use forward and backward tanks called Main Ballast Tanks that can be opened and filled with water to dive or filled with compressed air to float.",
      "text_tafsir": "Allah menyatakan bahwa Dia-lah yang menundukkan laut untuk keperluan manusia. Hal ini berarti bahwa Allah menciptakan laut hanyalah untuk manusia. Dalam ayat yang lain diterangkan bahwa Allah menjadikan bumi dan semua isinya untuk manusia.\n\nAllah berfirman:\n\nDialah (Allah) yang menciptakan segala apa yang ada di bumi untukmu kemudian Dia menuju ke langit, lalu Dia menyempurnakannya menjadi tujuh langit. Dan Dia Maha Mengetahui segala sesuatu. (al-Baqarah\/2: 29)\n\nKarena itu, ayat ini seakan-akan mendorong manusia berusaha dan berpikir semaksimal mungkin, di mana laut dan segala isinya itu dapat dimanfaatkan untuk berbagi keperluan, demikian pula alam semesta ini. Sebagai contoh dikemukakan beberapa hasil pemikiran manusia yang telah digunakan dalam memanfaatkan lautan, misalnya kapal yang berlayar dari sebuah negeri ke negeri yang lain, mengangkut manusia dan barang-barang keperluan hidup mereka sehari-hari. Tentu saja lalu-lintas di laut itu akan dapat mempererat hubungan antara penduduk suatu negeri dengan penduduk negeri yang lain.\n\nManusia juga dapat memanfaatkan laut ini sebagai sumber penghidupan. Di dalamnya terdapat bahan-bahan yang dapat dijadikan makanan, seperti ikan, rumput-rumput laut, dan sebagainya. Juga terdapat bahan perhiasan seperti mutiara, marjan, dan semacamnya. Air laut dapat diuapkan sehingga menghasilkan garam yang berguna untuk menambah tenaga dan menyedapkan makanan, dan dapat diusahakan menjadi tawar untuk dijadikan air minum dan untuk mengairi tanaman, dan untuk lain-lain.\n\nBatu karang yang beraneka warna dan ragam bentuk dan jenisnya dikeluarkan dari laut, dijadikan kapur untuk bahan bangunan rumah tangga.\n\nPada masa sekarang, semakin banyak yang ditemukan dari dalam laut seperti minyak, besi dan logam yang bermacam-macam. Dalam menghadapi ledakan perkembangan penduduk dewasa ini, orang telah mulai mengarahkan pikirannya ke lautan. Mereka telah mulai memikirkan kemungkinan-kemungkinan memanfaatkan dan menggali hasil lautan sebagai sumber bahan makanan karena produksi bahan makanan di daratan di duga dalam waktu yang tidak lama lagi akan berkurang dan tidak seimbang dengan jumlah dan pertambahan penduduk.\n\nSemua itu adalah karunia Allah yang dianugerahkan kepada manusia sebagai tanda kemurahan-Nya, agar dengan demikian manusia mensyukurinya. Amat banyak lagi karunia Allah yang lain yang belum diketemukan manusia, karena itu hendaklah manusia berusaha dan berpikir bagaimana menemukannya.\n\nAllah menundukkan lautan supaya kapal-kapal dapat berlayar padanya. Salah satu yang merupakan sekian banyak karunia-Nya adalah kemampuan manusia dengan izin Allah untuk menyelam pada kapal selam. Kapal selam, yang kini juga banyak digunakan dalam penelitian, merupakan suatu kendaraan air yang bisa beroperasi di dalam air pada tekanan-tekanan yang mampu ditahan oleh manusia. Kapal selam berada dalam keadaan terapung secara positif dan bobotnya lebih kecil dari volume air yang dipindahkannya. Untuk menyelam secara hidrostatis, suatu kapal harus mendapatkan keterapungan negatif dengan cara menambah bobotnya sendiri atau dengan memperkecil volume air yang dipindahkan. Untuk mengendalikan bobotnya, suatu kapal selam harus dilengkapi dengan tangki ballast yang dapat diisi baik dengan air dari sekelilingnya, atau dengan udara tekan. Untuk gerakan penyelaman dan pengapungan secara umum, maka kapal selam menggunakan tangki maju dan mundur yang dinamakan Tangki Balas Utama (Main Ballast Tank) yang bisa dibuka dan diisi penuh dengan air untuk bisa menyelam atau diisi dengan udara tekan untuk mengapung.",
      "text_translation": "Allah-lah yang menundukkan laut untukmu agar kapal-kapal dapat berlayar di atasnya dengan perintah-Nya, dan agar kamu dapat mencari sebagian karunia-Nya dan agar kamu bersyukur.",
      "text": "۞ اَللّٰهُ الَّذِيْ سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيْهِ بِاَمْرِهٖ وَلِتَبْتَغُوْا مِنْ فَضْلِهٖ وَلَعَلَّكُمْ تَشْكُرُوْنَۚ ",
      "text_translation_en": "IT IS GOD who has made the sea subservient [to His laws, so that it be of use] to you so that ships might sail through it at His behest, and that you might seek to obtain [what you need] of His bounty, and that you might have cause to be grateful.",
      "juz_number": 25
    },
    "13": {
      "text_tafsir_en": "Furthermore, Allah explained that He was the one who subjected all His creatures in the heavens and the earth so that humans could use and use them for their interests in carrying out their duties as the Khalifah of Allah on earth. This means that humans are obliged to seek the benefits and uses of God's creation for them. The key to all is the willpower and desire to know some of God's knowledge. This has been started by humans since ancient times until now so that the longer the life of the earth is inhabited by humans, the more knowledge of Allah is known to humans and the benefits of the universe. All this for the benefit of life and human life. However, only a small part of Allah's knowledge is known to humans. God's creations in the sky such as the sun, moon, stars, clouds, wind, rain water, and His creations on earth such as plants, animals, mountains, oceans and some of them are all created aside as a mercy and His gifts to humans also contain signs of His power and majesty, which shows that the creator is the One Who is the One. There is no other God besides Him, who always takes care of His creatures and does not deserve to be associated with anything. Such a conclusion will only be obtained by a servant of God who makes careful observations, uses a healthy mind and is willing to search for truth. If someone wants to pay attention to the universe, want to pay attention to the relationship of the unity of one type of creature with other creatures, surely he will come to the conclusion that each of these entities has something to do with one another, can not be separated or stand alone. Seen in the process of rain, is closely related to the presence of the sea, the presence of mountains, the heat emitted by the sun, the presence of wind and so on. Likewise the range of wind direction is determined by many things, such as the presence of clouds, mountains and solar heat. Ships that sail on the sea require wind gusts or fuel such as coal or oil. The higher a person's knowledge, the more he knows the relationship between one being and other beings. The moon cannot release its path from the earth, as if it were imprisoned by the earth, and so the earth and the other planets became prisoners of the sun. The planets always circle the sun in their respective paths. Furthermore, the sun and the planets that follow cannot escape from a greater unity, the Milky Way Galaxy. Finally, the Milky Way Galaxy together with other galaxies is also bound to a certain arrangement. So with thought and research one will come to the conclusion that its creator is surely the One Who is Almighty. The above verse as with many similar verses shows how God subjected the heavens and the earth to humans. As it is known that nature has physical properties which are all the decrees of Allah, the Sunatullah, and are manifestations of natural submission. For example, the earth has physical properties such as electricity, magnetism, elasticity and mass density. From these physical properties, humans, especially geologists, can study the earth even to the point of penetrating the earth. By utilizing the nature of the elasticity of the earth, humans can capture the waves of the earthquake that travels in the bowels of the earth and know the physical characteristics of the earth's layer through it. With this earthquake wave humans can know the layers of the earth from the top to the core of the earth which is about 6000 km below us. In practical use, the search for petroleum uses the nature of the earth's elasticity by sending waves originating from 'artificial earthquakes', which in the past used dynamite.In the earth there is a nucleus, the outer part is liquid.The core is what causes the earth to have Strong magnetic fields that play an important role in maintaining the continuity of life Spread far above the surface, this magnetic field protects the earth from damaging radiation and comes from outer space Radiation from stars other than the sun cannot pass through this shield, which is called by the name of the Van Allen Belt This shield extends to about 18,000 km from the earth, protecting this ball from deadly energy.In a practical aspect, by knowing the nature of this magnetism also earth experts develop exploration methods both mineral and petroleum. to play around, many are mentioned in many verses Al- The Qur'an. This statement guarantees that the earth is habitable. God made it easy for humans to inhabit. He is the one who made the earth for you that is easy to explore. (al-Mulk \/ 67: 15)",
      "text_tafsir": "Selanjutnya Allah menjelaskan bahwa Dia-lah yang menundukkan semua makhluk ciptaan-Nya yang ada di langit dan di bumi agar manusia dapat menggunakan dan memanfaatkannya untuk kepentingan mereka dalam melaksanakan tugas sebagai khalifah Allah di bumi. Hal ini berarti bahwa manusia wajib berusaha mencari manfaat dan kegunaan ciptaan Allah bagi mereka. Kunci dari semuanya adalah kemauan berusaha dan keinginan mengetahui sebagian pengetahuan Allah. Hal ini telah dimulai oleh manusia sejak zaman dahulu sampai sekarang sehingga semakin lama umur bumi ini didiami manusia, semakin banyak pula ilmu Allah yang diketahui manusia dan manfaat alam semesta. Semua ini untuk kepentingan hidup dan kehidupan manusia. Namun, baru sebagian kecil saja dari ilmu Allah yang telah diketahui manusia.\n\nCiptaan Allah yang ada di langit seperti matahari, bulan, bintang-bintang, awan, angin, air hujan, dan ciptaan-Nya yang ada di bumi seperti tumbuh-tumbuhan, binatang, gunung, lautan dan sebagiannya semua diciptakan-Nya di samping sebagai rahmat dan karunia-Nya kepada manusia juga mengandung tanda-tanda kekuasaan dan keagungan-Nya, yang menunjukkan bahwa penciptanya adalah Zat Yang Maha Esa. Tidak ada Tuhan yang lain selain Dia, yang selalu menjaga makhluk-Nya dan tidak layak dipersekutukan dengan sesuatu pun. Kesimpulan seperti ini hanya akan diperoleh oleh hamba Allah yang melakukan pengamatan dengan cermat, menggunakan pikiran yang sehat dan mau mencari kebenaran.\n\nApabila seseorang mau memperhatikan alam semesta, mau memperhatikan hubungan kesatuan satu jenis makhluk dengan makhluk yang lain, tentulah ia akan sampai kepada kesimpulan bahwa masing-masing kesatuan itu ada kaitannya antara yang satu dengan yang lain, tidak dapat lepas atau berdiri sendiri. Terlihat dalam proses terjadinya hujan, erat hubungannya dengan adanya laut, adanya gunung-gunung, adanya panas yang dipancarkan matahari, adanya angin dan sebagainya. Demikian pula perkisaran arah angin ditentukan oleh banyak hal, seperti adanya awan, gunung dan panas matahari.\n\nKapal yang berlayar di laut memerlukan hembusan angin atau bahan bakar seperti batubara atau minyak. Semakin tinggi ilmu pengetahuan seseorang semakin banyak pula ia mengetahui hubungan antara satu makhluk dengan makhluk-makhluk yang lain. Bulan tidak dapat melepaskan lintasannya dari bumi, seolah-olah tertawan oleh bumi, demikian pula bumi dan planet-planet yang lain menjadi tawanan matahari. Planet-planet itu selalu mengitari matahari pada garis edarnya masing-masing. Selanjutnya matahari dan planet-planet yang mengikuti tidak dapat melepaskan diri dari kesatuan yang lebih besar, yaitu Galaksi Bimasakti. Akhirnya Galaksi Bimasakti bersama-sama galaksi-galaksi yang lain terikat pula kepada tata susunan tertentu pula. Maka dengan pemikiran dan penelitian orang akan sampai kepada kesimpulan bahwa penciptanya tentulah Zat Yang Maha Esa lagi Mahakuasa.\n\nAyat di atas sebagaimana banyak ayat senada memperlihatkan bagaimana Allah menundukkan langit dan bumi untuk manusia. Seperti diketahui alam memiliki sifat-sifat fisis yang semuanya merupakan ketetapan Allah, Sunatullah, dan merupakan manifestasi ketertundukan alam. Sebagai contoh, bumi memiliki sifat-sifat fisis seperti kelistrikan, kemagnetan, elastisitas dan kerapatan massa. Dari sifat-sifat fisis tersebut manusia, khususnya para ahli kebumian, dapat mempelajari bumi bahkan sampai jauh menembus bumi. Dengan memanfaatkan sifat elastisitas bumi, manusia bisa menangkap gelombang-gelombang gempa yang menjalar dalam perut bumi dan mengetahui karakter fisis lapisan bumi yang dilaluinya. Dengan gelombang gempa ini manusia dapat mengetahui lapisan-lapisan bumi dari atas hingga inti bumi yang berada sekitar 6000 km di bawah kita. Pada penggunaan praktis, pencarian minyak bumi menggunakan sifat elsatisitas bumi ini yakni dengan mengirim gelombang yang sumbernya berasal 'gempa buatan\", yang di masa lalu menggunakan dinamit.\n\nDi bagian dalam bumi terdapat intibumi, yang bagian luarnya bersifat cair. Inti inilah yang menyebabkan bumi memiliki medan magnet kuat yang berperan penting dalam menjaga kelangsungan kehidupan. Menyebar jauh di atas permukaan, medan magnet ini melindungi bumi dari radiasi yang merusak dan berasal dari angkasa luar. Radiasi dari bintang selain matahari tidak dapat melewati perisai ini, yang disebut dengan nama Sabuk Van Allen. Perisai ini merentang hingga sekitar 18.000 km dari bumi, melindungi bola ini dari energi mematikan. Dalam aspek praktis, dengan mengetahui sifat kemagnetan ini pula para ahli-ahli kebumian mengembangkan metoda-metoda eksplorasi baik mineral maupun minyak bumi. \n\nPernyataan mengenai penciptaan yang dilakukan bukan untuk main-main, banyak di kemukakan dalam banyak ayat Al-Qur'an. Pernyataan inilah yang menjamin bahwa bumi layak huni. Bumi dimudahkan Allah untuk dihuni umat manusia.\n\nDialah yang menjadikan bumi untuk kamu yang mudah dijelajahi. (al-Mulk\/67: 15)",
      "text_translation": "Dan Dia menundukkan apa yang ada di langit dan apa yang ada di bumi untukmu semuanya (sebagai rahmat) dari-Nya. Sungguh, dalam hal yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang berpikir.",
      "text": "وَسَخَّرَ لَكُمْ مَّا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِ جَمِيْعًا مِّنْهُ ۗاِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّتَفَكَّرُوْنَ ",
      "text_translation_en": "And He has made subservient to you, [as a gift] from Himself, all that is in the heavens and on earth: in this, behold, there are messages indeed for people who think!",
      "juz_number": 25
    },
    "14": {
      "text_tafsir_en": "Al-Wahidi and al-Qusyairi narrate from Ibn 'Abbas that this verse is related to the question of' Umar bin al-Khaththab and Abdullah bin Ubay in the battle of the Children of Musthalik. They stopped at a well called Al-Muraisi ', and then Abdullah sent a young man to fetch water, but the young man returned a long time ago, Abdullah bin Ubay asked the young man why he had returned so long. The young man replied that Umar was sitting by the well. He did not allow anyone to take water before he filled the veil of the Prophet Muhammad, Abu Bakr, and the former Umar boy, then Abdullah bin Ubay said, \"We and they do not change it like a proverb: Make your dog happy, then it will eat you up. \" Then Abdullah's words came to Umar. He became angry and drew his sword to kill Abdullah bin Ubay, and this verse came down on Umar's heart. Then Allah commanded the Messenger of Allah (may peace be upon him) and his followers to be brave in facing the attitude of the Muslims and to forgive their acts of mocking Allah's verses. They are people who oppose God and do not fear His threat. From this verse it is understood that the high moral values that Islam teaches to its followers are to be hard-hearted and to forgive those who have acted unkindly against themselves or tried to destroy their religion. Forgiving one's family, friends, neighbors and acquaintances can be easy for one person to do, but to be generous and to forgive the acts of those who always want to destroy themselves and their religion at every opportunity requires greatness of soul. This verse teaches and educates Muslims to be brave, forgiving, and passionate in dealing with everything in their lives. At the end of this verse Allah explains why the Prophet (saws) and his followers were obliged to cheat and forgive the actions of the Quraysh who mocked the verses of Allah. The reason is that Allah will reward them according to their deeds.",
      "text_tafsir": "Al-Wahidi dan al-Qusyairi meriwayatkan dari Ibnu 'Abbas bahwa ayat ini turun berhubungan dengan persoalan yang terjadi antara 'Umar bin al-Khaththab dan Abdullah bin Ubay dalam peperangan Bani Musthalik. Mereka singgah di sebuah sumur yang disebut Al-Muraisi', kemudian Abdullah mengutus seorang anak muda mengambil air, tetapi pemuda itu lama sekali kembali, Abdullah bin Ubay bertanya kepada pemuda itu mengapa begitu lama ia baru kembali. Pemuda itu menjawab bahwa Umar duduk di pinggir sumur. Ia tidak membiarkan seorang pun mengambil air sebelum ia mengisi girbai (tempat air dari kulit) Nabi Muhammad saw, girbai Abu Bakar, dan girbai bekas budak Umar, lalu Abdullah bin Ubay berkata, \"Kami dan mereka tidak ubahnya seperti perumpamaan: Gemukkan anjingmu, maka ia akan memakan engkau.\" Kemudian kata-kata Abdullah itu sampai kepada Umar. Beliau menjadi marah, lalu menghunus pedangnya untuk membunuh Abdullah bin Ubay, maka turunlah ayat ini yang melunakkan hati Umar.\n\nSelanjutnya Allah memerintahkan kepada Rasulullah saw dan para pengikutnya agar berlapang dada dalam menghadapi sikap kaum musyrikin dan memaafkan tindakan mereka yang memperolok-olokkan ayat-ayat Allah. Mereka adalah orang yang menentang Allah dan tidak takut kepada ancaman-Nya.\n\nDari ayat ini dipahami nilai budi pekerti yang tinggi yang diajarkan agama Islam kepada penganutnya yaitu berlapang dada dan memaafkan orang-orang yang pernah bertindak tidak baik terhadap dirinya atau berusaha menghancurkan agamanya. Memaafkan kesalahan keluarga, teman sejawat, tetangga dan kenalan dapat dengan mudah dilakukan seseorang, tetapi berlapang dada dan memaafkan perbuatan orang yang selalu ingin merusak diri dan agamanya pada setiap kesempatan memerlukan kebesaran jiwa.\n\nAyat ini mengajarkan dan mendidik kaum Muslimin agar dapat berlapang dada, suka memaafkan, dan berjiwa besar dalam menghadapi segala sesuatu dalam hidupnya.\n\nPada akhir ayat ini Allah menerangkan mengapa Rasulullah saw dan pengikut-pengikutnya harus berlapang dada dan memaafkan tindakan orang Quraisy yang memperolok-olok ayat-ayat Allah itu. Sebabnya ialah karena Allah yang akan memberikan pembalasan yang setimpal kepada mereka sesuai dengan perbuatannya.",
      "text_translation": "Katakanlah (Muhammad) kepada orang-orang yang beriman hendaklah mereka memaafkan orang-orang yang tidak takut akan hari-hari Allah karena Dia akan membalas suatu kaum sesuai dengan apa yang telah mereka kerjakan.",
      "text": "قُلْ لِّلَّذِيْنَ اٰمَنُوْا يَغْفِرُوْا لِلَّذِيْنَ لَا يَرْجُوْنَ اَيَّامَ اللّٰهِ لِيَجْزِيَ قَوْمًا ۢبِمَا كَانُوْا يَكْسِبُوْنَ ",
      "text_translation_en": "Tell all who have attained to faith that they should forgive those who do not believe in the com­ing of the Days of God, [since it is] for Him [alone] to requite people for whatever they may have earned.",
      "juz_number": 25
    },
    "15": {
      "text_tafsir_en": "In this verse God explains that each person will receive his own reward according to his deeds in the world. Whoever among his servants obeys his commands and abstains from all his prohibitions with all sincerity and intelligence, the result is for himself. He will find a happy return. On the contrary, whoever disobeys His commands and does not restrain His prohibition, then the consequences of his actions will result in his own doing. It will have a terrible return, disgrace, and terrible torment in hell. At the end of this verse God explains that only to God is returned all beings, not others. Everything will be gathered in the Field of Mahsyar to receive the justice of Allah. Some of them are radiant with joy because they will meet the God they have always hoped for in life. They believe that God loves His servant who is patient, patient and always submissive and submissive to Him. On the other hand, there are people whose faces are saddened by fear and regret. They are afraid to meet God because they will accept His wrath and will experience a very painful torment in hell.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan bahwa tiap-tiap orang akan mendapat balasan masing-masing sesuai dengan amal perbuatannya di dunia. Maka barang siapa di antara hamba-Nya menaati segala perintah-Nya dan menjauhi segala larangan-Nya dengan penuh keikhlasan dan kesadaran, maka hasilnya itu adalah untuk dirinya sendiri. Ia akan memperoleh tempat kembali yang penuh kenikmatan. Sebaliknya barang siapa yang mengingkari perintah-perintah-Nya dan tidak menghentikan larangan-larangan-Nya, maka akibat buruk sebagai balasan perbuatannya itu akan menimpa dirinya sendiri. Ia akan mendapat tempat kembali yang buruk, hina, dan azab yang sangat berat di dalam neraka.\n\nPada akhir ayat ini Allah menerangkan bahwa hanya kepada Allah dikembalikan semua makhluk, tidak kepada yang lain. Semuanya akan dikumpulkan di Padang Mahsyar untuk menerima keputusan yang adil dari Allah. Di antara mereka ada yang berseri-seri wajahnya kegirangan karena ia akan bertemu dengan Allah yang selalu diharapkan selama hidup di dunia. Mereka yakin bahwa Allah mengasihi hamba-Nya yang tabah, sabar dan selalu tunduk dan patuh kepada-Nya. Sebaliknya, ada pula orang yang muram mukanya karena hatinya penuh ketakutan dan penyesalan. Mereka takut menemui Allah karena akan menerima kemurkaan-Nya serta akan merasakan siksaan yang sangat pedih di dalam neraka.",
      "text_translation": "Barangsiapa mengerjakan kebajikan maka itu adalah untuk dirinya sendiri, dan barangsiapa mengerjakan kejahatan, maka itu akan menimpa dirinya sendiri, kemudian kepada Tuhanmu kamu dikembalikan.",
      "text": "مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهٖۚ وَمَنْ اَسَاۤءَ فَعَلَيْهَا ۖ ثُمَّ اِلٰى رَبِّكُمْ تُرْجَعُوْنَ",
      "text_translation_en": "Whoever does what is just and right, does so for his own good; and whoever does evil, does so to his own hurt; and in the end unto your Sustainer you all will be brought back.",
      "juz_number": 25
    },
    "16": {
      "text_tafsir_en": "In this verse God explains that the Children of Israel were given the Book of Torah, the ability to understand the religion, the prophecies, the abundance of provisions and the superiority of the nations of that time. The gift God gave to the Children of Israel at that time was in keeping with the attitude and efforts of the Children of Israel in upholding God's religion. Therefore, the given priority is also the priority of the world and the afterlife. In this verse are mentioned six kinds of gifts given to them, namely: First: the Book of the Torah. This book was passed down to Moses. It contains instructions, lessons and provisions that can guide the Children of Israel in the right way. This book was specifically passed down by God to the Children of Israel. Second: The ability to understand the religion of God. With this ability, Moses, Aaron, and their leaders could explain the conflict that arose between their people and in this way the religion of God could be better explained to the Children of Israel. Third: Many Prophets among the apostles and prophets whom God had sent out of the Children of Israel; some of them were just prophets like Prophet Khidir, some were prophets and apostles like Moses, Aaron, Ayyub, etc., and there were prophets and apostles who were appointed among them besides serving as prophets and apostles, as well as heads of nations like David and Solomon. Thus, the powers of the world and religion are brought to them. Fourth: The abundant provision of the Children of Israel was given to God in the days of the prosperity and the golden years of the reign of David and the reign of his son Solomon. Many stories tell of the greatness and success of the Children of Israel during the reign of the son and the father. The power and wisdom of David and Solomon are described in the Qur'an. What the Children of Israel did at that time was not acquired by the nations of their time. Fifth: The priority of those who surpassed the nations of his day was that of David and Solomon. Sixth: God has given them laws and teachings that are miraculous. This is what drives them to unite and they do not disagree but only a mild dispute that does not cause harm. But when knowledge came to them, they were confused as stated in the word of God above. The disagreement between them arises after the coming of the real argument (argument) because of the quarrel about the leader and the animosity between them. Of the priorities of the Children of Israel, Ibn 'Abbas once said, \"There is no one among the people of this world whom Allah loves above them.\" God has shown His signs of power that they can see, hear, and understand. They follow all the instructions of Allah. Such was the condition of the Children of Israel at that time.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa Bani Israil telah diberi Kitab Taurat, kemampuan memahami agama, kenabian, rezeki yang berlimpah dan keutamaan yang melebihi bangsa-bangsa lain pada masanya itu.\n\nAnugerah yang diberikan Allah kepada Bani Israil pada waktu itu adalah seimbang dengan sikap dan usaha Bani Israil menegakkan agama Allah. Karena itu, keutamaan yang diberikan itu juga merupakan keutamaan dunia dan akhirat. Dalam ayat yang ini disebutkan enam macam anugerah yang telah diberikan kepada mereka, yaitu:\n\nPertama : Kitab Taurat.\n\nKitab ini diturunkan kepada Nabi Musa. Di dalamnya terdapat petunjuk, pelajaran dan ketentuan-ketentuan yang dapat membimbing Bani Israil ke jalan yang benar. Kitab ini khusus diturunkan Allah untuk Bani Israil.\n\nKedua : Kemampuan memahami agama Allah.\n\nDengan kemampuan ini, Musa, Harun beserta pemimpin kaumnya dapat menjelaskan persengketaan yang terjadi di antara kaumnya dan dengan kemampuan ini pula dapat diterangkan agama Allah kepada Bani Israil dengan baik.\n\nKetiga : Kenabian\n\nBanyak di antara para rasul dan para nabi yang diutus Allah diangkat dari Bani Israil; ada di antara mereka sebagai Nabi saja seperti Nabi Khidir, ada pula sebagai nabi dan rasul seperti Musa, Harun, Ayyub, dan lain-lain, dan ada pula nabi dan rasul yang diangkat dari kalangan mereka di samping bertugas sebagai nabi dan rasul, juga sebagai kepala negara seperti Nabi Daud dan Nabi Sulaiman. Dengan demikian, terhimpunlah kekuasaan dunia dan agama pada mereka.\n\nKeempat : Rezeki yang berlimpah-limpah\n\nBani Israil telah dianugerahi Allah masa kejayaan dan keemasan pada masa-masa pemerintahan Nabi Daud dan pada masa pemerintahan putranya Sulaiman. Banyak kisah yang menceritakan keagungan dan kejayaan Bani Israil pada masa kedua pemerintahan anak dan bapak itu. Kekuasaan dan kebijaksanaan Nabi Daud dan Nabi Sulaiman diterangkan dalam Al-Qur'an. Apa yang pernah dicapai Bani Israil pada waktu itu tidak diperoleh oleh bangsa lain yang sezaman dengannya.\n\nKelima : Keutamaan mereka yang melebihi bangsa-bangsa lain pada zamannya yaitu pada zaman Nabi Daud dan Nabi Sulaiman.\n\nKeenam:Allah telah memberikan kepada mereka hukum-hukum dan ajaran-ajaran yang diperkuat dengan mukjizat-mukjizat. Hal ini yang mendorong mereka untuk bersatu dan mereka tidak berselisih melainkan hanya perselisihan yang ringan yang tidak membawa kemudaratan. Akan tetapi tatkala datang ilmu kepada mereka, mereka berselisih sebagaimana dinyatakan dalam firman Allah tersebut di atas. Perselisihan di antara mereka itu timbul setelah datang hujjah (argumen) yang nyata karena perebutan soal pimpinan dan kedengkian di antara mereka.\n\nSehubungan dengan keutamaan yang diperoleh Bani Israil ini, Ibnu 'Abbas pernah berkata, \"Tidak ada seorang pun di antara orang-orang di dunia ini yang dicintai Allah melebihi mereka itu.\" Allah telah menampakkan tanda-tanda kekuasaan-Nya yang dapat dilihat, didengar, dan dipahami mereka. Mereka pun mengikuti segala petunjuk Allah. Demikian keadaan Bani Israil pada zaman itu.",
      "text_translation": "Dan sungguh, kepada Bani Israil telah Kami berikan Kitab (Taurat), kekuasaan dan kenabian, Kami anugerahkan kepada mereka rezeki yang baik dan Kami lebihkan mereka atas bangsa-bangsa (pada masa itu).",
      "text": "وَلَقَدْ اٰتَيْنَا بَنِيْٓ اِسْرَاۤءِيْلَ الْكِتٰبَ وَالْحُكْمَ وَالنُّبُوَّةَ وَرَزَقْنٰهُمْ مِّنَ الطَّيِّبٰتِ وَفَضَّلْنٰهُمْ عَلَى الْعٰلَمِيْنَ ۚ ",
      "text_translation_en": "AND, INDEED, [already] unto the children of Israel did We vouchsafe revelation, and wisdom, and prophethood; and We provided for them sustenance out of the good things of life, and favoured them above all other people [of their time].",
      "juz_number": 25
    },
    "17": {
      "text_tafsir_en": "In this verse, the sixth priority that God has given to the children of Israel is that God has given them the ability to understand the arguments and the details of religion. These descriptions are sometimes laws, warnings, and some are miraculous. All are well understood and acted upon so that their lives are good, there is no disagreement with them and their community bonding is good, because there are many great efforts they can make at that time. In fact, the above provision does not only apply to the Children of Israel, but it also applies to all nations who obey God's commands and abstain from His prohibition and to obey, obey and surrender to Him. If so, then the happiness that is obtained is not only the happiness of the world, but the happiness of the hereafter. As with this verse, God reminds people to emulate the life of the Children of Israel in ancient times. At the end of this verse God explains the causes of the strife among the Children of Israel that would come later. Their prophets foretold the coming of the closing Prophet, sent to all mankind. The prophet was a descendant of Abraham from his son Ishmael. After the Prophet came and gave evidence according to the testimony given by their prophets, they rejected it, and they did not believe it. The enmity arose because the Prophet was not of the seed of Isaac, and they thought that the descendants of Isaac were more honorable than the descendants of Ishmael even though they were half brothers (Abraham). Therefore, it is not proper for the prophet and the last apostle to be descended from his descendants. Allah says: And they (the Book of the People) did not divide until after they came to them (the truth conveyed by the Prophets) because of enmity between them. (asy-Syura \/ 42: 14) In the matter of their dispute, God will make his decision on the Day of Judgment and will explain the real reason for the dispute between them. At that time, it was obvious their malice and malice, which led to the fanatics so that the favored remorse should be commended, even made them arrogant and arrogant.",
      "text_tafsir": "Pada ayat ini, dijelaskan keutamaan yang keenam yang pernah diberikan Allah kepada Bani Israil yaitu bahwa Allah telah memberikan kepada mereka kemampuan memahami dalil-dalil dan keterangan-keterangan tentang agama. Keterangan itu adakalanya berupa hukum, peringatan, dan ada pula yang berupa mukjizat. Semua dipahami dan dilaksanakan dengan baik sehingga kehidupan mereka menjadi baik, tidak terjadi perselisihan sesama mereka dan ikatan masyarakat mereka menjadi baik pula, karena itu banyak usaha besar yang dapat mereka lakukan waktu itu.\n\nSebenarnya ketentuan seperti di atas tidak saja berlaku bagi Bani Israil, tetapi juga berlaku bagi semua bangsa yang mau melaksanakan perintah-perintah Allah dan menjauhkan larangan-Nya serta tunduk, patuh dan berserah diri kepada-Nya. Jika demikian, maka kebahagiaan yang diperoleh tidak saja berupa kebahagiaan dunia, tetapi juga kebahagiaan akhirat. Seakan-akan dengan ayat ini Allah mengingatkan manusia agar mencontoh kehidupan Bani Israil pada zaman dahulu itu.\n\nPada akhir ayat ini Allah menerangkan sebab-sebab terjadinya perselisihan di kalangan Bani Israil yang datang kemudian. Nabi-nabi mereka dahulu pernah menerangkan bahwa akan datang Nabi penutup nanti, yang diutus kepada semua manusia. Nabi itu termasuk keturunan Ibrahim dari anaknya Ismail. Setelah Nabi yang dimaksud itu datang dan memberikan keterangan sesuai dengan keterangan yang disampaikan nabi-nabi mereka dahulu, mereka pun mengingkarinya, dan tidak mempercayainya. Kedengkian itu timbul karena Nabi yang diutus itu bukan dari keturunan Ishak, dan mereka menganggap bahwa keturunan Ishak lebih mulia dari keturunan Ismail walaupun keduanya adalah saudara seayah (Nabi Ibrahim). Karena itu, tidak pantas nabi dan rasul terakhir diangkat dari keturunannya. Allah berfirman:\n\nDan mereka (Ahli Kitab) tidak berpecah belah kecuali setelah datang kepada mereka ilmu (kebenaran yang disampaikan oleh para nabi) karena kedengkian antara sesama mereka. (asy-Syura\/42: 14)\n\nMengenai masalah yang mereka persengketakan itu, Allah akan memberikan keputusan-Nya pada hari Kiamat dan akan menjelaskan alasan yang sebenarnya yang menyebabkan terjadinya perselisihan di antara mereka. Pada saat itu, tampak dengan jelas hasad dan kedengkian mereka, yang menjurus kepada fanatik golongan sehingga nikmat yang semula harus disyukuri, malah menjadikan mereka sombong dan takabur.",
      "text_translation": "Dan Kami berikan kepada mereka keterangan-keterangan yang jelas tentang urusan (agama); maka mereka tidak berselisih kecuali setelah datang ilmu kepada mereka, karena kedengkian (yang ada) di antara mereka. Sungguh, Tuhanmu akan memberi putusan kepada mereka pada hari Kiamat terhadap apa yang selalu mereka perselisihkan.",
      "text": "وَاٰتَيْنٰهُمْ بَيِّنٰتٍ مِّنَ الْاَمْرِۚ فَمَا اخْتَلَفُوْٓا اِلَّا مِنْۢ بَعْدِ مَا جَاۤءَهُمُ الْعِلْمُ بَغْيًاۢ بَيْنَهُمْ ۗاِنَّ رَبَّكَ يَقْضِيْ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ",
      "text_translation_en": "And We gave them clear indications of the purpose [of faith]; and it was only after all this knowledge had been vouchsafed to them that they began, out of mutual jealousy, to hold divergent views: [but,] verily, thy Sustainer will judge be­tween them on Resurrection Day regarding all whereon they were wont to differ.",
      "juz_number": 25
    },
    "18": {
      "text_tafsir_en": "Then Allah commanded the Messenger of Allah (may peace be upon him) not to be influenced by the attitude of the Quraysh because Allah had decreed Shari'a affairs which should be taken into account in arranging religious affairs with the intermediaries of revelation. So the rules set forth in this revelation are to be followed, not to follow the passions of those who do not know them. The Shari'ah of the preceding apostles and the Shari'ah that the Prophet Muhammad had in principle and in fact had, on the basis of monotheism, guided mankind in the right way, established a community, made good and prevented wrongdoing. If there is a difference, then the difference is not a matter of principle, only in the performance of worship and in its ways. It adapts to circumstances, places and times.",
      "text_tafsir": "Kemudian Allah memerintahkan kepada Rasulullah saw agar jangan terpengaruh oleh sikap orang-orang Quraisy karena Allah telah menetapkan urusan syariat yang harus dijadikan pegangan dalam menetapkan urusan agama dengan perantara wahyu. Maka peraturan yang termuat dalam wahyu itulah yang harus diikuti, tidak boleh mengikuti hawa nafsu orang-orang yang tidak mengetahuinya. Syariat yang dibawa oleh para rasul terdahulu dan syariat yang dibawa Nabi Muhammad pada asas dan hakikatnya sama, sama-sama berasaskan tauhid, membimbing manusia ke jalan yang benar, mewujudkan kemaslahatan dalam masyarakat, menyuruh berbuat baik dan mencegah berbuat mungkar. Jika terdapat perbedaan, maka perbedaan itu bukan masalah pokok, hanya dalam pelaksanaan ibadah dan cara-caranya. Hal itu disesuaikan dengan keadaan, tempat dan waktu.",
      "text_translation": "Kemudian Kami jadikan engkau (Muhammad) mengikuti syariat (peraturan) dari agama itu, maka ikutilah (syariat itu) dan janganlah engkau ikuti keinginan orang-orang yang tidak mengetahui.",
      "text": "ثُمَّ جَعَلْنٰكَ عَلٰى شَرِيْعَةٍ مِّنَ الْاَمْرِ فَاتَّبِعْهَا وَلَا تَتَّبِعْ اَهْوَاۤءَ الَّذِيْنَ لَا يَعْلَمُوْنَ",
      "text_translation_en": "And, finally, [O Muhammad,] We have set thee on a way by which the purpose [of faith] may be fulfilled: so follow thou this [way], and follow not the likes and dislikes of those who do not know [the truth].",
      "juz_number": 25
    },
    "19": {
      "text_tafsir_en": "In this verse Allah explains that the Muslims do not know the law of Allah and do not acknowledge His uniqueness. Therefore they will not be able to reject or avoid the torment of Allah that is inflicted on them in the hereafter. It is then explained that the Muslims helped one another in the act of disobedience and rebellion. It is argued that their deception was carried out in an attempt to counteract and destroy Islam and divide the Muslims. They can do this for the rest of their lives only in the world, but in the hereafter they cannot. In that day, one cannot help another and cannot bear another's sin; every man is responsible for his own actions. At the end of the verse, God declares that He is the protector of the righteous. The fear they made to seek God's will was rewarded by Him with a double reward in the hereafter.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan bahwa orang-orang musyrik tidak mengetahui syariat Allah dan tidak mengakui keesaan-Nya. Karenanya mereka tidak akan dapat menolak atau menghindari azab Allah yang ditimpakan kepada mereka di akhirat.\n\nKemudian diterangkan bahwa orang-orang musyrik itu saling menolong antara yang satu dengan yang lain dalam melakukan kemungkaran dan kemaksiatan. Ditegaskan bahwa tipu muslihat mereka dijalankan dengan bersekongkol untuk merintangi dan merusak agama Islam dan memecah belah kaum Muslimin. Hal seperti ini dapat mereka lakukan selama hidup di dunia saja, sedangkan di akhirat nanti hal itu tidak dapat mereka lakukan. Pada hari itu, seseorang tidak dapat menolong orang lain dan tidak dapat menanggung dosa orang lain; tiap-tiap orang bertanggung jawab terhadap perbuatannya sendiri-sendiri.\n\nPada akhir ayat, Allah menegaskan bahwa Dia pelindung orang yang bertakwa. Takwa yang mereka lakukan untuk mencari keridaan Allah itu dibalas oleh-Nya dengan pahala yang berlipat ganda di akhirat.",
      "text_translation": "Sungguh, mereka tidak akan dapat menghindarkan engkau sedikit pun dari (azab) Allah. Dan sungguh, orang-orang yang zalim itu sebagian menjadi pelindung atas sebagian yang lain, sedangkan Allah pelindung bagi orang-orang yang bertakwa.",
      "text": "اِنَّهُمْ لَنْ يُّغْنُوْا عَنْكَ مِنَ اللّٰهِ شَيْـًٔا  ۗوَاِنَّ الظّٰلِمِيْنَ بَعْضُهُمْ اَوْلِيَاۤءُ بَعْضٍۚ وَاللّٰهُ وَلِيُّ الْمُتَّقِيْنَ ",
      "text_translation_en": "Behold, they could never be of any avail to thee if thou wert to defy the will of God for, verily, such evildoers are but friends and protectors of one another, whereas God is the Protector of all who are conscious of Him.",
      "juz_number": 25
    },
    "20": {
      "text_tafsir_en": "In this verse, God explains that the Qur'an is the guide of life for man, the guidance and the grace given to his trusted servant. The Qur'an is called a guide because it contains the arguments and explanations of religion that they so desperately need for human well-being in the world and their happiness in the hereafter. God's guidance and grace can only be felt by those who truly believe in God and His Messenger in carrying out the Qur'an.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan bahwa Al-Qur'an itu adalah pedoman hidup bagi manusia, petunjuk dan rahmat yang dikaruniakan kepada hamba-Nya yang meyakininya.\n\nAl-Qur'an disebut pedoman karena di dalamnya terdapat dalil-dalil dan keterangan-keterangan agama yang sangat mereka perlukan untuk kesejahteraan manusia di dunia dan kebahagiaan mereka di akhirat. Petunjuk dan rahmat Allah itu hanya akan dapat dirasakan oleh orang-orang yang benar-benar yakin dan percaya kepada Allah dan Rasul-Nya dalam melaksanakan isi Al-Qur'an.",
      "text_translation": "(Al-Qur'an) ini adalah pedoman bagi manusia, petunjuk dan rahmat bagi kaum yang meyakini.",
      "text": "هٰذَا بَصَاۤىِٕرُ لِلنَّاسِ وَهُدًى وَّرَحْمَةٌ لِّقَوْمٍ يُّوْقِنُوْنَ ",
      "text_translation_en": "This [revelation, then,] is a means of insight for mankind, and a guidance and grace unto people who are endowed with inner certainty.",
      "juz_number": 25
    },
    "21": {
      "text_tafsir_en": "God ordered His Messenger to ask the unbelievers of Mecca for their disputes with the intent of denying them. They thought that Allah would treat them and give them the same reward as those who believe. Whether Allah will equate those who believe in Him but do not fulfill His law with those who believe in His law. The answer is of course, no, not at all, as God says: The inhabitants of hell are not like the inhabitants of heaven; the inhabitants of heaven are the ones who win. (al-hasyr \/ 59: 20) In other verses, it is explained that it is not the same as believers who carry out the commands of Allah and extend His prohibitions to the wicked, who believe and acknowledge their existence. the commandments and the prohibition of Allah, but not fulfilling it, Allah says: So is a believer like a pervert (disbeliever)? They are not the same. (as-Sajdah \/ 32: 18) At the end of this verse, Allah emphasizes that all the beliefs and assumptions of the disbelievers are false and impossible. Therefore, the Muslims should be alert to such suspicions and not be influenced by them.",
      "text_tafsir": "Allah memerintahkan Rasul-Nya agar menanyakan kepada orang-orang kafir Mekah tentang persengketaan mereka dengan maksud menyangkal dugaan mereka. Mereka menduga bahwa Allah akan memperlakukan dan akan memberikan balasan yang sama kepada mereka seperti yang diberikan kepada orang-orang yang beriman. Apakah Allah akan mempersamakan orang yang beriman kepada-Nya tetapi tidak melaksanakan syariat-Nya dengan orang yang beriman yang melakukan syariat-Nya. Jawabannya tentu, tidak, sekali-kali tidak, sebagaimana firman Allah:\n\nTidak sama para penghuni neraka dengan para penghuni-penghuni surga; penghuni-penghuni surga itulah orang-orang yang memperoleh kemenangan. (al-hasyr\/59: 20)\n\nDalam ayat-ayat lain, diterangkan bahwa tidaklah sama orang-orang yang beriman yang melaksanakan perintah-perintah Allah dan menjauhkan larangan-larangan-Nya dengan orang-orang fasik, yaitu orang yang beriman dan mengakui adanya perintah-perintah dan adanya larangan Allah, tetapi tidak melaksanakannya, Allah berfirman:\n\nMaka apakah orang yang beriman seperti orang yang fasik (kafir)? Mereka tidak sama. (as-Sajdah\/32: 18)\n\nPada akhir ayat ini, Allah menegaskan bahwa semua dugaan dan sangkaan orang-orang kafir itu adalah dugaan dan sangkaan yang tidak benar dan mustahil terjadi. Karena itu, hendaklah kaum Muslimin waspada terhadap sangkaan itu sehingga tidak terpengaruh olehnya.",
      "text_translation": "Apakah orang-orang yang melakukan kejahatan itu mengira bahwa Kami akan memperlakukan mereka seperti orang-orang yang beriman dan yang mengerjakan kebajikan, yaitu sama dalam kehidupan dan kematian mere-ka? Alangkah buruknya penilaian mereka itu.",
      "text": "اَمْ حَسِبَ الَّذِيْنَ اجْتَرَحُوا السَّيِّاٰتِ اَنْ نَّجْعَلَهُمْ كَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَوَاۤءً مَّحْيَاهُمْ وَمَمَاتُهُمْ ۗسَاۤءَ مَا يَحْكُمُوْنَ ࣖࣖ",
      "text_translation_en": "Now as for those who indulge in sinful doings - do they think that We place them, both in their life and their death, on an equal footing with those who have attained to faith and do righteous deeds? Bad, indeed, is their judgment:",
      "juz_number": 25
    },
    "22": {
      "text_tafsir_en": "God explains that heaven and earth are created correctly, and has the purpose of creation according to His will. There is not a single person held by God without purpose. The purpose of the existence of one creation is to be utilized by another, in order to achieve the purpose of the other creation. If an activity has no purpose, then what happens is la'ib, a game. Instead of falsehood, the opposite of the word haq is often used to explain the same, as the verse below says: And We did not create the heavens and the earth and what is between them in vain. That is the opinion of the unbelievers, then woe to those who disbelieve because they will go to hell. (shad \/ 38: 27) As we have seen, the physical properties of the earth, such as mass, structure, temperature, and so on are just right for life. However, these attributes alone are not sufficient to enable life on earth, another important factor is the order of the atmosphere [see Surah Ibrahim \/ 14: 19 and Surah al-Jatsiyah \/ 45: 3]. No other force can change the will of God. Such provision applies to all His creation in accordance with His justice and faith. In the justice of God is the reward of his servants for their deeds and deeds on the day of vengeance. He who does good will receive his reward according to his purpose, and he who does evil will receive a reward for his evil deeds. Why is it said that such retribution is in accordance with God's justice? Because God created man as his being, equipped with the tendency and ability to do good and to do evil. Both or both of these potentials can develop in the individual. Its development is largely determined by circumstances, environment, and time. In addition, God grants human intellect. In his mind, humans have the ability to evaluate the stimuli that influence their actions and behavior. Before a person decides to perform a deed or does not do so, he or she is in a state of turmoil in considering and deciding on a choice, which attitude or action to take. At such times, people are given the freedom to choose between good and evil. In such turmoil, the human soul undergoes the so-called psychological pressures. When he chooses and decides to do a good thing, he does so at his own discretion. When he decides to make a bad decision, it does so because of his own choices. Such moments are those that determine whether he or she intentionally did something. And also distinguish between deeds; whether the act was consciously or not. That is why it is said that God's reward for His servant according to his deeds and deeds is the image of God's justice.",
      "text_tafsir": "Allah menjelaskan bahwa langit dan bumi diciptakan dengan benar, dan memiliki tujuan penciptaan sesuai dengan kehendaknya. Tidak ada satu bendapun diadakan Tuhan tanpa mempunyai tujuan. Tujuan kehadiran satu ciptaan adalah untuk dimanfaatkan oleh ciptaan yang lain, dalam rangka mencapai tujuan ciptaan yang lain itu. Apabila suatu kegiatan tidak memiliki tujuan, maka yang terjadi adalah la'ib, permainan. Kata sebaliknya bathil, kebalikan kata haq banyak digunakan untuk menjelaskan hal yang sama, sebagaimana ayat di bawah: \n\nDan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan sia-sia. Itu anggapan orang-orang kafir, maka celakalah orang-orang yang kafir itu karena mereka akan masuk neraka. (shad\/38: 27)\n\nSeperti yang kita saksikan, sifat fisis bumi, seperti massa, struktur, suhu, dan seterusnya begitu tepat bagi kehidupan. Namun, sifat-sifat itu saja tidak cukup untuk memungkinkan adanya kehidupan di bumi, faktor penting lain adalah susunan atmosfer [lihat Surah Ibrahim\/14:19 dan Surah al-Jatsiyah\/45: 3].\n\nTidak ada satu pun kekuatan lain yang dapat mengubah kehendak Allah. Ketentuan yang demikian berlaku bagi seluruh ciptaan-Nya sesuai dengan keadilan dan sunah-Nya. Di antara keadilan Allah ialah memberikan balasan yang setimpal kepada para hamba-Nya atas amal dan perbuatannya pada hari pembalasan.\n\nBarang siapa yang melakukan perbuatan yang baik akan menerima ganjarannya sesuai dengan ketentuan yang telah ditetapkan-Nya, demikian pula barang siapa yang melakukan perbuatan jahat akan menerima balasan yang setimpal dengan perbuatan jahatnya itu.\n\nMengapa dikatakan bahwa pemberian balasan yang setimpal itu sesuai dengan keadilan Allah. Karena Allah menciptakan manusia sebagai makhluk-Nya, dilengkapi dengan kecenderungan dan kemampuan untuk berbuat baik dan berbuat jahat. Kedua-duanya atau salah satu daripada kedua potensi itu dapat berkembang pada diri seseorang. Perkembangannya itu banyak ditentukan oleh keadaan, lingkungan, dan waktu. Di samping itu, Allah menganugerahi manusia akal pikiran. Dengan akal pikirannya itu manusia mempunyai kesanggupan-kesanggupan untuk menilai rangsangan-rangsangan yang mempengaruhi tindakan dan perilakunya. Sebelum seseorang menentukan sikap untuk melakukan suatu perbuatan atau tidak melakukannya, maka dalam dirinya terjadi gejolak dalam mempertimbangkan dan menetapkan suatu pilihan, sikap mana atau tindakan mana yang akan diambilnya dari kedua tindakan itu.\n\nPada saat-saat yang demikian itu, manusia diberi kemerdekaan memilih antara yang baik dan yang buruk. Dalam pergolakan yang demikian, maka jiwa manusia mendapat tekanan-tekanan yang disebut tekanan-tekanan kejiwaan. Apabila ia memilih dan memutuskan melakukan suatu kebaikan, maka perbuatan itu terjadi berdasarkan pilihannya sendiri. Bila ia memilih keputusan melakukan keburukan, maka itu pun terjadi karena pilihannya sendiri pula. Saat-saat yang seperti itu adalah saat-saat yang menentukan apakah ia sengaja melakukan suatu perbuatan atau ia tidak sengaja melakukannya. Dan juga membedakan antara perbuatan yang dilakukan; apakah perbuatan itu dilakukan dengan sadar atau tidak. Itulah sebabnya dikatakan bahwa balasan Allah terhadap hamba-Nya sesuai dengan amal dan perbuatannya, itulah gambaran keadilan Allah.",
      "text_translation": "Dan Allah menciptakan langit dan bumi dengan tujuan yang benar dan agar setiap jiwa diberi balasan sesuai dengan apa yang dikerjakannya, dan mereka tidak akan dirugikan.",
      "text": "وَخَلَقَ اللّٰهُ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّ وَلِتُجْزٰى كُلُّ نَفْسٍۢ بِمَا كَسَبَتْ وَهُمْ لَا يُظْلَمُوْنَ",
      "text_translation_en": "for, God has created the heavens and the earth in accordance with [an inner] truth, and [has therefore willed] that every human being shall be recompensed for what he has earned and none shall be wronged.",
      "juz_number": 25
    },
    "23": {
      "text_tafsir_en": "The Muqatil says that this verse is related to the events of Abu Jahal's conversation with al-Walid bin al-Mugirah. One night Abu Jahal was sleeping in the House with Walid. Both men talked about the situation of Prophet Muhammad. Abu Jahal said, \"By Allah, I actually know that Muhammad is the right one.\" Al-Walid said to him, \"Leave it alone, what do you care and what is your opinion?\" Abu Jahal replied, \"O Abu Abdisy Shams, we have called him righteous, honest, and trustworthy in his youth, but when he has grown up and is perfectly sound, we call him a liar again. By Allah, I do know that he is true. \" Al-Walid said, \"What prevents you from justifying and believing his call?\" Abu Jahal replied, \"The Quraysh girls will claim that I am a follower of the Abu albatross, though I am of the highest rank. For Al-Lata da Al-Uzza, I will not be his follower forever.\" Then come down to this verse. Further, in this verse God describes the condition of the infidels of Mecca who are drowned in evil deeds. Everything they do is caused by the impulse of their passions for being seduced by the devil's deception. There are no more values of truth that underlie their behavior and actions. What is good in their desires is what they do. It's as if they consider their passions as gods that they should obey. They have forgotten that their presence in this mortal world has purpose and purpose. There is a mission that they must carry out as the caliph of God on earth. They have abandoned the position that God has given them as the most beautiful being of God and have the best ability. They do not realize that they must account for all their acts to God in the future and that God will reward every act with a just recompense. This is what the word of God says: Then whoever does good is heavy, he will see it, and whoever does evil, he will see. (az-Zalzalah \/ 99: 7-8) In fact, the lust of man is a priceless gift that God bestows on man. Besides, God gives man intellect and religion so that both men can control their passions. If a person controls his passions in accordance with sound reasoning and does not go against religious guidance, then such person has acted in accordance with his nature. But when a person obeys his lust without sound judgment and no longer adheres to religious demands, he is enslaved by his lust. It means that he has deviated from his nature and fallen into error. According to the above information, in following their desires, humans are divided into two groups. The first group is the group that can control their passions; they are the ones who are responsible. While the second group is the one who is controlled by his passions. They are the ones who are sinful and always wander into the mud of evil. Ibn 'Abbas said, \"Whenever Allah mentions lust in the Qur'an, every time He blames it.\" Allah says: And if We desire that We raise it (degrees), but he tends to the world and obeys his (low) desire, then his imagery is like a dog, if you drive it out its tongue and if you let it stick out his tongue (too). Such is the parable of those who deny Our Signs. Then tell those stories to make them think. (al-A'raf \/ 7: 176) In another verse: And follow not the lust, for it will lead thee astray from the way of Allah. (shad \/ 38: 26) In this verse, God praises those who can control their desires and promise them a happy return. Allah says: And as for those who fear the greatness of their Lord and refrain from their lust, then indeed, it is their dwelling-place. (an-Nazi'at \/ 79: 40-41) Many of the hadiths of the Prophet (saws) criticize those who follow their passions. 'Abdullah bin' Amr bin 'As is narrated that the Prophet saw said. Do not believe in any one of you until his passions are in submission to what I bring. (Al-Khathib al-Bagdadi) Syaddad bin Aus narrates the hadith of the Prophet (peace be upon him): ‡) Wise men are the ones who control their passions and do for the sake of the afterlife. But the wrongdoer is the one who has his desires and hopes for something impossible from God. (History of at-Tirmidhi and Ibn Majah) People who always follow their breath usually lose control of themselves. That is why he falls into error because he does not heed the instruction given to him, and as a result of the evil deeds that he has committed in following his desires. Those who obey their passions are like those who are locked away from their hearts so that they can no longer judge the good and the bad, and like the one whose ears are blocked so that they can no longer look for the signs of God's power in heaven and on earth, and even as the eyes of one who is blind cannot see and know the truth of the Creator. Furthermore, God instructed His Messenger not to justify the attitude of the disbelievers of Mecca by saying that no power would guide them other than Allah after they had strayed from the straight path. At the end of this verse, Allah reminds them why they have not learned the lessons of the universe, their own events, and the torment that has afflicted the ancient people as proof that Almighty God is worthy of worship.",
      "text_tafsir": "Muqatil mengatakan bahwa ayat ini turun berhubungan dengan peristiwa percakapan Abu Jahal dengan al-Walid bin al-Mugirah. Pada suatu malam Abu Jahal tawaf di Baitullah bersama Walid. Kedua orang itu membicarakan keadaan Nabi Muhammad. Abu Jahal berkata, \"Demi Allah, sebenarnya aku tahu bahwa Muhammad itu adalah orang yang benar. \"Al-Walid berkata kepadanya, \"Biarkan saja, apa pedulimu dan apa alasan pendapatmu itu?\" Abu Jahal menjawab, \"Hai Abu Abdisy Syams, kita telah menamainya orang yang benar, jujur, dan terpercaya dimasa mudanya, tetapi sesudah ia dewasa dan sempurna akalnya, kita menamakannya pendusta lagi pengkhianat. Demi Allah, sebenarnya aku tahu bahwa dia itu adalah benar.\" Al-Walid berkata, \"Apakah gerangan yang menghalangimu untuk membenarkan dan mempercayai seruannya?\" Abu Jahal menjawab, \"Nanti gadis-gadis Quraisy akan menggunjingkan bahwa aku pengikut anak yatim Abu thalib, padahal aku dari suku yang paling tinggi. Demi Al-Lata da Al-Uzza, saya tidak akan menjadi pengikutnya selama-lamanya.\" Kemudian turunlah ayat ini.\n\nSelanjutnya, pada ayat ini Allah menerangkan keadaan orang-orang kafir Mekah yang sedang tenggelam dalam perbuatan jahat. Semua yang mereka lakukan itu disebabkan oleh dorongan hawa nafsunya karena telah tergoda oleh tipu daya setan. Tidak ada lagi nilai-nilai kebenaran yang mendasari tingkah laku dan perbuatan mereka. Apa yang baik menurut hawa nafsu mereka itulah yang mereka perbuat. Seakan-akan mereka menganggap hawa nafsu mereka itu sebagai tuhan yang harus mereka ikuti perintahnya.\n\nMereka telah lupa bahwa kehadiran mereka di dunia yang fana ini ada maksud dan tujuannya. Ada misi yang harus mereka bawa yaitu sebagai khalifah Allah di muka bumi. Mereka telah menyia-nyiakan kedudukan yang diberikan Allah kepada mereka sebagai makhluk Tuhan yang paling baik bentuknya dan mempunyai kemampuan yang paling baik pula. Mereka tidak menyadari bahwa mereka harus mempertanggungjawabkan semua perbuatannya kepada Allah kelak dan bahwa Allah akan membalas setiap perbuatan dengan balasan yang setimpal. Inilah yang dimaksud dengan firman Allah:\n\nMaka barang siapa mengerjakan kebaikan seberat zarrah, niscaya dia akan melihat (balasan)nya, dan barang siapa mengerjakan kejahatan seberat zarrah, niscaya dia akan melihat (balasan)nya. (az-Zalzalah\/99: 7-8)\n\nSebenarnya hawa nafsu yang ada pada manusia itu merupakan anugerah yang tidak ternilai harganya yang diberikan Allah kepada manusia. Di samping Allah memberikan akal dan agama kepada manusia agar dengan keduanya manusia dapat mengendalikan hawa nafsunya. Jika seseorang mengendalikan hawa nafsunya sesuai dengan pertimbangan akal yang sehat dan tidak bertentangan dengan tuntunan agama, maka orang yang demikian itu telah berbuat sesuai dengan fitrahnya. Tetapi apabila seseorang memperturutkan hawa nafsunya tanpa pertimbangan akal yang sehat dan tidak lagi berpedoman kepada tuntutan agama, maka orang itu telah diperbudak oleh hawa nafsunya. Hal itu berarti bahwa ia telah berbuat menyimpang dari fitrahnya dan terjerumus dalam kesesatan.\n\nBerdasarkan keterangan di atas, maka dalam mengikuti hawa nafsunya, manusia terbagi atas dua kelompok. Kelompok pertama ialah kelompok yang dapat mengendalikan hawa nafsunya; mereka itulah orang yang bertakwa. Sedangkan kelompok kedua ialah orang yang dikuasai hawa nafsunya. Mereka itulah orang-orang yang berdosa dan selalu bergelimang dalam lumpur kejahatan.\n\nIbnu 'Abbas berkata, \"Setiap kali Allah menyebut hawa nafsu dalam Al-Qur'an, setiap kali itu pula Ia mencelanya.\" Allah berfirman:\n\nDan sekiranya Kami menghendaki niscaya Kami tinggikan (derajat)nya dengan (ayat-ayat) itu, tetapi dia cenderung kepada dunia dan mengikuti keinginannya (yang rendah), maka perumpamaannya seperti anjing, jika kamu menghalaunya dijulurkan lidahnya dan jika kamu membiarkannya dia menjulurkan lidahnya (juga). Demikianlah perumpamaan orang-orang yang mendustakan ayat-ayat Kami. Maka ceritakanlah kisah-kisah itu agar mereka berpikir. (al-A'raf\/7: 176)\n\nPada ayat lain :\n\nDan janganlah engkau mengikuti hawa nafsu, karena akan menyesatkan engkau dari jalan Allah. (shad\/38: 26)\n\nDalam ayat ini, Allah memuji orang-orang yang dapat menguasai hawa nafsunya dan menjanjikan baginya tempat kembali yang penuh kenikmatan. Allah berfirman:\n\nDan adapun orang-orang yang takut kepada kebesaran Tuhannya dan menahan diri dari (keinginan) hawa nafsunya, maka sungguh, surgalah tempat tinggal(nya). (an-Nazi'at\/79: 40-41)\n\nBanyak hadis-hadis Nabi saw yang mencela orang-orang yang memperturutkan hawa nafsunya. Diriwayatkan oleh 'Abdullah bin 'Amr bin 'As bahwa Nabi saw berkata.\n\nTidak beriman seseorang dari antara kamu sehingga hawa nafsunya itu tunduk kepada apa yang saya bawa (petunjuk).(Riwayat al-Khathib al-Bagdadi)\n\nSyaddad bin Aus meriwayatkan hadis dari Nabi saw :\n\n‡)\n\nOrang yang cerdik ialah orang yang menguasai hawa nafsunya dan berbuat untuk kepentingan masa sesudah mati. Tetapi orang yang zalim ialah orang yang memperturutkan hawa nafsunya dan mengharap-harap sesuatu yang mustahil dari Allah. (Riwayat at-Tirmidhi dan Ibnu Majah)\n\nOrang yang selalu memperturutkan hawa nafusnya biasanya kehilangan kontrol dirinya. Itulah sebabnya ia terjerumus dalam kesesatan karena ia tidak mau memperhatikan petunjuk yang diberikan kepadanya, dan akibat perbuatan jahat yang telah dilakukannya karena memperturutkan hawa nafsu.\n\nKeadaan orang yang memperturutkan hawa nafsunya itu diibaratkan seperti orang yang terkunci mati hatinya sehingga tidak mampu lagi menilai mana yang baik mana yang buruk, dan seperti orang yang telinganya tersumbat sehingga tidak mampu lagi memperhatikan tanda-tanda kekuasaan Allah yang terdapat di langit dan di bumi, dan seperti orang yang matanya tertutup tidak dapat melihat dan mengetahui kebenaran adanya Allah Yang Maha Pencipta segala sesuatu.\n\nSelanjutnya, Allah memerintahkan kepada Rasul-Nya agar tidak membenarkan sikap orang-orang kafir Mekah dengan mengatakan bahwa tidak ada kekuasaan yang akan memberikan petunjuk selain Allah setelah mereka tersesat dari jalan yang lurus. \n\nPada akhir ayat ini, Allah mengingatkan mereka mengapa mereka tidak mengambil pelajaran dari alam semesta, kejadian pada diri mereka sendiri, dan azab yang menimpa umat-umat terdahulu sebagai bukti bahwa Allah Mahakuasa lagi berhak disembah.",
      "text_translation": "Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya dan Allah membiarkannya sesat dengan sepengetahuan-Nya, dan Allah telah mengunci pendengaran dan hatinya serta meletakkan tutup atas penglihatannya? Maka siapa yang mampu memberinya petunjuk setelah Allah (membiarkannya sesat?) Mengapa kamu tidak mengambil pelajaran?",
      "text": "اَفَرَءَيْتَ مَنِ اتَّخَذَ اِلٰهَهٗ هَوٰىهُ وَاَضَلَّهُ اللّٰهُ عَلٰى عِلْمٍ وَّخَتَمَ عَلٰى سَمْعِهٖ وَقَلْبِهٖ وَجَعَلَ عَلٰى بَصَرِهٖ غِشٰوَةًۗ فَمَنْ يَّهْدِيْهِ مِنْۢ بَعْدِ اللّٰهِ ۗ اَفَلَا تَذَكَّرُوْنَ",
      "text_translation_en": "HAST THOU ever considered [the kind of man] who makes his own desires his deity, and whom God has [thereupon] let go astray, knowing [that his mind is closed to all guidance], and whose hearing and heart He has sealed, and upon whose sight He has placed a veil? Who, then, could guide him after God [has abandoned him]? Will you not, then, bethink your­selves?",
      "juz_number": 25
    },
    "24": {
      "text_tafsir_en": "In this verse Allah explains the disobedience of the Muslims to the Day of Resurrection. They think life is only in the world. In the world they are born and in the world they are extinguished and that is the end of all things, and so it is with their ancestors. According to them, the cause of death and the destruction of all things is a change of time. From their point of view, it is possible to conclude that they have denied the day of resurrection. The evidence was reinforced by the custom of the Arabs of ignorance that when they were in danger or disaster, the words were thrown out of their mouths, \"Woe unto you!\" They curse time because they think it is the source of all evil. In the Qudsi hadith of Abu Hurairah, the Messenger of Allah (may peace be upon him) said: Allah says, \"Humans have hurt me by saying good-bye. if I wanted to, I would hold both. \" (Muslim History) Then Allah forgave the attitude of the Meccanic Muslims who were not based on true knowledge. Allah declares that they have absolutely no knowledge of the things pertaining to that time. Their opinions are based solely on assumptions and assumptions.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan keingkaran orang-orang musyrik terhadap hari kebangkitan. Menurut anggapan mereka kehidupan itu hanya di dunia saja. Di dunia mereka dilahirkan dan di dunia pula mereka dimatikan dan di situlah akhir dari segala sesuatu, dan demikian pula terjadi pada nenek moyang mereka. Menurut mereka, yang menyebabkan kematian dan kebinasaan segala sesuatu ialah pertukaran masa. Dari pendapat mereka, dapat diambil kesimpulan bahwa mereka mengingkari terjadinya hari kebangkitan.\n\nKeterangan itu diperkuat oleh adat kebiasaan orang Arab Jahiliah yaitu apabila mereka ditimpa bencana atau musibah, terlontarlah kata-kata dari mulut mereka, \"Aduhai celakalah masa.\" Mereka mengumpat-umpat masa karena menurut mereka masa itulah sumber dari segala musibah.\n\nDalam hadis Qudsi dari Abu Hurairah, Rasulullah bersabda:\n\nAllah berfirman, \"Manusia telah menyakitiku dengan mengatakan wahai masa yang sial. Maka janganlah salah seorang kalian mengatakan 'masa yang sial karena Akulah (Pencipta dan Pengatur)masa. Aku menanti malam menjadi siang, dan jika Aku menghendakinya niscaya Aku genggam keduanya.\" (Riwayat Muslim)\n\nKemudian Allah menyayangkan sikap kaum musyrikin Mekah yang tidak didasarkan pada pengetahuan yang benar. Allah menyatakan bahwa mereka sama sekali tidak mempunyai pengetahuan sedikit pun tentang hal yang menyangkut masa itu. Pendapat mereka itu hanyalah didasarkan pada sangkaan dan dugaan saja.",
      "text_translation": "Dan mereka berkata, “Kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup, dan tidak ada yang membinasakan kita selain masa.” Tetapi mereka tidak mempunyai ilmu tentang itu, mereka hanyalah menduga-duga saja.",
      "text": "وَقَالُوْا مَا هِيَ اِلَّا حَيَاتُنَا الدُّنْيَا نَمُوْتُ وَنَحْيَا وَمَا يُهْلِكُنَآ اِلَّا الدَّهْرُۚ وَمَا لَهُمْ بِذٰلِكَ مِنْ عِلْمٍۚ اِنْ هُمْ اِلَّا يَظُنُّوْنَ",
      "text_translation_en": "And yet they say: “There is nothing beyond our life in this world. We die as we come to life, and nothing but time destroys us.” But of this they have no knowledge whatever: they do nothing but guess.",
      "juz_number": 25
    },
    "25": {
      "text_tafsir_en": "In this verse, God explains and confirms that their opinions are entirely based on assumptions and assumptions, which lead to the denial of the day of resurrection. When they read the verses of Allah which contain evidence of the evidence of the Day of Resurrection, they would not understand the evidence presented, and they challenged the Messenger of Allah (may peace be upon him) to revive the dead. If this was possible by the Messenger of Allah, then they would believe. From their attitude, it can be concluded that they have been completely controlled by their passions, no longer using their minds properly so that they do not accept all the truths conveyed by the Messenger of Allah, that the day of resurrection will come at a time that is to be determined after all the living are extinguished and the universe and all its contents are destroyed. But that doesn't make them understand and admit it.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan dan menegaskan bahwa pendapat mereka itu benar-benar berdasarkan dugaan dan sangkaan belaka, yang menjurus kepada pengingkaran terjadinya hari kebangkitan. Apabila dibacakan kepada mereka ayat-ayat Allah yang mengandung keterangan tentang bukti-bukti terjadinya hari kebangkitan, mereka tidak mau memahami keterangan yang dikemukakan itu, dan juga mereka menantang Rasulullah saw agar beliau menghidupkan kembali orang-orang yang telah mati. Jika hal itu dapat dilakukan oleh Rasulullah, barulah mereka mau beriman.\n\nDari sikap mereka yang demikian itu, dapat diambil kesimpulan bahwa mereka benar-benar telah dikendalikan oleh hawa nafsu mereka, tidak lagi mempergunakan pikiran mereka dengan baik sehingga mereka tidak mau menerima segala kebenaran yang disampaikan oleh Rasulullah saw, bahwa hari kebangkitan itu akan datang pada saat yang telah ditentukan yaitu setelah semua manusia yang hidup dimatikan dan jagat raya serta segala isinya hancur-lebur. Namun hal ini tidak membuat mereka mengerti dan mengakui.",
      "text_translation": "Dan apabila kepada mereka dibacakan ayat-ayat Kami yang jelas, tidak ada bantahan mereka selain mengatakan, “Hidupkanlah kembali nenek moyang kami, jika kamu orang yang benar.”",
      "text": "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ مَّا كَانَ حُجَّتَهُمْ اِلَّآ اَنْ قَالُوا ائْتُوْا بِاٰبَاۤىِٕنَآ اِنْ كُنْتُمْ صٰدِقِيْنَ",
      "text_translation_en": "And [so,] whenever Our messages are conveyed to them in all their clarity, their only argument is this: “Bring forth our fore­fathers [as witnesses], if what you claim is true!”",
      "juz_number": 25
    },
    "26": {
      "text_tafsir_en": "In this verse Allah instructed His Messenger to explain to the Meccan polytheists, that Allah was in charge of reviving and killing His creatures. Before they did not exist and were inanimate objects, after that by the power of God they were made living things in the world for a specified period of time. When it reaches the specified time, they are turned off. Then they are resurrected on the Day of Judgment to account for all the deeds they have done while living in the world. God confirms that the occurrence of the Day of Judgment was a definite event, there is not the slightest doubt. If God has the power to turn on and off, of course He also has the power to revive and reassemble parts of their bodies that have been destroyed scattered into the ground. Repeating an action is easier than creating it for the first time. And for God, nothing is difficult. At the end of this verse, Allah regrets why most polytheists do not believe in the truth of the Day of Resurrection and continue to deny it on the grounds that people who have died, whose bodies have been smashed to the ground, their bones have been scattered are unlikely to come back to life. Allah says: And truly, (the day) the Hour will come, there is no doubt about it; and truly, Allah will raise up whoever is in the tomb. (al-hajj \/ 22: 7)",
      "text_tafsir": "Pada ayat ini Allah memerintahkan kepada Rasul-Nya agar menjelaskan kepada orang-orang musyrik Mekah, bahwa Allah-lah yang berkuasa menghidupkan dan mematikan makhluk-Nya. Dahulu mereka belum ada dan merupakan benda mati, sesudah itu atas kuasa Allah mereka dijadikan makhluk hidup di dunia untuk jangka waktu yang ditentukan. Apabila telah sampai waktu yang ditentukan itu, mereka pun dimatikan. Kemudian mereka dibangkitkan kembali pada hari Kiamat untuk mempertanggungjawabkan segala perbuatan yang telah mereka lakukan selama hidup di dunia.\n\nAllah menegaskan bahwa terjadinya hari Kiamat itu adalah suatu kejadian yang pasti, tidak ada keraguan sedikit pun. Jika Allah kuasa menghidupkan dan mematikan, tentu Dia kuasa pula menghidupkan dan menghimpun kembali bagian-bagian tubuh mereka yang telah hancur berserakan menjadi tanah. Mengulang kembali suatu perbuatan adalah lebih mudah daripada menciptakannya untuk pertama kali. Dan bagi Allah, tidak ada suatu perbuatan pun yang sukar.\n\nPada akhir ayat ini, Allah menyayangkan mengapa kebanyakan orang-orang musyrik tidak meyakini kebenaran adanya hari kebangkitan dan tetap mengingkarinya dengan alasan bahwa orang yang telah mati, yang tubuhnya telah hancur lebur bersama tanah, tulang-tulangnya telah berserakan tidak mungkin hidup kembali. Allah berfirman:\n\nDan sungguh, (hari) Kiamat itu pasti datang, tidak ada keraguan padanya; dan sungguh, Allah akan membangkitkan siapa pun yang di dalam kubur. (al-hajj\/22: 7)",
      "text_translation": "Katakanlah, “Allah yang menghidupkan kemudian mematikan kamu, setelah itu mengumpulkan kamu pada hari Kiamat yang tidak diragukan lagi; tetapi kebanyakan manusia tidak mengetahui.”",
      "text": "قُلِ اللّٰهُ يُحْيِيْكُمْ ثُمَّ يُمِيْتُكُمْ ثُمَّ يَجْمَعُكُمْ اِلٰى يَوْمِ الْقِيٰمَةِ لَارَيْبَ فِيْهِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ ࣖ",
      "text_translation_en": "Say: “It is God who gives you life, and then causes you to die; and in the end He will gather you together on Resurrection Day, [the coming of] which is beyond all doubt - but most human beings under­stand it not.”",
      "juz_number": 25
    },
    "27": {
      "text_tafsir_en": "God explains that he who has power in heaven and on earth is God. Nothing is beyond His power to do according to His will. There is no ruler other than Him and no other gods are worthy of worship except Him. His power covers the whole world; the world and the afterlife. God is also in power at the end of the world and the beginning of the hereafter. At that time man will be raised from the grave. All human beings will be dragged to the Fields to appear in court. At that time, their actions will be carefully examined. Every man will receive a record of his deeds during his life on earth, carefully crafted by the angels of charity. On that day, there appeared to be a despair of the unbelievers who denied the truth of God's verses. Depression turns into great pain and suffering as they are dragged to Hell, where they express their regret, but regret is no longer necessary.",
      "text_tafsir": "Allah menjelaskan bahwa yang memiliki kekuasaan di langit dan di bumi ialah Allah. Tidak ada yang melebihi kekuasaan-Nya yang berlaku sesuai dengan kehendak-Nya. Tidak ada penguasa yang lain selain Dia dan tidak ada tuhan-tuhan lain yang pantas disembah selain-Nya. Kekuasaan-Nya meliputi seluruh alam; alam dunia dan alam akhirat. Allah juga berkuasa pada saat alam dunia berakhir dan mulainya hari akhirat. Pada saat itu manusia akan dibangkitkan dari alam kubur. Semua manusia akan digiring ke Padang Mahsyar untuk menghadapi ke pengadilan. Pada saat itu, perbuatan mereka akan diperiksa secara teliti. Tiap-tiap orang akan menerima catatan perbuatannya selama ia hidup di dunia, yang dibuat secara teliti oleh para malaikat pencatat amal. Pada hari itulah, tampak kemurungan orang-orang kafir yang mendustakan kebenaran ayat-ayat Allah. Kemurungan itu berubah menjadi kesengsaraan dan penderitaan yang amat berat ketika mereka diseret ke neraka Jahanam, disanalah mereka menampakkan penyesalan mereka, tetapi penyesalan itu tidak berguna lagi.",
      "text_translation": "Dan milik Allah kerajaan langit dan bumi. Dan pada hari terjadinya Kiamat, akan rugilah pada hari itu orang-orang yang mengerjakan kebatilan (dosa).",
      "text": "وَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِۗ وَيَوْمَ تَقُوْمُ السَّاعَةُ يَوْمَىِٕذٍ يَّخْسَرُ الْمُبْطِلُوْنَ",
      "text_translation_en": "For, God’s is the dominion over the heavens and the earth; and on the Day when the Last Hour dawns - on that Day will be lost all who [in their lifetime] tried to reduce to nothing [whatever they could not understand].",
      "juz_number": 25
    },
    "28": {
      "text_tafsir_en": "In this verse, God describes the state of mankind on the day of decision and the horrors of chaos while waiting for decisive moments, namely: 1. On that day, men kneel and prostrate themselves before God the ruler of the whole world to receive the calculations of deeds of charity and accept the final decision that will be made on them. 2. On that day, they were called to see their records made by angels. Then they check whether some of their deeds are not recorded or some are recorded, but they do not correspond to what they were doing. If their acts are according to the religion of their apostles, they will find happiness and prosperity, but if they do not obey the commandments and many violate their religion, they will be in danger and torment in hell. Allah says: And the earth is bright with the light (justice) of its Lord; and books (calculations of their deeds) were given (to each other), prophets and witnesses were presented, and justice was decided between them, and they were not harmed. (az-Zumar \/ 39: 69) In another verse Allah says: And the book is written, then you will see the sinner in fear of what is written therein, and they will say, \"Woe to us! what is this book, nothing is left out, small and great but all written down, \"and they find (all) what they have done (in writing). And your Lord does not harm anyone. (al-Kahf \/ 18: 49) At that time, mankind received a call. They were told that on that day they would receive a reward from their deeds for a fair reward.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan keadaan manusia pada hari penentuan keputusan itu dan kedahsyatan huru-hara pada saat menunggu detik-detik yang menentukan, yaitu:\n\n1. Pada hari itu, manusia berlutut dan bersimpuh di hadapan Tuhan penguasa seluruh alam untuk menerima perhitungan amal perbuatan mereka dan menerima keputusan akhir yang akan ditetapkan atas mereka.\n\n2. Pada hari itu, mereka dipanggil melihat catatan mereka yang dibuat oleh para malaikat. Kemudian mereka memeriksa apakah ada di antara perbuatan mereka yang belum tercatat atau ada yang tercatat, tetapi tidak sesuai dengan yang telah mereka kerjakan. Apabila perbuatan mereka yang tercatat itu sesuai dengan yang diperintahkan oleh agama yang dibawa rasul mereka, maka mereka akan memperoleh kebahagiaan dan keberuntungan, sedangkan apabila tidak sesuai dengan perintah dan banyak melanggar larangan agama mereka, maka mereka akan memperoleh kecelakaan dan azab di neraka. Allah berfirman:\n\nDan bumi (Padang Mahsyar) menjadi terang benderang dengan cahaya (keadilan) Tuhannya; dan buku-buku (perhitungan perbuatan mereka) diberikan (kepada masing-masing), nabi-nabi dan saksi-saksi pun dihadirkan, lalu diberikan keputusan di antara mereka secara adil, sedang mereka tidak dirugikan. (az-Zumar\/39: 69)\n\nPada ayat lain Allah berfirman:\n\nDan diletakkanlah kitab (catatan amal), lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata, \"Betapa celaka kami, kitab apakah ini, tidak ada yang tertinggal, yang kecil dan yang besar melainkan tercatat semuanya,\" dan mereka dapati (semua) apa yang telah mereka kerjakan (tertulis). Dan Tuhanmu tidak menzalimi seorang jua pun. (al-Kahf\/18: 49)\n\nPada saat itu, manusia mendapat panggilan. Kepada mereka diberitahukan bahwa pada hari itulah mereka akan menerima balasan dari amal perbuatan mereka masing-masing dengan balasan yang setimpal.",
      "text_translation": "Dan (pada hari itu) engkau akan melihat setiap umat berlutut. Setiap umat dipanggil untuk (melihat) buku catatan amalnya. Pada hari itu kamu diberi balasan atas apa yang telah kamu kerjakan.",
      "text": "وَتَرٰى كُلَّ اُمَّةٍ جَاثِيَةً ۗ كُلُّ اُمَّةٍ تُدْعٰٓى اِلٰى كِتٰبِهَاۗ  اَلْيَوْمَ تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُوْنَ",
      "text_translation_en": "And [on that Day] thou wilt see all people kneeling down [in humility]: all people will be called upon to [face] their record: “Today you shall be requited for all that you ever did!",
      "juz_number": 25
    },
    "29": {
      "text_tafsir_en": "God declares His word to all mankind that the books that contain the record of the deeds of the deed are the true books, there is not a single mistake in them, made on the basis of the command of Almighty God, which is the basis of consideration for determining the decision for the people human. Allah also states that when the person lives in the world, the person who records good deeds, good deeds and bad deeds is mobilized. The record cannot be wrong because it was made with great accuracy as evidence that cannot be doubted",
      "text_tafsir": "Allah menyatakan firman-Nya kepada seluruh umat manusia bahwa kitab-kitab yang memuat catatan amal perbuatan itu adalah kitab yang benar, tidak ada suatu pun kesalahan terdapat di dalamnya, dibuat atas dasar perintah Allah Yang Mahakuasa, yang menjadi dasar pertimbangan untuk menentukan keputusan bagi umat manusia.\n\nAllah juga menyatakan bahwa pada saat orang itu hidup di dunia, telah dikerahkan para pencatat amal perbuatan, baik perbuatan yang baik maupun perbuatan yang buruk. Catatan itu tidak mungkin salah karena dibuat dengan ketelitian yang tinggi sebagai alat bukti yang tidak dapat diragukan kebenarannya",
      "text_translation": "(Allah berfirman), “Inilah Kitab (catatan) Kami yang menuturkan kepadamu dengan sebenar-benarnya. Sesungguhnya Kami telah menyuruh mencatat apa yang telah kamu kerjakan.”",
      "text": "هٰذَا كِتٰبُنَا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ ۗاِنَّا كُنَّا نَسْتَنْسِخُ مَا كُنْتُمْ تَعْمَلُوْنَ",
      "text_translation_en": "This Our record speaks of you in all truth: for, verily, We have caused to be recorded all that you ever did!”",
      "juz_number": 25
    },
    "30": {
      "text_tafsir_en": "Then Allah explained the condition of those who believe and do good deeds. They will receive a reward for their deeds. They belong to God's servants who receive His abundant grace. The meaning of God's grace in this verse is heaven. This is in accordance with the meaning of the hadith narrated by Abu Hurairah: ...) Indeed, Allah said to heaven, \"You are my mercy. With you I have bestowed My love on those whom I will.\" (The History of al-Bukhari and Muslim) At the end of this verse, Allah emphasizes that heaven is a happiness that believers will attain because of the abundant favor that their inhabitants will enjoy.",
      "text_tafsir": "Kemudian Allah menjelaskan keadaan orang-orang yang beriman dan yang melakukan amal saleh. Mereka itu akan mendapat balasan yang setimpal dengan amal perbuatannya. Mereka itu termasuk hamba Allah yang memperoleh limpahan rahmat-Nya.\n\nYang dimaksud dengan rahmat Allah dalam ayat ini adalah surga. Hal ini sesuai dengan maksud hadis yang diriwayatkan oleh Abu Hurairah:\n\n…)\n\nSesungguhnya Allah berkata kepada surga, \"Engkau adalah rahmat-Ku. Dengan kamu Aku melimpahkan Kasih sayang-Ku kepada orang-orang yang Aku kehendaki.\" (Riwayat al-Bukhari dan Muslim)\n\nPada bagian akhir ayat ini, Allah menegaskan bahwa surga itu merupakan kebahagiaan yang akan dicapai oleh orang-orang yang beriman karena nikmatnya yang berlimpah-limpah yang akan dirasakan penghuninya.",
      "text_translation": "Maka adapun orang-orang yang beriman dan mengerjakan kebajikan, maka Tuhan memasukkan mereka ke dalam rahmat-Nya (surga). Demikian itulah kemenangan yang nyata.",
      "text": "فَاَمَّا الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فَيُدْخِلُهُمْ رَبُّهُمْ  فِيْ رَحْمَتِهٖۗ ذٰلِكَ هُوَ الْفَوْزُ الْمُبِيْنُ",
      "text_translation_en": "Now as for those who have attained to faith and done righteous deeds, their Sustainer will admit them to His grace: that will be [their] manifest triumph!",
      "juz_number": 25
    },
    "31": {
      "text_tafsir_en": "In this verse Allah explains the situation of those who disobey His will. They always received ridicule and humiliation because they had been sent by the Messenger of Allah who had read His verses, but they were arrogant and stubborn. Therefore they will feel the torment of God being humiliated by the sin they have committed. At that moment, they were startled by the fact that they were lying.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan keadaan orang-orang yang mengingkari keesaan-Nya. Mereka itu selalu menerima cemoohan dan penghinaan karena kepada mereka telah didatangkan utusan Allah yang telah membacakan ayat-ayat-Nya, tetapi mereka bersikap sombong dan keras kepala.\n\nKarena itu mereka akan merasakan siksa Allah yang menghinakan disebabkan oleh perbuatan dosa yang telah mereka kerjakan. Pada saat itulah, mereka tergagap karena melihat kenyataan yang dahulu mereka dustakan.",
      "text_translation": "Dan adapun (kepada) orang-orang yang kafir (difirmankan), “Bukankah ayat-ayat-Ku telah dibacakan kepadamu tetapi kamu menyombongkan diri dan kamu menjadi orang-orang yang berbuat dosa?”",
      "text": "وَاَمَّا الَّذِيْنَ كَفَرُوْاۗ  اَفَلَمْ تَكُنْ اٰيٰتِيْ تُتْلٰى عَلَيْكُمْ فَاسْتَكْبَرْتُمْ وَكُنْتُمْ قَوْمًا مُّجْرِمِيْنَ",
      "text_translation_en": "But as for those who were bent on denying the truth, [they will be told:] “Were not My messages conveyed to you? And withal, you gloried in your arrogance, and so you became people lost in sin:",
      "juz_number": 25
    },
    "32": {
      "text_tafsir_en": "In this verse, God explains the regret of those who deny the resurrection. While still in the world, when they were told the news of the resurrection, they thought the news of the resurrection was strange and impossible. It is impossible for them to raise a dead man whose bones have been scattered and his whole body crushed to the ground. But later when they face reality and face terrible torment, they will regret their past acts and actions solely based on assumptions and prejudices, not on the knowledge and belief in the Almighty Allah.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan penyesalan orang-orang yang mengingkari terjadinya hari kebangkitan. Sewaktu masih di dunia, apabila disampaikan kepada mereka berita tentang terjadinya hari kebangkitan, mereka beranggapan bahwa berita hari kebangkitan itu adalah berita yang aneh dan mustahil. Bagi mereka mustahil membangkitkan orang yang telah mati yang tulang-tulangnya telah berserakan dan seluruh tubuhnya telah hancur menjadi tanah. Tetapi nanti setelah mereka menghadapi kenyataan dan berhadapan dengan siksa yang sangat mengerikan, barulah mereka menyesali sikap dan perbuatan mereka dahulu yang semata-mata didasarkan atas dugaan dan prasangka belaka, tidak berdasarkan ilmu pengetahuan dan kepercayaan kepada Allah Yang Maha Penguasa Semesta Alam.",
      "text_translation": "Dan apabila dikatakan (kepadamu), “Sungguh, janji Allah itu benar, dan hari Kiamat itu tidak diragukan adanya,” kamu menjawab, “Kami tidak tahu apakah hari Kiamat itu, kami hanyalah menduga-duga saja, dan kami tidak yakin.”",
      "text": "وَاِذَا قِيْلَ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّالسَّاعَةُ لَا رَيْبَ فِيْهَا قُلْتُمْ مَّا نَدْرِيْ مَا السَّاعَةُۙ اِنْ نَّظُنُّ اِلَّا ظَنًّا وَّمَا نَحْنُ بِمُسْتَيْقِنِيْنَ ",
      "text_translation_en": "for when it was said, ‘Behold, God’s promise always comes true, and there can be no doubt about [the coming of] the Last Hour’ - you would answer, ‘We do not know what that Last Hour may be: we think it is no more than an empty guess, and [so] we are by no means convinced!’”",
      "juz_number": 25
    },
    "33": {
      "text_tafsir_en": "Then Allah explained the state of the polytheists when their crime was clearly revealed. They stuttered to face such a great responsibility. They were afraid to see their piled-up sins which they had to ransom with the torment of hell they were so afraid of. They also realized at that moment that no one could defend them; their dominion in the world, abundant wealth, their children and grandchildren, friends in conspiracy, and so on all had no meaning at that time. The only choice they could make at that time was to wait for a decision and surrender to accept God's punishment.",
      "text_tafsir": "Kemudian Allah menjelaskan keadaan kaum musyrikin ketika kejahatan mereka telah terungkap dengan jelas. Mereka tergagap menghadapi tanggung jawab yang begitu besar. Mereka merasa takut melihat dosa mereka yang bertumpuk-tumpuk yang harus mereka tebus dengan siksaan neraka yang sangat mereka takuti. Mereka menyadari pula saat itu bahwa tidak ada seorang pun yang dapat membela mereka; kekuasaan mereka selama di dunia, harta benda yang melimpah ruah, anak cucu mereka, teman bersekongkol, dan sebagainya semuanya tidak ada artinya pada waktu itu. Satu-satunya pilihan yang dapat mereka ambil waktu itu hanyalah menunggu keputusan dan pasrah untuk menerima azab Allah.",
      "text_translation": "Dan nyatalah bagi mereka keburukan-keburukan yang mereka kerjakan, dan berlakulah (azab) terhadap mereka yang dahulu mereka perolok-olokkan.",
      "text": "وَبَدَا لَهُمْ سَيِّاٰتُ مَا عَمِلُوْا وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
      "text_translation_en": "And [on that Day,] the evil of their doings will become obvious to them, and they will be over­whelmed by the very thing which they were wont to deride.",
      "juz_number": 25
    },
    "34": {
      "text_tafsir_en": "In this verse, Allah explains the ridicule, humiliation and punishment that they endured on the Day of Judgment. On that day, God will not heed their screams and tears, their lamentations and regrets because all that they experienced was truly a retaliation that was balanced with their deeds in the former world. In the world they persecute and slander innocent people, justifying the unlawful for their personal and group interests; Allah will give a reward worthy of their deeds in the hereafter. If God is ignorant of them because of the arrogant and arrogant attitude they have done, and the inhuman attitude they have done. Then this attitude is a reasonable reward according to His justice.",
      "text_tafsir": "Pada ayat ini, Allah menjelaskan cemoohan, penghinaan dan azab yang mereka tanggungkan pada hari Kiamat itu. Pada hari itu, Allah tidak akan menghiraukan jerit dan tangis mereka, ratapan dan penyesalan mereka karena semua yang mereka alami itu benar-benar sebagai pembalasan yang seimbang dengan perbuatan mereka di dunia dahulu.\n\nDi dunia mereka menganiaya dan memfitnah orang yang tidak bersalah, menghalalkan yang haram untuk kepentingan pribadi dan kelompok mereka; Allah akan memberikan balasan yang setimpal dengan amal mereka semua di akhirat nanti.\n\nJika Allah bersikap tidak mengacuhkan mereka karena sikap angkuh dan sombong yang telah mereka lakukan, serta sikap yang tidak berperikemanusiaan yang telah mereka lakukan. Maka sikap yang demikian itu adalah balasan yang wajar sesuai dengan keadilan-Nya.",
      "text_translation": "Dan kepada mereka dikatakan, “Pada hari ini Kami melupakan kamu sebagaimana kamu telah melupakan pertemuan (dengan) harimu ini; dan tempat kembalimu ialah neraka dan se-kali-kali tidak akan ada penolong bagimu.",
      "text": "وَقِيْلَ الْيَوْمَ نَنْسٰىكُمْ كَمَا نَسِيْتُمْ لِقَاۤءَ يَوْمِكُمْ هٰذَاۙ وَمَأْوٰىكُمُ النَّارُ وَمَا لَكُمْ مِّنْ نّٰصِرِيْنَ",
      "text_translation_en": "And [the word] will be spoken: “Today We shall be oblivious of you as you were oblivious of the coming of this your Day [of Judgment]; and so your goal is the fire, and you shall have none to succour you:",
      "juz_number": 25
    },
    "35": {
      "text_tafsir_en": "In this verse Allah explains why the unbelievers should suffer such terrible torture and punishment, which is why: 1. Because they lived in the world, they mocked the verses of Allah that were delivered to them through His Messenger. This attitude is considered an attitude of arrogance and arrogance. They also want to eradicate the faith that has permeated the hearts of Muslims in various ways and ways. 2. They have been deceived by the pleasures of living in the world, so that they forget the afterlife which is the end goal of human life. That is why when Allah makes His decision, it is impossible for them to escape the torment and there is no forgiveness for them.",
      "text_tafsir": "Pada ayat ini Allah menjelaskan mengapa orang-orang kafir itu harus menerima siksaan dan azab yang mengerikan itu, sebabnya ialah:\n\n1. Karena waktu mereka hidup di dunia, mereka memperolok-olok ayat-ayat Allah yang disampaikan kepada mereka melalui Rasul-Nya. Sikap ini dianggap sebagai sikap yang penuh keangkuhan dan kesombongan. Mereka juga ingin mendangkalkan iman yang telah meresap dalam dada kaum Muslimin dengan berbagai macam dalih dan cara.\n\n2. Mereka telah tertipu oleh kenikmatan hidup di dunia, sehingga mereka melupakan kehidupan akhirat yang menjadi tujuan akhir kehidupan manusia.\n\nItulah sebabnya ketika Allah menjatuhkan keputusan-Nya, tidak ada kemungkinan bagi mereka untuk melepaskan diri dari azab dan tidak ada lagi ampunan bagi mereka.",
      "text_translation": "Yang demikian itu, karena sesungguhnya kamu telah menjadikan ayat-ayat Allah sebagai olok-olokan dan kamu telah ditipu oleh kehidupan dunia.” Maka pada hari ini mereka tidak dikeluarkan dari neraka dan tidak pula mereka diberi kesempatan untuk bertobat.",
      "text": "ذٰلِكُمْ بِاَنَّكُمُ اتَّخَذْتُمْ اٰيٰتِ اللّٰهِ هُزُوًا وَّغَرَّتْكُمُ الْحَيٰوةُ الدُّنْيَا ۚفَالْيَوْمَ لَا يُخْرَجُوْنَ مِنْهَا وَلَا هُمْ يُسْتَعْتَبُوْنَ",
      "text_translation_en": "this, because you made God’s messages the target of your mockery, having allowed the life of this world to beguile you!” On that Day, therefore, they will not be brought out of the fire, nor will they be allowed to make amends.",
      "juz_number": 25
    },
    "36": {
      "text_tafsir_en": "These two verses are the closing verse of Surah al-Jatsiyah. In these verses God mentions some of His attributes related to the principles of decision making on the Day of Judgment, namely: 1. He is most praised, for which He is the praise of all. This expression gives us the sense that all the good that man has gained while living in the world comes from God so that man can fulfill his duty as His caliph on earth, not to act arbitrarily and to covet. If a person does not appreciate that favor and does not use it properly, then that person will receive his wrath and punishment. 2. Almighty God, He rules the universe. This word gives the sense that everything in heaven and on earth is in His power. He rules the world and the afterlife. 3. He is the Great, because the glory and the arrogance are only to God in heaven and on earth and His power is over all. 4. He is the Almighty, his decisions are irrevocable, irrevocable to anyone, and nothing can match his power. 5. He is Wise. Meaning: God in His command to all His creatures, always with rules, calculations, and successes and certainty, is exactly what He wants.",
      "text_tafsir": "Kedua ayat ini merupakan ayat penutup Surah al-Jatsiyah. Dalam ayat-ayat ini Allah menyebutkan beberapa sifat-Nya yang ada hubungannya dengan dasar-dasar pengambilan keputusan di hari Kiamat nanti, yaitu:\n\n1. Dia Maha Terpuji, karena itu bagi-Nyalah segala puji. Ungkapan ini memberikan pengertian bahwa segala nikmat apa pun yang diperoleh manusia selama hidup di dunia berasal dari Allah agar manusia dapat melaksanakan tugasnya sebagai khalifah-Nya di bumi, bukan untuk berbuat sewenang-wenang dan memperturutkan hawa nafsu. Jika manusia tidak mensyukuri nikmat itu dan tidak mempergunakan nikmat itu menurut yang semestinya, tentulah orang itu akan mendapat murka dan azab-Nya.\n\n2. Allah Mahakuasa, Dia menguasai semesta alam. Perkataan ini memberikan pengertian bahwa segala sesuatu yang ada di langit dan di bumi berada dalam kekuasaan-Nya. Dia menguasai dunia dan akhirat.\n\n3. Dia Mahaagung, karena keagungan dan keangkuhan hanya bagi Allah di langit dan di bumi dan kekuasaan-Nya berada di atas segala kekuasaan.\n\n4. Dia Mahaperkasa, keputusan-Nya tidak dapat ditolak, tidak dapat diubah oleh siapa pun, dan tidak ada yang dapat menandingi kekuasaan-Nya itu.\n\n5. Dia Mahabijaksana. Maksudnya: Allah dalam menetapkan perintah-Nya kepada seluruh makhluk-Nya, selalu disertai aturan, perhitungan, dan berhasil serta pasti, terjadi sesuai dengan yang dikehendaki-Nya.",
      "text_translation": "Segala puji hanya bagi Allah, Tuhan (pemilik) langit dan bumi, Tuhan seluruh alam.",
      "text": "فَلِلّٰهِ الْحَمْدُ رَبِّ السَّمٰوٰتِ وَرَبِّ الْاَرْضِ رَبِّ الْعٰلَمِيْنَ",
      "text_translation_en": "AND THUS, all praise is due to God, Sustainer of the heavens and Sustainer of the earth: the Sustainer of all the worlds!",
      "juz_number": 25
    },
    "37": {
      "text_tafsir_en": "These two verses are the closing verse of Surah al-Jatsiyah. In these verses God mentions some of His attributes related to the principles of decision making on the Day of Judgment, namely: 1. He is most praised, for which He is the praise of all. This expression gives us the sense that all the good that man has gained while living in the world comes from God so that man can fulfill his duty as His caliph on earth, not to act arbitrarily and to covet. If a person does not appreciate that favor and does not use it properly, then that person will receive his wrath and punishment. 2. Almighty God, He rules the universe. This word gives the sense that everything in heaven and on earth is in His power. He rules the world and the afterlife. 3. He is the Great, because the glory and the arrogance are only to God in heaven and on earth and His power is over all. 4. He is the Almighty, his decisions are irrevocable, irrevocable to anyone, and nothing can match his power. 5. He is Wise. Meaning: God in His command to all His creatures, always with rules, calculations, and successes and certainty, is exactly what He wants.",
      "text_tafsir": "Kedua ayat ini merupakan ayat penutup Surah al-Jatsiyah. Dalam ayat-ayat ini Allah menyebutkan beberapa sifat-Nya yang ada hubungannya dengan dasar-dasar pengambilan keputusan di hari Kiamat nanti, yaitu:\n\n1. Dia Maha Terpuji, karena itu bagi-Nyalah segala puji. Ungkapan ini memberikan pengertian bahwa segala nikmat apa pun yang diperoleh manusia selama hidup di dunia berasal dari Allah agar manusia dapat melaksanakan tugasnya sebagai khalifah-Nya di bumi, bukan untuk berbuat sewenang-wenang dan memperturutkan hawa nafsu. Jika manusia tidak mensyukuri nikmat itu dan tidak mempergunakan nikmat itu menurut yang semestinya, tentulah orang itu akan mendapat murka dan azab-Nya.\n\n2. Allah Mahakuasa, Dia menguasai semesta alam. Perkataan ini memberikan pengertian bahwa segala sesuatu yang ada di langit dan di bumi berada dalam kekuasaan-Nya. Dia menguasai dunia dan akhirat.\n\n3. Dia Mahaagung, karena keagungan dan keangkuhan hanya bagi Allah di langit dan di bumi dan kekuasaan-Nya berada di atas segala kekuasaan.\n\n4. Dia Mahaperkasa, keputusan-Nya tidak dapat ditolak, tidak dapat diubah oleh siapa pun, dan tidak ada yang dapat menandingi kekuasaan-Nya itu.\n\n5. Dia Mahabijaksana. Maksudnya: Allah dalam menetapkan perintah-Nya kepada seluruh makhluk-Nya, selalu disertai aturan, perhitungan, dan berhasil serta pasti, terjadi sesuai dengan yang dikehendaki-Nya.",
      "text_translation": "Dan hanya bagi-Nya segala keagungan di langit dan di bumi, dan Dialah Yang Mahaperkasa, Mahabijaksana.",
      "text": "وَلَهُ الْكِبْرِيَاۤءُ فِى السَّمٰوٰتِ وَالْاَرْضِ ۗوَهُوَ الْعَزِيْزُ الْحَكِيْمُ ࣖ   ۔",
      "text_translation_en": "And His alone is all majesty in the heavens and on earth; and He alone is almighty, truly wise!",
      "juz_number": 25
    }
  },
  "name": "الجاثية",
  "name_translation_en": "Crouching",
  "name_translation": "Berlutut",
  "name_latin": "Al-Jasiyah"
}