{
  "number": 47,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 38,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, God divides mankind into two groups: first, the disbelievers, those who disobey God's power and authority, worship other gods besides Him, obstruct human worship of Him, devise ways of worshiping, He according to his own opinions and desires, denounces and prevents mankind from believing in Allah and the Prophet Muhammad. All of these acts do not follow the instructions of Allah contained in the Qur'an and the hadith of His Messenger, but follow their own will and follow the guidance of Satan. All actions that are based on evil deeds have no meaning in the eyes of God even though they are good for humanity and humanity. It acts as a foam that rises to the surface of the water, and then disappears without a trace. Therefore, all deeds and deeds performed by the Muslims have no meaning and reward with Allah in the hereafter. They only receive the reward in the world of human beings, even though such acts and deeds are of noble character, in relation to others (caring), feeding the poor, caring for orphans, making humanitarian efforts, maintaining and erecting mosques . This kind of work is a work that has been done by the Meccan monks, such as prospering the Mosque, protecting those in need of protection, helping the people who perform thawaf and so on. Allah says: And We will show them what they do, and We will make it like the dust that flutters. (al-Furqan \/ 25: 23) Secondly, believers, those who acknowledge the oneness of God, obey only Him, worship according to Allah's guidance, not according to their own will and avoid His prohibition, The Qur'an that Muhammad carried, and helped the people perform their worship of Him. These are the people God loves. Charity and the acts of the believers are acceptable to God, forgiven of all their sins, they are rewarded in the world while in the hereafter they will have eternal happiness. According to Ibn 'Abbas, the first verse was revealed in reference to the people who fed the Meccan army during the Badr War. They had twelve men, namely Abu Jahal, al-harits bin Hisham, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Ubay bin Khalaf, Umayyah bin Khalaf, Munabbih bin al-hajjaj, Nubaih bin al-hajjaj, Abu al-Bukhturi bin Hisham, Zam'ah bin al-Aswad, judge bin hazam, and al-harits bin 'Amir bin Naufal. They all had good deeds in the Arabian period of ignorance, such as providing pilgrims drinks, feeding the guests who came to the Mosque, protecting and protecting the rights of neighbors, and so on. All their deeds were revoked by Allah, as if they had never done anything, because the basis of their receiving a charity and their actions was faith in Allah and the Prophet Muhammad. While the second verse was revealed in connection with the Ansar people in Medinah. They believed in Allah and the Prophet Muhammad, helped the newly arrived Muslims from Mecca to travel with Prophet Muhammad, and obeyed the command and abstained from Allah.",
      "text_tafsir": "Dalam ayat ini, Allah membagi manusia menjadi dua golongan: pertama, golongan kafir, yaitu orang-orang yang mengingkari kekuasaan dan keesaan Allah, menyembah tuhan-tuhan yang lain selain Dia, menghalangi manusia beribadah kepada-Nya, membuat-buat cara beribadah kepada-Nya menurut pendapat dan keinginan sendiri, mencela dan menghalangi manusia beriman kepada Allah dan kepada Nabi Muhammad. Seluruh perbuatan golongan ini tidak mengikuti petunjuk-petunjuk Allah yang termuat di dalam Al-Qur'an dan hadis Rasul-Nya, tetapi mengikuti keinginan sendiri dan mengikuti petunjuk setan. \n\nSemua perbuatan yang berdasarkan perbuatan setan tidak ada artinya di sisi Allah walaupun perbuatan itu baik bagi manusia dan kemanusiaan. Perbuatan itu seolah-olah buih yang timbul di permukaan air, kemudian hilang tanpa bekas sedikit pun. Oleh karena itu, semua amal dan perbuatan yang dikerjakan oleh orang-orang musyrik tidak ada arti dan pahalanya di sisi Allah di akhirat nanti. Mereka hanya mendapat balasan di dunia yang diperoleh dari manusia, walaupun bentuk amal dan perbuatan itu seperti budi pekerti yang mulia, berhubungan dengan orang lain (silaturrahim), memberi makan orang miskin, memelihara anak yatim, membuat usaha-usaha kemanusiaan, memelihara dan mendirikan masjid. \n\nPekerjaan seperti ini adalah pekerjaan yang pernah dikerjakan oleh orang-orang musyrik Mekah, seperti memakmurkan Masjidilharam, melindungi orang-orang yang memerlukan perlindungan, membantu orang-orang yang mengerjakan thawaf dan sebagainya.\n\nAllah berfirman:\n\nDan Kami akan perlihatkan segala amal yang mereka kerjakan, lalu Kami akan jadikan amal itu (bagaikan) debu yang beterbangan. (al-Furqan\/25: 23)\n\nKedua, golongan mukmin, yaitu orang-orang yang mengakui keesaan Allah, taat hanya kepada-Nya saja, beribadah sesuai dengan petunjuk Allah, tidak menurut kemauan sendiri dan menjauhi larangan-Nya, beriman kepada Al-Qur'an yang dibawa Nabi Muhammad, dan membantu manusia melaksanakan ibadah kepada-Nya. Ini adalah golongan yang diridai Allah. Amal dan perbuatan golongan mukmin diterima Allah, diampuni segala dosanya, mereka mendapat pahala di dunia sedang di akhirat akan mendapat kebahagiaan yang abadi.\n\nMenurut Ibnu 'Abbas, ayat pertama diturunkan berhubungan dengan orang-orang yang memberi makan tentara musyrik Mekah pada waktu Perang Badar. Mereka ada dua belas orang, yaitu Abu Jahal, al-harits bin Hisyam, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Ubay bin Khalaf, Umayyah bin Khalaf, Munabbih bin al-hajjaj, Nubaih bin al-hajjaj, Abu al-Bukhturi bin Hisyam, Zam'ah bin al-Aswad, hakim bin hazam, dan al-harits bin 'Amir bin Naufal. Mereka semua mempunyai amal kebajikan pada masa Arab Jahiliah, seperti menyediakan minuman jemaah haji, memberi makan para tamu yang datang ke Masjidilharam, melindungi dan menjaga hak tetangga, dan sebagainya. Semua amal mereka dibatalkan pahalanya oleh Allah, seakan-akan mereka tidak pernah berbuat apa pun, karena dasar diterimanya suatu amal dan perbuatan adalah iman kepada Allah dan Nabi Muhammad. \n\nSedangkan ayat kedua diturunkan berhubungan dengan orang Ansar di Medinah. Mereka beriman kepada Allah dan Nabi Muhammad, membantu orang-orang Muhajirin yang baru datang dari Mekah hijrah bersama Nabi Muhammad, dan mengikuti perintah dan menjauhi larangan Allah.",
      "text_translation": "Orang-orang yang kafir dan menghalang-halangi (manusia) dari jalan Allah, Allah menghapus segala amal mereka.",
      "text": "اَلَّذِيْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ اَضَلَّ اَعْمَالَهُمْ ",
      "text_translation_en": "AS FOR THOSE who are bent on denying the truth and on barring [others] from the path of God - all their [good] deeds will He let go to waste;",
      "juz_number": 26
    },
    "2": {
      "text_tafsir_en": "In this verse, God divides mankind into two groups: first, the disbelievers, those who disobey God's power and authority, worship other gods besides Him, obstruct human worship of Him, devise ways of worshiping, He according to his own opinions and desires, denounces and prevents mankind from believing in Allah and the Prophet Muhammad. All of these acts do not follow the instructions of Allah contained in the Qur'an and the hadith of His Messenger, but follow their own will and follow the guidance of Satan. All actions that are based on evil deeds have no meaning in the eyes of God even though they are good for humanity and humanity. It acts as a foam that rises to the surface of the water, and then disappears without a trace. Therefore, all deeds and deeds performed by the Muslims have no meaning and reward with Allah in the hereafter. They only receive the reward in the world of human beings, even though such acts and deeds are of noble character, in relation to others (caring), feeding the poor, caring for orphans, making humanitarian efforts, maintaining and erecting mosques . This kind of work is a work that has been done by the Meccan monks, such as prospering the Mosque, protecting those in need of protection, helping the people who perform thawaf and so on. Allah says: And We will show them what they do, and We will make it like the dust that flutters. (al-Furqan \/ 25: 23) Secondly, believers, those who acknowledge the oneness of God, obey only Him, worship according to Allah's guidance, not according to their own will and avoid His prohibition, The Qur'an that Muhammad carried, and helped the people perform their worship of Him. These are the people God loves. Charity and the acts of the believers are acceptable to God, forgiven of all their sins, they are rewarded in the world while in the hereafter they will have eternal happiness. According to Ibn 'Abbas, the first verse was revealed in reference to the people who fed the Meccan army during the Badr War. They had twelve men, namely Abu Jahal, al-harits bin Hisham, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Ubay bin Khalaf, Umayyah bin Khalaf, Munabbih bin al-hajjaj, Nubaih bin al-hajjaj, Abu al-Bukhturi bin Hisham, Zam'ah bin al-Aswad, judge bin hazam, and al-harits bin 'Amir bin Naufal. They all had good deeds in the Arabian period of ignorance, such as providing pilgrims drinks, feeding the guests who came to the Mosque, protecting and protecting the rights of neighbors, and so on. All their deeds were revoked by Allah, as if they had never done anything, because the basis of their receiving a charity and their actions was faith in Allah and the Prophet Muhammad. While the second verse was revealed in connection with the Ansar people in Medinah. They believed in Allah and the Prophet Muhammad, helped the newly arrived Muslims from Mecca to travel with Prophet Muhammad, and obeyed the command and abstained from Allah.",
      "text_tafsir": "Dalam ayat ini, Allah membagi manusia menjadi dua golongan: pertama, golongan kafir, yaitu orang-orang yang mengingkari kekuasaan dan keesaan Allah, menyembah tuhan-tuhan yang lain selain Dia, menghalangi manusia beribadah kepada-Nya, membuat-buat cara beribadah kepada-Nya menurut pendapat dan keinginan sendiri, mencela dan menghalangi manusia beriman kepada Allah dan kepada Nabi Muhammad. Seluruh perbuatan golongan ini tidak mengikuti petunjuk-petunjuk Allah yang termuat di dalam Al-Qur'an dan hadis Rasul-Nya, tetapi mengikuti keinginan sendiri dan mengikuti petunjuk setan. \n\nSemua perbuatan yang berdasarkan perbuatan setan tidak ada artinya di sisi Allah walaupun perbuatan itu baik bagi manusia dan kemanusiaan. Perbuatan itu seolah-olah buih yang timbul di permukaan air, kemudian hilang tanpa bekas sedikit pun. Oleh karena itu, semua amal dan perbuatan yang dikerjakan oleh orang-orang musyrik tidak ada arti dan pahalanya di sisi Allah di akhirat nanti. Mereka hanya mendapat balasan di dunia yang diperoleh dari manusia, walaupun bentuk amal dan perbuatan itu seperti budi pekerti yang mulia, berhubungan dengan orang lain (silaturrahim), memberi makan orang miskin, memelihara anak yatim, membuat usaha-usaha kemanusiaan, memelihara dan mendirikan masjid. \n\nPekerjaan seperti ini adalah pekerjaan yang pernah dikerjakan oleh orang-orang musyrik Mekah, seperti memakmurkan Masjidilharam, melindungi orang-orang yang memerlukan perlindungan, membantu orang-orang yang mengerjakan thawaf dan sebagainya.\n\nAllah berfirman:\n\nDan Kami akan perlihatkan segala amal yang mereka kerjakan, lalu Kami akan jadikan amal itu (bagaikan) debu yang beterbangan. (al-Furqan\/25: 23)\n\nKedua, golongan mukmin, yaitu orang-orang yang mengakui keesaan Allah, taat hanya kepada-Nya saja, beribadah sesuai dengan petunjuk Allah, tidak menurut kemauan sendiri dan menjauhi larangan-Nya, beriman kepada Al-Qur'an yang dibawa Nabi Muhammad, dan membantu manusia melaksanakan ibadah kepada-Nya. Ini adalah golongan yang diridai Allah. Amal dan perbuatan golongan mukmin diterima Allah, diampuni segala dosanya, mereka mendapat pahala di dunia sedang di akhirat akan mendapat kebahagiaan yang abadi.\n\nMenurut Ibnu 'Abbas, ayat pertama diturunkan berhubungan dengan orang-orang yang memberi makan tentara musyrik Mekah pada waktu Perang Badar. Mereka ada dua belas orang, yaitu Abu Jahal, al-harits bin Hisyam, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Ubay bin Khalaf, Umayyah bin Khalaf, Munabbih bin al-hajjaj, Nubaih bin al-hajjaj, Abu al-Bukhturi bin Hisyam, Zam'ah bin al-Aswad, hakim bin hazam, dan al-harits bin 'Amir bin Naufal. Mereka semua mempunyai amal kebajikan pada masa Arab Jahiliah, seperti menyediakan minuman jemaah haji, memberi makan para tamu yang datang ke Masjidilharam, melindungi dan menjaga hak tetangga, dan sebagainya. Semua amal mereka dibatalkan pahalanya oleh Allah, seakan-akan mereka tidak pernah berbuat apa pun, karena dasar diterimanya suatu amal dan perbuatan adalah iman kepada Allah dan Nabi Muhammad. \n\nSedangkan ayat kedua diturunkan berhubungan dengan orang Ansar di Medinah. Mereka beriman kepada Allah dan Nabi Muhammad, membantu orang-orang Muhajirin yang baru datang dari Mekah hijrah bersama Nabi Muhammad, dan mengikuti perintah dan menjauhi larangan Allah.",
      "text_translation": "Dan orang-orang yang beriman (kepada Allah) dan mengerjakan kebajikan serta beriman kepada apa yang diturunkan kepada Muhammad; dan itulah kebenaran dari Tuhan mereka; Allah menghapus kesalahan-kesalahan mereka, dan memperbaiki keadaan mereka.",
      "text": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَاٰمَنُوْا بِمَا نُزِّلَ عَلٰى مُحَمَّدٍ وَّهُوَ الْحَقُّ مِنْ رَّبِّهِمْ ۚ كَفَّرَ عَنْهُمْ سَيِّاٰتِهِمْ وَاَصْلَحَ بَالَهُمْ ",
      "text_translation_en": "whereas those who have attained to faith and do righteous deeds, and have come to believe in what has been bestowed from on high on Muhammad - for it is the truth from their Sustainer - [shall attain to God’s grace:] He will efface their [past] bad deeds, and will set their hearts at rest.",
      "juz_number": 26
    },
    "3": {
      "text_tafsir_en": "In this verse is explained the abolition of the merits of deeds and deeds of unbelievers and the reasons accepted and rewarded by the deeds and deeds of the believers. God forbids the deeds and deeds of those who disbelieve because they prefer falsehood over the truth, follow Satan's temptations, follow their passions, and disbelieve in God and His Messenger. The key to receiving a charity and doing it is faith in God and His Messenger. Believers are submissive and obedient to God, and all their deeds and deeds are directed solely to seeking God's will. Therefore, God calms their hearts and minds and guides them in the straight path. In addition to expressing His attitude and actions toward unbelievers and believers, God creates parables, metaphors, and parables for mankind by presenting the different qualities, actions, and beliefs of a person in his or her life and consequences and rewards. from their actions. In fact, those who understand and understand the wisdom behind the parable, the parables, and the like, they believe in Allah, but because of the hearts, the hearing, and the sight of the unbelievers are closed and locked up because of the crimes committed, then all that parable doesn't mean anything to them. From this verse one conclusion can be drawn, that is, it is the law of Allah that no one can deny, that the basis of all the deeds and deeds of a person whom Allah approves is faith in him, in Muhammad as his apostle, in everything was carried by the apostle, kept all his commandments, and abstained from all his prohibitions. It is an act that can bring rewards, while acts that are not based on faith, piety, and obedience to Him, are not rewarded with Allah, like bubbles floating on the surface of water that rise and disappear without leaving a trace.",
      "text_tafsir": "Dalam ayat ini diterangkan sebab dihapusnya pahala amal dan perbuatan orang-orang kafir dan sebab-sebab diterima serta diberi pahalanya amal dan perbuatan orang-orang yang beriman. Allah membatalkan pahala amal dan perbuatan orang-orang kafir karena mereka lebih memilih kesesatan daripada kebenaran, mengikuti godaan setan, mengikuti hawa nafsunya, dan tidak beriman kepada Allah dan Rasul-Nya. \n\nKunci diterimanya suatu amal dan perbuatan ialah iman kepada Allah dan Rasul-Nya. Orang-orang yang beriman tunduk dan patuh kepada Allah, dan seluruh amal dan perbuatannya ditujukan semata-mata mencari keridaan Allah. Oleh karena itu, Allah menenangkan hati dan pikiran mereka serta membimbing mereka menempuh jalan yang lurus.\n\nDi samping menerangkan dengan tegas sikap dan tindakan-Nya terhadap orang-orang kafir dan orang-orang yang beriman, Allah membuat perumpamaan, tamsil, dan ibarat bagi manusia dengan mengemukakan berbagai sifat, perbuatan, dan keyakinan seseorang dalam hidup dan kehidupannya serta akibat dan balasan dari perbuatan mereka. Sebenarnya orang-orang yang mau mengerti dan memahami hikmah di balik perumpamaan, tamsil, dan ibarat itu, mereka tentu beriman kepada Allah, tetapi karena hati, pendengaran, dan penglihatan orang-orang kafir telah tertutup dan terkunci karena kejahatan yang telah dilakukan, maka semua perumpamaan itu tidak berarti sedikit pun bagi mereka.\n\nDari ayat ini dapat diambil satu kesimpulan, yaitu telah menjadi sunatullah (hukum Allah) yang tidak dapat dimungkiri oleh siapa pun, bahwa dasar semua amal dan perbuatan seseorang yang diridai Allah ialah iman kepada-Nya, kepada Muhammad sebagai rasul-Nya, kepada semua yang dibawa oleh rasul, mengerjakan semua perintah-perintah-Nya, serta menjauhi semua larangan-Nya. Itulah perbuatan yang bisa mendatangkan pahala, sedangkan perbuatan yang tidak didasari dengan iman, takwa, dan taat kepada-Nya, tidak ada pahalanya di sisi Allah, ibarat buih yang mengapung di permukaan air yang timbul dan hilang tanpa meninggalkan bekas.",
      "text_translation": "Yang demikian itu, karena sesungguhnya orang-orang kafir mengikuti yang batil (sesat) dan sesungguhnya orang-orang yang beriman mengikuti kebenaran dari Tuhan mereka. Demikianlah Allah membuat perumpamaan-perumpamaan bagi manusia.",
      "text": "ذٰلِكَ بِاَنَّ الَّذِيْنَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَاَنَّ الَّذِيْنَ اٰمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَّبِّهِمْ ۗ كَذٰلِكَ يَضْرِبُ اللّٰهُ لِلنَّاسِ اَمْثَالَهُمْ ",
      "text_translation_en": "This, because they who are bent on denying the truth pursue falsehood, whereas they who have attained to faith pursue [but] the truth [that flows] from their Sustainer. In this way does God set forth unto man the parables of their true state.",
      "juz_number": 26
    },
    "4": {
      "text_tafsir_en": "This verse explains to Muslims how to deal with unbelievers in war. They must devote all their will and ability to destroy the enemy. It is important to win the victory that will be achieved on each battlefield and not to focus on enemy conquest and loot. The arrests were made after they were defeated, because the unbelievers were always intent on killing and destroying the Muslims and they could not be trusted. They pretend to be at peace, but their hearts and beliefs continue to destroy Islam and its followers at every opportunity they can. Once the war is over with victory in the hands of the Muslims, they can choose one of two things, whether to free the captives or to release them at ransom by the enemy or by exchange of prisoners. In another verse it is explained that the Muslim border should stop fighting the infidels of Mecca is that there is no slander. Allah says: And fight them till there is no more slander, and religion is for Allah alone. If they stop, then there is no (more) hostility, except for the unjust. (al-Baqarah \/ 2: 193) Ibn 'Abbas said, \"As the number of Muslims increased and their strength increased, Allah decreed this verse, and the Messenger of Allah took action against this prisoner, and so did the Caliphs who came after him. \" From the above verse and the words of Ibn 'Abbas it is possible to understand the following: 1. This verse was brought down after the War of Badr because at the time of the war the Messenger of Allah (may peace be upon him) preferred ransom, such as redeeming property or by ordering prisoners to teach the Muslims , so the Apostle received a rebuke from Allah. 2. This verse is the hand of the Prophet and his companions in resolving issues related to war and prisoners of war. 3. The command to kill the infidels in this verse is done in battle, not out of war. Therefore, it is only right that God order the Muslims to kill their enemies in a war that is raging because their own enemies do the same to them. If Allah had not ordered it, the Muslims would have hesitated to face the enemy who would kill them so that the enemy would have the opportunity to destroy them. 4. Allah does not order the Muslims to kill the infidels wherever they come in, but Allah only commands the Muslims to fight the infidels who intend to destroy, slander, and destroy Islam and Muslims. Against unbelievers who are good to Islam and Muslims, Muslims are obligated to be good to them. Allah says: Allah does not forbid you to be kind and fair to those who do not harass you in religious matters and do not expel you from your hometown. Verily, Allah loves those who are just. Allah only forbid you to make them your friends, those who fight against you in religious matters and expel you from your hometown and help (others) drive you away. Whoever makes them friends, they are the wrongdoers. (al-Mumtahanah \/ 60: 8-9) 5. The head of state has a role in making decisions and wisdom in resolving wars and prisoners of war. It should base its decision on the interests of religion, Muslims and humanity and the common good. Forcing captives into Islam is not allowed because it is contrary to the word of God that prohibits Muslims from forcing others to convert to Islam. Allah says: There is no compulsion in the religion (of Islam), but there is a clear (difference) between the right and the wrong. Whoever disobeys God and believes in Allah, then indeed, he has (firmly) clung to a very strong rope that will never break. Allah is All-Hearing, All-Knowing. (al-Baqarah \/ 2: 256) Killing prisoners for the Muslims is of course fundamental. The prisoners who were killed were not ordinary prisoners, but were war criminals who had done many wrong things. If he lived, his war crimes would continue for a long time. Making slaves a slave was a common practice of the nations of the world before the advent of Islam. After the advent of Islam, the enemies of Islam made the Muslims they held captive. Basically slavery was prohibited by Islam, but in response to the actions of the unbelievers and to protect the feelings of the Muslims, the Messenger of Allah (may peace be upon him) allowed the Muslims to treat the unbelievers as their slaves. This means that if the unbelievers do not make the Muslims whom they take captive, then the Muslims must not make the unbelievers whom they take as slaves. Although slavery was a result of the capture of prisoners of war, in Islam many of the provisions of the law were connected with the attempt to liberate slaves called kaffarat. Islam is a religion of peace, not a war that promotes war. If in the history of Islam there was a war between the Muslims and the infidels, then the war was to defend the religion of Islam to destroy the unbelievers, while defending themselves from destruction. Ever since the Prophet Muhammad was appointed as an apostle, there has been hostility from the Meccans to him and his followers. There are various ways in which they are trying to destroy Islam and Muslims, from the weakest to the hardest. The culmination of the actions of the Meccans was to conspire to assassinate the Prophet until Allah ordered him to emigrate to Medina. Once the Messenger of Allah (may peace be upon him) was in fierce Madinah, the Muslims were forced to fight to defend their religion and themselves. After the Messenger of Allah (peace be upon him) in Medina, a peace treaty with the inhabitants of the city, among them Jews, was signed, but the peace treaty was broken by them. They even tried to kill Prophet Muhammad. Therefore, the Messenger of Allah (may peace be upon him) had to fight the Jews in Medina. There are many examples that can be found that prove that Islam is not spread through warfare, but through preaching with wisdom and wisdom. To the prisoners of war, the attitude of the Messenger of Allah (may peace be upon him) was very good. In the hadith narrated by al-Bukhari described his attitude. Abu Hurairah said, \"The Messenger of Allah (may peace be upon him) sent his cavalry to Nejed, and the cavalry captured a man of the Children of Hanifah named Sumamah bin Utsal, who was tied to one of the pillars of the mosque. what do you have? Well, if you want to kill me, do it, and if you want to free me then I will thank you, if you want the treasure, then ask me what you want. He replied, 'I have what I told you.' The Messenger of Allah (may peace be upon him) said, 'Take off your bonds.' So he went to the palm tree near the mosque and washed himself and entered the mosque. , declaring, 'I acknowledge that there is no God but Allah and that Muhammad is His Messenger. By Allah, there was no one I hated the most. This union is other than you, now you are the person I love the most. By Allah, there was no religion that I hate more than your religion, so now your religion is the religion I love the most. By Allah, once the country I hated the most was your country, now it is your beloved country. Indeed the cavalry has captured me, and I mean umrah, what do you think? So the Messenger of Allah (may peace be upon him) reported to him and ordered him to perform umrah. When he got to Mecca, someone said to him, 'Do you miss him? sumamah replied, 'No, but I have converted to Islam with Muhammad saw. \"From this hadith it is understood that the Messenger of Allah (may peace be upon him) was a gentle man, a prisoner of war. If he had been rude to him, he would not have made such a statement in the hadith, and he would have taken revenge on him and at every opportunity he would seek revenge. The principles that should exist in human life and life, whether as an individual or as a social being, among them are ethics, justice, humanity, and deliberation. God is on the earth, and on this basis all matters are resolved, ter entered into the question of war and prisoners of war. At the end of this verse, Allah describes what the believers and jihadists will receive in the way of Allah by saying, \"For those who fight in the way of Allah in defense of Islam, Allah will never reduce their reward At least, he will reward him with a double reward. About the merit of jihad in the way of Allah is mentioned in a hadith as follows: the martyr obtained nine or ten things, that would be forgiven at the time his blood was first shed, seeing his dwelling in heaven, adorned with jewels of faith, avoided by the doom of the grave, married to an angel, having found peace in the day of great fear ( the Day of Judgment), upon whose head is placed the crown of glory of a jewel better than the world and its contents, 92 wives of the angelic family, and granted the right of intercession to 70 of his relatives. \"(Ath-thabrani history)",
      "text_tafsir": "Ayat ini menerangkan kepada kaum Muslimin cara menghadapi orang-orang kafir dalam peperangan. Mereka harus mencurahkan segala kesanggupan dan kemampuan untuk menghancurkan musuh. Hendaklah mengutamakan kemenangan yang akan dicapai pada setiap medan pertempuran dan jangan mengutamakan penawanan musuh dan perebutan harta rampasan. Penawanan dilakukan setelah mereka dikalahkan, karena orang-orang kafir itu setiap saat berkeinginan membunuh dan menghancurkan kaum Muslimin dan mereka tidak dapat dipercaya. Mereka berpura-pura ingin berdamai, tetapi hati dan keyakinan mereka tetap ingin menghancurkan agama Islam dan pengikutnya pada setiap kesempatan yang mungkin mereka miliki. Setelah perang selesai dengan kemenangan di tangan kaum Muslimin, mereka boleh memilih salah satu dari dua hal, yaitu apakah akan membebaskan tawanan yang telah ditawan atau membebaskannya dengan membayar tebusan oleh pihak musuh atau dengan cara pertukaran tawanan.\n\nDalam ayat lain diterangkan bahwa batas kaum Muslimin harus berhenti memerangi orang-orang kafir Mekah itu adalah sampai tidak ada lagi fitnah. Allah berfirman:\n\nDan perangilah mereka itu sampai tidak ada lagi fitnah, dan agama hanya bagi Allah semata. Jika mereka berhenti, maka tidak ada (lagi) permusuhan, kecuali terhadap orang-orang zalim. (al-Baqarah\/2: 193)\n\nIbnu 'Abbas berkata, \"Tatkala jumlah kaum Muslimin bertambah banyak dan kekuatannya semakin bertambah pula, Allah menurunkan ayat ini, dan Rasulullah bertindak menghadapi tawanan sesuai dengan ayat ini, begitu pula para khalifah yang datang sesudahnya.\"\n\nDari ayat di atas dan perkataan Ibnu 'Abbas dapat dipahami hal-hal sebagai berikut:\n\n1. Ayat ini diturunkan setelah Perang Badar karena pada saat peperangan itu Rasulullah saw lebih mengutamakan tebusan, seperti menebus dengan harta atau dengan menyuruh tawanan mengajarkan tulis baca kepada kaum Muslimin, sehingga Rasul mendapat teguran dari Allah. \n\n2. Ayat ini merupakan pegangan bagi Rasulullah dan para sahabat dalam menyelesaikan persoalan yang berhubungan dengan peperangan dan tawanan perang.\n\n3. Perintah membunuh orang-orang kafir dalam ayat ini dilakukan dalam peperangan, bukan di luar peperangan. Oleh karena itu, wajar jika Allah memerintahkan kepada kaum Muslimin membunuh musuh-musuh mereka dalam peperangan yang sedang berkecamuk karena musuh sendiri bertindak demikian pula terhadap mereka. Jika Allah tidak memerintahkan demikian, tentu kaum Muslimin ragu-ragu menghadapi musuh yang akan membunuh mereka sehingga musuh berkesempatan menghancurkan mereka.\n\n4. Allah tidak memerintahkan kaum Muslimin membunuh orang-orang kafir di mana saja mereka temui, tetapi Allah hanya memerintahkan kaum Muslimin memerangi orang-orang kafir yang bermaksud merusak, memfitnah, dan menghancurkan Islam dan kaum Muslimin. Terhadap orang kafir yang bersikap baik terhadap agama Islam dan kaum Muslimin, kaum Muslimin wajib bersikap baik pula terhadap mereka. Allah berfirman:\n\nAllah tidak melarang kamu berbuat baik dan berlaku adil terhadap orang-orang yang tidak memerangimu dalam urusan agama dan tidak mengusir kamu dari kampung halamanmu. Sesungguhnya Allah mencintai orang-orang yang berlaku adil. Sesungguhnya Allah hanya melarang kamu menjadikan mereka sebagai kawanmu, orang-orang yang memerangi kamu dalam urusan agama dan mengusir kamu dari kampung halamanmu dan membantu (orang lain)untuk mengusirmu. Barang siapa menjadikan mereka sebagai kawan, mereka itulah orang-orang yang zalim. (al-Mumtahanah\/60: 8-9)\n\n5. Kepala negara mempunyai peranan dalam mengambil keputusan dan kebijaksanaan dalam menyelesaikan peperangan dan tawanan perang. Ia harus mendasarkan keputusannya kepada kepentingan agama, kaum Muslimin dan kemanusiaan serta kemaslahatan pada umumnya.\n\nMemaksa tawanan masuk agama Islam tidak dibolehkan karena tindakan itu bertentangan dengan firman Allah yang melarang kaum Muslimin memaksa orang lain memeluk agama Islam. Allah berfirman: \n\nTidak ada paksaan dalam (menganut) agama (Islam), sesungguhnya telah jelas (perbedaan) antara jalan yang benar dengan jalan yang sesat. Barang siapa ingkar kepada Tagut dan beriman kepada Allah, maka sungguh, dia telah berpegang (teguh) pada tali yang sangat kuat yang tidak akan putus. Allah Maha Mendengar, Maha Mengetahui. (al-Baqarah\/2: 256) \n\nMembunuh tawanan bagi kaum Muslimin tentu ada dasarnya. Tawanan yang dibunuh itu bukan tawanan biasa, tetapi merupakan penjahat perang yang telah banyak melakukan perbuatan mungkar. Bila ia hidup, maka kejahatannya dalam peperangan akan terus berlanjut dalam waktu lama.\n\nMenjadikan tawanan sebagai budak adalah tindakan yang biasa dilakukan oleh bangsa-bangsa di dunia sebelum kedatangan Islam. Setelah datang agama Islam, maka musuh-musuh Islam menjadikan kaum Muslimin yang mereka tawan menjadi budak. Pada dasarnya perbudakan itu dilarang oleh agama Islam, tetapi sebagai balasan dari tindakan orang kafir dan untuk menjaga perasaan kaum Muslimin, maka Rasulullah saw membolehkan kaum Muslimin menjadikan orang-orang kafir yang ditawannya sebagai budak. Hal ini berarti jika orang-orang kafir tidak menjadikan kaum Muslimin yang ditawannya menjadi budak, tentulah kaum Muslimin tidak boleh menjadikan orang-orang kafir yang ditawannya menjadi budak. Meskipun terjadi perbudakan karena adanya tawanan perang, maka dalam agama Islam banyak ketentuan hukum yang dihubungkan dengan upaya memerdekakan budak yang disebut dengan kaffarat.\n\nAgama Islam adalah agama perdamaian, bukan agama yang menganjurkan peperangan. Jika dalam sejarah Islam terdapat peperangan antara kaum Muslimin dengan orang-orang kafir, maka peperangan itu terjadi karena mempertahankan agama Islam yang hendak dihapuskan orang-orang kafir, di samping mempertahankan diri dari kehancuran. Sejak Nabi Muhammad saw diangkat menjadi rasul, sejak itu pula timbul permusuhan dari orang-orang musyrik Mekah kepada beliau dan pengikut-pengikutnya. Berbagai cara yang mereka lakukan untuk menumpas agama Islam dan kaum Muslimin, mulai dari cara yang lunak sampai kepada yang paling keras. Puncak dari tindakan orang musyrik Mekah itu ialah berkomplot untuk membunuh Rasulullah saw sehingga Allah memerintahkan beliau hijrah ke Medinah. Setelah Rasulullah saw berada di Medinah permusuhan itu semakin keras, sehingga kaum Muslimin terpaksa memerangi mereka untuk mempertahankan agama dan diri mereka.\n\nSesampainya Rasulullah saw di Medinah, perjanjian damai dengan penduduk kota itu, yang antara lain adalah orang-orang Yahudi, ditandatangani, tetapi perjanjian damai itu dilanggar oleh mereka. Bahkan mereka melakukan percobaan untuk membunuh Nabi Muhammad saw. Oleh karena itu, Rasulullah saw terpaksa memerangi orang Yahudi di Medinah. \n\nSangat banyak contoh yang dapat dikemukakan yang membuktikan bahwa agama Islam tidak disebarkan melalui peperangan, tetapi melalui dakwah yang penuh hikmah dan kebijaksanaan.\n\nTerhadap tawanan perang, sikap Rasulullah saw baik sekali. Dalam hadis yang diriwayatkan oleh al-Bukhari diterangkan sikap beliau. Abu Hurairah berkata, \"Rasulullah saw mengirimkan pasukan berkuda ke Nejed, maka pasukan berkuda itu menawan seorang laki-laki dari Bani Hanifah yang bernama sumamah bin Utsal, ia diikat pada salah satu tiang masjid. Maka Rasulullah saw datang kepadanya, lalu berkata, 'Apa yang engkau punyai ya sumamah? sumamah menjawab, 'Aku mempunyai harta, jika engkau mau membunuhku, lakukanlah, dan jika engkau mau membebaskanku maka aku berterima kasih kepadamu, jika engkau menghendaki harta, maka mintalah berapa engkau mau. Esok harinya Rasulullah saw pun berkata kepadanya, 'Apakah yang engkau punya ya sumamah? Ia menjawab, 'Aku mempunyai apa yang telah kukatakan kepadamu. Rasulullah saw berkata, 'Lepaskanlah ikatan sumamah. Maka sumamah pergi ke dekat pohon kurma yang berada di dekat masjid, lalu mandi kemudian ia masuk ke masjid, lalu menyatakan, 'Aku mengakui bahwa tidak ada Tuhan selain Allah dan bahwa Muhammad itu adalah Rasul-Nya. Demi Allah, dahulu tidak ada orang yang paling aku benci di dunia ini selain engkau, sekarang jadilah engkau orang yang paling aku cintai. Demi Allah, dahulu tidak ada agama yang paling aku benci selain agama engkau, maka jadilah sekarang agama engkau adalah agama yang paling aku cintai. Demi Allah, dahulu negeri yang paling aku benci adalah negerimu, sekarang jadilah negerimu negeri yang paling aku cintai. Sesungguhnya pasukan berkuda telah menangkapku, sedang aku bermaksud umrah, apa pendapatmu? Maka Rasulullah memberi kabar gembira kepadanya dan menyuruhnya melakukan umrah. Tatkala ia sampai di Mekah, seseorang mengatakan kepadanya, 'Engkau merasa rindu? sumamah menjawab, 'Tidak, tetapi aku telah masuk Islam bersama Muhammad saw.\"\n\nDari hadis ini dapat dipahami bahwa Rasulullah saw bersikap lemah-lembut kepada sumamah, seorang tawanan perang. Beliau memberi kebebasan kepadanya, sehingga ia tertarik kepada Rasulullah saw dan agama Islam, karena itu dia menyatakan dirinya masuk Islam.\n\nSeandainya Rasulullah bersikap kasar kepadanya, tentulah sumamah tidak akan mengatakan pernyataan tersebut di dalam hadis itu. Ia akan menyimpan dendam kepada Rasulullah saw dan pada setiap kesempatan ia akan berusaha membalaskan dendamnya itu.\n\nAgama Islam datang untuk menegakkan prinsip-prinsip yang harus ada dalam hidup dan kehidupan manusia, baik ia sebagai makhluk individu maupun sebagai makhluk sosial. Di antara prinsip-prinsip itu ialah ketauhidan, keadilan, kemanusiaan, dan musyawarah. Dengan menegakkan prinsip-prinsip itu manusia akan berhasil dalam tugasnya sebagai khalifah Allah di bumi. Atas dasar semuanya itulah segala persoalan diselesaikan, termasuk persoalan peperangan dan tawanan perang.\n\nPada akhir ayat ini, Allah menerangkan balasan apa yang akan diterima oleh orang-orang yang beriman dan berjihad di jalan Allah dengan mengatakan, \"Bagi orang-orang yang berjihad di jalan Allah untuk membela agama Islam, sekali-kali Allah tidak akan mengurangi pahala mereka sedikit pun, bahkan dia akan membalasnya dengan pahala yang berlipat-ganda. Mengenai pahala berjihad di jalan Allah disebutkan dalam suatu hadis sebagai berikut:ØªÙŽØ§Diriwayatkan al-Miqdam bin Ma'diyakrib, ia berkata, \"Aku mendengar Rasulullah bersabda, 'Sesungguhnya orang yang mati syahid itu memperoleh sembilan hal-atau sepuluh, yaitu akan diampuni pada saat darahnya pertama kali mengalir, melihat tempat tinggalnya di surga, dihiasi dengan perhiasan iman, dihindarkan dari azab kubur, dinikahkan dengan bidadari, memperoleh keamanan pada saat hari ketakutan yang besar (hari Kiamat), di atas kepalanya diletakkan mahkota kemuliaan dari bahan permata yang lebih baik dari pada dunia dan isinya, dinikahkan dengan 92 istri dari golongan bidadari, dan diberi hak syafaat bagi 70 orang kerabatnya.\" (Riwayat ath-thabrani)",
      "text_translation": "Maka apabila kamu bertemu dengan orang-orang yang kafir (di medan perang), maka pukullah batang leher mereka. Selanjutnya apabila kamu telah mengalahkan mereka, tawanlah mereka, dan setelah itu kamu boleh membebaskan mereka atau menerima tebusan sampai perang selesai. Demikianlah, dan sekiranya Allah menghendaki niscaya Dia membinasakan mereka, tetapi Dia hendak menguji kamu satu sama lain. Dan orang-orang yang gugur di jalan Allah, Allah tidak menyia-nyiakan amal mereka.",
      "text": "فَاِذَا لَقِيْتُمُ الَّذِيْنَ كَفَرُوْا فَضَرْبَ الرِّقَابِۗ حَتّٰٓى اِذَآ اَثْخَنْتُمُوْهُمْ فَشُدُّوا الْوَثَاقَۖ فَاِمَّا مَنًّاۢ بَعْدُ وَاِمَّا فِدَاۤءً حَتّٰى تَضَعَ الْحَرْبُ اَوْزَارَهَا ەۛ ذٰلِكَ ۛ وَلَوْ يَشَاۤءُ اللّٰهُ لَانْتَصَرَ مِنْهُمْ وَلٰكِنْ لِّيَبْلُوَا۟ بَعْضَكُمْ بِبَعْضٍۗ وَالَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللّٰهِ فَلَنْ يُّضِلَّ اَعْمَالَهُمْ ",
      "text_translation_en": "NOW WHEN you meet [in war] those who are bent on denying the truth, smite their necks until you overcome them fully, and then tighten their bonds; but thereafter [set them free,] either by an act of grace or against ransom, so that the burden of war may be lifted: thus [shall it be]. And [know that] had God so willed, He could indeed punish them [Himself]; but [He wills you to struggle] so as to test you [all] by means of one another. And as for those who are slain in God’s cause, never will He let their deeds go to waste:",
      "juz_number": 26
    },
    "5": {
      "text_tafsir_en": "In this verse it is explained that God will guide believers in the work of His favor so that the work will succeed, and will keep them from committing sin and sin. God also provided them a place in the paradise they knew because God showed them.",
      "text_tafsir": "Pada ayat ini diterangkan bahwa Allah akan membimbing orang-orang yang beriman dalam melaksanakan pekerjaan yang diridai-Nya sehingga pekerjaan itu berhasil dengan baik, dan memelihara mereka agar tidak melakukan maksiat dan perbuatan dosa. Allah juga menyediakan bagi mereka tempat kembali di surga yang telah mereka ketahui karena Allah menunjukkan tempat-tempat itu kepada mereka.",
      "text_translation": "Allah akan memberi petunjuk kepada mereka dan memperbaiki keadaan mereka,",
      "text": "سَيَهْدِيْهِمْ وَيُصْلِحُ بَالَهُمْۚ",
      "text_translation_en": "He will guide them [in the hereafter as well], and will set their hearts at rest,",
      "juz_number": 26
    },
    "6": {
      "text_tafsir_en": "In this verse it is explained that God will guide believers in the work of His favor so that the work will succeed, and will keep them from committing sin and sin. God also provided them a place in the paradise they knew because God showed them.",
      "text_tafsir": "Pada ayat ini diterangkan bahwa Allah akan membimbing orang-orang yang beriman dalam melaksanakan pekerjaan yang diridai-Nya sehingga pekerjaan itu berhasil dengan baik, dan memelihara mereka agar tidak melakukan maksiat dan perbuatan dosa. Allah juga menyediakan bagi mereka tempat kembali di surga yang telah mereka ketahui karena Allah menunjukkan tempat-tempat itu kepada mereka.",
      "text_translation": "dan memasukkan mereka ke dalam surga yang telah diperkenalkan-Nya kepada mereka.",
      "text": "وَيُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ ",
      "text_translation_en": "and will admit them to the paradise which He has promised them.",
      "juz_number": 26
    },
    "7": {
      "text_tafsir_en": "God calls on the believers, if they defend and uphold his religion by sacrificing their wealth and soul, then He will help them from their enemies. Allah will strengthen their hearts and ranks in fulfilling the obligation of defending Islam by fighting those who disbelieve to destroy it, so that the religion of Allah is firmly established.",
      "text_tafsir": "Allah menyeru orang mukmin, jika mereka membela dan menolong agama-Nya dengan mengorbankan harta dan jiwa, niscaya Ia akan menolong mereka dari musuh-musuhnya. Allah akan menguatkan hati dan barisan mereka dalam melaksanakan kewajiban mempertahankan agama Islam dengan memerangi orang-orang kafir yang hendak meruntuhkannya, sehingga agama Allah itu tegak dengan kokohnya.",
      "text_translation": "Wahai orang-orang yang beriman! Jika kamu menolong (agama) Allah, niscaya Dia akan menolongmu dan meneguhkan kedudukanmu.",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنْ تَنْصُرُوا اللّٰهَ يَنْصُرْكُمْ وَيُثَبِّتْ اَقْدَامَكُمْ ",
      "text_translation_en": "O you who have attained to faith! If you help [the cause of] God, He will help you, and will make firm your steps;",
      "juz_number": 26
    },
    "8": {
      "text_tafsir_en": "It is further explained that those who do not believe in Allah, disobey His will and power, will be doomed. Allah will remove all the merits of their deeds and deeds. Their actions will not receive guidance and counsel from Allah. Allah will also thwart all their plots to destroy the Muslims.",
      "text_tafsir": "Selanjutnya dijelaskan bahwa orang yang tidak beriman kepada Allah, mengingkari keesaan dan kekuasaan-Nya, maka mereka akan celaka. Allah akan menghapus semua pahala amal dan perbuatan mereka. Perbuatan mereka tidak akan mendapat hidayah dan taufik dari Allah. Allah juga akan menggagalkan semua tipu daya mereka untuk menghancurkan kaum Muslimin.",
      "text_translation": "Dan orang-orang yang kafir maka celakalah mereka dan Allah menghapus segala amalnya.",
      "text": "وَالَّذِيْنَ كَفَرُوْا فَتَعْسًا لَّهُمْ وَاَضَلَّ اَعْمَالَهُمْ ",
      "text_translation_en": "but as for those who are bent on denying the truth, ill fortune awaits them, since He will let all their [good] deeds go to waste:",
      "juz_number": 26
    },
    "9": {
      "text_tafsir_en": "This verse explains that Allah does not reward the deeds and deeds of unbelievers and does not give His guidance and taufik because they deny the instructions of the Qur'an that have been revealed to the Prophet Muhammad as His Messenger.",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah tidak memberi pahala bagi amal dan perbuatan orang-orang kafir dan tidak memberi hidayah dan taufik-Nya karena mereka mengingkari petunjuk-petunjuk Al-Qur'an yang telah diturunkan kepada Nabi Muhammad sebagai rasul-Nya.",
      "text_translation": "Yang demikian itu karena mereka membenci apa (Al-Qur'an) yang diturunkan Allah, maka Allah menghapus segala amal mereka.",
      "text": "ذٰلِكَ بِاَنَّهُمْ كَرِهُوْا مَآ اَنْزَلَ اللّٰهُ فَاَحْبَطَ اَعْمَالَهُمْ ",
      "text_translation_en": "this, because they hate [the very thought of] what God has bestowed from on high and thus He causes all their deeds to come to nought!",
      "juz_number": 26
    },
    "10": {
      "text_tafsir_en": "The Meccans who denied the prophecies and letters of Muhammad, and denied the truth of the Qur'an as a book that came from Allah Almighty, actually had ample evidence to justify his prophecies, - The former who once denied and rejected the call of the apostles of God. Didn't they often go to Syria, to the north of their country, and to Hadramaut, to the south. Didn't they also go to Persia to the east and to Ethiopia to the southwest of their country. They traveled to these countries for the purpose of trading. During that journey, they passed through the remnants of the ruins of the 'Ad, Samud, Shuaib, and other lands that God had destroyed. They can still see the former state in the form of debris, relics, and so on. They could see the ruins, since the country was a business center at the time and located on a business line connecting the western world to the east. They also knew that God had once destroyed God's people because of their rebellion against him and his apostles. However, they do not want to pay attention and reflect on the fact that circumcision applies to anyone who rejects his religion. Therefore, the Meccans will suffer the same fate as the people of old if they do not heed the call of the Prophet Muhammad. As proof of the truth of the promise of God, many Meccans died in the Badr War as well as in the subsequent wars.",
      "text_tafsir": "Orang-orang musyrik Mekah yang mendustakan kenabian dan kerasulan Muhammad saw, serta mengingkari kebenaran petunjuk Al-Qur'an sebagai kitab yang berasal dari Allah Yang Mahakuasa, sebenarnya mempunyai berbagai bukti untuk membenarkan kenabian dan kerasulan beliau, karena negeri itu berada di sekitar negeri umat-umat terdahulu yang pernah mendustakan dan mengingkari seruan para rasul Allah. Bukankah mereka sering pergi ke Syria, sebelah utara negeri mereka, dan Hadramaut, di sebelah selatan. Bukankah mereka juga pergi ke Persia di sebelah timur dan ke Ethiopia di sebelah barat daya negeri mereka. Kepergian mereka ke negeri-negeri tersebut dengan tujuan berdagang. \n\nDalam perjalanan itu, mereka melalui sisa-sisa reruntuhan negeri kaum 'Ad, kaum Samud, kaum Syuaib, dan sebagainya yang telah dibinasakan Allah. Mereka masih dapat melihat bekas negeri itu berupa puing, peninggalan, dan sebagainya. Mereka dapat menyaksikan reruntuhan itu, karena negeri tersebut adalah pusat perniagaan pada masa itu dan terletak pada jalur perniagaan yang menghubungkan dunia barat dengan timur. Mereka juga telah mengetahui bahwa umat-umat dahulu telah dihancurkan Allah karena durhaka kepada-Nya dan rasul-Nya. Akan tetapi, mereka tidak mau memperhatikan dan merenungkan bahwa sunatullah berlaku bagi setiap orang yang mengingkari agama-Nya.\n\nOleh karena itu, orang-orang musyrik Mekah akan mengalami nasib seperti yang telah dialami oleh umat-umat dahulu seandainya mereka tetap tidak mengindahkan seruan Nabi Muhammad. Sebagai bukti kebenaran janji Allah itu, banyak orang musyrik Mekah yang mati terbunuh dalam Perang Badar dan begitu juga pada peperangan-peperangan sesudahnya.",
      "text_translation": "Maka apakah mereka tidak pernah mengadakan perjalanan di bumi sehingga dapat memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka. Allah telah membinasakan mereka, dan bagi orang-orang kafir akan menerima (nasib) yang serupa itu.",
      "text": "۞ اَفَلَمْ يَسِيْرُوْا فِى الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ مِنْ قَبْلِهِمْ ۗ دَمَّرَ اللّٰهُ عَلَيْهِمْ ۖوَلِلْكٰفِرِيْنَ اَمْثَالُهَا ",
      "text_translation_en": "Have they, then, never journeyed about the earth and beheld what happened in the end to those [willful sinners] who lived before their time? God destroyed them utterly: and the like thereof awaits all who deny the truth.",
      "juz_number": 26
    },
    "11": {
      "text_tafsir_en": "This verse explains the condition of the believers and the infidels in the world and why the Muslims are in danger. The unbelievers do not have a helper to reject the torment that comes to them, while the believers have a helper, the Almighty God.",
      "text_tafsir": "Ayat ini menjelaskan tentang keadaan orang mukmin dan orang kafir di dunia dan sebab orang musyrik ditimpa malapetaka. Orang musyrik tidak mempunyai seorang penolong pun untuk menolak azab yang datang menimpa mereka, sedangkan orang mukmin mempunyai penolong, yaitu Allah Yang Mahakuasa dan Maha Penolong.",
      "text_translation": "Yang demikian itu karena Allah pelindung bagi orang-orang yang beriman; sedang orang-orang kafir tidak ada pelindung bagi mereka.",
      "text": "ذٰلِكَ بِاَنَّ اللّٰهَ مَوْلَى الَّذِيْنَ اٰمَنُوْا وَاَنَّ الْكٰفِرِيْنَ لَا مَوْلٰى لَهُمْ ࣖ",
      "text_translation_en": "This, because God is the Protector of all who have attained to faith, whereas they who deny the truth have no protector.",
      "juz_number": 26
    },
    "12": {
      "text_tafsir_en": "This verse talks about the state of believers and infidels in the hereafter. People who believe and do good deeds are given a double reward in the form of heaven in return for their faith and obedience. While those who deny the power and oneness of Allah and deny His Messenger, are affected by the enjoyment of life in a world that is only temporary. They did not take lessons from the events which had befallen the ancient people. They are likened to animals that feed in cages or in pastures provided for them. The animals never think about whether the food available for them is still available to eat tomorrow or all is finished today, so there is no food to eat anymore. This verse gives a description of the situation and what the polytheists think. They only think of what is good and can fulfill their desires. They do not want to think about how long they can enjoy the good desires and passions and what is the source of comfort and pleasure. Whether they can continue to enjoy it, they never think about it. They also do not think about the consequences they would experience if they could not feel the pleasure again. They feel the pleasure of eating something food, but it never occurred to them that God had bestowed their tongues to feel the pleasure of something that was eaten. What would happen if God gave disease to their tongue, so they could not feel anything anymore? They don't think of the best attitude and action they have to take towards that source of pleasure. The people described in the above verse are the Hellfire, because that is the most appropriate place of return for those who do not use their minds.",
      "text_tafsir": "Ayat ini berbicara tentang keadaan orang mukmin dan orang kafir di akhirat. Orang-orang yang beriman dan beramal saleh diberi pahala berlipat ganda berupa surga sebagai balasan dari keimanan dan ketaatan mereka. Sedangkan orang-orang yang mengingkari kekuasaan dan keesaan Allah dan mendustakan Rasul-Nya, terpengaruh oleh kenikmatan hidup di dunia yang hanya bersifat sementara. Mereka tidak mengambil pelajaran dari peristiwa-peristiwa yang telah menimpa umat-umat dahulu. Mereka diumpamakan seperti hewan yang makan di kandang atau di padang rumput yang disediakan untuk mereka. Hewan-hewan itu tidak pernah memikirkan apakah makanan yang tersedia untuknya itu masih ada untuk dimakan besok atau semua habis pada hari ini, sehingga tidak ada makanan untuk dimakan lagi.\n\nAyat ini memberikan gambaran tentang keadaan dan apa yang dipikirkan orang-orang musyrik. Mereka hanya memikirkan apa yang enak dan dapat memenuhi keinginan hawa nafsu mereka. Mereka tidak mau memikirkan berapa lama yang enak dan keinginan hawa nafsu dapat mereka nikmati dan apa sumber dari keenakan dan kesenangan itu. Apakah mereka dapat terus-menerus menikmatinya, tidak pernah mereka pikirkan. Mereka juga tidak memikirkan akibat-akibat yang akan mereka alami seandainya mereka tidak mampu merasakan kenikmatan itu lagi. Mereka merasakan kenikmatan memakan sesuatu makanan, tetapi tidak pernah terpikir oleh mereka bahwa Allah telah menganugerahkan lidah kepada mereka untuk merasakan kenikmatan sesuatu yang dimakan. Bagaimana jadinya jika Allah memberi penyakit pada lidah mereka, sehingga tidak dapat merasakan sesuatu lagi? Mereka tidak memikirkan sikap dan tindakan yang paling baik yang harus mereka lakukan terhadap sumber kenikmatan itu.\n\nOrang-orang yang digambarkan ayat di atas tempat kembalinya ialah neraka Jahanam, karena itulah tempat kembali yang paling layak bagi orang-orang yang tidak menggunakan pikirannya.",
      "text_translation": "Sungguh, Allah akan memasukkan orang-orang yang beriman dan mengerjakan kebajikan ke dalam surga yang mengalir di bawahnya sungai-sungai. Dan orang-orang yang kafir menikmati kesenangan (dunia) dan mereka makan seperti hewan makan; dan (kelak) nerakalah tempat tinggal bagi mereka.",
      "text": "اِنَّ اللّٰهَ يُدْخِلُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ۗوَالَّذِيْنَ كَفَرُوْا يَتَمَتَّعُوْنَ وَيَأْكُلُوْنَ كَمَا تَأْكُلُ الْاَنْعَامُ وَالنَّارُ مَثْوًى لَّهُمْ ",
      "text_translation_en": "Verily, God will admit all who attain to faith and do righteous deeds into gardens through which running waters flow, whereas they who are bent on denying the truth shall have - even though they may enjoy their life [in this world] and eat as cattle eat - the fire [of the hereafter] for their abode.",
      "juz_number": 26
    },
    "13": {
      "text_tafsir_en": "It is narrated by 'Abd bin humaid, Abu Ya'la, Ibn Abi atim, and Ibn Mardawaih of Ibn' Abbas, that when the Prophet Muhammad left Mecca, before emigrating to Medina, he looked back at the land of Mecca and said, \"You ( Mecca) is the land of my beloved God, and if its inhabitants do not cast me out, I will not leave you. \" Then come down to this verse. In this verse, God gives the comparison as the consolation of the Prophet Muhammad who was moved by the attitude and actions of the Meccans. It is said that many countries whose population is stronger, more knowledgeable, more able to build their country, more their army can conquer their surrounding country than the people of Mecca. All of these have been destroyed by God with all kinds of calamities that have come upon them. In the face of the catastrophe, they have no helper. All the might, power, and strength of the mighty army is of no use in the face of the catastrophe. The Meccans will experience the same fate if they continue to disobey Muhammad's call. Therefore, the Prophet was called upon for patience and perseverance in their attitude and actions and Allah surely helped and won the servants who obeyed him.",
      "text_tafsir": "Diriwayatkan oleh 'Abd bin humaid, Abu Ya'la, Ibnu Abi hatim, dan Ibnu Mardawaih dari Ibnu 'Abbas, bahwa tatkala Nabi Muhammad akan meninggalkan Mekah, sebelum hijrah ke Medinah, beliau menoleh ke belakang melihat negeri Mekah dan berkata, \"Engkau (Mekah) adalah negeri Allah yang paling aku cintai, dan kalau penduduknya tidak mengusirku, tentu aku tidak akan meninggalkan engkau.\" Maka turunlah ayat ini.\n\nDalam ayat ini, Allah memberikan perbandingan sebagai penghibur hati Nabi Muhammad yang telah digundahkan oleh sikap dan tindakan orang-orang musyrik Mekah. Diterangkan bahwa berapa banyak negeri yang penduduknya lebih kuat badannya, lebih banyak pengetahuannya, lebih mampu membangun negerinya, lebih banyak tentaranya sehingga dapat menaklukkan negeri sekitar mereka dibandingkan dengan orang-orang musyrik Mekah. Semuanya itu telah dihancurkan Allah dengan berbagai macam malapetaka yang menimpa mereka. Dalam menghadapi malapetaka itu, mereka tidak mempunyai seorang penolong pun. Semua kekuatan, kekuasaan, dan tentara yang gagah perkasa tidak ada artinya sedikit pun dalam menghadapi malapetaka itu. Orang-orang musyrik Mekah akan mengalami nasib yang demikian pula seandainya mereka tetap mengingkari seruan Nabi Muhammad. Oleh karena itu, Nabi dihimbau untuk bersabar dan tabah menghadapi sikap dan tindakan mereka dan Allah pasti menolong dan memenangkan hamba-hamba yang taat kepada-Nya.",
      "text_translation": "Dan betapa banyak negeri yang (penduduknya) lebih kuat dari (penduduk) negerimu (Muhammad) yang telah mengusirmu itu. Kami telah membinasakan mereka; maka tidak ada seorang pun yang menolong mereka.",
      "text": "وَكَاَيِّنْ مِّنْ قَرْيَةٍ هِيَ اَشَدُّ قُوَّةً مِّنْ قَرْيَتِكَ الَّتِيْٓ اَخْرَجَتْكَۚ اَهْلَكْنٰهُمْ فَلَا نَاصِرَ لَهُمْ ",
      "text_translation_en": "And how many a community of greater power than this thy community which has driven thee out, [O Muhammad,] have We destroyed, with none to succour them!",
      "juz_number": 26
    },
    "14": {
      "text_tafsir_en": "This verse explains the comparison between believers and unbelievers by saying, \"Are the same people who want to think so that they have understanding, understanding, and belief in the religion of Allah and the Qur'an revealed to Muhammad peace be upon him and people who does not want to use his mind, so he does not believe that God will give a reward in return to those who obey their lusts and the temptations of Satan? Of course the two kinds of people are not the same, even the difference between the two is very large. : Then do those who know that what God has sent down to you are truth, the same as the blind? Only a rational person can take lessons. (Ar-Ra'd \/ 13: 19) And the word of God: Not the same as the inhabitants of hell with the inhabitants of heaven, the inhabitants of heaven are the ones who get the victory. (al-hasyr \/ 59: 20)",
      "text_tafsir": "Ayat ini menjelaskan perbandingan antara orang-orang yang beriman dengan orang kafir dengan mengatakan, \"Apakah sama orang yang mau berpikir sehingga ia mempunyai pengertian, pemahaman, dan keyakinan terhadap agama Allah dan Al-Qur'an yang diturunkan kepada Muhammad saw dengan orang-orang yang tidak mau menggunakan pikirannya, sehingga ia tidak percaya bahwa Allah akan memberi balasan yang setimpal kepada orang-orang yang menuruti hawa nafsunya dan godaan setan? Tentu saja kedua macam orang itu tidak sama, bahkan perbedaan keduanya sangat besar.\n\nPada ayat yang lain Allah berfirman:\n\nMaka apakah orang yang mengetahui bahwa apa yang diturunkan Tuhan kepadamu adalah kebenaran, sama dengan orang yang buta? Hanya orang berakal saja yang dapat mengambil pelajaran. (ar-Ra'd\/13: 19)\n\nDan firman Allah:\n\nTidak sama para penghuni neraka dengan para penghuni surga; para penghuni surga itulah orang-orang yang memperoleh kemenangan. (al-hasyr\/59: 20)",
      "text_translation": "Maka apakah orang yang berpegang pada keterangan yang datang dari Tuhannya sama dengan orang yang dijadikan terasa indah baginya perbuatan buruknya itu dan mengikuti keinginannya?",
      "text": "اَفَمَنْ كَانَ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّهٖ كَمَنْ زُيِّنَ لَهٗ سُوْۤءُ عَمَلِهٖ وَاتَّبَعُوْٓا اَهْوَاۤءَهُمْ ",
      "text_translation_en": "CAN, THEN, he who takes his stand on a clear evidence from his Sustainer be likened Unto one to whom the evil of his own doings [always] seems goodly, and unto such as would follow but their own lusts?",
      "juz_number": 26
    },
    "15": {
      "text_tafsir_en": "Not the same reward that believers will receive in the hereafter and the reward that unbelievers will receive. This verse describes the state of heaven and hell in a very interesting symbolic form. It starts with the word \"parable\" (matsalul jannati). The first \"heaven\", and the second \"parable\", the \"what\" (kaman) are included in the questionnaire. According to az-Zamakhsyari (in al-Kasysyaf), this expression is in the form of affirmation, but in fact denial, a negation. The attributes of heaven described in this verse are: first, it contains many rivers and each river has water of various kinds and tastes and is good to the inhabitants of heaven. Some of these types of water are: 1.The water is pure and clean, not polluted by anything. Therefore, it will not change its taste, color, and smell. 2. There is a river that flows with good milk. The milk is good and tasty, it won't change because it is damaged or rotten. 3. There is a river that flows into a room that is good for drinking, refreshing, and refreshing the body and mood of the drinker. Not like the room in the world. It may be good to drink, but it can damage the body, mind, and mind. Therefore, the chalice in the halal heaven is drunk, while the chalice in the world is illegal. 4. There is a river that flows with clean honey, such as filtered, tasty, and nourishing honey. Narrated by Ahmad, at-Tirmidhi, and others from Mu'awiyah bin haidah, he said: I heard the Messenger of Allah (may peace be upon him) say, \"In heaven there is the sea of milk, the water of the sea, the sea of honey, and the sea of khamar. from the oceans. \" (History of Ahmad, at-Tirmidhi, and others from Mu'awiyah bin haidah) Second, in heaven there are fruits of various kinds, different colors, shapes, and tastes. They are delicious food for every resident of heaven. Third, the inhabitants of heaven are people who are cleansed from all stain and sin, because they have been forgiven by the Most Merciful God, their Protector. Then Allah described the condition of those living in Hell. They drank hot water that destroyed their intestines and the fire of hell that burned their faces.",
      "text_tafsir": "Tidak sama ganjaran yang akan diperoleh oleh orang yang beriman di akhirat dengan ganjaran yang akan diperoleh oleh orang yang tidak beriman. Ayat ini melukiskan keadaan surga dan neraka dalam bentuk simbolis yang menarik sekali. Di mulai dengan kata \"perumpamaan\"(matsalul jannati). Pertama \"surga\", dan \"perumpamaan\" kedua, \"samakah\" (kaman) yang dirangkum dalam nada tanya. Kata az-Zamakhsyari (dalam al-Kasysyaf), ungkapan ini dalam bentuk afirmasi, tetapi hakikatnya penyangkalan, suatu negasi.\n\nSifat-sifat surga yang dijelaskan dalam ayat ini di antaranya: pertama, di dalamnya mengalir sungai yang banyak dan setiap sungai mempunyai air yang berbagai macam jenis dan rasanya serta enak diminum oleh para penghuni surga. Di antara jenis air itu ialah:\n\n1.Ada yang airnya jernih lagi bersih, tidak dikotori oleh suatu apa pun. Oleh karena itu, tidak akan berubah rasa, warna, dan baunya.\n\n2.Ada sungai yang mengalirkan air susu yang baik diminum. Susu itu tetap baik dan enak, tidak akan berubah rasanya karena rusak atau busuk.\n\n3.Ada sungai yang mengalirkan khamar yang enak diminum, menyehatkan, dan menyegarkan tubuh dan perasaan peminumnya. Tidak seperti khamar di dunia. Sekali pun enak diminum oleh pecandunya, tetapi dapat merusak tubuh, akal, dan pikiran. Oleh karena itu, khamar di surga halal diminum, sedangkan khamar di dunia haram.\n\n4.Ada sungai yang mengalirkan madu yang bersih, seperti madu yang telah disaring, enak, dan menyehatkan badan peminumnya.\n\nDiriwayatkan oleh Ahmad, at-Tirmidhi, dan lain-lain dari Mu'awiyah bin haidah, ia berkata: \n\nAku mendengar Rasulullah saw bersabda, \"Di surga ada lautan susu, lautan air, lautan madu, dan lautan khamar, kemudian mengalirlah sungai-sungai dari lautan-lautan itu.\" (Riwayat Ahmad, at-Tirmidhi, dan lain-lain dari Mu'awiyah bin haidah)\n\nKedua, di dalam surga terdapat buah-buahan yang beraneka ragam jenisnya, berbeda warna, bentuk, dan rasanya. Semuanya merupakan makanan yang enak bagi setiap penghuni surga.\n\nKetiga, penduduk surga itu adalah orang-orang bersih dari segala noda dan dosa, karena mereka itu telah diampuni Allah Tuhan Yang Maha Penyayang, Pelindung mereka.\n\nKemudian Allah menerangkan keadaan orang-orang yang hidup dalam neraka. Mereka meminum air yang sangat panas yang menghancurkan usus-ususnya dan api neraka yang membakar hangus muka mereka.",
      "text_translation": "Perumpamaan taman surga yang dijanjikan kepada orang-orang yang bertakwa; di sana ada sungai-sungai yang airnya tidak payau, dan sungai-sungai air susu yang tidak berubah rasanya, dan sungai-sungai khamar (anggur yang tidak memabukkan) yang lezat rasanya bagi peminumnya dan sungai-sungai madu yang murni. Di dalamnya mereka memperoleh segala macam buah-buahan dan ampunan dari Tuhan mereka. Samakah mereka dengan orang yang kekal dalam neraka, dan diberi minuman dengan air yang mendidih sehingga ususnya terpotong-potong?",
      "text": "مَثَلُ الْجَنَّةِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَ ۗفِيْهَآ اَنْهٰرٌ مِّنْ مَّاۤءٍ غَيْرِ اٰسِنٍۚ وَاَنْهٰرٌ مِّنْ لَّبَنٍ لَّمْ يَتَغَيَّرْ طَعْمُهٗ ۚوَاَنْهٰرٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشّٰرِبِيْنَ ەۚ وَاَنْهٰرٌ مِّنْ عَسَلٍ مُّصَفًّى ۗوَلَهُمْ فِيْهَا مِنْ كُلِّ الثَّمَرٰتِ وَمَغْفِرَةٌ مِّنْ رَّبِّهِمْ ۗ كَمَنْ هُوَ خَالِدٌ فِى النَّارِ وَسُقُوْا مَاۤءً حَمِيْمًا فَقَطَّعَ اَمْعَاۤءَهُمْ",
      "text_translation_en": "[And can] the parable of the paradise which the God-conscious are promised [a paradise] wherein there are rivers of water which time does not corrupt, and rivers of milk the taste whereof never alters, and rivers of wine delightful to those who drink it, and rivers of honey of all impurity cleansed, and the enjoyment of all the fruits [of their good deeds] and of forgiveness from their Sustainer -: can this [parable of paradise] be likened unto [the parable of the recompense of] such as are to abide in the fire and be given waters of burning despair to drink, so that it will tear their bowels asunder?",
      "juz_number": 26
    },
    "16": {
      "text_tafsir_en": "This verse explains that when the Prophet Muhammad read the Qur'an, some who heard it were hypocrites, but they did not understand his reading. After they left the Prophet, they asked the knowledgeable companions of the Prophet and understood all the words, \"What did Muhammad say in this meeting?\" This question is of no avail. Their purpose in doing so was to mock the Prophet's words. They seemed to understand what he was saying, so they questioned and responded, saying that what the Prophet said was of no significance to them. Muqatil narrated that Prophet Muhammad preached and described the evils of the hypocrites and among those who heard the sermon there were also hypocrites. After the sermon was over, the hypocrite came out and asked 'Abdullah bin Mas'ud for the purpose of making fun of the Prophet. Among them they said, \"What did Muhammad say?\" Ibn 'Abbas said, \"I have been asked such a question.\" Then the verse explains why hypocrites do so. Those whose character is described are those who have been stamped and locked in death, so that they can no longer accept the guidance and truth that they have been given.",
      "text_tafsir": "Ayat ini menjelaskan bahwa ketika Nabi Muhammad membacakan Al-Qur'an, di antara yang mendengar terdapat orang-orang munafik, namun mereka tidak memahami bacaan beliau. Setelah mereka pergi meninggalkan Nabi, mereka bertanya kepada sahabat-sahabat Nabi yang berilmu dan memahami semua perkataannya, \"Apakah yang dikatakan Muhammad dalam pertemuan tadi?\" Pertanyaan ini adalah sesuatu yang tidak ada faedahnya.\n\nTujuan mereka melakukan yang demikian tidak lain hanyalah untuk memperolok-olok ucapan Rasulullah. Mereka seakan-akan memahami ucapan beliau, sehingga mereka bertanya dan memberikan tanggapan, dengan mengatakan bahwa yang diucapkan Rasulullah itu tidak ada artinya sedikit pun bagi mereka.\n\nDiriwayatkan oleh Muqatil bahwa Nabi Muhammad berkhutbah dan menerangkan keburukan budi pekerti orang munafik dan di antara yang mendengar khutbah itu ada pula orang munafik. Setelah khutbah selesai, orang munafik itu keluar dan bertanya kepada 'Abdullah bin Mas'ud dengan maksud memperolok-olok dan merendahkan Rasulullah. Di antaranya mereka mengatakan, \"Apa yang dikatakan Muhammad tadi?\" Ibnu 'Abbas berkata, \"Saya pun pernah ditanya dengan pertanyaan seperti itu.\"\n\nKemudian ayat itu menerangkan apa sebab kaum munafik melakukan yang demikian. Orang-orang yang telah diterangkan sifat-sifatnya itu adalah mereka yang telah dicap dan dikunci mati hatinya, sehingga mereka tidak dapat lagi menerima petunjuk dan kebenaran yang telah disampaikan kepada mereka.",
      "text_translation": "Dan di antara mereka ada orang yang mendengarkan perkataanmu (Muhammad), tetapi apabila mereka telah keluar dari sisimu mereka berkata kepada orang yang telah diberi ilmu (sahabat-sahabat Nabi), “Apakah yang dikatakannya tadi?” Mereka itulah orang-orang yang dikunci hatinya oleh Allah dan mengikuti keinginannya.",
      "text": "وَمِنْهُمْ مَّنْ يَّسْتَمِعُ اِلَيْكَۚ حَتّٰىٓ اِذَا خَرَجُوْا مِنْ عِنْدِكَ قَالُوْا لِلَّذِيْنَ اُوْتُوا الْعِلْمَ مَاذَا قَالَ اٰنِفًا ۗ اُولٰۤىِٕكَ الَّذِيْنَ طَبَعَ اللّٰهُ عَلٰى قُلُوْبِهِمْ وَاتَّبَعُوْٓا اَهْوَاۤءَهُمْ",
      "text_translation_en": "Now among those [hapless sinners] are such as [pretend to] listen to thee, [O Muhammad,] and then, as soon as they leave thy presence, speak [with scorn] unto those who have understood [thy mes­sage]: “What is it that he has said just now?” It is such as these whose hearts God has sealed because they [always] followed but their own lusts",
      "juz_number": 26
    },
    "17": {
      "text_tafsir_en": "In this verse is described the state of the person as opposed to the hypocrite. They are people who have received guidance, faith, hearing, observing, and practicing the Qur'anic verses. Their breasts are open to God, their hearts are at peace as they listen to the verses of the Qur'an or as they read them, their knowledge of Allah's religion increases. Allah gives them further guidance through inspiration and guides them in doing good deeds and gives them the ability to increase their obedience and piety.",
      "text_tafsir": "Dalam ayat ini diterangkan keadaan orang yang berlawanan sifatnya dengan orang munafik. Mereka adalah orang yang telah mendapat petunjuk, beriman, mendengar, memperhatikan, dan mengamalkan ayat-ayat Al-Qur'an. Dada mereka dilapangkan Allah, hati mereka menjadi tenteram bila mendengarkan ayat-ayat Al-Qur'an atau bila mereka membacanya, pengetahuannya semakin bertambah tentang agama Allah. Allah menambah petunjuk lagi bagi mereka dengan jalan ilham dan membimbing mereka untuk mengerjakan amal saleh serta memberi kesanggupan kepada mereka untuk menambah ketaatan dan ketakwaan mereka.",
      "text_translation": "Dan orang-orang yang mendapat petunjuk, Allah akan menambah petunjuk kepada mereka dan menganugerahi ketakwaan mereka.",
      "text": "وَالَّذِيْنَ اهْتَدَوْا زَادَهُمْ هُدًى وَّاٰتٰىهُمْ تَقْوٰىهُمْ ",
      "text_translation_en": "just as for those who are [willing to be] guided, He increases their [ability to follow His] guidance and causes them to grow in God-consciousness.",
      "juz_number": 26
    },
    "18": {
      "text_tafsir_en": "The people who have been stamped and locked in death so that they can no longer accept the truth and guidance are people whose lives are no longer useful. They were just waiting for the sudden death and the coming of the Day of Judgment. When the Day of Judgment has come, and the signs are already seen, there is no use for them in remembrance, and God will not accept their repentance, nor will there be any use of faith or charity for them. God said: And in that day there will be a hell of hell; On that day men will be conscious of it, but it will be of no use to them. (al-Fajr \/ 89: 23)",
      "text_tafsir": "Orang-orang yang telah dicap dan dikunci mati hatinya sehingga tidak dapat lagi menerima kebenaran dan petunjuk adalah orang yang hidupnya sudah tidak lagi berfaedah. Mereka hanya menunggu-nunggu kematian dan kedatangan hari Kiamat yang datang secara tiba-tiba. Apabila hari Kiamat itu telah datang, dan memang telah kelihatan tanda-tandanya, maka tidak ada lagi gunanya peringatan bagi mereka, dan Allah tidak akan menerima tobat mereka, bahkan tidak ada lagi gunanya iman dan amal bagi mereka. Allah berfirman:\n\nDan pada hari itu diperlihatkan neraka Jahanam; pada hari itu sadarlah manusia, tetapi tidak berguna lagi baginya kesadaran itu. (al-Fajr\/89: 23)",
      "text_translation": "Maka apalagi yang mereka tunggu-tunggu selain hari Kiamat, yang akan datang kepada mereka secara tiba-tiba, karena tanda-tandanya sungguh telah datang. Maka apa gunanya bagi mereka kesadaran mereka itu apabila (hari Kiamat) itu sudah datang?",
      "text": "فَهَلْ يَنْظُرُوْنَ اِلَّا السَّاعَةَ اَنْ تَأْتِيَهُمْ بَغْتَةً ۚ فَقَدْ جَاۤءَ اَشْرَاطُهَا ۚ فَاَنّٰى لَهُمْ اِذَا جَاۤءَتْهُمْ ذِكْرٰىهُمْ ",
      "text_translation_en": "Are, then, they [whose hearts are sealed] wait­ing for the Last Hour - [waiting] that it come upon them of a sudden? But it has already been foretold! And what will their remembrance [of their past sins] avail them, once it has come upon them?",
      "juz_number": 26
    },
    "19": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad, when he was convinced and aware of the reward that believers will receive, and the torment that unbelievers will have in the hereafter, to hold fast to the religion of Allah that will bring happiness to life in the world and in the hereafter. He was also asked to ask God to forgive his sins and the sins of the believers, to always pray to him and to remember him, and never give Satan a chance to carry out his evil intentions. An authentic hadith says, Allah's Messenger (may peace be upon him) prayed: O Allah, forgive me my wrongdoing, my foolishness, and my excessive doings, and the sins you know more than I do. O Allah, forgive the sins of my words and the seriousness of my words, my wrongdoings, my intentions, and all that I have. \" Greetings: O Allah, forgive my former and last sins, hidden and visible, and my great deeds and sins that You know more than me, You are my Lord, and there is no god besides You. \" (History of al-Bukhari and Muslim from Ibn 'Abbas) O mankind, repent to your Lord; verily I beg of Allah and repent to Him daily more than seventy times. (Muslim History) Abu Bakr as-shiddiq said, \"You must read,\" La ilaha illallah and istigfar. and when they see this, I will destroy them with their lust, they will think of guidance. ”(Abu Ya'la) In one of the words of Satan, the words of the devil, always deceiving them as long as their lives were in their bodies. \"Then God said,\" For my strength and my glory I have forgiven them their sins, so long as they ask for my forgiveness. \" God, and always striving to find the sustenance and happiness of his life, God says, \"He knows all their efforts, their behaviors and their actions during the day i, so their place is at night. Therefore, fear and ask forgiveness of Him. \"In another verse, Allah says: And no living creature is on the earth except it is guaranteed by His sustenance. He knows his dwelling place and its storage.) All (written) in the Book of Reality (Far Mahfudz). (Hud \/ 11: 6) And it is He Who gives you sleep in the night, and He knows what you do in the daytime, and He raises you in the day to fulfill your appointed age. to Him you return, and He will tell you what you have done (al-An'am \/ 6: 60)",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad, apabila ia telah yakin dan mengetahui pahala yang akan diperoleh oleh orang-orang yang beriman, serta azab yang akan diperoleh oleh orang-orang kafir di akhirat, untuk berpegang teguh kepada agama Allah yang dapat mendatangkan kebahagiaan hidup di dunia dan di akhirat. Beliau juga diperintahkan untuk memohon kepada Allah agar mengampuni dosa-dosanya dan dosa-dosa orang beriman, selalu berdoa dan berzikir kepada-Nya, dan janganlah sekali-kali memberi kesempatan kepada setan untuk melaksanakan maksud buruknya kepada beliau.\n\nSebuah hadis sahih mengatakan, Rasulullah saw selalu berdoa: \n\nWahai Allah, ampunilah kesalahanku, kebodohanku, dan perbuatanku yang berlebih-lebihan, dan dosaku yang lebih Engkau ketahui daripadaku. Wahai Allah, ampunilah dosa perkataanku yang tidak serius dan perkataanku yang sungguh-sungguh, kesalahanku, kesengajaanku, dan semua yang ada padaku.\" (Riwayat al-Bukhari dari Abu Musa al-Asy'ari) \n\nRasulullah sering berdoa pada akhir salatnya, sebelum mengucapkan salam:\n\nYa Allah, ampunilah dosaku yang terdahulu dan yang terkemudian, yang tersembunyi dan yang tampak, serta perbuatanku yang berlebihan dan dosaku yang Engkau lebih mengetahui daripadaku, Engkau Tuhanku, tak ada tuhan selain Engkau.\" (Riwayat al-Bukhari dan Muslim dari Ibnu 'Abbas)\n\nHai manusia, bertobatlah kamu kepada Tuhanmu maka sesungguhnya aku pun mohon ampun kepada Allah dan bertobat kepada-Nya setiap hari lebih dari tujuh puluh kali. (Riwayat Muslim)\n\nAbu Bakar as-shiddiq berkata, \"Hendaklah kamu membaca, \"La ilaha illallah dan istigfar.\" Bacalah keduanya berulang kali, maka sesungguhnya Iblis berkata, \"Aku membinasakan manusia dengan perbuatan dosanya, dan mereka membinasakanku dengan membaca La ilaha illallah dan istigfar, maka ketika aku mengetahui yang demikian, mereka aku hancurkan dengan hawa nafsunya, mereka mengira mendapat petunjuk.\" (Riwayat Abu Ya'la).\n\nDalam satu atsar diterangkan perkataan Iblis, \"Demi keperkasaan dan keagungan-Mu, wahai Tuhan, aku senantiasa memperdaya mereka selama nyawa mereka dikandung badan.\" Lalu Allah berfirman, \"Demi keperkasaan dan keagungan-Ku, Aku senantiasa mengampuni dosa mereka, selama mereka tetap memohon ampunan kepada-Ku.\"\n\nSelanjutnya Allah mendorong manusia melaksanakan perintah-Nya, menjauhi larangan-Nya, dan agar selalu berusaha untuk mencari rezeki dan kebahagiaan hidupnya. Allah berfirman, \"Dia mengetahui segala usaha, perilaku, dan tindak-tanduk mereka di siang hari, begitu pula tempat mereka berada di malam hari. Oleh karena itu, bertakwa dan meminta ampunlah kepada-Nya.\" Dalam ayat lain, Allah berfirman:\n\nDan tidak satu pun makhluk bergerak (bernyawa) di bumi melainkan semuanya dijamin Allah rezekinya. Dia mengetahui tempat kediamannya dan tempat penyimpanannya.) Semua (tertulis) dalam Kitab yang nyata (Lauh Mahfudz). (Hud\/11: 6)\n\nDan Dialah yang menidurkan kamu pada malam hari dan Dia mengetahui apa yang kamu kerjakan pada siang hari. Kemudian Dia membangunkan kamu pada siang hari untuk disempurnakan umurmu yang telah ditetapkan. Kemudian kepada-Nya tempat kamu kembali, lalu Dia memberitahukan kepadamu apa yang telah kamu kerjakan. (al-An'am\/6: 60)",
      "text_translation": "Maka ketahuilah, bahwa tidak ada tuhan (yang patut disembah) selain Allah dan mohonlah ampunan atas dosamu dan atas (dosa) orang-orang mukmin, laki-laki dan perempuan. Dan Allah mengetahui tempat usaha dan tempat tinggalmu.",
      "text": "فَاعْلَمْ اَنَّهٗ لَآ اِلٰهَ اِلَّا اللّٰهُ وَاسْتَغْفِرْ لِذَنْۢبِكَ وَلِلْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِۚ وَاللّٰهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوٰىكُمْ ࣖ",
      "text_translation_en": "Know, then, [O man,] that there is no deity save God, and [while there is yet time,] ask forgive­ness for thy sins and for [the sins of] all other believing men and women: for God knows all your comings and goings as well as your abiding [at rest].",
      "juz_number": 26
    },
    "20": {
      "text_tafsir_en": "Those who believe in Allah and His Messenger with a sincere heart will surely be willing to sacrifice their wealth and souls in the way of God. They are waiting for the revelation of Allah, especially the revelation related to the jihadist order. However, the command of the war was not to attack, but to defend itself against enemy attacks, as was the case with the Badr War, the Uhud War, the Khandak War, and others. They say, \"Why does God not give us clear and concise verses in which it is stated that the war in defense of the religion of Allah is a mandatory requirement for every believer to obey.\" Instead, hypocrites act differently. When a clear and concise verse is revealed that contains the jihadist order, look to the Prophet with a look of disbelief and fear. Their hearts are torn, their bodies tremble, and they are silent, like the one who is facing death. In another verse, Allah says: Do you not notice those who are told to them, \"Hold your hand (from war), perform the prayer and perform alms!\" When they were forced to go to war, some of them (hypocrites) feared the people, as they feared God, and were even more afraid. They said, \"Our Lord, why do You have to fight us? Why do You not delay (our duty) to us any more?\" Say, \"The pleasures of this world are small and the hereafter is better for those who fear (reward for war) and you will not be harmed.\" (an-Nisa '\/ 4: 77) From the answers and attitudes of the hypocrites, what is in their hearts is drawn. Such a person would rather die than live away from religious orders. One who lives to be a servant of God who obeys him, wants to achieve the happiness of living in this world and in the hereafter. Hypocrites do not practice that obedience. They don't seem to mind the bliss of life after death. Therefore, there is no meaning to life except to multiply the sinful deeds that will bring them to the torment of the Hereafter. If they die at that time, their torment will not increase in the hereafter.",
      "text_tafsir": "Orang-orang yang beriman kepada Allah dan Rasul-Nya dengan setulus hati pasti bersedia mengorbankan harta dan jiwanya di jalan Allah. Mereka menunggu-nunggu turunnya wahyu Allah, terutama wahyu yang berhubungan dengan perintah jihad. Akan tetapi, perintah perang itu pada dasarnya bukan untuk menyerang, melainkan untuk mempertahankan diri dari serangan musuh, seperti yang terjadi dengan Perang Badar, Perang Uhud, Perang Khandak, dan lain-lain. Mereka berkata, \"Mengapa Allah tidak menurunkan kepada kita ayat-ayat yang tegas dan jelas maksudnya yang di dalamnya disebutkan bahwa berperang membela agama Allah itu adalah suatu perintah wajib yang harus dilaksanakan oleh setiap orang beriman.\" Sebaliknya orang-orang munafik bersikap lain. Bila diturunkan ayat yang tegas dan jelas maknanya yang berisi perintah jihad, melihat kepada Nabi dengan pandangan keingkaran dan ketakutan. Hati mereka kecut, tubuh mereka gemetar mendengarnya, dan mereka bungkam, seperti orang yang sedang menghadapi saat kematian.\n\nDalam ayat lain, Allah berfirman:\n\nTidakkah engkau memperhatikan orang-orang yang dikatakan kepada mereka, \"Tahanlah tanganmu (dari berperang), laksanakanlah salat dan tunaikanlah zakat!\" Ketika mereka diwajibkan berperang, tiba-tiba sebagian mereka (golongan munafik) takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih takut (dari itu). Mereka berkata, \"Ya Tuhan kami, mengapa Engkau wajibkan berperang kepada kami? Mengapa tidak Engkau tunda (kewajiban berperang) kepada kami beberapa waktu lagi?\" Katakanlah, \"Kesenangan di dunia ini hanya sedikit dan akhirat itu lebih baik bagi orang-orang yang bertakwa (mendapat pahala turut berperang) dan kamu tidak akan dizalimi sedikit pun.\" (an-Nisa'\/4: 77)\n\nDari jawaban dan sikap orang munafik, tergambar apa yang tersirat dalam hati mereka. Orang yang demikian lebih baik mati daripada hidup mengekang diri dari perintah-perintah agama. Seseorang hidup untuk menjadi hamba Allah yang taat kepada-Nya, ingin mencapai kebahagiaan hidup di dunia dan di akhirat. Orang munafik tidak melaksanakan ketaatan itu. Mereka seakan-akan tidak memikirkan kebahagiaan hidup sesudah mati. Oleh karena itu, tidak ada arti hidup bagi mereka selain untuk melipat-gandakan perbuatan dosa yang menyebabkan mereka di azab di akhirat. Jika mereka mati waktu itu juga, azab mereka tidak akan bertambah di akhirat nanti.",
      "text_translation": "Dan orang-orang yang beriman berkata, “Mengapa tidak ada suatu surah (tentang perintah jihad) yang diturunkan?” Maka apabila ada suatu surah diturunkan yang jelas maksudnya dan di dalamnya tersebut (perintah) perang, engkau melihat orang-orang yang di dalam hatinya ada penyakit akan memandang kepadamu seperti pandangan orang yang pingsan karena takut mati. Tetapi itu lebih pantas bagi mereka.",
      "text": "وَيَقُوْلُ الَّذِيْنَ اٰمَنُوْا لَوْلَا نُزِّلَتْ سُوْرَةٌ ۚفَاِذَآ اُنْزِلَتْ سُوْرَةٌ مُّحْكَمَةٌ وَّذُكِرَ فِيْهَا الْقِتَالُ ۙرَاَيْتَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ يَّنْظُرُوْنَ اِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِۗ فَاَوْلٰى لَهُمْۚ ",
      "text_translation_en": "NOW THOSE who have attained to faith say, “Would that a revelation [allowing us to fight] was bestowed from on high!” But now that a revelation clear in and by itself, mentioning war, has been bestowed from on high, thou canst see those in whose hearts is disease look­ing at thee, [O Muhammad,] with the look of one who is about to faint for fear of death! And yet, far better for them would be",
      "juz_number": 26
    },
    "21": {
      "text_tafsir_en": "This verse describes the attitude that hypocrites should have when they obey God, utter words that speak, out of fear, and fear of the enemy. However, they are not. It is because the pleasures of living in the world have left them fascinated and forgotten. They are afraid of losing their fun. Whereas if they know that the pleasures of life in the world are temporary and temporary pleasures, while the pleasures of the hereafter are real pleasures, they will certainly change their attitude. It is further explained that the hypocrites when it comes to war orders, resentment in their hearts that they refuse to go to war. If they had strong faith in their breasts, truly obeyed God and followed the Prophet, they would have fought with the Messenger. It is better for them because they are closer to God.",
      "text_tafsir": "Ayat ini menjelaskan sikap yang seharusnya dimiliki oleh orang-orang munafik adalah taat kepada Allah, mengucapkan perkataan yang makruf, daripada takut, dan gentar menghadapi musuh. Akan tetapi, mereka tidak demikian. Hal itu karena kesenangan hidup di dunia telah membuat mereka terpesona dan lupa diri. Mereka takut kehilangan kesenangan. Padahal jika mereka mengetahui bahwa kesenangan hidup di dunia adalah kesenangan yang semu dan sementara, sedangkan kesenangan hidup di akhirat adalah kesenangan yang sebenarnya, tentu mereka akan mengubah sikap.\n\nSelanjutnya diterangkan bahwa kaum munafik itu apabila datang perintah berperang, timbullah kebencian dalam hati mereka sehingga mereka enggan ikut berperang. Seandainya mereka mempunyai iman yang kuat di dalam dada mereka, benar-benar taat kepada Allah dan mengikuti Rasul, pasti mereka ikut berperang bersama Rasul. Hal itu lebih baik bagi mereka karena dengan demikian mereka dekat kepada Allah.",
      "text_translation": "(Yang lebih baik bagi mereka adalah) taat (kepada Allah) dan bertutur kata yang baik. Sebab apabila perintah (perang) ditetapkan (mereka tidak menyukainya). Padahal jika mereka benar-benar (beriman) kepada Allah, niscaya yang demikian itu lebih baik bagi mereka.",
      "text": "طَاعَةٌ وَّقَوْلٌ مَّعْرُوْفٌۗ فَاِذَا عَزَمَ الْاَمْرُۗ فَلَوْ صَدَقُوا اللّٰهَ لَكَانَ خَيْرًا لَّهُمْۚ",
      "text_translation_en": "obedience [to God’s call] and a word that could win [His] approval: for, since the matter has been resolved [by His revelation], it would be but for their own good to remain true to God.",
      "juz_number": 26
    },
    "22": {
      "text_tafsir_en": "This verse criticizes the attitude of the hypocrites who are always pursuing the pleasures of life in the world, saying, \"O hypocrites, for you always pursue the pleasures of life in the world and its luxury, if you have power, then you must have the qualities of selfishness by showing power to the common people, love to take and abuse the rights of others, and to break the bond of friendship that it is highly recommended to connect.",
      "text_tafsir": "Ayat ini mencela sikap kaum munafik yang selalu mengejar kesenangan hidup di dunia, dengan mengatakan, \"Hai orang munafik, karena kamu selalu mengejar kesenangan hidup di dunia dan kemewahannya, maka seandainya kamu berkuasa, pastilah kamu mempunyai sifat-sifat ingin mementingkan diri sendiri dengan memperlihatkan kekuasaan kepada rakyat jelata, suka mengambil dan memperkosa hak orang lain, dan memutuskan hubungan silaturrahim yang sangat dianjurkan untuk disambungkan.",
      "text_translation": "Maka apakah sekiranya kamu berkuasa, kamu akan berbuat kerusakan di bumi dan memutuskan hubungan kekeluargaan?",
      "text": "فَهَلْ عَسَيْتُمْ اِنْ تَوَلَّيْتُمْ اَنْ تُفْسِدُوْا فِى الْاَرْضِ وَتُقَطِّعُوْٓا اَرْحَامَكُمْ ",
      "text_translation_en": "[Ask them:] “Would you, perchance, after having turned away [from God’s commandment, pre­fer to revert to your old ways, and] spread corruption on earth, and [once again] cut asunder your ties of kinship?”",
      "juz_number": 26
    },
    "23": {
      "text_tafsir_en": "The hypocrites who acted as mentioned above have been kept away from His mercy. Therefore, God reduced their hearing so that they could not learn what they heard, and God blinded them so that they could not benefit from what they saw.",
      "text_tafsir": "Orang-orang munafik yang bersikap seperti yang disebutkan di atas telah dijauhkan Allah dari rahmat-Nya. Oleh karena itu, Allah menghilangkan pendengaran mereka sehingga tidak dapat mengambil pelajaran dari apa yang dapat mereka dengar, dan Allah membutakan mereka sehingga mereka tidak dapat mengambil manfaat dari apa yang mereka lihat.",
      "text_translation": "Mereka itulah orang-orang yang dikutuk Allah; lalu dibuat tuli (pendengarannya) dan dibutakan penglihatannya.",
      "text": "اُولٰۤىِٕكَ الَّذِيْنَ لَعَنَهُمُ اللّٰهُ فَاَصَمَّهُمْ وَاَعْمٰٓى اَبْصَارَهُمْ ",
      "text_translation_en": "It is such as these whom God rejects, and whom He makes deaf [to the voice of truth], and whose eyes He blinds [to its sight]!",
      "juz_number": 26
    },
    "24": {
      "text_tafsir_en": "Do the hypocrites not pay attention to and understand the teachings of Allah in the Qur'an, neither do they ponder and ponder, until they are aware of the error of their attitude and actions? Or have their hearts and eyes been locked so that they can no longer understand its contents? The attitudes and actions of the hypocrites were not only practiced against the believers, but also against the Jews. They declared willingness to cooperate with the Jews of the Bani Nadhir and the Children of Quraida. They were willing to follow some of the Jews' desire to appeal to them, but they did not keep all that promise and willingness. They sometimes do not shy away from associating with friends, by hugging their friends. Allah said: Do you not notice the hypocrites who say to their disbelieving brethren among the Scriptures, \"If you are driven out we will go out with you, and we will never obey anyone for your sake. , and if you fight it we will definitely help you. \" And God saw that they were really liars. (al-hasyr \/ 59: 11)",
      "text_tafsir": "Apakah orang-orang munafik itu tidak memperhatikan dan memahami ajaran-ajaran Allah yang terdapat dalam Al-Qur'an, tidak pula merenungkan dan memikirkannya, sehingga mereka mengetahui kesalahan sikap dan tindakan mereka selama ini? Atau telah terkunci hati dan penglihatan mereka sehingga tidak dapat lagi memahami isinya?\n\nSikap dan tindakan yang dilakukan oleh kaum munafik itu tidak saja dilakukan terhadap orang beriman, tetapi juga terhadap orang Yahudi. Mereka menyatakan kesediaan bekerja sama dengan orang Yahudi Bani Nadhir dan Bani Quraidzah. Bahkan mereka bersedia mengikuti sebahagian keinginan orang Yahudi untuk menarik hati mereka, tetapi semua janji dan kesediaan itu tidak mereka tepati. Mereka terkadang tidak segan-segan mencelakakan teman yang diajak bersekongkol, dengan menohok kawan seiring. \n\nAllah berfirman:\n\nTidakkah engkau memperhatikan orang-orang munafik yang berkata kepada saudara-saudaranya yang kafir di antara Ahli Kitab, \"Sungguh, jika kamu diusir niscaya kami pun akan keluar bersama kamu; dan kami selama-lamanya tidak akan patuh kepada siapa pun demi kamu, dan jika kamu diperangi pasti kami akan membantumu.\" Dan Allah menyaksikan, bahwa mereka benar-benar pendusta. (al-hasyr\/59: 11)",
      "text_translation": "Maka tidakkah mereka menghayati Al-Qur'an ataukah hati mereka sudah terkunci?",
      "text": "اَفَلَا يَتَدَبَّرُوْنَ الْقُرْاٰنَ اَمْ عَلٰى قُلُوْبٍ اَقْفَالُهَا ",
      "text_translation_en": "Will they not, then, ponder over this Qur’an? - or are there locks upon their hearts?",
      "juz_number": 26
    },
    "25": {
      "text_tafsir_en": "In this verse it is explained that those who return to disbelief after it is evident to them the right path which must be taken by carrying out sinful and heretical deeds are those who have been consumed and influenced by Satan's deception. Satan makes the deeds of sin and error that they do as good deeds in their view, so that they live with wallowing in sin and error. In addition, they are lulled by false delusions, according to their impulses. Thus, lust becomes a measure of good or bad deeds. What is considered good by their passions, that's what they think is good. These are the things that give rise to hypocrisy in themselves.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa orang-orang yang kembali kafir setelah nyata bagi mereka jalan yang lurus yang harus ditempuh dengan mengerjakan perbuatan dosa dan sesat adalah orang yang telah termakan dan terpengaruh oleh tipu daya setan. Setan menjadikan perbuatan dosa dan kesesatan yang mereka kerjakan sebagai perbuatan baik dalam pandangan mereka, sehingga mereka hidup dengan bergelimang dosa dan kesesatan. Di samping itu, mereka dibuai oleh angan-angan yang palsu, sesuai dengan dorongan hawa nafsu mereka. Dengan demikian, hawa nafsu itu menjadi ukuran baik atau buruknya suatu perbuatan. Apa yang dianggap baik oleh hawa nafsu mereka, itulah yang mereka anggap baik. Hal-hal inilah yang memunculkan kemunafikan dalam diri mereka.",
      "text_translation": "Sesungguhnya orang-orang yang berbalik (kepada kekafiran) setelah petunjuk itu jelas bagi mereka, setanlah yang merayu mereka dan memanjangkan angan-angan mereka.",
      "text": "اِنَّ الَّذِيْنَ ارْتَدُّوْا عَلٰٓى اَدْبَارِهِمْ مِّنْۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى الشَّيْطٰنُ سَوَّلَ لَهُمْۗ وَاَمْلٰى لَهُمْ ",
      "text_translation_en": "VERILY, those who turn their backs [on this mes­sage] after guidance has been vouchsafed to them, [do it because] Satan has embellished their fancies and filled them with false hopes:",
      "juz_number": 26
    },
    "26": {
      "text_tafsir_en": "The hypocrites returned to unbelief, but at first they seemed to believe, because they favored and allied themselves with the Jews of the Children of Nadhir and the Children of Quraida in the fight against the believers. The hypocrites said that they would also fight on the side of the Bani Nadhir and the Children of Quraidzah against the Muslims if the Jews were expelled from Medinah. The Jews had once urged the hypocrites to show their infidelity openly. However, they do not comply with the proposal, except in some cases. Among the things they do not accept is the urge to openly declare disbelief. They keep it a secret because they are still trying to hide it by hiding it. However, God knows what they are doing, because there is nothing He does not know. In another verse, God describes the way in which they organize and deceive. Allah says: And they (hypocrites) say, \"(Our duty is only) obedient.\" But if they had gone from you (Muhammad, some of them) in the night-time other than what they had said before, Allah took note of what they had arranged that night, then turned away from them and trusted Allah. It is enough that Allah is the protector (an-Nisa '\/ 4: 81)",
      "text_tafsir": "Orang-orang munafik kembali kepada kekafiran, padahal tadinya mereka kelihatan telah beriman, karena mereka memihak dan bersekutu dengan orang Yahudi dari Bani Nadhir dan Bani Quraidzah untuk memerangi orang yang beriman. Kaum munafik menyatakan bahwa mereka akan turut berperang di pihak Bani Nadhir dan Bani Quraidzah menghadapi kaum Muslimin jika sekiranya suku Yahudi itu diusir dari Medinah. \n\nOrang Yahudi pernah menganjurkan kepada kaum munafik agar memperlihatkan kekafiran mereka dengan terang-terangan. Akan tetapi, mereka tidak mematuhi anjuran itu, kecuali dalam beberapa hal. Di antara yang tidak mereka patuhi adalah anjuran untuk menyatakan kekafiran dengan terus-terang. Kekafiran itu tetap mereka rahasiakan karena masih mengharapkan keuntungan dengan menyembunyikannya. Akan tetapi, Allah mengetahui tindakan yang mereka rahasiakan, karena tidak satu pun yang tidak diketahui-Nya. Dalam ayat lain, Allah menerangkan cara mereka mengatur siasat dan tipu dayanya. Allah berfirman:\n\nDan mereka (orang-orang munafik) mengatakan,\"(Kewajiban kami hanyalah) taat.\" Tetapi, apabila mereka telah pergi dari sisimu (Muhammad, sebagian dari mereka mengatur siasat di malam hari (mengambil keputusan) lain dari yang telah mereka katakan tadi. Allah mencatat siasat yang mereka atur di malam hari itu, maka berpalinglah dari mereka dan bertawakallah kepada Allah. Cukuplah Allah yang menjadi pelindung. (an-Nisa'\/4: 81)",
      "text_translation": "Yang demikian itu, karena sesungguhnya mereka telah mengatakan kepada orang-orang (Yahudi) yang tidak senang kepada apa yang diturunkan Allah, “Kami akan mematuhi kamu dalam beberapa urusan,” tetapi Allah mengetahui rahasia mereka.",
      "text": "ذٰلِكَ بِاَنَّهُمْ قَالُوْا لِلَّذِيْنَ كَرِهُوْا مَا نَزَّلَ اللّٰهُ سَنُطِيْعُكُمْ فِيْ بَعْضِ الْاَمْرِۚ وَاللّٰهُ يَعْلَمُ اِسْرَارَهُمْ ",
      "text_translation_en": "[they do turn their backs on it] inasmuch as they are wont to say unto those who abhor all that God has revealed, “We will comply with your views on some points.” But God knows their secret thoughts:",
      "juz_number": 26
    },
    "27": {
      "text_tafsir_en": "This verse still talks about hypocrites, what will they do if they remain in hypocrisy. They can only do hypocrisy and deception while they are still alive, powerful, and in a state of physical and spiritual health. What is their opinion if God removes their health immediately, and aging also approaches their lives? How their opinion at the time of death approached them and the angel of death struck their faces and backs; what will they do? What is their opinion if they die suddenly, so that there is not the slightest chance for them to repent to Allah who determines everything in the afterlife? If they think and contemplate all of that, surely they will not commit disbelief and sin. In this verse it is stated that when angels will take their lives, angels will expel their spirits forcefully and violently and hit their faces and backs. Arabs are very afraid of being hit on the face and back. Because they are afraid of being hit by the enemy in the face and back, they do not want to go to war. This verse shows the condition of hypocrites in a state of misery and humiliation when faced with death. Allah says: And if you see when angels take the lives of those who disbelieve while striking their faces and backs (al-Anfal \/ 8: 50)",
      "text_tafsir": "Ayat ini masih berbicara tentang kaum munafik, apakah yang akan mereka lakukan jika tetap berada dalam kemunafikan itu. Mereka hanya dapat melakukan kemunafikan dan tipu daya semasa mereka masih hidup, berkuasa, dan dalam keadaan sehat jasmani dan rohani. Bagaimana pendapat mereka bila Allah menghilangkan kesehatan mereka dengan seketika, dan ketuaan berangsur pula mendekati kehidupan mereka? Bagaimana pendapat mereka di waktu kematian mendekati mereka dan malaikat maut memukul muka dan punggung mereka; apakah yang akan mereka lakukan? Bagaimana pula pendapat mereka jika mereka mati dengan tiba-tiba, sehingga tidak ada kesempatan sedikit pun bagi mereka untuk bertobat kepada Allah yang menentukan segala sesuatu di akhirat? Jika mereka memikirkan dan merenungkan semuanya itu, tentu mereka tidak akan melakukan perbuatan ingkar dan dosa.\n\nDalam ayat ini disebutkan bahwa ketika malaikat akan mencabut nyawa mereka, malaikat akan mengeluarkan roh mereka dengan kuat dan kasar serta memukul wajah dan punggung mereka. Orang Arab amat takut dipukul di wajah dan punggung. Karena mereka takut dipukul musuh di wajah dan punggung, maka mereka tidak mau pergi berperang. Ayat ini menunjukkan keadaan orang-orang munafik dalam keadaan sengsara dan terhina pada waktu menghadapi sakaratul maut. Allah berfirman:\n\nDan sekiranya kamu melihat ketika para malaikat mencabut nyawa orang- orang yang kafir sambil memukul wajah dan punggung mereka (al-Anfal\/8: 50)",
      "text_translation": "Maka bagaimana (nasib mereka) apabila malaikat (maut) mencabut nyawa mereka, memukul wajah dan punggung mereka?",
      "text": "فَكَيْفَ اِذَا تَوَفَّتْهُمُ الْمَلٰۤىِٕكَةُ يَضْرِبُوْنَ وُجُوْهَهُمْ وَاَدْبَارَهُمْ ",
      "text_translation_en": "hence, how [will they fare] when the angels gather them in death, striking their faces and their backs?",
      "juz_number": 26
    },
    "28": {
      "text_tafsir_en": "They suffer from this condition because they often do evil, always disobey God, obey their desires, and refuse to do the work that He pleases. They worship God only because they are happy and want to be appreciated. Therefore, all charities they perform, such as giving and helping the poor, the poor, and the needy, are of no avail. Because good deeds and deeds are acceptable based on faith in God and His Messenger.",
      "text_tafsir": "Mereka mengalami keadaan yang demikian karena sering mengerjakan maksiat, selalu ingkar kepada Allah, menuruti hawa nafsu, dan tidak mau mengerjakan pekerjaan yang diridai-Nya. Mereka beribadah kepada Allah hanya karena ria dan ingin dihargai orang. Oleh karena itu, semua amal yang mereka kerjakan, seperti bersedekah dan menolong orang-orang yang lemah, miskin, dan sengsara, tidak ada guna dan faedahnya. Sebab, amal dan perbuatan baik yang dapat diterima bila didasari dengan iman kepada Allah dan Rasul-Nya.",
      "text_translation": "Yang demikian itu, karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah dan membenci (apa yang menimbulkan) keridaan-Nya; sebab itu Allah menghapus segala amal mereka.",
      "text": "ذٰلِكَ بِاَنَّهُمُ اتَّبَعُوْا مَآ اَسْخَطَ اللّٰهَ وَكَرِهُوْا رِضْوَانَهٗ فَاَحْبَطَ اَعْمَالَهُمْ ࣖ ",
      "text_translation_en": "This, because they were wont to pursue what God con­demns and to hate [whatever would meet with] His goodly acceptance: and so He has caused all their [good] deeds to come to nought.",
      "juz_number": 26
    },
    "29": {
      "text_tafsir_en": "Do the hypocrites think that in enmity, and the evil intentions of believers are hidden in their hearts? Do they think that God does not know it and that He does not reveal it to His Messenger and the believers? Allah, the Knower of all things, will tell His servants who believe in all their evil secrets. About the secrets and evil plans of the hypocrites is described at length in the Surah at-Taubah. Among them is the word of Allah: Hypocrites of men and women, one with another is (the same), they call evil (deeds) unlawful and prevents (acts) and they hold their hands. They have forgotten Allah, so Allah has forgotten them. Surely hypocrites are the wicked. (at-9\/9: 67)",
      "text_tafsir": "Apakah orang munafik mengira bahwa dalam permusuhan, dan niat jahat terhadap orang-orang yang beriman yang terpendam dalam hati mereka tidak akan diketahui? Apakah mereka mengira bahwa Allah tidak mengetahuinya sehingga Dia tidak memberitahukannya kepada Rasul-Nya dan orang-orang yang beriman? Allah Yang Maha Mengetahui segala sesuatu, akan memberitahukan kepada hamba-hamba-Nya yang beriman tentang semua rahasia jahat mereka.\n\nMengenai rahasia dan rencana jahat kaum munafik diterangkan panjang lebar dalam Surah at-Taubah. Di antaranya ialah firman Allah: \n\nOrang-orang munafik laki-laki dan perempuan, satu dengan yang lain adalah (sama), mereka menyuruh (berbuat) yang mungkar dan mencegah (perbuatan) yang makruf dan mereka menggenggamkan tangannya (kikir). Mereka telah melupakan Allah, maka Allah melupakan mereka (pula). Sesungguhnya orang-orang munafik itulah orang-orang yang fasik. (at-Taubah\/9: 67)",
      "text_translation": "Atau apakah orang-orang yang dalam hatinya ada penyakit mengira bahwa Allah tidak akan menampakkan kedengkian mereka?",
      "text": "اَمْ حَسِبَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ اَنْ لَّنْ يُّخْرِجَ اللّٰهُ اَضْغَانَهُمْ ",
      "text_translation_en": "Or do they in whose hearts is disease think, perchance, that God would never bring their moral failings to light?",
      "juz_number": 26
    },
    "30": {
      "text_tafsir_en": "In this verse, Allah declares to the Messenger of Allah (may peace be upon him), \"O Muhammad! , We do not, that their families who believe in us may not be harmed. However, you can recognize those hypocrites by paying attention to their expressions and ways of speaking. always used cues and sarcasm and metaphor, and they acted and acted in accordance with what they were saying. In the time of the Messenger of Allah, hypocrites used to speak words that were Al-Kalbi said, \"After this verse came down, the Messenger of Allah (may peace be upon him) said: know hypocrites when they talk to him. Whereas Anas ra says, \"Allah informed the hypocrites of the Messenger of Allah by means of a revelation or with the signs that he revealed to him.\" Concerning the hypocrites, 'Uthman bin' Affan said, \"There is no secret hidden in one's heart, except Allah shows it in his face and in his birth speech.\" At the end of this verse, God declares that the state of a believer is not the same as a hypocrite. He will reward the deeds of the believers according to their intentions and intentions, for Allah knows the deeds of their deeds.",
      "text_tafsir": "Pada ayat ini, Allah menyatakan kepada Rasulullah saw, \"Hai Muhammad, jika Kami menghendaki untuk memperkenalkan kepadamu pribadi-pribadi orang munafik itu sehingga kamu mengenal seorang demi seorang berdasarkan tanda-tanda yang ada pada mereka, tentulah tidak sukar bagi Kami melakukannya. Akan tetapi, Kami tidak berbuat demikian, agar keluarga mereka yang beriman kepada Kami tidak mereka aniaya. Sekalipun demikian, kamu dapat mengetahui orang-orang munafik itu dengan memperhatikan ungkapan-ungkapan dan cara-cara mereka berbicara. Mereka tidak mau berbicara secara tegas dan jelas, melainkan selalu memakai isyarat dan sindiran serta kiasan yang kurang jelas maksudnya, dan mereka berbuat dan bertindak tidak sesuai dengan apa yang mereka katakan.\n\nPada masa Rasulullah saw, orang munafik bila berbicara selalu menggunakan kata-kata yang muluk-muluk dan menyenangkan hati pendengarnya, tetapi dalam hati mereka terkandung maksud jahat. Al-Kalbi berkata, \"Setelah ayat ini turun, Rasulullah mengetahui orang-orang munafik bila mereka berbicara dengan beliau. Sedangkan Anas r.a. mengatakan, \"Allah memberitahukan orang-orang munafik kepada Rasulullah dengan perantara wahyu atau dengan tanda-tanda yang ditampakkannya kepada beliau.\"\n\nSehubungan dengan orang-orang munafik, 'Utsman bin 'Affan berkata, \"Tidak ada suatu rahasia yang tersembunyi dalam hati seseorang, kecuali Allah menampakkannya pada air muka dan ucapan lahirnya.\"\n\nPada akhir ayat ini, Allah menyatakan bahwa keadaan orang mukmin tidak sama dengan orang munafik. Dia akan membalas amal perbuatan orang mukmin sesuai dengan maksud dan niatnya masing-masing, karena Allah mengetahui amal perbuatan mereka.",
      "text_translation": "Dan sekiranya Kami menghendaki, niscaya Kami perlihatkan mereka kepadamu (Muhammad) sehingga engkau benar-benar dapat mengenal mereka dengan tanda-tandanya. Dan engkau benar-benar akan mengenal mereka dari nada bicaranya, dan Allah mengetahui segala amal perbuatan kamu.",
      "text": "وَلَوْ نَشَاۤءُ لَاَرَيْنٰكَهُمْ فَلَعَرَفْتَهُمْ بِسِيْمٰهُمْ ۗوَلَتَعْرِفَنَّهُمْ فِيْ لَحْنِ الْقَوْلِۗ وَاللّٰهُ يَعْلَمُ اَعْمَالَكُمْ ",
      "text_translation_en": "Now had We so willed, We could have shown them clearly to thee, so that thou wouldst know them for sure as by a visible mark: but [even so,] thou wilt most certainly recognize them by the tone of their voice. And God knows all that you do, [O men;]",
      "juz_number": 26
    },
    "31": {
      "text_tafsir_en": "With the provision of war and other heavy obligations, God tests the faith of the Muslims to determine who is fighting in his path and who is not, and who is patient and who is not. With such trials the faith of the patient will be strengthened and the faith of the skeptic will be diminished.",
      "text_tafsir": "Dengan adanya ketentuan perang dan kewajiban-kewajiban berat yang lain, Allah menguji keimanan kaum Muslimin hingga diketahui siapa yang berjihad di jalan-Nya dan siapa yang tidak, serta siapa yang sabar dan siapa yang tidak. Dengan cobaan itu pula akan bertambah kuat iman orang yang sabar dan makin berkurang iman orang yang ragu-ragu.",
      "text_translation": "Dan sungguh, Kami benar-benar akan menguji kamu sehingga Kami mengetahui orang-orang yang benar-benar berjihad dan bersabar di antara kamu; dan akan Kami uji perihal kamu.",
      "text": "وَلَنَبْلُوَنَّكُمْ حَتّٰى نَعْلَمَ الْمُجٰهِدِيْنَ مِنْكُمْ وَالصّٰبِرِيْنَۙ وَنَبْلُوَا۟ اَخْبَارَكُمْ ",
      "text_translation_en": "and most certainly We shall try you all, so that We might mark out those of you who strive hard [in Our cause] and are patient in adversity: for We shall put to a test [the truth of] all your assertions.",
      "juz_number": 26
    },
    "32": {
      "text_tafsir_en": "This verse explains that those who disobey Allah, prevent people from embracing his religion brought by Prophet Muhammad, oppose and oppose him when they are presented with strong evidence, then their actions will not cause harm to Allah and to the development of His religion because Almighty God and His will must be fulfilled. He helped his Messenger in the world and punished those who opposed him. In the future all their efforts will not succeed. \"People who hinder people in the way of God\" mentioned in this verse means those who block others from entering Islam in various ways. It can also mean people who are trying to destroy Islam and Muslims, both openly and secretly. It is narrated that this verse goes down to the Jews of the Children of Quraida and the Children of Nadhir. They prevent people from following the religion of Allah after coming to them the clear evidence found in the Torah and the miracles that the Messenger of Allah sent. Their actions will have little effect on God's plan and will, but will destroy themselves, with the failure of all their efforts, and the punishment they receive in the hereafter. This verse also relates to the Jews who obstructed the Bani Sa'ad who had embraced Islam, and then they reported it to Muhammad. He responded to the complaint with this verse, stating that the Jews' actions would not harm God, but would harm themselves.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang mengingkari keesaan Allah, menghalang-halangi manusia memeluk agama-Nya yang dibawa oleh Nabi Muhammad, menentang dan memeranginya setelah dikemukakan kepada mereka bukti-bukti yang kuat, maka segala tindakan mereka itu tidak akan menimbulkan mudarat kepada Allah dan kepada perkembangan agama-Nya karena Allah Mahakuasa dan kehendak-Nya pasti terlaksana. Dia menolong Rasul-Nya di dunia dan mengazab setiap orang yang menentang-Nya. Di akhirat segala usaha mereka itu tidak akan berhasil sedikit pun. \n\n\"Orang yang menghalang-halangi manusia di jalan Allah\" yang disebutkan dalam ayat ini maksudnya ialah orang-orang yang menghalangi orang lain masuk Islam dengan berbagai macam cara. Dapat juga berarti orang yang berusaha menghancurkan Islam dan kaum Muslimin, baik dengan terang-terangan maupun dengan sembunyi-sembunyi.\n\nDiriwayatkan bahwa ayat ini turun berhubungan dengan orang-orang Yahudi dari Bani Quraidzah dan Bani Nadhir. Mereka menghalang-halangi manusia menganut agama Allah setelah datang kepada mereka bukti-bukti yang nyata yang terdapat dalam Taurat dan mukjizat-mukjizat yang dikemukakan Rasulullah. Tindakan mereka itu tidak akan bermanfaat sedikit pun terhadap rencana dan kehendak Allah, tetapi malahan akan menghancurkan diri mereka sendiri, dengan kegagalan semua usaha mereka, dan azab yang mereka terima di akhirat. \n\nAyat ini juga berhubungan dengan orang-orang Yahudi yang menghalang-halangi Bani Sa'ad yang telah menganut agama Islam, lalu mereka mengadukan hal itu kepada Nabi Muhammad. Beliau menjawab pengaduan itu dengan ayat ini, yang menyatakan bahwa tindakan orang-orang Yahudi itu tidak akan memberi mudarat kepada Allah, tetapi akan merugikan diri mereka sendiri.",
      "text_translation": "Sesungguhnya orang-orang yang kafir dan menghalang-halangi (orang lain) dari jalan Allah serta memusuhi rasul setelah ada petunjuk yang jelas bagi mereka, mereka tidak akan dapat memberi mudarat (bahaya) kepada Allah sedikit pun. Dan kelak Allah menghapus segala amal mereka.",
      "text": "اِنَّ الَّذِيْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ وَشَاۤقُّوا الرَّسُوْلَ مِنْۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدٰى لَنْ يَّضُرُّوا اللّٰهَ شَيْـًٔاۗ وَسَيُحْبِطُ اَعْمَالَهُمْ ",
      "text_translation_en": "Verily, they who are bent on denying the truth and on barring [others] from the path of God, and [who thus] cut themselves off from the Apostle after guidance has been vouchsafed to them, can in no wise harm God; but He will cause all their deeds to come to nought.",
      "juz_number": 26
    },
    "33": {
      "text_tafsir_en": "In this verse, God asks believers to obey Him and His Messenger and ignore the attitudes and actions of unbelievers. They should believe, acknowledge the oneness and power of God who has perfect attributes, obey His commandments, carry out His teachings, and do not violate His commandments which results in the loss of the merit of their deeds. According to Abu al-'Aliyah, \"The Companions reasoned that no sin could break one's pledge that\" there is no God but God \", as there is no benefit to any charity based on Shirk until this verse is dropped. this, the friends worry, that their deeds will be nullified by an act of sin. \" Ibn 'Umar said, \"We are all companions of the Messenger of Allah (may peace be upon him) believe that good deeds will be accepted by Allah until this verse is revealed. And when one of us commits the sin (adultery) mentioned, we say, 'Verily, the reward of his deeds is taken away, until the verse goes down,' Surely Allah does not forgive the sins of those who associate with him, but he forgave other than those whom he desired, and after that we spoke no more. \" Some interpreters believe that to obey Allah is to practice the content of the Qur'an. Whereas the obedience to the Messenger was to follow and carry out all the commandments and prohibitions contained in his hadiths.",
      "text_tafsir": "Dalam ayat ini, Allah meminta orang-orang yang beriman agar taat kepada-Nya dan kepada Rasul-Nya serta tidak menghiraukan sikap dan tindakan orang-orang kafir. Mereka hendaknya beriman, mengakui keesaan dan kekuasaan Allah yang memiliki sifat-sifat yang sempurna, menaati perintah-Nya, melaksanakan ajaran-Nya, dan tidak melanggar perintah-Nya yang menyebabkan hilangnya pahala amal yang mereka kerjakan.\n\nMenurut Abu al-'Aliyah, \"Semula para sahabat berpendapat bahwa tidak ada satu dosa pun yang dapat merusak ikrar seseorang bahwa \"tidak ada Tuhan selain Allah\", sebagaimana tidak ada manfaat sesuatu amal yang didasarkan kepada syirik sampai ayat ini turun. Setelah turunnya ayat ini, para sahabat merasa khawatir, kalau-kalau amal-amal mereka akan batal karena suatu perbuatan dosa.\"\n\nIbnu 'Umar berkata, \"Kami semua sahabat Rasulullah saw berpendapat bahwa perbuatan baik akan diterima Allah sampai turunnya ayat ini. Setelah ayat ini turun, kami bertanya, 'Apa sajakah yang membatalkan pahala amal-amal kami? Maka Rasulullah menjawab, 'Dosa besar, perbuatan jahat, dan perbuatan keji. Setelah itu apabila salah seorang kami berbuat dosa (zina) yang disebutkan itu, kami berkata, 'Sesungguhnya telah terhapus pahala amalnya, sampai turun ayat yang artinya, 'Sesungguhnya Allah tidak mengampuni dosa orang yang mempersekutukan-Nya, tetapi mengampuni selain dari itu bagi siapa yang dikehendaki-Nya. Setelah itu kami tidak membicarakan tentang hal itu lagi.\"\n\nAda ahli tafsir yang berpendapat bahwa yang dimaksud dengan taat kepada Allah ialah mengamalkan isi Al-Qur'an. Sedangkan yang dimaksud dengan taat kepada Rasul ialah mengikuti dan melaksanakan semua perintah dan larangan yang terkandung dalam hadis-hadis beliau.",
      "text_translation": "Wahai orang-orang yang beriman! Taatlah kepada Allah dan taatlah kepada Rasul dan janganlah kamu merusakkan segala amalmu.",
      "text": "۞ يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اَطِيْعُوا اللّٰهَ وَاَطِيْعُوا الرَّسُوْلَ وَلَا تُبْطِلُوْٓا اَعْمَالَكُمْ",
      "text_translation_en": "O you who have attained to faith! Pay heed unto God, and pay heed unto the Apostle, and let not your [good] deeds come to nought!",
      "juz_number": 26
    },
    "34": {
      "text_tafsir_en": "This verse explains that those who disobey Allah's authority, disobey His messenger, obstruct mankind from His way, and then die in disbelief, then Allah will never forgive his sins because of the door of repentance and forgiveness God only existed when he was alive in the world. If a person is dead, then everything is covered for him. Some interpreters explain that this verse was revealed in connection with the infidels who died in the Battle of Badr who were buried in a well. Regardless of whether or not this opinion is correct, this verse applies to everyone where and whenever, that anyone who dies in a state of disbelief, God will not forgive his sins.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang yang mengingkari kekuasaan dan keesaan Allah, mengingkari seruan rasul-Nya, menghalang-halangi manusia dari jalan-Nya, kemudian ia mati dalam keadaan kafir, maka Allah sekali-kali tidak akan mengampuni dosa-dosanya karena pintu tobat dan ampunan Allah hanya ada sewaktu masih hidup di dunia. Jika seseorang telah mati, maka semuanya telah tertutup baginya.\n\nSebagian ahli tafsir menerangkan bahwa ayat ini diturunkan berhubungan dengan orang-orang kafir yang mati dalam Perang Badar yang dikubur dalam sebuah sumur. Lepas dari benar atau tidaknya pendapat itu, ayat ini berlaku bagi semua orang di mana dan kapan pun, bahwa setiap orang yang mati dalam keadaan kafir, tidak akan diampuni Allah dosa-dosanya.",
      "text_translation": "Sesungguhnya orang-orang yang kafir dan menghalang-halangi (orang lain) dari jalan Allah kemudian mereka mati dalam keadaan kafir, maka Allah tidak akan mengampuni mereka.",
      "text": "اِنَّ الَّذِيْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ ثُمَّ مَاتُوْا وَهُمْ كُفَّارٌ فَلَنْ يَّغْفِرَ اللّٰهُ لَهُمْ ",
      "text_translation_en": "Verily, as for those who are bent on denying the truth and on barring [others] from the path of God, and then die as deniers of the truth - indeed, God will not grant them forgiveness!",
      "juz_number": 26
    },
    "35": {
      "text_tafsir_en": "In this verse, Allah asks those who believe, when the command to carry out jihad has been issued and they know that Allah must help those who believe, they must feel strong, not discouraged, and never invite the enemy to make peace. They are people who believe that Muslims will get a high degree in the sight of Allah. Allah stays with them and will not reduce their reward in the slightest. Allah will not be with unbelievers, let alone help them, because they are in fact God's creatures who lower their own ranks.",
      "text_tafsir": "Dalam ayat ini, Allah meminta orang-orang yang beriman, bila perintah melaksanakan jihad sudah dikeluarkan dan mereka mengetahui bahwa Allah pasti menolong orang-orang yang beriman, mereka harus merasa kuat, tidak patah semangat, dan sekali-kali tidak mengajak musuh untuk berdamai. Mereka adalah orang-orang yang percaya bahwa umat Islam yang akan memperoleh derajat yang tinggi di sisi Allah. Allah tetap bersama mereka dan tidak akan mengurangi pahala mereka sedikit pun. Allah tidak akan bersama orang kafir, apalagi menolong mereka, karena mereka sebenarnya adalah makhluk Allah yang merendahkan derajatnya sendiri.",
      "text_translation": "Maka janganlah kamu lemah dan mengajak damai karena kamulah yang lebih unggul dan Allah (pun) beserta kamu dan Dia tidak akan mengurangi segala amalmu.",
      "text": "فَلَا تَهِنُوْا وَتَدْعُوْٓا اِلَى السَّلْمِۖ وَاَنْتُمُ الْاَعْلَوْنَۗ وَاللّٰهُ مَعَكُمْ وَلَنْ يَّتِرَكُمْ اَعْمَالَكُمْ ",
      "text_translation_en": "AND SO, [when you fight in a just cause,] do not lose heart and [never] beg for peace: for, seeing that God is with you, you are bound to rise high [in the end]; and never will He let your [good] deeds go to waste.",
      "juz_number": 26
    },
    "36": {
      "text_tafsir_en": "Allah encourages the believers to fight and plunder their way, to destroy the enemies of Allah and their enemies, the infidels of Mecca. They are never captivated by worldly life that causes them to abandon jihad because life is temporary, just a game, and a joke. Everything in this world will be lost, except for obedience and worship of God because obedience and worship are the reason for obtaining a true life in the hereafter. From this verse it can be understood that jihad in God's way includes acts of worship that show obedience and obedience to Him. Therefore, perform jihad as do other acts of worship. Furthermore, Allah declares that the act which can be the true preparation in the hereafter is to believe in Allah, to carry out all the commandments and to abstain from all His prohibitions, and to devote property in His way as taught by the Prophet Muhammad. The demands of the leased property are only a small portion of the income, not all, and are given as alms, alms, charities, and so forth. If they do that, God will reward them with the double reward of living peace in the world, and heaven in the hereafter.",
      "text_tafsir": "Allah mendorong orang-orang yang beriman agar berjihad dan menginfakkan harta di jalan-Nya, untuk menghancurkan musuh-musuh Allah dan musuh-musuh mereka, yaitu orang-orang kafir Mekah. Mereka jangan sekali-kali terpesona oleh kehidupan dunia yang menyebabkan mereka meninggalkan jihad karena kehidupan dunia hanyalah sementara, hanya sebagai permainan, dan senda gurau. Semua yang ada di dunia ini akan hilang lenyap, kecuali ketaatan dan ibadah kepada Allah karena ketaatan dan ibadah itu menjadi sebab untuk memperoleh kehidupan yang sebenarnya nanti di akhirat. Dari ayat ini dapat dipahami bahwa jihad di jalan Allah termasuk perbuatan ibadah yang menunjukkan ketaatan dan kepatuhan kepada-Nya. Oleh karena itu, lakukanlah jihad sebagaimana melakukan ibadah-ibadah yang lain.\n\nSelanjutnya Allah menyatakan bahwa perbuatan yang bisa menjadi persiapan yang sebenarnya di akhirat nanti ialah beriman kepada Allah, melaksanakan segala perintah dan menjauhkan semua larangan-Nya, dan meninfakkan harta di jalan-Nya sebagaimana yang diajarkan oleh Nabi Muhammad. Yang dituntut dari harta yang diinfakkan itu hanyalah sebagian kecil dari penghasilan, tidak semuanya, dan diberikan sebagai zakat, sedekah, amal jariah, dan sebagainya. Jika mereka melaksanakan yang demikian itu, Allah akan membalasnya dengan balasan yang berlipat ganda berupa ketenangan hidup di dunia, dan surga di akhirat.",
      "text_translation": "Sesungguhnya kehidupan dunia itu hanyalah permainan dan senda gurau. Jika kamu beriman serta bertakwa, Allah akan memberikan pahala kepadamu dan Dia tidak akan meminta hartamu.",
      "text": "اِنَّمَا الْحَيٰوةُ الدُّنْيَا لَعِبٌ وَّلَهْوٌ ۗوَاِنْ تُؤْمِنُوْا وَتَتَّقُوْا يُؤْتِكُمْ اُجُوْرَكُمْ وَلَا يَسْـَٔلْكُمْ اَمْوَالَكُمْ ",
      "text_translation_en": "The life of this world is but a play and a passing delight: but if you believe [in God] and are conscious of Him, He will grant you your deserts. And withal, He does not demand of you [to sacrifice in His cause all of] your possessions:",
      "juz_number": 26
    },
    "37": {
      "text_tafsir_en": "In this verse, God describes one of the most despicable human traits of being greedy and loving and longing for wealth. Allah declares that He does not ask them to give their all to give to the poor Muslims. If he had asked for everything like that, they would not have given it because they were too greedy for wealth and would not give it to the poor. Allah knows that. The more the request was repeated, the more resentment and envy they were toward the poor. That mindset has become a human habit. It is a trait that comes later, as God says: And peace is better (for them) even though man is in his natural habit. (an-Nisa '\/ 4: 128) Allah swt says: And whoever cares for himself, then they are the lucky ones. (al-hasyr \/ 59: 9) In another verse it is stated that if man can eliminate or diminish his mental state, then he will be the lucky man to live in this world and in the hereafter.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan salah satu dari sifat manusia yang tercela ialah kikir dan sangat mencintai dan menginginkan harta. Allah menyatakan bahwa Ia tidak minta mereka memberikan harta mereka seluruhnya untuk diberikan kepada kaum Muslimin yang lemah. Bila Ia meminta seluruhnya seperti itu, pasti mereka tidak akan memberikannya karena mereka terlalu tamak kepada harta dan tidak akan memberikannya kepada orang-orang miskin. Allah mengetahui yang demikian. Semakin sering permintaan itu diulang-ulang, semakin bertambah rasa benci dan dengki mereka terhadap orang miskin tersebut.\n\nSifat kikir itu telah menjadi tabiat manusia. Ia merupakan sifat yang didatangkan kemudian, sebagaimana firman Allah:\n\nDan perdamaian itu lebih baik (bagi mereka) walaupun manusia itu menurut tabiatnya kikir. (an-Nisa'\/4: 128)\n\nAllah swt berfirman:\n\nDan siapa yang dijaga dirinya dari kekikiran, maka mereka itulah orang- orang yang beruntung. (al-hasyr\/59: 9)\n\nDalam ayat yang lain dinyatakan jika manusia dapat menghilangkan atau mengurangi sifat kikirnya itu, maka ia akan menjadi orang yang beruntung hidup di dunia dan di akhirat.",
      "text_translation": "Sekiranya Dia meminta harta kepadamu lalu mendesak kamu (agar memberikan semuanya) niscaya kamu akan kikir dan Dia akan menampakkan kedengkianmu.",
      "text": "اِنْ يَّسْـَٔلْكُمُوْهَا فَيُحْفِكُمْ تَبْخَلُوْا وَيُخْرِجْ اَضْغَانَكُمْ ",
      "text_translation_en": "[for,] if He were to demand of you all of them, and urge you, you would niggardly cling [to them], and so He would [but] bring out your moral failings.",
      "juz_number": 26
    },
    "38": {
      "text_tafsir_en": "This verse explains that God is calling them to eliminate the senses. They are asked to put their property in the way of Allah. It is explained that those who think, do not want to spend their wealth in the way of God, then their mind will be at a disadvantage because it will disrupt the relationship in society and will erode their merit, distance themselves from God and heaven. When a man desires, it is not for God because He does not need their wealth, for He is mighty, and needs nothing. The impact is for their benefit because Allah will repay it twice, plus the reward is heaven. Then God threatened them by saying that if they turned away, that is, they did not believe and did not obey his commands by their love, then God would destroy them, and then replace them with other people who were not like them, those who would love, fight, to do His commandments, and to abstain from His prohibition. Narrated by al-Baihaqi, at-Tirmidhi and others from Abu Hurairah, saying: The Messenger of Allah (may peace be upon him) recited this verse to the end, then the Companions asked, \"O Messenger of Allah, who are those who if we turn away they will replace us and them not like us? \" Then the Prophet patted Salman's shoulder and said, \"This is his people and his people. For the sake of God I am in his hands, if the religion depends on the sun, it will be achieved by the people of Persia.\"",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah memanggil mereka untuk menghilangkan sifat kikir. Mereka diminta menginfakkan harta mereka di jalan Allah. Dijelaskan bahwa siapa yang kikir, tidak mau menafkahkan harta di jalan Allah, maka kekikiran mereka itu akan merugikan diri sendiri karena kikir itu akan mengganggu hubungan dalam masyarakat dan akan menghapuskan pahala mereka, menjauhkan diri mereka dari Allah dan surga. Bila manusia berinfak, itu bukan untuk Allah karena Ia tidak memerlukan harta mereka, sebab Dia Mahakaya, tidak memerlukan apa pun. Infak itu justru untuk keuntungan mereka karena Allah akan membalasnya berlipat ganda, ditambah lagi dengan pahala yang balasannya adalah surga.\n\nKemudian Allah mengancam mereka dengan mengatakan bahwa jika mereka berpaling, yaitu tidak beriman dan tidak mau memenuhi perintah-Nya dengan berinfak, maka Allah akan menghancurkan mereka, kemudian mengganti mereka dengan kaum yang lain yang tidak seperti mereka, yaitu kaum yang mau berinfak, berjihad, melaksanakan perintah-Nya, dan menjauhi larangan-Nya.\n\nDiriwayatkan oleh al-Baihaqi, at-Tirmidhi dan lain-lainnya dari Abu Hurairah berkata: \n\nRasulullah saw membaca ayat ini sampai akhir, maka para sahabat bertanya, \"Ya Rasulullah, siapakah orang-orang itu yang jika kami berpaling mereka akan menggantikan kami dan mereka tidak seperti kami?\" Maka Rasulullah menepuk pundak Salman, kemudian berkata, \"Inilah orangnya dan kaumnya. Demi Allah yang diriku di tangan-Nya, seandainya agama itu tergantung di bintang surayya, itu akan digapai oleh orang-orang dari Persia.\"",
      "text_translation": "Ingatlah, kamu adalah orang-orang yang diajak untuk menginfakkan (hartamu) di jalan Allah. Lalu di antara kamu ada orang yang kikir, dan barangsiapa kikir maka sesungguhnya dia kikir terhadap dirinya sendiri. Dan Allah-lah Yang Mahakaya dan kamulah yang membutuhkan (karunia-Nya). Dan jika kamu berpaling (dari jalan yang benar) Dia akan menggantikan (kamu) dengan kaum yang lain, dan mereka tidak akan (durhaka) seperti kamu (ini).",
      "text": "هٰٓاَنْتُمْ هٰٓؤُلَاۤءِ تُدْعَوْنَ لِتُنْفِقُوْا فِيْ سَبِيْلِ اللّٰهِۚ فَمِنْكُمْ مَّنْ يَّبْخَلُ ۚوَمَنْ يَّبْخَلْ فَاِنَّمَا يَبْخَلُ عَنْ نَّفْسِهٖ ۗوَاللّٰهُ الْغَنِيُّ وَاَنْتُمُ الْفُقَرَاۤءُ ۗ وَاِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْۙ ثُمَّ لَا يَكُوْنُوْٓا اَمْثَالَكُمْ ࣖ ",
      "text_translation_en": "Behold, [O believers,] it is you who are called upon to spend freely in God’s cause: but [even] among you are such as turn out to be niggardly! And yet, he who acts niggardly [in God’s cause] is but niggardly towards his own self: for God is indeed self-sufficient, whereas you stand in need [of Him]; and if you turn away [from Him], He will cause other people to take your place, and they will not be the likes of you!",
      "juz_number": 26
    }
  },
  "name": "محمّد",
  "name_translation_en": "Muhammad",
  "name_translation": "Muhammad",
  "name_latin": "Muhammad"
}