{
  "number": 49,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 18,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, Allah teaches the polity to the Muslims in dealing with the Messenger of Allah in matters of speech and speech. Allah warns the believers not to go ahead of Allah and His Messenger in deciding a law or opinion. They are not allowed to decide a matter before discussing and reviewing the law of God and (or) the provision of His apostles on the matter. It is intended that their decisions should not be misplaced or contrary to Islamic law, which could result in God's wrath. This is in line with the experience of the Prophet Muhammad's friend Mu'adh bin Jabal when he was sent to Yemen. The Messenger of Allah (may peace be upon him) asked, \"What will you decide?\" The Mu'adh replied, \"By the book of Allah.\" The Prophet asked again, \"If you do not find in the book of God, how?\" Mu'adh replied, \"With the Sunah of the Prophet.\" Prophet Muhammad again asked, \"If you do not find in the Sunnah of the Messenger of Allah, how?\" The Mu'adh replied, \"I will fulfill my mind.\" Then the Prophet Muhammad (peace be upon him) patted Mu'adh's chest and said, \"All praise be to Allah, who has spoken to His messenger about what Allah and His Messenger (peace and blessings be upon him) agree to.\" (History of Abu Dawud, at-Tirmidhi and Ibn Majah of Mu'adh bin Jabal). In this verse, Allah instructs the believers to obey Allah's commands, abstain from His prohibitions, and do not rush to act or express their opinions by preceding the Qur'an and the Prophet's hadiths related to the origin of this verse. It is stated in the book of al-Iklil that they were forbidden to offer sacrifices on Eid al-Adha before slaughtering the prophets, and fasting was not allowed on the day of doubt, as to whether or not Ramadan had arrived, before the fulfillment of the Jtihad for its setting. Then Allah commanded them to hold their allegiance to Him because Allah is All-Hearing and All-Knowing in the Hearts of His servants.",
      "text_tafsir": "Pada ayat ini, Allah mengajarkan kesopanan kepada kaum Muslimin ketika berhadapan dengan Rasulullah saw dalam hal perbuatan dan percakapan. Allah memperingatkan kaum Mukminin supaya jangan mendahului Allah dan rasul-Nya dalam menentukan suatu hukum atau pendapat.\n\nMereka dilarang memutuskan suatu perkara sebelum membahas dan meneliti lebih dahulu hukum Allah dan (atau) ketentuan dari rasul-Nya terhadap masalah itu. Hal ini bertujuan agar keputusan mereka tidak menyalahi apalagi bertentangan dengan syariat Islam, sehingga dapat menimbulkan kemurkaan Allah. \n\nYang demikian ini sejalan dengan yang dialami oleh sahabat Nabi Muhammad yaitu Mu'adh bin Jabal ketika akan diutus ke negeri Yaman. Rasulullah saw bertanya, \"Kamu akan memberi keputusan dengan apa?\" Dijawab oleh Mu'adh, \"Dengan kitab Allah.\" Nabi bertanya lagi, \"Jika tidak kamu jumpai dalam kitab Allah, bagaimana?\" Mu'adh menjawab, \"Dengan Sunah Rasulullah.\" Nabi Muhammad bertanya lagi, \"Jika dalam Sunah Rasulullah tidak kamu jumpai, bagaimana?\" Mu'adh menjawab, \"Aku akan ijtihad dengan pikiranku.\" Lalu Nabi Muhammad saw menepuk dada Mu'adh seraya berkata, \"Segala puji bagi Allah yang telah memberi taufik kepada utusan rasul-Nya tentang apa yang diridai Allah dan rasul-Nya.\" (Riwayat Abu Dawud, at-Tirmidhi dan Ibnu Majah dari Mu'adh bin Jabal). \n\nDalam ayat ini, Allah memerintahkan kepada kaum Mukminin supaya melaksanakan perintah Allah, menjauhi larangan-Nya, dan tidak tergesa-gesa melakukan perbuatan atau mengemukakan pendapat dengan mendahului Al-Qur'an dan hadis Nabi yang ada hubungannya dengan sebab turunnya ayat ini. Tersebut dalam kitab al-Iklil bahwa mereka dilarang menyembelih kurban pada hari Raya Idul Adha sebelum nabi menyembelih, dan dilarang berpuasa pada hari yang diragukan, seperti apakah telah datang awal Ramadan atau belum, sebelum jelas hasil ijtihad untuk penetapannya. Kemudian Allah memerintahkan supaya mereka tetap bertakwa kepada-Nya karena Allah Maha Mendengar segala percakapan dan Maha Mengetahui segala yang terkandung dalam hati hamba-hamba-Nya.",
      "text_translation": "Wahai orang-orang yang beriman! Janganlah kamu mendahului Allah dan Rasul-Nya dan bertakwalah kepada Allah. Sungguh, Allah Maha Mendengar, Maha Mengetahui.",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تُقَدِّمُوْا بَيْنَ يَدَيِ اللّٰهِ وَرَسُوْلِهٖ وَاتَّقُوا اللّٰهَ ۗاِنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌ ",
      "text_translation_en": "O YOU who have attained to faith! Do not put yourselves forward in the presence of [what] God and His Apostle [may have ordained], but remain conscious of God: for, verily, God is all-hearing, all-knowing!",
      "juz_number": 26
    },
    "2": {
      "text_tafsir_en": "It is narrated by al-Bukhari of Ibn Abi Initially that 'Abdullah bin Zubair informed him that a troupe from the Children of the Tamils had come to the Messenger of Allah. Abu Bakr said, \"This troupe should be led by al-Qa'qa 'bin Ma'bad.\" 'Umar bin al-Khaththab said, \"It must be led by al-Aqra' bin expired.\" Abu Bakr protested, \"You mean nothing but against me.\" 'Umar replied, \"I do not mean to oppose you.\" Then there was a disagreement between Abu Bakr and 'Umar so that their voices were heard louder, so this verse went down. Since then, Abu Bakr when speaking to the Prophet Muhammad, his voice was reduced to a whisper as well as' Umar. Because his voice was so soft he almost didn't hear it and was often asked what he was saying. They both understood that these verses were meant to be used to preserve the honor of the Prophet Muhammad. After this verse was dropped, the sickle of the Qais never came again to attend the assembly of the Messenger of Allah. When asked by the Prophet why, he replied, \"O Messenger of Allah, this verse has been passed down and I am a very talkative and loud person. I am worried that my reward will be removed as a result of that habit.\" Prophet Muhammad replied, \"You are different, you live in goodness and God willing to die in goodness, you belong to heaven.\" sickle replied, \"I am very pleased with the good news, and I will not raise my voice to the Prophet for ever.\" (History of al-Bukhari from Ibn Abi's Beginning). Then the next verse is verse 3 of Surah al-hujurat. From the above view, it is possible to understand how God taught the believers the correctness of conversation in the face of the Prophet Muhammad. Allah forbid the believers to raise their voices above the Prophet's voice. They are forbidden to speak to the Prophet aloud because such acts are not morally right and can offend the Prophet. Particularly if in the rude remarks are stored elements of contempt or contempt that offend the Prophet and can drag and enlighten his people to disbelief, resulting in the loss and fall of all their merits in the past, when all this happened without realizing it. .",
      "text_tafsir": "Diriwayatkan oleh al-Bukhari dari Ibnu Abi Mulaikah bahwa 'Abdullah bin Zubair memberitahukan kepadanya bahwa telah datang satu rombongan dari Kabilah Bani Tamim kepada Rasulullah saw. Abu Bakar berkata, \"Rombongan ini hendaknya diketuai oleh al-Qa'qa' bin Ma'bad.\" 'Umar bin al-Khaththab berkata, \"Hendaknya diketuai oleh al-Aqra' bin habis.\" Abu Bakar membantah, \"Kamu tidak bermaksud lain kecuali menentang aku.\" 'Umar menjawab, \"Saya tidak bermaksud menentangmu.\" Maka timbullah perbedaan pendapat antara Abu Bakar dan 'Umar sehingga suara mereka kedengarannya bertambah keras, maka turunlah ayat ini. Sejak itu, Abu Bakar bila berkata-kata kepada Nabi Muhammad, suaranya direndahkan sekali seperti bisikan saja demikian pula 'Umar. Oleh karena sangat halus suaranya hampir-hampir tak terdengar sehingga sering ditanyakan lagi apa yang diucapkannya itu.\n\nMereka sama-sama memahami bahwa ayat-ayat tersebut sengaja diturunkan untuk memelihara kehormatan Nabi Muhammad. Setelah ayat ini turun, maka sabit bin Qais tidak pernah datang lagi menghadiri majelis Rasulullah saw. Ketika ditanya oleh Nabi tentang sebabnya, sabit menjawab, \"Ya Rasulullah, telah diturunkan ayat ini dan saya adalah seorang yang selalu berbicara keras dan nyaring. Saya merasa khawatir kalau-kalau pahala saya akan dihapus sebagai akibat kebiasaan saya itu.\" Nabi Muhammad menjawab, \"Engkau lain sekali, engkau hidup dalam kebaikan dan insya Allah akan mati dalam kebaikan pula, engkau termasuk ahli surga.\" sabit menjawab, \"Aku sangat senang karena berita yang menggembirakan itu, dan saya tidak akan mengeraskan suara saya terhadap Nabi untuk selama-lama-nya.\" (Riwayat al-Bukhari dari Ibnu Abi Mulaikah). Maka turunlah ayat berikutnya yaitu ayat ke 3 dari Surah al-hujurat. \n\nDari paparan di atas, dapat dipahami bagaimana Allah mengajarkan kepada kaum Mukminin kesopanan dalam percakapan ketika berhadapan dengan Nabi Muhammad. Allah melarang kaum Mukminin meninggikan suara mereka lebih dari suara Nabi. Mereka dilarang untuk berkata-kata kepada Nabi dengan suara keras karena perbuatan seperti itu tidak layak menurut kesopanan dan dapat menyinggung perasaan Nabi. Terutama jika dalam ucapan-ucapan yang tidak sopan itu tersimpan unsur-unsur cemoohan atau penghinaan yang menyakitkan hati Nabi dan dapat menyeret serta menjerumuskan orangnya kepada kekafiran, sehingga mengakibatkan hilang dan gugurnya segala pahala kebaikan mereka itu di masa lampau, padahal semuanya itu terjadi tanpa disadarinya.",
      "text_translation": "Wahai orang-orang yang beriman! Janganlah kamu meninggikan suaramu melebihi suara Nabi, dan janganlah kamu berkata kepadanya dengan suara keras sebagaimana kerasnya (suara) sebagian kamu terhadap yang lain, nanti (pahala) segala amalmu bisa terhapus sedangkan kamu tidak menyadari. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَرْفَعُوْٓا اَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوْا لَهٗ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ اَنْ تَحْبَطَ اَعْمَالُكُمْ وَاَنْتُمْ لَا تَشْعُرُوْنَ ",
      "text_translation_en": "O you who have attained to faith! Do not raise your voices above the voice of the Prophet, and neither speak loudly to him, as you would speak loudly to one another, lest all your [good] deeds come to nought without your perceiving it.",
      "juz_number": 26
    },
    "3": {
      "text_tafsir_en": "Indeed, those who lowered their voices on the side of the Messenger of Allah (may peace be upon him) after training them in a variety of rigorous training, they were the ones whom Allah had tried to prove. They have succeeded in purifying themselves with a great deal of effort and awareness and for them great forgiveness and reward. Imam Ahmad, from the Mujahid, reported that a written question was conveyed to Umar, \"O Amirul Mukminin, there is a man who does not like the act and does not do it, and another man whose heart tends to the act, but he does not Which of the two is the best? \" Umar also wrote in the inscription, \"Verily the people of the heart are inclined to transgression, but they do not do it; they are those whom God has tempted them to fear. For them forgiveness and great reward.\"",
      "text_tafsir": "Sesungguhnya orang yang merendahkan suaranya di sisi Rasulullah saw setelah melatih diri dengan berbagai latihan yang ketat lagi berat, mereka itulah orang yang telah diuji hatinya oleh Allah untuk bertakwa. Mereka telah berhasil menyucikan diri mereka dengan berbagai usaha dan kesadaran serta bagi mereka ampunan dan pahala yang sangat besar.\n\nDiriwayatkan oleh Imam Ahmad dari Mujahid bahwa ada sebuah pertanyaan tertulis yang disampaikan kepada Umar, \"Wahai Amirul Mukminin, ada seorang laki-laki yang tidak suka akan kemaksiatan dan tidak mengerjakannya, dan seorang laki-laki lagi yang hatinya cenderung kepada kemaksiatan, tetapi ia tidak mengerjakannya. Manakah di antara kedua orang itu yang paling baik?\"\n\nUmar menjawab dengan tulisan pula, \"Sesungguhnya orang ya-ng hatinya cenderung kepada kemaksiatan, akan tetapi tidak mengerjakannya, mereka itulah orang-orang yang telah diuji hati mereka oleh Allah untuk bertakwa. Bagi mereka ampunan dan pahala yang besar.\"",
      "text_translation": "Sesungguhnya orang-orang yang merendahkan suaranya di sisi Rasulullah, mereka itulah orang-orang yang telah diuji hatinya oleh Allah untuk bertakwa. Mereka akan memperoleh ampunan dan pahala yang besar.",
      "text": "اِنَّ الَّذِيْنَ يَغُضُّوْنَ اَصْوَاتَهُمْ عِنْدَ رَسُوْلِ اللّٰهِ اُولٰۤىِٕكَ الَّذِيْنَ امْتَحَنَ اللّٰهُ قُلُوْبَهُمْ لِلتَّقْوٰىۗ  لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ عَظِيْمٌ ",
      "text_translation_en": "Behold, they who lower their voices in the presence of God’s Apostle - it is they whose hearts God has tested [and opened] to consciousness of Himself; [and] theirs shall be forgiveness and a reward supreme.",
      "juz_number": 26
    },
    "4": {
      "text_tafsir_en": "In this verse, Allah gives lessons of decency and manners in facing the Messenger of Allah, especially in conversation with him. The Messenger of Allah (may peace be upon him) while in Medinah lived in a house next to Medinah mosque. In the house were nine rooms, each filled with a prophet's wife. The building was so simple, the roof was so low that it was easy to touch by the hands and the doors consisted of a feathered animal hanger. At the time of Caliph al-Walid bin 'Abd al-Malik, the rooms were demolished and turned into a mosque. It is very sad for the believers in Medinah. Sa'id bin al-Musayyab responded and said, \"I would love to have the Prophet's wives stand and not be reformed, so that future generations of the people of Medinah and those who come will be able to reflect on the simplicity of Prophet Muhammad in organizing his household. Ibn Ishaq explains in his book of Sirah that the ninth year of the Hijrah was the year in which delegates from all over the Arabian Peninsula came. Ibn Jarir, of Zaid bin Arqam, reported that a group of Bedouins said to his companions, \"Let us meet the man, if he is a prophet, then we will be the happiest with him, and if he is a king, then we shall be able to live with him. \" qam to the Messenger of Allah (may peace be upon him) relay the news and many came to meet him who happened to be in the room of one of his wives. They called out in a loud voice, \"O Muhammad, yes Muhammad, come out of your room to meet us because our purpose is so beautiful and our reproach is very strong.\" The Prophet Muhammad came out of his wife's room to meet them and dropped this verse. According to the Qatadah, the group of seventy people was from the tribe of Bani Tamim. They said, \"We are from the Children of Tamim, we have come here to bring our poets in poetry and speech to compete with your poets.\" The Prophet replied, \"We are not sent to make poetry and we are not sent to show arrogance, but if you want to try, you can bring it.\" Then one of the young men appeared to be proud of his people with many priorities. The Prophet Muhammad showed the hassan bin sickle to answer their poetry and it turns out that hassan subjugated them all. After acknowledging the supremacy of hassan, they approached the Messenger of Allah (may peace be upon him) and recited two verses of the confession and at once converted to Islam. The wisdom of the Prophet Muhammad in dealing with the dishonest da-ri delegation of the Bani Tamim eventually ended well. Before returning home, they had first come to a clue about the right path and civility in the community. Allah explicitly states that those who called upon the Prophet to leave his wife's room next to the Medina mosque, most of them ignorant, did not know the decency and manners of making a courtesy visit to a head of state or even a prophet. The procedure presented in this paragraph, now known as protocol and security. From this verse it can be understood that Islam has long regulated its code of conduct with the aim of giving due respect to the visiting dignitaries.",
      "text_tafsir": "Dalam ayat ini, Allah memberikan pelajaran kesopanan dan tata krama dalam menghadapi Rasulullah saw, terutama dalam mengadakan percakapan dengan beliau. Rasulullah saw selama di Medinah tinggal di sebuah rumah di samping masjid Medinah. Di dalam rumah itu terdapat kamar-kamar yang berjumlah sembilan buah, dan masing-masing diisi oleh seorang istri nabi. Bangunan tersebut dibuat sangat sederhana, atapnya rendah sekali sehingga mudah disentuh oleh tangan dan pintu-pintunya terdiri dari gantungan kulit binatang yang berbulu. \n\nPada masa Khalifah al-Walid bin 'Abd al-Malik, kamar-kamar itu dibongkar dan dijadikan halaman masjid. Hal itu sangat menyedihkan kaum Mukminin di Medinah. Sa'id bin al-Musayyab merespon dan berkata, \"Saya suka sekali jika kamar-kamar istri Nabi itu tetap berdiri dan tidak dirombak, agar generasi mendatang dari penduduk Medinah dan orang-orang yang datang dapat meneladani kesederhanaan Nabi Muhammad dalam mengatur rumah tangganya.\n\nIbnu Ishaq menerangkan dalam kitab Sirah-nya bahwa tahun kesembilan Hijrah itu merupakan tahun mengalirnya para delegasi dari seluruh Jazirah Arab. Setelah Pembebasan Mekah, seusai Perang Tabuk, dan Kabilah saqif dari thaif masuk Islam dan ikut membaiat Rasulullah saw, maka datanglah dengan berduyun-duyun berbagai delegasi ke Medinah untuk menemui Rasulullah saw.\n\nDiriwayatkan oleh Ibnu Jarir, dari Zaid bin Arqam bahwa sekumpulan orang-orang Badui berkata kepada kawan-kawannya, \"Marilah kita menemui laki-laki (Muhammad) itu, apabila ia benar-benar seorang nabi, maka kitalah yang paling bahagia beserta dia, dan jika ia seorang raja maka kita pun akan beruntung dapat hidup di sampingnya.\" Maka datanglah Zaid bin Arqam kepada Rasulullah saw menyampaikan berita itu lalu mere-ka datang beramai-ramai menemui beliau yang kebetulan sedang berada di kamar salah seorang istrinya. Mereka memanggil dengan suara yang lantang sekali, \"Ya Muhammad, ya Muhammad, keluarlah dari kamarmu untuk berjumpa dengan kami karena tujuan kami sangat indah dan celaan kami sangat menusuk perasaan.\" Nabi Muhammad saw keluar dari kamar istrinya untuk menemui mereka dan turunlah ayat ini. \n\nMenurut Qatadah, rombongan sebanyak tujuh puluh orang itu adalah dari kabilah Bani Tamim. Mereka berkata, \"Kami ini dari Bani Tamim, kami datang ke sini membawa pujangga-pujangga kami dalam bidang syair dan pidato untuk bertanding dengan penyair-penyair kamu.\" Nabi menjawab, \"Kami tidak diutus untuk mengemukakan syair dan kami tidak diutus untuk mem-perlihatkan kesombongan, tetapi bila kamu mau mencoba, boleh kemukakan syairmu itu.\" Maka tampillah salah seorang pemuda di antara mereka membangga-banggakan kaumnya dengan berbagai keutamaan. Nabi Muhammad menampilkan hassan bin sabit untuk menjawab syair mereka dan ternyata hassan dapat menundukkan mereka semuanya. Setelah mereka mengakui keunggulan hassan, mereka lalu mendekati Rasulullah saw dan mengucapkan dua kalimat syahadat dan sekaligus masuk Islam.\n\nKebijaksanaan Nabi Muhammad dalam menghadapi delegasi da-ri Bani Tamim yang tidak sopan itu akhirnya berkesudahan dengan baik. Sebelum pulang, mereka lebih dahulu telah men-dapat petunjuk tentang jalan yang benar dan kesopanan dalam pergaulan. Dengan tegas sekali Allah menerangkan bahwa orang-orang yang memanggil Nabi supaya keluar kamar istrinya yang ada di samping masjid Medinah, kebanyakan mereka itu bodoh, tidak mengetahui kesopanan dan tata krama dalam mengadakan kunjungan kehormatan kepada seorang kepala negara apalagi seorang nabi. Tata cara yang dikemukakan ayat ini, sekarang dikenal sebagai protokoler dan security (keamanan). Dari ayat ini dapat pula dipahami bahwa agama Islam sejak dahulu kala sudah mengatur kode etiknya dengan maksud memberikan penghormatan yang pantas kepada pembesar yang dikunjungi.",
      "text_translation": "Sesungguhnya orang-orang yang memanggil engkau (Muhammad) dari luar kamar(mu) kebanyakan mereka tidak mengerti. ",
      "text": "اِنَّ الَّذِيْنَ يُنَادُوْنَكَ مِنْ وَّرَاۤءِ الْحُجُرٰتِ اَكْثَرُهُمْ لَا يَعْقِلُوْنَ ",
      "text_translation_en": "Verily, [O Prophet,] as for those who call thee from without thy private apartments - most of them do not use their reason:",
      "juz_number": 26
    },
    "5": {
      "text_tafsir_en": "If the delegates did not cry out to the Prophet Muhammad and they waited patiently until he left the rest room, it would have been better for them. Because of this attitude it shows a great deal of respect and honor to the Prophet Muhammad. Allah is Oft-forgiving to those who call upon the Prophet Muhammad from the back of his chambers when they repent and replace their carelessness with decency. Allah is Merciful to them, not to punish them on the Day of Judgment because they have repented of their shameful deeds.",
      "text_tafsir": "Seandainya tamu-tamu delegasi itu tidak berteriak-teriak memanggil Nabi Muhammad dan mereka sabar menunggu sampai beliau sendiri keluar kamar peristirahatannya, niscaya yang demikian itu lebih baik bagi mereka. Karena sikap demikian itu menunjukkan adanya takzim dan penghormatan kepada Nabi Muhammad. Allah Maha Pengampun kepada mereka yang memanggil Nabi Muhammad dari belakang kamar-kamarnya bila mereka bertobat dan mengganti kecerobohan mereka dengan kesopanan tata krama. Allah Maha Penyayang kepada mereka, tidak mengazab mereka nanti pada hari Kiamat karena mereka telah menyesali perbuatan mereka yang memalukan itu.",
      "text_translation": "Dan sekiranya mereka bersabar sampai engkau keluar menemui mereka, tentu akan lebih baik bagi mereka. Dan Allah Maha Pengampun, Maha Penyayang. ",
      "text": "وَلَوْ اَنَّهُمْ صَبَرُوْا حَتّٰى تَخْرُجَ اِلَيْهِمْ لَكَانَ خَيْرًا لَّهُمْ ۗوَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
      "text_translation_en": "for, if they had the patience [to wait] until thou come forth to them [of thine own accord], it would be for their own good. Still, God is much forgiving, a dispenser of grace.",
      "juz_number": 26
    },
    "6": {
      "text_tafsir_en": "In this verse, Allah warns the believers that if a wicked person brings news of anything to them, they will not rush to receive the news before they are examined and examined for the truth. Before a careful study, do not be quick to believe the news of the wicked, because one who does not care about his evil will not pay attention to the lies he tells. The need to be careful about receiving news is to avoid regret over unscheduled news or fake news. The regret that may arise can be avoided by being more careful. This verse provides guidance for all believers to be careful about receiving the news, especially when it comes from an evil person. The purpose of this verse is to conduct a preliminary examination of its truthfulness. Believing in a news story without any investigation of its truth, it is likely to lead to loss of lives and worthless possessions, which only lead to regret.",
      "text_tafsir": "Dalam ayat ini, Allah memberitakan peringatan kepada kaum Mukminin, jika datang kepada mereka seorang fasik membawa berita tentang apa saja, agar tidak tergesa-gesa menerima berita itu sebelum diperiksa dan diteliti dahulu kebenarannya. Sebelum diadakan penelitian yang seksama, jangan cepat percaya kepada berita dari orang fasik, karena seorang yang tidak mempedulikan kefasikannya, tentu juga tidak akan mempedulikan kedustaan berita yang disampaikannya. Perlunya berhati-hati dalam menerima berita adalah untuk menghindarkan penyesalan akibat berita yang tidak diteliti atau berita bohong itu. Penyesalan yang akan timbul sebenarnya dapat dihindari jika bersikap lebih hati-hati.\n\nAyat ini memberikan pedoman bagi sekalian kaum Mukminin supaya berhati-hati dalam menerima berita, terutama jika bersumber dari seorang yang fasik. Maksud yang terkandung dalam ayat ini adalah agar diadakan penelitian dahulu mengenai kebenarannya. Mempercayai suatu berita tanpa diselidiki kebenarannya, besar kemungkinan akan membawa korban jiwa dan harta yang sia-sia, yang hanya menimbulkan penyesalan belaka.",
      "text_translation": "Wahai orang-orang yang beriman! Jika seseorang yang fasik datang kepadamu membawa suatu berita, maka telitilah kebenarannya, agar kamu tidak mencelakakan suatu kaum karena kebodohan (kecerobohan), yang akhirnya kamu menyesali perbuatanmu itu. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنْ جَاۤءَكُمْ فَاسِقٌۢ بِنَبَاٍ فَتَبَيَّنُوْٓا اَنْ تُصِيْبُوْا قَوْمًاۢ بِجَهَالَةٍ فَتُصْبِحُوْا عَلٰى مَا فَعَلْتُمْ نٰدِمِيْنَ ",
      "text_translation_en": "O YOU who have attained to faith! If any iniquitous person comes to you with a [slanderous] tale, use your discernment, lest you hurt people unwittingly and afterwards be filled with remorse for what you have done.",
      "juz_number": 26
    },
    "7": {
      "text_tafsir_en": "Allah explained that the Messenger of Allah (may peace be upon him) when he was in the midst of the believers, should have been respected and followed all his instructions for knowing the good of his people. Prophet is more important to the believers than themselves, as stated in the word of Allah: It is more important to the believers than themselves (al-Ahzab \/ 33: 6) Because the Prophet Muhammad was always under the guidance of Divine revelation , then he who was in the midst of the companions should be exemplified in all aspects of life and the community. If he had obeyed the friends 'resolve to solve the question of life, they would have encountered many difficulties and harms as in the events of al-Walid bin' Uqbah. If the Prophet (peace and blessings be upon him) received the news of the Bani al-Musthaliq, and sent his troops to attack those who were considered apostate and refused to pay zakat, that would only cause regret and disaster. However, contrary to the wisdom and guidance of the Messenger of Allah (may peace be upon him) among their companions, Allah made them love the faith and make the faith beautiful in their hearts, and made them hate unbelief, fascination and rebellion. Because perfect faith consists of verbal acknowledgment, justification of the heart, and good works with the members of the body, hatred for unbelief is contrary to the love of faith. Making the faith beautiful in the heart is a paradox by justifying (tasdiq) in the heart, and hating it in parallel with the practice of righteousness. Such are those who are guided and follow the straight path, which leads straight to the will of God.",
      "text_tafsir": "Allah menjelaskan bahwa Rasulullah saw ketika berada di tengah-tengah kaum Mukminin, sepatutnya dihormati dan diikuti semua petunjuknya karena lebih mengetahui kemaslahatan umatnya. Nabi lebih utama bagi orang-orang Mukmin dari diri mereka sendiri, sebagaimana dicantumkan dalam firman Allah:\n\nNabi itu lebih utama bagi orang-orang Mukmin dibandingkan diri mereka sendiri (al-Ahzab\/33: 6)\n\nKarena Nabi Muhammad selalu berada dalam bimbingan wahyu Ilahi, maka beliau yang berada di tengah-tengah para sahabat itu sepatutnya dijadikan teladan dalam segala aspek kehidupan dan aspek kemasyarakatan. Seandainya beliau menuruti kemauan para sahabat dalam memecahkan persoalan hidup, niscaya mereka akan menemui berbagai kesulitan dan kemudaratan seperti dalam peristiwa al-Walid bin 'Uqbah. Seandainya Nabi saw menerima berita bohong tentang Bani al-Musthaliq, lalu mengirimkan pasukan untuk menggempur mereka yang disangka murtad dan menolak membayar zakat, niscaya yang demikian itu hanya akan menimbulkan penyesalan dan bencana. Akan tetapi, sebaliknya dengan kebijaksanaan dan bimbingan Rasulullah saw yang berada di tengah-tengah para sahabat, mereka dijadikan oleh Allah mencintai keimanan dan menjadikan iman itu indah dalam hati mereka, dan menjadikan mereka benci kepada kekafiran, ke-fasikan dan kedurhakaan.\n\nKarena iman yang sempurna itu terdiri dari pengakuan dengan lisan, membenarkan dengan hati, dan beramal saleh dengan anggota tubuh, maka kebencian terhadap kekafiran berlawanan dengan kecintaan kepada keimanan. Menjadikan iman itu indah dalam hati adalah pararel dengan membenarkan (tasdiq) dalam hati, dan benci kepada kedurhakaan itu pararel dengan mengadakan amal saleh. Orang-orang yang demikian itu adalah orang-orang yang mendapat petunjuk dan mengikuti jalan yang lu-rus, yang langsung menuju kepada keridaan Allah.",
      "text_translation": "Dan ketahuilah olehmu bahwa di tengah-tengah kamu ada Rasulullah. Kalau dia menuruti (kemauan) kamu dalam banyak hal pasti kamu akan mendapatkan kesusahan. Tetapi Allah menjadikan kamu cinta kepada keimanan dan menjadikan (iman) itu indah dalam hatimu serta menjadikan kamu benci kepada kekafiran, kefasikan, dan kedurhakaan. Mereka itulah orang-orang yang mengikuti jalan yang lurus,",
      "text": "وَاعْلَمُوْٓا اَنَّ فِيْكُمْ رَسُوْلَ اللّٰهِ ۗ لَوْ يُطِيْعُكُمْ فِيْ كَثِيْرٍ مِّنَ الْاَمْرِ لَعَنِتُّمْ وَلٰكِنَّ اللّٰهَ حَبَّبَ اِلَيْكُمُ الْاِيْمَانَ وَزَيَّنَهٗ فِيْ قُلُوْبِكُمْ وَكَرَّهَ اِلَيْكُمُ الْكُفْرَ وَالْفُسُوْقَ وَالْعِصْيَانَ ۗ اُولٰۤىِٕكَ هُمُ الرَّاشِدُوْنَۙ",
      "text_translation_en": "And know that God’s Apostle is among you: were he to comply with your inclinations in each and every case, you would be bound to come to harm [as a community]. But as it is, God has caused [your] faith to be dear to you, and has given it beauty in your hearts, and has made hateful to you all denial of the truth, and all iniquity, and all rebellion [against what is good]. Such indeed are they who follow the right course",
      "juz_number": 26
    },
    "8": {
      "text_tafsir_en": "It is a gift from God and is a gift from Him. Allah is All-Knowing who has the right to receive guidance and who is in error, and is wise in the management of His affairs.",
      "text_tafsir": "Karunia dan anugerah itu semata-mata kemurahan dari Allah dan merupakan nikmat dari-Nya. Allah Maha Mengetahui siapa yang berhak menerima petunjuk dan siapa yang terkena kesesatan, dan Maha bijaksana dalam mengatur segala urusan makhluk-Nya.",
      "text_translation": "sebagai karunia dan nikmat dari Allah. Dan Allah Maha Mengetahui, Mahabijaksana.",
      "text": "فَضْلًا مِّنَ اللّٰهِ وَنِعْمَةً ۗوَاللّٰهُ عَلِيْمٌ حَكِيْمٌ ",
      "text_translation_en": "through God’s bounty and favour; and God is all-knowing, truly wise.",
      "juz_number": 26
    },
    "9": {
      "text_tafsir_en": "Allah explains that if two groups of believers are at war, then there must be peace between the two opposing parties in a peaceful manner in accordance with the law of God based on justice for their benefit. If after peace is made there is still opposition and persecution against others, then those aggressors who do so have to fight back to accept God's law. If the dissenters have submitted themselves to and returned to the commandments of God, then the two previously hostile groups should be treated fairly and wisely, with full awareness that such hostility will not be repeated in the future. God commands them to do justice in all their affairs, for God loves them and will reward those who are just in all matters.",
      "text_tafsir": "Allah menerangkan bahwa jika ada dua golongan dari orangorang Mukmin berperang, maka harus diusahakan perdamaian antara kedua pihak yang bermusuhan itu dengan jalan berdamai sesuai dengan ketentuan hukum dari Allah berdasarkan keadilan untuk kemaslahatan mereka yang bersangkutan. Jika setelah diusahakan perdamaian itu masih ada yang membangkang dan tetap juga berbuat aniaya terhadap golongan yang lain, maka golongan yang agresif yang berbuat aniaya itu harus diperangi sehingga mereka kembali untuk menerima hukum Allah. Jika golongan yang membangkang itu telah tunduk dan kembali kepada perintah Allah, maka kedua golongan yang tadinya bermusuhan itu harus diperlakukan dengan adil dan bijaksana, penuh kesadaran sehingga tidak terulang lagi permusuhan seperti itu di masa yang akan datang. Allah memerintahkan supaya mereka tetap melakukan keadilan dalam segala urusan mereka, karena Allah menyukainya dan akan memberi pahala kepada orang-orang yang berlaku adil dalam segala urusan.",
      "text_translation": "Dan apabila ada dua golongan orang-orang mukmin berperang, maka damaikanlah antara keduanya. Jika salah satu dari keduanya berbuat zalim terhadap (golongan) yang lain, maka perangilah (golongan) yang berbuat zalim itu, sehingga golongan itu kembali kepada perintah Allah. Jika golongan itu telah kembali (kepada perintah Allah), maka damaikanlah antara keduanya dengan adil, dan berlakulah adil. Sungguh, Allah mencintai orang-orang yang berlaku adil. ",
      "text": "وَاِنْ طَاۤىِٕفَتٰنِ مِنَ الْمُؤْمِنِيْنَ اقْتَتَلُوْا فَاَصْلِحُوْا بَيْنَهُمَاۚ فَاِنْۢ بَغَتْ اِحْدٰىهُمَا عَلَى الْاُخْرٰى فَقَاتِلُوا الَّتِيْ تَبْغِيْ حَتّٰى تَفِيْۤءَ اِلٰٓى اَمْرِ اللّٰهِ ۖفَاِنْ فَاۤءَتْ فَاَصْلِحُوْا بَيْنَهُمَا بِالْعَدْلِ وَاَقْسِطُوْا ۗاِنَّ اللّٰهَ يُحِبُّ الْمُقْسِطِيْنَ ",
      "text_translation_en": "Hence, if two groups of believers fall to fighting, make peace between them; but then, if one of the two [groups] goes on acting wrongfully towards the other, fight against the one that acts wrongfully until it reverts to God’s commandment; and if they revert, make peace between them with justice, and deal equitably [with them]: for verily, God loves those who act equitably!",
      "juz_number": 26
    },
    "10": {
      "text_tafsir_en": "In this verse, Allah explains that indeed the believers are all brothers and sisters like a brotherly relationship between the brothers because they share the same and eternal elements of faith in heaven. In a valid hadith it is reported that the Muslim is another Muslim brother, do not do persecution and do not let him do the persecution. People who help the needs of his brother, then God helps his needs. One who eases a difficulty from a Muslim, Allah relaxes one difficulty among the difficulties on the Day of Judgment. People who cover up the shame of his brother, then God will cover his shortcomings on the Day of Judgment. (Al-Bukhari's narration from 'Abdullah bin' Umar) In another authentic hadith it is stated: When a Muslim prays for his unseen brother, the angel says, \"Amen, and may you find it like that.\" (History of Muslims and Abu ad-Darda ') Because the brotherhood leads to peace, God encourages continuing efforts among religious brothers such as peace between siblings, so that they continue to maintain submission to Allah. Hopefully they gain the grace and forgiveness of God in return for their efforts of peace and piety. From this verse it can be understood the need for power as an intermediary to reconcile the warring parties.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa sesungguhnya orang-orang Mukmin semuanya bersaudara seperti hubungan persaudaraan antara nasab karena sama-sama menganut unsur keimanan yang sama dan kekal dalam surga. Dalam sebuah hadis sahih diriwayatkan Muslim itu adalah saudara muslim yang lain, jangan berbuat aniaya dan jangan membiarkannya melakukan aniaya. Orang yang membantu kebutuhan saudaranya, maka Allah membantu kebutuhannya. Orang yang melonggarkan satu kesulitan dari seorang muslim, maka Allah melonggarkan satu kesulitan di antara kesulitan-kesuliannya pada hari Kiamat. Orang yang menutupi aib saudaranya, maka Allah akan menutupi kekurangannya pada hari Kiamat. (Riwayat al-Bukhari dari 'Abdullah bin 'Umar) \n\nPada hadis sahih yang lain dinyatakan: Apabila seorang muslim mendoakan saudaranya yang gaib, maka malaikat berkata, \"Amin, dan semoga kamu pun mendapat seperti itu.\" (Riwayat Muslim dan Abu ad-Darda') Karena persaudaraan itu mendorong ke arah perdamaian, maka Allah menganjurkan agar terus diusahakan di antara saudara seagama seperti perdamaian di antara saudara seketurunan, supaya mereka tetap memelihara ketakwaan kepada Allah. Mudah-mudahan mereka memperoleh rahmat dan ampunan Allah sebagai balasan terhadap usaha-usaha perdamaian dan ketakwaan mereka. Dari ayat tersebut dapat dipahami perlu adanya kekuatan sebagai penengah untuk mendamaikan pihak-pihak yang bertikai.",
      "text_translation": "Sesungguhnya orang-orang mukmin itu bersaudara, karena itu damaikanlah antara kedua saudaramu (yang berselisih) dan bertakwalah kepada Allah agar kamu mendapat rahmat. ",
      "text": "اِنَّمَا الْمُؤْمِنُوْنَ اِخْوَةٌ فَاَصْلِحُوْا بَيْنَ اَخَوَيْكُمْ  وَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُرْحَمُوْنَ ࣖ ",
      "text_translation_en": "All believers are but brethren. Hence, [when­ever they are at odds,] make peace between your two brethren, and remain conscious of God, so that you might be graced with His mercy.",
      "juz_number": 26
    },
    "11": {
      "text_tafsir_en": "In this verse, God warns the believers not to make fun of other people because they may be, those who make fun of Allah are far more noble and honorable than those who make fun of them. Similarly among women, there should not be a group of women who make fun of other women because, so, those who make fun of God are better and more honorable than women who make fun of them. Allah forbids believers to criticize their own people because believers must all be viewed as one body united by unity and unity. God also forbids calling with a bad call such as calling someone who believes in the words: wicked, disbelievers, and so on. It is said in a hadith of al-Bukhari and Muslim history of the Nu'man bin Basyir: The parable of the believers in love and affection between them is as one body; when one member of the body has a fever, the other body feels feverish and disturbed. (The History of Muslim and Ahmad of An-Nu'man bin Basyir) Verily, Allah does not look at your looks and your wealth, but He does look at your heart and your actions. (Muslim History of Abu Hurairah) This Hadith contains a signal that a servant of Allah should not ascertain the good or bad of a person simply for looking at his deeds, because it is possible for one to appear to be doing charity, when Allah sees in his heart that there is a despicable nature . On the other hand, some people may seem to do something that looks bad, but God sees in their hearts a great sense of remorse that drives them to repent of their sins. So the deeds of deeds that appear outside of them, are only signs that give rise to strong suspicions, but have not reached such a convincing level. God forbid the believers call people with bad calls after they believe. Ibn Jarir recounts that Ibn 'Abbas interpreted this verse, explaining that there was a man who had in his youth committed an evil deed, and he repented of his sins, and Allah forbade anyone to repeat his evils in the past then, because it can provoke a bad feeling. That's why Allah forbids calling with bad calls and titles. Calls of honor are not prohibited, such as the mention of Abu Bakr with as-shiddiq, 'Umar with al-Faruq,' Uthman with dzu an-Nurain, 'Ali with Abu Turab, and Khalid bin al-Walid by the name of Saifullah (the sword of God). Bad calls are forbidden to be uttered after the person has faith because their titles are reminiscent of past misdeeds, and are no longer appropriate. Those who do not repent, and even call on them with bad titles, will be labeled by God as the ones who are unjust to themselves and will surely receive the consequences of Allah's doom on the Day of Resurrection.",
      "text_tafsir": "Dalam ayat ini, Allah mengingatkan kaum Mukminin supaya jangan ada suatu kaum mengolok-olokkan kaum yang lain karena boleh jadi, mereka yang diolok-olokkan itu pada sisi Allah jauh lebih mulia dan terhormat dari mereka yang mengolok-olokkan. Demikian pula di kalangan wanita, jangan ada segolongan wanita yang mengolok-olokkan wanita yang lain karena boleh jadi, mereka yang diolok-olokkan itu pada sisi Allah lebih baik dan lebih terhormat dari wanita-wanita yang mengolok-olokkan. Allah melarang kaum mukminin mencela kaum mereka sendiri karena kaum Mukminin semuanya harus dipandang satu tubuh yang diikat dengan kesatuan dan persatuan. Allah melarang pula memanggil dengan panggilan yang buruk seperti panggilan kepada seseorang yang sudah beriman dengan kata-kata: hai fasik, hai kafir, dan sebagainya. Tersebut dalam sebuah hadis riwayat al-Bukhari dan Muslim dari an-Nu'man bin Basyir: Perumpamaan orang-orang mukmin dalam kasih mengasihi dan sayang-menyayangi antara mereka seperti tubuh yang satu; bila salah satu anggota badannya sakit demam, maka badan yang lain merasa demam dan terganggu pula. (Riwayat Muslim dan Ahmad dari an-Nu'man bin Basyir) Sesungguhnya Allah tidak memandang kepada rupamu dan harta kekayaanmu, akan tetapi Ia memandang kepada hatimu dan perbuatanmu. (Riwayat Muslim dari Abu Hurairah) \n\nHadis ini mengandung isyarat bahwa seorang hamba Allah jangan memastikan kebaikan atau keburukan seseorang semata-mata karena melihat kepada amal perbuatannya saja, sebab ada kemungkinan seseorang tampak mengerjakan amal kebajikan, padahal Allah melihat di dalam hatinya ada sifat yang tercela. Sebaliknya pula mungkin ada orang yang kelihatan melakukan suatu yang tampak buruk, akan tetapi Allah melihat dalam hatinya ada rasa penyesalan yang besar yang mendorongnya bertobat dari dosanya. Maka amal perbuatan yang tampak di luar itu, hanya merupakan tanda-tanda saja yang menimbulkan sangkaan yang kuat, tetapi belum sampai ke tingkat meyakinkan. Allah melarang kaum Mukminin memanggil orang dengan panggilan-panggilan yang buruk setelah mereka beriman. Ibnu Jarir meriwayatkan bahwa Ibnu 'Abbas dalam menafsirkan ayat ini, menerangkan bahwa ada seorang laki-laki yang pernah di masa mudanya mengerjakan suatu perbuatan yang buruk, lalu ia bertobat dari dosanya, maka Allah melarang siapa saja yang menyebut-nyebut lagi keburukannya di masa yang lalu, karena hal itu dapat membangkitkan perasaan yang tidak baik. Itu sebabnya Allah melarang memanggil dengan panggilan dan gelar yang buruk. Adapun panggilan yang mengandung penghormatan tidak dilarang, seperti sebutan kepada Abu Bakar dengan as-shiddiq, kepada 'Umar dengan al-Faruq, kepada 'Utsman dengan sebutan dzu an-Nurain, kepada 'Ali dengan Abu Turab, dan kepada Khalid bin al-Walid dengan sebutan Saifullah (pedang Allah). Panggilan yang buruk dilarang untuk diucapkan setelah orangnya beriman karena gelar-gelar untuk itu mengingatkan kepada kedurhakaan yang sudah lewat, dan sudah tidak pantas lagi dilontarkan. Barang siapa tidak bertobat, bahkan terus pula memanggil-manggil dengan gelar-gelar yang buruk itu, maka mereka dicap oleh Allah sebagai orang-orang yang zalim terhadap diri sendiri dan pasti akan menerima konsekuensinya berupa azab dari Allah pada hari Kiamat.",
      "text_translation": "Wahai orang-orang yang beriman! Janganlah suatu kaum mengolok-olok kaum yang lain (karena) boleh jadi mereka (yang diperolok-olokkan) lebih baik dari mereka (yang mengolok-olok) dan jangan pula perempuan-perempuan (mengolok-olokkan) perempuan lain (karena) boleh jadi perempuan (yang diperolok-olokkan) lebih baik dari perempuan (yang mengolok-olok). Janganlah kamu saling mencela satu sama lain dan janganlah saling memanggil dengan gelar-gelar yang buruk. Seburuk-buruk panggilan adalah (panggilan) yang buruk (fasik) setelah beriman. Dan barangsiapa tidak bertobat, maka mereka itulah orang-orang yang zalim. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا يَسْخَرْ قَوْمٌ مِّنْ قَوْمٍ عَسٰٓى اَنْ يَّكُوْنُوْا خَيْرًا مِّنْهُمْ وَلَا نِسَاۤءٌ مِّنْ نِّسَاۤءٍ عَسٰٓى اَنْ يَّكُنَّ خَيْرًا مِّنْهُنَّۚ وَلَا تَلْمِزُوْٓا اَنْفُسَكُمْ وَلَا تَنَابَزُوْا بِالْاَلْقَابِۗ بِئْسَ الِاسْمُ الْفُسُوْقُ بَعْدَ الْاِيْمَانِۚ وَمَنْ لَّمْ يَتُبْ فَاُولٰۤىِٕكَ هُمُ الظّٰلِمُوْنَ ",
      "text_translation_en": "O YOU who have attained to faith! No men shall deride [other] men: it may well be that those [whom they deride] are better than themselves; and no women [shall deride other] women: it may well be that those [whom they deride] are better than them­selves. And neither shall you defame one another, nor insult one another by [opprobrious] epithets: evil is all imputation of iniquity after [one has attained to] faith; and they who [become guilty thereof and] do not repent - it is they, they who are evildoers!",
      "juz_number": 26
    },
    "12": {
      "text_tafsir_en": "In this verse it is explained that their request is impossible to please God. They will not be returned to the world, because their hearts are no longer accepting the truth. In the world, they disbelieve and refuse when called upon to worship only God, but when Allah is united with others, they believe and justify it. Their request to come out of hell and be returned to the world for righteousness, was answered by God in His word: He said, \"Abide in her, and do not talk with me.\" (al-Mu'minun \/ 23: 108) Even if their request is granted and returned to the world, they will continue to do what Allah forbids. They are liars, as God says: If they were brought back into the world, they would repeat what they were forbidden to do. They are really liars. . God hates those who associate with him and has exercised wisdom in keeping them in hell.",
      "text_tafsir": "Pada ayat ini dijelaskan bahwa permintaan mereka itu tidak mungkin diperkenankan oleh Allah. Mereka tidak akan dikembalikan ke dunia, karena hati mereka sudah tidak menerima kebenaran lagi. Di dunia, mereka kafir dan ingkar apabila diseru untuk hanya menyembah Allah saja, tetapi apabila Allah dipersekutukan dengan yang lain, mereka percaya dan membenarkannya. Permintaan mereka ke luar dari neraka dan dikembalikan ke dunia untuk beramal saleh, dijawab oleh Allah dengan firman-Nya:\n\nDia (Allah) berfirman, \"Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.\" (al-Mu'minun\/23: 108)\n\nAndaikata permintaan mereka diperkenankan dan dikembalikan ke dunia, mereka akan tetap mengerjakan hal-hal yang dilarang Allah sebagaimana halnya dahulu. Mereka itu pembohong, sebagaimana firman Allah:\n\nSeandainya mereka dikembalikan ke dunia, tentu mereka akan mengulang kembali apa yang telah dilarang mengerjakannya. Mereka itu sungguh pendusta. (al-An'am\/6: 28)\n\nAyat ini ditutup dengan satu ketegasan bahwa putusan di hari Kiamat berada di tangan Allah yang akan memberi putusan dengan hak dan adil, Tuhan Yang Mahatinggi dan Mahabesar tiada sesuatu yang menyamai-Nya. Tuhan sangat benci kepada yang mempersekutukan-Nya dan telah memberlakukan kebijaksanaan yaitu mengekalkan mereka di dalam neraka.",
      "text_translation": "Wahai orang-orang yang beriman! Jauhilah banyak dari prasangka, sesungguhnya sebagian prasangka itu dosa dan janganlah kamu mencari-cari kesalahan orang lain dan janganlah ada di antara kamu yang menggunjing sebagian yang lain. Apakah ada di antara kamu yang suka memakan daging saudaranya yang sudah mati? Tentu kamu merasa jijik. Dan bertakwalah kepada Allah, sesungguhnya Allah Maha Penerima tobat, Maha Penyayang.",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اجْتَنِبُوْا كَثِيْرًا مِّنَ الظَّنِّۖ اِنَّ بَعْضَ الظَّنِّ اِثْمٌ وَّلَا تَجَسَّسُوْا وَلَا يَغْتَبْ بَّعْضُكُمْ بَعْضًاۗ  اَيُحِبُّ اَحَدُكُمْ اَنْ يَّأْكُلَ لَحْمَ اَخِيْهِ مَيْتًا فَكَرِهْتُمُوْهُۗ وَاتَّقُوا اللّٰهَ ۗاِنَّ اللّٰهَ تَوَّابٌ رَّحِيْمٌ",
      "text_translation_en": "O you who have attained to faith! Avoid most guesswork [about one another] for, behold, some of [such] guesswork is [in itself] a sin; and do not spy upon one another, and neither allow your­selves to speak ill of one another behind your backs. Would any of you like to eat the flesh of his dead brother? Nay, you would loathe it! And be conscious of God. Verily, God is an accep­tor of repentance, a dispenser of grace!",
      "juz_number": 26
    },
    "13": {
      "text_tafsir_en": "In this verse, it is explained that God created man from man (Adam) and woman (Eve) and made them nations, tribes, and peoples of color not only to mock one another, but to know and help one another . God does not like those who show arrogance with their descendants, their offspring, or their wealth because the most honorable of men on God's side are those who fear Him most. The human nature of the glory is always associated with nationality and wealth. But in God's eyes, the most honorable man is the one who fears him. Ibn 'Umar and at-Tirmidhi, from Ibn' Umar, reported that he said: The Messenger of Allah (may peace be upon him) performed on his camel his ears were imperfect (partially cut off) on the day of Fath Makkah (Mecca liberation). Then he touched the pole of the Ka'aba with a stick bent at its end. He could not find a place to lay his camel in the mosque until the camel was taken out into the valley and buried there. Then the Prophet praised Allah and exalted him, and said, \"O mankind, surely Allah has taken away from you the evil of ignorance. the wicked, the wretched, and the despised of his Lord. Then Allah's Messenger (may peace be upon him) read the verse: yes ayyuhan-nas inna khalaqnakum min dhakarin wa untsa¦ and for you guys. (Ibn 'Umar's history and at-Tirmidhi from Ibn' Umar). Verily, Allah is the All-Merciful, All-Knowing of what is hidden in the human soul and mind. At the end of the verse, God declares that He is fully aware of all that is hidden in the human heart and knows all that they do.",
      "text_tafsir": "Dalam ayat ini, dijelaskan bahwa Allah menciptakan manusia dari seorang laki-laki (Adam) dan seorang perempuan (Hawa) dan menjadikannya berbangsa-bangsa, bersuku-suku, dan berbeda-beda warna kulit bukan untuk saling mencemoohkan, tetapi supaya saling mengenal dan menolong. Allah tidak menyukai orang-orang yang memperlihatkan kesombongan dengan keturunan, kepangkatan, atau kekayaannya karena yang paling mulia di antara manusia pada sisi Allah hanyalah orang yang paling bertakwa kepada-Nya.\n\nKebiasaan manusia memandang kemuliaan itu selalu ada sangkut-pautnya dengan kebangsaan dan kekayaan. Padahal menurut pandangan Allah, orang yang paling mulia itu adalah orang yang paling takwa kepada-Nya.\n\nDiriwayatkan oleh Ibnu hibban dan at-Tirmidhi dari Ibnu 'Umar bahwa ia berkata:\n\nRasulullah saw melakukan tawaf di atas untanya yang telinganya tidak sempurna (terputus sebagian) pada hari Fath Makkah (Pembebasan Mekah). Lalu beliau menyentuh tiang Ka'bah dengan tongkat yang bengkok ujungnya. Beliau tidak mendapatkan tempat untuk menderumkan untanya di masjid sehingga unta itu dibawa keluar menuju lembah lalu menderumkannya di sana. Kemudian Rasulullah memuji Allah dan mengagungkan-Nya, kemudian berkata, \"Wahai manusia, sesungguhnya Allah telah menghilangkan pada kalian keburukan perilaku Jahiliah. Wahai manusia, sesungguhnya manusia itu ada dua macam: orang yang berbuat kebajikan, bertakwa, dan mulia di sisi Tuhannya. Dan orang yang durhaka, celaka, dan hina di sisi Tuhannya. Kemudian Rasulullah membaca ayat: ya ayyuhan-nas inna khalaqnakum min dhakarin wa untsa¦ Beliau membaca sampai akhir ayat, lalu berkata, \"Inilah yang aku katakan, dan aku memohon ampun kepada Allah untukku dan untuk kalian. (Riwayat Ibnu hibban dan at-Tirmidhi dari Ibnu 'Umar).\n\nSesungguhnya Allah Maha Penerima tobat lagi Maha Mengetahui tentang apa yang tersembunyi dalam jiwa dan pikiran manusia. Pada akhir ayat, Allah menyatakan bahwa Dia Maha Mengetahui tentang segala yang tersembunyi di dalam hati manusia dan mengetahui segala perbuatan mereka.",
      "text_translation": "Wahai manusia! Sungguh, Kami telah menciptakan kamu dari seorang laki-laki dan seorang perempuan, kemudian Kami jadikan kamu berbangsa-bangsa dan bersuku-suku agar kamu saling mengenal. Sesungguhnya yang paling mulia di antara kamu di sisi Allah ialah orang yang paling bertakwa. Sungguh, Allah Maha Mengetahui, Mahateliti. ",
      "text": "يٰٓاَيُّهَا النَّاسُ اِنَّا خَلَقْنٰكُمْ مِّنْ ذَكَرٍ وَّاُنْثٰى وَجَعَلْنٰكُمْ شُعُوْبًا وَّقَبَاۤىِٕلَ لِتَعَارَفُوْا ۚ اِنَّ اَكْرَمَكُمْ عِنْدَ اللّٰهِ اَتْقٰىكُمْ ۗاِنَّ اللّٰهَ عَلِيْمٌ خَبِيْرٌ ",
      "text_translation_en": "O men! Behold, We have created you all out of a male and a female, and have made you into nations and tribes, so that you might come to know one another. Verily, the noblest of you in the sight of God is the one who is most deeply conscious of Him. Behold, God is all-knowing, all-aware.",
      "juz_number": 26
    },
    "14": {
      "text_tafsir_en": "Allah explains that the Bedouin Arabs claim to be believers. Their words were rejected by God. Instead of saying that they should believe because their true faith is to justify them with a sincere heart and to believe in God fully. This has not been proven because they show that they have given the Messenger of Allah (may peace be upon him) their faith and not against the Messenger of Allah. They are forbidden by God to speak the word of faith and instead they just say 'we have embraced Islam, because their true faith has never entered their hearts. What they say doesn't suit their heart. Az-Zajjaj said, \"Islam is to show obedience and to accept that which has been brought by the Prophet Muhammad. which is called true faith. If they had truly obeyed God and His Messenger, were sincere in their deeds, and abandoned hypocrisy, then God would not diminish the reward of their deeds, but would justify their reward by multiplying. \" To man who has committed many sins, wherever he may be, God will forgive him because He is Forgiving the repentant and the merciful.",
      "text_tafsir": "Allah menjelaskan bahwa orang-orang Arab Badui yang mengaku bahwa diri mereka telah beriman. Ucapan mereka itu dibantah oleh Allah. Sepantasnya mereka itu jangan mengatakan telah beriman karena iman yang sungguh-sungguh ialah membenarkan dengan hati yang tulus dan percaya kepada Allah dengan seutuhnya. Hal itu belum terbukti karena mereka memperlihatkan bahwa mereka telah memberikan kenikmatan kepada Rasulullah saw dengan keislaman mereka dan dengan tidak memerangi Rasulullah saw.\n\nMereka dilarang oleh Allah mengucapkan kata beriman itu dan sepantasnya mereka hanya mengucapkan 'kami telah tunduk masuk Islam, karena iman yang sungguh-sungguh itu belum pernah masuk ke dalam hati mereka. Apa yang mereka ucapkan tidak sesuai dengan isi hati mereka.\n\nAz-Zajjaj berkata, \"Islam itu ialah memperlihatkan kepatuhan dan menerima apa-apa yang dibawa oleh Nabi Muhammad. Dengan memperlihatkan patuh itu terpeliharalah darah dan jiwa, dan jika ikrar tentang keislaman itu disertai dengan tasdiq (dibenarkan hati), maka barulah yang demikian itu yang dinamakan iman yang sungguh-sungguh. Jika mereka benar-benar telah taat kepada Allah dan rasul-Nya, ikhlas berbuat amal, dan meninggalkan kemunafikan, maka Allah tidak akan mengurangi sedikit pun pahala amalan mereka, bahkan akan memperbaiki balasannya dengan berlipat ganda.\"\n\nTerhadap manusia yang banyak berbuat kesalahan, di mana pun ia berada, Allah akan mengampuninya karena Dia Maha Pengampun terhadap orang yang bertobat dan yang beramal penuh keikhlasan.",
      "text_translation": "Orang-orang Arab Badui berkata, “Kami telah beriman.” Katakanlah (kepada mereka), “Kamu belum beriman, tetapi katakanlah ‘Kami telah tunduk (Islam),’ karena iman belum masuk ke dalam hatimu. Dan jika kamu taat kepada Allah dan Rasul-Nya, Dia tidak akan mengurangi sedikit pun (pahala) amal perbuatanmu. Sungguh, Allah Maha Pengampun, Maha Penyayang.” ",
      "text": "۞ قَالَتِ الْاَعْرَابُ اٰمَنَّا ۗ قُلْ لَّمْ تُؤْمِنُوْا وَلٰكِنْ قُوْلُوْٓا اَسْلَمْنَا وَلَمَّا يَدْخُلِ الْاِيْمَانُ فِيْ قُلُوْبِكُمْ ۗوَاِنْ تُطِيْعُوا اللّٰهَ وَرَسُوْلَهٗ لَا يَلِتْكُمْ مِّنْ اَعْمَالِكُمْ شَيْـًٔا ۗاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ ",
      "text_translation_en": "THE BEDOUIN say, “We have attained to faith.” Say [unto them, O Muhammad]: “You have not [yet] attained to faith; you should [rather] say, ‘We have [outwardly] surrendered’ - for [true] faith has not yet entered your hearts. But if you [truly] pay heed unto God and His Apostle, He will not let the least of your deeds go to waste: for, behold, God is much-forgiving, a dispenser of grace.”",
      "juz_number": 26
    },
    "15": {
      "text_tafsir_en": "In this verse, God explains the true faith that those who profess to have true faith are only those who believe in God and His Messenger, without a moment's hesitation and do not hesitate to stand up for what they are facing. They give up their wealth and soul in jihad in the way of God only to achieve His will. There are three groups of believers in the world: first, believers in God and His Messenger, and then they have no doubt and jihad fi-sabilillah with their wealth and self. Second, people who do not interfere with others' property and personal life. Third, the one who is seeking the glory of ambition, he left it for God's sake. (History of Ahmad from Abu Sa'id al-Khudri) These are the people whose faith is acknowledged by Allah. Unlike those Bedouin Arabs who only speak in tongues, but their hearts are empty because they are converted to Islam only for fear of swordsmanship, only to secure their souls and their property.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan hakikat iman yang sebenarnya yaitu bahwa orang-orang yang diakui mempunyai iman yang sungguh-sungguh hanyalah mereka yang beriman kepada Allah dan rasul-Nya, tanpa keragu-raguan sedikit pun dan tidak goyah pendiriannya apa pun yang dihadapi. Mereka menyerahkan harta dan jiwa dalam berjihad di jalan Allah semata-mata untuk mencapai keridaan-Nya.\n\nOrang mukmin di dunia ada tiga golongan: pertama, orang beriman kepada Allah dan Rasul-Nya, kemudian mereka tidak ragu dan berjihad fi sabilillah dengan harta dan dirinya. Kedua, orang yang tidak mengganggu harta dan diri orang lain. Ketiga, orang yang mendapatkan kemuliaan ambisi, ia meninggalkannya karena Allah. (Riwayat Ahmad dari Abu Sa'id al-Khudri)\n\nMereka itulah orang-orang yang imannya diakui oleh Allah. Tidak seperti orang-orang Arab Badui itu yang hanya mengucapkan beriman dengan lidah belaka, sedangkan hati mereka kosong karena mereka masuk Islam itu hanya karena takut akan tebasan pedang, hanya sekadar untuk mengamankan jiwa dan harta bendanya.",
      "text_translation": "Sesungguhnya orang-orang mukmin yang sebenarnya adalah mereka yang beriman kepada Allah dan Rasul-Nya kemudian mereka tidak ragu-ragu dan mereka berjihad dengan harta dan jiwanya di jalan Allah. Mereka itulah orang-orang yang benar.",
      "text": "اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَرَسُوْلِهٖ ثُمَّ لَمْ يَرْتَابُوْا وَجَاهَدُوْا بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ فِيْ سَبِيْلِ اللّٰهِ ۗ اُولٰۤىِٕكَ هُمُ الصّٰدِقُوْنَ ",
      "text_translation_en": "[Know that true] believers are only those who have attained to faith in God and His Apostle and have left all doubt behind, and who strive hard in God’s cause with their possessions and their lives: it is they, they who are true to their word!",
      "juz_number": 26
    },
    "16": {
      "text_tafsir_en": "Allah told His Messenger to ask the Bedouin Arabs whether they would tell Allah of his faith that had been stored in his heart, while Allah knew what was in heaven and what was in the earth, including what was contained in it. in their hearts because Allah is All-Knowing.",
      "text_tafsir": "Allah memerintahkan kepada Rasul-Nya agar bertanya kepada orang-orang Arab Badui itu, apakah mereka akan memberitahukan kepada Allah tentang keyakinannya yang telah tersimpan di dalam hatinya, padahal Allah mengetahui apa yang ada di langit dan apa yang ada di bumi, termasuk apa yang terkandung di dalam hati mereka karena Allah Maha Mengetahui segala sesuatu.",
      "text_translation": "Katakanlah (kepada mereka), “Apakah kamu akan memberitahukan kepada Allah tentang agamamu (keyakinanmu), padahal Allah mengetahui apa yang ada di langit dan apa yang ada di bumi dan Allah Maha Mengetahui segala sesuatu.” ",
      "text": "قُلْ اَتُعَلِّمُوْنَ اللّٰهَ بِدِيْنِكُمْۗ وَاللّٰهُ يَعْلَمُ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ وَاللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ ",
      "text_translation_en": "Say: “Do you, perchance, [want to] inform God of [the nature of] your faith although God knows all that is in the heavens and all that is on earth? Indeed, God has full knowledge of every­thing!”",
      "juz_number": 26
    },
    "17": {
      "text_tafsir_en": "Allah explained that the Bedouin Arabs felt favored by the Messenger of Allah. They believe that their Islam and their allegiance to the Prophet Muhammad should be viewed as a favor to be praised by the Prophet. Then Allah commanded his apostles to contradict the words of those who were always favoring the favor because surely Allah bestowed favor upon them by showing them faith, if they were truly the people of his faith.",
      "text_tafsir": "Allah menjelaskan bahwa orang-orang Arab Badui itu merasa telah memberi nikmat kepada Rasulullah saw. Mereka menganggap bahwa keislaman dan ketundukan mereka kepada Nabi Muhammad itu harus dipandang suatu nikmat yang harus disyukuri oleh Nabi. Kemudian Allah memerintahkan kepada rasul-Nya supaya membantah ucapan mereka yang selalu menonjol-nonjolkan pemberian nikmat karena sesungguhnya hanya Allah yang melimpahkan nikmat kepada mereka dengan menunjuki mereka keimanan, jika mereka sungguh-sungguh menjadi orang-orang yang benar imannya.",
      "text_translation": "Mereka merasa berjasa kepadamu dengan keislaman mereka. Katakanlah, “Janganlah kamu merasa berjasa kepadaku dengan keislamanmu, sebenarnya Allah yang melimpahkan nikmat kepadamu dengan menunjukkan kamu kepada keimanan, jika kamu orang yang benar.” ",
      "text": "يَمُنُّوْنَ عَلَيْكَ اَنْ اَسْلَمُوْا ۗ قُلْ لَّا تَمُنُّوْا عَلَيَّ اِسْلَامَكُمْ ۚبَلِ اللّٰهُ يَمُنُّ عَلَيْكُمْ اَنْ هَدٰىكُمْ لِلْاِيْمَانِ اِنْ كُنْتُمْ صٰدِقِيْنَ ",
      "text_translation_en": "Many people think that they have bestowed a favour upon thee [O Prophet] by having surrendered [to thee]. Say thou: “Deem not your surrender a favour unto me: nay, but it is God who bestows a favour upon you by showing you the way to faith - if you are true to your word!”",
      "juz_number": 26
    },
    "18": {
      "text_tafsir_en": "Verily, Allah is the All-Knower of the supernatural in the heavens and the earth. He is the one who sees what is hidden in the heart, and what the tongue says because God is the One to see what all His servants do.",
      "text_tafsir": "Sesungguhnya Allah-lah Yang Maha Mengetahui apa-apa yang gaib di langit dan di bumi. Dia-lah yang melihat apa yang tersembunyi di dalam hati, dan apa yang diucapkan oleh lidah karena Allah Maha Melihat apa yang dikerjakan oleh seluruh hamba-hamba-Nya.",
      "text_translation": "Sungguh, Allah mengetahui apa yang gaib di langit dan di bumi. Dan Allah Maha Melihat apa yang kamu kerjakan. ",
      "text": "اِنَّ اللّٰهَ يَعْلَمُ غَيْبَ السَّمٰوٰتِ وَالْاَرْضِۗ وَاللّٰهُ بَصِيْرٌۢ بِمَا تَعْمَلُوْنَ ࣖ ",
      "text_translation_en": "Verily, God knows the hidden reality of the heavens and the earth; and God sees all that you do.",
      "juz_number": 26
    }
  },
  "name": "الحجرٰت",
  "name_translation_en": "The Inner Apartments",
  "name_translation": "Kamar-Kamar",
  "name_latin": "Al-Hujurat"
}