{
  "number": 52,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 49,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse says that Allah swears by the highest rank because above that Allah spoke to Moses and revealed the Book of the Torah to him which contains laws, wisdom, and manners and is easy to read. Ath-thur means hill which is thursina hill is a hill in Maroon where Moses listened to Allah Almighty. Ath-thur in Suryani also means a hill with many trees, the place where God spoke directly to Moses and where he was ordained an apostle. Named ath-thur because of its many trees, when there are no trees, it is not named ath-thur, but Jabal (mountain). God used the mountain as His oath of course because of the importance of the mountain in the life of this earth. Concerning the mountain and its role, among others can be found in the following paragraphs Luqman \/ 31: 10 and Naml \/ 27: 88. The following section can also be found in Naba '\/ 78: 6-7 and Nazis'. and \/ 79: 30-32.",
      "text_tafsir": "Ayat ini mengutarakan bahwa Allah swt bersumpah dengan ath-thur yang tinggi kedudukannya karena di atas ath-thur itu Allah telah berbicara dengan Nabi Musa dan menurunkan kitab Taurat kepadanya yang berisikan hukum-hukum, hikmat, dan budi pekerti dan mudah dibaca manusia. Ath-thur berarti bukit yaitu Bukit thursina yakni sebuah bukit di Madyan tempat Nabi Musa mendengarkan kalam Allah swt. Ath-thur dalam bahasa Suryani berarti juga bukit yang banyak pohon-pohonnya, tempat di mana Tuhan berbicara langsung dengan Nabi Musa dan di tempat itu pula diangkat menjadi rasul. Dinamakan ath-thur karena banyak pohonnya, bila tidak ada pohonnya, maka tidaklah dinamakan ath-thur, akan tetapi Jabal (gunung). Allah menggunakan gunung sebagai sumpah-Nya tentunya karena pentingnya gunung dalam terjadinya kehidupan di bumi ini. Mengenai gunung dan peranannya, antara lain dapat dilihat pada bahasan beberapa ayat berikut, Luqman\/31: 10 dan an-Naml\/27: 88. Bahasan selanjutnya juga dapat dilihat pada an-Naba'\/78: 6-7 dan an-Nazi'at\/79: 30-32.",
      "text_translation": "Demi gunung (Sinai),",
      "text": "وَالطُّوْرِۙ  ",
      "text_translation_en": "CONSIDER Mount Sinai!",
      "juz_number": 27
    },
    "2": {
      "text_tafsir_en": "Then God swears by a book that is written (beautifully written) with a neat arrangement of letters. Some think that the meaning of the Mahfudz is far from it, and some argue that the meaning of the beautifully written book is that it is revealed and read to people openly.",
      "text_tafsir": "Kemudian Allah swt bersumpah dengan sebuah kitab yang tertulis (bertulisan indah) dengan susunan huruf-hurufnya yang rapih. Ada yang berpendapat bahwa maksudnya ialah Lauh Mahfudz, dan ada pula yang berpendapat bahwa arti kitab yang tertulis indah, ialah yang diturunkan dan dibacakan kepada manusia dengan terang-terangan.",
      "text_translation": "dan demi Kitab yang ditulis, ",
      "text": "وَكِتٰبٍ مَّسْطُوْرٍۙ  ",
      "text_translation_en": "Consider [God’s] revelation, inscribed",
      "juz_number": 27
    },
    "3": {
      "text_tafsir_en": "Furthermore, Allah explained in this verse that the books are easy for everyone to study their contents. The books contain wisdom, law, culture and character (morals); because it is written on open, legible pages. (",
      "text_tafsir": "Selanjutnya Allah swt menerangkan dalam ayat ini bahwa kitab-kitab itu mudah bagi setiap orang mempelajari isinya. Kitabkitab itu berisi hikmah-hikmah, hukum, kebudayaan dan budi pekerti (akhlak); karena itu ditulis pada lembaran-lembaran terbuka yang dapat dibaca. (",
      "text_translation": "pada lembaran yang terbuka,",
      "text": "فِيْ رَقٍّ مَّنْشُوْرٍۙ  ",
      "text_translation_en": "on wide-open scrolls.",
      "juz_number": 27
    },
    "4": {
      "text_tafsir_en": "In this verse Allah swt swears by al-Baitul-Ma'mur, a house in the seventh heaven that is daily entered by 70 thousand angels for tawaf or prayer. They've gone in there and won't come back forever. It is stated in the Hadith of Isra'el: \"It is in Sahih al-Bukhari and Sahih Muslims that the Messenger of Allah (may peace be upon him) said in the hadith concerning Israel\" after the seventh heaven, and then I was taken to Jerusalem, and suddenly I saw 70,000 angels enter every day and they will never come back again. (al-Bukhari and Muslim history) The above hadiths mean that the angels worship and perform the tawaf there (Jerusalem) just as the human beings on earth, perform the tawaf in the Kaaba The Qatadah, Rabbi 'ibn Anas and as-Suddi said that the Messenger of Allah (may peace be upon him) said to his companions: \"Do you know what Jerusalem is? They said, \"Allah and His Messenger know best\" The Messenger of Allah (may peace be upon him) said, \"Jerusalem is a mosque in the sky in line with the Ka'bah and when (someone from) falls, it will fall on the Ka'bah, there salute 70,000 angels every day; if they go from there, they will never return. \" (History of Ibn Jarir)",
      "text_tafsir": "Dalam ayat ini Allah swt bersumpah dengan al-Baitul-Ma'mur yaitu sebuah rumah di langit yang ketujuh yang setiap harinya dimasuki oleh 70 ribu malaikat untuk tawaf atau salat. Mereka telah masuk ke sana tidak akan kembali untuk selamanya. Hal ini ditegaskan dalam hadis Isra' yaitu: \"Terdapat dalam Sahih al-Bukhari dan Sahih Muslim bahwa Rasulullah saw bersabda dalam hadis tentang Isra' sesudah melampaui langit ketujuh, kemudian aku diangkat ke Baitulma'mur, tiba-tiba di sana kulihat 70.000 malaikat masuk setiap hari dan mereka tidak akan kembali lagi setelah itu. (Riwayat al-Bukhari dan Muslim) \n\nMaksud hadis di atas bahwa para malaikat itu beribadat dan melakukan tawaf di sana (Baitulma'mur) seperti halnya manusia di bumi, melakukan tawaf di Ka'bah Mekah. Begitulah keadaan para malaikat itu. Kemudian Qatadah, Rabi' bin Anas dan as-Suddi berkata, bahwa Rasulullah saw pada suatu hari berkata kepada para sahabat: \n\n\"Tahukah kamu apakah Baitulma'mur itu? Mereka menjawab, \"Allah dan Rasul-Nya lebih mengetahui\" Rasulullah berkata, \"Baitulma'mur ialah sebuah masjid di langit yang searah dengan Ka'bah dan apabila (seseorang dari sana) jatuh, maka akan jatuh di atas Ka'bah, di sana salat 70.000 malaikat setiap hari; apabila mereka keluar dari sana, tidak akan kembali lagi.\" (Riwayat Ibnu Jarir)",
      "text_translation": "demi Baitulma‘mur (Ka‘bah),",
      "text": "وَّالْبَيْتِ الْمَعْمُوْرِۙ  ",
      "text_translation_en": "Consider the long-enduring house [of worship]!",
      "juz_number": 27
    },
    "5": {
      "text_tafsir_en": "In this verse Allah swt swears by the lofty roof (heaven), which is a supernatural having several suns, moons, fixed stars, and moving stars. There is also 'Arsy and his seat; so do His angels (who never disobeyed Allah's command and always obeyed what He commanded them). There are also innumerable natural things only Allah Almighty knows, and Allah Almighty also we do not know the truth except He who created it. In the word of Allah swt is explained: And no one knows the army of your Lord except Him. (al-Muddatstsir \/ 74: 31) Sufyan ats-sauri, Shu'bah and Abdul Ahwas narrate from Simak of the Harb of Khalid bin Ar'arah of 'Ali that As-Saqful Marfu' means' the heavens. Sufyan reads the word of God as follows: And We make the heavens a protected roof. (alAnbiya '\/ 21:32) This means that the sky is a roof and that it is meant to be \"protected\" is that everything in heaven is maintained by Allah swt by rules and laws that make everything run in order and order, and the law.",
      "text_tafsir": "Dalam ayat ini Allah swt bersumpah dengan atap yang ditinggikan (langit) yaitu alam tinggi yang mempunyai beberapa matahari, beberapa bulan, bintang-bintang tetap, dan bintang-bintang beredar. Di sana juga terletak 'Arsy dan kursi-Nya; demikian juga malaikat-malaikat-Nya (yang tidak pernah menolak perintah Allah swt dan selalu patuh terhadap apa yang Allah perintahkan kepada mereka). Di sana juga ada benda-benda alam yang tak terhitung banyaknya hanya Allah swt yang mengetahuinya, dan balatentara Allah swt yang kita juga tak mengetahui hakikatnya kecuali Dia yang menciptakannya. Dalam firman Allah swt dijelaskan: \n\nDan tidak ada yang mengetahui bala tentara Tuhanmu kecuali Dia sendiri. (al-Muddatstsir\/74: 31) \n\nSufyan ats-sauri, Syu'bah dan Abdul Ahwas meriwayatkan dari Simak dari Harb dari Khalid bin Ar'arah dari 'Ali bahwa As-Saqful Marfu' artinya 'langit. Sufyan membaca firman Allah sebagai berikut: \n\nDan Kami menjadikan langit sebagai atap yang terpelihara. (alAnbiya'\/21: 32) \n\nMaksudnya ialah bahwa langit itu sebagai atap dan yang dimaksud dengan \"terpelihara\" ialah segala yang berada di langit itu dijaga oleh Allah swt dengan peraturan dan hukum-hukum yang menyebabkan semuanya berjalan dengan teratur dan tertib, sesuai sistem dan hukumnya.",
      "text_translation": "demi atap yang ditinggikan (langit),",
      "text": "وَالسَّقْفِ الْمَرْفُوْعِۙ  ",
      "text_translation_en": "Consider the vault [of heaven] raised high!",
      "juz_number": 27
    },
    "6": {
      "text_tafsir_en": "In this verse Allah swears by Demi al-Bahrul-Masjur (the sea in which there is fire) that is the sea which is protected from the flood because if it is released, it will submerge everything on the earth so that animals and plants will all be consumed destroyed. So the rules of nature are broken and no wisdom of this nature is made. Some scholars argue that the earth's surface is entirely like watermelon, and that its skin is like watermelon, meaning that the comparison of the earth's crust and the fire in it is like the skin of a watermelon with its contents. So now we are actually on the great fire, on the sea below it is full of fire and the sea is covered with earth from all its corners. From time to time the fire rises upon the sea which appears at the time of the earthquake and at the time the volcano erupts; such as the Visofius volcano that erupted in Italy in 1909 AD that consumed the city of Mozaina, and this earthquake that occurred in Japan in 1952 CE devastated its cities at once. According to Jumhur the meaning of this verse is the sea of the earth. However, they disagree on the word \"masjur\" in their opinion: lit. (al-Infithar \/ 82: 3) His other words: And when the sea is warmed. (at-Takwir \/ 81: 6)",
      "text_tafsir": "Dalam ayat ini Allah bersumpah, Demi al-Bahrul-Masjur (laut yang di dalamnya ada api) yakni laut yang tertahan dari banjir karena kalau laut itu dilepaskan, ia akan menenggelamkan semua yang ada di atas bumi sehingga hewan dan tumbuh-tumbuhan semuanya akan habis musnah. Maka rusaklah aturan alam dan tidaklah ada hikmah alam ini dijadikan. Sebagian ulama berpendapat dan menetapkan bahwa lapisan bumi itu seluruhnya seperti semangka, dan kulitnya seperti kulit semangka, itu artinya bahwa perbandingan kulit bumi dan api yang ada di dalam kulitnya itu seperti kulit semangka dengan isinya, yang dimakan itu. Sebab itu sekarang kita sebenarnya berada di atas api yang besar, yakni di atas laut yang dibawahnya penuh dengan api dan laut itu tertutup dengan kulit bumi dari segala penjurunya. Dari waktu ke waktu api itu naik ke atas laut yang tampak pada waktu gempa dan pada waktu gunung berapi meletus; seperti gunung berapi Visofius yang meletus di Italia pada tahun 1909 M yang telah menelan kota Mozaina, dan gempa ini yang telah terjadi di Jepang pada tahun 1952 M yang memusnahkan kota-kotanya sekaligus. Menurut Jumhur bahwa yang dimaksud dalam ayat ini ialah laut bumi. Akan tetapi mereka berbeda pendapat dalam kata \"masjur\" di antara pendapatnya ialah berarti: dinyalakan api di hari Kiamat seperti dalam Al-Qur'an: \n\nDan apabila lautan dijadikan meluap. (al-Infithar\/82: 3) \n\nFirman-Nya yang lain: \n\nDan apabila lautan dipanaskan. (at-Takwir\/81: 6)",
      "text_translation": "demi lautan yang penuh gelombang, ",
      "text": "وَالْبَحْرِ الْمَسْجُوْرِۙ ",
      "text_translation_en": "Consider the surf-swollen sea!",
      "juz_number": 27
    },
    "7": {
      "text_tafsir_en": "Then Allah swt mentions the contents of the oath that the Judgment of the Day of Judgment is intended for all who deny the apostles. The punishment will surely happen, without the slightest hesitation. Affirmation of the certainty of the coming of doom is very important to eliminate doubts among humans who doubt the event of the doom.",
      "text_tafsir": "Kemudian Allah swt menyebutkan isi sumpah bahwa azabazab hari Kiamat diperuntunkkan bagi semua yang mendustakan para rasul. Azab tersebut pasti akan terjadi, tanpa ragu sedikitpun. Penegasan tentang kepastian datangnya azab sangat penting untuk menghilangkan keraguan di kalangan manusia yang meragukan peristiwa terjadinya azab itu.",
      "text_translation": "sungguh, azab Tuhanmu pasti terjadi, ",
      "text": "اِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌۙ  ",
      "text_translation_en": "VERILY, [O man,] the suffering decreed by thy Sustainer [for the sinners] will indeed come to pass:",
      "juz_number": 27
    },
    "8": {
      "text_tafsir_en": "Allah makes it clear that no one can reject it. And there is no way out of that torment which is a reward for those who have defiled themselves with shirk and sin, and who have defiled their souls by lying to the apostles and the day of resurrection. It is further explained in this verse that the inevitable torment occurred one day when the sky shook in its place.",
      "text_tafsir": "Allah menerangkan bahwa azab tersebut tak seorang pun yang dapat menolaknya. Dan tidak pula ada jalan untuk keluar dari azab itu yang merupakan balasan bagi orang-orang yang telah menodai dirinya dengan perbuatan syirik dan dosa, dan yang telah menodai jiwanya dengan dusta terhadap para rasul dan hari kebangkitan. Kemudian diterangkan pula dalam ayat ini bahwa azab yang tidak dapat dihindarkan itu terjadi pada suatu hari tatkala langit berguncang di tempatnya.",
      "text_translation": "tidak sesuatu pun yang dapat menolaknya, ",
      "text": "مَّا لَهٗ مِنْ دَافِعٍۙ  ",
      "text_translation_en": "there is none who could avert it.",
      "juz_number": 27
    },
    "9": {
      "text_tafsir_en": "Allah makes it clear that no one can reject it. And there is no way out of that torment which is a reward for those who have defiled themselves with shirk and sin, and who have defiled their souls by lying to the apostles and the day of resurrection. It is further explained in this verse that the inevitable torment occurred one day when the sky shook in its place.",
      "text_tafsir": "Allah menerangkan bahwa azab tersebut tak seorang pun yang dapat menolaknya. Dan tidak pula ada jalan untuk keluar dari azab itu yang merupakan balasan bagi orang-orang yang telah menodai dirinya dengan perbuatan syirik dan dosa, dan yang telah menodai jiwanya dengan dusta terhadap para rasul dan hari kebangkitan. Kemudian diterangkan pula dalam ayat ini bahwa azab yang tidak dapat dihindarkan itu terjadi pada suatu hari tatkala langit berguncang di tempatnya.",
      "text_translation": "pada hari (ketika) langit berguncang sekeras-kerasnya,",
      "text": "يَّوْمَ تَمُوْرُ السَّمَاۤءُ مَوْرًاۙ ",
      "text_translation_en": "[It will come to pass] on the Day when the skies will be convulsed in [a great] convulsion,",
      "juz_number": 27
    },
    "10": {
      "text_tafsir_en": "In this verse Allah adds his explanation that on the Day of Resurrection the mountains move from their places, walk like the way of clouds, and fly into the air and then fall to the earth in pieces, then break into dust like feathers that are blown by the wind. The shaking of the sky and the fluttering of mountains is a warning and warning to humans that they will not be able to return to the world, because it has already been destroyed and a new realm has taken place - the afterlife. The above verse deals with the description of the time of Resurrection, which is also mentioned in many other verses. Mountains that express land or crust, are depicted as moving places or in other words they are moving. The movement of these mountains is a manifestation of the movement of the earth's plates (see an-Naml \/ 27: 88) and can cause earthquakes. In Surah az-Zalzalah \/ 99: 1-4 the doomsday event is illustrated by the arrival of a terrible earthquake. This devastating earthquake can cause long and deep cracks that are not impossible to trigger volcanic eruptions. For example, when the Nias earthquake in 2005 which had a magnitude of Mw = 8.7, after the 2004 Aceh earthquake, several volcanoes on the island of Sumatra showed increased activity. Scientific facts do show that the mountains are moving. Global Positioning Systems (GPS) data records the movements in millimeters. An example is the outer islands to the west of Sumatra which move northeastward at 50-60 mm \/ year.",
      "text_tafsir": "Dalam ayat ini Allah menambahkan penjelasannya bahwa pada hari Kiamat itu gunung-gunung berpindah dari tempatnya, berjalan seperti jalannya awan, dan terbang ke udara lalu jatuh ke bumi terpecah-pecah, kemudian hancur menjadi debu laksana bulu yang diterbangkan angin. Berguncangnya langit dan beterbangannya gunung-gunung ialah sebagai pemberitahuan dan peringatan kepada manusia bahwa mereka tidak akan dapat kembali ke dunia, karena ia telah musnah dan telah terjadi alam baru yaitu alam akhirat. Ayat di atas berkaitan dengan gambaran saat terjadinya kiamat, yang banyak pula disebut di ayat-ayat lainnya. Gunung yang mengekspresikan daratan atau kerak bumi, digambarkan berpindah tempat atau dengan kata lain gunung-gunung itu bergerak. Pergerakan gunung-gunung ini adalah manifestasi pergerakan lempeng bumi (lihat an-Naml\/27: 88) dan dapat menimbulkan gempa bumi. Dalam Surah az-Zalzalah\/99: 1-4 kejadian kiamat digambarkan dengan datangnya gempa yang dahsyat. Gempa dahsyat ini dapat menimbulkan retakan yang panjang dan dalam yang bukan mustahil memicu terjadinya letusan gunung api. Sebagai contoh adalah ketika terjadi gempa Nias pada tahun 2005 yang berkekuatan Mw=8,7, setelah gempa Aceh 2004, beberapa gunung api di Pulau Sumatra memperlihatkan kegiatan yang meningkat. \n\nFakta ilmiah memang menunjukkan bahwa gunung-gunung itu bergerak. Data Global Positioning Systems (GPS) merekam gerakangerakan tersebut dalam ukuran milimeter. Sebagai contoh adalah pulau-pulau terluar di sebelah barat Sumatra yang bergerak ke arah timurlaut sebesar 50-60 mm\/tahun.",
      "text_translation": "dan gunung berjalan (berpindah-pindah).",
      "text": "وَّتَسِيْرُ الْجِبَالُ سَيْرًاۗ  ",
      "text_translation_en": "and the mountains will move with [an awesome] movement.",
      "juz_number": 27
    },
    "11": {
      "text_tafsir_en": "In this verse Allah explains to whom the punishment is imposed after the shaking of the heavens and flying mountains that is to the liars who are wallowing with sleaze and always rejecting the truth and not remembering the day of reckoning and never fearing the existence of God's torment.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan kepada siapa azab itu ditimpakan setelah terjadinya guncangan langit dan beterbangan gunung-gunung yaitu kepada orang-orang pendusta yang bergelimang dengan kebatilan dan selalu menolak kebenaran serta tidak ingat akan adanya hari perhitungan dan tidak pernah takut akan adanya siksaan Tuhan.",
      "text_translation": "Maka celakalah pada hari itu bagi orang-orang yang mendustakan.",
      "text": "فَوَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَۙ  ",
      "text_translation_en": "Woe, then, on that Day to all who give the lie to the truth –",
      "juz_number": 27
    },
    "12": {
      "text_tafsir_en": "In this verse Allah explains to whom the punishment is imposed after the shaking of the heavens and flying mountains that is to the liars who are wallowing with sleaze and always rejecting the truth and not remembering the day of reckoning and never fearing the existence of God's torment.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan kepada siapa azab itu ditimpakan setelah terjadinya guncangan langit dan beterbangan gunung-gunung yaitu kepada orang-orang pendusta yang bergelimang dengan kebatilan dan selalu menolak kebenaran serta tidak ingat akan adanya hari perhitungan dan tidak pernah takut akan adanya siksaan Tuhan.",
      "text_translation": "Orang-orang yang bermain-main dalam kebatilan (perbuatan dosa),",
      "text": "الَّذِيْنَ هُمْ فِيْ خَوْضٍ يَّلْعَبُوْنَۘ  ",
      "text_translation_en": "all those who [throughout their lives] but idly played with things vain –",
      "juz_number": 27
    },
    "13": {
      "text_tafsir_en": "In this verse God explains that those who committed such crimes, on that day were rebuked and forced into Hell, whose fire was always burning and burning. (",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang berbuat kejahatan tersebut, pada hari itu mereka dihardik dan didorong dengan paksa ke dalam neraka Jahanam, yang apinya selalu membakar dan menyala-nyala. (",
      "text_translation": "pada hari (ketika) itu mereka didorong ke neraka Jahanam dengan sekuat-kuatnya.",
      "text": "يَوْمَ يُدَعُّوْنَ اِلٰى نَارِ جَهَنَّمَ دَعًّاۗ",
      "text_translation_en": "on the Day when they shall be thrust into the fire with [an irresistible] thrust, [and will be told:]",
      "juz_number": 27
    },
    "14": {
      "text_tafsir_en": "As they approached hell, the guards insisted with ridicule, \"This is the hell you used to lie in the world.\" Their lying to hell meant their lying to the apostle who had brought the news of the hell, with the revelation that was revealed to him.",
      "text_tafsir": "Setelah mereka dekat dengan neraka, para penjaga menegaskan dengan ejekan, \"Inilah neraka, yang dahulu kamu dustakan di dunia.\" Pendustaan mereka terhadap neraka berarti dusta mereka terhadap rasul yang telah membawa berita tentang neraka itu, dengan wahyu yang telah diturunkan kepadanya.",
      "text_translation": "(Dikatakan kepada mereka), “Inilah neraka yang dahulu kamu mendustakannya.” ",
      "text": "هٰذِهِ النَّارُ الَّتِيْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ ",
      "text_translation_en": "“This is the fire which you were wont to call a lie!",
      "juz_number": 27
    },
    "15": {
      "text_tafsir_en": "That's why in this verse God is mocking them, that is, the Muslims who in the world considered Muhammad saw the magicians to be witches and close their eyes. Allah swt taunts them when they are punished in the hereafter. \"What do they see with their heads now, like the torment they were told in the world, or are they still enchanted by magic as they once thought Muhammad saw them in the world, or did they not see anything?\" The torment had come true, their eyes were not enchanted nor covered. Is it clear that in their eyes there is doubt or are their eyes ill? No, not both, what they saw was the truth.",
      "text_tafsir": "Karena itu dalam ayat ini Allah mengejek mereka, yaitu orang-orang musyrik yang ketika di dunia menganggap Muhammad saw tukang sihir yang menyihir akal dan menutup mata mereka. Allah swt mengejek mereka ketika mereka diazab di akhirat. \"Apakah yang mereka lihat dengan mata kepala mereka sekarang ini, seperti azab yang diberitahukan kepada mereka di dunia itu, ataukah mereka masih terlena oleh sihir seperti dahulu mereka menganggap Muhammad saw menyihir mereka di dunia, ataukah mata mereka tidak melihat apa-apa?\" Sungguh azab itu telah menjadi kenyataan, mata mereka tidak kena sihir dan tidak pula ditutupi. \n\nJelasnya apakah dalam penglihatan mereka ada keraguan ataukah mata mereka sedang sakit? Tidak, kedua-duanya tidak, yang mereka lihat itu adalah kenyataan yang sebenarnya.",
      "text_translation": "Maka apakah ini sihir? Ataukah kamu tidak melihat?",
      "text": "اَفَسِحْرٌ هٰذَآ اَمْ اَنْتُمْ لَا تُبْصِرُوْنَ ",
      "text_translation_en": "Was it, then, a delusion or is it that you failed to see [its truth]?",
      "juz_number": 27
    },
    "16": {
      "text_tafsir_en": "When they could not deny the truth and admit that it was not magic nor was it a result of mistaken sight, Allah swt commanded them to go into the fire of hell to feel the fire of hell. Then Allah swt explained that patience or not, the situation is similar to them. Because someone is not looking forward to something, he or she is trying to resist it either by avoiding it or by overcoming it. However, unlike the day of resurrection because the torment in the hereafter is not the same as the torment of the world because of the chastened ones of the world, if he is patient he will benefit from his patience, both the benefits of the reward in the hereafter and the praise of the world in regard to patience and his perseverance. And if he was impatient with his sense of humor, he would be criticized and considered childish. But patience in the hereafter is of no use because the hereafter is not a place of practice but to obtain rewards and retribution. At the end of this verse Allah swt emphasizes that man will receive retribution from Allah. If they do good in the world, they will receive a good reward in the hereafter. And if their deeds in the world are evil, they will receive a reward for their evil. Allah says: And your Lord does not harm anyone. (al-Kahf \/ 18: 49) He emphasizes that God will reward everyone according to his deeds. The answer will be whether patience or not, it will work.",
      "text_tafsir": "Ketika mereka tidak dapat mengingkari kenyataan dan mengakui bahwa itu bukan sihir dan bukan pula akibat salah melihat, Allah swt memerintahkan kepada mereka supaya masuk ke dalam api neraka untuk merasakan panasnya api neraka. Kemudian Allah swt menjelaskan bahwa bersabar atau tidak, keadaannya serupa bagi mereka. Karena seorang yang tidak sabar akan sesuatu, maka ia berusaha untuk menolaknya baik dengan menjauhinya atau pun dengan mengatasinya. Namun, lain halnya dengan hari kebangkitan sebab azab di akhirat tidak sama dengan azab di dunia karena orang yang diazab di dunia, bila ia bersabar ia akan mendapat manfaat dari kesabarannya, baik manfaat yang berupa balasan di akhirat nanti maupun pujian di dunia berkenaan dengan kesabaran dan ketabahannya. Dan kalau dia tidak sabar dengan pengertian berkeluh-kesah tentulah ia dicela dan dianggap kekanak-kanakan. Akan tetapi kesabaran di akhirat tidak ada manfaatnya karena akhirat bukan tempat beramal tetapi untuk mendapat ganjaran dan pembalasan. Pada akhir ayat ini Allah swt menegaskan bahwa manusia itu akan menerima pembalasan dari Allah. Jika perbuatan mereka di dunia baik, mereka akan menerima balasan yang baik pula di akhirat. Dan jika perbuatan mereka di dunia jahat, mereka di akhirat akan menerima balasan setimpal dengan kejahatannya. Allah berfirman: \n\nDan Tuhanmu tidak menzalimi seorang jua pun. (al-Kahf\/18: 49) \n\nTegasnya Allah akan membalas setiap orang sesuai dengan perbuatannya. Balasan itu akan diterima apakah bersabar atau tidak, pasti terlaksana.",
      "text_translation": "Masuklah ke dalamnya (rasakanlah panas apinya); baik kamu bersabar atau tidak, sama saja bagimu; sesungguhnya kamu hanya diberi balasan atas apa yang telah kamu kerjakan. ",
      "text": "اِصْلَوْهَا فَاصْبِرُوْٓا اَوْ لَا تَصْبِرُوْاۚ سَوَاۤءٌ عَلَيْكُمْۗ  اِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُوْنَ ",
      "text_translation_en": "Endure it [now]! But [whether you] bear yourselves with patience or without patience, it will be the same to you: you are but being requited for what you were wont to do.”",
      "juz_number": 27
    },
    "17": {
      "text_tafsir_en": "In this verse God explains that those who fear the wrath of their Lord, either openly worship Him or not, fulfill their obligations to God, and carry out religious rules, do not commit a sinful act by not defiling themselves with sin and not polluting his soul with hypocrisy. The Lord gave them the reward of heaven, in which they had joy. They get what they have never seen, they have never heard, and no human has ever explained. All in return for their good deeds throughout life on earth. They stay away from worldly luxuries that make them neglected in worship and are patient in the trials that await them in the hope of receiving God's will. (",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang takut akan murka Tuhannya, mereka melaksanakan ibadah kepadaNya baik dengan terang-terangan atau tidak, memenuhi kewajibankewajibannya terhadap Tuhan, dan menjalankan peraturanperaturan agama, tidak mengerjakan suatu perbuatan maksiat yakni tidak menodai dirinya dengan dosa dan tidak menodai jiwanya dengan kemunafikan. Kepada mereka Tuhan memberikan balasan surga, di dalamnya mereka bersenang-senang. Mereka mendapat apa yang belum pernah mereka lihat, belum pernah mereka dengar, dan belum pernah diterangkan oleh seorang manusia pun. Semuanya itu sebagai balasan atas perbuatan baik mereka selama hidup di dunia. Mereka menjauhi kemewahan duniawi yang membuat lalai pada ibadah serta bersabar atas cobaan-cobaan yang menimpa mereka dengan harapan agar mendapat rida Allah. (",
      "text_translation": "Sesungguhnya orang-orang yang bertakwa berada dalam surga dan kenikmatan,",
      "text": "اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّنَعِيْمٍۙ  ",
      "text_translation_en": "[But,] verily, the God-conscious will find themselves [on that Day] in gardens and in bliss,",
      "juz_number": 27
    },
    "18": {
      "text_tafsir_en": "In this verse it is depicted that they have a great sense of happiness and happiness because of the grace and gifts that God bestows upon them. They have never been disturbed by any kind of anxiety or overwhelmed by feelings of tiredness. They are full of fun and enjoyment as well as exquisite delights, their faces radiant, cheerful, and cheerful. They were saved by their Lord from torment. They now feel all the pleasure and away from misery. That is true pleasure and eternal happiness.",
      "text_tafsir": "Dalam ayat ini digambarkan bahwa mereka merasakan suka cita dan kebahagiaan yang penuh karena anugerah dan hadiahhadiah yang dilimpahkan Allah kepadanya. Mereka tidak pernah terganggu oleh segala macam was-was atau dihinggapi oleh perasaan lelah. Mereka betul-betul berada dalam kesenangan dan kenikmatan serta kelezatan luar biasa, muka mereka berseri-seri, ceria, dan riang gembira. Mereka telah diselamatkan oleh Tuhannya dari azab. Mereka kini merasakan segala kenikmatan dan jauh dari kesengsaraan. Itulah kesenangan yang benar dan nikmat yang abadi.",
      "text_translation": "mereka bersuka ria dengan apa yang diberikan Tuhan kepada mereka; dan Tuhan memelihara mereka dari azab neraka.",
      "text": "فَاكِهِيْنَ بِمَآ اٰتٰىهُمْ رَبُّهُمْۚ وَوَقٰىهُمْ رَبُّهُمْ عَذَابَ الْجَحِيْمِ",
      "text_translation_en": "rejoicing in all that their Sustainer will have granted them: for their Sustainer will have warded off from them all suffering through the blazing fire.",
      "juz_number": 27
    },
    "19": {
      "text_tafsir_en": "In this verse Allah allows them to eat and drink what is available in the form of all delicious foods and drinks. They are no longer worried about the dangers that will befall as well as what they have witnessed in the world about the dangers of food and drink. All of that as a reward for all their good deeds and as a reward for their sincerity in the world in serving Allah Almighty. They really feel good in the afterlife. It is reported that Rabi 'bin Hisham performed prayers all night. Then someone asked him why he was tiring himself like that. Then the answer is that he needs rest in the afterlife. In the same verse it means that Allah says: (To them it is said), \"Eat and drink with pleasure because of the deeds that you have done in the past days.\" (al-hujurat \/ 49: 17) The words hani'an in this verse means the enjoyment of food and drink and avoiding anything that is harmful. People who eat in the world sometimes cause illness and so on, so they are less calm and not good at eating. Or he is afraid that the food will run out soon so he must look for it again. Or because it runs out, then then have to cook again until cooked and can be eaten. Things like this will not be found in heaven. The words \"bima kuntum ta'malun\" in this verse means that in return you have done in the world, this is a sign that God has fulfilled what He has promised in the world, because there is no blessing in the world that can be obtained without difficulty. first Unlike the case with favors in the afterlife. Favors in the hereafter in return for faith and righteous deeds in the world as explained by Allah in His Word: They feel meritorious to you with their Islam. Say, \"Do not feel meritorious to me with your Islam, in fact God who bestows favor to you by showing you to the faith, if you are righteous.\" (al-hujurat \/ 49: 17)",
      "text_tafsir": "Dalam ayat ini Allah membolehkan mereka memakan dan meminum apa yang telah tersedia berupa segala makanan dan minuman yang lezat-lezat. Mereka tidak lagi khawatir akan bahaya yang akan menimpa seperti halnya apa yang mereka saksikan di dunia tentang adanya bahaya makanan dan minuman. Semua itu sebagai balasan terhadap segala amal baik mereka dan sebagai balasan atas kesungguhan mereka di dunia dalam berbakti kepada Allah swt. Mereka betul-betul merasa nikmat di akhirat itu. Diriwayatkan bahwa Rabi' bin Hisyam melakukan salat sepanjang malam. Lalu seorang bertanya kepadanya mengapa ia melelahkan dirinya seperti itu. Maka jawabannya bahwa ia memerlukan istirahat di akhirat nanti. Dalam ayat yang sama artinya Allah berfirman: \n\n(Kepada mereka dikatakan),\"Makan dan minumlah dengan nikmat karena amal yang telah kamu kerjakan pada hari-hari yang telah lalu.\" (al-hujurat\/49: 17) \n\nPerkataan hani'an dalam ayat ini berarti kenikmatan makanan dan minuman dan terhindar dari segala apa yang membahayakan. Orang yang makan di dunia kadang-kadang mendatangkan penyakit dan lain-lain, sehingga ia kurang tenang dan kurang enak makan. Atau ia takut akan segera habisnya makanan itu sehingga ia harus mencarinya lagi. Atau karena habis, lalu kemudian harus memasak lagi hingga matang dan dapat dimakan. Hal-hal seperti ini tidak akan ditemui di surga. Perkataan \"bima kuntum ta'malun\" dalam ayat ini berarti sebagai balasan yang telah kamu perbuat di dunia, hal ini sebagai isyarat bahwa Allah telah memenuhi apa yang telah dijanjikan olehNya di dunia, sebab tidak ada nikmat di dunia yang bisa diperoleh tanpa adanya susah payah dahulu. Berlainan halnya dengan nikmat di akhirat. Nikmat di akhirat sebagai balasan atas iman dan amal saleh di dunia sebagaimana dijelaskan oleh Allah di dalam firmanNya: \n\nMereka merasa berjasa kepadamu dengan keislaman mereka. Katakanlah, \"Janganlah kamu merasa berjasa kepadaku dengan keislamanmu, sebenarnya Allah yang melimpahkan nikmat kepadamu dengan menunjukkan kamu kepada keimanan, jika kamu orang yang benar.\" (al-hujurat\/49: 17)",
      "text_translation": "(Dikatakan kepada mereka), “Makan dan minumlah dengan rasa nikmat sebagai balasan dari apa yang telah kamu kerjakan.” ",
      "text": "كُلُوْا وَاشْرَبُوْا هَنِيْۤئًا ۢبِمَا كُنْتُمْ تَعْمَلُوْنَۙ  ",
      "text_translation_en": "[And they will be told:] “Eat and drink with good cheer as an outcome of what you were wont to do,",
      "juz_number": 27
    },
    "20": {
      "text_tafsir_en": "Then Allah mentions what they enjoy, for example their mattresses. They sat on the couches that lined up leisurely without anything to burden their hearts. There was not a single problem that they had to face at that time, because whoever was sitting, while he was facing a problem or was burdened with thoughts by a problem, meant that his mind and heart were not at peace. In this verse the words yajlis (sitting) are used instead of the words yattaki'u (sitting relaxed). With a view to explaining one's sitting situation which is filled with satisfaction and serenity. So the situation in heaven shows a state of calm, without distress, without burden and without problems. In the same verse the meaning is said: Sit face to face on couches. (al-hijr \/ 15: 47) Sitting casually is just an expression as an example of true freedom in heaven as stated by the Prophet Muhammad: \"A person in heaven sits relaxed for 40 (forty) years not moving and not boring , come to him (without effort) anything that is desired by him and liked by his eyes. \" (History of Ibn Abi hatim) Then it was explained that they there enjoyed their partners. God has given them beautiful wives who are observant.",
      "text_tafsir": "Kemudian Allah menyebutkan apa yang mereka nikmati misalnya kasur-kasurnya (dipan-dipannya). Mereka duduk di sofa yang berjajar dengan santai tanpa suatu apapun yang membebani hati mereka. Tidak ada satu masalah pun yang mesti mereka hadapi waktu itu, sebab barang siapa yang duduk, sedangkan ia menghadapi suatu masalah atau di bebani pikiran oleh suatu masalah berarti pikiran dan hatinya tidak tenteram. Pada ayat ini dipergunakan kata-kata yajlis (duduk) bukan kata-kata yattaki'u (duduk santai). Dengan maksud untuk menjelaskan keadaan duduk seseorang yang diliputi kepuasan dan ketenteraman. Maka keadaan di surga itu menunjukkan suatu keadaan yang tenang, tanpa kesusahan, tanpa beban dan tanpa masalah. Dalam ayat yang sama artinya dikatakan: \n\nDuduk berhadap-hadapan di atas dipan-dipan. (al-hijr\/15: 47) \n\nDuduk santai sekadar ungkapan sebagai salah satu contoh tentang kebebasan yang sebenarnya di dalam surga sebagaimana disabdakan oleh Nabi Muhammad saw: \"Seseorang di dalam surga duduk santai selama 40 (empat puluh) tahun tidak berpindah dan tidak membosankannya, datang kepadanya (tanpa diusahakan) apa-apa yang diingini oleh dirinya dan disenangi oleh matanya.\" (Riwayat Ibnu Abi hatim) Kemudian diterangkan bahwa mereka di sana menikmati pasangan-pasangan mereka. Allah telah memberi mereka istri-istri yang cantik yang bermata jeli.",
      "text_translation": "Mereka bersandar di atas dipan-dipan yang tersusun dan Kami berikan kepada mereka pasangan bidadari yang bermata indah. ",
      "text": "مُتَّكِـِٕيْنَ عَلٰى سُرُرٍ مَّصْفُوْفَةٍۚ وَزَوَّجْنٰهُمْ بِحُوْرٍ عِيْنٍ",
      "text_translation_en": "reclining on couches [of happiness] ranged in rows!” And [in that paradise] We shall mate them with companions pure, most beautiful of eye.",
      "juz_number": 27
    },
    "21": {
      "text_tafsir_en": "In this verse, Allah swt explains that believers who are followed by their grandchildren in faith, will be found by God in the same degree and position as the gift of God to them even though the descendants do not reach such degrees in their deeds. So much so that their parents are happy, so they have the joy of being able to come together. In reading this verse 21 Ibn 'Abbas said that the descendants of the grandchildren of the believers will be raised by Allah swt their degrees when it turns out that their level is lower than their parents' degrees. Then Allah swt gives us a picture of the situation of heaven as enjoyable as the provision of food in heaven. Every fruit or food they crave will surely be available to their taste. Then describe how they live happily there. They fought for each other, drank in polite terms, talked about funny things, and they were served by a very friendly and pretty maid. They also talk about their lives in the world before they are in the heavenly pleasure and luxury. Allah's Messenger, upon him be peace and blessings, said: When one enters heaven, ask his parents, his wife, and his children, it is said to him: \"They have not reached your degree and your practice.\" Then he said: \"My Lord, I have done good for myself and for them.\" So they (parents, wives, children) asked him to join him. \"(Ibn 'Mardawaih and ath-thabrani of Ibn' Abbas) This is the gift of Allah to the faithful grandchildren and thanks to the father's charity their father because the father received the gift of Allah with the blessing of their grandchildren as the Prophet Muhammad saw: Verily Allah swore a servant's degree, he asked, \"My Lord, how can I obtain this degree?\" for the prayer of your son. \" . \"(Muslim History of Abu Hurairah) Later in this verse Allah explains again that the merit of the righteous deeds of the righteous fathers is not diminished despite the status of children and their believing wives raised their degrees to be equal to their husbands \/ fathers as the gift of Allah Almighty. At the end of this verse, God emphasizes that everyone is responsible for their own actions and actions. The sinful act of the wife or child is not the responsibility of the father \/ husband, nor is it the sinful act to not impose on the child or his wife. It is important to emphasize that this is a basic principle. But God gives grace to the faithful and virtuous parents by increasing the happiness of the parents to fulfill the wishes of the parents gathered in heaven with their children, wives and grandchildren, as long as they believe, though their degrees are lower, but God raises them up. the same as the faithful and pious father. When the child is happy in heaven and misses his parents then God bestows his grace, raising his believing father to happiness with their child in heaven. The gift of God does not change the principle that everyone is solely responsible for their actions, although there are still exceptions as the word of Allah swt says: Everyone is responsible for what he has done except the right people. (al-Muddatstsir \/ 74: 38-39) Everyone will be held accountable for his actions before Allah Almighty. That responsibility will not be lost to them except the right-wing people who do good. They are the ones who will lose their responsibility because of their devotion to worshiping Allah.",
      "text_tafsir": "Dalam ayat ini, Allah swt menerangkan bahwa orang-orang yang beriman yang diikuti oleh anak cucu mereka dalam keimanan, akan dipertemukan Allah dalam satu tingkatan dan kedudukan yang sama sebagai karunia Allah kepada mereka meskipun para keturunan itu ternyata belum mencapai derajat tersebut dalam amal mereka. Sehingga orang tua mereka menjadi senang, maka sempurnalah kegembiraan mereka karena dapat berkumpul semua bersama-sama. Ketika membaca ayat 21 ini Ibnu 'Abbas berkata bahwa keturunan anak cucu orang-orang beriman akan ditingkatkan oleh Allah swt derajatnya bila ternyata tingkatan mereka lebih rendah dari derajat orang tua mereka. Kemudian Allah swt memberikan gambaran tentang situasi surga penuh kenikmatan seperti tersedianya makanan mereka di dalam surga. Setiap buah-buahan atau makanan yang mereka inginkan pasti mereka peroleh sesuai dengan selera mereka. Kemudian digambarkan bagaimana mereka hidup senang di sana. Mereka saling berebutan minum, minum tetap dalam kesopanan, berbicara tentang hal lucu, di sana mereka dilayani oleh pelayanpelayan yang sangat ramah dan cantik. Mereka juga membicarakan hal ihwal mereka di dunia dahulu sebelum mereka berada di dalam kesenangan dan kemewahan surgawi. Diriwayatkan bahwasanya Rasulullah bersabda: Apabila seseorang memasuki surga, menanyakan kedua orang tuanya, istrinya, dan anaknya, maka dikatakan kepadanya: \"Mereka belum sampai pada derajat dan amalanmu.\" Maka ia berkata: \"Ya Tuhanku, aku telah beramal untukku dan untuk mereka\". Maka (permohonannya dikabulkan Tuhan) disuruhlah mereka (orang tua, istri, anak) untuk bergabung dengan dia.\" (Riwayat Ibnu Mardawaih dan ath-thabrani dari Ibnu 'Abbas) \n\nIni merupakan karunia Allah swt terhadap anak cucu yang beriman dan berkat amal bapak-bapak mereka sebab bapak pun memperoleh karunia Allah swt dengan berkat anak cucu mereka sebagaimana sabda Nabi Muhammad saw:Sesungguhnya Allah swt niscaya mengangkat derajat seorang hamba, lalu ia bertanya, \"Ya Tuhanku, bagaimana aku memperoleh derajat ini?\" Allah menjawab, \"Kamu memperolehnya sebab doa anakmu.\" (Riwayat Ahmad dan al-Baihaqi dari Abu Hurairah) Dari Abu Hurairah bahwasanya Rasulullah saw bersabda, \"Apabila mati seorang anak Adam, maka terputuslah amalnya kecuali tiga: amal jariah, atau ilmu yang bermanfaat atau anak yang saleh yang mendoakannya.\"(Riwayat Muslim dari Abu Hurairah) \n\nKemudian pada ayat ini Allah menjelaskan lagi bahwa pahala dari amal saleh para bapak yang saleh tidak dikurangi meskipun kedudukan anak dan isteri mereka yang beriman diangkat derajat mereka menjadi sama dengan suami\/bapak mereka sebagai karunia Allah swt. Pada akhir ayat ini Allah menegaskan bahwa setiap orang memang hanya bertanggungjawab terhadap amal dan perbuatan masing-masing. Perbuatan dosa istri atau anak tidak menjadi tanggung jawab ayah\/suami, demikian pula perbuatan dosa agar tidak dibebankan pada anak atau istrinya. Hal ini perlu ditegaskan bahwa hal itu merupakan prinsip dasar. Tetapi Allah memberi karunia banyak kepada orang tua yang beriman dan beramal saleh dengan menambah kebahagiaan orang tua untuk memenuhi keinginan orang tua berkumpul di surga bersama anak, istri dan cucu-cucunya, selama mereka beriman, meskipun derajat mereka lebih rendah, tetapi Allah mengangkat mereka menjadi sama dengan bapak yang mukmin dan saleh tadi. Apabila si anak berbahagia masuk surga dan merindukan bersama orang tuanya maka Allah melimpahkan karunia-Nya, mengangkat bapak ibunya yang beriman untuk mendapat kebahagiaan bersama anak mereka di surga. Karunia Allah yang demikian tidak mengubah prinsip setiap orang hanya bertanggungjawab atas perbuatan masing-masing, meskipun tetap masih ada pengecualian yang lain seperti firman Allah swt: \n\nSetiap orang bertanggung jawab atas apa yang telah dilakukannya, kecuali golongan kanan. (al-Muddatstsir\/74: 38-39) Setiap orang akan diminta pertanggungjawaban atas perbuatannya di hadapan Allah swt. Tanggung jawab itu tidak akan terlepas dari mereka kecuali golongan kanan yaitu orang-orang yang berbuat baik. Mereka inilah yang akan terlepas dari tanggung jawab disebabkan oleh ketaatan mereka beribadah kepada Allah swt.",
      "text_translation": "Dan orang-orang yang beriman, beserta anak cucu mereka yang mengikuti mereka dalam keimanan, Kami pertemukan mereka dengan anak cucu mereka (di dalam surga), dan Kami tidak mengurangi sedikit pun pahala amal (kebajikan) mereka. Setiap orang terikat dengan apa yang dikerjakannya. ",
      "text": "وَالَّذِيْنَ اٰمَنُوْا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِاِيْمَانٍ اَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَآ اَلَتْنٰهُمْ مِّنْ عَمَلِهِمْ مِّنْ شَيْءٍۚ  كُلُّ امْرِئٍ ۢبِمَا كَسَبَ رَهِيْنٌ ",
      "text_translation_en": "And as for those who have attained to faith and whose offspring will have followed them in faith, We shall unite them with their offspring; and We shall not let aught of their deeds go to waste: [but] every human being will be held in pledge for whatever he has earned.",
      "juz_number": 27
    },
    "22": {
      "text_tafsir_en": "Furthermore, in this verse Allah mentions that He added the pleasures of the inhabitants of heaven from time to time to what they wanted, such as the provision of various kinds of delicious fruits and meat, even though they did not ask for it. Why Allah Almighty mentions fruits and meat, does not mention various other kinds of food because fruits and meat are foods that are loved and contain nutrients that are needed for the body and are very liked in the world. So God gives all that is human pleasure",
      "text_tafsir": "Selanjutnya pada ayat ini Allah menyebutkan bahwa Dia menambahkan kesenangan penghuni surga tersebut dari waktu ke waktu dengan apa yang mereka inginkan, seperti disediakannya berbagai macam buah-buahan dan daging yang lezat, sekalipun mereka tidak memintanya. Mengapa Allah swt menyebutkan buah-buahan dan daging, tidak menyebutkan berbagai macam makanan yang lain karena buahbuahan dan daging merupakan makanan yang disenangi dan mengandung gizi yang diperlukan bagi tubuh dan sangat disenangi di dunia. Jadi Allah memberi semua yang menjadi kesenangan manusia",
      "text_translation": "Dan Kami berikan kepada mereka tambahan berupa buah-buahan dan daging dari segala jenis yang mereka ingini. ",
      "text": "وَاَمْدَدْنٰهُمْ بِفَاكِهَةٍ وَّلَحْمٍ مِّمَّا يَشْتَهُوْنَ ",
      "text_translation_en": "And We shall bestow on them fruit and meat in abundance - whatever they may desire:",
      "juz_number": 27
    },
    "23": {
      "text_tafsir_en": "In this verse Allah swt describes their happiness in heaven that they each take their drink. They sat and cheered with their friends, joking as they did in a group of friends, as a reflection of how happy they were. The drinks in the afterlife are not as intoxicating as the rooms in the world, nor do they cause people to talk in the same direction or drink as drunk in the world. Allah swt has explained in another verse, that of the room in the hereafter and the taste of food is the verse that says in His word: (white) pure white, tastes good to those who drink. Nothing in it (the element) is intoxicating and they are not drunk because of it. (as-shaffat \/ 37: 46-47) And his word is: They do not quarrel with it, nor are they drunk. (alWaqi'ah \/ 56: 19)",
      "text_tafsir": "Dalam ayat ini Allah swt menggambarkan tentang kegembiraan mereka di surga yaitu mereka masing-masing mengambil gelas minuman mereka. Mereka duduk sambil bersulang dengan teman-teman mereka, bersenda-gurau seperti terjadi dalam suatu kelompok sahabat, sebagai gambaran betapa riang-gembiranya mereka. Minuman khamar di akhirat tidak memabukkan seperti halnya dengan khamar di dunia, dan tidak pula menyebabkan orang berbicara melantur tak tentu arah atau mabuk seperti peminum di dunia. Allah swt telah menjelaskan dalam ayat lain, yakni tentang khamar di akhirat dan sedap rasa makanan yaitu ayat yang berbunyi dalam firman-Nya: \n\n(warnanya) putih bersih, sedap rasanya bagi orang-orang yang minum. Tidak ada di dalamnya (unsur) yang memabukkan dan mereka tidak mabuk karenanya. (as-shaffat\/37: 46-47) \n\nDan firman-Nya: \n\nMereka tidak pening karenanya dan tidak pula mabuk. (alWaqi'ah\/56: 19)",
      "text_translation": "(Di dalam surga itu) mereka saling mengulurkan gelas yang isinya tidak (menimbulkan) ucapan yang tidak berfaedah ataupun perbuatan dosa. ",
      "text": "يَتَنَازَعُوْنَ فِيْهَا كَأْسًا لَّا لَغْوٌ فِيْهَا وَلَا تَأْثِيْمٌ ",
      "text_translation_en": "and in that [paradise] they shall pass on to one another a cup which will not give rise to empty talk, and neither incite to sin.",
      "juz_number": 27
    },
    "24": {
      "text_tafsir_en": "This verse explains that the inhabitants of heaven are surrounded by young servants who bring drinks. The servants are always ready to be ordered. They are handsome and beautiful like pearls that sparkle beautifully and are kept in a hidden place. In the same verse it means that Allah explains: They are surrounded by young people who remain young, carrying glasses, kettles and cups (cups) containing drinks taken from running water. (al-Waqi'ah \/ 56: 17-18) Related to this verse Qatadah said, \"I heard the news that the Prophet was asked about the servants of heaven who are like pearls, so what about those served?\" The Messenger of Allah said: \"By Allah, the difference in excess between them, such as the excess of a full moon night over all stars.\" (History of Ibn Jarir and Ibn Mundhir) It is reported that the lowest degree in heaven is the person who when he calls his servants, then a thousand servants came to his door, answering. Labbaik, labbaik (yes ... yes ...). \"",
      "text_tafsir": "Ayat ini menjelaskan bahwa penghuni surga dikelilingi oleh pelayan-pelayan yang muda belia yang membawa minuman. Pelayan-pelayan itu selalu siap diperintah. Mereka tampan dan cantik seperti mutiara yang berkilauan indah dan tersimpan dalam tempat yang tersembunyi. Dalam ayat yang sama artinya Allah menjelaskan: Mereka dikelilingi oleh anak-anak muda yang tetap muda, dengan membawa gelas, cerek dan sloki (piala) berisi minuman yang diambil dari air yang mengalir. (al-Waqi'ah\/56: 17-18) Terkait dengan ayat ini Qatadah berkata, \"Saya mendengar kabar Rasulullah ditanya tentang pelayan surga yang seperti mutiara, maka bagaimana dengan yang dilayani?\" Rasulullah bersabda: \"Demi Allah bahwa perbedaan kelebihan antara mereka, seperti kelebihan malam bulan purnama atas semua bintang.\" (Riwayat Ibnu Jarir dan Ibnu Mundhir) \n\nDiriwayatkan bahwa derajat yang paling rendah di surga ialah orang yang bilamana ia memanggil pelayannya, maka datanglah seribu pelayan berdiri di pintunya, dengan menjawab. Labbaik, labbaik (ya . . . ya . . . ).\"",
      "text_translation": "Dan di sekitar mereka ada anak-anak muda yang berkeliling untuk (melayani) mereka, seakan-akan mereka itu mutiara yang tersimpan. ",
      "text": "وَيَطُوْفُ عَلَيْهِمْ غِلْمَانٌ لَّهُمْ كَاَنَّهُمْ لُؤْلُؤٌ مَّكْنُوْنٌۚ  ",
      "text_translation_en": "And they will be waited upon by [immortal] youths, [as if they were children] of their own, [as pure] as if they were pearls hidden in their shells.",
      "juz_number": 27
    },
    "25": {
      "text_tafsir_en": "In this verse Allah swt explains that the dwellers of heaven come to each other both the father, mother and family of those who are living in the world and also the other inhabitants of heaven, asking about their condition in the ancient world which includes worship or around various efforts out of fear that they will be punished by Allah Almighty while living in the world. Then they praised Allah Almighty who had relieved their sadness, pain, sorrow and anxiety. Those in heaven no longer experience the hardships and difficulties of making a living or seeking sustenance and all things pertaining to life. They just have a lot of fun. It is narrated that Anas said: \"When the people of heaven entered the paradise and missed their friends, then someone's sofa came up to face the other's couch as they sat and talked and talked about their deeds in Then one of them said, \"Fool, do you know what day the Lord will forgive us? On the day of the place, where we pray to God then we are forgiven. \"(History of al-Bazzar)",
      "text_tafsir": "Pada ayat ini Allah swt menerangkan bahwa penghuni surga itu saling mendatangi penghuni yang lain baik antara bapak, ibu dan keluarga mereka yang seiman di dunia dan juga dengan penghuni surga yang lain, bertanya tentang keadaan mereka di dunia dahulu yaitu meliputi ibadah atau seputar berbagai upaya nahi munkar karena takutnya mereka akan azab Allah swt ketika hidup di dunia. Kemudian mereka memuji Allah swt yang telah menghilangkan sedih, pilu, duka dan kegelisahan mereka. Mereka di surga tidak lagi merasakan kesusahan dan kesukaran mencari nafkah hidup atau mencari rezeki dan segala hal yang berkenaan dengan kehidupan. Mereka hanya tinggal menikmati berbagai kesenangan saja. Diriwayatkan bahwa Anas berkata sebagai berikut:Bersabda Rasulullah saw, \"Apabila penghuni surga telah memasuki surga dan mereka rindu kepada kawan-kawan mereka, lalu datanglah sofa seseorang mendekat hingga berhadapanlah dengan sofa yang lainnya keduanya duduk santai sambil bercakap-cakap dan membicarakan amal mereka di dunia dahulu. Maka berkatalah seseorang dari mereka, \"Hai fulan, tahukah engkau pada hari apa Tuhan mengampuni kita? Pada hari di tempat, di mana kita berdoa kepada Allah kemudian kita diampuni-Nya.\" (Riwayat al-Bazzar)",
      "text_translation": "Dan sebagian mereka berhadap-hadapan satu sama lain saling bertegur sapa. ",
      "text": "وَاَقْبَلَ بَعْضُهُمْ عَلٰى بَعْضٍ يَّتَسَاۤءَلُوْنَ ",
      "text_translation_en": "And they [who are thus blest] will turn to one another, asking each other [about their past lives].",
      "juz_number": 27
    },
    "26": {
      "text_tafsir_en": "Then in this verse Allah swt question and answer the various pleasures they enjoy. They say that when they were in the world, at that time in the midst of their families there was a fear of the torment of Allah and of his suffering. Then Allah removes that fear by giving them His favor, that they are protected from the fire of hell called as-samum. Their fear in the world of Allah's punishment prompted them to obey all of Allah's commands and to abstain from all His prohibitions. It is reported that she said, \"If God opens hell on this earth with one finger, it will burn the whole earth and its contents.\"",
      "text_tafsir": "Kemudian dalam ayat ini Allah swt merinci tanya jawab atas berbagai kesenangan yang mereka nikmati. Mereka berkata bahwa sesungguhnya mereka sewaktu di dunia, pada waktu itu di tengah-tengah keluarga mereka timbul rasa takut akan azab Allah dan siksanya. Kemudian Allah menghilangkan rasa takut itu dengan mengaruniakan nikmat-Nya kepada mereka yaitu mereka terpelihara dari api neraka yang disebut as-samum. Perasaan takut mereka di dunia akan azab Allah mendorong mereka mengerjakan segala perintah Allah dan menjauhi segala larangan-Nya meskipun ketika itu mereka berada di tengah-tengah keluarga, mereka memperoleh ketenangan. Diriwayatkan bahwasanya Aisyah berkata, \"Andaikata Allah membukakan neraka di bumi ini seujung jari saja, maka akan terbakarlah bumi dan seluruh isinya.\"",
      "text_translation": "Mereka berkata, “Sesungguhnya kami dahulu, sewaktu berada di tengah-tengah keluarga kami merasa takut (akan diazab). ",
      "text": "قَالُوْٓا اِنَّا كُنَّا قَبْلُ فِيْٓ اَهْلِنَا مُشْفِقِيْنَ ",
      "text_translation_en": "They will say: “Behold, aforetime - when we were [still living] in the midst of our kith and kin - we were full of fear [at the thought of God’s dis­pleasure]:",
      "juz_number": 27
    },
    "27": {
      "text_tafsir_en": "Then in this verse Allah swt question and answer the various pleasures they enjoy. They say that when they were in the world, at that time in the midst of their families there was a fear of the torment of Allah and of his suffering. Then Allah removes that fear by giving them His favor, that they are protected from the fire of hell called as-samum. Their fear in the world of Allah's punishment prompted them to obey all of Allah's commands and to abstain from all His prohibitions. It is reported that she said, \"If God opens hell on this earth with one finger, it will burn the whole earth and its contents.\"",
      "text_tafsir": "Kemudian dalam ayat ini Allah swt merinci tanya jawab atas berbagai kesenangan yang mereka nikmati. Mereka berkata bahwa sesungguhnya mereka sewaktu di dunia, pada waktu itu di tengah-tengah keluarga mereka timbul rasa takut akan azab Allah dan siksanya. Kemudian Allah menghilangkan rasa takut itu dengan mengaruniakan nikmat-Nya kepada mereka yaitu mereka terpelihara dari api neraka yang disebut as-samum. Perasaan takut mereka di dunia akan azab Allah mendorong mereka mengerjakan segala perintah Allah dan menjauhi segala larangan-Nya meskipun ketika itu mereka berada di tengah-tengah keluarga, mereka memperoleh ketenangan. Diriwayatkan bahwasanya Aisyah berkata, \"Andaikata Allah membukakan neraka di bumi ini seujung jari saja, maka akan terbakarlah bumi dan seluruh isinya.\"",
      "text_translation": "Maka Allah memberikan karunia kepada kami dan memelihara kami dari azab neraka. ",
      "text": "فَمَنَّ اللّٰهُ عَلَيْنَا وَوَقٰىنَا عَذَابَ السَّمُوْمِ ",
      "text_translation_en": "and so God has graced us with His favour, and has warded off from us all suffering through the scorching winds [of frustration].",
      "juz_number": 27
    },
    "28": {
      "text_tafsir_en": "In this verse Allah swt explains that the inhabitants of heaven have fulfilled the requirements of Allah and His Messenger and they have received the glory. They say that they once worshiped God and begged him. So Allah approves and grants their requests and accepts their worship, for Allah is the Beneficent, the Giver, the Merciful. Every believer and every unbeliever will never forget, what they have done in the world, the joy of believers will increase as they see that they have moved from world prison to the afterlife, and from the narrowness to space . Instead, the torment of the unbelievers increased when he saw that he had moved from worldly luxury to the realm of suffering, and the misery of Hell in the hereafter.",
      "text_tafsir": "Dalam ayat ini Allah swt menerangkan bahwa penghunipenghuni surga itu telah memenuhi persyaratan seruan Allah dan Rasul-Nya sehingga mereka mendapat kemuliaan itu. Mereka berkata bahwa mereka dahulu menyembah Allah dan memohon kepada-Nya. Maka Allah memperkenankan dan mengabulkan permintaan mereka dan menerima ibadah mereka, karena Allah yang melimpahkan kebaikan, dan pemberi karunia, lagi Maha Penyayang. Setiap orang yang beriman dan setiap orang kafir tidak akan pernah lupa, akan apa yang telah mereka perbuat di dunia, kenikmatan orang-orang yang beriman akan bertambah bila mereka melihat bahwa mereka telah berpindah dari penjara dunia ke alam kesenangan akhirat, dan dari kesempitan kepada kelapangan. Sebaliknya bertambahlah siksa orang kafir bilamana ia melihat bahwa dirinya telah berpindah dari kemewahan dunia ke alam penderitaan, dan kesengsaraan neraka Jahanam di akhirat.",
      "text_translation": "Sesungguhnya kami menyembah-Nya sejak dahulu. Dialah Yang Maha Melimpahkan Kebaikan, Maha Penyayang.” ",
      "text": "اِنَّا كُنَّا مِنْ قَبْلُ نَدْعُوْهُۗ اِنَّهٗ هُوَ الْبَرُّ الرَّحِيْمُ ",
      "text_translation_en": "Verily, we did invoke Him [alone] ere this: [and now He has shown us] that He alone is truly benign, a true dispenser of grace!”",
      "juz_number": 27
    },
    "29": {
      "text_tafsir_en": "In verse 29 Allah swt ordered the Prophet Muhammad to keep warning his people, teaching them the verses of Allah without regard for their deeds that did not contain the truth. Allah asserts that his servant named Muhammad saw was not a magician nor a madman. As for the disbelievers, he accused the Prophet Muhammad of being a magician because he gave many false stories about the past. The nations that the prophets had fought before also gave news of things to come such as Judgment Day, Resurrection and Judgment Day (yaumulhisab) and heaven and hell. These supernatural stories are a truth received from God. So it is clear that the Prophet was not a magician who said things that were not true. The disbelievers also accused the Prophet of being mad because he declared and taught that God is one, whereas they considered their God only four questions many unresolved world. If God is only one then the world is no longer protected, they say. Some Western orientalists say the Prophet has epilepsy (ayan) such as when he received a sudden revelation and ignored the surrounding environment like people with epilepsy. But in this verse 29 Allah declares that Muhammad (peace be upon him) is not as crazy as those who disbelieve. Prophet Muhammad saw was a servant of Allah who was appointed as an apostle, of sound mind, high ambition, noble character and behavior. Whereas in verse 30 the unbelievers still accuse the Prophet of being a poet because the verses of the Qur'an are beautiful in their language, the arrangement of the sentences and their choice of words is extraordinary. Ordinary poets have beautiful language skills and often compose sentences and choose words that are out of the ordinary. According to them, poets often encountered death by accident. Therefore, they are always waiting for an accident that will overtake Muhammad. In this verse Allah swt emphasizes that the Prophet is not a poet. Beautiful language, sentence structure and a great choice of language in the verses of the Qur'an because those verses are the word of God revealed to the Prophet Muhammad and Allah will always protect His Prophet. God's Word: O Messenger! Tell what your Lord has sent you. If you do not (what you are commanded to do) then you do not deliver His trust. And Allah protects you from human disturbance. Indeed, Allah does not guide the disbelievers. (al-Ma'idah \/ 5: 67)",
      "text_tafsir": "Pada ayat 29 Allah swt memerintahkan kepada Nabi Muhammad saw untuk tetap memberikan peringatan kepada kaumnya, dengan mengajarkan kepada mereka ayat-ayat Allah tanpa menghiraukan perbuatan-perbuatan mereka yang tidak mengandung kebenaran. Allah menegaskan bahwa hamba-Nya yang bernama Muhammad saw bukanlah tukang tenung dan bukan orang gila. Adapun orang-orang kafir menuduh Nabi Muhammad saw sebagai tukang tenung karena beliau banyak memberikan berita-berita gaib tentang masa lalu. Umat-umat yang diperjuangkan nabi-nabi sebelumnya juga memberikan berita hal-hal yang akan datang seperti hari Kiamat, hari kebangkitan dan hari pengadilan (yaumulhisab) dan tentang surga serta neraka. Berita-berita gaib ini merupakan sebuah kebenaran yang diterima dari Allah. Jadi jelaslah bahwa Nabi bukan tukang tenung yang menyampaikan hal-hal yang tidak benar. Orang kafir juga menuduh Rasulullah sebagai orang gila karena beliau menyatakan dan mengajarkan bahwa Tuhan itu hanya satu, sedangkan mereka menganggap Tuhan mereka yang berjumlah empat saja banyak persoalan dunia yang tidak selesai. Jika Tuhan hanya satu maka dunia tidak terpelihara lagi, kata mereka. Beberapa orientalis Barat menyatakan Nabi punya penyakit epilepsi (ayan) seperti ketika beliau menerima wahyu tiba-tiba diam dan tidak menghiraukan keadaan sekeliling seperti orang terjangkit penyakit ayan. Tetapi pada ayat 29 ini Allah menegaskan bahwa Muhammad saw tidaklah gila sebagimana dituduhkan orang-orang kafir. Nabi Muhammad saw adalah hamba Allah yang diangkat jadi rasul, memiliki akal yang sehat, cita-cita yang tinggi, akhlak dan perilaku yang mulia. Sedangkan pada ayat 30 orang-orang kafir masih menuduh Nabi sebagai penyair karena ayat-ayat Al-Qur'an sangat indah bahasanya, susunan kalimat dan pilihan katanya sangat luar biasa. Para penyair biasa memiliki kemampuan bahasa yang indah dan biasa menyusun kalimat dan memilih kata-katanya tidak seperti manusia biasa. Menurut mereka para penyair sering menemui kematian karena kecelakaan. Oleh karena itu mereka selalu menunggu-nunggu kecelakaan yang akan menimpa Muhammad saw. Pada ayat ini Allah swt menegaskan bahwa Nabi bukanlah penyair. Bahasa yang indah, susunan kalimat dan pilihan bahasa yang luar biasa pada ayat-ayat Al-Qur'an karena ayat-ayat itu merupakan firman Allah yang diwahyukan kepada Nabi Muhammad saw dan Allah akan selalu melindungi Nabi-Nya. Firman Allah: \n\nWahai Rasul! Sampaikanlah apa yang diturunkan Tuhanmu kepadamu. Jika tidak engkau lakukan (apa yang diperintahkan itu) berarti engkau tidak menyampaikan amanat-Nya. Dan Allah memelihara engkau dari (gangguan) manusia. Sungguh, Allah tidak memberi petunjuk kepada orang-orang kafir. (al-Ma'idah\/5: 67)",
      "text_translation": "Maka peringatkanlah, karena dengan nikmat Tuhanmu engkau (Muhammad) bukanlah seorang tukang tenung dan bukan pula orang gila.",
      "text": "فَذَكِّرْ فَمَآ اَنْتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَّلَا مَجْنُوْنٍۗ ",
      "text_translation_en": "EXHORT, then, [O Prophet, all men:] for, by thy Sustainer’s grace, thou art neither a soothsayer nor a madman.",
      "juz_number": 27
    },
    "30": {
      "text_tafsir_en": "In verse 29 Allah swt ordered the Prophet Muhammad to keep warning his people, teaching them the verses of Allah without regard for their deeds that did not contain the truth. Allah asserts that his servant named Muhammad saw was not a magician nor a madman. As for the disbelievers, he accused the Prophet Muhammad of being a magician because he gave many false stories about the past. The nations that the prophets had fought before also gave news of things to come such as Judgment Day, Resurrection and Judgment Day (yaumulhisab) and heaven and hell. These supernatural stories are a truth received from God. So it is clear that the Prophet was not a magician who said things that were not true. The disbelievers also accused the Prophet of being mad because he declared and taught that God is one, whereas they considered their God only four questions many unresolved world. If God is only one then the world is no longer protected, they say. Some Western orientalists say the Prophet has epilepsy (ayan) such as when he received a sudden revelation and ignored the surrounding environment like people with epilepsy. But in this verse 29 Allah declares that Muhammad (peace be upon him) is not as crazy as those who disbelieve. Prophet Muhammad saw was a servant of Allah who was appointed as an apostle, of sound mind, high ambition, noble character and behavior. Whereas in verse 30 the unbelievers still accuse the Prophet of being a poet because the verses of the Qur'an are beautiful in their language, the arrangement of the sentences and their choice of words is extraordinary. Ordinary poets have beautiful language skills and often compose sentences and choose words that are out of the ordinary. According to them, poets often encountered death by accident. Therefore, they are always waiting for an accident that will overtake Muhammad. In this verse Allah swt emphasizes that the Prophet is not a poet. Beautiful language, sentence structure and a great choice of language in the verses of the Qur'an because those verses are the word of God revealed to the Prophet Muhammad and Allah will always protect His Prophet. God's Word: O Messenger! Tell what your Lord has sent you. If you do not (what you are commanded to do) then you do not deliver His trust. And Allah protects you from human disturbance. Indeed, Allah does not guide the disbelievers. (al-Ma'idah \/ 5: 67)",
      "text_tafsir": "Pada ayat 29 Allah swt memerintahkan kepada Nabi Muhammad saw untuk tetap memberikan peringatan kepada kaumnya, dengan mengajarkan kepada mereka ayat-ayat Allah tanpa menghiraukan perbuatan-perbuatan mereka yang tidak mengandung kebenaran. Allah menegaskan bahwa hamba-Nya yang bernama Muhammad saw bukanlah tukang tenung dan bukan orang gila. Adapun orang-orang kafir menuduh Nabi Muhammad saw sebagai tukang tenung karena beliau banyak memberikan berita-berita gaib tentang masa lalu. Umat-umat yang diperjuangkan nabi-nabi sebelumnya juga memberikan berita hal-hal yang akan datang seperti hari Kiamat, hari kebangkitan dan hari pengadilan (yaumulhisab) dan tentang surga serta neraka. Berita-berita gaib ini merupakan sebuah kebenaran yang diterima dari Allah. Jadi jelaslah bahwa Nabi bukan tukang tenung yang menyampaikan hal-hal yang tidak benar. Orang kafir juga menuduh Rasulullah sebagai orang gila karena beliau menyatakan dan mengajarkan bahwa Tuhan itu hanya satu, sedangkan mereka menganggap Tuhan mereka yang berjumlah empat saja banyak persoalan dunia yang tidak selesai. Jika Tuhan hanya satu maka dunia tidak terpelihara lagi, kata mereka. Beberapa orientalis Barat menyatakan Nabi punya penyakit epilepsi (ayan) seperti ketika beliau menerima wahyu tiba-tiba diam dan tidak menghiraukan keadaan sekeliling seperti orang terjangkit penyakit ayan. Tetapi pada ayat 29 ini Allah menegaskan bahwa Muhammad saw tidaklah gila sebagimana dituduhkan orang-orang kafir. Nabi Muhammad saw adalah hamba Allah yang diangkat jadi rasul, memiliki akal yang sehat, cita-cita yang tinggi, akhlak dan perilaku yang mulia. Sedangkan pada ayat 30 orang-orang kafir masih menuduh Nabi sebagai penyair karena ayat-ayat Al-Qur'an sangat indah bahasanya, susunan kalimat dan pilihan katanya sangat luar biasa. Para penyair biasa memiliki kemampuan bahasa yang indah dan biasa menyusun kalimat dan memilih kata-katanya tidak seperti manusia biasa. Menurut mereka para penyair sering menemui kematian karena kecelakaan. Oleh karena itu mereka selalu menunggu-nunggu kecelakaan yang akan menimpa Muhammad saw. Pada ayat ini Allah swt menegaskan bahwa Nabi bukanlah penyair. Bahasa yang indah, susunan kalimat dan pilihan bahasa yang luar biasa pada ayat-ayat Al-Qur'an karena ayat-ayat itu merupakan firman Allah yang diwahyukan kepada Nabi Muhammad saw dan Allah akan selalu melindungi Nabi-Nya. Firman Allah: \n\nWahai Rasul! Sampaikanlah apa yang diturunkan Tuhanmu kepadamu. Jika tidak engkau lakukan (apa yang diperintahkan itu) berarti engkau tidak menyampaikan amanat-Nya. Dan Allah memelihara engkau dari (gangguan) manusia. Sungguh, Allah tidak memberi petunjuk kepada orang-orang kafir. (al-Ma'idah\/5: 67)",
      "text_translation": "Bahkan mereka berkata, “Dia adalah seorang penyair yang kami tunggu-tunggu kecelakaan menimpanya.” ",
      "text": "اَمْ يَقُوْلُوْنَ شَاعِرٌ نَّتَرَبَّصُ بِهٖ رَيْبَ الْمَنُوْنِ ",
      "text_translation_en": "Or do they say, “[He is but] a poet - let us wait what time will do unto him”?",
      "juz_number": 27
    },
    "31": {
      "text_tafsir_en": "In this verse Allah swt tells Muhammad saw that he threatened them by waiting for their day of destruction. Muhammad also stated that he also waited as they were about the coming of the provision of God so that they would know who ends in good and who is victorious in this world and in the hereafter. The attitude of the arrogant unbelievers sometimes needs to be firmly confronted. Moreover, their accusations are overstated by saying the Prophet is a magician, a madman and all that, but their opinions are based on mere baseless prejudice. It is necessary to emphasize that the Prophet's treatise is from Almighty Allah, therefore the Prophet does not need to be afraid to prove it until the last day. (",
      "text_tafsir": "Dalam ayat ini Allah swt menegaskan kepada Muhammad saw supaya ia mengancam mereka dengan mengajak menunggu hari kehancuran mereka. Muhammad saw juga menyatakan bahwa ia juga menunggu seperti mereka mengenai akan datangnya ketentuan dari Tuhan supaya mereka mengetahui siapa yang berakhir dengan kebaikan dan siapa pula yang mendapat kemenangan di dunia dan di akhirat. Sikap orang-orang kafir yang sombong memang kadang-kadang perlu dihadapi dengan tegas. Apalagi tuduhan mereka memang sudah keterlaluan dengan menyatakan Nabi sebagai tukang tenung, sebagai orang gila dan sebagainya, padahal pendapat-pendapat mereka hanya didasarkan pada prasangka yang tidak berdasar sama sekali. Maka perlu ditegaskan bahwa risalah Nabi adalah dari Allah yang Mahakuasa, oleh karena itu Nabi tidak perlu takut membuktikan semuanya sampai di hari akhirat nanti. (",
      "text_translation": "Katakanlah (Muhammad), “Tunggulah! Sesungguhnya aku pun termasuk orang yang sedang menunggu bersama kamu.” ",
      "text": "قُلْ تَرَبَّصُوْا فَاِنِّيْ مَعَكُمْ مِّنَ الْمُتَرَبِّصِيْنَۗ  ",
      "text_translation_en": "Say thou: “Wait, [then,] hopefully; behold, I, too, shall hopefully wait with you!”",
      "juz_number": 27
    },
    "32": {
      "text_tafsir_en": "Then in this verse Allah swt asks whether the infidels are using their senses or just risking their own passions and fantasies in casting their strange and baseless accusations. The prophet is not a poet, nor a magician nor a madman. Their accusations are based solely on their excessive hatred, so they do not pay attention to their motives at all.",
      "text_tafsir": "Kemudian pada ayat ini Allah swt mempertanyakan apakah orang-orang kafir itu mempergunakan akal sehat mereka atau hanya mempertaruhkan hawa nafsu dan angan-angan belaka dalam melemparkan tuduhan-tuduhan mereka yang aneh dan tidak ada dasarnya sama sekali. Nabi memang bukan penyair, juga bukan tukang tenung dan bukan orang gila. Tuduhan-tuduhan mereka semata-mata didasarkan pada rasa benci yang berlebih-lebihan, sehingga tidak memperhatikan akal sehat sama sekali.",
      "text_translation": "Apakah mereka diperintah oleh pikiran-pikiran mereka untuk mengucapkan (tuduhan-tuduhan) ini ataukah mereka kaum yang melampaui batas?",
      "text": "اَمْ تَأْمُرُهُمْ اَحْلَامُهُمْ بِهٰذَآ اَمْ هُمْ قَوْمٌ طَاغُوْنَۚ ",
      "text_translation_en": "Is it their minds that bid them [to take] this [attitude] - or are they [simply] people filled with overweening arrogance?",
      "juz_number": 27
    },
    "33": {
      "text_tafsir_en": "In this verse by using the question sentence form, Allah explains the accusations of the unbelievers that the Prophet is considered to be an invention, declare something that was made by the Prophet Muhammad himself. This form of questioning is an encouragement for them to think of looking for answers using common sense. The verses of the Qur'an do fascinate them, both in their language and content, so they say Muhammad is a poet or a witch doctor and they even consider him a crazy person, in fact they are amazed at the verses of the Qur'an, but because they do not believe, they reject and deny the words of Allah and the prophethood of the Prophet Muhammad so they just accuse. Indeed they face a dilemma with the greatness of the Qur'an but also hate the Prophet Muhammad. Thus if someone does not get guidance from Allah, suffer inner suffering in the world, and suffer physically and mentally in the hereafter.",
      "text_tafsir": "Pada ayat ini dengan menggunakan bentuk kalimat pertanyaan, Allah menerangkan tuduhan orang-orang kafir bahwa Nabi dianggap mengada-ada, menyatakan sesuatu yang dikarangkarang sendiri oleh Nabi Muhammad saw. Bentuk pertanyaan ini merupakan suatu dorongan agar mereka berpikir untuk mencari jawaban dengan menggunakan akal sehat. Ayat-ayat Al-Qur'an memang memesona mereka, baik rangkaian bahasanya maupun isi kandungannya, sehingga mereka mengatakan Muhammad adalah penyair atau tukang tenung bahkan mereka anggap sebagai orang gila, sebetulnya mereka terkagum-kagum pada ayat Al-Qur'an, tetapi karena mereka tidak beriman, mereka menolak dan mengingkari firman-firman Allah dan kenabian Nabi Muhammad maka mereka asal tuduh saja. Memang mereka menghadapi dilema dengan kehebatan Al-Qur'an tetapi juga benci kepada Nabi Muhammad saw. Demikianlah jika seseorang tidak mendapat hidayah dari Allah swt, menderita batin di dunia, dan menderita lahir batin di akhirat nanti.",
      "text_translation": "Ataukah mereka berkata, “Dia (Muhammad) mereka-rekanya.” Tidak! Merekalah yang tidak beriman. ",
      "text": "اَمْ يَقُوْلُوْنَ تَقَوَّلَهٗۚ بَلْ لَّا يُؤْمِنُوْنَۚ ",
      "text_translation_en": "Or do they say, “He himself has composed this [message]”? Nay, but they are not willing to believe!",
      "juz_number": 27
    },
    "34": {
      "text_tafsir_en": "Then in this verse Allah answers sharing their accusations against the Prophet Muhammad with the challenge of trying to do what the Prophet has said. If Muhammad saw the poet, then many of them were good poets. If the Prophet is accused of witchcraft, is it not among them that there are also many wizards. Or if he is accused of conspiracy, is it not that among them are also many speakers, fluent in the beauty of his speech, and so forth. Why, then, are they incapable of making a Qur'anic statement when they are true to their accusations. They even have great personalities who are proficient in speaking, singing, and have extensive experience working in the language of poetry or prose. Do they know the history of the Arabs more than Muhammad saw? However, in fact they are still unable to make a chapter like the Qur'an even though they all work together in groups.",
      "text_tafsir": "Kemudian dalam ayat ini Allah menjawab berbagi tuduhan mereka terhadap Nabi Muhammad saw dengan tantangan untuk mencoba membuat seperti apa yang telah disampaikan oleh Nabi. Kalau Muhammad saw itu dituduh penyair, maka di tengah-tengah mereka itu banyak penyair yang fasih. Kalau Nabi dituduh tukang tenung, bukankah di tengah-tengah mereka juga banyak tukang tenung yang ahli. Atau kalau ia dituduh mengada-adakan, bukankah di tengah-tengah mereka itu juga banyak ahli pidato, lancar berbicara dengan keindahan tutur katanya, dan sebagainya. Maka mengapakah mereka, tidak sanggup membuat suatu ungkapan seperti Al-Qur'an bila mereka memang orang-orang yang benar dalam tuduhan mereka. Bahkan mereka mempunyai tokoh-tokoh ahli yang punya kemampuan besar dalam berpidato, bersyair, dan telah banyak pengalaman bekerja dengan menggunakan gaya bahasa puisi atau prosa. Mereka mengetahui benar sejarah bangsa Arab lebih dari pengetahuan Muhammad saw? Walaupun demikian, nyatanya mereka masih tidak mampu membuat suatu surah pun seperti Al-Qur'an meskipun mereka semua bekerja sama secara kelompok.",
      "text_translation": "Maka cobalah mereka membuat yang semisal dengannya (Al-Qur'an) jika mereka orang-orang yang benar. ",
      "text": "فَلْيَأْتُوْا بِحَدِيْثٍ مِّثْلِهٖٓ اِنْ كَانُوْا صٰدِقِيْنَۗ  ",
      "text_translation_en": "But then, [if they deem it the work of a mere mortal,] let them produce another discourse like it - if what they say be true!",
      "juz_number": 27
    },
    "35": {
      "text_tafsir_en": "In this verse Allah affirms whether the disbelievers deny God as the Creator who made the universe, or they assume that they were created that well without a creator. However, reason determines that everything that exists comes from nothing. This shows a proof that there is something that creates it, there must be someone who created it. Or do they assume that they created them? Their assumptions like this are certainly contrary to common sense, because every thing must have caused and existed.",
      "text_tafsir": "Dalam ayat ini Allah menegaskan apakah orang-orang kafir itu mengingkari Allah sebagai Pencipta yang menjadikan semesta alam ini, atau mereka menganggap bahwa mereka itu diciptakan sebagus itu tanpa adanya pencipta. Namun, akal menetapkan bahwa setiap yang ada berasal dari tiada. Ini menunjukkan suatu bukti bahwa ada sesuatu yang mengadakannya pasti ada yang menciptakannya. Ataukah mereka menganggap bahwa diri mereka sendiri yang menciptakan mereka. Anggapan mereka seperti ini tentulah bertentangan dengan akal yang sehat, sebab setiap sesuatu itu harus ada yang menyebabkan adanya dan yang mengadakannya.",
      "text_translation": "Atau apakah mereka tercipta tanpa asal-usul ataukah mereka yang menciptakan (diri mereka sendiri)?",
      "text": "اَمْ خُلِقُوْا مِنْ غَيْرِ شَيْءٍ اَمْ هُمُ الْخَالِقُوْنَۗ  ",
      "text_translation_en": "[Or do they deny the existence of God?] Have they themselves been created without anything [that might have caused their creation]? or were they, perchance, their own creators?",
      "juz_number": 27
    },
    "36": {
      "text_tafsir_en": "Then in this verse Allah again states that they created themselves, do they dare to say that they created this universe (heaven and earth), while in them are all the causes of their lives? They must not be convinced of themselves and are inconsistent with what they say, because when asked who made them and who made heaven and earth, they would say, \"God made it.\" Indeed, if they believe, they will not disobey Allah.",
      "text_tafsir": "Kemudian dalam ayat ini Allah menegaskan pula dengan menyatakan kalau mereka itu menciptakan diri mereka sendiri, apakah juga mereka berani berkata bahwa mereka menciptakan alam semesta ini (langit dan bumi), sedangkan pada keduanya terdapat segala penyebab kehidupan mereka? Mereka pasti tidak dapat meyakinkan diri sendiri dan tidak konsekuen terhadap apa yang mereka katakan, karena bila ditanyai siapa yang menjadikannya dan yang menjadikan langit dan bumi, pasti mereka akan berkata, \"Allahlah yang menjadikan itu.\" Sesungguhnya bila mereka meyakini, mereka tidak akan mengingkari keesaan Allah.",
      "text_translation": "Ataukah mereka telah menciptakan langit dan bumi? Sebenarnya mereka tidak meyakini (apa yang mereka katakan).",
      "text": "اَمْ خَلَقُوا السَّمٰوٰتِ وَالْاَرْضَۚ بَلْ لَّا يُوْقِنُوْنَۗ  ",
      "text_translation_en": "[And] have they created the heavens and the earth? Nay, but they have no certainty of anything!",
      "juz_number": 27
    },
    "37": {
      "text_tafsir_en": "It is further stated in this verse as a question of whether they act as rulers and in the hands of the treasury of God. Then do they confer the prophecies on whom they please and choose whom they please? Or are they the people in power so that they can control the affairs of the universe, and then they do something at their will and will? The truth is not so. But it is Allah the Almighty, who controls and does all that He pleases. Narrated by Imam al-Bukhari of az-Zuhri, from Muhammad bin Jubair bin Muth'im his father said, \"I heard the Prophet Muhammad reciting Surah ath-thur during the evening prayer. When I came to this verse 35-37, my heart almost felt Jubair bin Muth'im came to Prophet Muhammad after the Battle of Badr in prison. He was still a Muslim and he listened to this verse and finally converted to Islam. \"",
      "text_tafsir": "Selanjutnya dinyatakan pada ayat ini dalam bentuk pertanyaan, apakah mereka bertindak selaku penguasa dan di tangan mereka perbendaharaan Tuhan. Kemudian mereka menganugerahkan jabatan kenabian kepada siapa yang mereka kehendaki dan memilih orang-orang yang mereka senangi? Ataukah mereka itu orang-orang yang berkuasa sehingga mereka mengatur urusan alam semesta, kemudian mereka menjadikan sesuatu atas kehendak dan kemauan mereka? Kenyataannya tidak demikian. Akan tetapi Allah-lah Yang Mahakuasa, yang mengatur dan menjadikan semuanya yang dikehendaki-Nya. Diriwayatkan oleh Imam al-Bukhari dari az-Zuhri, dari Muhammad bin Jubair bin Muth'im bapaknya berkata, \"Saya mendengar Nabi Muhammad saw membaca Surah ath-thur ketika salat Magrib. Ketika telah sampai pada ayat 35-37 ini, jantungku hampir terasa melayang. Dan Jubair bin Muth'im telah datang kepada Nabi Muhammad saw setelah Perang Badar dalam tahanan. Saat itu dia masih seorang musyrik. Kemudian dia mendengarkan ayat ini yang akhirnya ia masuk Islam.\"",
      "text_translation": "Ataukah di sisi mereka ada perbendaharaan Tuhanmu ataukah mereka yang berkuasa?",
      "text": "اَمْ عِنْدَهُمْ خَزَاۤىِٕنُ رَبِّكَ اَمْ هُمُ الْمُصَۣيْطِرُوْنَۗ  ",
      "text_translation_en": "[How could they?] Are thy Sustainer’s treasures with them? Or are they in charge [of destiny]?",
      "juz_number": 27
    },
    "38": {
      "text_tafsir_en": "In this verse Allah swt says in the tone of the question, if they have the stairs to ascend to heaven, then they can hear the angel's word on the divine problems which God has revealed. In fact, they only hold on to their passions. They admit it, then they try to present a clear proof, which explains the truth of their confession which rejects the leaflet as proof that Muhammad saw from his Lord.",
      "text_tafsir": "Dalam ayat ini Allah swt menyatakan dengan nada pertanyaan, apakah mereka mempunyai tangga untuk naik ke langit, kemudian mereka dapat mendengarkan perkataan malaikat tentang masalah-masalah gaib yang diwahyukan Allah. Sebenarnya mereka hanya berpegang kepada hawa nafsu saja. Mereka mengakui hal itu, maka cobalah mereka mengemukakan suatu bukti yang nyata, yang menerangkan kebenaran pengakuan mereka itu yang menolak risalah seperti pembuktian yang dibawa oleh Muhammad saw dari Tuhannya.",
      "text_translation": "Atau apakah mereka mempunyai tangga (ke langit) untuk mendengarkan (hal-hal yang gaib)? Maka hendaklah orang yang mendengarkan di antara mereka itu datang membawa keterangan yang nyata. ",
      "text": "اَمْ لَهُمْ سُلَّمٌ يَّسْتَمِعُوْنَ فِيْهِۚ فَلْيَأْتِ مُسْتَمِعُهُمْ بِسُلْطٰنٍ مُّبِيْنٍۗ  ",
      "text_translation_en": "Or have they a ladder by which they could [ascend to ultimate truths and] listen [to what is beyond the reach of human perception]? Let, then, any of them who have listened [to it] produce a manifest proof [of his knowledge]!",
      "juz_number": 27
    },
    "39": {
      "text_tafsir_en": "In this verse Allah swt asks them by saying whether they think God has daughters called angels, while they have sons, but they know boys are more desirable than daughters. In this verse God says: That is surely an unfair division. (anNajm \/ 53: 2) It is a complement of explanations that anyone who thinks so, it is clear that he does not belong to a man of sound mind.",
      "text_tafsir": "Dalam ayat ini Allah swt bertanya kepada mereka dengan mengatakan apakah menurut mereka Tuhan mempunyai anak-anak perempuan yang dinamakan malaikat, sedangkan mereka mempunyai anak laki-laki, padahal mereka tahu anak laki-laki lebih diinginkan dari pada anak perempuan. Dalam ayat ini Allah berfirman: \n\nYang demikian itu tentulah suatu pembagian yang tidak adil. (anNajm\/53: 2) \n\nIni merupakan kelengkapan penjelasan bahwa barang siapa yang berpendapat seperti itu, jelaslah bahwa dia tidak termasuk orangorang yang mempunyai pikiran yang sehat.",
      "text_translation": "Ataukah (pantas) untuk Dia anak-anak perempuan sedangkan untuk kamu anak-anak laki-laki?",
      "text": "اَمْ لَهُ الْبَنٰتُ وَلَكُمُ الْبَنُوْنَۗ  ",
      "text_translation_en": "Or, [if you believe in God, how can you believe that] He has [chosen to have] daughters, whereas you yourselves would have [only] sons?",
      "juz_number": 27
    },
    "40": {
      "text_tafsir_en": "In this verse Allah swt asked them, should Muhammad saw the wages of the Muslims, when Allah sent him to invoke, invoke God and obey Him? You mean, isn't it the wage that Muhammad saw demanded their burden so that they could not fulfill Muhammad's call? These questions dispel their accusations, especially if the Prophet Muhammad asked for a wage.",
      "text_tafsir": "Pada ayat ini Allah swt bertanya kepada mereka, perlukah Muhammad saw meminta upah kepada orang-orang musyrik, sedangkan dia diutus Allah swt kepada mereka untuk mengajak, mengesakan Tuhan dan taat kepada-Nya? Andaikata demikian, tidaklah upah yang diminta Muhammad saw itu memberatkan beban mereka sehingga mereka tidak dapat memenuhi seruan Muhammad? Pertanyaan ini mematahkan tuduhan mereka, apalagi jika Nabi Muhammad meminta upah kepada mereka.",
      "text_translation": "Ataukah engkau (Muhamamd) meminta imbalan kepada mereka sehingga mereka dibebani dengan utang?",
      "text": "اَمْ تَسْـَٔلُهُمْ اَجْرًا فَهُمْ مِّنْ مَّغْرَمٍ مُّثْقَلُوْنَۗ  ",
      "text_translation_en": "Or is it that [they who reject thy message, O Muhammad, fear lest] thou ask of them a reward, so that they would be burdened with debt [if they should listen to thee]?",
      "juz_number": 27
    },
    "41": {
      "text_tafsir_en": "Then in this verse God asks them if they have any unknown supernatural knowledge, which they write for human purposes? Then do they tell people what they want? It is impossible for them to have supernatural knowledge because no one knows the wonders of heaven and earth except Allah. The Qatadah says this verse is an answer to their word that they are waiting for the turn of the day (Muhammad's death before them). So Allah confirmed whether they had any knowledge of the supernatural until they knew that Muhammad saw would die before them",
      "text_tafsir": "Selanjutnya dalam ayat ini Allah bertanya kepada mereka apakah mereka mempunyai ilmu gaib yang tidak diketahui manusia, yang mereka tulis untuk keperluan manusia? Kemudian mereka memberitahukannya kepada manusia semau mereka? Tidaklah mungkin mereka mempunyai ilmu gaib karena tidak ada yang mengetahui kegaiban langit dan bumi kecuali Allah. Qatadah berkata, ayat ini merupakan jawaban terhadap perkataan mereka bahwa mereka menunggu perputaran masa (kematian Muhammad sebelum mereka). Maka Allah menegaskan, apakah ada pada mereka pengetahuan tentang yang gaib sehingga mereka mengetahui bahwa Muhammad saw akan wafat sebelum mereka",
      "text_translation": "Ataukah di sisi mereka mempunyai (pengetahuan) tentang yang gaib lalu mereka menuliskannya?",
      "text": "اَمْ عِنْدَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُوْنَۗ ",
      "text_translation_en": "Or [do they think] that the hidden reality [of all that exists] is almost within their grasp, so that [in time] they can write it down?",
      "juz_number": 27
    },
    "42": {
      "text_tafsir_en": "Then in this verse Allah swt says to them whether they (the Muslims) deceive mankind and the Messenger with their words about the apostles and the religion? If this is what they want, then their deceit will come back to them.",
      "text_tafsir": "Kemudian dalam ayat ini Allah swt berkata kepada mereka apakah mereka (orang-orang musyrik) hendak menipu manusia dan Rasul dengan perkataan mereka tentang rasul dan agama? Kalau memang ini yang mereka kehendaki, maka tipu daya mereka akan kembali kepada mereka sendiri.",
      "text_translation": "Ataukah mereka hendak melakukan tipu daya? Tetapi orang-orang yang kafir itu, justru merekalah yang terkena tipu daya.",
      "text": "اَمْ يُرِيْدُوْنَ كَيْدًاۗ فَالَّذِيْنَ كَفَرُوْا هُمُ الْمَكِيْدُوْنَۗ  ",
      "text_translation_en": "Or do they want to entrap [thee in contradic­tions]? But they who are bent on denying the truth - it is they who are truly entrapped!",
      "juz_number": 27
    },
    "43": {
      "text_tafsir_en": "Furthermore, in this verse Allah tells them whether they have a god besides Allah who helps and saves them from the torment of Allah swt. Sanctify Allah from what they associate with and from whom they worship besides Him. These questions are offensive to unbelievers to find the right answer based on common sense. This is a harsh criticism of the idolaters, of their worship of idols as they are associated with God.",
      "text_tafsir": "Selanjutnya, pada ayat ini Allah berkata kepada mereka, apakah mereka mempunyai Tuhan selain Allah yang membantu dan menghindarkan mereka dari siksa Allah swt. Mahasuci Allah dari apa yang mereka persekutukan dan dari yang mereka sembah selain Dia. Pertanyaan-pertanyaan ini adalah menyinggung orang-orang kafir untuk menemukan jawaban yang benar yang didasarkan pada akal sehat. Ini merupakan kecaman keras kepada orang-orang musyrik, terhadap penyembahan mereka kepada berhala sebagai yang dipersekutukan mereka terhadap Allah.",
      "text_translation": "Ataukah mereka mempunyai tuhan selain Allah? Mahasuci Allah dari apa yang mereka persekutukan.",
      "text": "اَمْ لَهُمْ اِلٰهٌ غَيْرُ اللّٰهِ ۗسُبْحٰنَ اللّٰهِ عَمَّا يُشْرِكُوْنَ  ",
      "text_translation_en": "Have they, then, any deity other than God? Utterly remote is God, in His limitless glory, from anything to which men may ascribe a share in His divinity!",
      "juz_number": 27
    },
    "44": {
      "text_tafsir_en": "In this verse it is depicted that the unbelievers were a proud and stubborn people. Even to them were shown signs of torment that would come upon them with the advent of a cloud that would bring them disaster. But they look so light and just look at it as clumps of clouds playing around and stacking against each other. This is because their hearts are closed and the urgency of important questions has blinded their eyes. They still deny what they see with their own eyes. In the same verse it means that God said: And if We had opened to them one of the gates of heaven, and they would have gone up to it, they would have said, \"Truly, we have been blinded, even though we are magic.\" (al-hijr \/ 15: 14-15)",
      "text_tafsir": "Dalam ayat ini digambarkan bahwa orang-orang musyrik itu adalah kaum yang berwatak sombong dan keras kepala. Walaupun kepada mereka diperlihatkan tanda-tanda azab yang akan menimpa mereka dengan datangnya sekumpulan awan yang akan membawa bencana bagi mereka. Tetapi mereka menganggap ringan dan hanya memandang sebagai gumpalan awan yang sedang bermain-main dan saling bertumpuk. Hal ini disebabkan hati mereka sudah tertutup dan bersikap menyepelekan persoalan penting telah membutakan pandangan mereka. Mereka tetap mengingkari apa yang mereka lihat dengan mata kepala mereka sendiri. Dalam ayat yang sama artinya Allah berfirman: \n\nDan kalau Kami bukakan kepada mereka salah satu pintu langit, lalu mereka terus menerus naik ke atasnya, tentulah mereka berkata, \"Sesungguhnya pandangan kamilah yang dikaburkan, bahkan kami adalah orang yang terkena sihir.\" (al-hijr\/15: 14-15)",
      "text_translation": "Dan jika mereka melihat gumpalan-gumpalan awan berjatuhan dari langit, mereka berkata, “Itu adalah awan yang bertumpuk-tumpuk.” ",
      "text": "وَاِنْ يَّرَوْا كِسْفًا مِّنَ السَّمَاۤءِ سَاقِطًا يَّقُوْلُوْا سَحَابٌ مَّرْكُوْمٌ ",
      "text_translation_en": "AND YET, if they [who refuse to see the truth] were to see part of the sky falling down, they would [only] say, “[It is but] a mass of clouds!”",
      "juz_number": 27
    },
    "45": {
      "text_tafsir_en": "Then Allah commanded His Messenger to leave them in such a stubborn state, and not to neglect them until the day came when they would be avenged for their crimes, in the Battle of Badr, as alBiqa'i says according to the verse this, or until the day of man's resurrection in the hereafter, as the word of God says: And when the trumpet shall sound, then all (beings) in heaven and on earth shall die except those whom Allah will. Then it blows again, and immediately they rise (from their graves) waiting (Allah's decision). (azZumar \/ 39: 68)",
      "text_tafsir": "Kemudian Allah memerintahkan kepada Rasul-Nya untuk membiarkan mereka dalam keadaan keras kepala seperti itu, dan tidak mengacuhkan mereka hingga datangnya suatu hari dimana mereka akan dibalas dengan kehancuran disebabkan oleh kejahatan mereka, yaitu pada Perang Badar seperti yang dikatakan oleh alBiqa'i menurut dzahir ayat ini, atau sampai datang hari kebangkitan manusia di akhirat, sebagaimana firman Allah: \n\nDan sangkakala pun ditiup, maka matilah semua (makhluk) yang di langit dan di bumi kecuali mereka yang dikehendaki Allah. Kemudian ditiup sekali lagi (sangkakala itu) maka seketika itu mereka bangun (dari kuburnya) menunggu (keputusan Allah). (azZumar\/39: 68)",
      "text_translation": "Maka biarkanlah mereka hingga mereka menemui hari (yang dijanjikan kepada) mereka, pada hari itu mereka dibinasakan, ",
      "text": "فَذَرْهُمْ حَتّٰى يُلٰقُوْا يَوْمَهُمُ الَّذِيْ فِيْهِ يُصْعَقُوْنَۙ  ",
      "text_translation_en": "Hence, leave them alone until they face that [Judgment] Day of theirs, when they will be stricken with terror:",
      "juz_number": 27
    },
    "46": {
      "text_tafsir_en": "In this verse Allah explains that on that day it would not be useful for them to devise a plot against Muhammad (peace be upon him) to incite a fire of hostility to him. And they will not get help or help that will hinder the punishment of Allah that befalls them",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa pada hari itu tidaklah berguna bagi mereka tipu daya yang telah mereka atur terhadap Muhammad saw untuk membangkitkan api permusuhan kepadanya. Dan mereka tidak akan mendapat bantuan atau pertolongan yang dapat menghalangi azab Allah yang menimpa mereka",
      "text_translation": "(yaitu) pada hari (ketika) tipu daya mereka tidak berguna sedikit pun bagi mereka dan mereka tidak akan diberi pertolongan.",
      "text": "يَوْمَ لَا يُغْنِيْ عَنْهُمْ كَيْدُهُمْ شَيْـًٔا وَّلَا هُمْ يُنْصَرُوْنَۗ  ",
      "text_translation_en": "the Day when none of their scheming will be of the least avail to them, and they will receive no succour.",
      "juz_number": 27
    },
    "47": {
      "text_tafsir_en": "Allah swt explains that the disbelievers who persecute themselves with their disbelief and disobedience will receive a painful torment in the hereafter. In addition, in the world they suffered a seven-year famine before the Battle of Badr, and a great defeat in that war. However, most of them do not know that Allah will inflict His punishment upon them both in this world and in the Hereafter. In the same verse it means that Allah says: And surely We send upon them a near torment (before the world) before the greater torment (hereafter); for them to return (to the right way). (as-Sajdah \/ 32: 21)",
      "text_tafsir": "Allah swt menjelaskan bahwa orang-orang kafir yang menganiaya diri mereka sendiri dengan kekufuran dan kemaksiatan mereka, akan mendapatkan azab yang pedih di akhirat. Di samping itu di dunia pun mereka memperoleh azab berupa kelaparan selama tujuh tahun sebelum terjadinya Perang Badar, dan kekalahan besar pada perang tersebut. Namun, kebanyakan mereka tidak mengetahui bahwasanya Allah akan menimpakan azab-Nya kepada mereka baik di dunia maupun di akhirat. Dalam ayat yang sama artinya Allah berfirman: \n\nDan pasti Kami timpakan kepada mereka sebagian siksa yang dekat (di dunia) sebelum azab yang lebih besar (di akhirat); agar mereka kembali (ke jalan yang benar). (as-Sajdah\/32: 21)",
      "text_translation": "Dan sesungguhnya bagi orang-orang yang zalim masih ada azab selain itu. Tetapi kebanyakan mereka tidak mengetahui.",
      "text": "وَاِنَّ لِلَّذِيْنَ ظَلَمُوْا عَذَابًا دُوْنَ ذٰلِكَ وَلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ ",
      "text_translation_en": "But, verily, for those who are bent on doing evil, there is suffering in store [even] closer at hand than that [supreme suffering in the hereafter]: but most of them are not aware of it.",
      "juz_number": 27
    },
    "48": {
      "text_tafsir_en": "After explaining the great circumstances, the sadness of the apostles, as a result of the rebellious and stubborn actions of unbelievers and unbelievers who refused to believe in God and his apostles. In this case, Allah ordered Muhamamd saw to be patient with his people and to ignore them, to keep his commands and warn of his prohibitions, and to convey what he had been revealed, because Allah always saw and watched his work and care and protect it from the annoyance and obstacles of its enemies. Praise and praise of the Lord as he rises and stands, includes three conditions, namely: 1. When he rises from sleep 2. When he rises from his sitting 3. When he wakes up in prayer This contains wisdom that believers should always praise, in all situations and conditions. however, it is mainly a change from one situation to another. Atha ', Sa'id, Sufyan ats-sauri, and Abul Ahwas say: that the Prophet Muhammad (peace be upon him) exalted when he arose from his seat. Some Hadiths: From Abu Barzah al-Aslami said, Allah's Messenger at the end of his life, when he got up from his seat, said, \"Subhanaka Allahumma wabihamdika asyahadu an la ilaha illa anta astagfiruka wa face faceika! The Messenger of Allah (may peace be upon him) said, \"This is a remission of sins from any wrongdoing that may occur at the ceremony.\" (Abu Dawud and Nasa'i's History) It is reported that Gabriel taught the Prophet Muhammad to read the words as he rose and sitting in one ceremony: \"Holiness to you, O God, in your praise, I testify that there is no God but You, I beg your pardon and I repent to you.\" (History of Dawud and an-Nasa'i)",
      "text_tafsir": "Setelah menjelaskan berbagai situasi yang besar, menyedihkan hati rasul, akibat tindakan membangkang dan keras kepala orang-orang kafir dan musyrik yang menolak beriman kepada Allah dan rasulnya. Maka dalam hal ini, Allah memerintahkan kepada Muhamamd saw supaya bersabar terhadap gangguan kaumnya dan tidak lagi menghiraukan mereka, serta tetap menyampaikan perintah-Nya dan memperingatkan larangan-Nya, dan menyampaikan apa yang telah diwahyukan kepadanya, sebab Allah selalu melihatnya dan memperhatikan pekerjaannya serta menjaga dan melindunginya dari gangguan dan rintangan musuhnya. Perihal bertasbih dan memuji Tuhan ketika bangun dan berdiri, meliputi tiga keadaan, yaitu: 1. Ketika bangun dari tidur 2. Ketika bangun dari duduk 3. Ketika bangun akan salat Hal ini mengandung hikmah supaya orang mukmin selalu bertasbih setiap saat, dalam situasi dan kondisi bagaimanapun, terutama perubahan dari suatu keadaan ke keadaan yang lain. Atha', Sa'id, Sufyan ats-sauri, dan Abul Ahwas berkata: bahwa Nabi Muhammad saw bertasbih tatkala ia bangkit dari tempat duduknya. Sebagian hadis: Dari Abu Barzah al-Aslami berkata, Rasulullah saw pada akhir hayatnya, apabila beliau bangun dari tempat duduknya beliau mengucapkan, \"Subhanaka Allahumma wabihamdika asyahadu an la ilaha illa anta astagfiruka wa atubu ilaika! Engkau mengucapkan suatu ucapan yang belum pernah engkau ucapkan sebelumnya. Rasulullah saw bersabda, \"Ucapan ini penghapus dosa dari kesalahan-kesalahan yang mungkin terjadi di majlis.\" (Riwayat Abu Dawud dan an-Nasa'i) \n\nDiriwayatkan bahwasanya Jibril telah mengajarkan kepada Nabi Muhammad saw agar ucapan tersebut dibaca ketika hendak bangkit dan duduk dalam satu majlis yaitu: \"Mahasuci engkau, wahai Allah, dengan memuji-Mu, aku bersaksi bahwa tiada Tuhan selain Engkau, aku mohon pengampunan-Mu dan aku bertobat kepada-Mu.\" (Riwayat Abu Dawud dan an-Nasa'i)",
      "text_translation": "Dan bersabarlah (Muhammad) menunggu ketetapan Tuhanmu, karena sesungguhnya engkau berada dalam pengawasan Kami, dan bertasbihlah dengan memuji Tuhanmu ketika engkau bangun, ",
      "text": "وَاصْبِرْ لِحُكْمِ رَبِّكَ فَاِنَّكَ بِاَعْيُنِنَا وَسَبِّحْ بِحَمْدِ رَبِّكَ حِيْنَ تَقُوْمُۙ  ",
      "text_translation_en": "And so, await in patience thy Sustainer’s judgment, for thou art well within Our sight. And extol thy Sustainer’s limitless glory and praise whenever thou risest up,",
      "juz_number": 27
    },
    "49": {
      "text_tafsir_en": "Then Allah in this verse ordered Muhammad to pray to Allah in the night prayers. For worship at that time was difficult to perform, and far from joyous, and so that he might pray when the stars were submerged at dawn. In the same verse it means that Allah says: And in the evening, perform the additional Prayer (as a worship) for you: may your Lord lift you to a place of praise. (al-Isra '\/ 17: 79) The meaning of reading the beads in this verse can mean reading the beads as in the above hadith, and can also mean performing the prayers, both the Islamic prayers, the night prayers and the morning prayers.",
      "text_tafsir": "Kemudian Allah dalam ayat ini memerintahkan kepada Muhammad saw supaya ia bertasbih kepada Allah dengan salat malam. Karena ibadah pada waktu itu berat melaksanakannya, dan jauh dari ria, dan supaya ia salat tatkala terbenamnya bintangbintang pada waktu subuh. Dalam ayat yang sama artinya Allah berfirman: \n\nDan pada sebagian malam, lakukanlah salat Tahajud (sebagai suatu ibadah) tambahan bagimu: mudah-mudahan Tuhanmu mengangkatmu ke tempat yang terpuji. (al-Isra'\/17: 79) \n\nMakna membaca tasbih dalam ayat ini dapat berarti membaca tasbih seperti pada hadis di atas, juga dapat diartikan melaksanakan salat, baik salat Isya, salat malam maupun salat Subuh.",
      "text_translation": "dan pada sebagian malam bertasbihlah kepada-Nya dan (juga) pada waktu terbenamnya bintang-bintang (pada waktu fajar).",
      "text": "وَمِنَ الَّيْلِ فَسَبِّحْهُ وَاِدْبَارَ النُّجُوْمِ ࣖ",
      "text_translation_en": "and extol His glory at night, and at the time when the stars retreat.",
      "juz_number": 27
    }
  },
  "name": "الطور",
  "name_translation_en": "The Mount",
  "name_translation": "Bukit Tursina",
  "name_latin": "At-Tur"
}