{
  "number": 54,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 55,
  "ayat": {
    "1": {
      "text_tafsir_en": "God declares that the Day of Resurrection is near, when the life of the world will end. In another verse the meaning of Allah says: Allah's Ruling will surely come, so do not ask for it to be hastened. (an-Nahl \/ 16: 1) Allah says: It is nearer to mankind their calculations of charity, while they are in a state of ignorance (with the world), turned away (from the Hereafter). (al-Anbiya '\/ 21: 1) At that time the moon will break apart as a result of deviation from its circulation, as stated in other verses with the same meaning: When the heavens are divided. (al-Insyiqaq \/ 84: 1) And his word: When the sun is up, and the stars fall. (at-Takwir \/ 81: 1-2) Many other verses show the terrible events that will occur during the destruction of this world by the time of the Resurrection. Most disbelievers think that the events in the first verse have occurred and that the moon was split in the time of Prophet Muhammad, five years before his departure. According to the hadith narrated by al-Bukhari, Muslims and Ibn Jarir of Anas bin Malik said that the people of Mecca asked the Prophet Muhammad to perform a miracle as proof of his apostasy, so Allah revealed to them the second month, so that they saw \"Jabal Nur\" between the two months. It is narrated from Sahih alBukhari, Muslims and other narrators of Ibn Mas'ud that: \"The moon was split in the time of Prophet Muhammad, two sides, one on top of a hill and another under it, one as Muhammad Abu Dawud exclaimed, \"Watch it!\" Then one of them said, \"Wait for the news brought by the arrivals, because Muhammad saw that he could not destroy all mankind.\" Then the travelers brought news of the incident. Then in the history of al-Baihaqi there is an addition, \"Then they asked the pilgrims who came from all directions, their answer,\" We have seen it, \"and Allah sent down this verse, \"Some interpreters think that the moon is part of the Prophet's part of his miracle. But some interpreters believe that the moon must have been divided not in the prophetic time, but will happen later in the Day of Judgment. this is due to the loss of balance of attraction between planets. (",
      "text_tafsir": "Allah menyatakan bahwa hari Kiamat hampir datang, pada waktu kehidupan dunia akan berakhir. Dalam ayat lain yang bersamaan maksudnya Allah berfirman: \n\nKetetapan Allah pasti datang, maka janganlah kamu meminta agar dipercepat (datang)nya. (an-Nahl\/16: 1) \n\nAllah berfirman: \n\nTelah semakin dekat kepada manusia perhitungan amal mereka, sedang mereka dalam keadaan lalai (dengan dunia), berpaling (dari akhirat). (al-Anbiya'\/21: 1) \n\nPada waktu itu bulan akan pecah bercerai-berai akibat penyimpangan dari peredarannya, sebagaimana diutarakan dalam ayat-ayat yang lain yang bersamaan maksudnya: \n\nApabila langit terbelah. (al-Insyiqaq\/84: 1) \n\nDan firman-Nya: \n\nApabila matahari digulung, dan apabila bintang-bintang berjatuhan. (at-Takwir\/81: 1-2) \n\nBanyak lagi ayat lain yang menunjukkan kejadian yang sangat dahsyat yang akan terjadi ketika hancurnya alam ini dengan tibanya hari Kiamat. Kebanyakan mufasir berpendapat bahwa kejadian tersebut pada ayat pertama telah terjadi dan bulan telah terbelah dua pada masa Nabi Muhammad saw, lima tahun sebelum beliau hijrah. Menurut hadis yang diriwayatkan al-Bukhari, Muslim dan Ibnu Jarir dari Anas bin Malik bahwa penduduk Mekah meminta kepada Nabi Muhammad saw, agar mengemukakan suatu mukjizat sebagai bukti kerasulannya, maka Allah memperlihatkan kepada mereka bulan terbelah dua, sehingga mereka melihat \"Jabal Nur\" berada di antara dua belahan bulan tersebut. Diriwayatkan pula dari Sahih alBukhari, Muslim dan para perawi-perawi hadis lainnya dari Ibnu Mas'ud bahwa: \"Bulan telah terbelah pada masa Nabi Muhammad saw, menjadi dua belah, sebelah berada di atas bukit dan yang lain berada di bawahnya, seraya Nabi Muhammad saw berseru, \"Saksikanlah!\" Abu Dawud meriwayatkan pula bahwa, \"Telah terjadi pembelahan bulan pada masa Nabi Muhammad saw, maka orang-orang Quraisy berkata, \"Ini adalah sihir anak Abu Kabsyah.\" Lalu seorang dari mereka berkata, \"Tunggulah dahulu berita yang dibawa oleh para musafir yang tiba, karena Muhammad saw tak sanggup mensihirkan semua manusia.\" Lalu tibalah para musafir membawa berita kejadian tersebut. Lalu dalam riwayat al-Baihaqi terdapat tambahan, \"Lalu mereka bertanya kepada para musafir yang berdatangan dari semua penjuru, jawaban mereka, \"Sungguh kami telah melihatnya,\" lalu Allah menurunkan ayat ini, \"Telah dekat (datangnya) saat itu dan telah terbelah bulan.\" Para ahli tafsir berbeda pendapat tentang terbelahnya bulan. Sebagian berpendapat bahwa bulan itu memang telah terbelah pada masa Nabi sebagai bagian dari mukjizatnya. Tetapi sebagian mufasir berpendapat bulan pasti terbelah bukan terjadi pada masa nabi, tetapi akan terjadi nanti pada saat hari Kiamat. Hal ini disebabkan karena hilangnya keseimbangan daya tarik menarik antar planet. (",
      "text_translation": " Saat (hari Kiamat) semakin dekat, bulan pun terbelah. ",
      "text": "اِقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ ",
      "text_translation_en": "THE LAST HOUR draws near, and the moon is split asunder!",
      "juz_number": 27
    },
    "2": {
      "text_tafsir_en": "The unbelievers saw evidence of the truth of Muhammad's letter, so they turned their backs on him and denied him, saying, \"This is the magic that will dazzle us. Thus if there is no faith, even though his mind may accept the truth of the Qur'an and empirically appear in the actions and behavior of the Prophet who proves his admonition, they still disobey the truth before their eyes. (",
      "text_tafsir": "Kaum musyrik melihat suatu bukti tentang kebenaran kerasulan Muhammad, maka mereka berpaling dan mendustakan serta mengingkarinya sambil berkata bahwa, \"Ini adalah sihir yang memesonakan kita yang akan terus-menerus dilakukannya.\" Demikianlah jika memang tidak ada iman, maka meskipun pikirannya dapat menerima kebenaran Al-Qur'an dan secara empirik terlihat pada perbuatan dan perilaku Nabi yang membuktikan kerasulan beliau, tetapi mereka tetap ingkar pada kebenaran yang ada di depan mata mereka. (",
      "text_translation": "Dan jika mereka (orang-orang musyrikin) melihat suatu tanda (mukjizat), mereka berpaling dan berkata, “(Ini adalah) sihir yang terus menerus.” ",
      "text": "وَاِنْ يَّرَوْا اٰيَةً يُّعْرِضُوْا وَيَقُوْلُوْا سِحْرٌ مُّسْتَمِرٌّ",
      "text_translation_en": "But if they [who reject all thought of the Last Hour] were to see a sign [of its approach], they would turn aside and say, “An ever-recurring delusion!” –",
      "juz_number": 27
    },
    "3": {
      "text_tafsir_en": "The Muslims denied the truth conveyed to them by the Prophet Muhammad, and followed their lust for their foolishness. At the end of this verse it is affirmed that something will stop at the goal that has been set, in accordance with God's decree. Therefore the question of the Muslims will end in humiliation in the world and the torment that will last in the hereafter, while your question Muhammad saw will cease to prevail in this world and heaven in the hereafter",
      "text_tafsir": "Kaum musyrik mendustakan kebenaran yang disampaikan kepada mereka oleh Nabi Muhammad saw, dan mengikuti hawa nafsu karena kebodohan mereka. Pada akhir ayat ini ditegaskan bahwa sesuatu itu akan berhenti pada sasaran yang telah ditetapkan, sesuai dengan ketetapan Allah. Karena itu persoalan orang-orang musyrik akan berhenti pada kehinaan di dunia dan azab yang kekal di akhirat, sedang persoalanmu hai Muhammad saw akan berhenti pada kemenangan di dunia dan surga di akhirat",
      "text_translation": "Dan mereka mendustakan (Muhammad) dan mengikuti keinginannya, padahal setiap urusan telah ada ketetapannya.",
      "text": "وَكَذَّبُوْا وَاتَّبَعُوْٓا اَهْوَاۤءَهُمْ وَكُلُّ اَمْرٍ مُّسْتَقِرٌّ",
      "text_translation_en": "for they are bent on giving it the lie, being always wont to follow their own desires. Yet everything reveals its truth in the end.",
      "juz_number": 27
    },
    "4": {
      "text_tafsir_en": "The unbelievers who rejected Muhammad's admonition and followed their passions, knew some of the stories of the ancient people who rejected the apostles, so that Allah decreed them, as it is in the Qur'an. But those stories did not work in their hearts and could not prevent infidelity, and then God destroyed them, and in the Hereafter they would be tortured according to the shirk that had adorned their souls.",
      "text_tafsir": "Kaum musyrik yang mendustakan kerasulan Muhammad dan mengikuti hawa nafsu, telah mengetahui beberapa kisah tentang umat-umat terdahulu yang mendustakan para rasul, sehingga Allah menurunkan azab kepada mereka, sebagaimana tersebut dalam AlQur'an. Namun kisah-kisah itu tidak berkesan di hati mereka dan tidak dapat mencegah kekafiran, lalu Allah membinasakan mereka, sedang di akhirat nanti akan disiksa sesuai dengan perbuatan syirik yang telah menghiasi jiwa mereka.",
      "text_translation": "Dan sungguh, telah datang kepada mereka beberapa kisah yang di dalamnya terdapat ancaman (terhadap kekafiran),",
      "text": "وَلَقَدْ جَاۤءَهُمْ مِّنَ الْاَنْبَاۤءِ مَا فِيْهِ مُزْدَجَرٌۙ  ",
      "text_translation_en": "And withal, there has come unto them many a tiding that should have restrained [their arrogance]:",
      "juz_number": 27
    },
    "5": {
      "text_tafsir_en": "The story contains wisdom that is of great value in guiding people to the right path, but the wisdom and warnings contained in the story are no longer useful to them because their conscience is locked away. The Word of God: It is not worth the signs (the greatness of Allah) and the apostles who warn the unbelievers. (Jonah 10:10)",
      "text_tafsir": "Kisah tersebut mengandung hikmah yang sangat tinggi nilainya dalam memberi petunjuk bagi manusia kepada jalan yang benar, tetapi hikmah dan peringatan yang terkandung dalam kisahkisah itu tidak berguna lagi bagi mereka karena hati nurani mereka telah terkunci mati. Firman Allah: \n\nTidaklah bermanfaat tanda-tanda (kebesaran Allah) dan rasul-rasul yang memberi peringatan bagi orang yang tidak beriman. (Yunus\/10: 101)",
      "text_translation": "(itulah) suatu hikmah yang sempurna, tetapi peringatan-peringatan itu tidak berguna (bagi mereka),",
      "text": "حِكْمَةٌ ۢ بَالِغَةٌ فَمَا تُغْنِ النُّذُرُۙ  ",
      "text_translation_en": "far-reaching wisdom [was held out to them]: but [since] all warnings have been of no avail,",
      "juz_number": 27
    },
    "6": {
      "text_tafsir_en": "God told His apostles not to argue with the Gentiles, because it was of no avail. Therefore let them turn away, they liars. Since they have reached a level they are not willing to submit to the evidence and the truth, then it is appropriate for you not to advise them anymore. Allah knows that Allah's Messenger (may peace be upon him) did not get tired of their questions and was irritated by his arrogance. God reminds people that there will be a day of resurrection, in which day the angels will call upon men to come to a place very dangerous and hated by the heathen, namely the Field of Mahsyar.",
      "text_tafsir": "Allah memerintahkan rasul-Nya agar tidak mengadakan perdebatan dengan kaum musyrik, karena tidak ada faedahnya. Sebab itu hendaklah berpaling dari mereka, pendusta-pendusta itu. Karena mereka sudah sampai ke tingkat tidak mau tunduk kepada bukti dan kebenaran, maka sudah pantas bagimu tidak memberi nasihat kepada mereka lagi. Allah mengetahui bahwa Rasulullah saw tidak bosan terhadap persoalan mereka dan jengkel karena kecongkakannya. Allah mengingatkan kepada manusia bahwa akan terjadi hari kebangkitan, yang hari itu malaikat akan memanggil manusia datang ke suatu tempat yang sangat berbahaya dan dibenci oleh kaum musyrik, yaitu Padang Mahsyar.",
      "text_translation": "maka berpalinglah engkau (Muhammad) dari mereka pada hari (ketika) penyeru (malaikat) mengajak (mereka) kepada sesuatu yang tidak menyenangkan (hari pembalasan), ",
      "text": "فَتَوَلَّ عَنْهُمْ ۘ يَوْمَ يَدْعُ الدَّاعِ اِلٰى شَيْءٍ نُّكُرٍۙ  ",
      "text_translation_en": "turn thou away from them. On the Day when the Summoning Voice will sum­mon [man] unto something that the mind cannot conceive,",
      "juz_number": 27
    },
    "7": {
      "text_tafsir_en": "They would come out of the grave in their submissive state, for they could not bear the horrors of the day, and as they came out of the tomb, they rushed to the place of charity, according to the call, like flying grasshoppers. on air. In another verse the meaning of God says: In that day man will be like a flying lion. (alQari'ah \/ 101: 4)",
      "text_tafsir": "Mereka akan keluar dari kubur dalam keadaan pandangan mereka tunduk, karena tidak sanggup memandang kedahsyatan yang terjadi pada hari itu, dan ketika mereka bersama-sama keluar dari kubur, tergopoh-gopoh menuju ke tempat perhitungan amal sesuai dengan panggilan, laksana belalang-belalang yang beterbangan di udara. Dalam ayat lain yang bersamaan maksudnya Allah berfirman: \n\nPada hari itu manusia seperti laron yang beterbangan. (alQari'ah\/101: 4)",
      "text_translation": "pandangan mereka tertunduk, ketika mereka keluar dari kuburan, seakan-akan mereka belalang yang beterbangan,",
      "text": "خُشَّعًا اَبْصَارُهُمْ يَخْرُجُوْنَ مِنَ الْاَجْدَاثِ كَاَنَّهُمْ جَرَادٌ مُّنْتَشِرٌۙ  ",
      "text_translation_en": "they will come forth from their graves, with their eyes downcast, [swarming about] like locusts scattered [by the wind],",
      "juz_number": 27
    },
    "8": {
      "text_tafsir_en": "They came to meet the cry, no one was against it, no one was late, they said, \"This is a very dangerous day and a terrible place.\" The Word of God: So that is a difficult day, for the unbelievers is not easy. (al-Muddatstsir \/ 74: 9-10)",
      "text_tafsir": "Mereka segera datang memenuhi seruan, tidak ada yang menentang seruan itu, tidak ada pula yang terlambat memenuhinya, seraya mereka berkata, \"Ini adalah hari yang sangat berbahaya dan tempat yang mencelakakan.\" Firman Allah: \n\nMaka itulah hari yang serba sulit, bagi orang-orang kafir tidak mudah. (al-Muddatstsir\/74: 9-10)",
      "text_translation": "dengan patuh mereka segera datang kepada penyeru itu. Orang-orang kafir berkata, “Ini adalah hari yang sulit.” ",
      "text": "مُّهْطِعِيْنَ اِلَى الدَّاعِۗ يَقُوْلُ الْكٰفِرُوْنَ هٰذَا يَوْمٌ عَسِرٌ ",
      "text_translation_en": "running in con­fusion towards the Summoning Voice; [and] those who [now] deny the truth will exclaim, “Calamitous is this Day!”",
      "juz_number": 27
    },
    "9": {
      "text_tafsir_en": "Before the people of the Prophet Muhammad, the people of Noah had first denied the apostasy of Noah. They denied the insistence of Noah even though they accused him of being insane and threatened and intimidated Noah to stop his preaching, otherwise they would abuse him.",
      "text_tafsir": "Sebelum umat Nabi Muhammad saw, kaum Nuh telah terlebih dahulu mendustakan kerasulan Nabi Nuh. Mereka mendustakan kerasulan Nabi Nuh bahkan mereka menuduhnya gila serta mengancam dan menakut-nakuti Nabi Nuh supaya menghentikan dakwahnya, jika tidak mereka akan merajamnya.",
      "text_translation": "Sebelum mereka, kaum Nuh juga telah mendustakan (rasul), maka mereka mendustakan hamba Kami (Nuh) dan mengatakan, “Dia orang gila!” Lalu diusirnya dengan ancaman. ",
      "text": "۞ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ فَكَذَّبُوْا عَبْدَنَا وَقَالُوْا مَجْنُوْنٌ وَّازْدُجِرَ",
      "text_translation_en": "[LONG] BEFORE those [who now deny resurrec­tion] did Noah’s people call it a lie; and they gave the lie to Our servant and said, “Mad is he!” - and he was repulsed.",
      "juz_number": 27
    },
    "10": {
      "text_tafsir_en": "Noah prayed to Allah swt that he was helpless against the threat of his people, and asked God to help him. The prayer of Noah is found in the Surah of Noah \/ 71: 26-28, that Noah begged God to destroy the unbelievers, for they would only deceive mankind and would give birth to the wicked and infidels. In addition, Noah also sought forgiveness for both parents and believers. This was done after Noah became aware of their disobedience and almost tired of Noah in delivering his preaching. The Word of God: And Noah said, \"O my Lord, do not let any of the heathen dwell on the earth. wicked and ungrateful children. My Lord, forgive me, my mother, and whoever enters my house with faith and all men and women, and do not add to those who do wrong. destruction. \" (Noah \/ 71: 26-28)",
      "text_tafsir": "Nabi Nuh berdoa kepada Allah swt bahwa ia tidak berdaya menghadapi ancaman kaumnya, dan memohon kepada Allah agar menolongnya. Doa Nabi Nuh terdapat dalam Surah Nuh\/71: 26-28, bahwa Nabi Nuh memohon kepada Allah agar orang kafir dihancurkan, karena mereka hanya akan menyesatkan manusia dan akan melahirkan orang-orang durhaka dan kafir. Di samping itu Nabi Nuh juga memohon ampunan bagi kedua orangtua dan orang-orang yang beriman. Hal ini dilakukan setelah Nabi Nuh mengetahui keingkaran mereka dan hampir lelahnya Nabi Nuh dalam menyampaikan dakwahnya. Firman Allah: Dan Nuh berkata, \"Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi. Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka hanya akan melahirkan anak-anak yang jahat dan tidak tahu bersyukur. Ya Tuhanku, ampunilah aku, ibu bapakku, dan siapa pun yang memasuki rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan. Dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kehancuran.\" (Nuh\/71: 26-28)",
      "text_translation": "Maka dia (Nuh) mengadu kepada Tuhannya, “Sesungguhnya aku telah dikalahkan, maka tolonglah (aku).”",
      "text": "فَدَعَا رَبَّهٗٓ اَنِّيْ مَغْلُوْبٌ فَانْتَصِرْ",
      "text_translation_en": "Thereupon he called out to his Sustainer, “Verily, I am defeated; come Thou, then, to my succour!”",
      "juz_number": 27
    },
    "11": {
      "text_tafsir_en": "God answered the prayer of Noah by pouring out a lot of water from the sky and lasted for years.",
      "text_tafsir": "Allah mengabulkan doa Nabi Nuh dengan mencurahkan air yang banyak dari langit dan berlangsung bertahun-tahun.",
      "text_translation": "Lalu Kami bukakan pintu-pintu langit dengan (menurunkan) air yang tercurah,",
      "text": "فَفَتَحْنَآ اَبْوَابَ السَّمَاۤءِ بِمَاۤءٍ مُّنْهَمِرٍۖ  ",
      "text_translation_en": "And so We caused the gates of heaven to open with water pouring down in torrents,",
      "juz_number": 27
    },
    "12": {
      "text_tafsir_en": "Aside from the earth, God sent forth springs from the surface of the earth, and then came the two springs, the water that came down from the sky and the water that flowed out of the earth, and there was a great flood as God had determined. This verse describes the events of the flood in the time of Noah. However, when the first words in the above sentence are pronounced, and are related to the statement in the preceding sentence, they both indicate the water cycle. This spring cycle describes the downfall of rainwater and the earth releases it again in the form of springs.",
      "text_tafsir": "Disamping itu dari dalam bumi, Allah memancarkan sumber mata air di permukaannya, lalu bertemulah dua air tersebut, yaitu air yang diturunkan dari langit dan air yang dipancarkan dari bumi, terjadilah banjir yang besar sebagaimana yang sudah ditentukan Allah. Ayat ini menguraikan mengenai peristiwa air bah pada masa Nabi Nuh. Akan tetapi, apabila penggalan kata-kata pertama dalam kalimat di atas, dan dikaitkan dengan pernyataan dalam ayat sebelumnya, maka keduanya akan memperlihatkan siklus air. Penggalan mengenai siklus air ini menjelaskan tentang turunnya air hujan dan bumi mengeluarkannya lagi dalam bentuk mata air.",
      "text_translation": "dan Kami jadikan bumi menyemburkan mata-mata air maka bertemulah (air-air) itu sehingga (meluap menimbulkan) keadaan (bencana) yang telah ditetapkan. ",
      "text": "وَّفَجَّرْنَا الْاَرْضَ عُيُوْنًا فَالْتَقَى الْمَاۤءُ عَلٰٓى اَمْرٍ قَدْ قُدِرَ ۚ",
      "text_translation_en": "and caused the earth to burst forth with springs, so that the waters met for a purpose pre-ordained:",
      "juz_number": 27
    },
    "13": {
      "text_tafsir_en": "God rescued Noah from the great flood by ordering Noah and his followers to board a large ship made of pre-prepared plaster boards. The meaning of this verse is in line with the word of Allah in Surah al-'Ankabut: So We saved Noah and those on board. (al-'Ankabut \/ 29: 15)",
      "text_tafsir": "Allah menyelamatkan Nabi Nuh dari banjir besar dengan memerintahkan Nuh beserta pengikutnya naik ke kapal besar yang terbuat dari papan-papan yang dipaku yang telah disiapkan sebelumnya. Maksud ayat ini sejalan dengan firman Allah dalam Surah al-'Ankabut: \n\nMaka Kami selamatkan Nuh dan orang-orang yang berada di kapal itu. (al-'Ankabut\/29: 15)",
      "text_translation": "Dan Kami angkut dia (Nuh) ke atas (kapal) yang terbuat dari papan dan pasak, ",
      "text": "وَحَمَلْنٰهُ عَلٰى ذَاتِ اَلْوَاحٍ وَّدُسُرٍۙ  ",
      "text_translation_en": "but him We bore on that [vessel] made of [mere] planks and nails,",
      "juz_number": 27
    },
    "14": {
      "text_tafsir_en": "Although the typhoon was very powerful with heavy rains and waves of water like a large mountain, the ship sailed safely under God's supervision in return for its prayers, as informed in another verse. And the ship sailed to bring them into the waves like mountains. And Noah called out to his son, when he (the child) was in a remote place, \"O my son! Get on (aboard) with us and do not be with unbelievers.\" (Hud \/ 11: 42)",
      "text_tafsir": "Meskipun topan sangat dahsyat disertai hujan yang sangat lebat dan gelombang air laksana gunung besarnya, kapal itu berlayar dengan selamat berjalan di bawah pengawasan Allah sebagai balasan doanya, sebagaimana diinformasikan dalam ayat lain. \n\nDan kapal itu berlayar membawa mereka ke dalam gelombang laksana gunung-gunung. Dan Nuh memanggil anaknya, ketika dia (anak itu) berada di tempat yang jauh terpencil, \"Wahai anakku! Naiklah (ke kapal) bersama kami dan janganlah engkau bersama orang-orang kafir.\" (Hud\/11: 42)",
      "text_translation": "yang berlayar dengan pemeliharaan (pengawasan) Kami sebagai balasan bagi orang yang telah diingkari (kaumnya).",
      "text": "تَجْرِيْ بِاَعْيُنِنَاۚ جَزَاۤءً لِّمَنْ كَانَ كُفِرَ ",
      "text_translation_en": "and it floated under Our eyes: a recom­pense for him who had been rejected with ingratitude.",
      "juz_number": 27
    },
    "15": {
      "text_tafsir_en": "The catastrophic events of Noah's people made God a lesson for mankind all the time. So that they can defend the truth and destroy the false falsehood of the apostles of God. The ship landed on the \"Gambling\" hill. (The name of the mountain in the Kurdistan region) And it is said, \"O earth! Swallow your water and O heavens (rain!) Cease.\" And the waters were ordered, and the order was given up, and the ship went down over the mountains of Judea, saying, Let destruction come on them! (Hud \/ 11: 44) In another verse it is stated: Verily when the waters rise (to the mountain), We bring you (the ancestors) into the ship, that We may make it a memorial for you and to be observed by ears that want to hear. (al-haqqah \/ 69: 11-12) At the end of this verse, God asks, \"are there any who will remember and ponder the events to be taught?\" This means that events need to be pondered and remembered all the time to enhance faith and piety.",
      "text_tafsir": "Peristiwa bencana buat kaum Nuh dijadikan Allah sebagai pelajaran bagi manusia sepanjang masa. Sehingga mereka dapat membela kebenaran dan menghancurkan kebatilan yang mendustakan terhadap rasul-rasul Allah. Bahtera tersebut mendarat di bukit \"Judi.\" (Nama Gunung di daerah Kurdistan) \n\nDan difirmankan, \"Wahai bumi! Telanlah airmu dan wahai langit (hujan!) berhentilah.\" Dan air pun disurutkan, dan perintah pun diselesaikan dan kapal itupun berlabuh di atas gunung Judi, dan dikatakan, \"Binasalah orang-orang zalim.\" (Hud\/11: 44) \n\nDalam ayat lain peristiwa itu dinyatakan: \n\nSesungguhnya ketika air naik (sampai ke gunung), Kami membawa (nenek moyang) kamu ke dalam kapal, agar Kami jadikan (peristiwa itu) sebagai peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar. (al-haqqah\/69: 11-12) \n\nSelanjutnya pada akhir ayat ini Allah bertanya, \"masih adakah orang-orang yang mau mengingat dan merenungkan peristiwa itu untuk dijadikan pelajaran.\" Artinya peristiwa itu perlu direnungkan dan diingat sepanjang masa untuk meningkatkan keimanan dan ketakwaan.",
      "text_translation": "Dan sungguh, kapal itu telah Kami jadikan sebagai tanda (pelajaran). Maka adakah orang yang mau mengambil pelajaran?",
      "text": "وَلَقَدْ تَّرَكْنٰهَآ اٰيَةً فَهَلْ مِنْ مُّدَّكِرٍ",
      "text_translation_en": "And, indeed, We have caused such [floating vessels] to remain forever a sign [of Our grace unto man]: who, then, is willing to take it to heart?",
      "juz_number": 27
    },
    "16": {
      "text_tafsir_en": "God warns those who oppose and reject the apostles and do not take to heart the terrible torture of God and the threats directed at those who ignore the call of the apostles",
      "text_tafsir": "Allah memperingatkan orang yang membangkang dan mendustakan para rasul serta tidak mengambil iktibar terhadap dahsyatnya siksaan Tuhan dan ancaman-ancamannya yang ditujukan kepada orang-orang yang tidak mengindahkan seruan para rasul",
      "text_translation": "Maka betapa dahsyatnya azab-Ku dan peringatan-Ku! ",
      "text": "فَكَيْفَ كَانَ عَذَابِيْ وَنُذُرِ ",
      "text_translation_en": "And how severe is the suffering which I inflict when My warnings are disregarded!",
      "juz_number": 27
    },
    "17": {
      "text_tafsir_en": "It is Allah who has revealed the Qur'an which is easy to read and understand to be a lesson to those who want to learn it; In another verse it is stated that the Qur'an is only useful to believers, because they practice it: And keep warning, for it is indeed a warning to the believers. (adh-dzariyat \/ 51: 55) And as He says: The Book (of the Qur'an) We have sent unto you with a blessing that they may understand its verses and that the wise may learn. (shad \/ 38: 29) Indeed, We have made it easier for you (Muhammad) to speak with glad tidings to those who fear, and to warn the people. who are opposed. (Mary \/ 19: 97) The Qur'an is easy to understand and to carry out, as the Prophet saw clearly and exemplified its implementation. The content of the Qur'an is good news for the feared and a warning to the disobedient.",
      "text_tafsir": "Allah yang menurunkan Al-Qur'an yang mudah dibaca dan difahami untuk dijadikan pelajaran bagi orang yang mau menjadikan pelajaran, karena itu hendaknya manusia mengimaninya dan menjalankannya. Dalam ayat lain dinyatakan bahwa Al-Qur'an hanya bermanfaat bagi orang yang beriman, karena mereka menjalankannya: \n\nDan tetaplah memberi peringatan, karena sesungguhnya peringatan itu bermanfaat bagi orang-orang Mukmin. (adh-dzariyat\/51: 55) \n\nDan seperti firman-Nya: \n\nKitab (Al-Qur'an) yang Kami turunkan kepadamu penuh berkah agar mereka menghayati ayat-ayatnya dan agar orang-orang yang berakal sehat mendapat pelajaran. (shad\/38: 29) \n\nMaka sungguh, telah Kami mudahkan (Al-Qur'an) itu dengan bahasamu (Muhammad), agar dengan itu engkau dapat memberi kabar gembira kepada orang-orang yang bertakwa, dan agar engkau dapat memberi peringatan kepada kaum yang membangkang. (Maryam\/19: 97) \n\nAl-Qur'an itu mudah difahami dan dijalankan, karena Nabi saw menjelaskan dan mencontohkan pelaksanaannya. Isi Al-Qur'an adalah kabar gembira bagi yang takwa dan peringatan bagi yang membangkang, karena itu hendaknya manusia menjadi orang yang takwa dengan menjalankannya dan tidak mengingkarinya, karena akan menjadi orang yang merugi.",
      "text_translation": "Dan sungguh, telah Kami mudahkan Al-Qur'an untuk peringatan, maka adakah orang yang mau mengambil pelajaran?",
      "text": "وَلَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ ",
      "text_translation_en": "Hence, indeed, We made this Qur’an easy to bear in mind: who, then, is willing to take it to heart?",
      "juz_number": 27
    },
    "18": {
      "text_tafsir_en": "In this verse Allah declares that the people of 'Ad looked at their prophets and the pamphlets he brought to them were a lie. To the people who denied the apostles Allah had warned and decreed a terrible punishment. It is to be taught by those who come later.",
      "text_tafsir": "Dalam ayat ini Allah menyatakan bahwa kaum 'Ad memandang nabi mereka dan risalah yang ia bawa untuk mereka adalah bohong. Kepada kaum yang mendustakan para rasul itu Allah telah menyampaikan peringatan dan menurunkan azab yang sangat dahsyat. Hal tersebut hendaknya dijadikan iktibar oleh orang-orang yang datang kemudian.",
      "text_translation": "Kaum ‘Ad pun telah mendustakan. Maka betapa dahsyatnya azab-Ku dan peringatan-Ku! ",
      "text": "كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِيْ وَنُذُرِ ",
      "text_translation_en": "TO THE TRUTH gave the lie [the tribe of] Ad: and how severe was the suffering which I inflicted when My warnings were disregarded!",
      "juz_number": 27
    },
    "19": {
      "text_tafsir_en": "This verse explains that God released a terrible thunderstorm. It is the torment of Allah to the Ad people in a time of sin and wickedness. This event occurred for seven nights eight days continuously as stated in another verse: So We caused a very strong wind to blow over them in the last few days. (Fussilat \/ 41: 16) And his word was that God caused the wind to blow upon them seven days and eight nights for ever. (al-haqqah \/ 69: 7)",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah melepaskan topan yang amat dahsyat menderu-deru. Hal tersebut merupakan azab Allah kepada kaum 'Ad di kala bergelimangan dosa dan durhaka. Peristiwa ini terjadi selama tujuh malam delapan hari terus-menerus sebagaimana diinformasikan dalam ayat lain: \n\nMaka Kami tiupkan angin yang sangat bergemuruh kepada mereka dalam beberapa hari yang nahas. (Fussilat\/41: 16) \n\nDan firman-Nya: \n\nAllah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus. (al-haqqah\/69: 7)",
      "text_translation": "Sesungguhnya Kami telah menghembuskan angin yang sangat kencang kepada mereka pada hari nahas yang terus menerus, ",
      "text": "اِنَّآ اَرْسَلْنَا عَلَيْهِمْ رِيْحًا صَرْصَرًا فِيْ يَوْمِ نَحْسٍ مُّسْتَمِرٍّۙ  ",
      "text_translation_en": "Behold, We let loose upon them a raging storm wind on a day of bitter misfortune:",
      "juz_number": 27
    },
    "20": {
      "text_tafsir_en": "In this verse it is said that the wind threw them and then lowered them by the head first because of the severity of their heads and their bodies wriggled like palm trees falling apart because of the storm. Such is the great storm that can overthrow their great bodies as it is stated in His word: They are stronger than they are and have cultivated the earth and prospered beyond what they have prospered. (Romans 30: 9)",
      "text_tafsir": "Pada ayat ini dinyatakan bahwa angin itu melemparkan mereka kemudian menghempaskan mereka ke bawah dengan kepala lebih dahulu karena begitu kerasnya kepala mereka terpenggal dan tubuh mereka bergelimangan bagaikan pohon-pohon kurma yang tumbang berserakan karena tercabut oleh badai. Demikianlah dahsyatnya badai itu yang dapat menumbangkan tubuh mereka yang besar-besar sebagaimana dinyatakan dalam firman-Nya: \n\nOrang-orang itu lebih kuat dari mereka (sendiri) dan mereka telah mengolah bumi (tanah) serta memakmurkannya melebihi apa yang telah mereka makmurkan. (ar-Rum\/30: 9)",
      "text_translation": "yang membuat manusia bergelimpangan, mereka bagaikan pohon-pohon kurma yang tumbang dengan akar-akarnya. ",
      "text": "تَنْزِعُ النَّاسَۙ كَاَنَّهُمْ اَعْجَازُ نَخْلٍ مُّنْقَعِرٍ ",
      "text_translation_en": "it swept the people away as though they were palm-trunks uprooted:",
      "juz_number": 27
    },
    "21": {
      "text_tafsir_en": "Allah declares, how great is His punishment and His warning. The statement shows that God himself sees the event as wonderful. In another verse it is stated that the punishment of Allah is very great: We want them to experience the humiliating torture of life in the world. While the doom of the Hereafter must have been more humiliating and they were not helped. (Fussilat 41: 16)",
      "text_tafsir": "Allah kembali menyatakan, betapa hebat azab-Nya dan peringatan-Nya. Pernyataan itu menunjukkan bahwa Allah sendiri memandang peristiwa tersebut hebat sekali. Dalam ayat yang lain memang disebutkan bahwa azab Allah sangat hebat: Kami ingin agar mereka itu merasakan siksaan yang menghinakan dalam kehidupan di dunia. Sedangkan azab akhirat pasti lebih menghinakan dan mereka tidak diberi pertolongan. (Fussilat\/41: 16)",
      "text_translation": "Maka betapa dahsyatnya azab-Ku dan peringatan-Ku! ",
      "text": "فَكَيْفَ كَانَ عَذَابِيْ وَنُذُرِ",
      "text_translation_en": "for, how severe is the suffering which I inflict when My warnings are disregarded!",
      "juz_number": 27
    },
    "22": {
      "text_tafsir_en": "Allah also emphasizes that the Qur'an is easy to understand and to be taken as a warning because Allah has given a clear example in it, so people should believe it in carrying out its teachings so that they are happy in the world and in the hereafter.",
      "text_tafsir": "Allah juga kembali menegaskan bahwa Al-Qur'an mudah dipahami dan diambil sebagai peringatan karena Allah menyampaikan contoh yang gamblang di dalamnya, karena itu manusia seharusnya mengimaninya dalam menjalankan ajaranajaran yang terdapat di dalamnya supaya mereka bahagia di dunia dan di akhirat.",
      "text_translation": "Dan sungguh, telah Kami mudahkan Al-Qur'an untuk peringatan, maka adakah orang yang mau mengambil pelajaran?",
      "text": "وَلَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ ࣖ ",
      "text_translation_en": "Hence, indeed, We made this Qur’an easy to bear in mind: who, then, is willing to take it to heart?",
      "juz_number": 27
    },
    "23": {
      "text_tafsir_en": "In this verse God explains that the Samaritans considered the warnings given by their prophet Saleh, namely, to instruct Allah, the faith of the apostles and the Day of Resurrection.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa kaum Samud menganggap dusta peringatan-peringatan yang disampaikan nabi mereka Nabi Saleh, yaitu mentauhidkan Allah, iman kepada rasul dan hari Kiamat.",
      "text_translation": "Kaum Samud pun telah mendustakan peringatan itu.",
      "text": "كَذَّبَتْ ثَمُوْدُ بِالنُّذُرِ",
      "text_translation_en": "[AND the tribe of] Thamud gave the lie to all [Our] warnings;",
      "juz_number": 27
    },
    "24": {
      "text_tafsir_en": "They view the Prophet Saleh as a lie, because in their view, it is impossible for a new teaching taught by one person to be more true than the teachings that have been followed by everyone and have been accepted since their ancestors. They see that following one person who brings another teaching from the teachings they have received since their ancestors will drive people astray and go crazy.",
      "text_tafsir": "Mereka memandang Nabi Saleh dusta, karena dalam pandangan mereka, tidak mungkin ajaran baru yang diajarkan satu orang lebih benar dari ajaran yang telah diikuti oleh semua orang dan telah diterima semenjak nenek moyang mereka. Mereka memandang bahwa mengikuti satu orang yang membawa ajaran yang lain dari ajaran yang mereka terima sejak nenek moyang akan membuat sesat dan gila.",
      "text_translation": "Maka mereka berkata, “Bagaimana kita akan mengikuti seorang manusia (biasa) di antara kita? Sungguh, kalau begitu kita benar-benar telah sesat dan gila. ",
      "text": "فَقَالُوْٓا اَبَشَرًا مِّنَّا وَاحِدًا نَّتَّبِعُهٗٓ  ۙاِنَّآ اِذًا لَّفِيْ ضَلٰلٍ وَّسُعُرٍ",
      "text_translation_en": "and they said: “Are we to follow one single mortal, one from among ourselves? In that case, behold, we would certainly sink into error and folly!",
      "juz_number": 27
    },
    "25": {
      "text_tafsir_en": "They further argued that it was impossible for the revelation to be revealed to a person who was Prophet Saleh while he was a human being. Why is revelation not revealed to their powerful, respected, wealthy leaders, and so on. Therefore in their eyes Prophet Saleh lied and only bragged. (",
      "text_tafsir": "Selanjutnya mereka berdalih bahwa tidak mungkin wahyu itu diturunkan kepada seseorang yaitu Nabi Saleh sedang ia manusia biasa. Mengapa wahyu tidak diturunkan kepada pemimpin mereka yang berkuasa, disegani, berharta, dan sebagainya. Oleh karena itu dalam pandangan mereka Nabi Saleh bohong dan hanya menyombongkan diri. (",
      "text_translation": "Apakah wahyu itu diturunkan kepadanya di antara kita? Pastilah dia (Saleh) seorang yang sangat pendusta (dan) sombong.” ",
      "text": "ءَاُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْۢ بَيْنِنَا بَلْ هُوَ كَذَّابٌ اَشِرٌ ",
      "text_translation_en": "Why - on him alone from among all of us should a [divine] reminder have been bestowed? Nay, but he is a boastful liar!”",
      "juz_number": 27
    },
    "26": {
      "text_tafsir_en": "God strongly denied their views by stating that in the near future they will find out who is actually lying and arrogant",
      "text_tafsir": "Allah membantah dengan keras pandangan mereka dengan menyatakan bahwa dalam waktu dekat mereka akan mengetahui siapa sebenarnya yang bohong dan sombon",
      "text_translation": "Kelak mereka akan mengetahui siapa yang sebenarnya sangat pendusta (dan) sombong itu.",
      "text": "سَيَعْلَمُوْنَ غَدًا مَّنِ الْكَذَّابُ الْاَشِرُ ",
      "text_translation_en": "[And God said:] “On the morrow they will come to know who the boastful liar is!",
      "juz_number": 27
    },
    "27": {
      "text_tafsir_en": "God explained that he fulfilled their request to bring a female camel from a rock to their request, as a miracle of the Prophet Saleh. They ask for such miracles because they are known as great stone carvers and stone mountains as their home. The female camel made of stone was used by God as a test for the people of Saleh. Their place of residence is now near Mada'in, an area between Hijaz and Syria. At the end of this verse Allah instructed Prophet Saleh to wait for what they would do, whether they were believers or they were unbelievers. And that the Prophet Saleh be patient with their disturbances till the judgment of Allah, because Allah always defends the truth and destroys the falsehood.",
      "text_tafsir": "Allah menerangkan bahwa ia memenuhi permintaan mereka untuk menjelmakan seekor unta betina dari sebuah batu besar sesuai permintaan mereka, sebagai mukjizat Nabi Saleh. Mereka meminta mukjizat seperti itu karena mereka terkenal sebagai pemahat batu yang hebat dan gunung-gunung batu sebagai tempat tinggal mereka. Unta betina yang dijelmakan dari batu gunung itu dijadikan Allah sebagai ujian bagi umat Nabi Saleh. Tempat mereka tinggal itu sekarang dekat Mada'in, suatu daerah antara Hijaz dan Syiria. Pada akhir ayat ini Allah memerintahkan Nabi Saleh untuk menunggu apa yang akan mereka lakukan, apakah beriman atau mereka tetap kafir. Dan supaya Nabi Saleh bersabar terhadap gangguan-gangguan mereka sampai datang ketentuan Allah, karena Allah tetap membela kebenaran dan menghancurkan kebatilan.",
      "text_translation": "Sesungguhnya Kami akan mengirimkan unta betina sebagai cobaan bagi mereka, maka tunggulah mereka dan bersabarlah (Saleh).",
      "text": "اِنَّا مُرْسِلُوا النَّاقَةِ فِتْنَةً لَّهُمْ فَارْتَقِبْهُمْ وَاصْطَبِرْۖ  ",
      "text_translation_en": "Behold, [O Salih] We are letting loose this she-camel as a test for them; and thou but watch them, and contain thyself in patience.",
      "juz_number": 27
    },
    "28": {
      "text_tafsir_en": "Allah commanded Prophet Saleh to inform his people of the splitting of the well between them and the camels, one day for the camels and one day for them. Each came in his turn to fetch the water of the well. (",
      "text_tafsir": "Allah memerintahkan Nabi Saleh supaya memberitahukan kepada kaumnya tentang pembagian air sumur antara mereka dan unta, yaitu sehari untuk unta betina dan sehari untuk mereka. Masing-masing datang menurut gilirannya untuk mengambil air sumur itu. (",
      "text_translation": "Dan beritahukanlah kepada mereka bahwa air itu dibagi di antara mereka (dengan unta betina itu); setiap orang berhak mendapat giliran minum.",
      "text": "وَنَبِّئْهُمْ اَنَّ الْمَاۤءَ قِسْمَةٌ ۢ بَيْنَهُمْۚ  كُلُّ شِرْبٍ مُّحْتَضَرٌ ",
      "text_translation_en": "And let them know that the water [of their wells] is to be divided between them, with each share of water equitably apportioned.”",
      "juz_number": 27
    },
    "29": {
      "text_tafsir_en": "God explained that eventually the Samaritans relied on such divisions and wanted to kill the camels. They called out to one of their most cruel villagers, his name was Kudar bin Salif and he chopped the camel.",
      "text_tafsir": "Allah menerangkan bahwa akhirnya kaum Samud keberatan atas pembagian seperti itu dan ingin membunuh unta. Mereka lalu memanggil seorang warga mereka yang terkenal sangat kejam, namanya Kudar bin Salif dan mencincang unta tersebut.",
      "text_translation": "Maka mereka memanggil kawannya, lalu dia menangkap (unta itu) dan memotongnya. ",
      "text": "فَنَادَوْا صَاحِبَهُمْ فَتَعَاطٰى فَعَقَرَ ",
      "text_translation_en": "But they summoned their [boldest] companion, and he ventured [upon the evil deed], and cruelly slaughtered [the animal]:",
      "juz_number": 27
    },
    "30": {
      "text_tafsir_en": "Allah recounts the greatness of Allah's punishment and His threats. They were warned of threats and disasters, but they ignored them",
      "text_tafsir": "Allah kembali menerangkan bagaimana hebatnya azab Allah dan ancaman-ancamannya-Nya. Mereka telah diperingatkan ancaman dan bencana, tetapi mereka tidak menghiraukannya",
      "text_translation": "Maka betapa dahsyatnya azab-Ku dan peringatan-Ku!",
      "text": "فَكَيْفَ كَانَ عَذَابِيْ وَنُذُرِ ",
      "text_translation_en": "and how severe was the suffering which I inflicted when My warnings were disregarded!",
      "juz_number": 27
    },
    "31": {
      "text_tafsir_en": "The punishment of this verse is saihah. As explained in the text of Surah Hud \/ 11: 67, saihah is rajfah (great earthquake) and saiqah (lightning strike). Thus the punishment they received was a thunderstorm accompanied by a terrible earthquake. The lightning burns their bodies to death and burns them like dry grass in a drought. (",
      "text_tafsir": "Azab pada ayat ini adalah saihah. Sebagaimana sudah diterangkan dalam kosakata Surah Hud\/11: 67, saihah adalah rajfah (gempa hebat) dan saiqah (petir yang menyambar). Dengan demikian azab yang mereka terima adalah petir yang menggelegar disertai gempa yang dahsyat. Petir itu menghanguskan tubuh mereka sehingga mati terbakar dan kering bagaikan rerumputan yang mati kering karena kekeringan. (",
      "text_translation": "Kami kirimkan atas mereka satu suara yang keras mengguntur, maka jadilah mereka seperti batang-batang kering yang lapuk. ",
      "text": "اِنَّآ اَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَّاحِدَةً فَكَانُوْا كَهَشِيْمِ الْمُحْتَظِرِ",
      "text_translation_en": "Behold, We let loose upon them one single blast [of Our punishment], and they became like the dried-up, crumbling twigs of a sheepfold.",
      "juz_number": 27
    },
    "32": {
      "text_tafsir_en": "Such is the explanation of the Qur'an about the ancients. The explanation is straightforward, may anyone want to take it as a lesson for believers.",
      "text_tafsir": "Demikianlah penjelasan Al-Qur'an mengenai umat terdahulu. Penjelasan itu lugas, semoga siapapun mau mengambilnya menjadi pelajaran untuk beriman.",
      "text_translation": "Dan sungguh, telah Kami mudahkan Al-Qur'an untuk peringatan, maka adakah orang yang mau mengambil pelajaran?",
      "text": "وَلَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ ",
      "text_translation_en": "Hence, indeed, We made this Qur’an easy to bear in mind: who, then, is willing to take it to heart?",
      "juz_number": 27
    },
    "33": {
      "text_tafsir_en": "The story begins to punish them. God explained that the people of Lut had also considered God's warnings that he had conveyed through the Prophet Lut, a lie. The warnings are that they leave behind the dirty deeds they have committed, namely sexual relations between men.",
      "text_tafsir": "Kisah itu dimulai untuk menghukum mereka. Allah menerangkan bahwa kaum Lut juga telah menganggap peringatan-peringatan Allah yang disampaikan-Nya melalui Nabi Lut, bohong. Peringatan-peringatan itu adalah agar mereka meninggalkan perbuatan-perbuatan kotor yang mereka lakukan yaitu hubungan kelamin sesama laki-laki.",
      "text_translation": "Kaum Lut pun telah mendustakan peringatan itu. ",
      "text": "كَذَّبَتْ قَوْمُ لُوْطٍ ۢبِالنُّذُرِ ",
      "text_translation_en": "LOT ’S PEOPLE [too] gave the lie to all [Our] warn­ings:",
      "juz_number": 27
    },
    "34": {
      "text_tafsir_en": "God sent them a whirlwind that blew stones and cut off their heads so that they would perish, the only survivors of the Prophet Lot's family, those who believed in him. Because they were commanded by God first to leave their country early in the morning before dawn.",
      "text_tafsir": "Allah mengirimkan mereka angin puting beliung yang menerbangkan batu-batu lalu menghempaskan kepala mereka sehingga mereka binasa, yang selamat hanya keluarga Nabi Lut yaitu orang-orang yang beriman kepadanya. Karena diperintahkan Allah mereka lebih dahulu keluar dari negeri mereka pada dini hari sebelum fajar.",
      "text_translation": "Sesungguhnya Kami kirimkan kepada mereka badai yang membawa batu-batu (yang menimpa mereka), kecuali keluarga Lut. Kami selamatkan mereka sebelum fajar menyingsing,",
      "text": "اِنَّآ اَرْسَلْنَا عَلَيْهِمْ حَاصِبًا اِلَّآ اٰلَ لُوْطٍ ۗنَجَّيْنٰهُمْ بِسَحَرٍۙ",
      "text_translation_en": "[and so,] behold, We let loose upon them a deadly tempest; and only Lot ’s kinsfolk did We save at the break of dawn,",
      "juz_number": 27
    },
    "35": {
      "text_tafsir_en": "Salvation is a favor from God to those who believe. The favor is their salvation from that torment. This is the law of God, that He always gives favor to those who are thankful and obedient in carrying out His commands and abstaining from His prohibitions, and punishing those who rebel.",
      "text_tafsir": "Penyelamatan itu merupakan nikmat dari Allah kepada orang-orang yang beriman tersebut. Nikmat itu berupa keselamatan mereka dari azab tersebut. Demikianlah hukum Allah, bahwa Dia senantiasa memberikan nikmat kepada orang-orang yang bersyukur dan patuh menjalankan perintah-Nya dan menjauhi larangan-Nya, dan menghukum orang yang membangkang.",
      "text_translation": "sebagai nikmat dari Kami. Demikianlah Kami memberi balasan kepada orang-orang yang bersyukur. ",
      "text": "نِّعْمَةً مِّنْ عِنْدِنَاۗ  كَذٰلِكَ نَجْزِيْ مَنْ شَكَرَ ",
      "text_translation_en": "as a blessing from Us: thus do We reward all who are grateful.",
      "juz_number": 27
    },
    "36": {
      "text_tafsir_en": "The punishment of those who disobeyed was due to Allah through the Prophet Lut warned them but they did not care, they continued to do homosexual acts.",
      "text_tafsir": "Hukuman terhadap mereka yang membangkang pantas dijatuhkan karena Allah melalui Nabi Lut telah memberi peringatan kepada mereka tetapi mereka tidak memperdulikannya, mereka terus melakukan perbuatan hubungan kelamin sesama laki-laki.",
      "text_translation": "Dan sungguh, dia (Lut) telah memperingatkan mereka akan hukuman Kami, tetapi mereka mendustakan peringatan-Ku. ",
      "text": "وَلَقَدْ اَنْذَرَهُمْ بَطْشَتَنَا فَتَمَارَوْا بِالنُّذُرِ ",
      "text_translation_en": "For he had truly warned them of Our punishing might; but they stubbornly cast doubt on these warn­ings,",
      "juz_number": 27
    },
    "37": {
      "text_tafsir_en": "Their crime reached its peak when what they asked of the Prophet Lut to surrender to them, his guests. The guests were angels disguised as handsome young men to test them. They know the guests because of the betrayal of Lut's wife who delivered to them the news of his arrival. When the Prophet Lut saw them coming, he closed the door to protect his guests, and offered them \"his daughters.\" But they were not interested in the daughters and tried to break the door. Finally the Prophet Lut opened the door. Once they entered, their eyes went blind unable to see the guests because they were slapped by Gabriel with his wings. At the end of this verse Allah tells them that they feel His punishment in the form of blindness in their eyes, which they had previously been threatened with.",
      "text_tafsir": "Kejahatan mereka sampai ke puncaknya ketika yang mereka minta dari Nabi Lut agar menyerahkan kepada mereka, tamu-tamunya. Tamu-tamu itu adalah malaikat-malaikat yang menyamar sebagai pemuda-pemuda ganteng untuk menguji mereka. Mereka mengetahui tamu-tamu itu karena pengkhianatan istri Lut yang menyampaikan kepada mereka berita kedatangannya. Ketika Nabi Lut melihat mereka datang, ia menutup pintu untuk melindungi tamu-tamunya, dan menawarkan kepada mereka \"anakanak perempuannya.\" Namun mereka tidak tertarik pada anak-anak perempuannya itu dan berusaha mendobrak pintu. Akhirnya Nabi Lut membukakan pintu. Begitu mereka masuk, mata mereka menjadi buta tidak dapat melihat tamu-tamu tersebut karena ditampar oleh Jibril dengan sayapnya. Pada akhir ayat ini Allah menyatakan kepada mereka supaya mereka merasakan azab-Nya berupa kebutaan mata mereka, yang sebelumnya kepada mereka telah diberi ancaman.",
      "text_translation": "Dan sungguh, mereka telah membujuknya (agar menyerahkan) tamunya (kepada mereka), lalu Kami butakan mata mereka, maka rasakanlah azab-Ku dan peringatan-Ku!",
      "text": "وَلَقَدْ رَاوَدُوْهُ عَنْ ضَيْفِهٖ فَطَمَسْنَآ اَعْيُنَهُمْ فَذُوْقُوْا عَذَابِيْ وَنُذُرِ ",
      "text_translation_en": "and even demanded that he give up his guests [to them]: whereupon We deprived them of their sight [and thus told them, as it were]: “Taste, then, the suffering which I inflict when My warnings are disregarded!”",
      "juz_number": 27
    },
    "38": {
      "text_tafsir_en": "In the morning, doom comes. They were stoned by God until they and their country were buried. The Prophet himself and his family were his two daughters and believers were ordered out of the country before dawn until they were safe.",
      "text_tafsir": "Pada pagi harinya, azab pun datang. Mereka dihujani batu oleh Allah sehingga mereka dan negerinya terkubur habis. Nabi Lut sendiri beserta keluarga yaitu kedua putrinya dan mereka yang beriman sudah diperintahkan keluar dari negeri itu sebelum fajar sehingga mereka selamat.",
      "text_translation": "Dan sungguh, pada esok harinya mereka benar-benar ditimpa azab yang tetap.",
      "text": "وَلَقَدْ صَبَّحَهُمْ بُكْرَةً عَذَابٌ مُّسْتَقِرٌّۚ  ",
      "text_translation_en": "And, indeed, abiding suffering did befall them early on the morrow:",
      "juz_number": 27
    },
    "39": {
      "text_tafsir_en": "Such is the punishment of Allah against the people of the Prophet Lut. The severity of the punishment they must feel because they do not want to heed the warnings of God through His prophet. God's warnings must occur, because they must not be ignored.",
      "text_tafsir": "Demikianlah azab Allah terhadap kaum Nabi Lut. Kedahsyatan azab itu harus mereka rasakan karena mereka tidak mau memperhatikan peringatan-peringatan Allah melalui nabi-Nya. Peringatan-peringatan Allah pasti terjadi, karena itu tidak boleh diabaikan.",
      "text_translation": "Maka rasakanlah azab-Ku dan peringatan-Ku!",
      "text": "فَذُوْقُوْا عَذَابِيْ وَنُذُرِ ",
      "text_translation_en": "“Taste, then, the suffering which I inflict when My warnings are disregarded!”",
      "juz_number": 27
    },
    "40": {
      "text_tafsir_en": "Interpretation of this verse as explained in verse 32 of this chapter is always the cover of each of these four stories (the story of Noah, the story of 'Ad, the story of Samud and the story of Lut). Allah also emphasizes that the Qur'an is easy to understand and to be taken as a warning because Allah provides a clear example in it, so people should believe it in carrying out its teachings to make them happy in the world and in the hereafter.",
      "text_tafsir": "Tafsir ayat ini sebagaimana yang telah diterangkan pada ayat 32 surah ini yang selalu dijadikan penutup dari masing-masing empat kisah tersebut (yaitu kisah kaum Nuh, kisah kaum 'Ad, kisah kaum Samud dan kisah kaum Lut). Allah juga kembali menegaskan bahwa Al-Qur'an mudah dipahami dan diambil sebagai peringatan karena Allah menyampaikan contoh yang gamblang di dalamnya, karena itu manusia seharusnya mengimaninya dalam menjalankan ajaran-ajaran yang terdapat di dalamnya supaya mereka bahagia di dunia dan di akhirat.",
      "text_translation": "Dan sungguh, telah Kami mudahkan Al-Qur'an untuk peringatan, maka adakah orang yang mau mengambil pelajaran? ",
      "text": "وَلَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ ࣖ",
      "text_translation_en": "Hence, indeed, We made this Qur’an easy to bear in mind: who, then, is willing to take it to heart?",
      "juz_number": 27
    },
    "41": {
      "text_tafsir_en": "These verses explain that a great deal of warning was given to Pharaoh and his followers many times. But they still deny it. These warnings are all the signs and wonders that God gave to Moses as revealed in Surah al-A'raf \/ 7: 133 and al-Isra '\/ 17: 101. Therefore Allah decreed them. The torment comes from the Almighty and the Almighty, which shows that the punishment is great. It was the drowning of Pharaoh and his followers in the Red Sea.",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa sungguh peringatan demi peringatan telah berkali-kali disampaikan kepada kaum Fir'aun dan pengikut-pengikutnya. Namun mereka tetap mendustakannya. Peringatan-peringatan itu adalah semua tanda-tanda kerasulan dan mukjizat yang Allah berikan kepada Nabi Musa sebagaimana diungkapkan dalam Surah al-A'raf\/7: 133 dan al-Isra'\/17: 101. Karena itu Allah menurunkan azab kepada mereka. Azab datang dari Zat yang Mahakuat dan Mahakuasa, yang menunjukkan bahwa azab itu amat hebat. Berupa tenggelamnya Fir'aun dan pengikutnya di Laut Merah.",
      "text_translation": "Dan sungguh, peringatan telah datang kepada keluarga Fir‘aun. ",
      "text": "وَلَقَدْ جَاۤءَ اٰلَ فِرْعَوْنَ النُّذُرُۚ  ",
      "text_translation_en": "Now surely, unto Pharaoh’s folk [too] came such warnings;",
      "juz_number": 27
    },
    "42": {
      "text_tafsir_en": "These verses explain that a great deal of warning was given to Pharaoh and his followers many times. But they still deny it. These warnings are all the signs and wonders that God gave to Moses as revealed in Surah al-A'raf \/ 7: 133 and al-Isra '\/ 17: 101. Therefore Allah decreed them. The torment comes from the Almighty and the Almighty, which shows that the punishment is great. It was the drowning of Pharaoh and his followers in the Red Sea.",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa sungguh peringatan demi peringatan telah berkali-kali disampaikan kepada kaum Fir'aun dan pengikut-pengikutnya. Namun mereka tetap mendustakannya. Peringatan-peringatan itu adalah semua tanda-tanda kerasulan dan mukjizat yang Allah berikan kepada Nabi Musa sebagaimana diungkapkan dalam Surah al-A'raf\/7: 133 dan al-Isra'\/17: 101. Karena itu Allah menurunkan azab kepada mereka. Azab datang dari Zat yang Mahakuat dan Mahakuasa, yang menunjukkan bahwa azab itu amat hebat. Berupa tenggelamnya Fir'aun dan pengikutnya di Laut Merah.",
      "text_translation": "Mereka mendustakan mukjizat-mukjizat Kami semuanya, maka Kami azab mereka dengan azab dari Yang Mahaperkasa, Mahakuasa.",
      "text": "كَذَّبُوْا بِاٰيٰتِنَا كُلِّهَا فَاَخَذْنٰهُمْ اَخْذَ عَزِيْزٍ مُّقْتَدِرٍ ",
      "text_translation_en": "they, too, gave the lie to all Our messages: and thereupon We took them to task as only the Almighty, who determines all things, can take to task.",
      "juz_number": 27
    },
    "43": {
      "text_tafsir_en": "Allah warned the disbelievers of Mecca whether they felt superior to the unbelievers before those who had been punished by Allah such as Noah, 'Ad and Samud. Will they be saved from the torment of Allah because of their disbelief in Him and their lying to His messenger. Or do they really find written assurance in the scriptures that they feel free from the torment of Allah even though they are infidels and do evil. If their beliefs are true then they need to show the truth of their beliefs.",
      "text_tafsir": "Allah memperingatkan orang-orang kafir Mekah apakah mereka merasa lebih mulia dari kaum kafir sebelum mereka yang telah ditimpa hukuman Allah seperti kaum Nuh, kaum 'Ad dan kaum Samud. Apakah mereka akan selamat dari azab Allah karena kekafiran mereka terhadap-Nya dan kedustaan mereka terhadap rasulNya. Ataukah mereka benar mendapat jaminan tertulis dalam kitabkitab suci bahwa mereka merasa bebas dari azab Allah walaupun selalu kafir dan berbuat jahat. Jika keyakinan mereka itu benar perlu menunjukkan landasan kebenaran keyakinan mereka itu.",
      "text_translation": "Apakah orang-orang kafir di lingkunganmu (kaum musyrikin) lebih baik dari mereka, ataukah kamu telah mempunyai jaminan kebebasan (dari azab) dalam kitab-kitab terdahulu? ",
      "text": "اَكُفَّارُكُمْ خَيْرٌ مِّنْ اُولٰۤىِٕكُمْ اَمْ لَكُمْ بَرَاۤءَةٌ فِى الزُّبُرِۚ",
      "text_translation_en": "ARE, THEN, those of you who [now] deny the truth better than those others - or have you, per­chance, [been promised] immunity in the [ancient] books of [divine] wisdom?",
      "juz_number": 27
    },
    "44": {
      "text_tafsir_en": "God still continues the question whether they feel it is a force that is so compact that it is so powerful and impossible to defeat. Abu Jahal said, their forces were many and strong, they would definitely win (in the event of the Battle of Badr). (",
      "text_tafsir": "Allah masih melanjutkan pertanyaan apakah mereka merasa merupakan suatu kekuatan yang sangat kompak sehingga begitu kuatnya dan tidak mungkin dikalahkan. Abu Jahal berkata, pasukan mereka banyak dan kuat, mereka pasti akan menang (pada peristiwa Perang Badar). (",
      "text_translation": "Atau mereka mengatakan, “Kami ini golongan yang bersatu yang pasti menang.” ",
      "text": "اَمْ يَقُوْلُوْنَ نَحْنُ جَمِيْعٌ مُّنْتَصِرٌ ",
      "text_translation_en": "Or do they say, “We are a group united, [and therefore] bound to prevail”?",
      "juz_number": 27
    },
    "45": {
      "text_tafsir_en": "Allah asserts that their unity will be broken and their strength will be broken by Islamic forces. The promise of God was evident in the Battle of Badr, where more than 70 of their leaders were killed and the rest fled hurriedly back to Mecca. The proof of Muhammad's Prophecy is true, since this verse descended on Mecca, and the Prophet (saws) had no troops, and even the followers of the Prophet were scattered, hunted and tortured by the Muslims wherever they were, 'Umar bin al-Khaththab said, \"When that verse came down I did not know what it meant. But in the War of the Badr, I saw the Prophet wearing armor and I read this verse, 'The people will be defeated, then I will understand the meaning of the verse.\" Ibn 'Abbas, al-Bukhari, narrated that the Prophet (peace and blessings be upon him) said while he was in the camp, on the Day of the Badr: \"I have kept your message and your promise! O Allah, if You will (our defeat) you will not be worshiped again today \". Then Abu Bakr held the Prophet's hand and said, \"Enough is enough, O Messenger! You have demanded so much of your Lord.\" Then he came out (from the tent) leaping on his armor while reading this verse. (AlBukhari History) Then Allah declares that this is the torment of the world and they will meet a greater torment on the Day of Resurrection.",
      "text_tafsir": "Allah menegaskan bahwa kesatuan mereka akan diceraiberaikan dan kekuatan mereka akan dipatahkan oleh pasukan Islam. Janji Allah itu terbukti dalam Perang Badar, dimana lebih dari 70 orang pemuka-pemuka mereka tewas dan sisanya lari terbirit-birit kembali ke Mekah. Bukti tentang benarnya kenabian Muhammad saw, karena ayat ini turun di Mekah, sedang Nabi saw belum mempunyai pasukan, bahkan pengikut-pengikut Nabi terpencarpencar, diburu dan disiksa oleh orang-orang musyrik di mana saja mereka berada, 'Umar bin al-Khaththab berkata, \"Ketika ayat itu turun saya tidak mengerti apa maksudnya. Tetapi pada Perang Badar, saya lihat Nabi saw memakai baju besi dan saya dengan beliau membaca ayat ini, 'Golongan itu pasti akan dikalahkan, waktu itu barulah saya mengerti maksud ayat tersebut.\" Diriwayatkan oleh al-Bukhari dari Ibnu 'Abbas bahwa Nabi saw berkata ketika beliau masih dalam kemah, pada hari Perang Badar: \"Aku menagih pesan-Mu dan janji-Mu! Ya Allah, jika Engkau menghendaki (kekalahan kami) niscaya Engkau tidak akan disembah lagi sesudah hari ini\". Lalu Abu Bakar memegang tangan Nabi dan berkata, \"Cukup sudah ya Rasulullah! Engkau telah begitu mendesak Tuhanmu.\"Lalu beliau keluar (dari kemah) melompat dengan memakai baju besi sambil membaca ayat ini. (Riwayat alBukhari) \n\nKemudian Allah menyatakan bahwa yang tersebut itu adalah azab dunia dan mereka akan menemui azab yang lebih hebat lagi pada hari Kiamat.",
      "text_translation": "Golongan itu pasti akan dikalahkan dan mereka akan mundur ke belakang. ",
      "text": "سَيُهْزَمُ الْجَمْعُ وَيُوَلُّوْنَ الدُّبُرَ",
      "text_translation_en": "[Yet] the hosts [of those who deny the truth] shall be routed, and they shall turn their backs [in flight]!",
      "juz_number": 27
    },
    "46": {
      "text_tafsir_en": "The war is the torment they will experience in the world, be it defeat, murder or captivity but they will still receive another terrible punishment, the torment of hell in the hereafter. The doom of the Hereafter is greater and lasts forever and is strong.",
      "text_tafsir": "Peperangan tersebut adalah azab yang akan mereka rasakan di dunia, berupa kekalahan, dibunuh atau ditawan tetapi mereka masih akan menerima azab lain yang lebih dahsyat, yaitu azab neraka di akhirat. Azab akhirat itu lebih hebat dan berlangsung kekal dan kuat selama-lamanya.",
      "text_translation": "Bahkan hari Kiamat itulah hari yang dijanjikan kepada mereka dan hari Kiamat itu lebih dahsyat dan lebih pahit. ",
      "text": "بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ اَدْهٰى وَاَمَرُّ ",
      "text_translation_en": "But nay - the Last Hour is the time when they shall truly meet their fate; and that Last Hour will be most calamitous, and most bitter:",
      "juz_number": 27
    },
    "47": {
      "text_tafsir_en": "Allah declares that those who associate with Allah and deny His apostles are the ones who err and deviate from the right path of the world. In the hereafter they will be afflicted with a painful torment due to their error.",
      "text_tafsir": "Allah menyatakan, bahwa sesungguhnya orang-orang yang mempersekutukan Allah dan mendustakan rasul-rasul-Nya adalah orang-orang sesat dan menyimpang dari jalan yang benar di dunia. Di akhirat nanti mereka akan ditimpa azab yang pedih akibat kesesatannya.",
      "text_translation": "Sungguh, orang-orang yang berdosa berada dalam kesesatan (di dunia) dan akan berada dalam neraka (di akhirat). ",
      "text": "اِنَّ الْمُجْرِمِيْنَ فِيْ ضَلٰلٍ وَّسُعُرٍۘ ",
      "text_translation_en": "for, behold, those who are lost in sin [will at that time come to know that it is they who] were sunk in error and folly!",
      "juz_number": 27
    },
    "48": {
      "text_tafsir_en": "Those who are ungodly will be herded into hell by being dragged and bumping their faces to the ground because of that they suffer greatly. Their suffering in hell is even greater. Hell will melt their skin and flesh",
      "text_tafsir": "Orang-orang yang durhaka akan digiring ke dalam neraka dengan terseret-seret dan terbentur-bentur mukanya ke tanah karena itu mereka sangat menderita. Penderitaan mereka di dalam neraka lebih hebat lagi. Neraka akan melelehkan kulit dan daging mereka",
      "text_translation": "Pada hari mereka diseret ke neraka pada wajahnya. (Dikatakan kepada mereka), “Rasakanlah sentuhan api neraka.”",
      "text": "يَوْمَ يُسْحَبُوْنَ فِى النَّارِ عَلٰى وُجُوْهِهِمْۗ ذُوْقُوْا مَسَّ سَقَرَ",
      "text_translation_en": "On the Day when they shall be dragged into the fire on their faces, [they will be told:] “Taste now the touch of hell-fire!”",
      "juz_number": 27
    },
    "49": {
      "text_tafsir_en": "All beings are created by His rules and laws. That's why when a person is punished for his rules and laws. And all things shall come to pass according to His purpose. In another verse God also speaks of a decree or destiny which is: And he created all things, and appointed the measure thereof. (al-Furqan \/ 25: 2) But man has to strive, His will is given to Allah according to the word of Allah: And that man will only obtain what he has made and that his efforts will be revealed (to him). (an-Najm \/ 53: 39-40) In the authentic hadith narrated by Ahmad and the Muslim from Abu Hurairah: The Messenger of Allah (may peace be upon him) said, \"Ask Allah, and do not be weak. If anything happens to you, then say, Allah has fixed it. what He wills, He does, and do not say: \"If I do this then it will be.\" The word \"if\" opens (the possibility of) a demon. According to the Prophet's hadith: The Messenger of Allah (may peace be upon him) says: (The History of Imam Ahmad and Muslim of Ibn 'Umar) Allah swt said: To him (men) there are angels who keep watch over him, from the front and the back, they guard him by the command of Allah. they change their own situation, and if Allah wills against a people, then no one can reject it and there is no protector. of them besides Him. (ar-Ra'd \/ 13: 11)",
      "text_tafsir": "Seluruh makhluk diciptakan-Nya sesuai ketentuan dan hukum-hukum yang telah ditetapkan-Nya. Karena itu bila seseorang dihukum karena ketetapan dan hukum-hukumnya itu. Dan segala sesuatu akan terjadi sesuai ketetapan-Nya. Dalam ayat lain Allah juga berfirman mengenai ketetapan atau takdir yaitu: \n\nDan Dia menciptakan segala sesuatu, lalu menetapkan ukuranukurannya dengan tepat. (al-Furqan\/25: 2) \n\nTetapi manusia wajib berusaha, ketentuan-Nya diserahkan kepada Allah sesuai firman Allah: \n\nDan bahwa manusia hanya memperoleh apa yang telah diusahakannya dan sesungguhnya usahanya itu kelak akan diperlihatkan (kepadanya). (an-Najm\/53: 39-40) \n\nDalam hadis sahih yang diriwayatkan Ahmad dan Muslim dari Abu Hurairah: Rasulullah saw bersabda, \"Minta tolonglah kepada Allah, dan jangan bersikap lemah. Bila sesuatu menimpamu, maka katakanlah, Allah telah menetapkannya. Apa yang Dia kehendaki, Dia kerjakan, dan jangan kamu berkata: seandainya aku berbuat begini maka akan begitu. Sesungguhnya kata \"seandainya\" membuka (kemungkinan pada) perbuatan setan. Sesuai dengan hadis Rasulullah saw: Rasullah saw bersabda: segala sesuatu ditetapkan ukurannya bahkan kelemahan dan kecerdasan. (Riwayat Imam Ahmad dan Muslim dari Ibnu 'Umar) Allah swt berfirman: \n\nBaginya (manusia) ada malaikat-malaikat yang selalu menjaganya bergiliran, dari depan dan belakangnya. Mereka menjaganya atas perintah Allah. Sesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri. Dan apabila Allah menghendaki keburukan terhadap suatu kaum, maka tak ada yang dapat menolaknya dan tidak ada pelindung bagi mereka selain Dia. (ar-Ra'd\/13: 11)",
      "text_translation": "Sungguh, Kami menciptakan segala sesuatu menurut ukuran. ",
      "text": "اِنَّا كُلَّ شَيْءٍ خَلَقْنٰهُ بِقَدَرٍ ",
      "text_translation_en": "BEHOLD, everything have We created in due measure and proportion;",
      "juz_number": 27
    },
    "50": {
      "text_tafsir_en": "Truly Allah's commands are only delivered once and those commands must happen quickly, faster than a blink of an eye. If Allah wants something to happen then He only says \"Be\" that He wants it to happen immediately. Likewise also regarding the punishment of unbelievers, the punishment must be carried out in the afterlife. (",
      "text_tafsir": "Sesungguhnya perintah Allah hanya disampaikan satu kali dan perintah itu pasti terjadi dengan cepat, lebih cepat dari kedipan mata. Bila Allah swt menghendaki terjadinya sesuatu maka Ia hanya mengatakan \"Jadilah\" yang dikehendaki-Nya itu segera terwujud. Begitu pulalah mengenai hukuman terhadap orang kafir, hukuman pasti terlaksana di akhirat. (",
      "text_translation": "Dan perintah Kami hanyalah (dengan) satu perkataan seperti kejapan mata. ",
      "text": "وَمَآ اَمْرُنَآ اِلَّا وَاحِدَةٌ كَلَمْحٍ ۢبِالْبَصَرِ ",
      "text_translation_en": "and Our ordaining [a thing and its coming into being] is but one [act], like the twinkling of an eye.",
      "juz_number": 27
    },
    "51": {
      "text_tafsir_en": "This verse explains that God destroyed the same people as them, the people who rejected the prophets of old, they were destroyed because of their rebellion. These events should be a lesson for the unbelievers of Mecca and for anyone after their faith. God speaks in another verse about the punishment that was passed on to one generation, the same as the one that was passed down from the previous generation. And there is a barrier between them and what they want to do with the people who are as they were. Indeed, they were first (in the world) in deep doubt. (Saba '\/ 34: 54)",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah membinasakan orangorang yang sama dengan mereka, yaitu umat-umat yang mendustakan para nabi pada zaman lampau, mereka telah hancur karena pembangkangannya. Peristiwa-peristiwa itu hendaknya menjadi pelajaran bagi kaum kafir Mekah dan bagi siapa saja sesudah mereka beriman. Allah berfirman dalam ayat lain mengenai hukuman yang dijatuhkan kepada satu generasi, sama dengan hukuman yang dijatuhkan pada generasi sebelumnya. Dan diberi penghalang antara mereka dengan apa yang mereka inginkan sebagaimana yang dilakukan terhadap orang-orang yang sepaham dengan mereka yang terdahulu. Sesungguhnya mereka dahulu (di dunia) dalam keraguan yang mendalam. (Saba'\/34: 54)",
      "text_translation": "Dan sungguh, telah Kami binasakan orang yang serupa dengan kamu (kekafirannya). Maka adakah orang yang mau mengambil pelajaran?",
      "text": "وَلَقَدْ اَهْلَكْنَآ اَشْيَاعَكُمْ فَهَلْ مِنْ مُّدَّكِرٍ ",
      "text_translation_en": "Thus, indeed, did We destroy people like you [in the past]: who, then, is willing to take it to heart?",
      "juz_number": 27
    },
    "52": {
      "text_tafsir_en": "All human actions are collected in their own notebooks. That is because every act of small or large human being, good or bad is recorded by angels in the notebook, Kiram Angels or simply called Raqib, records good deeds and Angel Katibin or 'Atid records bad deeds. In another verse Allah says: There is not a word that he utters but there is on his side the guardian angel who is always ready (taking notes). (Qaf \/ 50: 18) Because all human activities, both actions and speech, both good and bad, both large and small are recorded in their respective notebooks, it is very easy for God to punish sinners and give the reward for doing good.",
      "text_tafsir": "Semua perbuatan manusia terhimpun dalam buku catatan masing-masing. Hal itu karena setiap perbuatan manusia kecil ataupun besar, baik atau buruk dicatat oleh malaikat di dalam buku catatan itu, Malaikat Kiram atau sebut saja Raqib, mencatat perbuatan yang baik dan Malaikat Katibin atau 'Atid mencatat perbuatan yang tidak baik. Dalam ayat lain Allah berfirman: \n\nTidak ada suatu kata yang diucapkannya melainkan ada di sisinya malaikat pengawas yang selalu siap (mencatat). (Qaf\/50: 18) \n\nOleh karena semua aktivitas manusia, baik perbuatan maupun ucapan, baik yang baik maupun yang buruk, baik besar maupun kecil tercatat di dalam buku catatan masing-masing, maka sangat mudah bagi Allah menjatuhkan hukuman kepada yang berdosa dan memberikan pahala kepada yang berbuat baik.",
      "text_translation": "Dan segala sesuatu yang telah mereka perbuat tercatat dalam buku-buku catatan.",
      "text": "وَكُلُّ شَيْءٍ فَعَلُوْهُ فِى الزُّبُرِ ",
      "text_translation_en": "[They were truly guilty] because all [the evil] that they ever did had been [revealed to them as such] in the [ancient] books of [divine] wisdom;",
      "juz_number": 27
    },
    "53": {
      "text_tafsir_en": "All human actions are collected in their own notebooks. That is because every act of small or large human being, good or bad is recorded by angels in the notebook, Kiram Angels or simply called Raqib, records good deeds and Angel Katibin or 'Atid records bad deeds. In another verse Allah says: There is not a word that he utters but there is on his side the guardian angel who is always ready (taking notes). (Qaf \/ 50: 18) Because all human activities, both actions and speech, both good and bad, both large and small are recorded in their respective notebooks, it is very easy for God to punish sinners and give the reward for doing good.",
      "text_tafsir": "Semua perbuatan manusia terhimpun dalam buku catatan masing-masing. Hal itu karena setiap perbuatan manusia kecil ataupun besar, baik atau buruk dicatat oleh malaikat di dalam buku catatan itu, Malaikat Kiram atau sebut saja Raqib, mencatat perbuatan yang baik dan Malaikat Katibin atau 'Atid mencatat perbuatan yang tidak baik. Dalam ayat lain Allah berfirman: \n\nTidak ada suatu kata yang diucapkannya melainkan ada di sisinya malaikat pengawas yang selalu siap (mencatat). (Qaf\/50: 18) \n\nOleh karena semua aktivitas manusia, baik perbuatan maupun ucapan, baik yang baik maupun yang buruk, baik besar maupun kecil tercatat di dalam buku catatan masing-masing, maka sangat mudah bagi Allah menjatuhkan hukuman kepada yang berdosa dan memberikan pahala kepada yang berbuat baik.",
      "text_translation": "Dan segala (sesuatu) yang kecil maupun yang besar (semuanya) tertulis. ",
      "text": "وَكُلُّ صَغِيْرٍ وَّكَبِيْرٍ مُّسْتَطَرٌ ",
      "text_translation_en": "and everything [that man does], be it small or great, is recorded [with God].",
      "juz_number": 27
    },
    "54": {
      "text_tafsir_en": "For those who fear Allah, Allah gives heaven according to the level of their piety. As is known, heaven is stratified. In the heavens flows a river that shows that heaven is a soothing, beautiful and gives a lot of results. They occupy the right place that has no defects or flaws and they are under the auspices of the Almighty Maharaja, who will give them what He wants without anyone's hindrance.",
      "text_tafsir": "Bagi mereka yang bertakwa, Allah memberikan surgasurga sesuai tingkat ketakwaan mereka. Sebagaimana diketahui surga itu bertingkat-tingkat. Di dalam surga-surga mengalir sungaisungai yang menunjukkan bahwa surga adalah tempat yang menyejukkan, indah dan memberikan hasil yang banyak. Mereka menempati tempat yang benar yang tidak ada cacat atau kekurangannya dan mereka berada di bawah naungan Maharaja yang Mahakuasa, yang akan memberi mereka apa yang Ia kehendaki tanpa halangan siapa pun.",
      "text_translation": "Sungguh, orang-orang yang bertakwa berada di taman-taman dan sungai-sungai,",
      "text": "اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّنَهَرٍۙ  ",
      "text_translation_en": "[Hence, too,] behold, the God-conscious will find themselves in [a paradise of] gardens and running waters,",
      "juz_number": 27
    },
    "55": {
      "text_tafsir_en": "For those who fear Allah, Allah gives heaven according to the level of their piety. As is known, heaven is stratified. In the heavens flows a river that shows that heaven is a soothing, beautiful and gives a lot of results. They occupy the right place that has no defects or flaws and they are under the auspices of the Almighty Maharaja, who will give them what He wants without anyone's hindrance.",
      "text_tafsir": "Bagi mereka yang bertakwa, Allah memberikan surgasurga sesuai tingkat ketakwaan mereka. Sebagaimana diketahui surga itu bertingkat-tingkat. Di dalam surga-surga mengalir sungaisungai yang menunjukkan bahwa surga adalah tempat yang menyejukkan, indah dan memberikan hasil yang banyak. Mereka menempati tempat yang benar yang tidak ada cacat atau kekurangannya dan mereka berada di bawah naungan Maharaja yang Mahakuasa, yang akan memberi mereka apa yang Ia kehendaki tanpa halangan siapa pun.",
      "text_translation": "di tempat yang disenangi di sisi Tuhan Yang Mahakuasa.",
      "text": "فِيْ مَقْعَدِ صِدْقٍ عِنْدَ مَلِيْكٍ مُّقْتَدِرٍ ࣖ ",
      "text_translation_en": "in a seat of truth, in the presence of a Sovereign who determines all things.",
      "juz_number": 27
    }
  },
  "name": "القمر",
  "name_translation_en": "The Moon",
  "name_translation": "Bulan",
  "name_latin": "Al-Qamar"
}