{
  "number": 55,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 78,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, the Most Gracious Allah declares that He has taught the Qur'an to Muhammad (saw) and then taught it to his people. This verse goes down in protest to the people of Mecca saying: The Qur'an is taught only by a man (Muhammad). (an-Nahl \/ 16: 103) Because the contents of this verse reveal some of God's favors for His servants, this surah begins by mentioning the greatest benefits and benefits of His servants, the teaching of the Qur'an. to humans. It is because man by following the teachings of the Qur'an will be happy in the world and in the hereafter and by holding fast to His instructions will be achieved in both places. The Qur'an is the source of the books that were passed down through the best of Allah's creatures on this earth, the Prophet Muhammad.",
      "text_tafsir": "Pada ayat ini Allah yang Maha Pemurah menyatakan bahwa Dia telah mengajarkan Al-Qur'an kepada Muhammad saw yang selanjutnya diajarkannya ke umatnya. Ayat ini turun sebagai bantahan bagi penduduk Mekah yang mengatakan: \n\nSesungguhnya Al-Qur'an itu hanya diajarkan oleh seorang manusia kepadanya (Muhammad). (an-Nahl\/16: 103) \n\nOleh karena isi ayat ini mengungkapkan beberapa nikmat Allah atas hamba-Nya, maka surah ini dimulai dengan menyebut nikmat yang paling besar faedahnya dan paling banyak manfaatnya bagi hamba-Nya, yaitu nikmat mengajarkan Al-Qur'an kepada manusia. Hal itu karena manusia dengan mengikuti ajaran Al-Qur'an akan berbahagia di dunia dan di akhirat dan dengan berpegang teguh pada petunjuk-petunjuk-Nya akan tercapai tujuan di kedua tempat tersebut. Al-Qur'an adalah induk kitab-kitab samawi yang diturunkan melalui makhluk Allah yang terbaik di bumi ini yaitu Nabi Muhammad saw.",
      "text_translation": "(Allah) Yang Maha Pengasih,",
      "text": "اَلرَّحْمٰنُۙ  ",
      "text_translation_en": "THE MOST GRACIOUS",
      "juz_number": 27
    },
    "2": {
      "text_tafsir_en": "In this verse, the Most Gracious Allah declares that He has taught the Qur'an to Muhammad (saw) and then taught it to his people. This verse goes down in protest to the people of Mecca saying: The Qur'an is taught only by a man (Muhammad). (an-Nahl \/ 16: 103) Because the contents of this verse reveal some of God's favors for His servants, this surah begins by mentioning the greatest benefits and benefits of His servants, the teaching of the Qur'an. to humans. It is because man by following the teachings of the Qur'an will be happy in the world and in the hereafter and by holding fast to His instructions will be achieved in both places. The Qur'an is the source of the books that were passed down through the best of Allah's creatures on this earth, the Prophet Muhammad.",
      "text_tafsir": "Pada ayat ini Allah yang Maha Pemurah menyatakan bahwa Dia telah mengajarkan Al-Qur'an kepada Muhammad saw yang selanjutnya diajarkannya ke umatnya. Ayat ini turun sebagai bantahan bagi penduduk Mekah yang mengatakan: \n\nSesungguhnya Al-Qur'an itu hanya diajarkan oleh seorang manusia kepadanya (Muhammad). (an-Nahl\/16: 103) \n\nOleh karena isi ayat ini mengungkapkan beberapa nikmat Allah atas hamba-Nya, maka surah ini dimulai dengan menyebut nikmat yang paling besar faedahnya dan paling banyak manfaatnya bagi hamba-Nya, yaitu nikmat mengajarkan Al-Qur'an kepada manusia. Hal itu karena manusia dengan mengikuti ajaran Al-Qur'an akan berbahagia di dunia dan di akhirat dan dengan berpegang teguh pada petunjuk-petunjuk-Nya akan tercapai tujuan di kedua tempat tersebut. Al-Qur'an adalah induk kitab-kitab samawi yang diturunkan melalui makhluk Allah yang terbaik di bumi ini yaitu Nabi Muhammad saw.",
      "text_translation": "Yang telah mengajarkan Al-Qur'an.",
      "text": "عَلَّمَ الْقُرْاٰنَۗ ",
      "text_translation_en": "has imparted this Qur’an [unto man].",
      "juz_number": 27
    },
    "3": {
      "text_tafsir_en": "In this verse Allah mentions His other blessings, namely the creation of man. Favors are the basis of other favors. After Allah revealed the pleasure of teaching the Qur'an in the last verse, then in this verse He created His best type of creature, which is man and taught him to express what is scratched in his heart and what is thought in his brain, because of his ability to think and speaking that the Qur'an can be taught to mankind. Humans are the most perfect creatures of God. He made Him stand straight, so his hands were released. With hands free, the brain is free to think, and the hands can realize what is thought by the brain. The brain produces knowledge, and the hands produce technology. Science and technology are civilizations, thus only humans have civilization. The tongue is an organ located in the oral cavity. This organ, which is a muscular structure consisting of seventeen muscles that has several functions. The taste taste function is one of the main functions of the tongue. There are around 10,000 taste buds on the tongue. The tongue also functions to help regulate sounds for communication. The tongue, in religion, is almost always associated with the heart, and is used to measure the merits of one's behavior. Humans will be good if both are good. And humans will be bad, if both are bad. The Holy Prophet pointed to the tongue as the main factor that brought disaster to mankind, and he was the benchmark for other body parts. He said in his hadith: Aren't humans turned their faces upside down in hell because of their tongues? (History of at-Tirmidhi and Ibn Majah) If humans wake up in the morning, all members of their bodies remind their tongues and say, \"Fear God about us, because we are nothing but you. If you are straight, we are straight, and if you are bent, we're bent. \" (History of at-Tirmidhi) To be able to make different sounds, or so-called speech, the tongue cooperates with several other organs, such as the lips, oral cavity, lungs, esophagus, and vocal cords. We can communicate by talking, after the whole community agrees on the meaning of one sound. Then the sounds that have been agreed on each of the meanings are combined in the proper arrangement to become sentences. In the next stage, a language will be created. Language is described in one of Allah's verses thus: And among His signs (greatness) are the creation of heaven and earth, the differences in your language and the color of your skin. Truly, in that there really are signs for those who know. (ar-Rum \/ 30: 22)",
      "text_tafsir": "Pada ayat ini Allah menyebutkan nikmat-Nya yang lain yaitu penciptaan manusia. Nikmat itu merupakan landasan nikmat-nikmat yang lain. Sesudah Allah menyatakan nikmat mengajarkan Al-Qur'an pada ayat yang lalu, maka pada ayat ini Dia menciptakan jenis makhluk-Nya yang terbaik yaitu manusia dan diajari-Nya pandai mengutarakan apa yang tergores dalam hatinya dan apa yang terpikir dalam otaknya, karena kemampuan berpikir dan berbicara itulah Al-Qur'an bisa diajarkan kepada umat manusia. Manusia adalah makhluk Allah yang paling sempurna. Ia dijadikan-Nya tegak, sehingga tangannya lepas. Dengan tangan yang lepas, otak bebas berpikir, dan tangan dapat merealisasikan apa yang dipikirkan oleh otak. Otak menghasilkan ilmu pengetahuan, dan tangan menghasilkan teknologi. Ilmu dan teknologi adalah peradaban, dengan demikian hanya manusia yang memiliki peradaban. Lidah adalah organ yang terletak pada rongga mulut. Organ ini, yang merupakan struktur berotot yang terdiri atas tujuh belas otot yang memiliki beberapa fungsi. Fungsi pengecap rasa adalah salah satu fungsi lidah yang utama. Terdapat sekitar 10.000 titik pengecap di lidah. Lidah juga berfungsi untuk turut membantu mengatur bunyi untuk berkomunikasi. Lidah, dalam agama, hampir selalu dikaitkan dengan hati, dan digunakan untuk mengukur baik-buruknya perilaku seseorang. Manusia akan menjadi baik apabila keduanya baik. Dan manusia akan menjadi buruk, apabila keduanya buruk. Nabi Muhammad saw menunjuk lidah sebagai faktor utama yang membawa bencana bagi manusia, dan ia merupakan tolok ukur untuk bagian tubuh lainnya. Beliau bersabda dalam hadisnya: Bukankah manusia dijungkirbalikkan wajah mereka di neraka karena lidah mereka? (Riwayat at-Tirmidhi dan Ibnu Majah) Jika manusia bangun di pagi hari, maka seluruh anggota tubuhnya mengingatkan lidah dan berpesan, \"Bertakwalah kepada Allah menyangkut kami, karena kami tidak lain kecuali denganmu. Jika engkau lurus, kami pun lurus, dan jika engkau bengkok, kami pun bengkok.\" (Riwayat at-Tirmidhi) \n\nUntuk dapat mengeluarkan bunyi yang berbeda-beda, atau yang disebut berbicara, lidah bekerjasama dengan beberapa organ lainnya, seperti bibir, rongga mulut, paru-paru, kerongkongan, dan pita suara. Kita dapat berkomunikasi dengan berbicara, setelah seluruh masyarakat menyepakati arti dari satu bunyi. Kemudian bunyi-bunyi yang masing-masing sudah disepakati artinya tersebut digabungkan dalam susunan yang tepat untuk menjadi kalimat. Pada tahap selanjutnya, akan tercipta suatu bahasa. Bahasa diuraikan dalam salah satu ayat Allah demikian: \n\nDan di antara tanda-tanda (kebesaran)-Nya ialah penciptaan langit dan bumi, perbedaan bahasamu dan warna kulitmu. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda bagi orangorang yang mengetahui. (ar-Rum\/30: 22)",
      "text_translation": "Dia menciptakan manusia, ",
      "text": "خَلَقَ الْاِنْسَانَۙ ",
      "text_translation_en": "He has created man:",
      "juz_number": 27
    },
    "4": {
      "text_tafsir_en": "In this verse Allah mentions His other blessings, namely the creation of man. Favors are the basis of other favors. After Allah revealed the pleasure of teaching the Qur'an in the last verse, then in this verse He created His best type of creature, which is man and taught him to express what is scratched in his heart and what is thought in his brain, because of his ability to think and speaking that the Qur'an can be taught to mankind. Humans are the most perfect creatures of God. He made Him stand straight, so his hands were released. With hands free, the brain is free to think, and the hands can realize what is thought by the brain. The brain produces knowledge, and the hands produce technology. Science and technology are civilizations, thus only humans have civilization. The tongue is an organ located in the oral cavity. This organ, which is a muscular structure consisting of seventeen muscles that has several functions. The taste taste function is one of the main functions of the tongue. There are around 10,000 taste buds on the tongue. The tongue also functions to help regulate sounds for communication. The tongue, in religion, is almost always associated with the heart, and is used to measure the merits of one's behavior. Humans will be good if both are good. And humans will be bad, if both are bad. The Holy Prophet pointed to the tongue as the main factor that brought disaster to mankind, and he was the benchmark for other body parts. He said in his hadith: Aren't humans turned their faces upside down in hell because of their tongues? (History of at-Tirmidhi and Ibn Majah) If humans wake up in the morning, all members of their bodies remind their tongues and say, \"Fear God about us, because we are nothing but you. If you are straight, we are straight, and if you are bent, we're bent. \" (History of at-Tirmidhi) To be able to make different sounds, or so-called speech, the tongue cooperates with several other organs, such as the lips, oral cavity, lungs, esophagus, and vocal cords. We can communicate by talking, after the whole community agrees on the meaning of one sound. Then the sounds that have been agreed on each of the meanings are combined in the proper arrangement to become sentences. In the next stage, a language will be created. Language is described in one of Allah's verses thus: And among His signs (greatness) are the creation of heaven and earth, the differences in your language and the color of your skin. Truly, in that there really are signs for those who know. (ar-Rum \/ 30: 22)",
      "text_tafsir": "Pada ayat ini Allah menyebutkan nikmat-Nya yang lain yaitu penciptaan manusia. Nikmat itu merupakan landasan nikmat-nikmat yang lain. Sesudah Allah menyatakan nikmat mengajarkan Al-Qur'an pada ayat yang lalu, maka pada ayat ini Dia menciptakan jenis makhluk-Nya yang terbaik yaitu manusia dan diajari-Nya pandai mengutarakan apa yang tergores dalam hatinya dan apa yang terpikir dalam otaknya, karena kemampuan berpikir dan berbicara itulah Al-Qur'an bisa diajarkan kepada umat manusia. Manusia adalah makhluk Allah yang paling sempurna. Ia dijadikan-Nya tegak, sehingga tangannya lepas. Dengan tangan yang lepas, otak bebas berpikir, dan tangan dapat merealisasikan apa yang dipikirkan oleh otak. Otak menghasilkan ilmu pengetahuan, dan tangan menghasilkan teknologi. Ilmu dan teknologi adalah peradaban, dengan demikian hanya manusia yang memiliki peradaban. Lidah adalah organ yang terletak pada rongga mulut. Organ ini, yang merupakan struktur berotot yang terdiri atas tujuh belas otot yang memiliki beberapa fungsi. Fungsi pengecap rasa adalah salah satu fungsi lidah yang utama. Terdapat sekitar 10.000 titik pengecap di lidah. Lidah juga berfungsi untuk turut membantu mengatur bunyi untuk berkomunikasi. Lidah, dalam agama, hampir selalu dikaitkan dengan hati, dan digunakan untuk mengukur baik-buruknya perilaku seseorang. Manusia akan menjadi baik apabila keduanya baik. Dan manusia akan menjadi buruk, apabila keduanya buruk. Nabi Muhammad saw menunjuk lidah sebagai faktor utama yang membawa bencana bagi manusia, dan ia merupakan tolok ukur untuk bagian tubuh lainnya. Beliau bersabda dalam hadisnya: Bukankah manusia dijungkirbalikkan wajah mereka di neraka karena lidah mereka? (Riwayat at-Tirmidhi dan Ibnu Majah) Jika manusia bangun di pagi hari, maka seluruh anggota tubuhnya mengingatkan lidah dan berpesan, \"Bertakwalah kepada Allah menyangkut kami, karena kami tidak lain kecuali denganmu. Jika engkau lurus, kami pun lurus, dan jika engkau bengkok, kami pun bengkok.\" (Riwayat at-Tirmidhi) \n\nUntuk dapat mengeluarkan bunyi yang berbeda-beda, atau yang disebut berbicara, lidah bekerjasama dengan beberapa organ lainnya, seperti bibir, rongga mulut, paru-paru, kerongkongan, dan pita suara. Kita dapat berkomunikasi dengan berbicara, setelah seluruh masyarakat menyepakati arti dari satu bunyi. Kemudian bunyi-bunyi yang masing-masing sudah disepakati artinya tersebut digabungkan dalam susunan yang tepat untuk menjadi kalimat. Pada tahap selanjutnya, akan tercipta suatu bahasa. Bahasa diuraikan dalam salah satu ayat Allah demikian: \n\nDan di antara tanda-tanda (kebesaran)-Nya ialah penciptaan langit dan bumi, perbedaan bahasamu dan warna kulitmu. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda bagi orangorang yang mengetahui. (ar-Rum\/30: 22)",
      "text_translation": "mengajarnya pandai berbicara.",
      "text": "عَلَّمَهُ الْبَيَانَ ",
      "text_translation_en": "He has imparted unto him articulate thought and speech.",
      "juz_number": 27
    },
    "5": {
      "text_tafsir_en": "Allah mentions that the sun and moon which are among the largest celestial bodies, circulate in their respective sun and moon orbits, which are very certain, because of this there will be changes in seasons. By taking into account these changes humans can regulate agriculture, trade, education and so on. Many verses in the Qur'an mention and explain the pair of the sun and moon. The sun as a source of bright blazing light (wahhaj) due to nuclear reactions in it. While the moon is only a reflection of the light it receives from the sun it has a bright, sparkling surface (munir). The sun and moon along with other celestial bodies are not stationary. They move in the sky on each other's path (path) as Allah says in Surah adhdzariyat \/ 51: 7. The road in question is the path of the celestial body, including the sun and moon. In physics, the path of a celestial body is called an orbit is a path or path traversed by a celestial body, around other celestial bodies, under the influence of certain forces. The orbit was first analyzed mathematically by Johannes Kepler who formulated the results of his calculations in Kepler's law of planetary motion. He discovered that the orbits of planets in our solar system are elliptical and not circular or epicyclical as originally believed. In 1601 Kepler tried to match various shapes of geometry curves in the existing position data of Mars. Until 1606, after nearly a year spent just looking for an 8 minute arc difference (maybe for most people this would be ignored), Kepler obtained the orbit of Planet Mars. According to Kepler, the ellipse-shaped path is the most appropriate motion for the orbits of planets around the sun. In 1609 he published Astronomia Nova which stated two laws of planetary motion. The movements of these celestial bodies are fully controlled and everything must move in a calculated orbit. If not what will happen is a collision which means fatal destruction. Please note that the moon circulates around the earth in 29,53059 days. This time is the time of the moon's circulation relative to the earth without including the element of the earth's circulation to the sun. If we include elements of the relative motion of the moon and the sun with all the stars in nature, the duration of the earth's circulation is not 24 hours but 23 hours 56 minutes 4 seconds and the moon's circulation time to the earth is 27.321661 days or 86164.0906 seconds. A fantastic number, Subhanallah. This is confirmed again in His Word to Surah Yasin 36: 38, 40 and Surah alAnbiya '\/ 21: 33. The earth and other planets in the solar system move in their respective orbits around the sun. The sun in its orbital path also moves around a larger system, the Milky Way galaxy, and so on. But none of the stars, planets and other heavenly bodies in space move uncontrollably or cut other orbits or clash with each other. Obviously the accuracy of destiny in harmony between creation and movement. In this vast sky the movement of every celestial body is not a single strand of hair or even a second too late. The Qur'an hints harmonious movements of celestial bodies in the universe, this is revealed in adhdzariyat \/ 51: 7",
      "text_tafsir": "Allah menyebutkan bahwa matahari dan bulan yang termasuk di antara benda-benda angkasa yang terbesar, beredar dalam orbitnya masing-masing matahari dan bulan yang sangat pasti, karena adanya itu maka terjadilah perubahan musim-musim. Dengan memperhitungkan perubahan-perubahan tersebut manusia dapat mengatur pertanian, perdagangan, pendidikan dan sebagainya. Banyak ayat dalam Al-Qur'an menyebut dan menjelaskan tentang pasangan matahari dan bulan. Matahari sebagai sumber cahaya yang terang membara (wahhaj) akibat reaksi nuklir di dalamnya. Sementara bulan hanya sebagai pemantul cahaya yang diterimanya dari matahari memiliki permukaan yang cerah berbinar-binar (munir). Matahari dan bulan bersama benda-benda langit lainnya tidak diam. Mereka bergerak di angkasa pada jalan (garis edar) masingmasing sebagaimana Allah berfirman dalam Surah adhdzariyat\/51:7. Jalan yang dimaksud adalah garis edar dari bendabenda langit, termasuk matahari dan bulan. Dalam fisika, garis edar benda langit disebut orbit merupakan jalan atau lintasan yang dilalui oleh suatu benda langit, di sekitar benda langit lainnya, di dalam pengaruh dari gaya-gaya tertentu. Orbit pertama kali dianalisa secara matematis oleh Johannes Kepler yang merumuskan hasil perhitungannya dalam hukum Kepler tentang gerak planet. Dia menemukan bahwa orbit dari planet dalam tata surya kita adalah berbentuk ellips dan bukan lingkaran atau episiklus seperti yang semula dipercaya. Pada tahun 1601 Kepler berusaha mencocokkan berbagai bentuk kurva geometri pada data-data posisi Planet Mars yang ada. Hingga tahun 1606, setelah hampir setahun menghabiskan waktunya hanya untuk mencari penyelesaian perbedaan sebesar 8 menit busur (mungkin bagi kebanyakan orang hal ini akan diabaikan), Kepler mendapatkan orbit Planet Mars. Menurut Kepler, lintasan berbentuk ellips adalah gerakan yang paling sesuai untuk orbit planet yang mengitari matahari. Pada tahun 1609 dia memublikasikan Astronomia Nova yang menyatakan dua hukum gerak planet. Pergerakan-pergerakan benda langit ini terkendali sepenuhnya dan semuanya harus bergerak dalam suatu orbit yang terhitung. Jika tidak yang akan terjadi adalah tabrakan yang berarti kehancuran yang fatal. Perlu diketahui bahwa bulan beredar mengitari bumi dalam waktu 29.53059 hari. Waktu ini adalah waktu edar bulan relatif terhadap bumi tanpa memasukkan unsur peredaran bumi terhadap matahari. Apabila dimasukkan unsur pergerakan relatif bulan dan matahari terhadap semua bintang di alam maka lama peredaran bumi bukan 24 jam tetapi 23 jam 56 menit 4 detik dan waktu edar bulan terhadap bumi adalah 27.321661 hari atau 86164.0906 detik. Suatu angka yang fantastic, Subhanallah. Hal ini dipertegas lagi dalam firman-Nya pada Surah Yasin 36: 38, 40 dan Surah alAnbiya'\/21: 33. Bumi dan planet-planet lain di sistem tata surya ini bergerak pada orbitnya masing-masing mengelilingi matahari. Matahari di lintasan orbitnya juga bergerak mengelilingi sistem yang lebih besar lagi yakni galaksi Bimasakti, begitu seterusnya. Tetapi tidak satupun dari bintang, planet dan benda-benda langit lainnya di angkasa bergerak tidak terkendali atau memotong orbit lain ataupun saling berbenturan. Tampak jelas kecermatan takdir pada keserasian antara ciptaan dan gerakan. Di angkasa yang luas ini pergerakan setiap benda langit tidak ada yang melenceng sehelai rambut pun atau terlambat sedetikpun. Al-Qur'an mengisyaratkan pergerakan benda-benda langit di alam semesta ini secara serasi, hal tersebut diungkap dalam adhdzariyat\/51:7",
      "text_translation": "Matahari dan bulan beredar menurut perhitungan,",
      "text": "اَلشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍۙ ",
      "text_translation_en": "[At His behest] the sun and the moon run their appointed courses;",
      "juz_number": 27
    },
    "6": {
      "text_tafsir_en": "Allah states that shrubs, and branching trees, both subject to His will instinctively, as humans submit according to their nature. The difference between plants and trees in form and appearance, color and taste, all of which is due to obedience and submission to the power that created Him",
      "text_tafsir": "Allah menyatakan bahwa tanaman-tanaman perdu, dan pohon-pohon yang bercabang, kedua-duanya tunduk kepada kehendak-Nya secara naluri, sebagaimana tunduknya manusia menurut fitrahnya. Perbedaan antara tumbuh-tumbuhan dan pohonpohonan dalam bentuk dan rupa, warna dan rasa, semua itu adalah karena patuh dan tunduk kepada kekuasaan yang menciptakan-Nya",
      "text_translation": "dan tetumbuhan dan pepohonan, keduanya tunduk (kepada-Nya). ",
      "text": "وَّالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ ",
      "text_translation_en": "[before Him] prostrate them­selves the stars and the trees.",
      "juz_number": 27
    },
    "7": {
      "text_tafsir_en": "God declares that He created the heavens in which His decrees and decrees were given to His servants, where angels descended to bring His revelations to His prophets, and He desired equilibrium in all things. Among these are the balances of the faith, that is, his mentality, because monotheism is the middle ground between denying God by associating with him, Consciousness in worship, in practice and in character, balance in spiritual and physical strength and so on. Such is the judgment and justice that He requires by not neglecting one thing because of its smallness and by not caring for another because of its greatness. His judgment covers everything in this world.",
      "text_tafsir": "Allah menyatakan bahwa Dia menciptakan langit tempat diturunkan perintah dan larangan-Nya kepada hamba-hamba-Nya, tempat malaikat-malaikat yang turun membawa wahyu-Nya kepada nabi-nabi-Nya, Di samping itu Dia menghendaki adanya keseimbangan dalam segala hal. Di antaranya adalah perimbangan akidah, yaitu mentauhidkan-Nya, karena tauhid adalah pertengahan antara mengingkari adanya Allah dengan mempersekutukan-Nya begitu saja, Perimbangan dalam ibadah, dalam beramal dan dalam budi pekerti, perimbangan dalam kekuatan rohani dan jasmani dan sebagainya. Demikianlah perimbangan dan keadilan yang dikehendaki-Nya dengan tidak membiarkan sesuatu karena kecilnya dan tidak pula mementingkan yang lain karena besarnya. Perimbangan-Nya mencakup semua yang ada di alam ini.",
      "text_translation": "Dan langit telah ditinggikan-Nya dan Dia ciptakan keseimbangan,",
      "text": "وَالسَّمَاۤءَ رَفَعَهَا وَوَضَعَ الْمِيْزَانَۙ  ",
      "text_translation_en": "And the skies has He raised high, and has devised [for all things] a measure,",
      "juz_number": 27
    },
    "8": {
      "text_tafsir_en": "God declares that He does this so that man does not transgress and transcend the boundaries of justice and smoothness of conduct in accordance with the prescribed balance of all things, and thus the human condition will be improved, morality and charity will be more noble and orderly.",
      "text_tafsir": "Allah menyatakan bahwa Dia melakukan yang demikian itu agar manusia tidak melampaui dan melangkahi batas-batas keadilan dan kelancaran menjalankan sesuatu menurut neraca yang telah ditetapkan bagi segala sesuatu, maka dengan demikian keadaan manusia akan bertambah baik, akhlak dan amal perbuatan akan lebih mulia dan teratur.",
      "text_translation": "agar kamu jangan merusak keseimbangan itu, ",
      "text": "اَلَّا تَطْغَوْا فِى الْمِيْزَانِ ",
      "text_translation_en": "so that you [too, O men,] might never transgress the measure [of what is right]:",
      "juz_number": 27
    },
    "9": {
      "text_tafsir_en": "God commands humans to establish the scales fairly and do not cheat. This shows that man must pay attention to the just balance in all his deeds and words. In the Qur'an, Allah not only informs man about His creation, but also gives indications for utilizing all creation for human welfare. In relation to the sun and moon, Allah gives very clear instructions that the two heavenly bodies will be very useful to be used as a benchmark. It was announced that the circulation of the two celestial bodies had calculations. Science then uses that order to be a marker of time or calendar. The instructions are also in the following two verses: And He has subjected the sun and moon to you who are constantly circulating (in their orbits); and have subdued night and day for you. (Ibrahim \/ 14: 33) Surely the number of months according to God is twelve months, (as) in the decree of God when He created the heavens and the earth, of which there were four unclean months. That is a (straight) religion of righteousness, so do not tyrannize yourself in that (the fourth month), and fight the polytheists all as they fight you all. And know that Allah is with those who fear God. (at-Taubah \/ 9: 36) Humans have been given instructions to divide their time and calendar clearly. In modern astronomy, the so-called one year in the calculation of the Solar Calendar (Solar Calendar) is the period of time required by the earth to make one rotation in its orbit around the sun. The time required is 365 days, 5 hours, 48 minutes, 46 seconds. Or about 365.25 days less 1 minute 14 seconds. If one month Solar is around 30 days. Whereas one year in the Lunar Calendar calculation is a period of 12 Lunar months. If one Lunar month (the period required by the moon to circle the earth) is 29.5 days, then one Lunar year is 354 days. The history of human civilization in making calendars shows different numbers. The ancient Romans divided one year into 10 months. During the Pre-Julius Caesar period, it was corrected and became 12 months. Then refined again by Pope Gregory XIII (Gregorian Calendar) and used as a modern calendar used today. Calendars have also been used in older civilizations. The Akkadian, Sumerian, Babylonian, Assyrian, Jewish, Indian and Chinese peoples gave 12 months a year. While Greece counts 10 months of the year. The Aztecs, Maya and Incas in South America, divided one year into 13 months, with the number of days per month of 20 days. In one of the verses above there is the word \"subdue\". This implies that humans use reason in utilizing the two celestial bodies. Here is contained an order to develop technology. One of them is to use the regularity of the sun's orbit and moon to make the calendar and time management. He is the one who makes the sun shine and the moon shine, and He determines the places of its orbit, so that you know the number of years, and calculations (time). God did not create it that way but it is true. He explained the signs (His greatness) to those who knew. (Jonah \/ 10: 5) The orbits of the sun, moon and earth are well known. But that the sun also has its own orbital path was only known to modern astronomers and astrophysics in the last half of the 20th century. The sun orbits the center of the galaxy on the outskirts of the Milky Way galaxy. The diameter of this galaxy disk is 3 x 107 km. The time it takes for the sun to surround the galactic center is 250 million years. Specifically for Surah at-Taubah \/ 9 verse 36 above, reminded of the four months that were purified (months of Muharam, Rajab, Zulkaidah, and Dhul-Hijah). These four months have been purified by the Middle Eastern people since the time of Prophet Ibrahim.",
      "text_tafsir": "Allah memerintahkan manusia untuk menegakkan timbangan dengan adil dan jangan berlaku curang. Ini menunjukkan bahwa manusia harus memperhatikan timbangan yang adil dalam semua amal perbuatan dan ucapan-ucapannya. Dalam Al-Qur'an Allah tidak saja memberitahu manusia mengenai ciptaan-Nya, namun juga memberikan indikasi-indikasi untuk memanfaatkan semua ciptaan untuk kesejahteraan manusia. Dalam kaitan dengan matahari dan bulan, Allah memberikan petunjuk yang sangat jelas bahwa kedua benda langit tersebut akan sangat berguna untuk dijadikan patokan. Diberitahukan bahwa peredaran kedua benda langit itu mempunyai perhitungan. Ilmu pengetahuan kemudian menggunakan keteraturan itu untuk dijadikan penanda waktu atau kalender. Petunjuk itu juga ada pada dua ayat berikut: \n\nDan Dia telah menundukkan matahari dan bulan bagimu yang terusmenerus beredar (dalam orbitnya); dan telah menundukkan malam dan siang bagimu. (Ibrahim\/14: 33) \n\nSesungguhnya jumlah bulan menurut Allah ialah dua belas bulan, (sebagaimana) dalam ketetapan Allah pada waktu Dia menciptakan langit dan bumi, di antaranya ada empat bulan haram. Itulah (ketetapan) agama yang lurus, maka janganlah kamu menzalimi dirimu dalam (bulan yang empat) itu, dan perangilah kaum musyrikin semuanya sebagaimana mereka pun memerangi kamu semuanya. Dan ketahuilah bahwa Allah beserta orang-orang yang takwa. (at-Taubah\/9: 36) \n\nManusia telah diberikan petunjuk untuk membagi waktu dan penanggalan dengan jelas. Dalam astronomi modern, maka yang disebut satu tahun dalam perhitungan Kalender Matahari (Solar Calendar) adalah periode waktu yang diperlukan oleh bumi untuk melakukan satu putaran dalam orbitnya mengelilingi matahari. Waktu yang diperlukan adalah 365 hari, 5 jam, 48 menit, 46 detik. Atau sekitar 365,25 hari kurang 1 menit 14 detik. Apabila satu bulan Solar adalah sekitar 30 hari. Sedangkan satu tahun dalam perhitungan Kalender Bulan (Lunar Calendar) adalah satu periode dari 12 bulan Lunar. Jika satu bulan Lunar (periode yang diperlukan bulan untuk mengelilingi bumi) adalah 29,5 hari, maka satu tahun Lunar adalah 354 hari. Sejarah peradaban umat manusia dalam membuat kalender menunjukkan angka yang berbeda-beda. Bangsa Romawi kuno membagi satu tahun dalam 10 bulan. Pada masa Pra-Julius Caesar, dilakukan koreksi dan menjadi 12 bulan. Kemudian disempurnakan lagi oleh Paus Gregorius XIII (Gregorian Calendar) dan digunakan sebagai kalender modern yang digunakan saat ini. Kalender juga sudah digunakan pada peradaban yang lebih tua. Bangsa-bangsa Akkadia, Sumeria, Babilonia, Assiria, Yahudi, India dan Cina memberikan angka 12 bulan dalam setahunnya. Sedangkan Yunani menghitung 10 bulan dalam setahun. Bangsa Aztec, Maya dan Inca di Amerika Selatan, membagi satu tahun menjadi 13 bulan, dengan jumlah hari per bulannya sebanyak 20 hari. Pada salah satu ayat di atas ada kata \"menundukkan\". Ini mengisyaratkan agar manusia menggunakan akal dalam memanfaatkan kedua benda langit tersebut. Di sini dikandung perintah untuk mengembangkan teknologi. Salah satunya adalah menggunakan keteraturan orbit matahari dan bulan untuk pembuatan penanggalan dan pengaturan waktu. \n\nDialah yang menjadikan matahari bersinar dan bulan bercahaya, dan Dialah yang menetapkan tempat-tempat orbitnya, agar kamu mengetahui bilangan tahun, dan perhitungan (waktu). Allah tidak menciptakan demikian itu melainkan dengan benar. Dia menjelaskan tanda-tanda (kebesaran-Nya) kepada orang-orang yang mengetahui. (Yunus\/10: 5) \n\nLintasan-lintasan orbit matahari, bulan dan bumi sudah sangat diketahui. Namun bahwa matahari juga memiliki lintasan orbitnya sendiri baru diketahui para ahli astronomi dan astrofisika modern pada paruh abad ke-20 yang lalu. Matahari mengorbit pusat galaksi di pinggiran piringan galaksi Bimasakti. Adapun garis tengah piringan galaksi ini adalah 3 x 107 km. Waktu yang diperlukan matahari untuk mengelilingi pusat galaksi adalah 250 juta tahun. Khusus untuk Surah at-Taubah\/9 ayat 36 di atas, diingatkan akan empat bulan yang disucikan (bulan-bulan Muharam, Rajab, Zulkaidah, dan Zulhijah). Keempat bulan itu sudah disucikan masyarakat Timur Tengah sejak zaman Nabi Ibrahim.",
      "text_translation": "dan tegakkanlah keseimbangan itu dengan adil dan janganlah kamu mengurangi keseimbangan itu. ",
      "text": "وَاَقِيْمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيْزَانَ ",
      "text_translation_en": "weigh, therefore, [your deeds] with equity, and cut not the measure short!",
      "juz_number": 27
    },
    "10": {
      "text_tafsir_en": "God explains that He created the earth for the habitation of animals, and every kind that has a spirit and on earth is a place of life to benefit from the things on the surface of the earth and in the stomach,",
      "text_tafsir": "Allah menerangkan bahwa Dia mendatarkan bumi untuk tempat tinggal binatang, dan semua jenis yang mempunyai roh dan di bumi itu tempat kehidupan untuk dapat mengambil manfaat dari benda-benda di permukaan bumi dan yang berada di dalam perutnya,",
      "text_translation": "Dan bumi telah dibentangkan-Nya untuk makhluk(-Nya), ",
      "text": "وَالْاَرْضَ وَضَعَهَا لِلْاَنَامِۙ  ",
      "text_translation_en": "And the earth has He spread out for all living beings,",
      "juz_number": 27
    },
    "11": {
      "text_tafsir_en": "Allah tells us that on this earth there are various substances that can be made into food from various fruits, whether eaten after being cooked from the tree or when cooked thoroughly, either from fruits being dried or in wet conditions. Next, God states, the palm trees that have their fruit packets when it comes out. It is specially called dates because it is grown in Arab countries and has many benefits. The fruit is good to eat in its young age and after its maturity, whether it is wet or dry. From all its trees can also be taken benefits such as leaves for baskets and mats, its bark for ropes, its bark for roofs, and its stems for poles. From some of the benefits mentioned, palm varieties are specialized in mentioning them among other fruits.",
      "text_tafsir": "Allah memberitahukan bahwa di bumi ini terdapat bermacam-macam bahan yang dapat dijadikan makanan dari aneka ragam buah-buahan, baik yang dimakan setelah masak dari pohonnya atau setelah dimasak dengan rapi, baik dari buah-buahan setelah dikeringkan maupun dalam keadaan masih basah. Seterusnya Allah menyatakan, pohon-pohon kurma yang mempunyai selodang pembungkus buahnya ketika ia keluar. Dikhususkan sebutan kurma ini karena ditanam di tanah Arab dan sangat banyak faedahnya. Buahnya baik dimakan di waktu masih muda maupun setelah ia matang, baik keadaan basah maupun setelah ia dikeringkan. Dari seluruh pohonnya dapat juga diambil faedah seperti daunnya untuk keranjang dan tikar, sabutnya untuk tali, pelepahnya untuk atap rumah, dan batangnya untuk tiang. Dari beberapa faedah yang disebutkan, jenis kurma dikhususkan dalam menyebutnya di antara buah-buahan yang lain.",
      "text_translation": "di dalamnya ada buah-buahan dan pohon kurma yang mempunyai kelopak mayang, ",
      "text": "فِيْهَا فَاكِهَةٌ وَّالنَّخْلُ ذَاتُ الْاَكْمَامِۖ  ",
      "text_translation_en": "with fruit thereon, and palm trees with sheathed clusters [of dates],",
      "juz_number": 27
    },
    "12": {
      "text_tafsir_en": "In this verse God states that all the grains used as food, such as wheat, rice and barley have leaves covering their bunches, as well as all the fragrant plants.",
      "text_tafsir": "Pada ayat ini Allah menyatakan bahwa semua biji-bijian yang dijadikan sebagai bahan makanan, seperti gandum, padi dan jelai mempunyai daun yang menutupi tandan-tandannya, begitu pula semua yang berbau harum dari tumbuh-tumbuhan.",
      "text_translation": "dan biji-bijian yang berkulit dan bunga-bunga yang harum baunya. ",
      "text": "وَالْحَبُّ ذُو الْعَصْفِ وَالرَّيْحَانُۚ  ",
      "text_translation_en": "and grain growing tall on its stalks, and sweet-smelling plants.",
      "juz_number": 27
    },
    "13": {
      "text_tafsir_en": "God challenges humans and spirits; which of the favors they have tasted they have rejected. The denial of these favors is that they disbelieve in their God, for associating their gods with God. In worship is evidence of their disbelief in their god, for they are to be praised, while gratitude means worship that gives them favors. The verse is repeated in this chapter thirty-one times to emphasize the favor and to commemorate it. Therefore, as God mentions each of these gifts He separates them with words of remembering and reinforcing the existence of those favors. This type of word is widely available in Arabic, so it is common practice for a person to tell a friend who has received his or her favor, but he refuses it. \"Were you not poor, and I helped you in need? Did you disown it? Did you not dress, then I gave you clothes? Did you not know before? \" As if God swt said, \"Did I not create man, teach him how to speak, I made the sun and the moon to pass by the calculations? I made them into various kinds of wood. a city for those who believe and disbelieve in me; sometimes I water it with rain, sometimes with rivers and streams; are you people, and do you deny it? \"",
      "text_tafsir": "Allah menantang manusia dan jin; nikmat manakah dari nikmat-nikmat yang telah mereka rasakan itu yang mereka dustakan. Yang dimaksud dengan pendustaan nikmat-nikmat tersebut adalah kekafiran mereka terhadap Tuhan mereka, karena mempersekutukan tuhan-tuhan mereka dengan Allah. Dalam peribadatan adalah bukti tentang kekafiran mereka terhadap tuhan mereka, karena nikmat-nikmat itu harus disyukuri, sedangkan syukur artinya menyembah yang memberi nikmat-nikmat kepada mereka. Ayat tersebut diulang-ulang dalam surah ini tiga puluh satu kali banyaknya untuk memperkuat tentang adanya nikmat dan untuk memperingatkannya. Dari itu, sambil Allah menyebut satu persatu dari nikmat-nikmat tersebut Dia memisahkannya dengan kata-kata memperingati dan memperkuat tentang adanya nikmat-nikmat tersebut. Susunan kata serupa ini banyak terdapat dalam bahasa Arab, dari itu telah menjadi kebiasaan bahwa seorang mengatakan kepada temannya yang telah menerima kebaikannya, tetapi ia mengingkarinya. \"Bukankah engkau dahulu miskin, lalu aku menolongmu sehingga berkecukupan? Apakah engkau mengingkarinya? Bukankah engkau dahulu tidak berpakaian, maka aku memberi pakaian; apakah engkau mengingkarinya? Bukankah engkau dahulu tidak dikenal, maka aku mengangkat derajatmu, lalu engkau menjadi dikenal apakah engkau mengingkarinya?\" Seakan-akan Allah swt berkata, \"Bukankah Aku menciptakan manusia, mengajarnya pandai berbicara, Aku jadikan matahari dan bulan beredar menurut perhitungan. Aku jadikan bermacam-macam kayu-kayuan. Aku jadikan aneka ragam buah-buahan, baik di dusundusun maupun di bandar-bandar untuk mereka yang beriman dan kafir kepada-Ku, terkadang Aku menyiraminya dengan air hujan, adakalanya dengan air sungai dan alur-alur; apakah kamu hai manusia dan jin mengingkari yang demikian itu?\"",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan? ",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "14": {
      "text_tafsir_en": "This verse explains that Allah created the first human prophet Adam from dry earth like pottery, and hard like roasted land. In the Qur'an there are many verses that mention that man was created from earth and others say that he was created from clay and here is mentioned dry land like pottery. Clay baked with hot coals to keep it united, not divorced. Likewise humans have an appetite for food and drink, have an appetite for marriage so that their bodies can be maintained and can continue their lives, and have offspring. He has an angry appetite that makes him brave and strong to maintain his survival and defend himself from the dangers that threaten him and the invasion of enemies around him. Human strength is as if the same as ripe clay so that it becomes dry soil with its parts firmly attached. If there are no such things, of course he will not be able to defend himself from the danger and his enemies, from other humans or wild animals, then he will be shattered into pieces to eat the birds and animals, as uncooked soil scattered in the wind. Human creation from the land has been discussed in many previous verses, including in the verses: al-hijr \/ 15: 26 (from black mud), al-hijr \/ 15: 28 (dry clay), ar-Rum \/ 30: 20 (from the ground), Fathir \/ 35: 11 (from the ground), shad \/ 38: 71 (clay), Gafir \/ 40 (from the ground), whereas in Surah al-Furqan \/ 25: verse 54 it is stated that humans created from water. From the various statements of the verses above about the material of human creation, there are two ingredients namely water and soil. While the type of soil that is often described is clay, a type of soil composed of very fine particles, with a particle diameter less than 2 microns in size. This type of soil has physical properties that are plastic when they contain water. Chemically, a solution of clay in water has a cation exchange capacity, which can bind ions or other chemical compounds that are electrically charged, but with bonds that are not too strong so that ions that are bound can change easily. This type of soil is also commonly used as material for making pottery. While the process of creation is very little known (see Tafsir al-hijr \/ 15: 26 and 28).",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menciptakan manusia pertama Nabi Adam dari tanah kering seperti tembikar, dan keras seperti tanah yang telah dipanggang. Di dalam Al-Qur'an banyak ayat yang menyebutkan bahwa manusia diciptakan dari tanah dan yang lain menyebutkan bahwa ia diciptakan dari tanah liat serta di sini disebutkan tanah kering seperti tembikar. Tanah liat yang dipanggang dengan bara yang panas untuk menjaga ia tetap bersatu, tidak bercerai berai. Demikian pula manusia mempunyai nafsu makan dan minum, mempunyai nafsu kawin agar badannya dapat terpelihara dan dapat melanjutkan hidupnya, serta mempunyai keturunan. Ia mempunyai nafsu marah yang menjadikannya berani dan kuat untuk menjaga kelangsungan hidupnya dan mempertahankan dirinya dari bahaya yang mengancamnya serta serbuan musuh-musuh yang berada di sekitarnya. Kekuatan manusia ini seolah-olah sama dengan tanah liat yang telah masak agar menjadi tanah kering yang bagian-bagiannya melekat dengan kuat. Apabila tidak ada hal-hal itu tentu dia tidak akan dapat mempertahankan dirinya dari bahaya dan musuhmusuhnya, dari manusia lain atau binatang-binatang buas, maka ia akan hancur berkeping-keping menjadi santapan burung-burung dan binatang-binatang, sebagaimana tanah yang belum dimasak bertaburan diterbangkan angin. Penciptaan manusia dari tanah telah banyak dibicarakan pada ayat-ayat sebelumnya, antara lain pada ayat-ayat: al-hijr\/15: 26 (dari lumpur hitam), al- hijr\/15: 28 (tanah liat kering), ar-Rum\/30: 20 (dari tanah), Fathir\/35: 11 (dari tanah), shad\/38: 71 (tanah liat), Gafir\/40 (dari tanah), sedangkan pada Surah al-Furqan\/25: ayat 54 dinyatakan bahwa manusia diciptakan dari air. Dari berbagai pernyataan ayat-ayat di atas tentang bahan penciptaan manusia, maka terdapat dua bahan yaitu air dan tanah. Sedangkan macam tanah yang sering dijelaskan adalah tanah liat, suatu jenis tanah yang tersusun oleh partikel yang sangat halus, dengan ukuran diameter partikel kurang dari 2 mikron. Jenis tanah ini memiliki sifat-sifat fisik yang plastis bila mengandung air. Secara kimia, larutan tanah liat dalam air memiliki kapasitas tukar kation, yaitu dapat mengikat ion atau senyawa kimia lainnya yang bermuatan listrik, tetapi dengan ikatan yang tidak terlalu kuat sehingga ion yang terikat bisa berganti-ganti dengan mudah. Tanah jenis ini pulalah yang biasa dipakai sebagai bahan untuk membuat tembikar. Sementara proses penciptaannya amat sedikit diketahui (lihat Tafsir al-hijr\/15: 26 dan 28).",
      "text_translation": "Dia menciptakan manusia dari tanah kering seperti tembikar,",
      "text": "خَلَقَ الْاِنْسَانَ مِنْ صَلْصَالٍ كَالْفَخَّارِ ",
      "text_translation_en": "He has created man out of sounding clay, like pottery,",
      "juz_number": 27
    },
    "15": {
      "text_tafsir_en": "In this verse God explains that when the first man was made from the earth, then the first genie or the devil was different, he was made from fire (from the flame of fire), from the flame of fire joining with the other; from the yellow and green-green flames. Just as humans are made from a variety of soil. The verses remind us that Adam was created through the first process of soil, then the mud that was formed next to clay like clay.",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa bila manusia pertama dijadikan dari tanah, maka jin yang pertama atau iblis berbeda, ia dijadikan dari api (dari nyala api), dari nyala api yang bergabung dengan yang lain; dari nyala api yang berwarna kuningmerah dan kehijau-hijauan. Sebagaimana manusia dijadikan dari tanah yang bermacam-macam. Ayat-ayat tersebut mengingatkan bahwa Adam diciptakan melalui proses yang pertama dari tanah, kemudian lumpur yang dibentuk selanjutnya dari tanah kering seperti tembikar.",
      "text_translation": "dan Dia menciptakan jin dari nyala api tanpa asap.",
      "text": "وَخَلَقَ الْجَاۤنَّ مِنْ مَّارِجٍ مِّنْ نَّارٍۚ  ",
      "text_translation_en": "whereas the invisible beings He has created out of a confusing flame of fire.",
      "juz_number": 27
    },
    "16": {
      "text_tafsir_en": "This verse shows the abundant favor that God has given to His creatures both in the spirit and in the human, but why they deny it. In connection with this verse Ibn 'Umar said: The Messenger of Allah (may peace be upon him) recited Surah ar-Rahman or the surah was read to him, and he said, \"Why do I hear the jinn better answer to his Lord than you?\" They asked, \"What is it, O Messenger of Allah?\" He explained their answer when I read the word of Allah, \"Then which of the favors of your Lord will you deny?\" So they said, \"There is nothing of the favor of God that we deny.\" (History of Ibn Jarir from Ibn 'Umar)",
      "text_tafsir": "Ayat ini menunjukkan nikmat yang berlimpah-limpah yang diberikan Allah kepada makhluk-Nya baik itu dari kalangan jin maupun manusia, tetapi mengapa mereka mendustakan. Dalam hubungan ayat ini Ibnu 'Umar berkata: Rasulullah saw membaca Surah ar-Rahman atau surah itu dibacakan kepadanya, lalu beliau bersabda, \"Mengapa saya mendengar jin lebih baik jawabannya kepada Tuhannya dari kalian?\" Mereka bertanya, \"Apakah itu, wahai Rasulullah?\" Beliau menjelaskan tentang jawaban mereka (jin) apabila saya membaca firman Allah, \"Maka nikmat Tuhanmu yang manakah yang kamu dustakan?\" Maka mereka berkata, \"Tidak ada sesuatu pun dari nikmat Tuhan yang kami dustakan.\" (Riwayat Ibnu Jarir dari Ibnu 'Umar)",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "17": {
      "text_tafsir_en": "This verse describes the circulation of the sun and the moon, that it is He who created both and who controls the circuits according to the proper calculations. God preserves two places, two sunsets and summer and winter. Changes in the Index 687 changes occurred in the summer, winter, spring and fall and also caused changes in the air resulting in changes in rainfall, changes in trees and plants and rivers. \"Two East\" and \"Two West\" are mentioned in the above verse in relation to the earth's shape. Because, things like balls can only happen (two east and two west). In fact, the earth has two sunsets and two sunsets. Here, the verses of God and science are back in agreement. The explanation is this: \"When the sun rises at one point on the other side of the earth, the sun sets at the other end of the earth. When the sun sets on one side of the earth again, at the same time, at the other end of the earth, \"So, in fact, it's true that there are two points where the sun rises, and at the same time, there are two points where the sun goes down.\" This was reported by astronauts as they gazed at the earth from space. The Qur'an describes it in this way, as if the earth-like concept of the ball was known to man at that time. In fact it is not. The earth-like shape of the ball can also be seen in several other verses, such as the two verses below: Don't you notice that God brings night into the day and sets day to night and He subjugates the sun and the moon, each moving to time specified. Indeed, Allah can see what you do. (Luqman \/ 31: 29) He created the heavens and the earth with the right purpose; He enters night by day and enters by day and by night and subjugates the sun and the moon, each running according to the appointed time. Remember it! He is the Most Merciful, Most Forgiving. (az-Zumar \/ 39: 5) Today, we can see on the globe a picture of the earth having a ball-like shape. In fact, 1400 years ago, the Qur'an gave such an indication. The above two verses, using the parable, explain the shape of the earth. While people in Europe still believe that the earth is flat, students at universities in the Islamic world have learned the earth by using the globe. Since the Qur'an was not revealed as science, there is no specific statement that the shape of the earth is as round as a sphere. However, from a few verses, people are beginning to think that the shape of the earth is like a ball. For example in Surah Luqman \/ 31 verse 29. Another verse, Surah az-Zumar \/ 39 verse 5 shows how God \"rolls\" day and night. The word \"roll\" in the above verse is a translation of the Arabic word \"kawwara\", which is used to describe a person rolling a turban around his head. To get a better understanding of both of the above passages, do a home trial. All it needs is a globe and a flashlight. Take both devices to the dark room. Light a globe with a flashlight from either side. The light from this flashlight will act like sunlight. Then it will appear that some parts of the world will be light, and others will be dark. Then spin the globe slowly, just as the earth rotates around its axis. Note that as the globe spins, the sun will begin to illuminate the darker parts of the earth. So it is dark. It will gradually replace light in other parts of the earth. The following verses also speak of the shape of the earth: God (guardian) two east and God (guardian) two west. Then which of the favors of your Lord will you deny? (ar-Rahman \/ 55: 17-18) By the time humans believe that the earth is flat and stationary, the Qur'an has revealed, explicitly and implicitly, that the earth is round. Not only round, but more detailed, it's more egg-shaped than round. About the preservation of the sunrise and sunset. When people believe that the earth is flat and silent, the Qur'an reveals that the earth is round, through His word in the above verse. Because only things like this ball of events can happen, two east and two west? Sayyid Quthub thinks it may be the place where the sun and moon come from and the sun and moon. But it could mean two different sunrise spots in summer and winter. So are the two places. While Science argues that while the sun rises at one point in the hemisphere, at the same time the sun will be submerged from another hemisphere that lies farther east. Similarly, when the sun appears at a certain point in the hemisphere, at the same time from the other hemisphere to the west, the sun appears to be rising. This phenomenon is defined as (as if) two points where the sun rises and at the same time two points where the sun sets. Whatever the meaning of the message, is it important to be thankful that God's preservation of the two east and the two west is part of His favor in this universe? (",
      "text_tafsir": "Ayat ini menjelaskan tentang peredaran matahari dan bulan, Bahwa Dialah yang menciptakan keduanya dan yang mengatur peredaran menurut perhitungan yang tepat. Tuhan memelihara dua tempat terbit, dua tempat terbenam matahari dan musim panas dan musim dingin. Atas perubahan\n\nIndeks 687 \n\nperubahan itu timbullah musim panas, musim dingin, musim semi dan musim gugur dan menimbulkan pula perubahan udara yang mengakibatkan perubahan pada curah hujan, perubahan pada pohon-pohonan dan tumbuh-tumbuhan serta sungai-sungai. \"Dua Timur\" dan \"Dua Barat\" yang tersurat dalam ayat di atas berkaitan dengan bulatnya bentuk bumi. Karena, hanya pada benda yang berbentuk seperti bola dapat terjadi hal yang demikian (dua timur dan dua barat). Secara kenyataan, memang bumi mempunyai dua titik tempat terbitnya matahari dan dua titik tempat terbenamnya matahari. Di sini, ayat Allah dan ilmu pengetahuan kembali saling bersetuju. Penjelasannya demikian: \"Ketika matahari terbit di satu titik di bagian sebelah bumi, maka pada waktu yang sama matahari akan terbenam di bagian sebelah bumi lainnya. Saat matahari terbenam di sebelah bagian bumi, kembali, pada waktu yang sama, di belahan bumi yang lain, matahari sedang terbit. Dengan demikian, pada kenyataannya, memang betul bahwa ada dua titik dimana matahari terbit, dan pada waktu yang sama, terdapat dua titik dimana matahari terbenam.\" Keadaan demikian ini dilaporkan oleh para antariksawan pada saat mereka memandang bumi dari ruang angkasa. Al-Qur'an menguraikan hal ini sedemikian rupa, seolah-olah konsep bumi yang seperti bola memang sudah dikenal manusia saat itu. Sedangkan sebenarnya tidaklah demikian. Bentuk bumi yang seperti bola juga dapat dilihat pada beberapa ayat lainnya, seperti dua ayat di bawah ini: \n\nTidakkah engkau memperhatikan, bahwa Allah memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan Dia menundukkan matahari dan bulan, masing-masing beredar sampai kepada waktu yang ditentukan. Sungguh, Allah Mahateliti apa yang kamu kerjakan. (Luqman\/31: 29) Dia menciptakan langit dan bumi dengan (tujuan) yang benar; Dia memasukkan malam atas siang dan memasukkan siang atas malam dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan. Ingatlah! Dialah Yang Mahamulia, Maha Pengampun. (az-Zumar\/39: 5) \n\nSaat ini, kita dapat melihat pada bola dunia (globe) gambaran tentang bumi yang mempunyai bentuk seperti bola. Sebenarnya, pada 1400 tahun yang lalu, Al-Qur'an telah memberikan indikasi yang demikian. Dua ayat di atas, dengan menggunakan perumpamaan, telah menjelaskan tentang bentuk bumi. Pada saat masyarakat di Eropa masih mempercayai bahwa bumi itu datar, maka para pelajar di universitas di dunia Islam sudah mempelajari bumi dengan menggunakan bola dunia. Karena Al-Quran diturunkan bukan sebagai ilmu pengetahuan (science), maka di dalamnya tidak ada pernyataan secara khusus bahwa bentuk bumi adalah bulat seperti bola. Akan tetapi, dari beberapa ayat, manusia mulai berpikir bahwa bentuk bumi seperti bola. Contohnya pada Surah Luqman\/31 ayat 29. Ayat lainnya, Surah az-Zumar\/39 ayat 5 menunjukkan bagaimana Allah \"menggulung\" siang dengan malam. Kata \"menggulung\" pada ayat di atas adalah terjemahan dari kata Arab \"kawwara\", yang digunakan untuk menggambarkan seorang sedang menggulungkan sorban di sekeliling kepalanya. Untuk dapat mengerti lebih jelas mengenai kedua ayat di atas, lakukanlah suatu percobaan di rumah. Alat yang diperlukan adalah bola dunia dan lampu senter. Bawa kedua alat ini ke kamar yang gelap. Sinari bola dunia dengan lampu senter dari salah satu sisinya. Sinar dari lampu senter ini akan berperan seperti sinar matahari. Maka akan tampak bahwa sebagian belahan dunia akan terang, dan belahan lainnya gelap. Lalu putarkan bola dunia secara perlahan, sebagaimana halnya bumi melakukan putaran pada sumbunya. Perhatikan saat bola dunia berputar, maka sinar matahari akan secara menerus mulai menerangi bagian bumi yang semula gelap. Demikian pula halnya gelap. Ia akan secara perlahan menggantikan terang di bagian bumi yang lain. Ayat di bawah ini juga berbicara mengenai bentuk bumi: \n\nTuhan (yang memelihara) dua timur dan Tuhan (yang memelihara) dua barat. Maka nikmat Tuhanmu yang manakah yang kamu dustakan? (ar-Rahman\/55: 17-18) \n\nPada saat manusia mempercayai bahwa bumi datar dan menetap (tidak bergerak), Al-Qur'an sudah mengungkapkan, secara eksplisit maupun implisit, bahwa bumi itu bulat. Tidak hanya bulat, akan tetapi lebih rinci, yaitu bentuknya lebih seperti telur daripada bulat. Mengenai pemeliharaan tempat terbit dan tenggelamnya matahari. Ketika manusia memercayai bahwa bumi datar dan diam\/tidak bergerak, maka Al Qur'an mengungkapkan bahwa bumi itu bulat, melalui firman-Nya dalam ayat tersebut di atas. Karena hanya pada benda berbentuk seperti bola peristiwa tersebut dapat terjadi, dua timur dan dua barat ? Sayyid Quthub berpendapat mungkin itu tempat terbitnya matahari dan bulan serta tempat terbenamnya matahari dan bulan. Tapi bisa juga maksudnya dua tempat terbit matahari yang berbeda posisinya pada musim panas dan musim dingin. Demikian pula dua tempat terbenamnya. Sementara Ilmu Pengetahuan berpendapat bahwa manakala matahari terbit di satu titik di belahan bumi, maka pada saat yang sama justru matahari tersebut akan terbenam dilihat dari titik belahan lainnya yang letaknya jauh ke arah timur. Begitu pula tatkala matahari terlihat terbenam di suatu titik di belahan bumi, maka pada saat yang bersamaan dari belahan bumi yang letaknya jauh ke sebelah barat, matahari tersebut dilihat sedang terbit. Fenomena ini yang diartikan dengan (seolah) ada dua titik di mana matahari terbit dan pada waktu yang sama ada dua titik tempat matahari terbenam. Apapun makna dari pesan tersebut, sesuatu yang penting untuk disyukuri adalah pemeliharaan Allah atas dua timur dan dua barat merupakan bagian dari nikmat-Nya di alam semesta ini? (",
      "text_translation": "Tuhan (yang memelihara) dua timur dan Tuhan (yang memelihara) dua barat.",
      "text": "رَبُّ الْمَشْرِقَيْنِ وَرَبُّ الْمَغْرِبَيْنِۚ ",
      "text_translation_en": "[He is] the Sustainer of the two farthest points of sunrise, and the Sustainer of the two farthest points of sunset.",
      "juz_number": 27
    },
    "18": {
      "text_tafsir_en": "In this verse God challenges humans and spirits, which of the favors of God are they denying? Do they deny the rain and its benefits? Or do they disregard the benefits of seasonal changes in which there is a change of crops to be grown in summer or winter? Or do they deny the privileges inherent in the changing air that regulates human and animal feelings. (",
      "text_tafsir": "Dalam ayat ini Allah menantang manusia dan jin, nikmat Tuhan yang manakah yang mereka dustakan. Apakah mereka mengingkari hujan dan faedah-faedahnya? Ataukah mereka mengingkari manfaat adanya perubahan musim yang di dalamnya terdapat perubahan tanaman-tanaman yang harus ditanam pada musim panas atau musim dingin? Ataukah mereka mengingkari tentang keistimewaan yang terdapat pada perubahan udara yang mengatur perasaan manusia dan binatang. (",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustain­er’s powers can you disavow?",
      "juz_number": 27
    },
    "19": {
      "text_tafsir_en": "These verses explain that God drains salty water from adjacent fresh water which then converges into one, each does not affect the other, the salty does not affect the fresh so that the fresh becomes salty and the salty becomes fresh. Allah has bounded between the two with boundaries that were created by His power or bounded by land boundaries. The Word of God: And He is the one who allows the two seas to flow (side by side); this one is tasteless and fresh and the other is very salty and bitter; and He made between the two walls and the boundary that is not transparent. (al-Furqan \/ 25: 53) The events above can be seen as rivers flowing from the mountains that finally enter the sea and it feels salty while the river water remains fresh. According to scientific studies, the sea has physical and chemical properties that are not homogeneous. This inhomogeneity causes the sea to move dynamically. The process that triggers this movement is very complex and involves external forces such as wind, earth rotation, seabed topography and relationships with one another between the seas. The distribution of mass density depending on the level of salinity, temperature and air pressure also has an important role. Warm surface currents from the tropics flow across the equator to the North Atlantic Ocean and the Norwegian Sea, and then experience cooling. As a result of this cooling there is an increase in mass density and the ocean moves downward as the current flows downward and moves towards the South Atlantic Ocean, Indian Ocean and towards the Pacific Ocean. This undercurrent flow movement is known as a thermohalin circulation pattern whose motion is often identified with a conveyor belt that moves water, temperature and other properties and material in the ocean. What is described above is a global picture of the movement of ocean currents. In reality the movement of ocean currents is more complex. An example is what is described by Djamil (2004) which states that below the equator in the Pacific Ocean, Atlantic and Indian Ocean there are currents that move against their surface currents and are known as Pacific Equatorial Undercurrent or also known as Cromwell Current. This current moves east, which opposes the Pacific South Equatorial Current that moves west. Currents which have a thickness of 150 m and a length of 402 km, and the upper limit between 42-91 m, always moves below the equator. Sea water that moves in the flow of Cromwell currents that moves east opposes the flow of currents to the west and there is a boundary between the two. The boundary between these two seas is not only limited to the area mentioned above but is also found in the Strait of Gibraltar, as well as in the east of Japan. (",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa Allah mengalirkan air yang asin dari air yang tawar berdekatan yang kemudian berkumpul menjadi satu, masing-masing tidak mempengaruhi yang lain, yang asin tidak mempengaruhi yang tawar sehingga yang tawar menjadi asin dan yang asin menjadi tawar. Allah telah membatasi di antara keduanya dengan batas yang telah diciptakan dengan kekuasaan-Nya atau dibatasinya dengan batas yang berupa tanah. Firman Allah: \n\nDan Dialah yang membiarkan dua laut mengalir (berdampingan); yang ini tawar dan segar dan yang lain sangat asin lagi pahit; dan Dia jadikan antara keduanya dinding dan batas yang tidak tembus. (al-Furqan\/25: 53) \n\nPeristiwa di atas dapat dilihat seperti sungai-sungai yang mengalir dari gunung-gunung yang akhirnya masuk ke dalam laut dan rasanya menjadi asin sedang air sungainya tetap tawar. Menurut kajian ilmiah, laut mempunyai sifat fisika dan kimia yang tidak homogen. Ketidak homogenan ini yang menyebabkan laut bergerak dinamis. Proses yang memicu pergerakan ini sangat kompleks dan melibatkan tenaga dari luar seperti angin, rotasi bumi, topografi dasar laut maupun hubungan satu sama lain antar laut. Distribusi rapat massa yang tergantung pada tingkat kegaraman, temperatur dan tekanan udara juga mempunyai peranan penting. Aliran arus permukaan yang hangat dari kawasan tropis mengalir melintasi khatulistiwa menuju Lautan Atlantik Utara dan Laut Norwegia, untuk kemudian mengalami pendinginan. Akibat pendinginan ini terjadi peningkatan rapat massa dan laut bergerak ke bawah sebagai aliran arus bawah dan bergerak menuju Lautan Atlantik Selatan, Lautan Hindia dan menuju Lautan Pasifik. Gerakan aliran arus bawah ini dikenal sebagai pola sirkulasi thermohalin yang gerakannya sering diidentikan dengan conveyor belt yang menggerakan air, temperatur dan sifat-sifat lainnya dan materimateri di lautan. Apa yang digambarkan di atas adalah gambaran global mengenai pergerakan arus laut. Dalam kenyataannya pergerakan arus laut adalah lebih kompleks. Sebagai contoh adalah apa yang digambarkan oleh Djamil (2004) yang menyebutkan bahwa di bawah garis khatulistiwa di Lautan Pasifik, Atlantik dan Lautan Hindia terdapat arus yang bergerak melawan arus permukaannya dan dikenal sebagai Pacific Equatorial Undercurrent atau disebut juga sebagai Cromwell Current. Arus ini bergerak ke timur, yang menentang arus Pacific South Equatorial Current yang bergerak ke barat. Arus yang mempunyai ketebalan 150 m dan panjang 402 km, dan batas atasnya antara 42-91 m, selalu bergerak di bawah khatulistiwa. Air laut yang bergerak dalam aliran arus Cromwell ini yang bergerak ke timur menentang aliran arus ke barat dan antar keduanya terdapat batas. Batas antara dua lautan ini tidak hanya sebatas wilayah yang disebutkan di atas tetapi juga di temui di Selat Gibraltar, maupun di sebelah timur Jepang. (",
      "text_translation": "Dia membiarkan dua laut mengalir yang (kemudian) keduanya bertemu, ",
      "text": "مَرَجَ الْبَحْرَيْنِ يَلْتَقِيٰنِۙ",
      "text_translation_en": "He has given freedom to the two great bodies of water, so that they might meet:",
      "juz_number": 27
    },
    "20": {
      "text_tafsir_en": "These verses explain that God drains salty water from adjacent fresh water which then converges into one, each does not affect the other, the salty does not affect the fresh so that the fresh becomes salty and the salty becomes fresh. Allah has bounded between the two with boundaries that were created by His power or bounded by land boundaries. The Word of God: And He is the one who allows the two seas to flow (side by side); this one is tasteless and fresh and the other is very salty and bitter; and He made between the two walls and the boundary that is not transparent. (al-Furqan \/ 25: 53) The events above can be seen as rivers flowing from the mountains that finally enter the sea and it feels salty while the river water remains fresh. According to scientific studies, the sea has physical and chemical properties that are not homogeneous. This inhomogeneity causes the sea to move dynamically. The process that triggers this movement is very complex and involves external forces such as wind, earth rotation, seabed topography and relationships with one another between the seas. The distribution of mass density depending on the level of salinity, temperature and air pressure also has an important role. Warm surface currents from the tropics flow across the equator to the North Atlantic Ocean and the Norwegian Sea, and then experience cooling. As a result of this cooling there is an increase in mass density and the ocean moves downward as the current flows downward and moves towards the South Atlantic Ocean, Indian Ocean and towards the Pacific Ocean. This undercurrent flow movement is known as a thermohalin circulation pattern whose motion is often identified with a conveyor belt that moves water, temperature and other properties and material in the ocean. What is described above is a global picture of the movement of ocean currents. In reality the movement of ocean currents is more complex. An example is what is described by Djamil (2004) which states that below the equator in the Pacific Ocean, Atlantic and Indian Ocean there are currents that move against their surface currents and are known as Pacific Equatorial Undercurrent or also known as Cromwell Current. This current moves east, which opposes the Pacific South Equatorial Current that moves west. Currents which have a thickness of 150 m and a length of 402 km, and the upper limit between 42-91 m, always moves below the equator. Sea water that moves in the flow of Cromwell currents that moves east opposes the flow of currents to the west and there is a boundary between the two. The boundary between these two seas is not only limited to the area mentioned above but is also found in the Strait of Gibraltar, as well as in the east of Japan. (",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa Allah mengalirkan air yang asin dari air yang tawar berdekatan yang kemudian berkumpul menjadi satu, masing-masing tidak mempengaruhi yang lain, yang asin tidak mempengaruhi yang tawar sehingga yang tawar menjadi asin dan yang asin menjadi tawar. Allah telah membatasi di antara keduanya dengan batas yang telah diciptakan dengan kekuasaan-Nya atau dibatasinya dengan batas yang berupa tanah. Firman Allah: \n\nDan Dialah yang membiarkan dua laut mengalir (berdampingan); yang ini tawar dan segar dan yang lain sangat asin lagi pahit; dan Dia jadikan antara keduanya dinding dan batas yang tidak tembus. (al-Furqan\/25: 53) \n\nPeristiwa di atas dapat dilihat seperti sungai-sungai yang mengalir dari gunung-gunung yang akhirnya masuk ke dalam laut dan rasanya menjadi asin sedang air sungainya tetap tawar. Menurut kajian ilmiah, laut mempunyai sifat fisika dan kimia yang tidak homogen. Ketidak homogenan ini yang menyebabkan laut bergerak dinamis. Proses yang memicu pergerakan ini sangat kompleks dan melibatkan tenaga dari luar seperti angin, rotasi bumi, topografi dasar laut maupun hubungan satu sama lain antar laut. Distribusi rapat massa yang tergantung pada tingkat kegaraman, temperatur dan tekanan udara juga mempunyai peranan penting. Aliran arus permukaan yang hangat dari kawasan tropis mengalir melintasi khatulistiwa menuju Lautan Atlantik Utara dan Laut Norwegia, untuk kemudian mengalami pendinginan. Akibat pendinginan ini terjadi peningkatan rapat massa dan laut bergerak ke bawah sebagai aliran arus bawah dan bergerak menuju Lautan Atlantik Selatan, Lautan Hindia dan menuju Lautan Pasifik. Gerakan aliran arus bawah ini dikenal sebagai pola sirkulasi thermohalin yang gerakannya sering diidentikan dengan conveyor belt yang menggerakan air, temperatur dan sifat-sifat lainnya dan materimateri di lautan. Apa yang digambarkan di atas adalah gambaran global mengenai pergerakan arus laut. Dalam kenyataannya pergerakan arus laut adalah lebih kompleks. Sebagai contoh adalah apa yang digambarkan oleh Djamil (2004) yang menyebutkan bahwa di bawah garis khatulistiwa di Lautan Pasifik, Atlantik dan Lautan Hindia terdapat arus yang bergerak melawan arus permukaannya dan dikenal sebagai Pacific Equatorial Undercurrent atau disebut juga sebagai Cromwell Current. Arus ini bergerak ke timur, yang menentang arus Pacific South Equatorial Current yang bergerak ke barat. Arus yang mempunyai ketebalan 150 m dan panjang 402 km, dan batas atasnya antara 42-91 m, selalu bergerak di bawah khatulistiwa. Air laut yang bergerak dalam aliran arus Cromwell ini yang bergerak ke timur menentang aliran arus ke barat dan antar keduanya terdapat batas. Batas antara dua lautan ini tidak hanya sebatas wilayah yang disebutkan di atas tetapi juga di temui di Selat Gibraltar, maupun di sebelah timur Jepang. (",
      "text_translation": "di antara keduanya ada batas yang tidak dilampaui oleh masing-masing.",
      "text": "بَيْنَهُمَا بَرْزَخٌ لَّا يَبْغِيٰنِۚ",
      "text_translation_en": "[yet] between them is a barrier which they may not transgress.",
      "juz_number": 27
    },
    "21": {
      "text_tafsir_en": "In this verse Allah swt challenged the jinn and the people to bring forth a favor that did not come from Him. Try to imagine if salt water affected the fresh and salty, then there would be no water for humans and animals to drink, no water for watering the plants until the plants died, humans and animals would die of thirst and starving.",
      "text_tafsir": "Pada ayat ini Allah swt menantang jin dan manusia agar mengemukakan suatu nikmat yang tidak berasal daripada-Nya. Cobalah mereka bayangkan seandainya air yang asin mempengaruhi yang tawar sehingga menjadi asin pula, maka tentu tidak akan ada air yang dapat diminum manusia dan binatang, tidak ada air untuk menyirami tumbuh-tumbuhan sehingga tumbuh-tumbuhan itu mati, manusia dan binatang pun mati kehausan dan kelaparan.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "22": {
      "text_tafsir_en": "This verse explains that in the sea there are items that are very valuable, for example pearls and marjans from the salty and fresh sea. Both can be used as high-value and expensive jewelry.",
      "text_tafsir": "Ayat ini menerangkan bahwa di dalam laut itu terdapat barang-barang yang sangat berharga, misalnya mutiara dan marjan dari laut yang asin dan tawar. Keduanya dapat dijadikan sebagai perhiasan yang tinggi nilainya dan mahal harganya.",
      "text_translation": "Dari keduanya keluar mutiara dan marjan.",
      "text": "يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وَالْمَرْجَانُۚ",
      "text_translation_en": "Out of these two [bodies of water] come forth pearls, both great and small.",
      "juz_number": 27
    },
    "23": {
      "text_tafsir_en": "Allah swt challenges the jinn and man if there is a favor not of Him who is in the sea, of course the jinn and man will not deny it, especially the favor of pearls and margarine.",
      "text_tafsir": "Allah swt menantang jin dan manusia jika ada nikmat yang bukan berasal dari Dia yang berada di laut, tentu jin dan manusia tidak akan mendustakannya, terutama nikmat yang berupa mutiara dan marjan.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan? ",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "24": {
      "text_tafsir_en": "This verse explains that it is Allah who rules the high-altitude vessels as the mountains of the sea, he sails in the oceans and benefits mankind to transport merchandise from one country to another, abundant food. in one place and another there is a lack of such materials, and so on. Thus, the exchange of merchandise was fulfilled and the human needs of food and beverages were met.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah-lah yang menguasai bahtera-bahtera yang tinggi layarnya laksana gunung-gunung di lautan, ia berlayar di lautan dan memberikan manfaat kepada manusia guna mengangkut barang-barang dagangan dari suatu negeri ke negeri lain, makanan-makanan yang banyak terdapat pada suatu tempat dan tempat yang lain kekurangan bahan-bahan tersebut, dan lain sebagainya. Dengan demikian, terlaksana pertukaran barang-barang dagangan dan terpenuhi keperluankeperluan manusia tentang makanan dan minuman.",
      "text_translation": "Milik-Nyalah kapal-kapal yang berlayar di lautan bagaikan gunung-gunung.",
      "text": "وَلَهُ الْجَوَارِ الْمُنْشَاٰتُ فِى الْبَحْرِ كَالْاَعْلَامِۚ  ",
      "text_translation_en": "And His are the lofty ships that sail like [floating] mountains through the seas.",
      "juz_number": 27
    },
    "25": {
      "text_tafsir_en": "This verse challenges the jinn and the people to explain the favors they lie on as follows: Who invented the ark-making materials? Or how to make it? Do they think that faith in God is enough to simply be grateful for the gifts He has given them? What is the sun, moon and stars, trees, plants, and biofuels, rivers and oceans, pearls and marshes made for the senseless? Or does He make it possible for those who are grateful to Him for the gifts He has given? And how can they be grateful to Him if they do not know it?",
      "text_tafsir": "Ayat ini menantang jin dan mansuia agar menerangkan nikmat yang mereka dustakan sebagai berikut: Siapakah yang menciptakan bahan-bahan pembuatan bahtera itu? Atau bagaimanakah membuatnya? Apakah mereka kira bahwa iman kepada Allah sudah cukup dengan hanya bersyukur atas nikmatnikmat yang telah diberikan-Nya kepada mereka? Apakah matahari, bulan dan bintang, pohon-pohonan, tumbuh-tumbuhan, dan bijibijian, sungai-sungai dan lautan-lautan, mutiara dan marjan dijadikan-Nya untuk orang-orang yang tidak berakal? Atau dijadikanNya bagi orang-orang yang pandai bersyukur kepada-Nya atas nikmat-nikmat yang diberikan-Nya? Dan bagaimanakah mereka akan bersyukur kepada-Nya bila mereka tidak mengetahuinya?",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan? ",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ࣖ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "26": {
      "text_tafsir_en": "These verses explain that everything on earth and in heaven will perish and the only thing left is the Great and Glorious Divine Being. He is the one who lives forever and never dies. Therefore, do not be enticed by the pleasures of the world, for all will perish and perish, and men will be held responsible for all the good that they have received. Allah says: And do not worship any god other than Allah. There is no god (worthy of worship) besides Him. Everything must perish, except Allah. All decisions are His, and only to Him will you be restored. (al-Qasas \/ 28: 88)",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa semua yang ada di bumi dan di langit akan rusak binasa dan yang kekal hanyalah Zat Allah yang Mahabesar dan Mahamulia. Dialah yang tetap hidup selamanya dan tidak akan mati. Oleh karena itu manusia jangan terpesona dengan kenikmatankenikmatan yang ada di dunia, sebab semuanya akan punah dan lenyap, manusia akan dimintakan pertanggungjawaban atas segala nikmat yang telah diperolehnya. Firman Allah: \n\nDan jangan (pula) engkau sembah tuhan yang lain selain Allah. Tidak ada tuhan (yang berhak disembah) selain Dia. Segala sesuatu pasti binasa, kecuali Allah. Segala keputusan menjadi wewenangNya, dan hanya kepada-Nya kamu dikembalikan. (al-Qasas\/28: 88)",
      "text_translation": "Semua yang ada di bumi itu akan binasa, ",
      "text": "كُلُّ مَنْ عَلَيْهَا فَانٍۖ  ",
      "text_translation_en": "All that lives on earth or in the heavens is bound to pass away:",
      "juz_number": 27
    },
    "27": {
      "text_tafsir_en": "These verses explain that everything on earth and in heaven will perish and the only thing left is the Great and Glorious Divine Being. He is the one who lives forever and never dies. Therefore, do not be enticed by the pleasures of the world, for all will perish and perish, and men will be held responsible for all the good that they have received. Allah says: And do not worship any god other than Allah. There is no god (worthy of worship) besides Him. Everything must perish, except Allah. All decisions are His, and only to Him will you be restored. (al-Qasas \/ 28: 88)",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa semua yang ada di bumi dan di langit akan rusak binasa dan yang kekal hanyalah Zat Allah yang Mahabesar dan Mahamulia. Dialah yang tetap hidup selamanya dan tidak akan mati. Oleh karena itu manusia jangan terpesona dengan kenikmatankenikmatan yang ada di dunia, sebab semuanya akan punah dan lenyap, manusia akan dimintakan pertanggungjawaban atas segala nikmat yang telah diperolehnya. Firman Allah: \n\nDan jangan (pula) engkau sembah tuhan yang lain selain Allah. Tidak ada tuhan (yang berhak disembah) selain Dia. Segala sesuatu pasti binasa, kecuali Allah. Segala keputusan menjadi wewenangNya, dan hanya kepada-Nya kamu dikembalikan. (al-Qasas\/28: 88)",
      "text_translation": "tetapi wajah Tuhanmu yang memiliki kebesaran dan kemuliaan tetap kekal. ",
      "text": "وَّيَبْقٰى وَجْهُ رَبِّكَ ذُو الْجَلٰلِ وَالْاِكْرَامِۚ  ",
      "text_translation_en": "but forever will abide thy Sustainer’s Self, full of majesty and glory.",
      "juz_number": 27
    },
    "28": {
      "text_tafsir_en": "In this verse God challenges the spirits and men to reveal His favor which they deny. Let them imagine that it is not a ruin but a door to eternal life. If no one dies, then life in the hereafter will be hindered. Look at human life, if they continue to be born all the time, no one dies, then the earth will be filled with humans so that animals, plants, and food will never have enough and eventually there will be no way for them except to kill one another. eventually the world will be full of human carcasses.",
      "text_tafsir": "Dalam ayat ini Allah menantang jin dan manusia agar mengungkapkan nikmat-Nya yang mereka dustakan. Cobalah mereka bayangkan, tidaklah kebinasaan itu melainkan merupakan pintu bagi kehidupan yang kekal. Apabila tidak ada yang mati, maka akan terhalanglah kehidupan di akhirat. Lihatlah kehidupan manusia, apabila mereka beranak terus sepanjang masa, tidak ada yang mati, maka akan penuhlah bumi ini dengan manusia sehingga binatang, tumbuh-tumbuhan, dan makanan tidak akan mencukupi keperluannya lagi dan akhirnya tidak ada jalan lagi bagi mereka kecuali sedang membunuh sesamaanya yang akhirnya dunia ini akan penuh dengan bangkai-bangkai manusia.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "29": {
      "text_tafsir_en": "God constantly revives and extinguishes, sustains, honors and humiliates, hurts and cures, commands and prohibits, forgives and punishes, loves and scolds His creatures. And He gave everything that was in heaven and on earth, as revealed in this hadith: From 'Abdullah bin Munib, he said, \"Allah's Messenger (may peace be upon him) recited this verse to us, then we said, O Messenger of Allah, what is the meaning of 'affair? The Messenger of Allah said,' Forgive the sins, inflict hardship, lift one group up and humble others '(History of al-Bazzar, Ibn Jarir, ath-thabrani and Ibn' Asakir)",
      "text_tafsir": "Allah senantiasa menghidupkan dan mematikan, serta memberi rezeki, memuliakan dan menghinakan, memberi sakit dan menyembuhkan, menyuruh dan melarang, mengampuni dan menghukum, mengasihi dan memarahi terhadap makhluk-Nya. Dan Dia pula memberikan apa-apa yang diminta oleh semua yang ada di langit dan di bumi, seperti yang diungkapkan dalam hadis ini: Dari 'Abdullah bin Munib, ia berkata, \"Rasulullah membacakan kepada kami ayat ini, lalu kami berkata, Ya Rasulullah, apakah yang dimaksud dengan 'urusan? Rasulullah bersabda, 'Mengampuni dosa, melapangkan kesusahan, meninggikan satu golongan dan merendahkan golongan yang lain (Riwayat alBazzar, Ibnu Jarir, ath-thabrani dan Ibnu 'Asakir)",
      "text_translation": "Apa yang di langit dan di bumi selalu meminta kepada-Nya. Setiap waktu Dia dalam kesibukan. ",
      "text": "يَسْـَٔلُهٗ مَنْ فِى السَّمٰوٰتِ وَالْاَرْضِۗ  كُلَّ يَوْمٍ هُوَ فِيْ شَأْنٍۚ",
      "text_translation_en": "On Him depends all creatures in the heavens and on earth; [and] every day He manifests Himself in yet another [wondrous] way.",
      "juz_number": 27
    },
    "30": {
      "text_tafsir_en": "In this verse, God challenges the spirits and the people to reveal His favor which they deny. How many applications He has granted. How many new things He has created. And how many weak people He helped.",
      "text_tafsir": "Dalam ayat ini, Allah menantang jin dan manusia agar mengungkapkan nikmat-Nya yang mereka dustakan. Berapa banyak permohonan yang telah dikabulkan-Nya. Berapa banyak hal-hal yang baru diciptakan-Nya. Dan berapa banyak orang yang lemah ditolongNya.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "31": {
      "text_tafsir_en": "Allah explains that He will pay attention and repay all the deeds of all men and jinns, this verse is a very frightening threat, for all His servants to remember on the Day of Judgment.",
      "text_tafsir": "Allah menerangkan bahwa Dia akan memperhatikan dan membalas segala amal perbuatan sekalian manusia dan jin, ayat ini merupakan ancaman yang sangat menakutkan, bagi seluruh hambaNya agar ingat pada hari pembalasan.",
      "text_translation": "Kami akan memberi perhatian sepenuhnya kepadamu wahai (golongan) manusia dan jin! ",
      "text": "سَنَفْرُغُ لَكُمْ اَيُّهَ الثَّقَلٰنِۚ  ",
      "text_translation_en": "[ONE DAY] We shall take you to task, O you sin-laden two!",
      "juz_number": 27
    },
    "32": {
      "text_tafsir_en": "Allah swt challenged the spirits and the people, to reveal which favor they denied. Do they deny that the rewards they will receive on the Day of Judgment are either reward or torture on that day without lying.",
      "text_tafsir": "Allah swt menantang jin dan manusia, agar mengungkapkan nikmat yang manakah yang mereka dustakan. Adakah yang mereka dustakan itu balasan-balasan yang akan mereka terima pada hari Kiamat nanti baik berupa pahala maupun berupa siksaan pada hari itu tidak ada kedustaan.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "33": {
      "text_tafsir_en": "This verse calls for jinn and humans if they are able to penetrate, cross the corners of heaven and earth for fear of the punishment and punishment of Allah, they may try to do it, they will not be able to do so. They do not have the slightest strength in facing the power of Allah. According to some commentators, the understanding of sulthan in this verse is science. This shows that with human science can penetrate space.",
      "text_tafsir": "Ayat ini menyeru jin dan manusia jika mereka sanggup menembus, melintasi penjuru langit dan bumi karena takut akan siksaan dan hukuman Allah, mereka boleh mencoba melakukannya, mereka tidak akan dapat berbuat demikian. Mereka tidak mempunyai kekuatan sedikit pun dalam menghadapi kekuatan Allah swt. Menurut sebagian ahli tafsir, pengertian sulthan pada ayat ini adalah ilmu pengetahuan. Hal ini menunjukkan bahwa dengan ilmu manusia dapat menembus ruang angkasa.",
      "text_translation": "Wahai golongan jin dan manusia! Jika kamu sanggup menembus (melintasi) penjuru langit dan bumi, maka tembuslah. Kamu tidak akan mampu menembusnya kecuali dengan kekuatan (dari Allah). ",
      "text": "يٰمَعْشَرَ الْجِنِّ وَالْاِنْسِ اِنِ اسْتَطَعْتُمْ اَنْ تَنْفُذُوْا مِنْ اَقْطَارِ السَّمٰوٰتِ وَالْاَرْضِ فَانْفُذُوْاۗ  لَا تَنْفُذُوْنَ اِلَّا بِسُلْطٰنٍۚ ",
      "text_translation_en": "O you who live in close communion with [evil] invisible beings and humans! If you [think that you] can pass beyond the regions of the heavens and the earth, pass beyond them! [But] you cannot pass beyond them, save by a sanction [from God]!",
      "juz_number": 27
    },
    "34": {
      "text_tafsir_en": "In this verse God asks the spirits and the evil-doers then repent, and Allah accepts his repentance, is that not a favor? Before that God threatened those who did evil. So what is the favor of God that you deny?",
      "text_tafsir": "Dalam ayat ini Allah bertanya kepada jin dan manusia yang berbuat jahat kemudian bertobat, lalu diterima oleh Allah tobatnya, bukankah itu merupakan nikmat? Sebelum itu Allah mengancam orang-orang yang berbuat jahat. Karenanya nikmat Allah yang mana lagi yang kamu dustakan.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "35": {
      "text_tafsir_en": "This verse explains that the spirits and human beings will be exposed to various forms of torment, namely, flame retardant or liquid mixed with copper. They couldn't escape it.",
      "text_tafsir": "Ayat ini menerangkan bahwa kepada jin dan manusia akan ditimpakan bermacam-macam bentuk azab yaitu sambaran nyala api atau cairan yang bercampur dengan tembaga. Mereka tidak dapat melarikan diri daripadanya.",
      "text_translation": "Kepada kamu (jin dan manusia), akan dikirim nyala api dan cairan tembaga (panas) sehingga kamu tidak dapat menyelamatkan diri (darinya).",
      "text": "يُرْسَلُ عَلَيْكُمَا شُوَاظٌ مِّنْ نَّارٍۙ وَّنُحَاسٌ فَلَا تَنْتَصِرَانِۚ ",
      "text_translation_en": "A flash of fire will be let loose upon you, and smoke, and you will be left without succour!",
      "juz_number": 27
    },
    "36": {
      "text_tafsir_en": "Allah Almighty challenges the jinn and humans, whether they still deny God's favor. Among the favors about the threat of torture listed in paragraph 35 above has been preached in this world. If you in this world have the opportunity to do good and avoid the torment, that is pleasure.",
      "text_tafsir": "Allah swt menantang jin dan manusia, apakah mereka tetap mendustakan nikmat Tuhan. Di antara nikmat itu tentang ancaman siksa yang tercantum pada ayat 35 di atas telah diberitakan di dunia ini. Jika kamu di dunia ini berkesempatan berbuat baik dan terhindar dari siksa itu, itulah merupakan kenikmatan.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "37": {
      "text_tafsir_en": "This verse explains that when the Day of Judgment comes, the sky will split and the color will be reddish like oil. Then the rules of nature were broken and the stars and everything in the sky were scattered, moving out of their place because of the enormity of the day. In other verses Allah says: When the sky is split, and when the stars fall scattered. (Al-Infithar \/ 82: 1-2) When the sky is split, and obedient to his Lord, and it must be obedient. (al-Insyiqaq \/ 84: 1-2). And the sky was divided, because on that day the sky became fragile. (al-haqqah \/ 69: 16) The above verse talks about the universe. The universe is estimated to be between 15 and 18 billion years old. The oldest rocks ever found on earth are around 4.6 billion years old. The oldest life on earth was found to be 3.8 million years ago. Whereas humans began to inhabit the new earth about 100,000 years ago. Whatever results in the formation of the universe, for sure, it is very big and great, and could not have been created by chance. What is revealed by the Qur'an, it seems impossible to say by someone who lived 1400 years ago. The theory of the \"birth\" of this universe, can only be explained by someone who is very familiar with the science of \"nuclear physics\" (nuclear physics). A new scientific field developed in the last few decades. How could a Muhammad at that time be able to declare that the origin of the earth and all the contents of the sky were from the same \"smoke\" material. Very impossible. Verse 37 of Surah ar-Rahman above illustrates the explosion of a star. The description of the star's explosion was confirmed by modern science. Such explosions of stars cannot be seen with the naked eye. This natural phenomenon also cannot be captured using ordinary star binoculars. Required binoculars super sophisticated caliber \"Huble Space Super Telescope\" owned by NASA, a US space agency. But this has been described in the Koran very clearly 1400 years ago. With technological advances, it turns out that what is described in the Qur'an, is proven in detail. The explosion that occurred was very similar to a developing red rose. The explosion of a star or referred to as a supernova, is a giant star that \"self-destroys\" in a huge explosion. The core material will be scattered throughout. The light produced in this event is thousands of times brighter than normal conditions. Today's scientists assume that supernovas play an important role in the creation of the universe. This explosion causes different elements or matter to scatter and move to other parts of the universe. It is assumed that the material emitted by this explosion then joins to form new galaxies or stars in other parts of the universe. According to this hypothesis, our solar system, the sun and its planets, including the earth, are supernova products that happened long ago. Although a supernova looks like an ordinary explosion, in reality, the explosion is very structured in every detail. The distance between supernovae, and even between all stars, is very important for other reasons. The distance between stars in our galaxy is about 30 million light years. If this distance is closer, the orbits of the planets will be unstable. If it goes further, the dust from the supernova will be scattered so randomly that planetary systems like our solar system might never have formed. If the universe is home to life, then supernova winks must occur at very precise rates and the average distance between them must be very close to the observed distance now. The comparison between supernovae and the distance between stars is only two details that are very much in harmony with a universe full of wonders. Looking more closely at the universe, the arrangement will look so beautiful, both in its design and arrangement.",
      "text_tafsir": "Ayat ini menerangkan bahwa apabila datang hari Kiamat, terbelahlah langit dan warnanya menjadi merah mawar seperti kilapan minyak. Maka rusaklah peraturan-peraturan alam dan bertebaranlah bintang-bintang serta segala apa-apa yang ada di langit, pindah dari tempatnya karena dahsyatnya hari itu. Dalam ayat-ayat lain Allah berfirman: \n\nApabila langit terbelah, dan apabila bintang-bintang jatuh berserakan. (al-Infithar\/82: 1-2) \n\nApabila langit terbelah, dan patuh kepada Tuhannya, dan sudah semestinya patuh. (al-Insyiqaq\/84: 1-2). \n\nDan terbelahlah langit, karena pada hari itu langit menjadi rapuh. (al-haqqah\/69: 16) \n\nAyat di atas berbicara mengenai alam semesta. Alam semesta diperkirakan berumur antara 15 sampai 18 miliar tahun. Batuan tertua yang pernah ditemukan di bumi berumur sekitar 4,6 miliar tahun. Kehidupan tertua di bumi ditemukan berumur 3,8 juta tahun yang lalu. Sedangkan manusia mulai menghuni bumi baru sekitar 100.000 tahun yang lalu. Apapun yang mengakibatkan terbentuknya alam semesta, yang pasti, ia sangat besar dan hebat, dan tidak mungkin tercipta secara kebetulan. Apa yang diungkap oleh Al-Qur'an tersebut, nampaknya mustahil dikemukakan oleh seseorang yang hidup 1400 tahun yang lalu. Teori mengenai \"lahirnya\" alam semesta ini, hanya dapat dijelaskan oleh seseorang yang paham sekali dengan ilmu \"fisika nuklir\" (nuclear physics). Suatu bidang keilmuan yang baru berkembang dalam beberapa dekade terakhir. Bagaimana mungkin seorang Muhammad pada saat itu dapat menyatakan bahwa asal bumi dan seluruh isi langit dari materi \"asap\" yang sama. Sangat mustahil. Ayat 37 Surah ar-Rahman di atas menggambarkan ledakan sebuah bintang. Gambaran mengenai ledakan bintang tersebut dikonfirmasi oleh ilmu pengetahuan modern. Ledakan bintang yang demikian ini tidak dapat dilihat dengan mata telanjang. Fenomena alam ini juga tidak dapat ditangkap dengan menggunakan teropong bintang biasa. Diperlukan teropong bintang super canggih sekaliber \"Huble Space Super Telescope\" yang dimiliki oleh NASA, suatu lembaga antariksa Amerika Serikat. Namun hal ini sudah digambarkan dalam Al-Quran secara sangat jelas pada 1400 tahun yang lalu. Dengan kemajuan teknologi, ternyata apa yang diuraikan dalam Al-Qur'an, terbukti secara detail. Ledakan yang terjadi memang sangat mirip dengan bunga mawar merah yang sedang berkembang. Ledakan bintang atau disebut dengan istilah supernova, adalah sebuah bintang raksasa yang \"menghancurkan diri sendiri\" dalam ledakan dahsyat. Materi intinya akan bertebaran ke seluruh penjuru. Cahaya yang dihasilkan dalam peristiwa ini ribuan kali lebih terang daripada keadaan normal. Para ilmuwan masa kini menganggap bahwa supernova memainkan peran penting dalam penciptaan alam semesta. Ledakan ini menyebabkan unsur atau materi yang berbeda-benda berpencar dan berpindah ke bagian lain alam semesta. Diasumsikan bahwa materi yang dilontarkan ledakan ini kemudian bergabung untuk membentuk galaksi atau bintang baru di bagian lain alam semesta. Menurut hipotesis ini, tata surya kita, matahari dan planetnya termasuk bumi, merupakan produk supernova yang terjadi dahulu kala. Meskipun supernova tampak seperti ledakan biasa, pada kenyataannya, ledakan tersebut sangat terstruktur dalam setiap detailnya. Jarak antar supernova, dan bahkan antar semua bintang, sangat penting untuk alasan yang lain. Jarak antar bintang dalam galaksi kita adalah sekitar 30 juta tahun cahaya. Jika jarak ini lebih dekat, orbit planet-planet akan tidak stabil. Jika lebih jauh, maka debu hasil supernova akan tersebar begitu acak sehingga sistem planet seperti tata surya kita tidak mungkin pernah terbentuk. Jika alam semesta menjadi rumah bagi kehidupan, maka kedipan supernova harus terjadi pada laju yang sangat tepat dan jarak ratarata di antaranya harus sangat dekat dengan jarak yang teramati sekarang. Perbandingan antara supernova dan jarak antar bintang hanyalah dua rincian yang sangat selaras pada alam semesta yang penuh keajaiban. Mengamati lebih teliti alam semesta, maka pengaturannya akan terlihat begitu indah, baik dalam rancangan maupun susunannya.",
      "text_translation": "Maka apabila langit telah terbelah dan menjadi merah mawar seperti (kilauan) minyak. ",
      "text": "فَاِذَا انْشَقَّتِ السَّمَاۤءُ فَكَانَتْ وَرْدَةً كَالدِّهَانِۚ ",
      "text_translation_en": "And when the sky is rent asunder and becomes red like [burning] oil",
      "juz_number": 27
    },
    "38": {
      "text_tafsir_en": "This verse Allah challenges the spirits and the people whether they still deny His favor. God declares everything that can cause man to avoid evil, so that he is finally saved from the threat, which is the favor of God.",
      "text_tafsir": "Ayat ini Allah menantang jin dan manusia apakah mereka masih mendustakan nikmat-Nya. Allah mengabarkan segala sesuatu yang dapat mengakibatkan manusia menghindari segala kejahatan, sehingga akhirnya ia selamat dari ancaman, itulah nikmat Tuhan.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "39": {
      "text_tafsir_en": "This verse explains that at the time of the resurrection they were not questioned about sin, for sinners could be seen to be less guilty by certain characteristics, when they came out of their graves and were led to the Field of Supper. God's Word: This is the day when they cannot speak, and they are not allowed to excuse themselves. (alMursalat \/ 77: 35-36) Then they will be asked of their deeds by his word: \"By your Lord, We will surely ask them all what they did before.\" (al-hijr \/ 15: 92-9",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat hari kebangkitan mereka tidak ditanyai tentang dosa, sebab mereka yang berdosa dapat terlihat besar kecil dosanya oleh ciri tertentu, tatkala keluar dari kuburnya dan digiring ke Padang Mahsyar. Firman Allah: \n\nInilah hari, saat mereka tidak dapat berbicara, dan tidak diizinkan kepada mereka mengemukakan alasan agar mereka dimaafkan. (alMursalat\/77: 35- 36) \n\nKemudian mereka akan ditanyai tentang perbuatan-perbuatan mereka dengan firman-Nya: \n\nMaka demi Tuhanmu, Kami pasti akan menanyai mereka semua, tentang apa yang telah mereka kerjakan dahulu. (al-hijr\/15: 92-9",
      "text_translation": "Maka pada hari itu manusia dan jin tidak ditanya tentang dosanya. ",
      "text": "فَيَوْمَئِذٍ لَّا يُسْـَٔلُ عَنْ ذَنْۢبِهٖٓ اِنْسٌ وَّلَا جَاۤنٌّۚ  ",
      "text_translation_en": "For on that Day neither man nor invisible being will be asked about his sins.",
      "juz_number": 27
    },
    "40": {
      "text_tafsir_en": "This verse explains that at that time God asked you which of your favors you have denied, especially the favor that Allah has given you today. God also reminds us of the sad tidings and warnings He has given, that man should forsake and abstain from sin.",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya tentang nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Allah juga mengingatkan tentang kabar derita dan peringatan pedih yang telah disampaikanNya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ  ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "41": {
      "text_tafsir_en": "This verse explains that sinners can be identified by the signs that distinguish them from other people, namely: their faces are dark black, their eyes widen in fear. On the day of reckoning they will not hear the reasons and information they present. Their tonsils and legs are held in contempt, then dragged, put into hellfire.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang yang berdosa dapat dikenal dari tanda-tanda yang membedakan mereka dengan orang yang lain yaitu: wajahnya hitam pekat, matanya membelalak karena takut. Pada hari hisab tidak akan didengar alasan-alasan dan keterangan yang mereka kemukakan. Ubun-ubun dan kaki mereka dipegang sebagai penghinaan, lalu diseret, dimasukkan ke dalam api neraka Jahanam.",
      "text_translation": "Orang-orang yang berdosa itu diketahui dengan tanda-tandanya, lalu direnggut ubun-ubun dan kakinya.",
      "text": "يُعْرَفُ الْمُجْرِمُوْنَ بِسِيْمٰهُمْ فَيُؤْخَذُ بِالنَّوَاصِيْ وَالْاَقْدَامِۚ  ",
      "text_translation_en": "All who were lost in sin shall by their marks be known, and shall by their forelocks and their feet be seized!",
      "juz_number": 27
    },
    "42": {
      "text_tafsir_en": "This verse explains that at that time God was asking about which of your favors you had denied, especially the favor that Allah has given you today. God also reminds us of the sad tidings and warnings He has given, that man should forsake and abstain from sin.",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya mengenai nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Allah juga mengingatkan tentang kabar derita dan peringatan pedih yang telah disampaikanNya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "43": {
      "text_tafsir_en": "God has revealed His promises to those who have done evil that they have now seen and have seen with their own eyes the torment of the Lord they have been waiting for; so that they would taste the torment of Hellfire and drink boiling water, which would destroy the intestines and stomach contents of those who drank it. They circled between the fire and the boiling water very hot. In fact, when they asked for help from the fire, they were moved to a place where the water temperature was higher. As it is stated in the word of God as follows: When shackles and chains were put on their necks, they were dragged, into very hot water, and then they were burned with fire (Gafir \/ 40: 71-72)",
      "text_tafsir": "Allah membuktikan janji-janji-Nya kepada mereka yang berbuat jahat bahwa sekarang telah mereka saksikan dan telah mereka lihat dengan mata mereka sendiri azab Tuhan yang mereka tunggu-tunggu; supaya mereka merasakan siksaan api neraka Jahanam dan meminum air yang mendidih, yang dapat menghancurkan usus dan isi perut siapa yang meminumnya. Mereka berkeliling di antara api dan air mendidih yang sangat panas. Tegasnya, apabila mereka minta tolong supaya dikeluarkan dari api neraka, maka mereka dipindahkan ke suatu tempat minuman air yang lebih tinggi suhu panasnya. Seperti diungkapkan dalam firman Allah sebagai berikut: \n\nKetika belenggu dan rantai dipasang di leher mereka, seraya mereka diseret, ke dalam air yang sangat panas, kemudian mereka dibakar dalam api (Gafir\/40: 71-72)",
      "text_translation": "Inilah neraka Jahanam yang didustakan oleh orang-orang yang berdosa.",
      "text": "هٰذِهٖ جَهَنَّمُ الَّتِيْ يُكَذِّبُ بِهَا الْمُجْرِمُوْنَۘ ",
      "text_translation_en": "This will be the hell which those who are lost in sin [now] call a lie:",
      "juz_number": 27
    },
    "44": {
      "text_tafsir_en": "God has revealed His promises to those who have done evil that they have now seen and have seen with their own eyes the torment of the Lord they have been waiting for; so that they would taste the torment of Hellfire and drink boiling water, which would destroy the intestines and stomach contents of those who drank it. They circled between the fire and the boiling water very hot. In fact, when they asked for help from the fire, they were moved to a place where the water temperature was higher. As it is stated in the word of God as follows: When shackles and chains were put on their necks, they were dragged, into very hot water, and then they were burned with fire (Gafir \/ 40: 71-72)",
      "text_tafsir": "Allah membuktikan janji-janji-Nya kepada mereka yang berbuat jahat bahwa sekarang telah mereka saksikan dan telah mereka lihat dengan mata mereka sendiri azab Tuhan yang mereka tunggu-tunggu; supaya mereka merasakan siksaan api neraka Jahanam dan meminum air yang mendidih, yang dapat menghancurkan usus dan isi perut siapa yang meminumnya. Mereka berkeliling di antara api dan air mendidih yang sangat panas. Tegasnya, apabila mereka minta tolong supaya dikeluarkan dari api neraka, maka mereka dipindahkan ke suatu tempat minuman air yang lebih tinggi suhu panasnya. Seperti diungkapkan dalam firman Allah sebagai berikut: \n\nKetika belenggu dan rantai dipasang di leher mereka, seraya mereka diseret, ke dalam air yang sangat panas, kemudian mereka dibakar dalam api (Gafir\/40: 71-72)",
      "text_translation": "Mereka berkeliling di sana dan di antara air yang mendidih. ",
      "text": "يَطُوْفُوْنَ بَيْنَهَا وَبَيْنَ حَمِيْمٍ اٰنٍۚ  ",
      "text_translation_en": "between it and [their own] burning-hot despair will they wander to and fro!",
      "juz_number": 27
    },
    "45": {
      "text_tafsir_en": "This verse explains that at that time God was asking about which of your favors you had denied, especially the favor that Allah has given you today. God also reminds us of the sad tidings and warnings He has given, that man should forsake and abstain from sin.",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya mengenai nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Allah juga mengingatkan tentang kabar derita dan peringatan pedih yang telah disampaikanNya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ࣖ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "46": {
      "text_tafsir_en": "This verse explains that God provides two paradises for those who fear their Lord and are confident that they will receive their reward. When he moves his heart to do evil, he remembers the God who knows everything that is visible and hidden. So he left the act, afraid of the punishment and punishment he would receive. They do good and invite people to do good. The two heavens are: 1. The spiritual heaven in which they receive God's will. God's Word: And the will of God is greater. That's a great victory. (at-Taubah \/ 9: 72) 2. The physical paradise they earn in accordance with the righteous deeds they do in the world.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menyediakan dua surga bagi orang yang takut akan Tuhannya dan berkeyakinan bahwa mereka akan mendapat balasan atas perbuatannya. Bila tergerak hatinya akan berbuat maksiat, maka ia ingat akan Tuhan yang mengetahui segala sesuatu baik yang kelihatan maupun yang tersembunyi. Karena itu ia meninggalkan perbuatan itu, takut akan azab dan hukuman yang akan diterimanya. Mereka berbuat baik dan mengajak manusia berbuat baik pula. Dua surga itu ialah: 1. Surga rohani di mana mereka mendapat keridaan Allah. Firman Allah: \n\nDan keridaan Allah lebih besar. Itulah kemenangan yang agung. (at-Taubah\/9: 72) 2. Surga jasmani yang mereka peroleh sesuai dengan amal saleh yang mereka perbuat di dunia.",
      "text_translation": "Dan bagi siapa yang takut akan saat menghadap Tuhannya ada dua surga.",
      "text": "وَلِمَنْ خَافَ مَقَامَ رَبِّهٖ جَنَّتٰنِۚ",
      "text_translation_en": "BUT FOR THOSE who of their Sustainer’s Presence stand in fear, two gardens [of paradise are readied] -",
      "juz_number": 27
    },
    "47": {
      "text_tafsir_en": "This verse explains that God provides two paradises for those who fear their Lord and are confident that they will receive their reward. When he moves his heart to do evil, he remembers the God who knows everything that is visible and hidden. So he left the act, afraid of the punishment and punishment he would receive. They do good and invite people to do good. The two heavens are: 1. The spiritual heaven in which they receive God's will. God's Word: And the will of God is greater. That's a great victory. (at-Taubah \/ 9: 72) 2. The physical paradise they earn in accordance with the righteous deeds they do in the world.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menyediakan dua surga bagi orang yang takut akan Tuhannya dan berkeyakinan bahwa mereka akan mendapat balasan atas perbuatannya. Bila tergerak hatinya akan berbuat maksiat, maka ia ingat akan Tuhan yang mengetahui segala sesuatu baik yang kelihatan maupun yang tersembunyi. Karena itu ia meninggalkan perbuatan itu, takut akan azab dan hukuman yang akan diterimanya. Mereka berbuat baik dan mengajak manusia berbuat baik pula. Dua surga itu ialah: 1. Surga rohani di mana mereka mendapat keridaan Allah. Firman Allah: \n\nDan keridaan Allah lebih besar. Itulah kemenangan yang agung. (at-Taubah\/9: 72) 2. Surga jasmani yang mereka peroleh sesuai dengan amal saleh yang mereka perbuat di dunia.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۙ ",
      "text_translation_en": "which, then, of your Sustainer’s powers can you disavow? –",
      "juz_number": 27
    },
    "48": {
      "text_tafsir_en": "This verse explains that the two heavens have shady trees and fruit with a variety of features, which makes them more eager, more appetite to eat it. Then Allah said, \"Are you, O man and genie, covet",
      "text_tafsir": "Ayat ini menerangkan bahwa kedua surga itu mempunyai pohon-pohon yang rindang dan buah-buahan yang beraneka ragam coraknya, yang membuat mereka tambah bernafsu, tambah berselera untuk memakannya. Kemudian Allah berkata, \"Apakah kamu, hai manusia dan jin, mengingi",
      "text_translation": "kedua surga itu mempunyai aneka pepohonan dan buah-buahan.",
      "text": "ذَوَاتَآ اَفْنَانٍۚ ",
      "text_translation_en": "[two gardens] of many wondrous hues.",
      "juz_number": 27
    },
    "49": {
      "text_tafsir_en": "This verse explains that at that time God was asking about which of your favors you had denied, especially the favor that Allah has given you today. The sad news and warning He has given is that man should abandon and avoid sin. Then which of the favors of your Lord will you deny, mankind and jinn? Each one is rewarded as God has explained. Isn't that a great favor and for you all? (",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya mengenai nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Kabar derita dan peringatan pedih yang telah disampaikan-Nya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa. Maka nikmat Tuhan kamu yang manakah yang kamu dustakan, hai manusia dan jin? Masing-masing mendapat ganjaran sebagaimana yang diterangkan Allah. Bukankah itu nikmat yang besar dan bagi kamu sekalian. (",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "50": {
      "text_tafsir_en": "This verse explains that in the two heavens there are two springs of water flowing, watering trees of various kinds. The water is flowed wherever they want. One of the springs is named at-tasnim and one of the names is as-salsabil, as Allah says: And the mixture is from tasnim, (ie) springs that are drunk by those close to Allah. (al-Muttaffifin \/ 83: 27-28) And His words: And there they were given a glass of drink mixed with ginger. (Imported from) a spring (in heaven) called Salsabil. (al-Insan \/ 76: 17-18)",
      "text_tafsir": "Ayat ini menerangkan bahwa di kedua surga itu ada dua mata air mengalir, menyirami pohon-pohon yang bermacam-macam jenisnya. Air itu dialirkan ke mana saja mereka kehendaki. Salah satu dari mata air itu bernama at-tasnim dan satu lagi nama as-salsabil, sebagaimana firman Allah: \n\nDan campurannya dari tasnim, (yaitu) mata air yang diminum oleh mereka yang dekat dengan Allah. (al-Muthaffifin\/83: 27-28) \n\nDan firman-Nya: Dan di sana mereka diberi segelas minuman bercampur jahe. (Yang didatangkan dari) sebuah mata air (di surga) yang dinamakan Salsabil. (al-Insan\/76: 17-18)",
      "text_translation": "Di dalam kedua surga itu ada dua buah mata air yang memancar.",
      "text": "فِيْهِمَا عَيْنٰنِ تَجْرِيٰنِۚ ",
      "text_translation_en": "In [each of] these two [gardens] two springs will flow.",
      "juz_number": 27
    },
    "51": {
      "text_tafsir_en": "This verse explains that at that time God was asking about which of your favors you had denied, especially the favor that Allah has given you today. The sad news and warning He has given is that man should abandon and avoid sin. Then which of the favors of your Lord will you deny, mankind and jinn? Each one is rewarded as God has explained. Isn't that a great favor and for you all? So which of the favors of God do you deny to both jinn and man? Because it is an indisputable fact and a great blessing.",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya mengenai nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Kabar derita dan peringatan pedih yang telah disampaikan-Nya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa. Maka nikmat Tuhan kamu yang manakah yang kamu dustakan, hai manusia dan jin? Masing-masing mendapat ganjaran sebagaimana yang diterangkan Allah. Bukankah itu nikmat yang besar dan bagi kamu sekalian. Oleh karena itu nikmat Tuhan mana lagi yang kamu dustakan hai jin dan manusia? Karena itu merupakan kenyataan yang tak dapat dipungkiri dan merupakan nikmat yang sungguh besar.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "52": {
      "text_tafsir_en": "This verse explains that in the two heavens there are various kinds of wet and dry fruits, both are equally delicious, different from the fruits in the world.",
      "text_tafsir": "Ayat ini menerangkan bahwa pada kedua surga itu terdapat bermacam-macam buah-buahan basah dan kering, kedua-duanya sama lezatnya, berlainan dengan buah-buahan di dunia.",
      "text_translation": "Di dalam kedua surga itu terdapat aneka buah-buahan yang berpasang-pasangan. ",
      "text": "فِيْهِمَا مِنْ كُلِّ فَاكِهَةٍ زَوْجٰنِۚ ",
      "text_translation_en": "In [each of] these two will two kinds of every fruit be [found].",
      "juz_number": 27
    },
    "53": {
      "text_tafsir_en": "This verse explains that at that time God asked which of your favors were you, especially the favors that Allah has given you today. The sad news and warning He has given is that man should abandon and avoid sin. Then which of the favors of your Lord will you deny, mankind and jinn? Each one is rewarded as God has explained. Isn't that a great favor for you all?",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Kabar derita dan peringatan pedih yang telah disampaikan-Nya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa. Maka nikmat Tuhan kamu yang manakah yang kamu dustakan, hai manusia dan jin? Masing-masing mendapat ganjaran sebagaimana yang diterangkan Allah. Bukankah itu nikmat yang besar bagi kamu sekalian.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۚ ",
      "text_translation_en": "Which, then, of your Sustainer s powers can you disavow?",
      "juz_number": 27
    },
    "54": {
      "text_tafsir_en": "This verse describes the rug or the mattress. They sit comfortably on a mattress in thick silk. If the situation inside is beautiful, then imagine how the outside is. The Word of God: So no one knows what is hidden for them, which is a pleasure, in return for what they do. (as-Sajdah \/ 32: 17) Ibn 'Abbas says that This shows how good the rugs are and the immense pleasure they receive from the rewards given to them. The fruits of both heaven are near to them when they wish to quote them as the other verses say: The fruits are close by. (al-haqqah \/ 69: 23) And his word: And his shade (tree) is near them and made it as easy as possible to pluck it. (al-Insan \/ 76: 14) The fruit will not shrink, but will be humble enough to be picked easily.",
      "text_tafsir": "Ayat ini menerangkan tentang permadani atau kasur-kasur. Mereka duduk santai tidur di atas kasur yang sebelah dalamnya dari sutra yang tebal. Apabila keadaan sebelah dalamnya demikian indahnya, maka bayangkanlah bagaimana keadaan sebelah luarnya. Firman Allah: \n\nMaka tidak seorang pun mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam nikmat) yang menyenangkan hati sebagai balasan terhadap apa yang mereka kerjakan. (as-Sajdah\/32: 17) Ibnu 'Abbas mengatakan bahwa Ini menunjukkan bagaimana bagusnya permadani-permadani dan besarnya kesenangan yang abadi yang mereka terima dari pahala-pahala yang diberikan kepada mereka. Buah-buahan dari kedua surga itu dekat kepada mereka bila mereka ingin memetiknya sebagaimana yang diutarakan oleh ayat-ayat lain yang sama-sama maksudnya: \n\nBuah-buahannya dekat. (al-haqqah\/69: 23) \n\nDan firman-Nya: \n\nDan naungan (pepohonan)nya dekat di atas mereka dan dimudahkan semudah-mudahnya untuk memetik (buah)nya. (al-Insan\/76: 14) \n\nBuah-buahannya tidak akan menghindar, bahkan akan merendah agar mudah dipetik.",
      "text_translation": "Mereka bersandar di atas permadani yang bagian dalamnya dari sutera tebal. Dan buah-buahan di kedua surga itu dapat (dipetik) dari dekat. ",
      "text": "مُتَّكِـِٕيْنَ عَلٰى فُرُشٍۢ بَطَاۤىِٕنُهَا مِنْ اِسْتَبْرَقٍۗ وَجَنَا الْجَنَّتَيْنِ دَانٍۚ ",
      "text_translation_en": "[In such a paradise the blest will dwell,] reclin­ing upon carpets lined with rich brocade; and the fruit of both these gardens will be within easy reach.",
      "juz_number": 27
    },
    "55": {
      "text_tafsir_en": "This verse explains that at that time God asked which of your favors were you, especially the favors that Allah has given you today. The sad news and warning He has given is that man should abandon and avoid sin. Then which of the favors of your Lord will you deny, mankind and jinn? Each one is rewarded as God has explained. Isn't that a great favor for you all?",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Kabar derita dan peringatan pedih yang telah disampaikan-Nya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa. Maka nikmat Tuhan kamu yang manakah yang kamu dustakan, hai manusia dan jin? Masing-masing mendapat ganjaran sebagaimana yang diterangkan Allah. Bukankah itu nikmat yang besar bagi kamu sekalian.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "56": {
      "text_tafsir_en": "In this verse it is explained that in heaven there are polite angels who subvert her gaze, not looking to anyone but her husband; no human will be better than them. They were still girls, virgins who had never been touched by men or spirits, before the inhabitants of heaven entered into their husbands. Then which of the favors of your Lord will you deny? (",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa di dalam surga ada bidadari-bidadari sopan yang menundukkan pandangannya, tidak mau memandang orang lain selain suaminya; tak akan ada manusia lebih baik dari mereka. Mereka masih gadis, perawan yang tidak pernah disentuh oleh manusia atau pun jin, sebelum penghunipenghuni surga yang masuk ke dalamnya menjadi suami mereka. Kalau demikian, maka nikmat Tuhan kamu yang manakah yang kamu dustakan? (",
      "text_translation": "Di dalam surga itu ada bidadari-bidadari yang membatasi pandangan, yang tidak pernah disentuh oleh manusia maupun jin sebelumnya. ",
      "text": "فِيْهِنَّ قٰصِرٰتُ الطَّرْفِۙ لَمْ يَطْمِثْهُنَّ اِنْسٌ قَبْلَهُمْ وَلَا جَاۤنٌّۚ  ",
      "text_translation_en": "In these [gardens] will be mates of modest gaze, whom neither man nor invisible being will have touched ere then.",
      "juz_number": 27
    },
    "57": {
      "text_tafsir_en": "This verse explains that at that time God was asking about which of your favors you had denied, especially the favor that Allah has given you today. The sad news and warning He has given is that man should abandon and avoid sin. Then which of the favors of your Lord will you deny, mankind and jinn? Each one is rewarded as God has explained. Isn't that a great favor for you all?",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya mengenai nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Kabar derita dan peringatan pedih yang telah disampaikan-Nya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa. Maka nikmat Tuhan kamu yang manakah yang kamu dustakan, hai manusia dan jin? Masing-masing mendapat ganjaran sebagaimana yang diterangkan Allah. Bukankah itu nikmat yang besar bagi kamu sekalian.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۚ ",
      "text_translation_en": "Which, then, of your Sus­tainer’s powers can you disavow?",
      "juz_number": 27
    },
    "58": {
      "text_tafsir_en": "This verse explains that the angel was clear as a yakut and white jewel as a pearl and marjan. This is an Arabic expression that means to say that an angel is very beautiful and handsome.",
      "text_tafsir": "Ayat ini menerangkan bahwa bidadari itu bening sebagai permata yakut dan putih sebagai mutiara dan marjan. Ini adalah ungkapan dalam bahasa Arab yang maksudnya menyatakan bahwa bidadari itu sangat cantik dan rupawan.",
      "text_translation": "Seakan-akan mereka itu permata yakut dan marjan. ",
      "text": "كَاَنَّهُنَّ الْيَاقُوْتُ وَالْمَرْجَانُۚ ",
      "text_translation_en": "[When you are promised splendours] as though [of] rubies and [of] pearls –",
      "juz_number": 27
    },
    "59": {
      "text_tafsir_en": "This verse explains that at that time God asked which of your favors were you, especially the favors that Allah has given you today. The sad news and warning He has given is that man should abandon and avoid sin. Then which of the favors of God will you deny, mankind and jinn? Each one is rewarded as God has explained. Isn't that a great favor for you all?",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Kabar derita dan peringatan pedih yang telah disampaikan-Nya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa. Maka nikmat Tuhan manakah yang kamu dustakan, hai manusia dan jin? Masing-masing mendapat ganjaran sebagaimana yang diterangkan Allah. Bukankah itu nikmat yang besar bagi kamu sekalian.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ",
      "text_translation_en": "which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "60": {
      "text_tafsir_en": "In this verse Allah declares that there is no reward for good deeds except for good. In another verse the same meaning is that Allah says: For those who do good, there is a reward (best) and in addition (the pleasure of looking at God). And their faces are not covered with black dust and not (yet) in disgrace. They are the inhabitants of heaven, a brand remains in them. (Yunus \/ 10:26) In connection with this verse 60 Ibn Abi hatim of Anas bin Malik that the Prophet read the verse (meaning), \"There is no reward for good but good,\" then he asked, \"What do you know from the word of God?\" ? \" They answered, \"Allah and His Messenger know best.\" The Prophet replied, \"Allah said, 'There is no reward for those who give me favor but by denying (Me) except heaven.\" (History of Ibn Abi atim, Ibn Mardawaih, and al-Baihaqi)",
      "text_tafsir": "Dalam ayat ini Allah mengungkapkan bahwa tidak ada ganjaran bagi perbuatan yang baik kecuali kebaikan pula. Dalam ayat lain yang sama maksudnya Allah berfirman: \n\nBagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya (kenikmatan melihat Allah). Dan wajah mereka tidak ditutupi debu hitam dan tidak (pula) dalam kehinaan. Mereka itulah penghuni surga, merek a kekal di dalamnya. (Yunus\/10: 26) \n\nSehubungan dengan ayat 60 ini Ibnu Abi hatim\n\nDari Anas bin Malik bahwa Rasulullah membaca ayat (yang artinya), \"Tidak ada balasan kebaikan selain kebaikan,\" kemudian beliau bertanya, \"Apakah yang kalian ketahui dari firman Tuhan tersebut?\" Mereka menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Nabi menjawab, \"Allah berfirman, 'Tidak ada balasan kebaikan bagi mereka yang Kuberi nikmat dengan mengesakan (Aku) kecuali surga.\" (Riwayat Ibnu Abi hatim, Ibnu Mardawaih, dan al-Baihaqi)",
      "text_translation": "Tidak ada balasan untuk kebaikan selain kebaikan (pula).",
      "text": "هَلْ جَزَاۤءُ الْاِحْسَانِ اِلَّا الْاِحْسَانُۚ ",
      "text_translation_en": "Could the reward of good be aught but good?",
      "juz_number": 27
    },
    "61": {
      "text_tafsir_en": "This verse explains that at that time God asked you which of your favors you have denied, especially the favor that Allah has given you today. God also reminds us of the sad tidings and warnings He has given, that man should forsake and abstain from sin. Then which of the favors of your Lord will you deny, mankind and jinn? Each one is rewarded as God has explained. Isn't that a great favor for you all?",
      "text_tafsir": "Ayat ini menerangkan bahwa pada saat itu Allah bertanya tentang nikmat mana lagi yang kamu dustakan, terutama nikmat yang telah Allah berikan pada hari ini. Allah juga mengingatkan tentang kabar derita dan peringatan pedih yang telah disampaikanNya, yaitu agar manusia meninggalkan dan menjauhi perbuatan dosa. Maka nikmat Tuhan kamu yang manakah yang kamu dustakan, hai manusia dan jin? Masing-masing mendapat ganjaran sebagaimana yang diterangkan Allah. Bukankah itu nikmat yang besar bagi kamu sekalian.",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "62": {
      "text_tafsir_en": "In this verse God explains that in addition to the two previous heavens there are two more heavens provided for the believers of the Ashsabul-yamin. The first two paradises were for the first group of believers and the other two were for the Ashbel-yamin group of later believers. This is in accordance with the word of the Messenger of Allah in his hadith: Two heavens of gold for Muqarrabin and two more of silver for Ashabul-yamin. \" refuted by the genie and the human?",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa selain dua surga yang tersebut terdahulu ada lagi dua surga yang disediakan untuk orang-orang mukmin dari golongan Ashsabul-yamin. Yaitu dua surga yang terdahulu diperuntukkan bagi golongan orang-orang yang terdahulu beriman dan dua surga yang lain diperuntukkan bagi golongan Ashabul-yamin dari orang yang beriman kemudian. Hal ini sesuai dengan sabda Rasulullah dalam hadisnya: Dua surga dari emas untuk Muqarrabin dan dua buah lagi surga dari perak untuk Ashabul-yamin.\" (Riwayat Ibnu Jarir, Ibnu Abi hatim, Ibnu Mardawaih dari Abu Musa) \n\nMaka nikmat Tuhan yang manakah yang masih didustakan oleh jin dan manusia?",
      "text_translation": "Dan selain dari dua surga itu ada dua surga lagi.",
      "text": "وَمِنْ دُوْنِهِمَا جَنَّتٰنِۚ ",
      "text_translation_en": "And besides those two will be yet two [other] gardens -",
      "juz_number": 27
    },
    "63": {
      "text_tafsir_en": "In this verse God explains that in addition to the two previous heavens there are two more heavens provided for the believers of the Ashsabul-yamin. The first two paradises were for the first group of believers and the other two were for the Ashbel-yamin group of later believers. This is in accordance with the word of the Messenger of Allah in his hadith: Two heavens of gold for Muqarrabin and two more of silver for Ashabul-yamin. \" refuted by the genie and the human?",
      "text_tafsir": "Dalam ayat ini Allah menerangkan bahwa selain dua surga yang tersebut terdahulu ada lagi dua surga yang disediakan untuk orang-orang mukmin dari golongan Ashsabul-yamin. Yaitu dua surga yang terdahulu diperuntukkan bagi golongan orang-orang yang terdahulu beriman dan dua surga yang lain diperuntukkan bagi golongan Ashabul-yamin dari orang yang beriman kemudian. Hal ini sesuai dengan sabda Rasulullah dalam hadisnya: Dua surga dari emas untuk Muqarrabin dan dua buah lagi surga dari perak untuk Ashabul-yamin.\" (Riwayat Ibnu Jarir, Ibnu Abi hatim, Ibnu Mardawaih dari Abu Musa) \n\nMaka nikmat Tuhan yang manakah yang masih didustakan oleh jin dan manusia?",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan,",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۙ ",
      "text_translation_en": "which, then, of your Sustainer’s powers can you disavow? –",
      "juz_number": 27
    },
    "64": {
      "text_tafsir_en": "In the other two paradises are plants and flowers of old green color. Then which of the favors of God is rejected by the jinn and the human?",
      "text_tafsir": "Di dalam dua surga yang lain itu terdapat tumbuhtumbuhan dan bunga-bungaan yang hijau tua warnanya. Maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "kedua surga itu (kelihatan) hijau tua warnanya.",
      "text": "مُدْهَاۤمَّتٰنِۚ  ",
      "text_translation_en": "two [gardens] of the deepest green.",
      "juz_number": 27
    },
    "65": {
      "text_tafsir_en": "In the other two paradises are plants and flowers of old green color. Then which of the favors of God is rejected by the jinn and the human?",
      "text_tafsir": "Di dalam dua surga yang lain itu terdapat tumbuhtumbuhan dan bunga-bungaan yang hijau tua warnanya. Maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "66": {
      "text_tafsir_en": "This verse reveals that in heaven there are two springs that emit water, different from the water in the previous heaven. Then which of the favors of God is rejected by the jinn and the human?",
      "text_tafsir": "Ayat ini mengungkapkan bahwa di dalam surga ada dua mata air yang memancarkan air, berbeda dengan air pada surga yang terdahulu. Maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Di dalam keduanya (surga itu) ada dua buah mata air yang memancar.",
      "text": "فِيْهِمَا عَيْنٰنِ نَضَّاخَتٰنِۚ ",
      "text_translation_en": "In [each of] these two [gardens] will two springs gush forth.",
      "juz_number": 27
    },
    "67": {
      "text_tafsir_en": "This verse reveals that in heaven there are two springs that emit water, different from the water in the previous heaven. Then which of the favors of God is rejected by the jinn and the human?",
      "text_tafsir": "Ayat ini mengungkapkan bahwa di dalam surga ada dua mata air yang memancarkan air, berbeda dengan air pada surga yang terdahulu. Maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۚ  ",
      "text_translation_en": "Which, then, of your Sus­tainer’s powers can you disavow?",
      "juz_number": 27
    },
    "68": {
      "text_tafsir_en": "This verse explains that in both heaven there are various fruits which taste different flavors including dates and pomegranates. He mentions dates and pomegranates even though they are part of the fruit, because they are different from other fruits because they are in the fall and winter. In addition, dates are nutritious fruits, and pomegranates can be used as medicine. Which of the favors of God is rejected by the spirits of men and men?",
      "text_tafsir": "Ayat ini menerangkan bahwa pada kedua surga tersebut terdapat buah-buahan yang beraneka ragam cita rasanya di antaranya kurma dan delima. Disebutkannya kurma dan delima walaupun keduanya termasuk ke dalam jenis buah-buahan, karena ada perbedaan dengan buah-buahan yang lain sebab keduanya terdapat pada musim gugur dan musim dingin. Di samping itu kurma adalah buah-buahan bergizi, dan delima dapat dijadikan obat. Maka nikmat Allah yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Di dalam kedua surga itu ada buah-buahan, kurma dan delima.",
      "text": "فِيْهِمَا فَاكِهَةٌ وَّنَخْلٌ وَّرُمَّانٌۚ  ",
      "text_translation_en": "In both of them will be [all kinds of] fruit, and date-palms and pomegranates.",
      "juz_number": 27
    },
    "69": {
      "text_tafsir_en": "This verse explains that in both heaven there are various fruits which taste different flavors including dates and pomegranates. He mentions dates and pomegranates even though they are part of the fruit, because they are different from other fruits because they are in the fall and winter. In addition, dates are nutritious fruits, and pomegranates can be used as medicine. Which of the favors of God is rejected by the spirits of men and men?",
      "text_tafsir": "Ayat ini menerangkan bahwa pada kedua surga tersebut terdapat buah-buahan yang beraneka ragam cita rasanya di antaranya kurma dan delima. Disebutkannya kurma dan delima walaupun keduanya termasuk ke dalam jenis buah-buahan, karena ada perbedaan dengan buah-buahan yang lain sebab keduanya terdapat pada musim gugur dan musim dingin. Di samping itu kurma adalah buah-buahan bergizi, dan delima dapat dijadikan obat. Maka nikmat Allah yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۚ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "70": {
      "text_tafsir_en": "This verse reveals that in heaven there are good angels who look good and look good. Then which of the favors of God is rejected by the jinn and the human?",
      "text_tafsir": "Ayat ini mengungkapkan bahwa di dalam surga-surga ada bidadari-bidadari yang baik budi pekertinya dan cantik rupanya. Maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Di dalam surga-surga itu ada bidadari-bidadari yang baik-baik dan jelita.",
      "text": "فِيْهِنَّ خَيْرٰتٌ حِسَانٌۚ  ",
      "text_translation_en": "In these [gardens] will be [all] things most excellent and beautiful.",
      "juz_number": 27
    },
    "71": {
      "text_tafsir_en": "This verse reveals that in heaven there are good angels who look good and look good. Then which of the favors of God is rejected by the jinn and the human?",
      "text_tafsir": "Ayat ini mengungkapkan bahwa di dalam surga-surga ada bidadari-bidadari yang baik budi pekertinya dan cantik rupanya. Maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۚ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "72": {
      "text_tafsir_en": "This verse reveals that the angels are women who are both morally and beautiful apparently with beautiful eyes, sweet, white, clean around their black, secluded in the house, not those wandering the streets",
      "text_tafsir": "Ayat ini mengungkapkan bahwa bidadari-bidadari itu adalah perempuan yang baik akhlaknya dan cantik rupanya dengan mempunyai mata yang indah, manis, putih, bersih sekeliling hitamnya, dipingit di dalam rumah, bukan yang berkeliaran di jalanjalan",
      "text_translation": "Bidadari-bidadari yang dipelihara di dalam kemah-kemah.",
      "text": "حُوْرٌ مَّقْصُوْرٰتٌ فِى الْخِيَامِۚ  ",
      "text_translation_en": "[There the blest will live with their] companions pure and modest, in pavilions [splendid] -",
      "juz_number": 27
    },
    "73": {
      "text_tafsir_en": "This verse reveals that the angels are women who are both morally and beautiful apparently with beautiful eyes, sweet, white, clean around their black, secluded in the house, not those wandering the streets",
      "text_tafsir": "Ayat ini mengungkapkan bahwa bidadari-bidadari itu adalah perempuan yang baik akhlaknya dan cantik rupanya dengan mempunyai mata yang indah, manis, putih, bersih sekeliling hitamnya, dipingit di dalam rumah, bukan yang berkeliaran di jalanjalan",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۚ  ",
      "text_translation_en": "which, then, of your Sustainer’s powers can you disavow? –",
      "juz_number": 27
    },
    "74": {
      "text_tafsir_en": "This verse reveals that the angel was never touched by humans or the genie before the advent of the heavenly host who became their husband. Only their husbands have the right to touch them. The repetition of this statement, previously mentioned in verse 56 of this Surah ar-Rahman, is to show that they are very pure and their purity is very well preserved. Therefore, which of the favors of God is rejected by the jinn and the human? (",
      "text_tafsir": "Ayat ini mengungkapkan bahwa bidadari itu tidak pernah disentuh oleh manusia atau pun jin sebelum datang penghuni surga yang menjadi suami mereka. Hanya suami-suami mereka inilah yang berhak menyentuh mereka. Pengulangan pernyataan ini, dimana sebelumnya telah disebutkan dalam ayat 56 Surah ar-Rahman ini, adalah untuk menunjukkan bahwa mereka sungguh suci dan kesucian mereka terpelihara sangat baik. Oleh karena itu, maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia? (",
      "text_translation": "Mereka tidak pernah disentuh oleh manusia maupun oleh jin sebelumnya.",
      "text": "لَمْ يَطْمِثْهُنَّ اِنْسٌ قَبْلَهُمْ وَلَا جَاۤنٌّۚ  ",
      "text_translation_en": "[companions] whom neither man nor invisible being will have touched ere then.",
      "juz_number": 27
    },
    "75": {
      "text_tafsir_en": "This verse reveals that the angel was never touched by humans or the genie before the advent of the heavenly host who became their husband. Only their husbands have the right to touch them. The repetition of this statement, previously mentioned in verse 56 of this Surah ar-Rahman, is to show that they are very pure and their purity is very well preserved. Therefore, which of the favors of God is rejected by the jinn and the human? (",
      "text_tafsir": "Ayat ini mengungkapkan bahwa bidadari itu tidak pernah disentuh oleh manusia atau pun jin sebelum datang penghuni surga yang menjadi suami mereka. Hanya suami-suami mereka inilah yang berhak menyentuh mereka. Pengulangan pernyataan ini, dimana sebelumnya telah disebutkan dalam ayat 56 Surah ar-Rahman ini, adalah untuk menunjukkan bahwa mereka sungguh suci dan kesucian mereka terpelihara sangat baik. Oleh karena itu, maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia? (",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۚ  ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "76": {
      "text_tafsir_en": "This verse reveals that the inhabitants of heaven are seated comfortably on green pillows, large and beautiful carpets, beautifully embroidered, and inlaid with silk. Then which of the favors of God is rejected by the jinn and the human?",
      "text_tafsir": "Ayat ini mengungkapkan bahwa penghuni-penghuni surga itu duduk santai di atas bantal-bantal yang hijau, besar-besar dan permadani-permadani yang indah-indah, indah rupanya dan indah tenunannya, dan di sebelah dalamnya terbuat dari sutra. Maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Mereka bersandar pada bantal-bantal yang hijau dan permadani-permadani yang indah.",
      "text": "مُتَّكِـِٕيْنَ عَلٰى رَفْرَفٍ خُضْرٍ وَّعَبْقَرِيٍّ حِسَانٍۚ  ",
      "text_translation_en": "[In such a paradise will they dwell,] reclining upon meadows green and carpets rich in beauty.",
      "juz_number": 27
    },
    "77": {
      "text_tafsir_en": "This verse reveals that the inhabitants of heaven are seated comfortably on green pillows, large and beautiful carpets, beautifully embroidered, and inlaid with silk. Then which of the favors of God is rejected by the jinn and the human?",
      "text_tafsir": "Ayat ini mengungkapkan bahwa penghuni-penghuni surga itu duduk santai di atas bantal-bantal yang hijau, besar-besar dan permadani-permadani yang indah-indah, indah rupanya dan indah tenunannya, dan di sebelah dalamnya terbuat dari sutra. Maka nikmat Tuhan yang manakah yang didustakan oleh jin dan manusia?",
      "text_translation": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
      "text": "فَبِاَيِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۚ ",
      "text_translation_en": "Which, then, of your Sustainer’s powers can you disavow?",
      "juz_number": 27
    },
    "78": {
      "text_tafsir_en": "This verse reveals that, only Allah has the greatness and the gift of all the favors He has given, favors very much and rewards are very valuable. This is a lesson for His servants that all of them are His mercy. He who made heaven and earth, heaven and hell, tortures sinners, rewards those who obey Him.",
      "text_tafsir": "Ayat ini mengungkapkan bahwa, hanya Allah-lah yang mempunyai kebesaran dan karunia atas segala nikmat yang diberikan-Nya, nikmat yang sangat banyak dan ganjaran yang sangat berharga. Ini adalah pelajaran bagi hamba-Nya bahwa semuanya itu adalah rahmat-Nya. Dia yang menjadikan langit dan bumi, surga dan neraka, menyiksa orang-orang berdosa, memberi pahala kepada orang-orang yang menaati-Nya.",
      "text_translation": "Mahasuci nama Tuhanmu Pemilik Keagungan dan Kemuliaan.",
      "text": "تَبٰرَكَ اسْمُ رَبِّكَ ذِى الْجَلٰلِ وَالْاِكْرَامِ ࣖ ",
      "text_translation_en": "HALLOWED be thy Sustainer’s name, full of majesty and glory!",
      "juz_number": 27
    }
  },
  "name": "الرحمن",
  "name_translation_en": "The Beneficent",
  "name_translation": "Maha Pengasih",
  "name_latin": "Ar-Rahman"
}