{
  "number": 56,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 96,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse explains that when the Day of Resurrection occurs, it cannot be denied and no doubt, no one can deny it or deny it and it is visible to everyone. When in the world, many righteous people reject it and reject it because they have never felt the painful torment that those who have been tortured.",
      "text_tafsir": "Ayat ini menerangkan bahwa apabila terjadi hari Kiamat, maka kejadian itu tidak dapat didustakan dan juga tidak dapat diragukan, tidak seorang pun dapat mendustakannya atau mengingkarinya dan nyata dilihat oleh setiap orang. Tatkala di dunia, banyak benar manusia yang mendustakannya dan mengingkarinya karena belum merasakan azab sengsara yang telah diderita oleh orang-orang yang telah disiksa itu.",
      "text_translation": "Apabila terjadi hari Kiamat,",
      "text": "اِذَا وَقَعَتِ الْوَاقِعَةُۙ ",
      "text_translation_en": "WHEN THAT which must come to pass [at last] comes to pass,",
      "juz_number": 27
    },
    "2": {
      "text_tafsir_en": "This verse explains that when the Day of Resurrection occurs, it cannot be denied and no doubt, no one can deny it or deny it and it is visible to everyone. When in the world, many righteous people reject it and reject it because they have never felt the painful torment that those who have been tortured.",
      "text_tafsir": "Ayat ini menerangkan bahwa apabila terjadi hari Kiamat, maka kejadian itu tidak dapat didustakan dan juga tidak dapat diragukan, tidak seorang pun dapat mendustakannya atau mengingkarinya dan nyata dilihat oleh setiap orang. Tatkala di dunia, banyak benar manusia yang mendustakannya dan mengingkarinya karena belum merasakan azab sengsara yang telah diderita oleh orang-orang yang telah disiksa itu.",
      "text_translation": "terjadinya tidak dapat didustakan (disangkal).",
      "text": "لَيْسَ لِوَقْعَتِهَا كَاذِبَةٌ  ۘ ",
      "text_translation_en": "there will be nought that could give the lie to its having come to pass,",
      "juz_number": 27
    },
    "3": {
      "text_tafsir_en": "This verse explains that the events of the Day of Judgment will lower one group and raise the other, says Ibn 'Abbas. Because of the big events that have a big impact, too. It is then explained that the Day of Resurrection reduced the degrees of one group and elevated the other. Meanwhile, there was an earthquake that shattered everything above, mountains and buildings eroding like dust flying in the air. The people of that time were divided into three classes: the right-handers (Ashabul-yamin), the left-handers (Ashabusy-syimal), and the ancient believers (As-sabiqun). (",
      "text_tafsir": "Ayat ini menjelaskan bahwa kejadian hari Kiamat akan merendahkan satu golongan dan meninggikan golongan yang lain, demikian kata Ibnu 'Abbas. Karena kejadian yang besar pengaruhnya membawa perubahan yang besar pula. Kemudian diterangkan bahwa hari Kiamat itu menurunkan derajat golongan yang satu dan meninggikan golongan yang lain. Tatkala itu, ada gempa yang menghancurkan semua yang ada di atas, gunung-gunung dan bangunanbangunan hancur-lebur seperti debu yang beterbangan di udara. Manusia ketika itu terbagi atas tiga golongan yaitu golongan kanan (Ashabul-yamin), golongan kiri (Ashabusy-syimal), dan golongan orang terdahulu beriman (As-sabiqun). (",
      "text_translation": "(Kejadian itu) merendahkan (satu golongan) dan meninggikan (golongan yang lain).",
      "text": "خَافِضَةٌ رَّافِعَةٌ ",
      "text_translation_en": "abasing [some], exalting [others]!",
      "juz_number": 27
    },
    "4": {
      "text_tafsir_en": "This verse explains that on the day of Resurrection there will be a terrible earthquake with great earthquakes in every corner of the earth, destroying fortifications and mountains, demolishing houses and buildings, and everything on the surface of the earth. In another verse, God says: When the earth is shaken with terrible shaking. (azzalzalah \/ 99: 1) And his word: O man! Fear your Lord; indeed, the shaking (day) of the End was a great (event). (al-hajj \/ 22: 1).",
      "text_tafsir": "Ayat ini menjelaskan bahwa pada hari Kiamat akan timbul gempa bumi yang sangat dahsyat dengan guncangan-guncangan yang hebat di segenap pelosok bumi, menghancurkan benteng-benteng dan gunung-gunung, merobohkan rumah-rumah dan bangunanbangunan, serta apa saja yang terdapat di permukaan bumi. Dalam ayat lain, Allah berfirman: \n\nApabila bumi diguncangkan dengan guncangan yang dahsyat. (azZalzalah\/99: 1) \n\nDan firman-Nya: \n\nWahai manusia! Bertakwalah kepada Tuhanmu; sungguh, guncangan (hari) Kiamat itu adalah suatu (kejadian) yang sangat besar. (al-hajj\/22: 1).",
      "text_translation": "Apabila bumi diguncangkan sedahsyat-dahsyatnya,",
      "text": "اِذَا رُجَّتِ الْاَرْضُ رَجًّاۙ ",
      "text_translation_en": "When the earth is shaken with a shaking [severe],",
      "juz_number": 27
    },
    "5": {
      "text_tafsir_en": "This verse reveals that on the Day of Resurrection the mountain was shattered into a heap of loose soil, into dust that drifts like dry leaves blown by the wind. In short, the mountains will disappear from place according to verse 9 al-Ma'arij \/ 70. And the mountains are like feathers. (alMa'arij \/ 70: 9) And the mountains were shattered. (alWaqi'ah \/ 56: 5)",
      "text_tafsir": "Ayat ini mengungkapkan bahwa pada hari Kiamat gununggunung dihancur-luluhkan sehancur-hancurnya menjadi tumpukan tanah yang bercerai-berai, menjadi debu yang beterbangan seperti daun kering yang diterbangkan angin. Ringkasnya, gunung-gunung akan hilang dari tempatnya sesuai pula dengan ayat 9 al-Ma'arij\/70. Dan gunung-gunung bagaikan bulu (yang beterbangan). (alMa'arij\/70: 9) \n\nDan gunung-gunung dihancurluluhkan sehancur-hancurnya. (alWaqi'ah\/56: 5)",
      "text_translation": "dan gunung-gunung dihancurluluhkan sehancur-hancurnya,",
      "text": "وَّبُسَّتِ الْجِبَالُ بَسًّاۙ  ",
      "text_translation_en": "and the mountains are shattered into [countless] shards,",
      "juz_number": 27
    },
    "6": {
      "text_tafsir_en": "This verse reveals that on the Day of Resurrection the mountain was shattered into a heap of loose soil, into dust that drifts like dry leaves blown by the wind. In short, the mountains will disappear from place according to verse 9 al-Ma'arij \/ 70. And the mountains are like feathers. (alMa'arij \/ 70: 9) And the mountains were shattered. (alWaqi'ah \/ 56: 5)",
      "text_tafsir": "Ayat ini mengungkapkan bahwa pada hari Kiamat gununggunung dihancur-luluhkan sehancur-hancurnya menjadi tumpukan tanah yang bercerai-berai, menjadi debu yang beterbangan seperti daun kering yang diterbangkan angin. Ringkasnya, gunung-gunung akan hilang dari tempatnya sesuai pula dengan ayat 9 al-Ma'arij\/70. Dan gunung-gunung bagaikan bulu (yang beterbangan). (alMa'arij\/70: 9) \n\nDan gunung-gunung dihancurluluhkan sehancur-hancurnya. (alWaqi'ah\/56: 5)",
      "text_translation": "maka jadilah ia debu yang beterbangan,",
      "text": "فَكَانَتْ هَبَاۤءً مُّنْۢبَثًّاۙ ",
      "text_translation_en": "so that they become as scat­tered dust –",
      "juz_number": 27
    },
    "7": {
      "text_tafsir_en": "This verse explains that the people at that time consisted of three groups, the right-wing, the left-hand, and the first-class believers, as will be explained in the next verse.",
      "text_tafsir": "Ayat ini menjelaskan bahwa manusia pada waktu itu terdiri atas tiga golongan, yaitu-golongan kanan, golongan kiri, dan golongan orang-orang yang paling dahulu beriman, sebagaimana akan diterangkan pada ayat berikutnya.",
      "text_translation": "dan kamu menjadi tiga golongan,",
      "text": "وَّكُنْتُمْ اَزْوَاجًا ثَلٰثَةً ۗ",
      "text_translation_en": "[on that Day,] then, shall you be [divided into] three kinds.",
      "juz_number": 27
    },
    "8": {
      "text_tafsir_en": "This verse explains that the \"right-hand people\" are those who receive the books of their charity with their right hand showing that they are residents of heaven. Of course they are very nice and very nice. The \"leftists\" are those who receive their charity handbooks that show that they are hell-bent on torture and very painful punishment. Concerning this verse, Mu'adh bin Jabal recounted: When he read the above verse, he held his hand and said, \"This (which is held in his right hand) is a man of heaven and I do not need to look, and ( his left hand) this is a hell of a hell and I don't need to care. \" (Ahmad's History of Mu'adh bin Jabal)",
      "text_tafsir": "Ayat ini menjelaskan bahwa \"golongan kanan\" adalah orang-orang yang menerima buku-buku catatan amal mereka dengan tangan kanan yang menunjukkan bahwa mereka adalah penghuni surga. Tentulah keadaan mereka sangat baik dan sangat menyenangkan. \"golongan kiri\" ialah orang-orang yang menerima buku catatan amal mereka dengan tangan kiri yang menunjukkan bahwa mereka adalah penghuni neraka dan akan mendapat siksaan serta hukuman yang sangat menyedihkan. Berkenaan dengan ayat ini Mu'adh bin Jabal meriwayatkan: Nabi Muhammad saw tatkala membaca ayat di atas, beliau menggenggam tangannya seraya berkata, \"Ini (yang digenggam dengan tangan kanan beliau) adalah ahli surga dan tidak perlu aku memperhatikan, dan (yang digenggam dengan tangan kiri beliau) ini adalah ahli neraka dan tidak perlu aku mempedulikannya.\" (Riwayat Ahmad dari Mu'adh bin Jabal)",
      "text_translation": "yaitu golongan kanan, alangkah mulianya golongan kanan itu,",
      "text": "فَاَصْحٰبُ الْمَيْمَنَةِ ەۙ مَآ اَصْحٰبُ الْمَيْمَنَةِ ۗ",
      "text_translation_en": "Thus, there shall be such as will have attained to what is right: oh, how [happy] will be they who have attained to what is right!",
      "juz_number": 27
    },
    "9": {
      "text_tafsir_en": "This verse explains that the \"right-hand people\" are those who receive the books of their charity with their right hand showing that they are residents of heaven. Of course they are very nice and very nice. The \"leftists\" are those who receive their charity handbooks that show that they are hell-bent on torture and very painful punishment. Concerning this verse, Mu'adh bin Jabal recounted: When he read the above verse, he held his hand and said, \"This (which is held in his right hand) is a man of heaven and I do not need to look, and ( his left hand) this is a hell of a hell and I don't need to care. \" (Ahmad's History of Mu'adh bin Jabal)",
      "text_tafsir": "Ayat ini menjelaskan bahwa \"golongan kanan\" adalah orang-orang yang menerima buku-buku catatan amal mereka dengan tangan kanan yang menunjukkan bahwa mereka adalah penghuni surga. Tentulah keadaan mereka sangat baik dan sangat menyenangkan. \"golongan kiri\" ialah orang-orang yang menerima buku catatan amal mereka dengan tangan kiri yang menunjukkan bahwa mereka adalah penghuni neraka dan akan mendapat siksaan serta hukuman yang sangat menyedihkan. Berkenaan dengan ayat ini Mu'adh bin Jabal meriwayatkan: Nabi Muhammad saw tatkala membaca ayat di atas, beliau menggenggam tangannya seraya berkata, \"Ini (yang digenggam dengan tangan kanan beliau) adalah ahli surga dan tidak perlu aku memperhatikan, dan (yang digenggam dengan tangan kiri beliau) ini adalah ahli neraka dan tidak perlu aku mempedulikannya.\" (Riwayat Ahmad dari Mu'adh bin Jabal)",
      "text_translation": "dan golongan kiri, alangkah sengsaranya golongan kiri itu,",
      "text": "وَاَصْحٰبُ الْمَشْـَٔمَةِ ەۙ مَآ اَصْحٰبُ الْمَشْـَٔمَةِ ۗ",
      "text_translation_en": "And there shall be such as will have lost them­selves in evil: oh, how [unhappy] will be they who have lost themselves in evil!",
      "juz_number": 27
    },
    "10": {
      "text_tafsir_en": "This verse explains that those who once believed in God are no longer familiar to us personally because of their greatness and their wonderful deeds. It can also mean that those who first obey the commandments of God, they are the first to receive the grace of God. Whoever is the first to do good in this world, then he is the first to be rewarded in the hereafter. This verse explains that the meaning of \"as-sabiqun\", is that those who are mentioned in the 'Aishah' as Prophet Muhammad (peace be upon him) said, \"Do you know who is the first protector of Allah on the Day of Judgment?\" They said, \"Allah and His Messenger know best.\" The Prophet said, \"They are the ones who are given the right to receive it, when asked, give it and when they inflict punishment on others just as they are punishing themselves.\" (Ahmad's History of 'Aisyah) (",
      "text_tafsir": "Ayat ini menjelaskan bahwa orang-orang yang paling dahulu beriman kepada Allah tidak asing lagi bagi kita pribadi hal ini tampak karena kebesarannya serta perbuatan-perbuatan mereka yang mengagumkan. Dapat pula diartikan bahwa orang-orang yang paling dahulu mematuhi perintah Allah, mereka pulalah yang paling dahulu menerima rahmat Allah. Barang siapa yang lebih awal membuat kebaikan di dunia ini, maka ia adalah orang yang lebih awal pula mendapat ganjaran di akhirat nanti. Ayat ini menjelaskan bahwa yang dimaksud dengan \"as-sabiqun\", ialah mereka yang disebut dalam hadis 'Aisyah sebagai Nabi Muhammad saw telah bersabda, \"Apakah kamu sekalian tahu siapa yang paling dahulu mendapat perlindungan dari Allah pada hari Kiamat nanti?\" Mereka (para sahabat) berkata, \"Allah dan Rasul-Nya yang lebih mengetahui.\" Rasulullah bersabda, \"Mereka itu adalah orang yang apabila diberi haknya menerimanya, apabila diminta, memberikannya dan apabila menjatuhkan hukuman terhadap orang lain sama seperti mereka menjatuhkan hukuman terhadap diri mereka sendiri.\" (Riwayat Ahmad dari 'Aisyah) (",
      "text_translation": "dan orang-orang yang paling dahulu (beriman), merekalah yang paling dahulu (masuk surga).",
      "text": "وَالسّٰبِقُوْنَ السّٰبِقُوْنَۙ  ",
      "text_translation_en": "But the foremost shall be [they who in life were] the foremost [in faith and good works]:",
      "juz_number": 27
    },
    "11": {
      "text_tafsir_en": "This verse explains that those who first believed were the first to receive a reward from Allah. They are heavenly beings who are blessed with favors that have never been seen by the eyes and heard by the ear and thought by anyone as mentioned in the Prophet's hadith. In heaven there are pleasures and pleasures that are never seen by the eyes, heard by the ear, and never crossed the human heart. (History of al-Bazzar from Abu Sa'id)",
      "text_tafsir": "Ayat ini menerangkan bahwa mereka yang paling dahulu beriman itulah yang menerima ganjaran yang lebih dahulu dari Allah. Mereka adalah ahli surga yang dilimpahi nikmat-nikmat yang tidak pernah dilihat oleh mata dan didengar oleh telinga serta terpikirkan oleh siapa pun juga sebagaimana disebutkan dalam hadis Nabi saw. Di dalam surga terdapat nikmat dan kesenangan yang tidak pernah dilihat oleh mata dan didengar oleh telinga serta tidak pernah terlintas di hati manusia. (Riwayat al-Bazzar dari Abu Sa'id)",
      "text_translation": "Mereka itulah orang yang dekat (kepada Allah),",
      "text": "اُولٰۤىِٕكَ الْمُقَرَّبُوْنَۚ ",
      "text_translation_en": "they who were [always] drawn close unto God!",
      "juz_number": 27
    },
    "12": {
      "text_tafsir_en": "This verse explains that those who first believed were the first to receive a reward from Allah. They are heavenly beings who are blessed with favors that have never been seen by the eyes and heard by the ear and thought by anyone as mentioned in the Prophet's hadith. In heaven there are pleasures and pleasures that are never seen by the eyes, heard by the ear, and never crossed the human heart. (History of al-Bazzar from Abu Sa'id)",
      "text_tafsir": "Ayat ini menerangkan bahwa mereka yang paling dahulu beriman itulah yang menerima ganjaran yang lebih dahulu dari Allah. Mereka adalah ahli surga yang dilimpahi nikmat-nikmat yang tidak pernah dilihat oleh mata dan didengar oleh telinga serta terpikirkan oleh siapa pun juga sebagaimana disebutkan dalam hadis Nabi saw. Di dalam surga terdapat nikmat dan kesenangan yang tidak pernah dilihat oleh mata dan didengar oleh telinga serta tidak pernah terlintas di hati manusia. (Riwayat al-Bazzar dari Abu Sa'id)",
      "text_translation": "Berada dalam surga kenikmatan,",
      "text": "فِيْ جَنّٰتِ النَّعِيْمِ ",
      "text_translation_en": "In gardens of bliss [will they dwell] -",
      "juz_number": 27
    },
    "13": {
      "text_tafsir_en": "These verses explain that the percentage of the people who used to be \"as-Sabiqun al-Muqarrabun\" is greater than the percentage of the people of the Prophet Muhammad. However, because the number of the people of the Prophet Muhammad was far greater than the number of the followers of the previous prophets, the number of the people of the Prophet Muhammad who included \"as-Sabiqun al-Muqarrabun\" was far greater than the number of the previous people.",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa prosentase umat dahulu yang termasuk \"as-Sabiqun al-Muqarrabun\" lebih besar dibanding dengan prosentase umat Nabi Muhammad. Namun karena jumlah umat Nabi Muhammad itu jauh lebih besar dari jumlah umat nabi-nabi sebelumnya, maka jumlah umat Nabi Muhammad yang termasuk \"as-Sabiqun al-Muqarrabun\" jauh lebih besar dibanding dengan jumlah umat-umat dahulu.",
      "text_translation": "segolongan besar dari orang-orang yang terdahulu,",
      "text": "ثُلَّةٌ مِّنَ الْاَوَّلِيْنَۙ  ",
      "text_translation_en": "a good many of those of olden times,",
      "juz_number": 27
    },
    "14": {
      "text_tafsir_en": "These verses explain that the percentage of the people who used to be \"as-Sabiqun al-Muqarrabun\" is greater than the percentage of the people of the Prophet Muhammad. However, because the number of the people of the Prophet Muhammad was far greater than the number of the followers of the previous prophets, the number of the people of the Prophet Muhammad who included \"as-Sabiqun al-Muqarrabun\" was far greater than the number of the previous people.",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa prosentase umat dahulu yang termasuk \"as-Sabiqun al-Muqarrabun\" lebih besar dibanding dengan prosentase umat Nabi Muhammad. Namun karena jumlah umat Nabi Muhammad itu jauh lebih besar dari jumlah umat nabi-nabi sebelumnya, maka jumlah umat Nabi Muhammad yang termasuk \"as-Sabiqun al-Muqarrabun\" jauh lebih besar dibanding dengan jumlah umat-umat dahulu.",
      "text_translation": "dan segolongan kecil dari orang-orang yang kemudian.",
      "text": "وَقَلِيْلٌ مِّنَ الْاٰخِرِيْنَۗ  ",
      "text_translation_en": "but [only] a few of later times.",
      "juz_number": 27
    },
    "15": {
      "text_tafsir_en": "These verses explain that they sit face-to-face on a gold-plated couch. They are at peace, at peace, happy and in good company; they do not have in their hearts feelings of hostility or hatred that will separate one person from another.",
      "text_tafsir": "Ayat-ayat ini menjelaskan bahwa mereka duduk santai berhadap-hadapan di atas dipan yang bertahtakan emas dan permata. Mereka dalam keadaan rukun, damai, hidup berbahagia dan bergaul dengan baik; tidak terdapat pada hati mereka perasaan permusuhan atau kebencian yang akan memisahkan seseorang dengan yang lain.",
      "text_translation": "Mereka berada di atas dipan-dipan yang bertahtakan emas dan permata,",
      "text": "عَلٰى سُرُرٍ مَّوْضُوْنَةٍۙ  ",
      "text_translation_en": "[They will be seated] on gold-encrusted thrones of happiness,",
      "juz_number": 27
    },
    "16": {
      "text_tafsir_en": "These verses explain that they sit face-to-face on a gold-plated couch. They are at peace, at peace, happy and in good company; they do not have in their hearts feelings of hostility or hatred that will separate one person from another.",
      "text_tafsir": "Ayat-ayat ini menjelaskan bahwa mereka duduk santai berhadap-hadapan di atas dipan yang bertahtakan emas dan permata. Mereka dalam keadaan rukun, damai, hidup berbahagia dan bergaul dengan baik; tidak terdapat pada hati mereka perasaan permusuhan atau kebencian yang akan memisahkan seseorang dengan yang lain.",
      "text_translation": "mereka bersandar di atasnya berhadap-hadapan.",
      "text": "مُّتَّكِـِٕيْنَ عَلَيْهَا مُتَقٰبِلِيْنَ",
      "text_translation_en": "reclining upon them, facing one another [in love].",
      "juz_number": 27
    },
    "17": {
      "text_tafsir_en": "This verse reveals that they are surrounded by young children who remain young and are pleasant to look at. They are acting as servants who serve the inhabitants of heaven at meal, drink, and others.",
      "text_tafsir": "Ayat ini mengungkapkan bahwa mereka dikelilingi oleh anakanak muda yang tetap muda serta menyenangkan bila dipandang. Mereka ini bertindak selaku pelayan yang melayani penghunipenghuni surga di waktu makan, minum, dan lain-lainnya.",
      "text_translation": "Mereka dikelilingi oleh anak-anak muda yang tetap muda,",
      "text": "يَطُوْفُ عَلَيْهِمْ وِلْدَانٌ مُّخَلَّدُوْنَۙ  ",
      "text_translation_en": "Immortal youths will wait upon them",
      "juz_number": 27
    },
    "18": {
      "text_tafsir_en": "This verse explains that these young people are serving heaven's inhabitants by bringing glasses, cups, kettles and khamar drinks taken from water that flows from their springs, not squeezed, clear and inexhaustible clean. They can take and drink as they wish and that doesn't make them dizzy and drunk.",
      "text_tafsir": "Ayat ini menjelaskan bahwa anak-anak muda tersebut melayani penghuni surga dengan membawa gelas, piala, cerek, dan minuman khamar yang diambil dari air yang mengalir dari mata airnya, tidak diperas, bening dan bersih yang tidak habis-habisnya. Mereka dapat mengambil dan minum semaunya dan hal itu tidak membuat mereka pening dan mabuk.",
      "text_translation": "dengan membawa gelas, cerek dan sloki (piala) berisi minuman yang diambil dari air yang mengalir,",
      "text": "بِاَكْوَابٍ وَّاَبَارِيْقَۙ وَكَأْسٍ مِّنْ مَّعِيْنٍۙ  ",
      "text_translation_en": "with goblets, and ewers, and cups filled with water from unsullied springs",
      "juz_number": 27
    },
    "19": {
      "text_tafsir_en": "This verse explains that these young people are serving heaven's inhabitants by bringing glasses, cups, kettles and khamar drinks taken from water that flows from their springs, not squeezed, clear and inexhaustible clean. They can take and drink as they wish and that doesn't make them dizzy and drunk.",
      "text_tafsir": "Ayat ini menjelaskan bahwa anak-anak muda tersebut melayani penghuni surga dengan membawa gelas, piala, cerek, dan minuman khamar yang diambil dari air yang mengalir dari mata airnya, tidak diperas, bening dan bersih yang tidak habis-habisnya. Mereka dapat mengambil dan minum semaunya dan hal itu tidak membuat mereka pening dan mabuk.",
      "text_translation": "mereka tidak pening karenanya dan tidak pula mabuk,",
      "text": "لَّا يُصَدَّعُوْنَ عَنْهَا وَلَا يُنْزِفُوْنَۙ  ",
      "text_translation_en": "by which their minds will not be clouded and which will not make them drunk;",
      "juz_number": 27
    },
    "20": {
      "text_tafsir_en": "This verse expresses the kind of drink and food in heaven, which is the fruit they desire and the flesh of the bird that they love, which arouses the delicacy of taste, as God says: The parable of the paradise of heaven is promised to those who fear; there are rivers of fresh water, and streams of milk that do not taste good, and of sweet (wine-free) cups that taste good for their drinkers and streams of pure honey. In it they receive all kinds of fruits and forgiveness from their Lord. (Muhammad \/ 47: 15) In another verse, We give them fruit and flesh of every kind that they desire. (ath-thur \/ 52: 22)",
      "text_tafsir": "Ayat ini mengungkapkan jenis minuman dan makanan di dalam surga yaitu berupa buah-buahan yang mereka kehendaki dan daging burung yang mereka sukai, yang membangkitkan selera karena lezat rasanya, sebagaimana firman Allah: \n\nPerumpamaan taman surga yang dijanjikan kepada orang-orang yang bertakwa; di sana ada sungai-sungai yang airnya tidak payau, dan sungai-sungai air susu yang tidak berubah rasanya, dan sungaisungai khamar (anggur yang tidak memabukkan) yang lezat rasanya bagi peminumnya dan sungai-sungai madu yang murni. Di dalamnya mereka memperoleh segala macam buah-buahan dan ampunan dari Tuhan mereka. (Muhammad\/47: 15) \n\nFirman dalam ayat lain: \n\nDan Kami berikan kepada mereka tambahan berupa buah-buahan dan daging dari segala jenis yang mereka ingini. (ath-thur\/52: 22)",
      "text_translation": "dan buah-buahan apa pun yang mereka pilih,",
      "text": "وَفَاكِهَةٍ مِّمَّا يَتَخَيَّرُوْنَۙ  ",
      "text_translation_en": "and with fruit of any kind that they may choose,",
      "juz_number": 27
    },
    "21": {
      "text_tafsir_en": "This verse expresses the kind of drink and food in heaven, which is the fruit they desire and the flesh of the bird that they love, which arouses the delicacy of taste, as God says: The parable of the paradise of heaven is promised to those who fear; there are rivers of fresh water, and streams of milk that do not taste good, and of sweet (wine-free) cups that taste good for their drinkers and streams of pure honey. In it they receive all kinds of fruits and forgiveness from their Lord. (Muhammad \/ 47: 15) In another verse, We give them fruit and flesh of every kind that they desire. (ath-thur \/ 52: 22)",
      "text_tafsir": "Ayat ini mengungkapkan jenis minuman dan makanan di dalam surga yaitu berupa buah-buahan yang mereka kehendaki dan daging burung yang mereka sukai, yang membangkitkan selera karena lezat rasanya, sebagaimana firman Allah: \n\nPerumpamaan taman surga yang dijanjikan kepada orang-orang yang bertakwa; di sana ada sungai-sungai yang airnya tidak payau, dan sungai-sungai air susu yang tidak berubah rasanya, dan sungaisungai khamar (anggur yang tidak memabukkan) yang lezat rasanya bagi peminumnya dan sungai-sungai madu yang murni. Di dalamnya mereka memperoleh segala macam buah-buahan dan ampunan dari Tuhan mereka. (Muhammad\/47: 15) \n\nFirman dalam ayat lain: \n\nDan Kami berikan kepada mereka tambahan berupa buah-buahan dan daging dari segala jenis yang mereka ingini. (ath-thur\/52: 22)",
      "text_translation": "dan daging burung apa pun yang mereka inginkan.",
      "text": "وَلَحْمِ طَيْرٍ مِّمَّا يَشْتَهُوْنَۗ  ",
      "text_translation_en": "and with the flesh of any fowl that they may desire.",
      "juz_number": 27
    },
    "22": {
      "text_tafsir_en": "This verse reveals in heaven that there is a jade-eyed angel like a well-preserved pearl. The angel is like a pearl that is untouched by the hand and clean from dust is very beautiful and charming. Generally, the infidels interpret this verse to mean that hawariyyun is a white woman, her eyes are very white and black. The Word of God: The angels are kept in tents. Then which of the favors of your Lord will you deny? They have never been touched by humans or by the genie before. (arRahman \/ 55: 72-74) The Word of God in another verse says: They lean on the couch and We give them a pair of beautiful angelic eyes. (ath-thur \/ 52: 20)",
      "text_tafsir": "Ayat ini mengungkapkan di dalam surga itu ada bidadaribidadari yang bermata jeli laksana mutiara yang tersimpan baik. Bidadari bagaikan mutiara yang belum tersentuh tangan dan bersih dari debu sangat cantik dan memesona. Pada umumnya para mufasir menafsirkan ayat ini bahwa yang dimaksud dengan hawariyyun adalah perempuan yang putih, matanya sangat jelas warna putih dan hitamnya. Firman Allah: \n\nBidadari-bidadari yang dipelihara di dalam kemah-kemah. Maka nikmat Tuhanmu yang manakah yang kamu dustakan? Mereka tidak pernah disentuh oleh manusia maupun oleh jin sebelumnya. (arRahman\/55: 72-74) \n\nFirman Allah dalam ayat lain: \n\nMereka bersandar di atas dipan-dipan yang tersusun dan Kami berikan kepada mereka pasangan bidadari yang bermata indah. (ath-thur\/52: 20)",
      "text_translation": "Dan ada bidadari-bidadari yang bermata indah,",
      "text": "وَحُوْرٌ عِيْنٌۙ  ",
      "text_translation_en": "And [with them will be their] companions pure, most beautiful of eye,",
      "juz_number": 27
    },
    "23": {
      "text_tafsir_en": "This verse reveals in heaven that there is a jade-eyed angel like a well-preserved pearl. The angel is like a pearl that is untouched by the hand and clean from dust is very beautiful and charming. Generally, the infidels interpret this verse to mean that hawariyyun is a white woman, her eyes are very white and black. The Word of God: The angels are kept in tents. Then which of the favors of your Lord will you deny? They have never been touched by humans or by the genie before. (arRahman \/ 55: 72-74) The Word of God in another verse says: They lean on the couch and We give them a pair of beautiful angelic eyes. (ath-thur \/ 52: 20)",
      "text_tafsir": "Ayat ini mengungkapkan di dalam surga itu ada bidadaribidadari yang bermata jeli laksana mutiara yang tersimpan baik. Bidadari bagaikan mutiara yang belum tersentuh tangan dan bersih dari debu sangat cantik dan memesona. Pada umumnya para mufasir menafsirkan ayat ini bahwa yang dimaksud dengan hawariyyun adalah perempuan yang putih, matanya sangat jelas warna putih dan hitamnya. Firman Allah: \n\nBidadari-bidadari yang dipelihara di dalam kemah-kemah. Maka nikmat Tuhanmu yang manakah yang kamu dustakan? Mereka tidak pernah disentuh oleh manusia maupun oleh jin sebelumnya. (arRahman\/55: 72-74) \n\nFirman Allah dalam ayat lain: \n\nMereka bersandar di atas dipan-dipan yang tersusun dan Kami berikan kepada mereka pasangan bidadari yang bermata indah. (ath-thur\/52: 20)",
      "text_translation": "laksana mutiara yang tersimpan baik.",
      "text": "كَاَمْثَالِ اللُّؤْلُؤِ الْمَكْنُوْنِۚ  ",
      "text_translation_en": "like unto pearls [still] hidden in their shells.",
      "juz_number": 27
    },
    "24": {
      "text_tafsir_en": "This verse reveals why they receive such a wonderful favor, which is the reward for all that they have done in the world, to fulfill their obligations, to obey Allah's command, and to abstain from His prohibitions. They wake up in the middle of the night, pray, praise, meditate, reflect on the greatness of God and ask for His forgiveness and fast all day. As the word of God says: They sleep a little at night; and at the end of the night they seek forgiveness. And on their property there is a right to the poor who ask and the poor who do not ask. (adh-dzariyat \/ 51: 17-19)",
      "text_tafsir": "Ayat ini mengungkapkan sebab mereka mendapat nikmat yang luar biasa itu, yang merupakan balasan bagi apa-apa yang telah mereka kerjakan di dunia, menunaikan kewajiban, mematuhi perintah Allah swt, dan menjauhkan diri dari larangan-larangan-Nya dengan sebaik-baiknya. Mereka bangun tengah malam, salat, memuji, berzikir, merenungkan kebesaran Allah dan memohon ampunan-Nya serta berpuasa siang harinya. Sebagaimana yang diutarakan dalam firman Allah: \n\nMereka sedikit sekali tidur pada waktu malam; dan pada akhir malam mereka memohon ampunan (kepada Allah). Dan pada harta benda mereka ada hak untuk orang miskin yang meminta dan orang miskin yang tidak meminta. (adh-dzariyat\/51: 17-19)",
      "text_translation": "Sebagai balasan atas apa yang mereka kerjakan.",
      "text": "جَزَاۤءًۢ بِمَا كَانُوْا يَعْمَلُوْنَ",
      "text_translation_en": "[And this will be] a reward for what they did [in life].",
      "juz_number": 27
    },
    "25": {
      "text_tafsir_en": "These verses reveal that in heaven they will not hear vain, degrading words, which are not worthy of being spoken by good-hearted and delicate people, rather than words that cause sin. There you will hear greetings and good words, which are good to hear. Thus in another verse God says: Their prayer in it is, \"Subhanakallahumma\", and their salutations are, \"Salutations\". And the close of their prayer is, \"Alhamdu lillahi Rabbil 'alamin\". (Jonah 10:10)",
      "text_tafsir": "Ayat-ayat ini mengungkapkan bahwa di dalam surga itu tidak akan terdengar kata-kata sia-sia, yang memuakkan, yang tidak layak diucapkan oleh orang baik-baik yang mempunyai akhlak tinggi dan mempunyai perasaan yang halus, terlebih kata-kata yang menimbulkan dosa. Di sana akan terdengar ucapan-ucapan salam dan kata-kata yang baik, yang enak didengar telinga. Demikian di ayat lain Allah berfirman: \n\nDoa mereka di dalamnya ialah, \"Subhanakallahumma\" (Mahasuci Engkau, ya Tuhan kami), dan salam penghormatan mereka ialah, \"Salam\" (salam sejahtera). Dan penutup doa mereka ialah, \"Alhamdu lillahi Rabbil 'alamin\" (segala puji bagi Allah Tuhan seluruh alam). (Yunus\/10: 10)",
      "text_translation": "Di sana mereka tidak mendengar percakapan yang sia-sia maupun yang menimbulkan dosa,",
      "text": "لَا يَسْمَعُوْنَ فِيْهَا لَغْوًا وَّلَا تَأْثِيْمًاۙ  ",
      "text_translation_en": "No empty talk will they hear there, nor any call to sin,",
      "juz_number": 27
    },
    "26": {
      "text_tafsir_en": "These verses reveal that in heaven they will not hear vain, degrading words, which are not worthy of being spoken by good-hearted and delicate people, rather than words that cause sin. There you will hear greetings and good words, which are good to hear. Thus in another verse God says: Their prayer in it is, \"Subhanakallahumma\", and their salutations are, \"Salutations\". And the close of their prayer is, \"Alhamdu lillahi Rabbil 'alamin\". (Jonah 10:10)",
      "text_tafsir": "Ayat-ayat ini mengungkapkan bahwa di dalam surga itu tidak akan terdengar kata-kata sia-sia, yang memuakkan, yang tidak layak diucapkan oleh orang baik-baik yang mempunyai akhlak tinggi dan mempunyai perasaan yang halus, terlebih kata-kata yang menimbulkan dosa. Di sana akan terdengar ucapan-ucapan salam dan kata-kata yang baik, yang enak didengar telinga. Demikian di ayat lain Allah berfirman: \n\nDoa mereka di dalamnya ialah, \"Subhanakallahumma\" (Mahasuci Engkau, ya Tuhan kami), dan salam penghormatan mereka ialah, \"Salam\" (salam sejahtera). Dan penutup doa mereka ialah, \"Alhamdu lillahi Rabbil 'alamin\" (segala puji bagi Allah Tuhan seluruh alam). (Yunus\/10: 10)",
      "text_translation": "tetapi mereka mendengar ucapan salam.",
      "text": "اِلَّا قِيْلًا سَلٰمًا سَلٰمًا ",
      "text_translation_en": "but only the tiding of inner soundness and peace.",
      "juz_number": 27
    },
    "27": {
      "text_tafsir_en": "In this verse is described the position of the right-hander, a group of high rank and dignity. It is common in Arabic as well as in Indonesian, when explaining something important, it is usually repeated with a question mark. Therefore the importance of the right-handers is important, in this verse God emphasizes, \"And the right-handers, how happy are the right-handers.\" This was followed by a more detailed explanation of the pleasures and happiness of the right-handers.",
      "text_tafsir": "Dalam ayat ini diterangkan mengenai kedudukan golongan kanan, ialah suatu golongan yang mempunyai pangkat yang tinggi dan kedudukan yang mulia. Sudah menjadi kebiasaan dalam bahasa Arab dan juga dalam bahasa Indonesia, dalam menjelaskan sesuatu yang penting, biasa diulangi sebutannya dengan tanda tanya. Maka karena demikian pentingnya kedudukan golongan kanan, dalam ayat ini Allah menegaskan, \"Dan golongan kanan, alangkah bahagianya golongan kanan tersebut.\" Sesudah itu baru diiringi penjelasan yang lebih terperinci mengenai kenikmatan dan kebahagiaan dari golongan kanan tersebut.",
      "text_translation": "Dan golongan kanan, siapakah golongan kanan itu.",
      "text": "وَاَصْحٰبُ الْيَمِينِ ەۙ مَآ اَصْحٰبُ الْيَمِيْنِۗ",
      "text_translation_en": "NOW AS FOR those who have attained to righteous­ness - what of those who have attained to righteous­ness?",
      "juz_number": 27
    },
    "28": {
      "text_tafsir_en": "In this verse, it is described in detail that they were the right-handers, who received their deeds of charity with their right hand, the inhabitants of heaven who were to have fun and rejoice in the paradise of paradise in which there were prickly herbs and banana trees in order. They have fun under the shade of a variety of shady trees, where the flowing water and other trees with their delicate fruits bear fruit all the time without knowing the season, with delicious delicacies and fragrant flowering trees. it smells good that it can be enjoyed whenever and wherever they are, without anyone forbidding it.",
      "text_tafsir": "Dalam ayat ini, secara terperinci diterangkan bahwa mereka golongan kanan, yang menerima catatan amalnya dengan tangan kanannya adalah penghuni surga yang akan bersenangsenang dan bergembira dalam taman surga yang di antara pohonpohonnya terdapat pohon bidara yang tidak berduri dan pohon pisang yang bersusun-susun buahnya. Mereka bersuka-ria di bawah naungan berbagai macam pohon yang rindang, di mana tercurah air yang mengalir dan pohon-pohon yang lain dengan buahnya yang lezat serta berbuah sepanjang masa tanpa mengenal musim, dengan kelezatan cita rasanya dan pohon-pohon bunga yang wangi lagi semerbak harum baunya yang dapat menikmatinya kapan dan di mana pun mereka berada, tanpa ada yang melarang akan apa yang dikehendakinya.",
      "text_translation": "(Mereka) berada di antara pohon bidara yang tidak berduri,",
      "text": "فِيْ سِدْرٍ مَّخْضُوْدٍۙ  ",
      "text_translation_en": "[They, too, will find themselves] amidst fruit- laden lote-trees,",
      "juz_number": 27
    },
    "29": {
      "text_tafsir_en": "In this verse, it is described in detail that they were the right-handers, who received their deeds of charity with their right hand, the inhabitants of heaven who were to have fun and rejoice in the paradise of paradise in which there were prickly herbs and banana trees in order. They have fun under the shade of a variety of shady trees, where the flowing water and other trees with their delicate fruits bear fruit all the time without knowing the season, with delicious delicacies and fragrant flowering trees. it smells good that it can be enjoyed whenever and wherever they are, without anyone forbidding it.",
      "text_tafsir": "Dalam ayat ini, secara terperinci diterangkan bahwa mereka golongan kanan, yang menerima catatan amalnya dengan tangan kanannya adalah penghuni surga yang akan bersenangsenang dan bergembira dalam taman surga yang di antara pohonpohonnya terdapat pohon bidara yang tidak berduri dan pohon pisang yang bersusun-susun buahnya. Mereka bersuka-ria di bawah naungan berbagai macam pohon yang rindang, di mana tercurah air yang mengalir dan pohon-pohon yang lain dengan buahnya yang lezat serta berbuah sepanjang masa tanpa mengenal musim, dengan kelezatan cita rasanya dan pohon-pohon bunga yang wangi lagi semerbak harum baunya yang dapat menikmatinya kapan dan di mana pun mereka berada, tanpa ada yang melarang akan apa yang dikehendakinya.",
      "text_translation": "dan pohon pisang yang bersusun-susun (buahnya),",
      "text": "وَّطَلْحٍ مَّنْضُوْدٍۙ  ",
      "text_translation_en": "and acacias flower-clad,",
      "juz_number": 27
    },
    "30": {
      "text_tafsir_en": "In this verse, it is described in detail that they were the right-handers, who received their deeds of charity with their right hand, the inhabitants of heaven who were to have fun and rejoice in the paradise of paradise in which there were prickly herbs and banana trees in order. They have fun under the shade of a variety of shady trees, where the flowing water and other trees with their delicate fruits bear fruit all the time without knowing the season, with delicious delicacies and fragrant flowering trees. it smells good that it can be enjoyed whenever and wherever they are, without anyone forbidding it.",
      "text_tafsir": "Dalam ayat ini, secara terperinci diterangkan bahwa mereka golongan kanan, yang menerima catatan amalnya dengan tangan kanannya adalah penghuni surga yang akan bersenangsenang dan bergembira dalam taman surga yang di antara pohonpohonnya terdapat pohon bidara yang tidak berduri dan pohon pisang yang bersusun-susun buahnya. Mereka bersuka-ria di bawah naungan berbagai macam pohon yang rindang, di mana tercurah air yang mengalir dan pohon-pohon yang lain dengan buahnya yang lezat serta berbuah sepanjang masa tanpa mengenal musim, dengan kelezatan cita rasanya dan pohon-pohon bunga yang wangi lagi semerbak harum baunya yang dapat menikmatinya kapan dan di mana pun mereka berada, tanpa ada yang melarang akan apa yang dikehendakinya.",
      "text_translation": "dan naungan yang terbentang luas,",
      "text": "وَّظِلٍّ مَّمْدُوْدٍۙ  ",
      "text_translation_en": "and shade extended,",
      "juz_number": 27
    },
    "31": {
      "text_tafsir_en": "In this verse, it is described in detail that they were the right-handers, who received their deeds of charity with their right hand, the inhabitants of heaven who were to have fun and rejoice in the paradise of paradise in which there were prickly herbs and banana trees in order. They have fun under the shade of a variety of shady trees, where the flowing water and other trees with their delicate fruits bear fruit all the time without knowing the season, with delicious delicacies and fragrant flowering trees. it smells good that it can be enjoyed whenever and wherever they are, without anyone forbidding it.",
      "text_tafsir": "Dalam ayat ini, secara terperinci diterangkan bahwa mereka golongan kanan, yang menerima catatan amalnya dengan tangan kanannya adalah penghuni surga yang akan bersenangsenang dan bergembira dalam taman surga yang di antara pohonpohonnya terdapat pohon bidara yang tidak berduri dan pohon pisang yang bersusun-susun buahnya. Mereka bersuka-ria di bawah naungan berbagai macam pohon yang rindang, di mana tercurah air yang mengalir dan pohon-pohon yang lain dengan buahnya yang lezat serta berbuah sepanjang masa tanpa mengenal musim, dengan kelezatan cita rasanya dan pohon-pohon bunga yang wangi lagi semerbak harum baunya yang dapat menikmatinya kapan dan di mana pun mereka berada, tanpa ada yang melarang akan apa yang dikehendakinya.",
      "text_translation": "dan air yang mengalir terus-menerus,",
      "text": "وَّمَاۤءٍ مَّسْكُوْبٍۙ  ",
      "text_translation_en": "and waters gushing,",
      "juz_number": 27
    },
    "32": {
      "text_tafsir_en": "In this verse, it is described in detail that they were the right-handers, who received their deeds of charity with their right hand, the inhabitants of heaven who were to have fun and rejoice in the paradise of paradise in which there were prickly herbs and banana trees in order. They have fun under the shade of a variety of shady trees, where the flowing water and other trees with their delicate fruits bear fruit all the time without knowing the season, with delicious delicacies and fragrant flowering trees. it smells good that it can be enjoyed whenever and wherever they are, without anyone forbidding it.",
      "text_tafsir": "Dalam ayat ini, secara terperinci diterangkan bahwa mereka golongan kanan, yang menerima catatan amalnya dengan tangan kanannya adalah penghuni surga yang akan bersenangsenang dan bergembira dalam taman surga yang di antara pohonpohonnya terdapat pohon bidara yang tidak berduri dan pohon pisang yang bersusun-susun buahnya. Mereka bersuka-ria di bawah naungan berbagai macam pohon yang rindang, di mana tercurah air yang mengalir dan pohon-pohon yang lain dengan buahnya yang lezat serta berbuah sepanjang masa tanpa mengenal musim, dengan kelezatan cita rasanya dan pohon-pohon bunga yang wangi lagi semerbak harum baunya yang dapat menikmatinya kapan dan di mana pun mereka berada, tanpa ada yang melarang akan apa yang dikehendakinya.",
      "text_translation": "dan buah-buahan yang banyak,",
      "text": "وَّفَاكِهَةٍ كَثِيْرَةٍۙ  ",
      "text_translation_en": "and fruit abounding,",
      "juz_number": 27
    },
    "33": {
      "text_tafsir_en": "In this verse, it is described in detail that they were the right-handers, who received their deeds of charity with their right hand, the inhabitants of heaven who were to have fun and rejoice in the paradise of paradise in which there were prickly herbs and banana trees in order. They have fun under the shade of a variety of shady trees, where the flowing water and other trees with their delicate fruits bear fruit all the time without knowing the season, with delicious delicacies and fragrant flowering trees. it smells good that it can be enjoyed whenever and wherever they are, without anyone forbidding it.",
      "text_tafsir": "Dalam ayat ini, secara terperinci diterangkan bahwa mereka golongan kanan, yang menerima catatan amalnya dengan tangan kanannya adalah penghuni surga yang akan bersenangsenang dan bergembira dalam taman surga yang di antara pohonpohonnya terdapat pohon bidara yang tidak berduri dan pohon pisang yang bersusun-susun buahnya. Mereka bersuka-ria di bawah naungan berbagai macam pohon yang rindang, di mana tercurah air yang mengalir dan pohon-pohon yang lain dengan buahnya yang lezat serta berbuah sepanjang masa tanpa mengenal musim, dengan kelezatan cita rasanya dan pohon-pohon bunga yang wangi lagi semerbak harum baunya yang dapat menikmatinya kapan dan di mana pun mereka berada, tanpa ada yang melarang akan apa yang dikehendakinya.",
      "text_translation": "yang tidak berhenti berbuah dan tidak terlarang mengambilnya,",
      "text": "لَّا مَقْطُوْعَةٍ وَّلَا مَمْنُوْعَةٍۙ  ",
      "text_translation_en": "never-failing and never out of reach.",
      "juz_number": 27
    },
    "34": {
      "text_tafsir_en": "In these verses, the pleasure and excitement that the inhabitants of heaven enjoy in more detail are that they will sit on thick, soft and smooth mattresses that are made of silk, on golden and jeweled golden cot beds, by creating partners are beautiful and sacred, beautiful nymphs who never menstruate and become pregnant forever, who are always in a state of virginity of all time; The beautiful, graceful and beautiful nymphs dressed in silky and very attractive silks, with ornaments of bracelets, necklaces and earrings that add to their original beauty, coupled with the fragrant fragrance that is very tempting.",
      "text_tafsir": "Dalam ayat-ayat ini, lebih diperinci kesenangan dan kegembiraan yang dinikmati oleh para penghuni surga tersebut ialah bahwa mereka akan duduk di atas kasur tebal berlapis-lapis, empuk dan halus yang isinya terbuat dari sutra, di atas ranjang kencana yang bertahtakan emas dan permata, dengan diciptakan pasangannya ialah bidadari-bidadari yang cantik jelita dan suci tak pernah haid dan hamil selama-lamanya, yang selalu dalam keadaan perawan sepanjang masa; bidadari-bidadari yang cantik jelita dan lemah gemulai itu berpakaian serba sutra yang halus dan sangat menarik, dengan hiasan gelang, kalung, dan anting-anting yang menambah kecantikannya yang asli, ditambah lagi dengan semerbak harum wanginya yang sangat menggiurkan.",
      "text_translation": "dan kasur-kasur yang tebal lagi empuk.",
      "text": "وَّفُرُشٍ مَّرْفُوْعَةٍۗ  ",
      "text_translation_en": "And [with them will be their] spouses, raised high:",
      "juz_number": 27
    },
    "35": {
      "text_tafsir_en": "In these verses, the pleasure and excitement that the inhabitants of heaven enjoy in more detail are that they will sit on thick, soft and smooth mattresses that are made of silk, on golden and jeweled golden cot beds, by creating partners are beautiful and sacred, beautiful nymphs who never menstruate and become pregnant forever, who are always in a state of virginity of all time; The beautiful, graceful and beautiful nymphs dressed in silky and very attractive silks, with ornaments of bracelets, necklaces and earrings that add to their original beauty, coupled with the fragrant fragrance that is very tempting.",
      "text_tafsir": "Dalam ayat-ayat ini, lebih diperinci kesenangan dan kegembiraan yang dinikmati oleh para penghuni surga tersebut ialah bahwa mereka akan duduk di atas kasur tebal berlapis-lapis, empuk dan halus yang isinya terbuat dari sutra, di atas ranjang kencana yang bertahtakan emas dan permata, dengan diciptakan pasangannya ialah bidadari-bidadari yang cantik jelita dan suci tak pernah haid dan hamil selama-lamanya, yang selalu dalam keadaan perawan sepanjang masa; bidadari-bidadari yang cantik jelita dan lemah gemulai itu berpakaian serba sutra yang halus dan sangat menarik, dengan hiasan gelang, kalung, dan anting-anting yang menambah kecantikannya yang asli, ditambah lagi dengan semerbak harum wanginya yang sangat menggiurkan.",
      "text_translation": "Kami menciptakan mereka (bidadari-bidadari itu) secara langsung,",
      "text": "اِنَّآ اَنْشَأْنٰهُنَّ اِنْشَاۤءًۙ  ",
      "text_translation_en": "for, behold, We shall have brought them into being in a life renewed,",
      "juz_number": 27
    },
    "36": {
      "text_tafsir_en": "In these verses, the pleasure and excitement that the inhabitants of heaven enjoy in more detail are that they will sit on thick, soft and smooth mattresses that are made of silk, on golden and jeweled golden cot beds, by creating partners are beautiful and sacred, beautiful nymphs who never menstruate and become pregnant forever, who are always in a state of virginity of all time; The beautiful, graceful and beautiful nymphs dressed in silky and very attractive silks, with ornaments of bracelets, necklaces and earrings that add to their original beauty, coupled with the fragrant fragrance that is very tempting.",
      "text_tafsir": "Dalam ayat-ayat ini, lebih diperinci kesenangan dan kegembiraan yang dinikmati oleh para penghuni surga tersebut ialah bahwa mereka akan duduk di atas kasur tebal berlapis-lapis, empuk dan halus yang isinya terbuat dari sutra, di atas ranjang kencana yang bertahtakan emas dan permata, dengan diciptakan pasangannya ialah bidadari-bidadari yang cantik jelita dan suci tak pernah haid dan hamil selama-lamanya, yang selalu dalam keadaan perawan sepanjang masa; bidadari-bidadari yang cantik jelita dan lemah gemulai itu berpakaian serba sutra yang halus dan sangat menarik, dengan hiasan gelang, kalung, dan anting-anting yang menambah kecantikannya yang asli, ditambah lagi dengan semerbak harum wanginya yang sangat menggiurkan.",
      "text_translation": "lalu Kami jadikan mereka perawan-perawan,",
      "text": "فَجَعَلْنٰهُنَّ اَبْكَارًاۙ  ",
      "text_translation_en": "having resurrected them as virgins,",
      "juz_number": 27
    },
    "37": {
      "text_tafsir_en": "In these verses, the pleasure and excitement that the inhabitants of heaven enjoy in more detail are that they will sit on thick, soft and smooth mattresses that are made of silk, on golden and jeweled golden cot beds, by creating partners are beautiful and sacred, beautiful nymphs who never menstruate and become pregnant forever, who are always in a state of virginity of all time; The beautiful, graceful and beautiful nymphs dressed in silky and very attractive silks, with ornaments of bracelets, necklaces and earrings that add to their original beauty, coupled with the fragrant fragrance that is very tempting.",
      "text_tafsir": "Dalam ayat-ayat ini, lebih diperinci kesenangan dan kegembiraan yang dinikmati oleh para penghuni surga tersebut ialah bahwa mereka akan duduk di atas kasur tebal berlapis-lapis, empuk dan halus yang isinya terbuat dari sutra, di atas ranjang kencana yang bertahtakan emas dan permata, dengan diciptakan pasangannya ialah bidadari-bidadari yang cantik jelita dan suci tak pernah haid dan hamil selama-lamanya, yang selalu dalam keadaan perawan sepanjang masa; bidadari-bidadari yang cantik jelita dan lemah gemulai itu berpakaian serba sutra yang halus dan sangat menarik, dengan hiasan gelang, kalung, dan anting-anting yang menambah kecantikannya yang asli, ditambah lagi dengan semerbak harum wanginya yang sangat menggiurkan.",
      "text_translation": "yang penuh cinta (dan) sebaya umurnya,",
      "text": "عُرُبًا اَتْرَابًاۙ  ",
      "text_translation_en": "full of love, well-matched",
      "juz_number": 27
    },
    "38": {
      "text_tafsir_en": "Having described the many delights and pleasures provided for the inhabitants of heaven, the pleasures and pleasures never before seen by the eyes, never heard by anyone's ear and never even imagined, and obscured by the imagination and heart of any one. It is explained that the favor and enjoyment were provided to the right-handers who were mostly followers of the ancient prophets and apostles, and most of them were followers of the Prophet Muhammad.",
      "text_tafsir": "Setelah dijelaskan pelbagai nikmat dan kesenangan yang disediakan bagi penghuni surga, kenikmatan dan kesenangan yang belum pernah dilihat oleh mata, belum pernah didengar oleh telinga siapa pun dan bahkan belum pernah diduga, dan dilamunkan oleh khayalan dan hati siapa pun. Dijelaskan bahwa nikmat dan kesenangan tersebut disediakan untuk golongan kanan yang sebahagian besar terdiri dari umat-umat pengikut nabi dan rasul terdahulu, dan sebahagian besar lagi terdiri dari pengikut-pengikut Nabi Muhammad saw.",
      "text_translation": "untuk golongan kanan,",
      "text": "لِّاَصْحٰبِ الْيَمِيْنِۗ  ࣖ ",
      "text_translation_en": "with those who have attained to righteousness:",
      "juz_number": 27
    },
    "39": {
      "text_tafsir_en": "Having described the many delights and pleasures provided for the inhabitants of heaven, the pleasures and pleasures never before seen by the eyes, never heard by anyone's ear and never even imagined, and obscured by the imagination and heart of any one. It is explained that the favor and enjoyment were provided to the right-handers who were mostly followers of the ancient prophets and apostles, and most of them were followers of the Prophet Muhammad.",
      "text_tafsir": "Setelah dijelaskan pelbagai nikmat dan kesenangan yang disediakan bagi penghuni surga, kenikmatan dan kesenangan yang belum pernah dilihat oleh mata, belum pernah didengar oleh telinga siapa pun dan bahkan belum pernah diduga, dan dilamunkan oleh khayalan dan hati siapa pun. Dijelaskan bahwa nikmat dan kesenangan tersebut disediakan untuk golongan kanan yang sebahagian besar terdiri dari umat-umat pengikut nabi dan rasul terdahulu, dan sebahagian besar lagi terdiri dari pengikut-pengikut Nabi Muhammad saw.",
      "text_translation": "segolongan besar dari orang-orang yang terdahulu,",
      "text": "ثُلَّةٌ مِّنَ الْاَوَّلِيْنَۙ  ",
      "text_translation_en": "a good many of olden times,",
      "juz_number": 27
    },
    "40": {
      "text_tafsir_en": "Having described the many delights and pleasures provided for the inhabitants of heaven, the pleasures and pleasures never before seen by the eyes, never heard by anyone's ear and never even imagined, and obscured by the imagination and heart of any one. It is explained that the favor and enjoyment were provided to the right-handers who were mostly followers of the ancient prophets and apostles, and most of them were followers of the Prophet Muhammad.",
      "text_tafsir": "Setelah dijelaskan pelbagai nikmat dan kesenangan yang disediakan bagi penghuni surga, kenikmatan dan kesenangan yang belum pernah dilihat oleh mata, belum pernah didengar oleh telinga siapa pun dan bahkan belum pernah diduga, dan dilamunkan oleh khayalan dan hati siapa pun. Dijelaskan bahwa nikmat dan kesenangan tersebut disediakan untuk golongan kanan yang sebahagian besar terdiri dari umat-umat pengikut nabi dan rasul terdahulu, dan sebahagian besar lagi terdiri dari pengikut-pengikut Nabi Muhammad saw.",
      "text_translation": "dan segolongan besar pula dari orang yang kemudian.",
      "text": "وَثُلَّةٌ مِّنَ الْاٰخِرِيْنَۗ  ",
      "text_translation_en": "and a good many of later times.",
      "juz_number": 27
    },
    "41": {
      "text_tafsir_en": "In these verses God mentions ashabusy-syimal, and then repeats those words in the form of questioning with the purpose of defaming. Then describe the torment that will befall them: 1. The hot wind blows by bringing very hot air and stings the whole body. They ran for shelter from the smoke of hell. 2. The water provided for their drink is not cold water, but boiling water is infinite. 3. The cloud above them is like a cloud of clouds, from the black smoke of the fire which is very unpleasant and unpleasant. It is in accordance with the word of Allah: \"Go ye out of what ye had previously denied. Go ye in the shade of three branches that do not protect nor resist the flames of hell.\" Indeed, it (the fire) sparks the fireworks (as high and as high) as the yellow ostrich. Woe to that day, for those who deny (the truth). (alMursalat \/ 77: 29-34) The incredible heat of the sun and the black clouds which also added to the atmosphere was so great that it made them thirsty and unbearable and unbearable, forcing them to Drink as much as possible when the water you drink is hot and boiling like tin and copper. Thus, the torment and torment they experience are increasing.",
      "text_tafsir": "Pada ayat-ayat ini Allah menyebut ashabusy-syimal, kemudian diulang kata-kata itu dalam bentuk pertanyaan dengan maksud mencela. Kemudian diterangkan azab yang akan menimpa mereka yaitu: 1. Angin panas yang bertiup dengan membawa udara yang sangat panas dan menyengat seluruh tubuh. Mereka lari mencari naungan dari asap jahanam. 2. Air yang disediakan untuk minuman mereka bukan air yang sejuk, tetapi air mendidih yang panasnya tidak terhingga. 3. Awan yang ada di atas mereka berupa gumpalan awan, dari asap api neraka yang sangat hitam yang tidak menyejukkan dan tidak menyenangkan. Hal itu sesuai dengan firman Allah: \n\n(Akan dikatakan), \"Pergilah kamu mendapatkan apa (azab) yang dahulu kamu dustakan. Pergilah kamu mendapatkan naungan (asap api neraka) yang mempunyai tiga cabang yang tidak melindungi dan tidak pula menolak nyala api neraka.\" Sungguh, (neraka) itu menyemburkan bunga api (sebesar dan setinggi) istana, seakan-akan iring-iringan unta yang kuning. Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran). (alMursalat\/77: 29-34) \n\nAngin samum yang panas luar biasa dan awan hitam yang juga menambah suasana panas yang sangat luar biasa itulah yang menyebabkan mereka merasa haus dan dahaga yang tidak ada bandingannya dan yang sudah tidak tertahankan lagi, yang memaksa mereka untuk minum sebanyak-banyaknya walaupun air yang diminum itu adalah air yang panas dan mendidih bagaikan lumeran timah dan tembaga. Dengan demikian, semakin bertubi-tubilah penderitaan siksa dan azab yang mereka rasakan.",
      "text_translation": "Dan golongan kiri, alangkah sengsaranya golongan kiri itu.",
      "text": "وَاَصْحٰبُ الشِّمَالِ ەۙ مَآ اَصْحٰبُ الشِّمَالِۗ",
      "text_translation_en": "BUT AS FOR those who have persevered in evil - what of those who have persevered in evil?",
      "juz_number": 27
    },
    "42": {
      "text_tafsir_en": "In these verses God mentions ashabusy-syimal, and then repeats those words in the form of questioning with the purpose of defaming. Then describe the torment that will befall them: 1. The hot wind blows by bringing very hot air and stings the whole body. They ran for shelter from the smoke of hell. 2. The water provided for their drink is not cold water, but boiling water is infinite. 3. The cloud above them is like a cloud of clouds, from the black smoke of the fire which is very unpleasant and unpleasant. It is in accordance with the word of Allah: \"Go ye out of what ye had previously denied. Go ye in the shade of three branches that do not protect nor resist the flames of hell.\" Indeed, it (the fire) sparks the fireworks (as high and as high) as the yellow ostrich. Woe to that day, for those who deny (the truth). (alMursalat \/ 77: 29-34) The incredible heat of the sun and the black clouds which also added to the atmosphere was so great that it made them thirsty and unbearable and unbearable, forcing them to Drink as much as possible when the water you drink is hot and boiling like tin and copper. Thus, the torment and torment they experience are increasing.",
      "text_tafsir": "Pada ayat-ayat ini Allah menyebut ashabusy-syimal, kemudian diulang kata-kata itu dalam bentuk pertanyaan dengan maksud mencela. Kemudian diterangkan azab yang akan menimpa mereka yaitu: 1. Angin panas yang bertiup dengan membawa udara yang sangat panas dan menyengat seluruh tubuh. Mereka lari mencari naungan dari asap jahanam. 2. Air yang disediakan untuk minuman mereka bukan air yang sejuk, tetapi air mendidih yang panasnya tidak terhingga. 3. Awan yang ada di atas mereka berupa gumpalan awan, dari asap api neraka yang sangat hitam yang tidak menyejukkan dan tidak menyenangkan. Hal itu sesuai dengan firman Allah: \n\n(Akan dikatakan), \"Pergilah kamu mendapatkan apa (azab) yang dahulu kamu dustakan. Pergilah kamu mendapatkan naungan (asap api neraka) yang mempunyai tiga cabang yang tidak melindungi dan tidak pula menolak nyala api neraka.\" Sungguh, (neraka) itu menyemburkan bunga api (sebesar dan setinggi) istana, seakan-akan iring-iringan unta yang kuning. Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran). (alMursalat\/77: 29-34) \n\nAngin samum yang panas luar biasa dan awan hitam yang juga menambah suasana panas yang sangat luar biasa itulah yang menyebabkan mereka merasa haus dan dahaga yang tidak ada bandingannya dan yang sudah tidak tertahankan lagi, yang memaksa mereka untuk minum sebanyak-banyaknya walaupun air yang diminum itu adalah air yang panas dan mendidih bagaikan lumeran timah dan tembaga. Dengan demikian, semakin bertubi-tubilah penderitaan siksa dan azab yang mereka rasakan.",
      "text_translation": "(Mereka) dalam siksaan angin yang sangat panas dan air yang mendidih,",
      "text": "فِيْ سَمُوْمٍ وَّحَمِيْمٍۙ  ",
      "text_translation_en": "[They will find themselves] in the midst of scorching winds, and burning despair,",
      "juz_number": 27
    },
    "43": {
      "text_tafsir_en": "In these verses God mentions ashabusy-syimal, and then repeats those words in the form of questioning with the purpose of defaming. Then describe the torment that will befall them: 1. The hot wind blows by bringing very hot air and stings the whole body. They ran for shelter from the smoke of hell. 2. The water provided for their drink is not cold water, but boiling water is infinite. 3. The cloud above them is like a cloud of clouds, from the black smoke of the fire which is very unpleasant and unpleasant. It is in accordance with the word of Allah: \"Go ye out of what ye had previously denied. Go ye in the shade of three branches that do not protect nor resist the flames of hell.\" Indeed, it (the fire) sparks the fireworks (as high and as high) as the yellow ostrich. Woe to that day, for those who deny (the truth). (alMursalat \/ 77: 29-34) The incredible heat of the sun and the black clouds which also added to the atmosphere was so great that it made them thirsty and unbearable and unbearable, forcing them to Drink as much as possible when the water you drink is hot and boiling like tin and copper. Thus, the torment and torment they experience are increasing.",
      "text_tafsir": "Pada ayat-ayat ini Allah menyebut ashabusy-syimal, kemudian diulang kata-kata itu dalam bentuk pertanyaan dengan maksud mencela. Kemudian diterangkan azab yang akan menimpa mereka yaitu: 1. Angin panas yang bertiup dengan membawa udara yang sangat panas dan menyengat seluruh tubuh. Mereka lari mencari naungan dari asap jahanam. 2. Air yang disediakan untuk minuman mereka bukan air yang sejuk, tetapi air mendidih yang panasnya tidak terhingga. 3. Awan yang ada di atas mereka berupa gumpalan awan, dari asap api neraka yang sangat hitam yang tidak menyejukkan dan tidak menyenangkan. Hal itu sesuai dengan firman Allah: \n\n(Akan dikatakan), \"Pergilah kamu mendapatkan apa (azab) yang dahulu kamu dustakan. Pergilah kamu mendapatkan naungan (asap api neraka) yang mempunyai tiga cabang yang tidak melindungi dan tidak pula menolak nyala api neraka.\" Sungguh, (neraka) itu menyemburkan bunga api (sebesar dan setinggi) istana, seakan-akan iring-iringan unta yang kuning. Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran). (alMursalat\/77: 29-34) \n\nAngin samum yang panas luar biasa dan awan hitam yang juga menambah suasana panas yang sangat luar biasa itulah yang menyebabkan mereka merasa haus dan dahaga yang tidak ada bandingannya dan yang sudah tidak tertahankan lagi, yang memaksa mereka untuk minum sebanyak-banyaknya walaupun air yang diminum itu adalah air yang panas dan mendidih bagaikan lumeran timah dan tembaga. Dengan demikian, semakin bertubi-tubilah penderitaan siksa dan azab yang mereka rasakan.",
      "text_translation": "dan naungan asap yang hitam,",
      "text": "وَّظِلٍّ مِّنْ يَّحْمُوْمٍۙ  ",
      "text_translation_en": "and the shadows of black smoke -",
      "juz_number": 27
    },
    "44": {
      "text_tafsir_en": "In these verses God mentions ashabusy-syimal, and then repeats those words in the form of questioning with the purpose of defaming. Then describe the torment that will befall them: 1. The hot wind blows by bringing very hot air and stings the whole body. They ran for shelter from the smoke of hell. 2. The water provided for their drink is not cold water, but boiling water is infinite. 3. The cloud above them is like a cloud of clouds, from the black smoke of the fire which is very unpleasant and unpleasant. It is in accordance with the word of Allah: \"Go ye out of what ye had previously denied. Go ye in the shade of three branches that do not protect nor resist the flames of hell.\" Indeed, it (the fire) sparks the fireworks (as high and as high) as the yellow ostrich. Woe to that day, for those who deny (the truth). (alMursalat \/ 77: 29-34) The incredible heat of the sun and the black clouds which also added to the atmosphere was so great that it made them thirsty and unbearable and unbearable, forcing them to Drink as much as possible when the water you drink is hot and boiling like tin and copper. Thus, the torment and torment they experience are increasing.",
      "text_tafsir": "Pada ayat-ayat ini Allah menyebut ashabusy-syimal, kemudian diulang kata-kata itu dalam bentuk pertanyaan dengan maksud mencela. Kemudian diterangkan azab yang akan menimpa mereka yaitu: 1. Angin panas yang bertiup dengan membawa udara yang sangat panas dan menyengat seluruh tubuh. Mereka lari mencari naungan dari asap jahanam. 2. Air yang disediakan untuk minuman mereka bukan air yang sejuk, tetapi air mendidih yang panasnya tidak terhingga. 3. Awan yang ada di atas mereka berupa gumpalan awan, dari asap api neraka yang sangat hitam yang tidak menyejukkan dan tidak menyenangkan. Hal itu sesuai dengan firman Allah: \n\n(Akan dikatakan), \"Pergilah kamu mendapatkan apa (azab) yang dahulu kamu dustakan. Pergilah kamu mendapatkan naungan (asap api neraka) yang mempunyai tiga cabang yang tidak melindungi dan tidak pula menolak nyala api neraka.\" Sungguh, (neraka) itu menyemburkan bunga api (sebesar dan setinggi) istana, seakan-akan iring-iringan unta yang kuning. Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran). (alMursalat\/77: 29-34) \n\nAngin samum yang panas luar biasa dan awan hitam yang juga menambah suasana panas yang sangat luar biasa itulah yang menyebabkan mereka merasa haus dan dahaga yang tidak ada bandingannya dan yang sudah tidak tertahankan lagi, yang memaksa mereka untuk minum sebanyak-banyaknya walaupun air yang diminum itu adalah air yang panas dan mendidih bagaikan lumeran timah dan tembaga. Dengan demikian, semakin bertubi-tubilah penderitaan siksa dan azab yang mereka rasakan.",
      "text_translation": "tidak sejuk dan tidak menyenangkan.",
      "text": "لَّا بَارِدٍ وَّلَا كَرِيْمٍ ",
      "text_translation_en": "[shadows] neither cooling nor soothing.",
      "juz_number": 27
    },
    "45": {
      "text_tafsir_en": "In these verses Allah swt explains why those left-wingers suffer such painful torments. In the past, when they lived in the world, they were obliged to believe in Allah by performing various acts of righteousness and removing the prohibitions of their Lord, but what they did was: a. They live in luxury. b. They never stop committing serious sins. c. They deny that there is a resurrection.",
      "text_tafsir": "Dalam ayat-ayat ini Allah swt menjelaskan apa sebabnya mereka golongan kiri itu menerima siksa yang sedemikian pedihnya. Dahulu, sewaktu mereka hidup di dunia semestinya mereka wajib beriman kepada Allah dengan menjalankan pelbagai amal saleh serta menjauhkan larangan Tuhannya, tetapi yang mereka jalankan adalah sebaliknya, yaitu: \n\na. Mereka hidup bermewah-mewah. b. Mereka tidak berhenti-hentinya mengerjakan dosa besar. c. Mereka mengingkari adanya hari kebangkitan.",
      "text_translation": "Sesungguhnya mereka sebelum itu (dahulu) hidup bermewah-mewah,",
      "text": "اِنَّهُمْ كَانُوْا قَبْلَ ذٰلِكَ مُتْرَفِيْنَۚ ",
      "text_translation_en": "For, behold, in times gone by they were wont to abandon themselves wholly to the pursuit of pleasures,",
      "juz_number": 27
    },
    "46": {
      "text_tafsir_en": "In these verses Allah swt explains why those left-wingers suffer such painful torments. In the past, when they lived in the world, they were obliged to believe in Allah by performing various acts of righteousness and removing the prohibitions of their Lord, but what they did was: a. They live in luxury. b. They never stop committing serious sins. c. They deny that there is a resurrection.",
      "text_tafsir": "Dalam ayat-ayat ini Allah swt menjelaskan apa sebabnya mereka golongan kiri itu menerima siksa yang sedemikian pedihnya. Dahulu, sewaktu mereka hidup di dunia semestinya mereka wajib beriman kepada Allah dengan menjalankan pelbagai amal saleh serta menjauhkan larangan Tuhannya, tetapi yang mereka jalankan adalah sebaliknya, yaitu: \n\na. Mereka hidup bermewah-mewah. b. Mereka tidak berhenti-hentinya mengerjakan dosa besar. c. Mereka mengingkari adanya hari kebangkitan.",
      "text_translation": "dan mereka terus-menerus mengerjakan dosa yang besar,",
      "text": "وَكَانُوْا يُصِرُّوْنَ عَلَى الْحِنْثِ الْعَظِيْمِۚ  ",
      "text_translation_en": "and would persist in heinous sinning,",
      "juz_number": 27
    },
    "47": {
      "text_tafsir_en": "In these verses Allah swt explains why those left-wingers suffer such painful torments. In the past, when they lived in the world, they were obliged to believe in Allah by performing various acts of righteousness and removing the prohibitions of their Lord, but what they did was: a. They live in luxury. b. They never stop committing serious sins. c. They deny that there is a resurrection.",
      "text_tafsir": "Dalam ayat-ayat ini Allah swt menjelaskan apa sebabnya mereka golongan kiri itu menerima siksa yang sedemikian pedihnya. Dahulu, sewaktu mereka hidup di dunia semestinya mereka wajib beriman kepada Allah dengan menjalankan pelbagai amal saleh serta menjauhkan larangan Tuhannya, tetapi yang mereka jalankan adalah sebaliknya, yaitu: \n\na. Mereka hidup bermewah-mewah. b. Mereka tidak berhenti-hentinya mengerjakan dosa besar. c. Mereka mengingkari adanya hari kebangkitan.",
      "text_translation": "dan mereka berkata, “Apabila kami sudah mati, menjadi tanah dan tulang-belulang, apakah kami benar-benar akan dibangkitkan kembali?",
      "text": "وَكَانُوْا يَقُوْلُوْنَ ەۙ اَىِٕذَا مِتْنَا وَكُنَّا تُرَابًا وَّعِظَامًا ءَاِنَّا لَمَبْعُوْثُوْنَۙ",
      "text_translation_en": "and would say, “What! After we have died and become mere dust and bones, shall we, forsooth, be raised from the dead? -",
      "juz_number": 27
    },
    "48": {
      "text_tafsir_en": "In these verses Allah swt explains why those left-wingers suffer such painful torments. In the past, when they lived in the world, they were obliged to believe in Allah by performing various acts of righteousness and removing the prohibitions of their Lord, but what they did was: a. They live in luxury. b. They never stop committing serious sins. c. They deny that there is a resurrection.",
      "text_tafsir": "Dalam ayat-ayat ini Allah swt menjelaskan apa sebabnya mereka golongan kiri itu menerima siksa yang sedemikian pedihnya. Dahulu, sewaktu mereka hidup di dunia semestinya mereka wajib beriman kepada Allah dengan menjalankan pelbagai amal saleh serta menjauhkan larangan Tuhannya, tetapi yang mereka jalankan adalah sebaliknya, yaitu: \n\na. Mereka hidup bermewah-mewah. b. Mereka tidak berhenti-hentinya mengerjakan dosa besar. c. Mereka mengingkari adanya hari kebangkitan.",
      "text_translation": "Apakah nenek moyang kami yang terdahulu (dibangkitkan pula)?”",
      "text": "اَوَاٰبَاۤؤُنَا الْاَوَّلُوْنَ ",
      "text_translation_en": "and perhaps, too, our forebears of old?”",
      "juz_number": 27
    },
    "49": {
      "text_tafsir_en": "In connection with their ridicule and ridicule, God instructed His Messenger to give them a firm and straightforward answer, that indeed their forefathers whom they considered impossible to raise and their future grandchildren would not be raised, would surely gathered in the Field of Mahsar on the appointed day. There is no doubt that the gathering of countless people is even more amazing than the resurrection itself. In the same verse, God says: Then the return is but one blow. And then they are living again on the (new) earth. (anNazi'at \/ 79: 13-14)",
      "text_tafsir": "Berhubungan dengan ejekan dan cemoohan mereka itu, Allah memerintahkan kepada Rasul-Nya supaya memberikan jawaban yang tegas dan tandas, bahwa sesungguhnya nenek-moyang mereka yang mereka anggap mustahil dapat dibangkitkan dan anak cucu mereka kemudian yang mereka anggap tidak akan dibangkitkan, pasti benar semuanya akan dikumpulkan di Padang Mahsyar pada hari yang sudah ditentukan. Tidak ragu lagi bahwa berkumpulnya umat yang tidak terkira banyaknya itu lebih menakjubkan lagi daripada kebangkitan itu sendiri. Dalam ayat yang sama maksudnya Allah berfirman: \n\nMaka pengembalian itu hanyalah dengan sekali tiupan saja. Maka seketika itu mereka hidup kembali di bumi (yang baru). (anNazi'at\/79: 13-14)",
      "text_translation": "Katakanlah, “(Ya), sesungguhnya orang-orang yang terdahulu dan yang kemudian,",
      "text": "قُلْ اِنَّ الْاَوَّلِيْنَ وَالْاٰخِرِيْنَۙ ",
      "text_translation_en": "Say: “Verily, those of olden times and those of later times",
      "juz_number": 27
    },
    "50": {
      "text_tafsir_en": "In connection with their ridicule and ridicule, God instructed His Messenger to give them a firm and straightforward answer, that indeed their forefathers whom they considered impossible to raise and their future grandchildren would not be raised, would surely gathered in the Field of Mahsar on the appointed day. There is no doubt that the gathering of countless people is even more amazing than the resurrection itself. In the same verse, God says: Then the return is but one blow. And then they are living again on the (new) earth. (anNazi'at \/ 79: 13-14)",
      "text_tafsir": "Berhubungan dengan ejekan dan cemoohan mereka itu, Allah memerintahkan kepada Rasul-Nya supaya memberikan jawaban yang tegas dan tandas, bahwa sesungguhnya nenek-moyang mereka yang mereka anggap mustahil dapat dibangkitkan dan anak cucu mereka kemudian yang mereka anggap tidak akan dibangkitkan, pasti benar semuanya akan dikumpulkan di Padang Mahsyar pada hari yang sudah ditentukan. Tidak ragu lagi bahwa berkumpulnya umat yang tidak terkira banyaknya itu lebih menakjubkan lagi daripada kebangkitan itu sendiri. Dalam ayat yang sama maksudnya Allah berfirman: \n\nMaka pengembalian itu hanyalah dengan sekali tiupan saja. Maka seketika itu mereka hidup kembali di bumi (yang baru). (anNazi'at\/79: 13-14)",
      "text_translation": "pasti semua akan dikumpulkan pada waktu tertentu, pada hari yang sudah dimaklumi.",
      "text": "لَمَجْمُوْعُوْنَۙ اِلٰى مِيْقَاتِ يَوْمٍ مَّعْلُوْمٍ ",
      "text_translation_en": "will indeed be gathered together at an appointed time on a Day known [only to God]:",
      "juz_number": 27
    },
    "51": {
      "text_tafsir_en": "Then Allah explained to those who went astray, who always committed great sins by denying the apostles and denying the Day of Resurrection and the Day of Judgment, that they would really eat the fruit of the zaqqum tree, and because of the feeling of infinite hunger, not one or two zaqqum which they eat, but they eat their belly; and because thirst and thirst are unbearable anymore, they again drink very hot water like boiling lead and copper liquid, but they continue to drink like a camel that is very thirsty and very thirsty.",
      "text_tafsir": "Kemudian Allah menjelaskan kepada mereka yang sesat, yang senantiasa mengerjakan dosa besar dengan mendustakan para rasul dan mengingkari hari kebangkitan dan hari pembalasan, bahwa mereka benar-benar akan memakan buah pohon zaqqum, dan karena perasaan lapar yang tak terhingga, bukan satu dua buah zaqqum yang dimakannya, melainkan mereka memakan sepenuh perutnya; dan karena perasaan haus dan dahaga yang tidak tertahankan lagi, maka mereka kembali minum air yang sangat panas bagaikan cairan timah dan tembaga yang mendidih, namun mereka tetap minum terus bagaikan minumnya unta yang sangat haus dan sangat dahaga.",
      "text_translation": "Kemudian sesungguhnya kamu, wahai orang-orang yang sesat lagi mendustakan!",
      "text": "ثُمَّ اِنَّكُمْ اَيُّهَا الضَّاۤ لُّوْنَ الْمُكَذِّبُوْنَۙ  ",
      "text_translation_en": "and then, verily, O you who have gone astray and called the truth a lie,",
      "juz_number": 27
    },
    "52": {
      "text_tafsir_en": "Then Allah explained to those who went astray, who always committed great sins by denying the apostles and denying the Day of Resurrection and the Day of Judgment, that they would really eat the fruit of the zaqqum tree, and because of the feeling of infinite hunger, not one or two zaqqum which they eat, but they eat their belly; and because thirst and thirst are unbearable anymore, they again drink very hot water like boiling lead and copper liquid, but they continue to drink like a camel that is very thirsty and very thirsty.",
      "text_tafsir": "Kemudian Allah menjelaskan kepada mereka yang sesat, yang senantiasa mengerjakan dosa besar dengan mendustakan para rasul dan mengingkari hari kebangkitan dan hari pembalasan, bahwa mereka benar-benar akan memakan buah pohon zaqqum, dan karena perasaan lapar yang tak terhingga, bukan satu dua buah zaqqum yang dimakannya, melainkan mereka memakan sepenuh perutnya; dan karena perasaan haus dan dahaga yang tidak tertahankan lagi, maka mereka kembali minum air yang sangat panas bagaikan cairan timah dan tembaga yang mendidih, namun mereka tetap minum terus bagaikan minumnya unta yang sangat haus dan sangat dahaga.",
      "text_translation": "pasti akan memakan pohon zaqqum,",
      "text": "لَاٰكِلُوْنَ مِنْ شَجَرٍ مِّنْ زَقُّوْمٍۙ  ",
      "text_translation_en": "you will indeed have to taste of the tree of deadly fruit,",
      "juz_number": 27
    },
    "53": {
      "text_tafsir_en": "Then Allah explained to those who went astray, who always committed great sins by denying the apostles and denying the Day of Resurrection and the Day of Judgment, that they would really eat the fruit of the zaqqum tree, and because of the feeling of infinite hunger, not one or two zaqqum which they eat, but they eat their belly; and because thirst and thirst are unbearable anymore, they again drink very hot water like boiling lead and copper liquid, but they continue to drink like a camel that is very thirsty and very thirsty.",
      "text_tafsir": "Kemudian Allah menjelaskan kepada mereka yang sesat, yang senantiasa mengerjakan dosa besar dengan mendustakan para rasul dan mengingkari hari kebangkitan dan hari pembalasan, bahwa mereka benar-benar akan memakan buah pohon zaqqum, dan karena perasaan lapar yang tak terhingga, bukan satu dua buah zaqqum yang dimakannya, melainkan mereka memakan sepenuh perutnya; dan karena perasaan haus dan dahaga yang tidak tertahankan lagi, maka mereka kembali minum air yang sangat panas bagaikan cairan timah dan tembaga yang mendidih, namun mereka tetap minum terus bagaikan minumnya unta yang sangat haus dan sangat dahaga.",
      "text_translation": "maka akan penuh perutmu dengannya.",
      "text": "فَمَالِـُٔوْنَ مِنْهَا الْبُطُوْنَۚ  ",
      "text_translation_en": "and will have to fill your bellies therewith,",
      "juz_number": 27
    },
    "54": {
      "text_tafsir_en": "Then Allah explained to those who went astray, who always committed great sins by denying the apostles and denying the Day of Resurrection and the Day of Judgment, that they would really eat the fruit of the zaqqum tree, and because of the feeling of infinite hunger, not one or two zaqqum which they eat, but they eat their belly; and because thirst and thirst are unbearable anymore, they again drink very hot water like boiling lead and copper liquid, but they continue to drink like a camel that is very thirsty and very thirsty.",
      "text_tafsir": "Kemudian Allah menjelaskan kepada mereka yang sesat, yang senantiasa mengerjakan dosa besar dengan mendustakan para rasul dan mengingkari hari kebangkitan dan hari pembalasan, bahwa mereka benar-benar akan memakan buah pohon zaqqum, dan karena perasaan lapar yang tak terhingga, bukan satu dua buah zaqqum yang dimakannya, melainkan mereka memakan sepenuh perutnya; dan karena perasaan haus dan dahaga yang tidak tertahankan lagi, maka mereka kembali minum air yang sangat panas bagaikan cairan timah dan tembaga yang mendidih, namun mereka tetap minum terus bagaikan minumnya unta yang sangat haus dan sangat dahaga.",
      "text_translation": "Setelah itu kamu akan meminum air yang sangat panas.",
      "text": "فَشَارِبُوْنَ عَلَيْهِ مِنَ الْحَمِيْمِۚ  ",
      "text_translation_en": "and will thereupon have to drink [many a draught] of burning despair -",
      "juz_number": 27
    },
    "55": {
      "text_tafsir_en": "Then Allah explained to those who went astray, who always committed great sins by denying the apostles and denying the Day of Resurrection and the Day of Judgment, that they would really eat the fruit of the zaqqum tree, and because of the feeling of infinite hunger, not one or two zaqqum which they eat, but they eat their belly; and because thirst and thirst are unbearable anymore, they again drink very hot water like boiling lead and copper liquid, but they continue to drink like a camel that is very thirsty and very thirsty.",
      "text_tafsir": "Kemudian Allah menjelaskan kepada mereka yang sesat, yang senantiasa mengerjakan dosa besar dengan mendustakan para rasul dan mengingkari hari kebangkitan dan hari pembalasan, bahwa mereka benar-benar akan memakan buah pohon zaqqum, dan karena perasaan lapar yang tak terhingga, bukan satu dua buah zaqqum yang dimakannya, melainkan mereka memakan sepenuh perutnya; dan karena perasaan haus dan dahaga yang tidak tertahankan lagi, maka mereka kembali minum air yang sangat panas bagaikan cairan timah dan tembaga yang mendidih, namun mereka tetap minum terus bagaikan minumnya unta yang sangat haus dan sangat dahaga.",
      "text_translation": "Maka kamu minum seperti unta (yang sangat haus) minum.",
      "text": "فَشَارِبُوْنَ شُرْبَ الْهِيْمِۗ  ",
      "text_translation_en": "drink it as the most insatiably thirsty camels drink!”",
      "juz_number": 27
    },
    "56": {
      "text_tafsir_en": "In this verse Allah emphasizes that the fruit of the zaqqum tree and the hot beverage is the first meal prepared for the left. This is also the case in Surah ad-Dukhan verse 43 concerning the food provided for sinners. The left is the infidel or the sinner.",
      "text_tafsir": "Dalam ayat ini Allah menegaskan bahwa buah pohon zaqqum dan minuman air yang sangat panas itu adalah hidangan pertama yang disediakan untuk golongan kiri tersebut. Hal ini disebabkan juga dalam Surah ad-Dukhan ayat 43 berkenaan dengan makanan yang disediakan untuk orang yang berdosa. Golongan kiri adalah orang kafir atau yang berbuat dosa.",
      "text_translation": "Itulah hidangan untuk mereka pada hari pembalasan.”",
      "text": "هٰذَا نُزُلُهُمْ يَوْمَ الدِّيْنِۗ  ",
      "text_translation_en": "Such will be their welcome on Judgment Day!",
      "juz_number": 27
    },
    "57": {
      "text_tafsir_en": "In this verse God created man from nothing. Isn't that an irrefutable proposition of the power of God? And is that not a strong proposition that God Almighty is able to revive man from his grave after his death, and destroy his bones? It is an indisputable fact of the Day of Judgment, the day of man's resurrection from the grave; and this is a rejection of the disbelief of unbelievers and those who do not believe in the Day of Judgment, whose words are described in another verse: Will it really be resurrected? (al-Waqi'ah \/ 56: 47)",
      "text_tafsir": "Dalam ayat ini Allah menciptakan manusia dari tidak ada sama sekali. Bukankah hal tersebut suatu dalil yang tidak dapat dibantah lagi tentang kekuasaan Allah? Dan hal tersebut bukankah suatu dalil yang kuat bahwa Allah Mahakuasa untuk menghidupkan kembali manusia dari kuburnya setelah ia mati, dan hancur tulangbelulangnya? Hal tersebut adalah suatu kenyataan yang tidak dapat dibantah lagi tentang adanya hari Kiamat, hari kebangkitan manusia dari dalam kuburnya; dan hal tersebut adalah merupakan penolakan atas anggapan orang-orang kafir dan orang-orang yang tidak mempercayai adanya hari Kiamat, yang ucapan mereka digambarkan pada ayat lain: Dan mereka berkata, \"Apabila kami sudah mati, menjadi tanah dan tulang-belulang, apakah kami benar-benar akan dibangkitkan kembali? (al-Waqi'ah\/56: 47)",
      "text_translation": "Kami telah menciptakan kamu, mengapa kamu tidak membenarkan (hari berbangkit)?",
      "text": "نَحْنُ خَلَقْنٰكُمْ فَلَوْلَا تُصَدِّقُوْنَ ",
      "text_translation_en": "WE who have created you, [O men:] why, then, do you not accept the truth?",
      "juz_number": 27
    },
    "58": {
      "text_tafsir_en": "God emphasizes again the question of how infidels can process the event of semen (sperm) transmitted into the womb? Are they the ones who process the semen into a human being that is a body complete with body, head, legs and hands, which is complemented by the eyes, nose, mouth and ears or is it God who created it? Surely unbelievers cannot answer except to acknowledge that it is God who causes the semen to be human, and that God determines whether the semen is man or woman; Likewise, only God determines how old a person is. Was it not God who created man for the first time, nor the Almighty revived after his death, by raising him on the Day of Judgment to receive the most perfect reward.",
      "text_tafsir": "Allah menekankan lagi berupa pertanyaan bagaimana orang kafir dapat memproses kejadian air mani (sperma) yang dipancarkan ke dalam rahim? Merekakah yang memproses air mani itu menjadi manusia yaitu tubuh yang lengkap dengan badan, kepala, kaki dan tangan, yang dilengkapi pula dengan mata, hidung, mulut dan telinga ataukah Allah yang menciptakannya? Pastilah orang kafir tidak dapat menjawab kecuali mengakui bahwa sebenarnya Allah yang menyebabkan air mani tersebut menjadi manusia, dan Allah pula yang menentukan apakah air mani tersebut menjadi manusia pria atau wanita; demikian pula, hanya Allah sajalah yang menetapkan berapa umur manusia tersebut. Bukankah Allah yang berkuasa menciptakan manusia pertama kalinya, juga Mahakuasa menghidupkannya kembali sesudah matinya, dengan membangkitkannya pada hari Kiamat untuk menerima balasan yang paling sempurna.",
      "text_translation": "Maka adakah kamu perhatikan, tentang (benih manusia) yang kamu pancarkan.",
      "text": "اَفَرَءَيْتُمْ مَّا تُمْنُوْنَۗ  ",
      "text_translation_en": "Have you ever considered that [seed] which you emit?",
      "juz_number": 27
    },
    "59": {
      "text_tafsir_en": "God emphasizes again the question of how infidels can process the event of semen (sperm) transmitted into the womb? Are they the ones who process the semen into a human being that is a body complete with body, head, legs and hands, which is complemented by the eyes, nose, mouth and ears or is it God who created it? Surely unbelievers cannot answer except to acknowledge that it is God who causes the semen to be human, and that God determines whether the semen is man or woman; Likewise, only God determines how old a person is. Was it not God who created man for the first time, nor the Almighty revived after his death, by raising him on the Day of Judgment to receive the most perfect reward.",
      "text_tafsir": "Allah menekankan lagi berupa pertanyaan bagaimana orang kafir dapat memproses kejadian air mani (sperma) yang dipancarkan ke dalam rahim? Merekakah yang memproses air mani itu menjadi manusia yaitu tubuh yang lengkap dengan badan, kepala, kaki dan tangan, yang dilengkapi pula dengan mata, hidung, mulut dan telinga ataukah Allah yang menciptakannya? Pastilah orang kafir tidak dapat menjawab kecuali mengakui bahwa sebenarnya Allah yang menyebabkan air mani tersebut menjadi manusia, dan Allah pula yang menentukan apakah air mani tersebut menjadi manusia pria atau wanita; demikian pula, hanya Allah sajalah yang menetapkan berapa umur manusia tersebut. Bukankah Allah yang berkuasa menciptakan manusia pertama kalinya, juga Mahakuasa menghidupkannya kembali sesudah matinya, dengan membangkitkannya pada hari Kiamat untuk menerima balasan yang paling sempurna.",
      "text_translation": "Kamukah yang menciptakannya, ataukah Kami penciptanya?",
      "text": "ءَاَنْتُمْ تَخْلُقُوْنَهٗٓ اَمْ نَحْنُ الْخَالِقُوْنَ ",
      "text_translation_en": "Is it you who create it - or are We the source of its creation?",
      "juz_number": 27
    },
    "60": {
      "text_tafsir_en": "This verse explains that God has indeed determined the death of man, and that He has even appointed a specific time for the death of every human being, all of which is determined and determined by His will, a matter of wisdom and wisdom beyond human comprehension. Allah's decrees and decisions in creating or extinguishing one cannot be influenced or hindered by anyone. Similarly, God Almighty replaces mankind with other similar beings and Almighty does something that has never been done by humans, among others, resurrecting humanity from his grave, man cannot know when it will happen",
      "text_tafsir": "Ayat ini menjelaskan, bahwa sesungguhnya Allah menentukan kematian manusia, dan bahkan Ia telah menetapkan waktu tertentu bagi kematian setiap manusia, yang semuanya itu ditentukan dan ditetapkan menurut kehendak-Nya, suatu hal yang mengandung hikmah dan kebijaksanaan yang tidak dapat diketahui oleh manusia. Ketentuan dan ketetapan Allah dalam menciptakan atau mematikan seseorang tidaklah dapat dipengaruhi atau dihalang-halangi oleh siapa pun. Demikian juga Allah Mahakuasa untuk menggantikan suatu umat dengan umat lain yang serupa dan Mahakuasa melakukan sesuatu yang belum pernah dilakukan oleh manusia, antara lain membangkitkan manusia kembali dari kuburnya, manusia tidak dapat mengetahui kapan terjadinya",
      "text_translation": "Kami telah menentukan kematian masing-masing kamu dan Kami tidak lemah,",
      "text": "نَحْنُ قَدَّرْنَا بَيْنَكُمُ الْمَوْتَ وَمَا نَحْنُ بِمَسْبُوْقِيْنَۙ  ",
      "text_translation_en": "We have [indeed] decreed that death shall be [ever-present] among you: but there is nothing to prevent Us",
      "juz_number": 27
    },
    "61": {
      "text_tafsir_en": "This verse explains that God has indeed determined the death of man, and that He has even appointed a specific time for the death of every human being, all of which is determined and determined by His will, a matter of wisdom and wisdom beyond human comprehension. Allah's decrees and decisions in creating or extinguishing one cannot be influenced or hindered by anyone. Similarly, God Almighty replaces mankind with other similar beings and Almighty does something that has never been done by humans, among others, resurrecting humanity from his grave, man cannot know when it will happen",
      "text_tafsir": "Ayat ini menjelaskan, bahwa sesungguhnya Allah menentukan kematian manusia, dan bahkan Ia telah menetapkan waktu tertentu bagi kematian setiap manusia, yang semuanya itu ditentukan dan ditetapkan menurut kehendak-Nya, suatu hal yang mengandung hikmah dan kebijaksanaan yang tidak dapat diketahui oleh manusia. Ketentuan dan ketetapan Allah dalam menciptakan atau mematikan seseorang tidaklah dapat dipengaruhi atau dihalang-halangi oleh siapa pun. Demikian juga Allah Mahakuasa untuk menggantikan suatu umat dengan umat lain yang serupa dan Mahakuasa melakukan sesuatu yang belum pernah dilakukan oleh manusia, antara lain membangkitkan manusia kembali dari kuburnya, manusia tidak dapat mengetahui kapan terjadinya",
      "text_translation": "untuk menggantikan kamu dengan orang-orang yang seperti kamu (di dunia) dan membangkitkan kamu kelak (di akhirat) dalam keadaan yang tidak kamu ketahui.",
      "text": "عَلٰٓى اَنْ نُّبَدِّلَ اَمْثَالَكُمْ وَنُنْشِئَكُمْ فِيْ مَا لَا تَعْلَمُوْنَ",
      "text_translation_en": "from changing the nature of your existence and bringing you into being [anew] in a manner [as yet] unknown to you.",
      "juz_number": 27
    },
    "62": {
      "text_tafsir_en": "This verse explains that in fact man knew that it was Allah who created them from the beginning from nothing, and had never been called before. Try them to think and meditate that Almighty God created them in the first creation, surely He Almighty created them again in the second creation, namely that Almighty God raised them from the bones, for all eternity in the grave, Almighty God to bring life back to how it was before it died. It is even stated in another verse that raising a dead person from his grave is easier than creating it at the first time, as He said: And it was He who started the creation, then repeated it, and that was easier for Him. (ar-Rum \/ 30: 27). And do they not pay attention to how Allah began creation (creature), then He repeats it (again). Indeed, such is easy for God. Say, \"Walk the earth, then pay attention to how (Allah) started creation (creature), then Allah made the final event. Truly, Allah is Almighty over all things. (Al-'Ankabut \/ 29: 19-20)",
      "text_tafsir": "Ayat ini menjelaskan bahwa sesungguhnya manusia itu mengetahui bahwa Allah-lah yang menciptakan mereka dari semula dari sejak tidak ada, dan tidak pernah menjadi sebutan sebelumnya. Cobalah mereka pikirkan dan renungkan bahwa Allah yang Mahakuasa menciptakan mereka pada penciptaan yang pertama, tentunya Ia Mahakuasa menciptakan mereka lagi pada penciptaan yang kedua, yakni bahwa Allah Mahakuasa menghidupkan mereka dari tulang-belulang, yang sekian lamanya berada di alam kubur, Allah Mahakuasa untuk menghidupkan kembali seperti keadaan sebelum mati. Bahkan dinyatakan dalam ayat lain bahwa menghidupkan orang yang telah mati dari kuburnya itu lebih mudah daripada menciptakannya pada pertama kali, sebagaimana firman-Nya: \n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. (ar-Rum\/30: 27). \n\nDan apakah mereka tidak memperhatikan bagaimana Allah memulai penciptaan (makhluk), kemudian Dia mengulanginya (kembali). Sungguh, yang demikian itu mudah bagi Allah. Katakanlah, \"Berjalanlah di bumi, maka perhatikanlah bagaimana (Allah) memulai penciptaan (makhluk), kemudian Allah menjadikan kejadian yang akhir. Sungguh, Allah Mahakuasa atas segala sesuatu. (al-'Ankabut\/29: 19-20)",
      "text_translation": "Dan sungguh, kamu telah tahu penciptaan yang pertama, mengapa kamu tidak mengambil pelajaran?",
      "text": "وَلَقَدْ عَلِمْتُمُ النَّشْاَةَ الْاُوْلٰى فَلَوْلَا تَذَكَّرُوْنَ ",
      "text_translation_en": "And [since] you are indeed aware of the [miracle of your] coming into being in the first instance - why, then, do you not bethink yourselves [of Us]?",
      "juz_number": 27
    },
    "63": {
      "text_tafsir_en": "By asking questions, God reveals to humans that most of them forget the greatness of the blessings expressed, even though they feel the deliciousness of these favors of all time. God raises questions to humans, to think about and contemplate about the various plants grown by humans, both plants in the fields, fields, and seeds of trees planted on plantations. It was revealed that for all the plants mentioned above, the position of humans is only as a planter, fertilizing and maintaining it from various disturbances that bring harm. But most people forget who grew the plants. Who is it that increases the length of its roots into the ground, so that the tree can stand tall? Who grows their leaves and branches? Who also grows flowers and fruit? The questions collected in this verse are important questions that are often ignored by humans. Don't humans just hoe and loosen their soil? Are not humans just planting the seeds they have chosen as the best seeds? And aren't humans just watering, watering it, and cleaning it from various grasses and pests that interfere with its growth and aren't humans just cultivating it? But what is clear and clear and undoubtedly is that God grows plants, grows buds, grows trees, adds branches and twigs, and blooms flowers until they become fruit that humans can enjoy",
      "text_tafsir": "Dengan cara mengemukakan pertanyaan, Allah mengungkapkan kepada manusia bahwa sebagian besar dari mereka lupa akan keagungan nikmat yang diungkapkan tersebut, walaupun mereka merasakan kelezatan nikmat-nikmat tersebut sepanjang masa. Allah menyampaikan pertanyaan kepada manusia, untuk dipikirkan dan direnungkan mengenai berbagai tanaman yang ditanam oleh manusia, baik tanaman yang di sawah, ladang, maupun bibit pohon-pohonan yang ditanam di perkebunan. Diungkapkan bahwa bagi semua tanaman tersebut di atas, kedudukan manusia hanya sekadar sebagai penanamnya, memupuk dan memeliharanya dari berbagai gangguan yang membawa kerugian. Tetapi kebanyakan manusia lupa terhadap siapakah yang menumbuhkan tanaman tersebut. Siapakah yang menambah panjang akarnya menembus ke dalam tanah, sehingga pohon tersebut dapat berdiri tegak? Siapakah yang menumbuhkan daun dan dahannya? Siapa pula yang menumbuhkan bunga dan buahnya? Pertanyaan-pertanyaan yang dikumpulkan dalam ayat ini adalah soal-soal yang penting yang sering diabaikan oleh manusia. Bukankah manusia sekedar mencangkul dan menggemburkan tanahnya? Bukankah manusia sekedar menanamkan bibit yang telah dipilihnya sebagai bibit yang terbaik? Dan bukankah manusia sekedar menyiram, mengairinya, dan membersihkannya dari berbagai rumput dan hama yang mengganggu pertumbuhannya dan bukankah manusia sekedar memupuknya? Tetapi yang terang dan jelas serta tidak ragu-ragu lagi adalah bahwa Allah menumbuhkan tanaman tersebut, menumbuhkan tunas membesarkan pohon-pohonnya, menambah dahan dan ranting serta memekarkan bunga sampai menjadi buah yang bisa dinikmati manusia",
      "text_translation": "Pernahkah kamu perhatikan benih yang kamu tanam?",
      "text": "اَفَرَءَيْتُمْ مَّا تَحْرُثُوْنَۗ  ",
      "text_translation_en": "Have you ever considered the seed which you cast upon the soil?",
      "juz_number": 27
    },
    "64": {
      "text_tafsir_en": "By asking questions, God reveals to humans that most of them forget the greatness of the blessings expressed, even though they feel the deliciousness of these favors of all time. God raises questions to humans, to think about and contemplate about the various plants grown by humans, both plants in the fields, fields, and seeds of trees planted on plantations. It was revealed that for all the plants mentioned above, the position of humans is only as a planter, fertilizing and maintaining it from various disturbances that bring harm. But most people forget who grew the plants. Who is it that increases the length of its roots into the ground, so that the tree can stand tall? Who grows their leaves and branches? Who also grows flowers and fruit? The questions collected in this verse are important questions that are often ignored by humans. Don't humans just hoe and loosen their soil? Are not humans just planting the seeds they have chosen as the best seeds? And aren't humans just watering, watering it, and cleaning it from various grasses and pests that interfere with its growth and aren't humans just cultivating it? But what is clear and clear and undoubtedly is that God grows plants, grows buds, grows trees, adds branches and twigs, and blooms flowers until they become fruit that humans can enjoy",
      "text_tafsir": "Dengan cara mengemukakan pertanyaan, Allah mengungkapkan kepada manusia bahwa sebagian besar dari mereka lupa akan keagungan nikmat yang diungkapkan tersebut, walaupun mereka merasakan kelezatan nikmat-nikmat tersebut sepanjang masa. Allah menyampaikan pertanyaan kepada manusia, untuk dipikirkan dan direnungkan mengenai berbagai tanaman yang ditanam oleh manusia, baik tanaman yang di sawah, ladang, maupun bibit pohon-pohonan yang ditanam di perkebunan. Diungkapkan bahwa bagi semua tanaman tersebut di atas, kedudukan manusia hanya sekadar sebagai penanamnya, memupuk dan memeliharanya dari berbagai gangguan yang membawa kerugian. Tetapi kebanyakan manusia lupa terhadap siapakah yang menumbuhkan tanaman tersebut. Siapakah yang menambah panjang akarnya menembus ke dalam tanah, sehingga pohon tersebut dapat berdiri tegak? Siapakah yang menumbuhkan daun dan dahannya? Siapa pula yang menumbuhkan bunga dan buahnya? Pertanyaan-pertanyaan yang dikumpulkan dalam ayat ini adalah soal-soal yang penting yang sering diabaikan oleh manusia. Bukankah manusia sekedar mencangkul dan menggemburkan tanahnya? Bukankah manusia sekedar menanamkan bibit yang telah dipilihnya sebagai bibit yang terbaik? Dan bukankah manusia sekedar menyiram, mengairinya, dan membersihkannya dari berbagai rumput dan hama yang mengganggu pertumbuhannya dan bukankah manusia sekedar memupuknya? Tetapi yang terang dan jelas serta tidak ragu-ragu lagi adalah bahwa Allah menumbuhkan tanaman tersebut, menumbuhkan tunas membesarkan pohon-pohonnya, menambah dahan dan ranting serta memekarkan bunga sampai menjadi buah yang bisa dinikmati manusia",
      "text_translation": "Kamukah yang menumbuhkannya ataukah Kami yang menumbuhkan?",
      "text": "ءَاَنْتُمْ تَزْرَعُوْنَهٗٓ اَمْ نَحْنُ الزَّارِعُوْنَ ",
      "text_translation_en": "Is it you who cause it to grow - or are We the cause of its growth?",
      "juz_number": 27
    },
    "65": {
      "text_tafsir_en": "Then it was explained by God that although the plant is very good growth and its fruit which raises hope to bring abundant profits, but if God wants it to be different, then the expected plant can turn into plants that are not fruitful, empty or attacked by various diseases and pests, such as planthopper pests, rat pests, and so on, so that the owner is stunned and feel sad, because the benefits in the blink of an eye become an extraordinary loss. As for paying various expenses such as the costs of hoeing, planting, watering, fertilizing, and cleaning grass is a heavy burden and detrimental to him.",
      "text_tafsir": "Kemudian dijelaskan oleh Allah bahwa walaupun tanaman tersebut sangat baik pertumbuhan dan buahnya yang menimbulkan harapan untuk mendatangkan keuntungan berlimpah-limpah, namun apabila Allah menghendaki lain daripada itu, maka tanaman yang diharapkan itu dapat berubah menjadi tanaman yang tidak berbuah, hampa atau terserang berbagai macam penyakit dan hama, seperti hama wereng, hama tikus, dan sebagainya, sehingga pemiliknya tertegun dan merasa sedih, karena keuntungannya dalam sekejap mata menjadi kerugian yang luar biasa. Sedang untuk membayar berbagai macam pengeluaran seperti ongkos-ongkos mencangkul, menanam, menyiram, memupuk, dan membersihkan rumput merupakan beban berat dan merugikan baginya.",
      "text_translation": "Sekiranya Kami kehendaki, niscaya Kami hancurkan sampai lumat; maka kamu akan heran tercengang,",
      "text": "لَوْ نَشَاۤءُ لَجَعَلْنٰهُ حُطَامًا فَظَلْتُمْ تَفَكَّهُوْنَۙ  ",
      "text_translation_en": "[For,] were it Our will, We could indeed turn it into chaff, and you would be left to wonder [and to lament],",
      "juz_number": 27
    },
    "66": {
      "text_tafsir_en": "Then it was explained by God that although the plant is very good growth and its fruit which raises hope to bring abundant profits, but if God wants it to be different, then the expected plant can turn into plants that are not fruitful, empty or attacked by various diseases and pests, such as planthopper pests, rat pests, and so on, so that the owner is stunned and feel sad, because the benefits in the blink of an eye become an extraordinary loss. As for paying various expenses such as the costs of hoeing, planting, watering, fertilizing, and cleaning grass is a heavy burden and detrimental to him.",
      "text_tafsir": "Kemudian dijelaskan oleh Allah bahwa walaupun tanaman tersebut sangat baik pertumbuhan dan buahnya yang menimbulkan harapan untuk mendatangkan keuntungan berlimpah-limpah, namun apabila Allah menghendaki lain daripada itu, maka tanaman yang diharapkan itu dapat berubah menjadi tanaman yang tidak berbuah, hampa atau terserang berbagai macam penyakit dan hama, seperti hama wereng, hama tikus, dan sebagainya, sehingga pemiliknya tertegun dan merasa sedih, karena keuntungannya dalam sekejap mata menjadi kerugian yang luar biasa. Sedang untuk membayar berbagai macam pengeluaran seperti ongkos-ongkos mencangkul, menanam, menyiram, memupuk, dan membersihkan rumput merupakan beban berat dan merugikan baginya.",
      "text_translation": "(sambil berkata), “Sungguh, kami benar-benar menderita kerugian,",
      "text": "اِنَّا لَمُغْرَمُوْنَۙ  ",
      "text_translation_en": "“Verily, we are ruined!",
      "juz_number": 27
    },
    "67": {
      "text_tafsir_en": "Then it was explained by God that although the plant is very good growth and its fruit which raises hope to bring abundant profits, but if God wants it to be different, then the expected plant can turn into plants that are not fruitful, empty or attacked by various diseases and pests, such as planthopper pests, rat pests, and so on, so that the owner is stunned and feel sad, because the benefits in the blink of an eye become an extraordinary loss. As for paying various expenses such as the costs of hoeing, planting, watering, fertilizing, and cleaning grass is a heavy burden and detrimental to him.",
      "text_tafsir": "Kemudian dijelaskan oleh Allah bahwa walaupun tanaman tersebut sangat baik pertumbuhan dan buahnya yang menimbulkan harapan untuk mendatangkan keuntungan berlimpah-limpah, namun apabila Allah menghendaki lain daripada itu, maka tanaman yang diharapkan itu dapat berubah menjadi tanaman yang tidak berbuah, hampa atau terserang berbagai macam penyakit dan hama, seperti hama wereng, hama tikus, dan sebagainya, sehingga pemiliknya tertegun dan merasa sedih, karena keuntungannya dalam sekejap mata menjadi kerugian yang luar biasa. Sedang untuk membayar berbagai macam pengeluaran seperti ongkos-ongkos mencangkul, menanam, menyiram, memupuk, dan membersihkan rumput merupakan beban berat dan merugikan baginya.",
      "text_translation": "bahkan kami tidak mendapat hasil apa pun.”",
      "text": "بَلْ نَحْنُ مَحْرُوْمُوْنَ ",
      "text_translation_en": "Nay, but we have been deprived [of our livelihood]!”",
      "juz_number": 27
    },
    "68": {
      "text_tafsir_en": "In these verses God reveals one of His great blessings, for humans to ponder and think about whether they know about the function of the water they drink. Were those who brought the water down from the sky, that is the rain or Allah sent it down. Rain water when contemplated by humans, that it comes from water vapor exposed to the sun's heat. After becoming a cloud and then becoming a cloud that is very black and lumpy, then the water vapor drops as cool, fresh rainwater, not salty like sea water. The fresh water refreshes the body and removes thirst. If there is no rain, surely there will be no river flowing, there will not be a spring even though no matter how many meters deep the person dug a well, surely the water will not come out. If there is no water, grass will not grow, let alone plants planted by people. If there is no rain, surely there is no water that can be used by humans. If plants and plants do not grow, there is no livestock. There will be no chickens, there will be no buffalo and cows, there will be no goats and sheep. Because life requires eating and drinking. If nothing is eaten, and nothing is drunk, how can you live? And if there are no plants and plants, and no fresh water to drink, how can humans live? Do you have to eat land? And what will be drunk? If the water is made as salty by God, it certainly cannot eliminate thirst and cannot be used to water or irrigate plants. And who made the rain? Is it not only Allah who can make the rain fall and the well can drain water? Why do humans not thank God? Though He is the one who rains so many benefits as He said: He is the one who has sent water (rain) from the sky for you, some of it becomes a drink and some of it (fertilizes) plants, in which you feed your cattle. With that (rain) He grows for you plants, olives, dates, grapes and all kinds of fruits. Really, in that there really is a sign (the greatness of God) for people who think. (an-Nahl \/ 16: 10-11) In this connection there is a Hadith that reads: Verily the Prophet, when he finished drinking, said, \"Praise be to Allah for giving us refreshing fresh water with His grace and not making it salty because of our sins. \" (History of Ibn Abi hatim from Abu Ja'far) According to scientific studies, water that can be drunk and not harmful to human health is water that has sufficient salt and dissolved elements and is balanced, and does not contain toxic substances. Water that contains an amount of salt and dissolved elements that exceeds the need, for example sea water, if taken is harmful to health and can damage body organs. The government of each country usually has regulations that provide limits on water that can be drunk based on the analysis of the content of dissolved elements. Drinkable water is usually characterized by clear colors, fresh aromas and delicious tastes (see also: alFurqan \/ 25: 48). Drinkable water is water that is on land that comes from rain water. Seawater is not suitable for drinking unless it has been treated by distillation or ultrafiltration. This verse also reaffirms that Allah is the one who rains. Although technology has now developed to make artificial rain, but this technology can only be applied to certain atmospheric conditions that occur outside of human control, the most important requirement of which is the availability of adequate amount of water vapor in the air.",
      "text_tafsir": "Dalam ayat-ayat ini Allah mengungkapkan salah satu dari nikmat-Nya yang agung, untuk direnungkan dan dipikirkan oleh manusia apakah mereka mengetahui tentang fungsi air yang mereka minum. Apakah mereka yang menurunkan air itu dari langit yaitu air hujan ataukah Allah yang menurunkannya. Air hujan itu manakala direnungkan oleh manusia, bahwa ia berasal dari uap air yang terkena panas matahari. Setelah menjadi awan dan kemudian menjadi mendung yang sangat hitam bergumpal-gumpal, maka turunlah uap air itu sebagai air hujan yang sejuk dan tawar, tidak asin seperti air laut. Air tawar tersebut menyegarkan badan serta menghilangkan haus. Bila tidak ada hujan, pasti tidak ada sungai yang mengalir, tidak akan ada mata air walau berapa meter pun dalamnya orang menggali sumur, niscaya tidak akan keluar airnya. Bila tidak ada air, rumput pun tidak akan tumbuh, apalagi tanaman yang ditanam orang. Apabila tidak ada hujan, pasti tidak ada air yang dapat dimanfaatkan oleh manusia. Kalau tanaman dan tumbuh-tumbuhan tidak tumbuh, maka binatang ternak pun tidak ada. Tidak akan ada ayam, tidak akan ada kerbau dan sapi, tidak akan ada kambing dan domba. Sebab hidup memerlukan makan dan minum. Kalau tidak ada yang dimakan, dan tidak ada yang diminum, bagaimana bisa hidup? Dan kalau tidak ada tanaman dan tumbuh-tumbuhan, dan tidak ada air tawar untuk diminum, bagaimana manusia bisa hidup? Apakah mesti makan tanah? Dan apakah yang akan diminum? Jika air dijadikan Tuhan asin rasanya, pasti tidak bisa menghilangkan haus dan tidak dapat dipergunakan untuk menyiram atau mengairi tanaman. Dan siapakah yang menurunkan hujan tersebut? Bukankah hanya Allah saja yang dapat menurunkan hujan sehingga mengalir dan sumur dapat mengeluarkan air? Mengapakah manusia tidak bersyukur kepada Allah? Padahal Dialah yang menurunkan hujan yang demikian banyak manfaatnya sebagaimana firman-Nya: \n\nDialah yang telah menurunkan air (hujan) dari langit untuk kamu, sebagiannya menjadi minuman dan sebagiannya (menyuburkan) tumbuhan, padanya kamu menggembalakan ternakmu. Dengan (air hujan) itu Dia menumbuhkan untuk kamu tanam-tanaman, zaitun, kurma, anggur dan segala macam buah-buahan. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang berpikir. (an-Nahl\/16: 10-11) \n\nDalam hubungan ini terdapat hadis yang berbunyi: Sesungguhnya Nabi saw apabila selesai minum, beliau mengucapkan, \"Segala puji bagi Allah yang telah memberikan minuman kepada kita air tawar yang menyegarkan dengan rahmatNya dan tidak menjadikannya asin karena dosa kita.\" (Riwayat Ibnu Abi hatim dari Abu Ja'far) \n\nMenurut kajian ilmiah, air yang dapat diminum dan tidak membahayakan bagi kesehatan manusia adalah air yang mempunyai kandungan garam dan unsur-unsur terlarut cukup dan seimbang, serta tidak mengandung zat yang beracun. Air yang mengandung jumlah garam dan unsur-unsur terlarut yang melebihi keperluan, misalnya air laut, bila diminum berbahaya bagi kesehatan dan dapat merusak organ-organ tubuh. Pemerintah setiap negara biasanya memiliki peraturan yang memberikan batasan tentang air yang bisa diminum berdasarkan hasil analisis kandungan unsur-unsur yang terlarut. Air yang bisa diminum biasa dicirikan dengan warna yang jernih, aroma yang segar dan rasanya yang enak (lihat pula: alFurqan\/25: 48). Air yang bisa diminum adalah air yang berada di daratan yang berasal dari air hujan. Air laut tidak layak untuk diminum kecuali yang telah diolah melalui destilasi atau ultrafiltrasi. Ayat inipun menegaskan kembali bahwa Allah-lah yang menurunkan hujan. Meskipun sekarang telah berkembang teknologi untuk melakukan hujan buatan, tetapi teknologi ini hanya dapat diterapkan pada kondisi atmosfir tertentu yang terjadi di luar kendali manusia, syarat terpenting di antaranya adalah tersedianya uap air dalam jumlah yang memadai di udara.",
      "text_translation": "Pernahkah kamu memperhatikan air yang kamu minum?",
      "text": "اَفَرَءَيْتُمُ الْمَاۤءَ الَّذِيْ تَشْرَبُوْنَۗ  ",
      "text_translation_en": "Have you ever considered the water which you drink?",
      "juz_number": 27
    },
    "69": {
      "text_tafsir_en": "In these verses God reveals one of His great blessings, for humans to ponder and think about whether they know about the function of the water they drink. Were those who brought the water down from the sky, that is the rain or Allah sent it down. Rain water when contemplated by humans, that it comes from water vapor exposed to the sun's heat. After becoming a cloud and then becoming a cloud that is very black and lumpy, then the water vapor drops as cool, fresh rainwater, not salty like sea water. The fresh water refreshes the body and removes thirst. If there is no rain, surely there will be no river flowing, there will not be a spring even though no matter how many meters deep the person dug a well, surely the water will not come out. If there is no water, grass will not grow, let alone plants planted by people. If there is no rain, surely there is no water that can be used by humans. If plants and plants do not grow, there is no livestock. There will be no chickens, there will be no buffalo and cows, there will be no goats and sheep. Because life requires eating and drinking. If nothing is eaten, and nothing is drunk, how can you live? And if there are no plants and plants, and no fresh water to drink, how can humans live? Do you have to eat land? And what will be drunk? If the water is made as salty by God, it certainly cannot eliminate thirst and cannot be used to water or irrigate plants. And who made the rain? Is it not only Allah who can make the rain fall and the well can drain water? Why do humans not thank God? Though He is the one who rains so many benefits as He said: He is the one who has sent water (rain) from the sky for you, some of it becomes a drink and some of it (fertilizes) plants, in which you feed your cattle. With that (rain) He grows for you plants, olives, dates, grapes and all kinds of fruits. Really, in that there really is a sign (the greatness of God) for people who think. (an-Nahl \/ 16: 10-11) In this connection there is a Hadith that reads: Verily the Prophet, when he finished drinking, said, \"Praise be to Allah for giving us refreshing fresh water with His grace and not making it salty because of our sins. \" (History of Ibn Abi hatim from Abu Ja'far) According to scientific studies, water that can be drunk and not harmful to human health is water that has sufficient salt and dissolved elements and is balanced, and does not contain toxic substances. Water that contains an amount of salt and dissolved elements that exceeds the need, for example sea water, if taken is harmful to health and can damage body organs. The government of each country usually has regulations that provide limits on water that can be drunk based on the analysis of the content of dissolved elements. Drinkable water is usually characterized by clear colors, fresh aromas and delicious tastes (see also: alFurqan \/ 25: 48). Drinkable water is water that is on land that comes from rain water. Seawater is not suitable for drinking unless it has been treated by distillation or ultrafiltration. This verse also reaffirms that Allah is the one who rains. Although technology has now developed to make artificial rain, but this technology can only be applied to certain atmospheric conditions that occur outside of human control, the most important requirement of which is the availability of adequate amount of water vapor in the air.",
      "text_tafsir": "Dalam ayat-ayat ini Allah mengungkapkan salah satu dari nikmat-Nya yang agung, untuk direnungkan dan dipikirkan oleh manusia apakah mereka mengetahui tentang fungsi air yang mereka minum. Apakah mereka yang menurunkan air itu dari langit yaitu air hujan ataukah Allah yang menurunkannya. Air hujan itu manakala direnungkan oleh manusia, bahwa ia berasal dari uap air yang terkena panas matahari. Setelah menjadi awan dan kemudian menjadi mendung yang sangat hitam bergumpal-gumpal, maka turunlah uap air itu sebagai air hujan yang sejuk dan tawar, tidak asin seperti air laut. Air tawar tersebut menyegarkan badan serta menghilangkan haus. Bila tidak ada hujan, pasti tidak ada sungai yang mengalir, tidak akan ada mata air walau berapa meter pun dalamnya orang menggali sumur, niscaya tidak akan keluar airnya. Bila tidak ada air, rumput pun tidak akan tumbuh, apalagi tanaman yang ditanam orang. Apabila tidak ada hujan, pasti tidak ada air yang dapat dimanfaatkan oleh manusia. Kalau tanaman dan tumbuh-tumbuhan tidak tumbuh, maka binatang ternak pun tidak ada. Tidak akan ada ayam, tidak akan ada kerbau dan sapi, tidak akan ada kambing dan domba. Sebab hidup memerlukan makan dan minum. Kalau tidak ada yang dimakan, dan tidak ada yang diminum, bagaimana bisa hidup? Dan kalau tidak ada tanaman dan tumbuh-tumbuhan, dan tidak ada air tawar untuk diminum, bagaimana manusia bisa hidup? Apakah mesti makan tanah? Dan apakah yang akan diminum? Jika air dijadikan Tuhan asin rasanya, pasti tidak bisa menghilangkan haus dan tidak dapat dipergunakan untuk menyiram atau mengairi tanaman. Dan siapakah yang menurunkan hujan tersebut? Bukankah hanya Allah saja yang dapat menurunkan hujan sehingga mengalir dan sumur dapat mengeluarkan air? Mengapakah manusia tidak bersyukur kepada Allah? Padahal Dialah yang menurunkan hujan yang demikian banyak manfaatnya sebagaimana firman-Nya: \n\nDialah yang telah menurunkan air (hujan) dari langit untuk kamu, sebagiannya menjadi minuman dan sebagiannya (menyuburkan) tumbuhan, padanya kamu menggembalakan ternakmu. Dengan (air hujan) itu Dia menumbuhkan untuk kamu tanam-tanaman, zaitun, kurma, anggur dan segala macam buah-buahan. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang berpikir. (an-Nahl\/16: 10-11) \n\nDalam hubungan ini terdapat hadis yang berbunyi: Sesungguhnya Nabi saw apabila selesai minum, beliau mengucapkan, \"Segala puji bagi Allah yang telah memberikan minuman kepada kita air tawar yang menyegarkan dengan rahmatNya dan tidak menjadikannya asin karena dosa kita.\" (Riwayat Ibnu Abi hatim dari Abu Ja'far) \n\nMenurut kajian ilmiah, air yang dapat diminum dan tidak membahayakan bagi kesehatan manusia adalah air yang mempunyai kandungan garam dan unsur-unsur terlarut cukup dan seimbang, serta tidak mengandung zat yang beracun. Air yang mengandung jumlah garam dan unsur-unsur terlarut yang melebihi keperluan, misalnya air laut, bila diminum berbahaya bagi kesehatan dan dapat merusak organ-organ tubuh. Pemerintah setiap negara biasanya memiliki peraturan yang memberikan batasan tentang air yang bisa diminum berdasarkan hasil analisis kandungan unsur-unsur yang terlarut. Air yang bisa diminum biasa dicirikan dengan warna yang jernih, aroma yang segar dan rasanya yang enak (lihat pula: alFurqan\/25: 48). Air yang bisa diminum adalah air yang berada di daratan yang berasal dari air hujan. Air laut tidak layak untuk diminum kecuali yang telah diolah melalui destilasi atau ultrafiltrasi. Ayat inipun menegaskan kembali bahwa Allah-lah yang menurunkan hujan. Meskipun sekarang telah berkembang teknologi untuk melakukan hujan buatan, tetapi teknologi ini hanya dapat diterapkan pada kondisi atmosfir tertentu yang terjadi di luar kendali manusia, syarat terpenting di antaranya adalah tersedianya uap air dalam jumlah yang memadai di udara.",
      "text_translation": "Kamukah yang menurunkannya dari awan ataukah Kami yang menurunkan?",
      "text": "ءَاَنْتُمْ اَنْزَلْتُمُوْهُ مِنَ الْمُزْنِ اَمْ نَحْنُ الْمُنْزِلُوْنَ ",
      "text_translation_en": "Is it you who cause it to come down from the clouds - or are We the cause of its coming down?",
      "juz_number": 27
    },
    "70": {
      "text_tafsir_en": "In these verses God reveals one of His great blessings, for humans to ponder and think about whether they know about the function of the water they drink. Were those who brought the water down from the sky, that is the rain or Allah sent it down. Rain water when contemplated by humans, that it comes from water vapor exposed to the sun's heat. After becoming a cloud and then becoming a cloud that is very black and lumpy, then the water vapor drops as cool, fresh rainwater, not salty like sea water. The fresh water refreshes the body and removes thirst. If there is no rain, surely there will be no river flowing, there will not be a spring even though no matter how many meters deep the person dug a well, surely the water will not come out. If there is no water, grass will not grow, let alone plants planted by people. If there is no rain, surely there is no water that can be used by humans. If plants and plants do not grow, there is no livestock. There will be no chickens, there will be no buffalo and cows, there will be no goats and sheep. Because life requires eating and drinking. If nothing is eaten, and nothing is drunk, how can you live? And if there are no plants and plants, and no fresh water to drink, how can humans live? Do you have to eat land? And what will be drunk? If the water is made as salty by God, it certainly cannot eliminate thirst and cannot be used to water or irrigate plants. And who made the rain? Is it not only Allah who can make the rain fall and the well can drain water? Why do humans not thank God? Though He is the one who rains so many benefits as He said: He is the one who has sent water (rain) from the sky for you, some of it becomes a drink and some of it (fertilizes) plants, in which you feed your cattle. With that (rain) He grows for you plants, olives, dates, grapes and all kinds of fruits. Really, in that there really is a sign (the greatness of God) for people who think. (an-Nahl \/ 16: 10-11) In this connection there is a Hadith that reads: Verily the Prophet, when he finished drinking, said, \"Praise be to Allah for giving us refreshing fresh water with His grace and not making it salty because of our sins. \" (History of Ibn Abi hatim from Abu Ja'far) According to scientific studies, water that can be drunk and not harmful to human health is water that has sufficient salt and dissolved elements and is balanced, and does not contain toxic substances. Water that contains an amount of salt and dissolved elements that exceeds the need, for example sea water, if taken is harmful to health and can damage body organs. The government of each country usually has regulations that provide limits on water that can be drunk based on the analysis of the content of dissolved elements. Drinkable water is usually characterized by clear colors, fresh aromas and delicious tastes (see also: alFurqan \/ 25: 48). Drinkable water is water that is on land that comes from rain water. Seawater is not suitable for drinking unless it has been treated by distillation or ultrafiltration. This verse also reaffirms that Allah is the one who rains. Although technology has now developed to make artificial rain, but this technology can only be applied to certain atmospheric conditions that occur outside of human control, the most important requirement of which is the availability of adequate amount of water vapor in the air.",
      "text_tafsir": "Dalam ayat-ayat ini Allah mengungkapkan salah satu dari nikmat-Nya yang agung, untuk direnungkan dan dipikirkan oleh manusia apakah mereka mengetahui tentang fungsi air yang mereka minum. Apakah mereka yang menurunkan air itu dari langit yaitu air hujan ataukah Allah yang menurunkannya. Air hujan itu manakala direnungkan oleh manusia, bahwa ia berasal dari uap air yang terkena panas matahari. Setelah menjadi awan dan kemudian menjadi mendung yang sangat hitam bergumpal-gumpal, maka turunlah uap air itu sebagai air hujan yang sejuk dan tawar, tidak asin seperti air laut. Air tawar tersebut menyegarkan badan serta menghilangkan haus. Bila tidak ada hujan, pasti tidak ada sungai yang mengalir, tidak akan ada mata air walau berapa meter pun dalamnya orang menggali sumur, niscaya tidak akan keluar airnya. Bila tidak ada air, rumput pun tidak akan tumbuh, apalagi tanaman yang ditanam orang. Apabila tidak ada hujan, pasti tidak ada air yang dapat dimanfaatkan oleh manusia. Kalau tanaman dan tumbuh-tumbuhan tidak tumbuh, maka binatang ternak pun tidak ada. Tidak akan ada ayam, tidak akan ada kerbau dan sapi, tidak akan ada kambing dan domba. Sebab hidup memerlukan makan dan minum. Kalau tidak ada yang dimakan, dan tidak ada yang diminum, bagaimana bisa hidup? Dan kalau tidak ada tanaman dan tumbuh-tumbuhan, dan tidak ada air tawar untuk diminum, bagaimana manusia bisa hidup? Apakah mesti makan tanah? Dan apakah yang akan diminum? Jika air dijadikan Tuhan asin rasanya, pasti tidak bisa menghilangkan haus dan tidak dapat dipergunakan untuk menyiram atau mengairi tanaman. Dan siapakah yang menurunkan hujan tersebut? Bukankah hanya Allah saja yang dapat menurunkan hujan sehingga mengalir dan sumur dapat mengeluarkan air? Mengapakah manusia tidak bersyukur kepada Allah? Padahal Dialah yang menurunkan hujan yang demikian banyak manfaatnya sebagaimana firman-Nya: \n\nDialah yang telah menurunkan air (hujan) dari langit untuk kamu, sebagiannya menjadi minuman dan sebagiannya (menyuburkan) tumbuhan, padanya kamu menggembalakan ternakmu. Dengan (air hujan) itu Dia menumbuhkan untuk kamu tanam-tanaman, zaitun, kurma, anggur dan segala macam buah-buahan. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang berpikir. (an-Nahl\/16: 10-11) \n\nDalam hubungan ini terdapat hadis yang berbunyi: Sesungguhnya Nabi saw apabila selesai minum, beliau mengucapkan, \"Segala puji bagi Allah yang telah memberikan minuman kepada kita air tawar yang menyegarkan dengan rahmatNya dan tidak menjadikannya asin karena dosa kita.\" (Riwayat Ibnu Abi hatim dari Abu Ja'far) \n\nMenurut kajian ilmiah, air yang dapat diminum dan tidak membahayakan bagi kesehatan manusia adalah air yang mempunyai kandungan garam dan unsur-unsur terlarut cukup dan seimbang, serta tidak mengandung zat yang beracun. Air yang mengandung jumlah garam dan unsur-unsur terlarut yang melebihi keperluan, misalnya air laut, bila diminum berbahaya bagi kesehatan dan dapat merusak organ-organ tubuh. Pemerintah setiap negara biasanya memiliki peraturan yang memberikan batasan tentang air yang bisa diminum berdasarkan hasil analisis kandungan unsur-unsur yang terlarut. Air yang bisa diminum biasa dicirikan dengan warna yang jernih, aroma yang segar dan rasanya yang enak (lihat pula: alFurqan\/25: 48). Air yang bisa diminum adalah air yang berada di daratan yang berasal dari air hujan. Air laut tidak layak untuk diminum kecuali yang telah diolah melalui destilasi atau ultrafiltrasi. Ayat inipun menegaskan kembali bahwa Allah-lah yang menurunkan hujan. Meskipun sekarang telah berkembang teknologi untuk melakukan hujan buatan, tetapi teknologi ini hanya dapat diterapkan pada kondisi atmosfir tertentu yang terjadi di luar kendali manusia, syarat terpenting di antaranya adalah tersedianya uap air dalam jumlah yang memadai di udara.",
      "text_translation": "Sekiranya Kami menghendaki, niscaya Kami menjadikannya asin, mengapa kamu tidak bersyukur?",
      "text": "لَوْ نَشَاۤءُ جَعَلْنٰهُ اُجَاجًا فَلَوْلَا تَشْكُرُوْنَ ",
      "text_translation_en": "[It comes down sweet - but] were it Our will, We could make it burningly salty and bitter: why, then, do you not give thanks [unto Us]?",
      "juz_number": 27
    },
    "71": {
      "text_tafsir_en": "In this verse Allah reveals about the blessings which are almost forgotten by humans. The expression is in the form of questions for humans to think about and ponder, do humans know the importance of the function of fire? How to make a fire that was done in ancient times is by rubbing two sticks of wood, until burning, or by scraping steel on a rock, so that sparks of fire and accommodated the spark on kawul (a kind of blackish kapok attached to the palm fronds) that, which can then be used to light a fire in the kitchen to cook a variety of dishes that will be served for humans to enjoy, or a fire that is ignited according to the present way by etching a stick on a match, so he turns on. Or with a lighter that uses a small steel wheel as a rotator to be rotated on the flint and then the spark is accommodated on an axis moistened with gasoline, so that the flame is on. Or like the current way through a kerosene stove or with gas. Making fire in the way of the past and according to the way of the present, the question is who provided the wood or the fire stone, the steel, and the kawul or kerosene and gas? Also who provides gasoline and so on? Aren't the materials that cause the fire to burn in the form of firewood or kerosene, only Allah made Him? Even though rice, vegetables and side dishes are available, if there is no fire, we cannot eat them because they are still raw. How unpleasant, if the food is raw like, raw meat, and rice is still rice. How can taste arise when everything is completely raw? With this description, it is clear how important fire is for human needs. Because the fire is easily obtained every day, it is almost unthinkable to humans how that fire gives pleasure. It is almost rare that people are grateful and thankful for the fire. Because of the importance of the fire, Allah emphasizes that fire is used as a warning to humans and material that is useful for travelers in the desert, so it is natural for humans to glorify by calling on the name of the Great God.",
      "text_tafsir": "Dalam ayat ini Allah mengungkapkan tentang nikmat yang hampir dilupakan manusia. Ungkapan tersebut berbentuk pertanyaan untuk dipikirkan dan direnungkan oleh manusia, apakah manusia mengetahui pentingnya fungsi api? Cara membuat api yang dilakukan pada zaman purba adalah dengan cara menggosokgosokkan dua batang kayu, hingga menyala, atau dengan cara menggoreskan baja di atas batu, sehingga memercikkan api dan ditampung percikan tersebut pada kawul (semacam kapuk berwarna kehitam-hitaman yang melekat pada pelepah aren) tersebut, yang kemudian dapat dipergunakan untuk menyalakan api di dapur guna memasak berbagai masakan yang akan dihidangkan untuk dinikmati oleh manusia, atau api yang dinyalakan menurut cara sekarang dengan menggoreskan batang geretan pada korek api, maka nyalalah ia. Atau dengan korek yang mempergunakan roda baja kecil sebagai alat pemutar untuk diputarkan pada batu api kemudian percikannya ditampung pada sumbu yang dibasahi dengan bensin, sehingga sumbu nyala. Atau seperti cara yang sekarang ini melalui kompor minyak tanah atau dengan gas. Membuat api dengan cara zaman dahulu maupun menurut cara zaman sekarang, yang menjadi pertanyaan ialah siapakah yang menyediakan kayunya atau batu apinya, bajanya, dan kawulnya atau minyak tanah dan gas? Juga siapakah yang menyediakan bahan bensin dan sebagainya? Bukankah bahan-bahan yang menjadi sebab api menyala baik berupa kayu bakar maupun minyak tanah, hanyalah Allah saja yang menjadikan-Nya? Meskipun tersedia beras, sayur-mayur dan lauk-pauknya, bila tidak ada api, tidak dapat kita memakannya karena masih mentah. Alangkah tidak enaknya, kalau makanan tersebut mentah seperti, daging mentah, dan nasinya masih berupa beras. Bagaimanakah selera bisa timbul, kalau segala-galanya serba mentah? Dengan gambaran tersebut, jelaslah bagaimana pentingnya api bagi keperluan manusia. Karena api itu didapat dengan mudah setiap hari, maka hampir-hampir tidak terpikirkan oleh manusia betapa api itu memberi kenikmatan. Hampir-hampir jarang orang bersyukur dan berterima kasih atas adanya api. Karena pentingnya api itu, Allah menegaskan bahwa api dijadikan untuk peringatan bagi manusia dan bahan yang berguna bagi musafir di padang pasir, maka wajarlah manusia bertasbih dengan menyebut nama Tuhan Yang Mahabesar.",
      "text_translation": "Maka pernahkah kamu memperhatikan tentang api yang kamu nyalakan (dengan kayu)?",
      "text": "اَفَرَءَيْتُمُ النَّارَ الَّتِيْ تُوْرُوْنَۗ  ",
      "text_translation_en": "Have you ever considered the fire which you kindle?",
      "juz_number": 27
    },
    "72": {
      "text_tafsir_en": "In this verse Allah reveals about the blessings which are almost forgotten by humans. The expression is in the form of questions for humans to think about and ponder, do humans know the importance of the function of fire? How to make a fire that was done in ancient times is by rubbing two sticks of wood, until burning, or by scraping steel on a rock, so that sparks of fire and accommodated the spark on kawul (a kind of blackish kapok attached to the palm fronds) that, which can then be used to light a fire in the kitchen to cook a variety of dishes that will be served for humans to enjoy, or a fire that is ignited according to the present way by etching a stick on a match, so he turns on. Or with a lighter that uses a small steel wheel as a rotator to be rotated on the flint and then the spark is accommodated on an axis moistened with gasoline, so that the flame is on. Or like the current way through a kerosene stove or with gas. Making fire in the way of the past and according to the way of the present, the question is who provided the wood or the fire stone, the steel, and the kawul or kerosene and gas? Also who provides gasoline and so on? Aren't the materials that cause the fire to burn in the form of firewood or kerosene, only Allah made Him? Even though rice, vegetables and side dishes are available, if there is no fire, we cannot eat them because they are still raw. How unpleasant, if the food is raw like, raw meat, and rice is still rice. How can taste arise when everything is completely raw? With this description, it is clear how important fire is for human needs. Because the fire is easily obtained every day, it is almost unthinkable to humans how that fire gives pleasure. It is almost rare that people are grateful and thankful for the fire. Because of the importance of the fire, Allah emphasizes that fire is used as a warning to humans and material that is useful for travelers in the desert, so it is natural for humans to glorify by calling on the name of the Great God.",
      "text_tafsir": "Dalam ayat ini Allah mengungkapkan tentang nikmat yang hampir dilupakan manusia. Ungkapan tersebut berbentuk pertanyaan untuk dipikirkan dan direnungkan oleh manusia, apakah manusia mengetahui pentingnya fungsi api? Cara membuat api yang dilakukan pada zaman purba adalah dengan cara menggosokgosokkan dua batang kayu, hingga menyala, atau dengan cara menggoreskan baja di atas batu, sehingga memercikkan api dan ditampung percikan tersebut pada kawul (semacam kapuk berwarna kehitam-hitaman yang melekat pada pelepah aren) tersebut, yang kemudian dapat dipergunakan untuk menyalakan api di dapur guna memasak berbagai masakan yang akan dihidangkan untuk dinikmati oleh manusia, atau api yang dinyalakan menurut cara sekarang dengan menggoreskan batang geretan pada korek api, maka nyalalah ia. Atau dengan korek yang mempergunakan roda baja kecil sebagai alat pemutar untuk diputarkan pada batu api kemudian percikannya ditampung pada sumbu yang dibasahi dengan bensin, sehingga sumbu nyala. Atau seperti cara yang sekarang ini melalui kompor minyak tanah atau dengan gas. Membuat api dengan cara zaman dahulu maupun menurut cara zaman sekarang, yang menjadi pertanyaan ialah siapakah yang menyediakan kayunya atau batu apinya, bajanya, dan kawulnya atau minyak tanah dan gas? Juga siapakah yang menyediakan bahan bensin dan sebagainya? Bukankah bahan-bahan yang menjadi sebab api menyala baik berupa kayu bakar maupun minyak tanah, hanyalah Allah saja yang menjadikan-Nya? Meskipun tersedia beras, sayur-mayur dan lauk-pauknya, bila tidak ada api, tidak dapat kita memakannya karena masih mentah. Alangkah tidak enaknya, kalau makanan tersebut mentah seperti, daging mentah, dan nasinya masih berupa beras. Bagaimanakah selera bisa timbul, kalau segala-galanya serba mentah? Dengan gambaran tersebut, jelaslah bagaimana pentingnya api bagi keperluan manusia. Karena api itu didapat dengan mudah setiap hari, maka hampir-hampir tidak terpikirkan oleh manusia betapa api itu memberi kenikmatan. Hampir-hampir jarang orang bersyukur dan berterima kasih atas adanya api. Karena pentingnya api itu, Allah menegaskan bahwa api dijadikan untuk peringatan bagi manusia dan bahan yang berguna bagi musafir di padang pasir, maka wajarlah manusia bertasbih dengan menyebut nama Tuhan Yang Mahabesar.",
      "text_translation": "Kamukah yang menumbuhkan kayu itu ataukah Kami yang menumbuhkan?",
      "text": "ءَاَنْتُمْ اَنْشَأْتُمْ شَجَرَتَهَآ اَمْ نَحْنُ الْمُنْشِـُٔوْنَ ",
      "text_translation_en": "Is it you who have brought into being the tree that serves as its fuel - or are We the cause of its coming into being?",
      "juz_number": 27
    },
    "73": {
      "text_tafsir_en": "In this verse Allah reveals about the blessings which are almost forgotten by humans. The expression is in the form of questions for humans to think about and ponder, do humans know the importance of the function of fire? How to make a fire that was done in ancient times is by rubbing two sticks of wood, until burning, or by scraping steel on a rock, so that sparks of fire and accommodated the spark on kawul (a kind of blackish kapok attached to the palm fronds) that, which can then be used to light a fire in the kitchen to cook a variety of dishes that will be served for humans to enjoy, or a fire that is ignited according to the present way by etching a stick on a match, so he turns on. Or with a lighter that uses a small steel wheel as a rotator to be rotated on the flint and then the spark is accommodated on an axis moistened with gasoline, so that the flame is on. Or like the current way through a kerosene stove or with gas. Making fire in the way of the past and according to the way of the present, the question is who provided the wood or the fire stone, the steel, and the kawul or kerosene and gas? Also who provides gasoline and so on? Aren't the materials that cause the fire to burn in the form of firewood or kerosene, only Allah made Him? Even though rice, vegetables and side dishes are available, if there is no fire, we cannot eat them because they are still raw. How unpleasant, if the food is raw like, raw meat, and rice is still rice. How can taste arise when everything is completely raw? With this description, it is clear how important fire is for human needs. Because the fire is easily obtained every day, it is almost unthinkable to humans how that fire gives pleasure. It is almost rare that people are grateful and thankful for the fire. Because of the importance of the fire, Allah emphasizes that fire is used as a warning to humans and material that is useful for travelers in the desert, so it is natural for humans to glorify by calling on the name of the Great God.",
      "text_tafsir": "Dalam ayat ini Allah mengungkapkan tentang nikmat yang hampir dilupakan manusia. Ungkapan tersebut berbentuk pertanyaan untuk dipikirkan dan direnungkan oleh manusia, apakah manusia mengetahui pentingnya fungsi api? Cara membuat api yang dilakukan pada zaman purba adalah dengan cara menggosokgosokkan dua batang kayu, hingga menyala, atau dengan cara menggoreskan baja di atas batu, sehingga memercikkan api dan ditampung percikan tersebut pada kawul (semacam kapuk berwarna kehitam-hitaman yang melekat pada pelepah aren) tersebut, yang kemudian dapat dipergunakan untuk menyalakan api di dapur guna memasak berbagai masakan yang akan dihidangkan untuk dinikmati oleh manusia, atau api yang dinyalakan menurut cara sekarang dengan menggoreskan batang geretan pada korek api, maka nyalalah ia. Atau dengan korek yang mempergunakan roda baja kecil sebagai alat pemutar untuk diputarkan pada batu api kemudian percikannya ditampung pada sumbu yang dibasahi dengan bensin, sehingga sumbu nyala. Atau seperti cara yang sekarang ini melalui kompor minyak tanah atau dengan gas. Membuat api dengan cara zaman dahulu maupun menurut cara zaman sekarang, yang menjadi pertanyaan ialah siapakah yang menyediakan kayunya atau batu apinya, bajanya, dan kawulnya atau minyak tanah dan gas? Juga siapakah yang menyediakan bahan bensin dan sebagainya? Bukankah bahan-bahan yang menjadi sebab api menyala baik berupa kayu bakar maupun minyak tanah, hanyalah Allah saja yang menjadikan-Nya? Meskipun tersedia beras, sayur-mayur dan lauk-pauknya, bila tidak ada api, tidak dapat kita memakannya karena masih mentah. Alangkah tidak enaknya, kalau makanan tersebut mentah seperti, daging mentah, dan nasinya masih berupa beras. Bagaimanakah selera bisa timbul, kalau segala-galanya serba mentah? Dengan gambaran tersebut, jelaslah bagaimana pentingnya api bagi keperluan manusia. Karena api itu didapat dengan mudah setiap hari, maka hampir-hampir tidak terpikirkan oleh manusia betapa api itu memberi kenikmatan. Hampir-hampir jarang orang bersyukur dan berterima kasih atas adanya api. Karena pentingnya api itu, Allah menegaskan bahwa api dijadikan untuk peringatan bagi manusia dan bahan yang berguna bagi musafir di padang pasir, maka wajarlah manusia bertasbih dengan menyebut nama Tuhan Yang Mahabesar.",
      "text_translation": "Kami menjadikannya (api itu) untuk peringatan dan bahan yang berguna bagi musafir.",
      "text": "نَحْنُ جَعَلْنٰهَا تَذْكِرَةً وَّمَتَاعًا لِّلْمُقْوِيْنَۚ ",
      "text_translation_en": "It is We who have made it a means to remind [you of Us], and a comfort for all who are lost and hungry in the wilderness [of their lives].",
      "juz_number": 27
    },
    "74": {
      "text_tafsir_en": "In this verse Allah reveals about the blessings which are almost forgotten by humans. The expression is in the form of questions for humans to think about and ponder, do humans know the importance of the function of fire? How to make a fire that was done in ancient times is by rubbing two sticks of wood, until burning, or by scraping steel on a rock, so that sparks of fire and accommodated the spark on kawul (a kind of blackish kapok attached to the palm fronds) that, which can then be used to light a fire in the kitchen to cook a variety of dishes that will be served for humans to enjoy, or a fire that is ignited according to the present way by etching a stick on a match, so he turns on. Or with a lighter that uses a small steel wheel as a rotator to be rotated on the flint and then the spark is accommodated on an axis moistened with gasoline, so that the flame is on. Or like the current way through a kerosene stove or with gas. Making fire in the way of the past and according to the way of the present, the question is who provided the wood or the fire stone, the steel, and the kawul or kerosene and gas? Also who provides gasoline and so on? Aren't the materials that cause the fire to burn in the form of firewood or kerosene, only Allah made Him? Even though rice, vegetables and side dishes are available, if there is no fire, we cannot eat them because they are still raw. How unpleasant, if the food is raw like, raw meat, and rice is still rice. How can taste arise when everything is completely raw? With this description, it is clear how important fire is for human needs. Because the fire is easily obtained every day, it is almost unthinkable to humans how that fire gives pleasure. It is almost rare that people are grateful and thankful for the fire. Because of the importance of the fire, Allah emphasizes that fire is used as a warning to humans and material that is useful for travelers in the desert, so it is natural for humans to glorify by calling on the name of the Great God.",
      "text_tafsir": "Dalam ayat ini Allah mengungkapkan tentang nikmat yang hampir dilupakan manusia. Ungkapan tersebut berbentuk pertanyaan untuk dipikirkan dan direnungkan oleh manusia, apakah manusia mengetahui pentingnya fungsi api? Cara membuat api yang dilakukan pada zaman purba adalah dengan cara menggosokgosokkan dua batang kayu, hingga menyala, atau dengan cara menggoreskan baja di atas batu, sehingga memercikkan api dan ditampung percikan tersebut pada kawul (semacam kapuk berwarna kehitam-hitaman yang melekat pada pelepah aren) tersebut, yang kemudian dapat dipergunakan untuk menyalakan api di dapur guna memasak berbagai masakan yang akan dihidangkan untuk dinikmati oleh manusia, atau api yang dinyalakan menurut cara sekarang dengan menggoreskan batang geretan pada korek api, maka nyalalah ia. Atau dengan korek yang mempergunakan roda baja kecil sebagai alat pemutar untuk diputarkan pada batu api kemudian percikannya ditampung pada sumbu yang dibasahi dengan bensin, sehingga sumbu nyala. Atau seperti cara yang sekarang ini melalui kompor minyak tanah atau dengan gas. Membuat api dengan cara zaman dahulu maupun menurut cara zaman sekarang, yang menjadi pertanyaan ialah siapakah yang menyediakan kayunya atau batu apinya, bajanya, dan kawulnya atau minyak tanah dan gas? Juga siapakah yang menyediakan bahan bensin dan sebagainya? Bukankah bahan-bahan yang menjadi sebab api menyala baik berupa kayu bakar maupun minyak tanah, hanyalah Allah saja yang menjadikan-Nya? Meskipun tersedia beras, sayur-mayur dan lauk-pauknya, bila tidak ada api, tidak dapat kita memakannya karena masih mentah. Alangkah tidak enaknya, kalau makanan tersebut mentah seperti, daging mentah, dan nasinya masih berupa beras. Bagaimanakah selera bisa timbul, kalau segala-galanya serba mentah? Dengan gambaran tersebut, jelaslah bagaimana pentingnya api bagi keperluan manusia. Karena api itu didapat dengan mudah setiap hari, maka hampir-hampir tidak terpikirkan oleh manusia betapa api itu memberi kenikmatan. Hampir-hampir jarang orang bersyukur dan berterima kasih atas adanya api. Karena pentingnya api itu, Allah menegaskan bahwa api dijadikan untuk peringatan bagi manusia dan bahan yang berguna bagi musafir di padang pasir, maka wajarlah manusia bertasbih dengan menyebut nama Tuhan Yang Mahabesar.",
      "text_translation": "Maka bertasbihlah dengan (menyebut) nama Tuhanmu Yang Mahabesar.",
      "text": "فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيْمِ ࣖ ",
      "text_translation_en": "Extol, then, the limitless glory of thy Sus­tainer’s mighty name!",
      "juz_number": 27
    },
    "75": {
      "text_tafsir_en": "Some commentators explain this verse, that Allah swears by the coming down of portions of the Qur'an to show how important it is. The Qur'an was sent down at once from Lauh Mahfudz to the closest sky to the night of Laylat al-Qadr (a very glorious night). Then, lowered again gradually according to his needs from the heavens of the world to the Prophet Muhammad PBUH until it was completely finished in 22 years 2 months 22 days. The period of the descent of the Qur'an contains important meaning, the wisdom of falling in parts, that is, each surah or each verse, among others, so that each surah or verse can be understood more broadly and more deeply. Allah affirms that the oath in these parts of the Qur'an is very meaningful because it contains a sign of the great power of God and the perfection of His wisdom and the breadth of His mercy and does not waste His servants. In verse 75, Allah swears to convince His servants with something that illustrates His omnipotence over the universe, that is, \"a place where the stars circulate.\" Suppose that when humans are able to see how regularly the stars that are always moving in their respective orbits are safe and harmonious, surely they will have different opinions. With the development of science and technology, it is known that there are countless collections of stars in space. Astrophysics and astronomy experts explain that the naked eye would not be able to see the vast contents of the universe without borders. The Solar System which consists of millions of stars maybe even more (including our earth) is only a small part of the Milky Way Galaxy which contains more than 100 billion stars. The Milky Way is just one of more than 500 billion galaxies in the known universe, Subhan Allah! All of the stars circulate in their orbits, including our sun. As stated in the word of God: And the sun is circulating in its place of circulation. Such is the decree of the Almighty and Omniscient. (Yasin \/ 36: 38) Based on observations by experts, the sun moves at a high speed of about 720,000 km per hour toward the Vega star in one particular orbit in the Solar Apex system. Together with the sun, and all the planets and satellites that are in the environment of the Solar System (solar system) also move at the same distance. All these celestial bodies move to occupy the orbits that have been calculated. For how many millions of years, all of them 'swim' across their orbits in perfect balance and arrangement together with the others. Orbits in the universe are also owned by galaxies that move at great speeds in predetermined orbits. When moving, none of these celestial bodies intersects orbits or collides with other celestial bodies. However, this is clearly explained to humans in the Qur'an which was revealed at the time, because the Qur'an is actually the greeting of the Lord, the One Who Preserves and Preserves the Stability of the Universe.",
      "text_tafsir": "Sebagian ahli tafsir menjelaskan ayat ini, bahwa Allah bersumpah dengan masa turunnya bagian-bagian Al-Qur'an guna menunjukkan betapa pentingnya hal tersebut. Al-Qur'an diturunkan sekaligus dari Lauh Mahfudz ke langit paling dekat pada malam Lailatul Qadar (malam yang sangat mulia). Kemudian, diturunkan lagi secara berangsur-angsur menurut keperluannya dari langit dunia kepada Nabi Muhammad saw hingga selesai seluruhnya dalam masa 22 tahun 2 bulan 22 hari. Masa turunnya bagian-bagian Al-Qur'an tersebut mengandung arti penting, kebijaksanaan turunnya sebagian-sebagian yaitu tiap surah atau tiap ayat antara lain ialah agar tiap surah atau ayat itu dapat dimengerti secara lebih luas dan lebih mendalam. Allah menegaskan bahwa sumpah dalam bagian-bagian Al-Qur'an tersebut sangat besar artinya karena hal itu mengandung isyarat terhadap agungnya kekuasaan Allah dan kesempurnaan kebijaksanaan-Nya dan keluasan rahmat-Nya dan tidak menyianyiakan hamba-Nya. Dalam ayat 75, Allah bersumpah untuk meyakinkan terhadap hamba-hamba-Nya dengan sesuatu yang menggambarkan kemahakuasaan-Nya terhadap alam jagat raya ini, yakni suatu \"tempat beredarnya bintang-bintang.\" Andaikan ketika manusia mampu melihat bagaimana teraturnya bintang-bintang yang selalu bergerak pada orbitnya masing-masing dengan aman dan serasi, tentulah mereka akan berpendapat lain. Dengan semakin berkembangnya ilmu pengetahuan dan teknologi barulah diketahui betapa banyaknya kumpulan bintang-bintang di angkasa raya yang tidak terhitung jumlahnya. Para pakar astrofisika dan astronomi menjelaskan bahwa mata telanjang tidak akan mungkin mampu melihat isi jagat yang luas tidak berbatas. Sistem Tata Surya yang terdiri dari jutaan bintang bahkan mungkin lebih (termasuk di dalamnya bumi kita ini) hanyalah menjadi bagian kecil dari Galaksi Bimasakti yang memuat lebih dari 100 milyar bintang. Bimasakti pun itu hanyalah satu dari 500 milyar lebih galaksi dalam jagat raya yang diketahui, subhanallah! Semua bintang-bintang itu beredar pada orbitnya, termasuk matahari kita. Sebagaimana disebutkan dalam firman Allah: \n\nDan matahari beredar di tempat peredarannya. Demikianlah ketetapan yang Mahaperkasa dan Maha Mengetahui. (Yasin\/36: 38) \n\nBerdasarkan pengamatan para pakar, matahari bergerak dalam kecepatan yang tinggi kira-kira 720, 000 km per jam mengarah ke bintang Vega dalam satu orbit tertentu dalam sistem Solar Apex. Bersama-sama dengan matahari, dan semua planet dan satelit yang berada dalam lingkungan sistem Tata Surya (sistem solar) juga turut bergerak pada jarak yang sama. Semua benda-benda langit ini bergerak menempati orbit-orbit yang telah dihisab (diperhitungkan). Untuk berapa juta tahun, semuanya 'berenang' melintasi orbit masing-masing dalam keseimbangan dan susunan yang sempurna bersama-sama dengan yang lain. Orbit-orbit dalam alam semesta juga dimiliki oleh galaksi-galaksi yang bergerak pada kecepatan yang besar dalam orbit-orbit yang telah ditetapkan. Ketika bergerak, tidak ada satupun benda-benda langit ini yang memotong orbit atau bertabrakan dengan benda langit lainnya. Bagaimanapun, hal ini secara jelas diterangkan kepada manusia dalam Al-Qur'an yang diwahyukan ketika itu, karena Al-Qur'an sebenarnya adalah kalam dari Sang Penguasa, Yang Maha Menjaga dan Memelihara Kestabilan Alam Semesta ini.",
      "text_translation": "Lalu Aku bersumpah dengan tempat beredarnya bintang-bintang.",
      "text": "فَلَآ اُقْسِمُ بِمَوٰقِعِ النُّجُوْمِ ",
      "text_translation_en": "NAY, I call to witness the coming-down in parts [of this Qur’an]",
      "juz_number": 27
    },
    "76": {
      "text_tafsir_en": "Some commentators explain this verse, that Allah swears by the coming down of portions of the Qur'an to show how important it is. The Qur'an was sent down at once from Lauh Mahfudz to the closest sky to the night of Laylat al-Qadr (a very glorious night). Then, lowered again gradually according to his needs from the heavens of the world to the Prophet Muhammad PBUH until it was completely finished in 22 years 2 months 22 days. The period of the descent of the Qur'an contains important meaning, the wisdom of falling in parts, that is, each surah or each verse, among others, so that each surah or verse can be understood more broadly and more deeply. Allah affirms that the oath in these parts of the Qur'an is very meaningful because it contains a sign of the great power of God and the perfection of His wisdom and the breadth of His mercy and does not waste His servants. In verse 75, Allah swears to convince His servants with something that illustrates His omnipotence over the universe, that is, \"a place where the stars circulate.\" Suppose that when humans are able to see how regularly the stars that are always moving in their respective orbits are safe and harmonious, surely they will have different opinions. With the development of science and technology, it is known that there are countless collections of stars in space. Astrophysics and astronomy experts explain that the naked eye would not be able to see the vast contents of the universe without borders. The Solar System which consists of millions of stars maybe even more (including our earth) is only a small part of the Milky Way Galaxy which contains more than 100 billion stars. The Milky Way is just one of more than 500 billion galaxies in the known universe, Subhan Allah! All of the stars circulate in their orbits, including our sun. As stated in the word of God: And the sun is circulating in its place of circulation. Such is the decree of the Almighty and Omniscient. (Yasin \/ 36: 38) Based on observations by experts, the sun moves at a high speed of about 720,000 km per hour toward the Vega star in one particular orbit in the Solar Apex system. Together with the sun, and all the planets and satellites that are in the environment of the Solar System (solar system) also move at the same distance. All these celestial bodies move to occupy the orbits that have been calculated. For how many millions of years, all of them 'swim' across their orbits in perfect balance and arrangement together with the others. Orbits in the universe are also owned by galaxies that move at great speeds in predetermined orbits. When moving, none of these celestial bodies intersects orbits or collides with other celestial bodies. However, this is clearly explained to humans in the Qur'an which was revealed at the time, because the Qur'an is actually the greeting of the Lord, the One Who Preserves and Preserves the Stability of the Universe.",
      "text_tafsir": "Sebagian ahli tafsir menjelaskan ayat ini, bahwa Allah bersumpah dengan masa turunnya bagian-bagian Al-Qur'an guna menunjukkan betapa pentingnya hal tersebut. Al-Qur'an diturunkan sekaligus dari Lauh Mahfudz ke langit paling dekat pada malam Lailatul Qadar (malam yang sangat mulia). Kemudian, diturunkan lagi secara berangsur-angsur menurut keperluannya dari langit dunia kepada Nabi Muhammad saw hingga selesai seluruhnya dalam masa 22 tahun 2 bulan 22 hari. Masa turunnya bagian-bagian Al-Qur'an tersebut mengandung arti penting, kebijaksanaan turunnya sebagian-sebagian yaitu tiap surah atau tiap ayat antara lain ialah agar tiap surah atau ayat itu dapat dimengerti secara lebih luas dan lebih mendalam. Allah menegaskan bahwa sumpah dalam bagian-bagian Al-Qur'an tersebut sangat besar artinya karena hal itu mengandung isyarat terhadap agungnya kekuasaan Allah dan kesempurnaan kebijaksanaan-Nya dan keluasan rahmat-Nya dan tidak menyianyiakan hamba-Nya. Dalam ayat 75, Allah bersumpah untuk meyakinkan terhadap hamba-hamba-Nya dengan sesuatu yang menggambarkan kemahakuasaan-Nya terhadap alam jagat raya ini, yakni suatu \"tempat beredarnya bintang-bintang.\" Andaikan ketika manusia mampu melihat bagaimana teraturnya bintang-bintang yang selalu bergerak pada orbitnya masing-masing dengan aman dan serasi, tentulah mereka akan berpendapat lain. Dengan semakin berkembangnya ilmu pengetahuan dan teknologi barulah diketahui betapa banyaknya kumpulan bintang-bintang di angkasa raya yang tidak terhitung jumlahnya. Para pakar astrofisika dan astronomi menjelaskan bahwa mata telanjang tidak akan mungkin mampu melihat isi jagat yang luas tidak berbatas. Sistem Tata Surya yang terdiri dari jutaan bintang bahkan mungkin lebih (termasuk di dalamnya bumi kita ini) hanyalah menjadi bagian kecil dari Galaksi Bimasakti yang memuat lebih dari 100 milyar bintang. Bimasakti pun itu hanyalah satu dari 500 milyar lebih galaksi dalam jagat raya yang diketahui, subhanallah! Semua bintang-bintang itu beredar pada orbitnya, termasuk matahari kita. Sebagaimana disebutkan dalam firman Allah: \n\nDan matahari beredar di tempat peredarannya. Demikianlah ketetapan yang Mahaperkasa dan Maha Mengetahui. (Yasin\/36: 38) \n\nBerdasarkan pengamatan para pakar, matahari bergerak dalam kecepatan yang tinggi kira-kira 720, 000 km per jam mengarah ke bintang Vega dalam satu orbit tertentu dalam sistem Solar Apex. Bersama-sama dengan matahari, dan semua planet dan satelit yang berada dalam lingkungan sistem Tata Surya (sistem solar) juga turut bergerak pada jarak yang sama. Semua benda-benda langit ini bergerak menempati orbit-orbit yang telah dihisab (diperhitungkan). Untuk berapa juta tahun, semuanya 'berenang' melintasi orbit masing-masing dalam keseimbangan dan susunan yang sempurna bersama-sama dengan yang lain. Orbit-orbit dalam alam semesta juga dimiliki oleh galaksi-galaksi yang bergerak pada kecepatan yang besar dalam orbit-orbit yang telah ditetapkan. Ketika bergerak, tidak ada satupun benda-benda langit ini yang memotong orbit atau bertabrakan dengan benda langit lainnya. Bagaimanapun, hal ini secara jelas diterangkan kepada manusia dalam Al-Qur'an yang diwahyukan ketika itu, karena Al-Qur'an sebenarnya adalah kalam dari Sang Penguasa, Yang Maha Menjaga dan Memelihara Kestabilan Alam Semesta ini.",
      "text_translation": "Dan sesungguhnya itu benar-benar sumpah yang besar sekiranya kamu mengetahui,",
      "text": "وَاِنَّهٗ لَقَسَمٌ لَّوْ تَعْلَمُوْنَ عَظِيْمٌۙ  ",
      "text_translation_en": "and, behold, this is indeed a most solemn affirmation, if you but knew it!",
      "juz_number": 27
    },
    "77": {
      "text_tafsir_en": "God explains that this Qur'an is a divine revelation that contains infinite benefits and benefits and contains definite knowledge and guidance that brings happiness to mankind for life and the hereafter, and reads it including worship. The Qur'an is a source of monotheism, science, jurisprudence, and more. The Qur'an guarantees its purity, only the Messenger of al-Muqarrabin has ever touched it from the Far Mahfudz, the Angel of Gabriel assigned to deliver it to the Prophet Muhammad. Regarding verse 79, some interpreters disagree. No one touches it except the purified servants. (al-Waqi'ah \/ 56: 79) Jumhur scholars consider that this verse 79 prohibits those who contend, either small or large, from touching or holding the Qur'anic mushrooms, based on the hadith of Mu'adh bin Jabal, The Apostle said, \"It is impossible to touch mushaf except the saints.\" This is the opinion held by most Indonesian Muslims. There are two opinions on the law touching mushaf: 1. The four sects of the sect think that it is not possible to touch mushaf without wudu. According to Imam Nawawi, the word of Allah: la yamassuhu illal-muthahharun means not to touch this mushaf except the saint from the hadas. 2. The az-Â¨ahiri sect argues that it is possible to touch mushaf indefinitely on the grounds that the Messenger of Allah (may peace be upon him) sent a letter containing the Qur'anic verse to Heraklius when he was non-muslim and non-Muslim. Young children carry the Qur'anic writing place and books containing the Qur'an are allowed by scholars. God then explains that this Qur'an is actually descended from the God who rules over the universe. As a living guide to read, memorize, understand and practice. So it is very wrong for those who claim that the Qur'an is magic or poetry.",
      "text_tafsir": "Allah menjelaskan bahwa Al-Qur'an ini adalah wahyu ilahi yang mengandung faedah dan kemanfaatan yang tiada terhingga dan berisi ilmu serta petunjuk pasti yang membawa kebahagiaan kepada manusia untuk kehidupan dunia dan akhirat, dan membacanya termasuk ibadah. Al-Qur'an merupakan sumber ilmu tauhid, ilmu fiqih, ilmu tasawuf, dan lain-lain. Al-Qur'an terjamin kesuciannya, hanya Malaikat al-Muqarrabin yang pernah menyentuhnya dari Lauh Mahfudz, yaitu Malaikat Jibril yang ditugaskan menyampaikannya kepada Nabi Muhammad saw. Mengenai ayat 79, sebagian ahli tafsir berbeda pendapat. \n\nTidak ada yang menyentuhnya selain hamba-hamba yang disucikan. (al- Waqi'ah\/56: 79) \n\nJumhur ulama mengistimbatkan bahwa ayat 79 ini melarang orang-orang yang berhadas, baik hadas kecil maupun hadas besar, menyentuh atau memegang mushaf Al-Qur'an, berdasarkan hadis Mu'adh bin Jabal, Rasul bersabda, \"Tidak boleh menyentuh mushaf kecuali orang suci.\" Pendapat inilah yang dianut oleh sebagian besar umat Islam Indonesia. Ada dua pendapat tentang hukum menyentuh mushaf yaitu: 1. Imam empat mazhab berpendapat tidak boleh menyentuh mushaf tanpa wudu. Menurut Imam Nawawi, firman Allah: la yamassuhu illal-muthahharun bermakna tidak menyentuh mushaf ini kecuali orang suci dari hadas. 2. Mazhab az-Â¨ahiri berpendapat boleh menyentuh mushaf tanpa wudu dengan alasan bahwa Rasulullah saw pernah mengirim surat yang ada ayat Al-Qur'annya kepada Heraklius padahal dia non muslim dan tidak berwudu. Anak kecil membawa tempat menulis Al-Qur'an dan buku yang ada tulisan Al-Qur'an diperbolehkan oleh para ulama. Selanjutnya Allah menjelaskan bahwa Al-Qur'an ini sesungguhnya diturunkan dari Tuhan yang menguasai alam semesta. Sebagai pedoman hidup untuk dibaca, dihafal, dipahami dan diamalkan. Maka sungguh sesatlah orang-orang yang menuduh bahwa Al-Qur'an ini sihir atau syair.",
      "text_translation": "dan (ini) sesungguhnya Al-Qur'an yang sangat mulia,",
      "text": "اِنَّهٗ لَقُرْاٰنٌ كَرِيْمٌۙ  ",
      "text_translation_en": "Behold, it is a truly noble discourse,",
      "juz_number": 27
    },
    "78": {
      "text_tafsir_en": "God explains that this Qur'an is a divine revelation that contains infinite benefits and benefits and contains definite knowledge and guidance that brings happiness to mankind for life and the hereafter, and reads it including worship. The Qur'an is a source of monotheism, science, jurisprudence, and more. The Qur'an guarantees its purity, only the Messenger of al-Muqarrabin has ever touched it from the Far Mahfudz, the Angel of Gabriel assigned to deliver it to the Prophet Muhammad. Regarding verse 79, some interpreters disagree. No one touches it except the purified servants. (al-Waqi'ah \/ 56: 79) Jumhur scholars consider that this verse 79 prohibits those who contend, either small or large, from touching or holding the Qur'anic mushrooms, based on the hadith of Mu'adh bin Jabal, The Apostle said, \"It is impossible to touch mushaf except the saints.\" This is the opinion held by most Indonesian Muslims. There are two opinions on the law touching mushaf: 1. The four sects of the sect think that it is not possible to touch mushaf without wudu. According to Imam Nawawi, the word of Allah: la yamassuhu illal-muthahharun means not to touch this mushaf except the saint from the hadas. 2. The az-Â¨ahiri sect argues that it is possible to touch mushaf indefinitely on the grounds that the Messenger of Allah (may peace be upon him) sent a letter containing the Qur'anic verse to Heraklius when he was non-muslim and non-Muslim. Young children carry the Qur'anic writing place and books containing the Qur'an are allowed by scholars. God then explains that this Qur'an is actually descended from the God who rules over the universe. As a living guide to read, memorize, understand and practice. So it is very wrong for those who claim that the Qur'an is magic or poetry.",
      "text_tafsir": "Allah menjelaskan bahwa Al-Qur'an ini adalah wahyu ilahi yang mengandung faedah dan kemanfaatan yang tiada terhingga dan berisi ilmu serta petunjuk pasti yang membawa kebahagiaan kepada manusia untuk kehidupan dunia dan akhirat, dan membacanya termasuk ibadah. Al-Qur'an merupakan sumber ilmu tauhid, ilmu fiqih, ilmu tasawuf, dan lain-lain. Al-Qur'an terjamin kesuciannya, hanya Malaikat al-Muqarrabin yang pernah menyentuhnya dari Lauh Mahfudz, yaitu Malaikat Jibril yang ditugaskan menyampaikannya kepada Nabi Muhammad saw. Mengenai ayat 79, sebagian ahli tafsir berbeda pendapat. \n\nTidak ada yang menyentuhnya selain hamba-hamba yang disucikan. (al- Waqi'ah\/56: 79) \n\nJumhur ulama mengistimbatkan bahwa ayat 79 ini melarang orang-orang yang berhadas, baik hadas kecil maupun hadas besar, menyentuh atau memegang mushaf Al-Qur'an, berdasarkan hadis Mu'adh bin Jabal, Rasul bersabda, \"Tidak boleh menyentuh mushaf kecuali orang suci.\" Pendapat inilah yang dianut oleh sebagian besar umat Islam Indonesia. Ada dua pendapat tentang hukum menyentuh mushaf yaitu: 1. Imam empat mazhab berpendapat tidak boleh menyentuh mushaf tanpa wudu. Menurut Imam Nawawi, firman Allah: la yamassuhu illal-muthahharun bermakna tidak menyentuh mushaf ini kecuali orang suci dari hadas. 2. Mazhab az-Â¨ahiri berpendapat boleh menyentuh mushaf tanpa wudu dengan alasan bahwa Rasulullah saw pernah mengirim surat yang ada ayat Al-Qur'annya kepada Heraklius padahal dia non muslim dan tidak berwudu. Anak kecil membawa tempat menulis Al-Qur'an dan buku yang ada tulisan Al-Qur'an diperbolehkan oleh para ulama. Selanjutnya Allah menjelaskan bahwa Al-Qur'an ini sesungguhnya diturunkan dari Tuhan yang menguasai alam semesta. Sebagai pedoman hidup untuk dibaca, dihafal, dipahami dan diamalkan. Maka sungguh sesatlah orang-orang yang menuduh bahwa Al-Qur'an ini sihir atau syair.",
      "text_translation": "dalam Kitab yang terpelihara (Lauh Mahfuzh),",
      "text": "فِيْ كِتٰبٍ مَّكْنُوْنٍۙ ",
      "text_translation_en": "[conveyed unto man] in a well-guarded divine writ",
      "juz_number": 27
    },
    "79": {
      "text_tafsir_en": "God explains that this Qur'an is a divine revelation that contains infinite benefits and benefits and contains definite knowledge and guidance that brings happiness to mankind for life and the hereafter, and reads it including worship. The Qur'an is a source of monotheism, science, jurisprudence, and more. The Qur'an guarantees its purity, only the Messenger of al-Muqarrabin has ever touched it from the Far Mahfudz, the Angel of Gabriel assigned to deliver it to the Prophet Muhammad. Regarding verse 79, some interpreters disagree. No one touches it except the purified servants. (al-Waqi'ah \/ 56: 79) Jumhur scholars consider that this verse 79 prohibits those who contend, either small or large, from touching or holding the Qur'anic mushrooms, based on the hadith of Mu'adh bin Jabal, The Apostle said, \"It is impossible to touch mushaf except the saints.\" This is the opinion held by most Indonesian Muslims. There are two opinions on the law touching mushaf: 1. The four sects of the sect think that it is not possible to touch mushaf without wudu. According to Imam Nawawi, the word of Allah: la yamassuhu illal-muthahharun means not to touch this mushaf except the saint from the hadas. 2. The az-Â¨ahiri sect argues that it is possible to touch mushaf indefinitely on the grounds that the Messenger of Allah (may peace be upon him) sent a letter containing the Qur'anic verse to Heraklius when he was non-muslim and non-Muslim. Young children carry the Qur'anic writing place and books containing the Qur'an are allowed by scholars. God then explains that this Qur'an is actually descended from the God who rules over the universe. As a living guide to read, memorize, understand and practice. So it is very wrong for those who claim that the Qur'an is magic or poetry.",
      "text_tafsir": "Allah menjelaskan bahwa Al-Qur'an ini adalah wahyu ilahi yang mengandung faedah dan kemanfaatan yang tiada terhingga dan berisi ilmu serta petunjuk pasti yang membawa kebahagiaan kepada manusia untuk kehidupan dunia dan akhirat, dan membacanya termasuk ibadah. Al-Qur'an merupakan sumber ilmu tauhid, ilmu fiqih, ilmu tasawuf, dan lain-lain. Al-Qur'an terjamin kesuciannya, hanya Malaikat al-Muqarrabin yang pernah menyentuhnya dari Lauh Mahfudz, yaitu Malaikat Jibril yang ditugaskan menyampaikannya kepada Nabi Muhammad saw. Mengenai ayat 79, sebagian ahli tafsir berbeda pendapat. \n\nTidak ada yang menyentuhnya selain hamba-hamba yang disucikan. (al- Waqi'ah\/56: 79) \n\nJumhur ulama mengistimbatkan bahwa ayat 79 ini melarang orang-orang yang berhadas, baik hadas kecil maupun hadas besar, menyentuh atau memegang mushaf Al-Qur'an, berdasarkan hadis Mu'adh bin Jabal, Rasul bersabda, \"Tidak boleh menyentuh mushaf kecuali orang suci.\" Pendapat inilah yang dianut oleh sebagian besar umat Islam Indonesia. Ada dua pendapat tentang hukum menyentuh mushaf yaitu: 1. Imam empat mazhab berpendapat tidak boleh menyentuh mushaf tanpa wudu. Menurut Imam Nawawi, firman Allah: la yamassuhu illal-muthahharun bermakna tidak menyentuh mushaf ini kecuali orang suci dari hadas. 2. Mazhab az-Â¨ahiri berpendapat boleh menyentuh mushaf tanpa wudu dengan alasan bahwa Rasulullah saw pernah mengirim surat yang ada ayat Al-Qur'annya kepada Heraklius padahal dia non muslim dan tidak berwudu. Anak kecil membawa tempat menulis Al-Qur'an dan buku yang ada tulisan Al-Qur'an diperbolehkan oleh para ulama. Selanjutnya Allah menjelaskan bahwa Al-Qur'an ini sesungguhnya diturunkan dari Tuhan yang menguasai alam semesta. Sebagai pedoman hidup untuk dibaca, dihafal, dipahami dan diamalkan. Maka sungguh sesatlah orang-orang yang menuduh bahwa Al-Qur'an ini sihir atau syair.",
      "text_translation": "tidak ada yang menyentuhnya selain hamba-hamba yang disucikan.",
      "text": "لَّا يَمَسُّهٗٓ اِلَّا الْمُطَهَّرُوْنَۙ  ",
      "text_translation_en": "which none but the pure [of heart] can touch:",
      "juz_number": 27
    },
    "80": {
      "text_tafsir_en": "God explains that this Qur'an is a divine revelation that contains infinite benefits and benefits and contains definite knowledge and guidance that brings happiness to mankind for life and the hereafter, and reads it including worship. The Qur'an is a source of monotheism, science, jurisprudence, and more. The Qur'an guarantees its purity, only the Messenger of al-Muqarrabin has ever touched it from the Far Mahfudz, the Angel of Gabriel assigned to deliver it to the Prophet Muhammad. Regarding verse 79, some interpreters disagree. No one touches it except the purified servants. (al-Waqi'ah \/ 56: 79) Jumhur scholars consider that this verse 79 prohibits those who contend, either small or large, from touching or holding the Qur'anic mushrooms, based on the hadith of Mu'adh bin Jabal, The Apostle said, \"It is impossible to touch mushaf except the saints.\" This is the opinion held by most Indonesian Muslims. There are two opinions on the law touching mushaf: 1. The four sects of the sect think that it is not possible to touch mushaf without wudu. According to Imam Nawawi, the word of Allah: la yamassuhu illal-muthahharun means not to touch this mushaf except the saint from the hadas. 2. The az-Â¨ahiri sect argues that it is possible to touch mushaf indefinitely on the grounds that the Messenger of Allah (may peace be upon him) sent a letter containing the Qur'anic verse to Heraklius when he was non-muslim and non-Muslim. Young children carry the Qur'anic writing place and books containing the Qur'an are allowed by scholars. God then explains that this Qur'an is actually descended from the God who rules over the universe. As a living guide to read, memorize, understand and practice. So it is very wrong for those who claim that the Qur'an is magic or poetry.",
      "text_tafsir": "Allah menjelaskan bahwa Al-Qur'an ini adalah wahyu ilahi yang mengandung faedah dan kemanfaatan yang tiada terhingga dan berisi ilmu serta petunjuk pasti yang membawa kebahagiaan kepada manusia untuk kehidupan dunia dan akhirat, dan membacanya termasuk ibadah. Al-Qur'an merupakan sumber ilmu tauhid, ilmu fiqih, ilmu tasawuf, dan lain-lain. Al-Qur'an terjamin kesuciannya, hanya Malaikat al-Muqarrabin yang pernah menyentuhnya dari Lauh Mahfudz, yaitu Malaikat Jibril yang ditugaskan menyampaikannya kepada Nabi Muhammad saw. Mengenai ayat 79, sebagian ahli tafsir berbeda pendapat. \n\nTidak ada yang menyentuhnya selain hamba-hamba yang disucikan. (al- Waqi'ah\/56: 79) \n\nJumhur ulama mengistimbatkan bahwa ayat 79 ini melarang orang-orang yang berhadas, baik hadas kecil maupun hadas besar, menyentuh atau memegang mushaf Al-Qur'an, berdasarkan hadis Mu'adh bin Jabal, Rasul bersabda, \"Tidak boleh menyentuh mushaf kecuali orang suci.\" Pendapat inilah yang dianut oleh sebagian besar umat Islam Indonesia. Ada dua pendapat tentang hukum menyentuh mushaf yaitu: 1. Imam empat mazhab berpendapat tidak boleh menyentuh mushaf tanpa wudu. Menurut Imam Nawawi, firman Allah: la yamassuhu illal-muthahharun bermakna tidak menyentuh mushaf ini kecuali orang suci dari hadas. 2. Mazhab az-Â¨ahiri berpendapat boleh menyentuh mushaf tanpa wudu dengan alasan bahwa Rasulullah saw pernah mengirim surat yang ada ayat Al-Qur'annya kepada Heraklius padahal dia non muslim dan tidak berwudu. Anak kecil membawa tempat menulis Al-Qur'an dan buku yang ada tulisan Al-Qur'an diperbolehkan oleh para ulama. Selanjutnya Allah menjelaskan bahwa Al-Qur'an ini sesungguhnya diturunkan dari Tuhan yang menguasai alam semesta. Sebagai pedoman hidup untuk dibaca, dihafal, dipahami dan diamalkan. Maka sungguh sesatlah orang-orang yang menuduh bahwa Al-Qur'an ini sihir atau syair.",
      "text_translation": "Diturunkan dari Tuhan seluruh alam.",
      "text": "تَنْزِيْلٌ مِّنْ رَّبِّ الْعٰلَمِيْنَ ",
      "text_translation_en": "a revelation from the Sustainer of all the worlds!",
      "juz_number": 27
    },
    "81": {
      "text_tafsir_en": "Allah condemns those who look down on the Qur'an, who view it as ordinary human speech, and they also despise those who adhere to the Qur'an and do not defend it when others insult it. Further, Allah swt condemns those who do not appreciate the favors of God bestowed upon them, but they accept them in favor. In another verse the same meaning is that God says: And pray for them around the House, but nothing but applause and applause. (al-Anfal \/ 8: 35)",
      "text_tafsir": "Allah mencela orang-orang yang meremehkan Al-Qur'an, yang memandangnya sebagai ucapan manusia biasa, mereka juga mencemoohkan orang-orang yang berpegang kepada Al-Qur'an dan tidak membelanya bila ada orang-orang yang menghinanya. Selanjutnya Allah swt mencela orang yang tidak mensyukuri nikmat-nikmat Tuhan yang dikaruniakan kepada mereka, malahan nikmat-nikmat tersebut mereka sambut dengan mendustakannya. Dalam ayat yang lain yang sama maksudnya Allah berfirman: \n\nDan salat mereka di sekitar Baitullah itu, tidak lain hanyalah siulan dan tepuk tangan. (al-Anfal\/8: 35)",
      "text_translation": "Apakah kamu menganggap remeh berita ini (Al-Qur'an),",
      "text": "اَفَبِهٰذَا الْحَدِيْثِ اَنْتُمْ مُّدْهِنُوْنَ ",
      "text_translation_en": "Would you, now, look down with disdain on a tiding like this,",
      "juz_number": 27
    },
    "82": {
      "text_tafsir_en": "Allah condemns those who look down on the Qur'an, who view it as ordinary human speech, and they also despise those who adhere to the Qur'an and do not defend it when others insult it. Further, Allah swt condemns those who do not appreciate the favors of God bestowed upon them, but they accept them in favor. In another verse the same meaning is that God says: And pray for them around the House, but nothing but applause and applause. (al-Anfal \/ 8: 35)",
      "text_tafsir": "Allah mencela orang-orang yang meremehkan Al-Qur'an, yang memandangnya sebagai ucapan manusia biasa, mereka juga mencemoohkan orang-orang yang berpegang kepada Al-Qur'an dan tidak membelanya bila ada orang-orang yang menghinanya. Selanjutnya Allah swt mencela orang yang tidak mensyukuri nikmat-nikmat Tuhan yang dikaruniakan kepada mereka, malahan nikmat-nikmat tersebut mereka sambut dengan mendustakannya. Dalam ayat yang lain yang sama maksudnya Allah berfirman: \n\nDan salat mereka di sekitar Baitullah itu, tidak lain hanyalah siulan dan tepuk tangan. (al-Anfal\/8: 35)",
      "text_translation": "dan kamu menjadikan rezeki yang kamu terima (dari Allah) justru untuk mendustakan(-Nya).",
      "text": "وَتَجْعَلُوْنَ رِزْقَكُمْ اَنَّكُمْ تُكَذِّبُوْنَ ",
      "text_translation_en": "and make it your daily bread [as it were] to call the truth a lie?",
      "juz_number": 27
    },
    "83": {
      "text_tafsir_en": "These verses explain how terrible it would be if human life had reached its throat. Families in attendance just came to see and see the event as the last meeting. In the event, his family could not see an angel taking his brother's life, even though he was next to her. This situation illustrates that every human being cannot keep his spirit from the angels of death. This is proof that neither the spirit nor the body belong to man. (86-87) These verses describe the people who are in danger of dying, they are completely helpless, and while they have the will and ability, they can withstand their lives when they reach the throat, to bring them back to their original condition. when it is healthy. Their assumption is that the day of resurrection and retribution are gone. In fact they were helpless to hold their spirits when they reached their throats, but they rebelled. (88-94) This verse describes the condition of man after death. They are divided into 3 groups: 1. The people who are always close to Allah (al-muqarrabin) by performing various acts of worship and abandoning all His prohibitions. They will find triumph and happiness and enjoy a great sustenance and enjoyment, their dwelling place in heaven, where they will enjoy everything that has never been seen, heard by the ear, and flew into the heart. 2. The right-hand man (al-Abrar or Ashabul-yamin) who will receive his charity note with his right hand. They will be welcomed with joy by the angels as they greet their friends from Ashbel-yamin. In another verse, Allah says: Surely those who say, \"Our Lord is God\" and then they affirm their position, the angels will come down to them, saying, \"Do not be afraid, nor be dismayed; and rejoice in that which is promised to you. \" We are your protector in life and in the hereafter; in it (heaven) you get what you want and you get what you ask for. In honor of (the) Most Forgiving, Most Merciful. (Fussilat \/ 41: 30-32). 3. Those who disbelieve (Ashabusy-syimal) are those who disbelieve in Allah and His Messenger, so that they are led astray from the straight path and will receive the record of their deeds with their left hand. They will be placed in the flames of hellfire, given hot water, and eaten zaqqum, thus destroying the contents of their stomachs and skins.",
      "text_tafsir": "Ayat-ayat ini menjelaskan betapa ngerinya kalau nyawa manusia sudah sampai di tenggorokannya. Keluarga-keluarga yang hadir datang hanya untuk melihat dan menyaksikan peristiwa tersebut sebagai pertemuan terakhir. Dalam peristiwa tersebut, keluarganya tidak dapat menyaksikan malaikat yang mencabut nyawa saudaranya, padahal ia berada di sebelahnya. Keadaan ini menggambarkan bahwa setiap insan tidak dapat mempertahankan rohnya dari malaikat maut. Ini suatu bukti bahwa baik roh maupun jasad bukan milik manusia. (86-87) Ayat-ayat ini menerangkan tentang manusia yang sedang menghadapi sakratulmaut, mereka dalam keadaan sama sekali tidak berdaya, dan manakala mereka mempunyai kesanggupan dan kemampuan, tentulah mereka dapat menahan nyawa mereka ketika sampai di tenggorokan, untuk mengembalikannya kepada keadaan semula seperti ketika keadaan sehat. Anggapan mereka bahwa hari kebangkitan dan pembalasan semuanya itu tidak ada. Kenyataannya mereka tidak berdaya menahan rohnya ketika sampai di tenggorokannya, namun mereka membangkang. (88-94) Dalam ayat ini dijelaskan keadaan manusia setelah meninggal dunia. Mereka itu terbagi atas 3 golongan yaitu: 1. Golongan orang-orang yang selalu mendekatkan diri kepada Allah (al-muqarrabin) dengan mengerjakan berbagai macam ibadah dan meninggalkan segala larangan-Nya. Mereka ini akan mendapat kemenangan dan kegembiraan serta memperoleh rezeki yang luas dan macam-macam nikmat, tempat kediaman mereka di surga, di mana mereka akan menikmati di dalamnya segala sesuatu yang belum pernah dipandang oleh mata, didengar oleh telinga, dan terlintas di hati. 2. Golongan kanan yakni (al-Abrar atau Ashabul-yamin) yang akan menerima catatan amalnya dengan tangan kanannya. Mereka itu akan disambut dengan gembira oleh para malaikat sambil menyampaikan salam dari teman-teman mereka dari kalangan Ashabul-yamin. Dalam ayat lain, Allah berfirman: \n\nSesungguhnya orang-orang yang berkata, \"Tuhan kami adalah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat-malaikat akan turun kepada mereka (dengan berkata), \"Janganlah kamu merasa takut dan janganlah kamu bersedih hati; dan bergembiralah kamu dengan (memperoleh) surga yang telah dijanjikan kepadamu.\" Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya (surga) kamu memperoleh apa yang kamu inginkan dan memperoleh apa yang kamu minta. Sebagai penghormatan (bagimu) dari (Allah) Yang Maha Pengampun, Maha Penyayang. (Fussilat\/41: 30-32). 3. Golongan orang-orang kafir (Ashabusy-syimal) ialah yang mendustakan Allah dan Rasul-Nya, sehingga mereka tersesat dari jalan yang lurus dan akan menerima catatan amalnya dengan tangan kirinya. Mereka akan ditempatkan dalam api neraka yang berkobar-kobar nyalanya, diberi minum air yang sangat panas, dan makan buah zaqqum sehingga menghancurkan isi perut dan seluruh kulit badan mereka.",
      "text_translation": "Maka kalau begitu mengapa (tidak mencegah) ketika (nyawa) telah sampai di kerongkongan,",
      "text": "فَلَوْلَآ اِذَا بَلَغَتِ الْحُلْقُوْمَۙ  ",
      "text_translation_en": "Why, then, when [the last breath] comes up to the throat [of a dying man],",
      "juz_number": 27
    },
    "84": {
      "text_tafsir_en": "These verses explain how terrible it would be if human life had reached its throat. Families in attendance just came to see and see the event as the last meeting. In the event, his family could not see an angel taking his brother's life, even though he was next to her. This situation illustrates that every human being cannot keep his spirit from the angels of death. This is proof that neither the spirit nor the body belong to man. (86-87) These verses describe the people who are in danger of dying, they are completely helpless, and while they have the will and ability, they can withstand their lives when they reach the throat, to bring them back to their original condition. when it is healthy. Their assumption is that the day of resurrection and retribution are gone. In fact they were helpless to hold their spirits when they reached their throats, but they rebelled. (88-94) This verse describes the condition of man after death. They are divided into 3 groups: 1. The people who are always close to Allah (al-muqarrabin) by performing various acts of worship and abandoning all His prohibitions. They will find triumph and happiness and enjoy a great sustenance and enjoyment, their dwelling place in heaven, where they will enjoy everything that has never been seen, heard by the ear, and flew into the heart. 2. The right-hand man (al-Abrar or Ashabul-yamin) who will receive his charity note with his right hand. They will be welcomed with joy by the angels as they greet their friends from Ashbel-yamin. In another verse, Allah says: Surely those who say, \"Our Lord is God\" and then they affirm their position, the angels will come down to them, saying, \"Do not be afraid, nor be dismayed; and rejoice in that which is promised to you. \" We are your protector in life and in the hereafter; in it (heaven) you get what you want and you get what you ask for. In honor of (the) Most Forgiving, Most Merciful. (Fussilat \/ 41: 30-32). 3. Those who disbelieve (Ashabusy-syimal) are those who disbelieve in Allah and His Messenger, so that they are led astray from the straight path and will receive the record of their deeds with their left hand. They will be placed in the flames of hellfire, given hot water, and eaten zaqqum, thus destroying the contents of their stomachs and skins.",
      "text_tafsir": "Ayat-ayat ini menjelaskan betapa ngerinya kalau nyawa manusia sudah sampai di tenggorokannya. Keluarga-keluarga yang hadir datang hanya untuk melihat dan menyaksikan peristiwa tersebut sebagai pertemuan terakhir. Dalam peristiwa tersebut, keluarganya tidak dapat menyaksikan malaikat yang mencabut nyawa saudaranya, padahal ia berada di sebelahnya. Keadaan ini menggambarkan bahwa setiap insan tidak dapat mempertahankan rohnya dari malaikat maut. Ini suatu bukti bahwa baik roh maupun jasad bukan milik manusia. (86-87) Ayat-ayat ini menerangkan tentang manusia yang sedang menghadapi sakratulmaut, mereka dalam keadaan sama sekali tidak berdaya, dan manakala mereka mempunyai kesanggupan dan kemampuan, tentulah mereka dapat menahan nyawa mereka ketika sampai di tenggorokan, untuk mengembalikannya kepada keadaan semula seperti ketika keadaan sehat. Anggapan mereka bahwa hari kebangkitan dan pembalasan semuanya itu tidak ada. Kenyataannya mereka tidak berdaya menahan rohnya ketika sampai di tenggorokannya, namun mereka membangkang. (88-94) Dalam ayat ini dijelaskan keadaan manusia setelah meninggal dunia. Mereka itu terbagi atas 3 golongan yaitu: 1. Golongan orang-orang yang selalu mendekatkan diri kepada Allah (al-muqarrabin) dengan mengerjakan berbagai macam ibadah dan meninggalkan segala larangan-Nya. Mereka ini akan mendapat kemenangan dan kegembiraan serta memperoleh rezeki yang luas dan macam-macam nikmat, tempat kediaman mereka di surga, di mana mereka akan menikmati di dalamnya segala sesuatu yang belum pernah dipandang oleh mata, didengar oleh telinga, dan terlintas di hati. 2. Golongan kanan yakni (al-Abrar atau Ashabul-yamin) yang akan menerima catatan amalnya dengan tangan kanannya. Mereka itu akan disambut dengan gembira oleh para malaikat sambil menyampaikan salam dari teman-teman mereka dari kalangan Ashabul-yamin. Dalam ayat lain, Allah berfirman: \n\nSesungguhnya orang-orang yang berkata, \"Tuhan kami adalah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat-malaikat akan turun kepada mereka (dengan berkata), \"Janganlah kamu merasa takut dan janganlah kamu bersedih hati; dan bergembiralah kamu dengan (memperoleh) surga yang telah dijanjikan kepadamu.\" Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya (surga) kamu memperoleh apa yang kamu inginkan dan memperoleh apa yang kamu minta. Sebagai penghormatan (bagimu) dari (Allah) Yang Maha Pengampun, Maha Penyayang. (Fussilat\/41: 30-32). 3. Golongan orang-orang kafir (Ashabusy-syimal) ialah yang mendustakan Allah dan Rasul-Nya, sehingga mereka tersesat dari jalan yang lurus dan akan menerima catatan amalnya dengan tangan kirinya. Mereka akan ditempatkan dalam api neraka yang berkobar-kobar nyalanya, diberi minum air yang sangat panas, dan makan buah zaqqum sehingga menghancurkan isi perut dan seluruh kulit badan mereka.",
      "text_translation": "dan kamu ketika itu melihat,",
      "text": "وَاَنْتُمْ حِيْنَىِٕذٍ تَنْظُرُوْنَۙ  ",
      "text_translation_en": "the while you are [helplessly] looking on -",
      "juz_number": 27
    },
    "85": {
      "text_tafsir_en": "These verses explain how terrible it would be if human life had reached its throat. Families in attendance just came to see and see the event as the last meeting. In the event, his family could not see an angel taking his brother's life, even though he was next to her. This situation illustrates that every human being cannot keep his spirit from the angels of death. This is proof that neither the spirit nor the body belong to man. (86-87) These verses describe the people who are in danger of dying, they are completely helpless, and while they have the will and ability, they can withstand their lives when they reach the throat, to bring them back to their original condition. when it is healthy. Their assumption is that the day of resurrection and retribution are gone. In fact they were helpless to hold their spirits when they reached their throats, but they rebelled. (88-94) This verse describes the condition of man after death. They are divided into 3 groups: 1. The people who are always close to Allah (al-muqarrabin) by performing various acts of worship and abandoning all His prohibitions. They will find triumph and happiness and enjoy a great sustenance and enjoyment, their dwelling place in heaven, where they will enjoy everything that has never been seen, heard by the ear, and flew into the heart. 2. The right-hand man (al-Abrar or Ashabul-yamin) who will receive his charity note with his right hand. They will be welcomed with joy by the angels as they greet their friends from Ashbel-yamin. In another verse, Allah says: Surely those who say, \"Our Lord is God\" and then they affirm their position, the angels will come down to them, saying, \"Do not be afraid, nor be dismayed; and rejoice in that which is promised to you. \" We are your protector in life and in the hereafter; in it (heaven) you get what you want and you get what you ask for. In honor of (the) Most Forgiving, Most Merciful. (Fussilat \/ 41: 30-32). 3. Those who disbelieve (Ashabusy-syimal) are those who disbelieve in Allah and His Messenger, so that they are led astray from the straight path and will receive the record of their deeds with their left hand. They will be placed in the flames of hellfire, given hot water, and eaten zaqqum, thus destroying the contents of their stomachs and skins.",
      "text_tafsir": "Ayat-ayat ini menjelaskan betapa ngerinya kalau nyawa manusia sudah sampai di tenggorokannya. Keluarga-keluarga yang hadir datang hanya untuk melihat dan menyaksikan peristiwa tersebut sebagai pertemuan terakhir. Dalam peristiwa tersebut, keluarganya tidak dapat menyaksikan malaikat yang mencabut nyawa saudaranya, padahal ia berada di sebelahnya. Keadaan ini menggambarkan bahwa setiap insan tidak dapat mempertahankan rohnya dari malaikat maut. Ini suatu bukti bahwa baik roh maupun jasad bukan milik manusia. (86-87) Ayat-ayat ini menerangkan tentang manusia yang sedang menghadapi sakratulmaut, mereka dalam keadaan sama sekali tidak berdaya, dan manakala mereka mempunyai kesanggupan dan kemampuan, tentulah mereka dapat menahan nyawa mereka ketika sampai di tenggorokan, untuk mengembalikannya kepada keadaan semula seperti ketika keadaan sehat. Anggapan mereka bahwa hari kebangkitan dan pembalasan semuanya itu tidak ada. Kenyataannya mereka tidak berdaya menahan rohnya ketika sampai di tenggorokannya, namun mereka membangkang. (88-94) Dalam ayat ini dijelaskan keadaan manusia setelah meninggal dunia. Mereka itu terbagi atas 3 golongan yaitu: 1. Golongan orang-orang yang selalu mendekatkan diri kepada Allah (al-muqarrabin) dengan mengerjakan berbagai macam ibadah dan meninggalkan segala larangan-Nya. Mereka ini akan mendapat kemenangan dan kegembiraan serta memperoleh rezeki yang luas dan macam-macam nikmat, tempat kediaman mereka di surga, di mana mereka akan menikmati di dalamnya segala sesuatu yang belum pernah dipandang oleh mata, didengar oleh telinga, dan terlintas di hati. 2. Golongan kanan yakni (al-Abrar atau Ashabul-yamin) yang akan menerima catatan amalnya dengan tangan kanannya. Mereka itu akan disambut dengan gembira oleh para malaikat sambil menyampaikan salam dari teman-teman mereka dari kalangan Ashabul-yamin. Dalam ayat lain, Allah berfirman: Sesungguhnya orang-orang yang berkata, \"Tuhan kami adalah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat-malaikat akan turun kepada mereka (dengan berkata), \"Janganlah kamu merasa takut dan janganlah kamu bersedih hati; dan bergembiralah kamu dengan (memperoleh) surga yang telah dijanjikan kepadamu.\" Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya (surga) kamu memperoleh apa yang kamu inginkan dan memperoleh apa yang kamu minta. Sebagai penghormatan (bagimu) dari (Allah) Yang Maha Pengampun, Maha Penyayang. (Fussilat\/41: 30-32). 3. Golongan orang-orang kafir (Ashabusy-syimal) ialah yang mendustakan Allah dan Rasul-Nya, sehingga mereka tersesat dari jalan yang lurus dan akan menerima catatan amalnya dengan tangan kirinya. Mereka akan ditempatkan dalam api neraka yang berkobar-kobar nyalanya, diberi minum air yang sangat panas, dan makan buah zaqqum sehingga menghancurkan isi perut dan seluruh kulit badan mereka.",
      "text_translation": "dan Kami lebih dekat kepadanya daripada kamu, tetapi kamu tidak melihat,",
      "text": "وَنَحْنُ اَقْرَبُ اِلَيْهِ مِنْكُمْ وَلٰكِنْ لَّا تُبْصِرُوْنَ ",
      "text_translation_en": "and while We are closer to him than you, although you see [Us] not -:",
      "juz_number": 27
    },
    "86": {
      "text_tafsir_en": "(86-87) These verses describe the people who are facing trials, they are completely helpless, and while they have the will and ability, they can withstand their lives when they reach the throat, for me¬¬ return it to its original state when it is in good health. Their assumption is that the day of resurrection and retribution are gone. In fact, they were helpless to hold their spirits when they reached their throats, but they rebelled.",
      "text_tafsir": "(86-87) Ayat-ayat ini menerangkan tentang manusia yang sedang mengha¬dapi sakratulmaut, mereka dalam keadaan sama sekali tidak berdaya, dan manakala mereka mempunyai kesanggupan dan kemampuan, tentulah mereka dapat menahan nyawa mereka ketika sampai di tenggorokan, untuk me¬¬ngem¬balikannya kepada keadaan semula seperti ketika keadaan sehat.\n\nAnggapan mereka bahwa hari kebangkitan dan pembalasan semuanya itu tidak ada. Kenyataannya, mereka tidak berdaya menahan rohnya ketika sampai di tenggorokannya, namun mereka membangkang.",
      "text_translation": "maka mengapa jika kamu memang tidak dikuasai (oleh Allah),",
      "text": "فَلَوْلَآ اِنْ كُنْتُمْ غَيْرَ مَدِيْنِيْنَۙ  ",
      "text_translation_en": "why, then, if [you think that] you are not truly dependent [on Us],",
      "juz_number": 27
    },
    "87": {
      "text_tafsir_en": "(86-87) These verses describe the people who are facing trials, they are completely helpless, and while they have the will and ability, they can withstand their lives when they reach the throat, for me¬¬ return it to its original state when it is in good health. Their assumption is that the day of resurrection and retribution are gone. In fact, they were helpless to hold their spirits when they reached their throats, but they rebelled.",
      "text_tafsir": "(86-87) Ayat-ayat ini menerangkan tentang manusia yang sedang mengha¬dapi sakratulmaut, mereka dalam keadaan sama sekali tidak berdaya, dan manakala mereka mempunyai kesanggupan dan kemampuan, tentulah mereka dapat menahan nyawa mereka ketika sampai di tenggorokan, untuk me¬¬ngem¬balikannya kepada keadaan semula seperti ketika keadaan sehat.\n\nAnggapan mereka bahwa hari kebangkitan dan pembalasan semuanya itu tidak ada. Kenyataannya, mereka tidak berdaya menahan rohnya ketika sampai di tenggorokannya, namun mereka membangkang.",
      "text_translation": "kamu tidak mengembalikannya (nyawa itu) jika kamu orang yang benar?",
      "text": "تَرْجِعُوْنَهَآ اِنْ كُنْتُمْ صٰدِقِيْنَ",
      "text_translation_en": "can you not cause that [ebbing life] to return - if what you claim is true?",
      "juz_number": 27
    },
    "88": {
      "text_tafsir_en": "(88-94) This verse describes the condition of man after death. They are divided into 3 groups: 1. The people who are always close to Allah (al-muqarrabin) by performing various acts of worship and abandoning all His prohibitions. They will find triumph and happiness and gain abundant sustenance and pleasure, their dwelling place in heaven, where they will enjoy everything that has never been seen by the eyes, heard by the ear, and crossed by the heart. . 2. The right-hand man (al-Abrar or Ashabul-yamin) who will receive his charity note with his right hand. They will be greeted with joy by the angels as they greet their friends from Ashbel-Yamin. In another verse, God says: \"The people who say,\" Our Lord is God, \"if they keep their position, then the angels will come down to them, saying,\" Do not be afraid and do not be sad. \" heart; and rejoice in that which ye have promised. ”We are your protector in life and in the hereafter; in it (heaven) you get what you desire and what you ask for. For the sake of the Most Forgiving, Most Forgiving (Allah). (Fussilat \/ 41: 30-32). Those who disbelieve (Ashabusy-syimal) are those who disbelieve in Allah and His Messenger, so that they are led astray from the straight path and will receive the record of their deeds with their left hand. They will be placed in the flames of hellfire, given hot water, and ate zaqqum fruit, which will soften the contents of the stomach and entire skin.",
      "text_tafsir": "(88-94) Dalam ayat ini dijelaskan keadaan manusia setelah meninggal dunia. Mereka itu terbagi atas 3 golongan yaitu:\n\n1. Golongan orang-orang yang selalu mendekatkan diri kepada Allah (al-muqarrabin) dengan mengerjakan berbagai macam ibadah dan meninggalkan segala larangan-Nya. Mereka ini akan mendapat kemenangan dan kegembiraan serta memperoleh rezeki yang luas dan macam-macam nik¬mat, tempat kediaman mereka di surga, di mana mereka akan menikmati di dalamnya segala sesuatu yang belum pernah dipandang oleh mata, didengar oleh telinga, dan terlintas di hati.\n\n2. Golongan kanan yakni (al-Abrar atau Ashabul-yamin) yang akan menerima catatan amalnya dengan tangan kanannya. Mereka itu akan disam¬but dengan gembira oleh para malaikat sambil menyampaikan salam dari teman-teman mereka dari kalangan Ashabul-yamin.\n\nDalam ayat lain, Allah berfirman:\n\nSesungguhnya orang-orang yang berkata, “Tuhan kami adalah Allah” kemu¬dian mereka meneguhkan pendirian mereka, maka malaikat-malaikat akan turun kepada mereka (dengan berkata), “Janganlah kamu merasa takut dan janganlah kamu bersedih hati; dan bergem¬biralah kamu dengan (memperoleh) surga yang telah dijanjikan kepa¬da¬mu.” Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya (surga) kamu memperoleh apa yang kamu ingin¬kan dan memperoleh apa yang kamu minta. Sebagai penghor¬ma¬tan (bag¬i¬mu) dari (Allah) Yang Maha Pengampun, Maha Penya¬yang. (Fussilat\/41: 30-32).\n\nGolongan orang-orang kafir (Ashabusy-syimal) ialah yang mendustakan Allah dan Rasul-Nya, sehingga mereka tersesat dari jalan yang lurus dan akan menerima catatan amalnya dengan tangan kirinya. Mereka akan ditempatkan dalam api neraka yang berkobar-kobar nyalanya, diberi minum air yang sangat panas, dan makan buah zaqqum sehingga menghan-curkan isi perut dan seluruh kulit badan mereka.",
      "text_translation": "Jika dia (orang yang mati) itu termasuk yang didekatkan (kepada Allah),",
      "text": "فَاَمَّآ اِنْ كَانَ مِنَ الْمُقَرَّبِيْنَۙ  ",
      "text_translation_en": "[ALL OF YOU are destined to die.] Now if one happens to be of those who are drawn close unto God,",
      "juz_number": 27
    },
    "89": {
      "text_tafsir_en": "see verse 88",
      "text_tafsir": "lihat ayat 88",
      "text_translation": "maka dia memperoleh ketenteraman dan rezeki serta surga (yang penuh) kenikmatan.",
      "text": "فَرَوْحٌ وَّرَيْحَانٌ ەۙ وَّجَنَّتُ نَعِيْمٍ",
      "text_translation_en": "happiness [awaits him in the life to come], and inner fulfillment, and a garden of bliss.",
      "juz_number": 27
    },
    "90": {
      "text_tafsir_en": "see verse 88",
      "text_tafsir": "lihat ayat 88",
      "text_translation": "Dan adapun jika dia termasuk golongan kanan,",
      "text": "وَاَمَّآ اِنْ كَانَ مِنْ اَصْحٰبِ الْيَمِيْنِۙ  ",
      "text_translation_en": "And if one happens to be of those who have attained to righteousness,",
      "juz_number": 27
    },
    "91": {
      "text_tafsir_en": "see verse 88",
      "text_tafsir": "lihat ayat 88",
      "text_translation": "maka, “Salam bagimu (wahai) dari golongan kanan!” (sambut malaikat).",
      "text": "فَسَلٰمٌ لَّكَ مِنْ اَصْحٰبِ الْيَمِيْنِۗ  ",
      "text_translation_en": "[he, too, will be wel­comed into paradise with the words,] “Peace be unto thee [that art] of those who have attained to right­eousness!”",
      "juz_number": 27
    },
    "92": {
      "text_tafsir_en": "see verse 88",
      "text_tafsir": "lihat ayat 88",
      "text_translation": "Dan adapun jika dia termasuk golongan orang yang mendustakan dan sesat,",
      "text": "وَاَمَّآ اِنْ كَانَ مِنَ الْمُكَذِّبِيْنَ الضَّاۤلِّيْنَۙ  ",
      "text_translation_en": "But if one happens to be of those who are wont to call the truth a lie, and [thus] go astray,",
      "juz_number": 27
    },
    "93": {
      "text_tafsir_en": "see verse 88",
      "text_tafsir": "lihat ayat 88",
      "text_translation": "maka dia disambut siraman air yang mendidih,",
      "text": "فَنُزُلٌ مِّنْ حَمِيْمٍۙ  ",
      "text_translation_en": "a welcome of burning despair [awaits him in the life to come,]",
      "juz_number": 27
    },
    "94": {
      "text_tafsir_en": "see verse 88",
      "text_tafsir": "lihat ayat 88",
      "text_translation": "dan dibakar di dalam neraka.",
      "text": "وَّتَصْلِيَةُ جَحِيْمٍ ",
      "text_translation_en": "and the heat of a blazing fire!",
      "juz_number": 27
    },
    "95": {
      "text_tafsir_en": "These verses make it clear that everything revealed in this chapter, both in relation to the day of the resurrection, and in connection with the evidence of the truth of the events that will take place after the day of resurrection, that pertaining to the favors of God to be received by the Ashbel-yamin (muqarrabin) and the torment of God to befall the Ashabusy-symim, all of which are reassuring news that contain no doubt whatsoever. In this regard, man is commanded by God to multiply worship and charity, among other things, by reading beads, to glorify God, the Most High God. In connection with this verse there is a hadith of the Prophet who reads: When quoting the verse of Fasabbih Bismirabbikal-'Adzim, to the Messenger of Allah, he said, \"Make the reading of the Bagbih in your bowels\" (ie reading Subhanarabbial-'Adzim) \", and while downloading the Sabbihismarabbikal verse Goodness. The Messenger of Allah (may peace be upon him) said: \"Make this reading of the Bagbih when you prostrate (ie reading Subhanarabbial-A'la)\" (History of Ahmad, Abu Dawud, and Ibn Majah of 'Uqbah bin' Amir al-Juhani)",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa segala sesuatu yang telah diungkapkan dalam surah ini, baik yang mengenai hal-hal yang berhubungan dengan hari kebangkitan yang mereka dustakan maupun yang bertalian dengan bukti-bukti yang menunjukkan kebenaran adanya hal-hal yang akan terjadi setelah hari kebangkitan, yaitu yang berkaitan dengan nikmat-nikmat Tuhan yang akan diterima oleh golongan (muqarrabin) Ashabul-yamin dan siksaan Tuhan yang akan menimpa golongan Ashabusy-syimal, semua itu adalah berita yang meyakinkan yang tidak mengandung sedikit pun hal-hal yang diragukan. Berhubungan dengan itu, manusia diperintahkan oleh Allah supaya memperbanyak ibadah dan amal saleh, antara lain dengan membaca tasbih, untuk mengagungkan Allah, Tuhan Yang Mahaagung. Dalam hubungan ayat ini terdapat hadis Nabi yang berbunyi: Tatkala turun ayat Fasabbih Bismirabbikal-'Adzim, kepada Rasulullah, beliau bersabda, \"Jadikanlah bacaan Tasbih pada saat kamu ruku' (yaitu dengan membaca Subhanarabbial-'Adzim)\", dan tatkala turun ayat Sabbihismarabbikal A'la. Rasulullah bersabda, \"Jadikanlah bacaan Tasbih ini ketika kamu sujud (yaitu dengan membaca Subhanarabbial-A'la)\" (Riwayat Ahmad, Abu Dawud, dan Ibnu Majah dari 'Uqbah bin 'Amir al-Juhani)",
      "text_translation": "Sungguh, inilah keyakinan yang benar.",
      "text": "اِنَّ هٰذَا لَهُوَ حَقُّ الْيَقِيْنِۚ  ",
      "text_translation_en": "Verily, this is indeed the truth of truths!",
      "juz_number": 27
    },
    "96": {
      "text_tafsir_en": "These verses make it clear that everything revealed in this chapter, both in relation to the day of the resurrection, and in connection with the evidence of the truth of the events that will take place after the day of resurrection, that pertaining to the favors of God to be received by the Ashbel-yamin (muqarrabin) and the torment of God to befall the Ashabusy-symim, all of which are reassuring news that contain no doubt whatsoever. In this regard, man is commanded by God to multiply worship and charity, among other things, by reading beads, to glorify God, the Most High God. In connection with this verse there is a hadith of the Prophet who reads: When quoting the verse of Fasabbih Bismirabbikal-'Adzim, to the Messenger of Allah, he said, \"Make the reading of the Bagbih in your bowels\" (ie reading Subhanarabbial-'Adzim) \", and while downloading the Sabbihismarabbikal verse Goodness. The Messenger of Allah (may peace be upon him) said: \"Make this reading of the Bagbih when you prostrate (ie reading Subhanarabbial-A'la)\" (History of Ahmad, Abu Dawud, and Ibn Majah of 'Uqbah bin' Amir al-Juhani)",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa segala sesuatu yang telah diungkapkan dalam surah ini, baik yang mengenai hal-hal yang berhubungan dengan hari kebangkitan yang mereka dustakan maupun yang bertalian dengan bukti-bukti yang menunjukkan kebenaran adanya hal-hal yang akan terjadi setelah hari kebangkitan, yaitu yang berkaitan dengan nikmat-nikmat Tuhan yang akan diterima oleh golongan (muqarrabin) Ashabul-yamin dan siksaan Tuhan yang akan menimpa golongan Ashabusy-syimal, semua itu adalah berita yang meyakinkan yang tidak mengandung sedikit pun hal-hal yang diragukan. Berhubungan dengan itu, manusia diperintahkan oleh Allah supaya memperbanyak ibadah dan amal saleh, antara lain dengan membaca tasbih, untuk mengagungkan Allah, Tuhan Yang Mahaagung. Dalam hubungan ayat ini terdapat hadis Nabi yang berbunyi: Tatkala turun ayat Fasabbih Bismirabbikal-'Adzim, kepada Rasulullah, beliau bersabda, \"Jadikanlah bacaan Tasbih pada saat kamu ruku' (yaitu dengan membaca Subhanarabbial-'Adzim)\", dan tatkala turun ayat Sabbihismarabbikal A'la. Rasulullah bersabda, \"Jadikanlah bacaan Tasbih ini ketika kamu sujud (yaitu dengan membaca Subhanarabbial-A'la)\" (Riwayat Ahmad, Abu Dawud, dan Ibnu Majah dari 'Uqbah bin 'Amir al-Juhani)",
      "text_translation": "Maka bertasbihlah dengan (menyebut) nama Tuhanmu Yang Mahabesar.",
      "text": "فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيْمِ ࣖ ",
      "text_translation_en": "Extol, then, the limitless glory of thy Sus­tainer’s mighty name!",
      "juz_number": 27
    }
  },
  "name": "الواقعة",
  "name_translation_en": "The Inevitable",
  "name_translation": "Hari Kiamat",
  "name_latin": "Al-Waqi'ah"
}