{
  "number": 58,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 22,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse explains that Allah has accepted the lawsuit of a woman who had been sent to the Messenger of Allah about her husband's actions. She felt wronged by her husband, because it was revealed that her life would be in jeopardy. Allah has also heard the question and answer between the wife of the complainant and the Messenger of Allah. Therefore, God decreed a law that would eliminate the wife's worries. Zihar is the husband's saying to his wife, \"Anti 'alayya ka dhahri ummi (You think I'm illegal, as I am illegal to interfere with my mother).\" Zihar included the Arabic law of ignorance which was later declared to be applicable to Muslims by the passing of this verse. However, the law has changed in such a way that it has lost elements that could harm the wife. According to the Arabic law of ignorance, if a husband blames his wife then his wife is forbidden to mix her. So his wife has been living in luxury ever since. After her marriage, her marriage to her husband had not ended, but she could not intervene again. Usually a married wife is no longer nourished by her husband, and to marry another man is hindered by the existence of a marriage bond with her husband. Zihar was performed by a husband to his wife in the Arabian period of ignorance usually because the husband did not love his wife anymore or because he was angry with his wife, but he intended to bind his wife. Such acts were common in the Arabian period of ignorance because of the degradation of female degrees. While Islam equals women's degrees to men's.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah menerima gugatan seorang perempuan yang diajukan kepada Rasulullah saw tentang tindakan suaminya. Ia merasa dirugikan oleh suaminya itu, karena dizihar yang berakibat hidupnya akan terkatung-katung. Allah telah mendengar pula tanya jawab yang terjadi antara istri yang menggugat dengan Rasulullah saw. Oleh karena itu, Allah menurunkan hukum yang dapat menghilangkan kekhawatiran istri itu.\n\nZihar adalah ucapan suami kepada istrinya, \"Anti 'alayya ka dhahri ummi (Engkau menurutku haram aku campuri, seperti aku haram mencampuri ibuku).\" Zihar termasuk hukum Arab Jahiliah yang kemudian dinyatakan berlaku di kalangan umat Islam dengan turunnya ayat ini. Akan tetapi, hukumnya telah berubah sedemikian rupa sehingga telah hilang unsur-unsur yang dapat merugikan pihak istri.\n\nMenurut hukum Arab Jahiliah, bila seorang suami menzihar istrinya maka sejak itu istrinya haram dicampurinya. Maka sejak itu pula istrinya hidup dalam keadaan terkatung-katung. Setelah zihar, perkawinannya dengan suaminya belum putus, tetapi ia tidak boleh dicampuri lagi oleh suaminya. Biasanya istri yang dizihar tidak lagi diberi nafkah oleh suaminya, dan untuk kawin dengan orang lain terhalang oleh masih adanya ikatan perkawinan dengan suaminya.\n\nZihar dilakukan suami kepada istri di zaman Arab Jahiliah biasanya karena suami tidak mencintai istrinya lagi atau karena marah kepada istrinya, tetapi ia bermaksud mengikat istrinya. Perbuatan yang demikian biasa di zaman Arab Jahiliah karena memandang rendah derajat perempuan. Sedangkan agama Islam menyamakan derajat perempuan dengan pria.",
      "text_translation": "Sungguh, Allah telah mendengar ucapan perempuan yang mengajukan gugatan kepadamu (Muhammad) tentang suaminya, dan mengadukan (halnya) kepada Allah, dan Allah mendengar percakapan antara kamu berdua. Sesungguhnya Allah Maha Mendengar, Maha Melihat.",
      "text": "قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِيْ تُجَادِلُكَ فِيْ زَوْجِهَا وَتَشْتَكِيْٓ اِلَى اللّٰهِ  ۖوَاللّٰهُ يَسْمَعُ تَحَاوُرَكُمَاۗ اِنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ ",
      "text_translation_en": "GOD has indeed heard the words of her who pleads with thee concerning her husband, and complains Unto God. And God does hear what you both have to say: verily, God is all-hearing, all-seeing.",
      "juz_number": 28
    },
    "2": {
      "text_tafsir_en": "This verse denounces husbands who have dishonored their wives by saying that those who have dishonored their wives are incorrect words spoken by those who do not use their common sense. Is it possible that she is the same mother? The wife is a life partner who is connected to the marriage, and the mother is the one who gave birth to it so that there is a blood relationship. Therefore, such people are those who speak unethical words that are not allowed by religion, intellect, or custom. That word is an unethical word, for no reason at all. Nevertheless, God will forgive the sin of the one who has made his wife known, if he obeys His requirements. There is one principle in Islam that must be adhered to, which is to \"acknowledge the facts in accordance with Sunatullah.\" In establishing the laws that apply in this world, God knows the wisdom and its consequences correctly and surely. Therefore, it is very disgraceful for those who want to change the precepts, such as viewing their wives as their mahram, when Allah has decreed that men should be illegally married (see Surah an-Nisa '\/ 4: 22-24, and some other verses). In verse 4 of Surah al-Ahzab \/ 33, the word zihar is associated with the word adopted. Recognizing other people's children as their own children together with children of their own laws, including saying something inappropriate with sunatullah, and do not correspond to the truth. Then He stressed that the adopted child is the child's father and mother, not ever kid who picked it up. Allah says: Call them by the names of their fathers; that is right in the sight of Allah, and if you do not know their father, then (call them) your religious brothers and sisters. And there is no sin against you if you are ignorant of it, but it is what your heart desires. Allah is Oft-Forgiving, Most Merciful. (al-Ahzab \/ 33: 5) From the third verse of this chapter it can be understood that the husband who brings his wife to life is subject to both punishment and worldly punishment. The sentence of ukhrawi is that they are guilty of speaking nonsense, that is to say that his wife was illegally mixed with her as if she were illegally interfering with her mother. In religion it is forbidden to do something when one is legally prohibiting it or forbidding it, for it is only Allah's law. The worldly punishment is that he must pay the infidelity if he is to interfere with his wife, and the infidelity is considerable, as will be explained later. Scholars agree that likening a wife to a mother with the intention of expressing her affection or expressing her respect and gratitude does not include zihar. Because zihar is just a speech by a husband stating that his wife is illegitimate. The word anti 'alaiyya ka dhahri ummi is an expression (idiom) that has a special meaning in Arabic. Only a person with a deep sense of language can sense the meaning of that expression. Therefore, if the husband who knows only Indonesian, pronounces the dharma in a language understood by the Indonesian people then the above law applies to him as well. According to Hanifah, Auza'i, ats-tsauri and one of the Shaykh Imam qauls could be mentioned in female dhihar women other than mothers, whereas the woman who was called by her name included a male-speaking stranger, such as the husband said, \"You are illegal intervene, as if I were illegally interfering with my younger sister. \" If a husband has made it clear to his wife, it does not mean that there is a divorce between the two wives. Each is still bound by his rights and responsibilities as husband and wife. They are only forbidden to have intercourse. Similarly, to avoid illegal activities, it is illegal for both husbands to spend time together (alone in a quiet place) before the husband pays the infidelity. In order for your wife to live a long life and suffer because of zihar, it is best to set a waiting period for the wife. The waiting period can be extended to a waiting period of four months. If it has been more than four months since the husband pronounced her zihar, while the husband has not yet made a decision, divorced or extended the marriage by paying a divorce, then the wife has the right to file a lawsuit. The judge will certainly grant a wife's lawsuit if the lawsuit is proven. If the divorce is due to divorce, then the divorce will be dropped, where the marriage between the ex-husband and the wife must be on condition of paying the infidelity.",
      "text_tafsir": "Ayat ini mencela suami-suami yang telah menzihar istrinya dengan mengatakan bahwa orang-orang yang telah menzihar istrinya adalah perkataan yang tidak benar yang dikatakan oleh orang-orang yang tidak menggunakan akal sehatnya. Apakah mungkin istri itu sama dengan ibu? Istri adalah teman hidup yang dihubungkan oleh akad nikah, sedang ibu adalah orang yang melahirkannya sehingga ada hubungan darah.\n\nOleh karena itu, orang yang demikian adalah orang yang mengatakan perkataan yang tidak etis dan tidak dibenarkan oleh agama, akal, maupun adat kebiasaan. Perkataan itu adalah perkataan yang tidak etis, tidak mempunyai alasan sedikit pun. Sekalipun demikian, Allah akan mengampuni dosa orang yang telah menzihar istrinya, jika ia mengikuti ketentuan-ketentuan-Nya.\n\nAda suatu prinsip dalam agama Islam yang harus ditegakkan, yaitu \"mengakui kenyataan-kenyataan yang ada sesuai dengan sunatullah.\" Dalam menetapkan hukum-hukum yang berlaku di alam ini, Allah mengetahui hikmah dan akibatnya secara benar dan pasti. Oleh karena itu, sangat tercela orang-orang yang mau mengubah-ubah sunatullah itu, seperti memandang istri sebagai mahramnya, padahal Allah telah menetapkan orang-orang yang haram dinikahi oleh seorang pria (lihat Surah an-Nisa'\/4: 22-24, dan beberapa ayat lainnya). \n\nPada ayat 4 Surah al-Ahzab\/33, perkataan zihar digandengkan dengan perkataan anak angkat. Karena mengakui anak orang lain sebagai anak kandung sendiri sama hukumnya dengan anak sendiri, termasuk mengatakan sesuatu yang tidak sesuai dengan sunatullah, dan tidak sesuai dengan kebenaran. Kemudian Allah menegaskan bahwa anak angkat itu adalah anak ayah dan ibunya, bukan sekali-kali anak orang yang mengangkatnya. Allah berfirman:\n\nPanggillah mereka (anak angkat itu) dengan (memakai) nama bapak-bapak mereka; itulah yang adil di sisi Allah, dan jika kamu tidak mengetahui bapak mereka, maka (panggillah mereka sebagai) saudara-saudaramu seagama dan maula-maulamu. Dan tidak ada dosa atasmu jika kamu khilaf tentang itu, tetapi (yang ada dosanya) apa yang disengaja oleh hatimu. Allah Maha Pengampun, Maha Penyayang. (al-Ahzab\/33: 5)\n\nDari ayat ketiga surah ini dapat dipahami bahwa suami yang menzihar istrinya memperoleh hukuman ukhrawi dan hukuman duniawi. Hukuman ukhrawi ialah mereka berdosa karena mengatakan yang bukan-bukan, yaitu mengatakan bahwa istrinya haram dicampurinya seperti ia haram mencampuri ibunya. Dalam agama termasuk perbuatan terlarang apabila seseorang menghalalkan yang haram atau mengharamkan yang halal, karena yang menentukan halal dan haram itu hanyalah Allah saja. Hukuman duniawi ialah ia wajib membayar kafarat jika ia hendak mencampuri istrinya kembali, dan kafarat itu cukup besar jumlahnya, seperti yang akan diterangkan nanti.\n\nPara ulama sepakat bahwa menyamakan istri dengan ibu dengan maksud untuk menyatakan kasih sayang kepadanya atau untuk menyatakan penghormatan dan terima kasih kepadanya, tidaklah termasuk zihar. Karena zihar itu hanyalah ucapan suami yang menyatakan bahwa istrinya itu haram dicampurinya.\n\nPerkataan anti 'alaiyya ka dhahri ummi merupakan suatu ungkapan (idiom) yang mempunyai arti yang khusus dalam bahasa Arab. Hanyalah orang yang mendalam rasa bahasanya yang dapat merasakan arti ungkapan itu. Oleh karena itu, jika suami yang hanya mengerti bahasa Indonesia, mengucapkan sigat dhihar itu dengan ungkapan yang dipahami oleh orang Indonesia maka hukum di atas berlaku pula baginya.\n\nMenurut Hanifah, Auza'i, ats-tsauri dan salah satu qaul Imam Syafi'i boleh disebut dalam sigat dhihar perempuan selain ibu, asal saja perempuan yang disebut namanya itu termasuk muhrim laki-laki yang menzihar, seperti suami mengatakan, \"Engkau haram aku campuri, seperti aku haram mencampuri adik kandungku yang perempuan.\"\n\nJika seorang suami telah menzihar istrinya, tidak berarti telah terjadi perceraian antara kedua suami-istri itu. Masing-masing masih terikat oleh hak dan kewajiban sebagai suami dan istri. Mereka hanya terlarang melakukan persetubuhan. Demikian pula untuk menghindarkan diri dari perbuatan haram, maka haram pula kedua suami-istri itu berkhalwat (berduaan di tempat sunyi) sebelum suami membayar kafarat.\n\nAgar istri tidak terkatung-katung hidupnya dan menderita karena zihar itu, sebaiknya ditetapkan waktu menunggu bagi istri. Waktu menunggu itu dapat dikiaskan kepada waktu menunggu dalam ila'ï€ª), yaitu empat bulan. Apabila telah lewat waktu empat bulan sejak suami mengucapkan ziharnya, sedang suami belum lagi menetapkan keputusan, bercerai atau melanjutkan perkawinan dengan membayar kafarat, maka istri berhak mengajukan gugatan kepada pengadilan. Hakim tentu akan mengabulkan gugatan istri bila gugatan itu terbukti.\n\nJika zihar berakibat perceraian, maka jatuhlah talak ba'in kubra, dimana perkawinan kembali antara bekas suami-istri itu haruslah dengan syarat membayar kafarat.",
      "text_translation": "Orang-orang di antara kamu yang menzihar istrinya, (menganggap istrinya sebagai ibunya, padahal) istri mereka itu bukanlah ibunya. Ibu-ibu mereka hanyalah perempuan yang melahirkannya. Dan sesungguhnya mereka benar-benar telah mengucapkan suatu perkataan yang mungkar dan dusta. Dan sesungguhnya Allah Maha Pemaaf, Maha Pengampun. ",
      "text": "اَلَّذِيْنَ يُظٰهِرُوْنَ مِنْكُمْ مِّنْ نِّسَاۤىِٕهِمْ مَّا هُنَّ اُمَّهٰتِهِمْۗ اِنْ اُمَّهٰتُهُمْ اِلَّا الّٰۤـِٔيْ وَلَدْنَهُمْۗ وَاِنَّهُمْ لَيَقُوْلُوْنَ مُنْكَرًا مِّنَ الْقَوْلِ وَزُوْرًاۗ وَاِنَّ اللّٰهَ لَعَفُوٌّ غَفُوْرٌ ",
      "text_translation_en": "As for those of you who [henceforth] separate themselves from their wives by saying, “Thou art as unlawful to me as my mother”, [let them bear in mind that] they can never be [as] their mothers: none are their mothers save those who gave them birth: and so, behold, they but utter a saying that runs counter to reason, and is [therefore] false. But, behold, God is indeed an absolver of sins, much-forgiving:",
      "juz_number": 28
    },
    "3": {
      "text_tafsir_en": "In these verses the conditions for spouses to be mixed or remarried if they are divorced, the husband is obliged to pay the infidelity. The obligation to pay for the infidelity is due to the occurrence of zihar and the will of the husband to interfere with his wife ('aud). In this verse are described three stages of zihar kafarat. The first step should be to do it. If the first stage is not willing to perform, it can run the second stage. If the second stage is also not capable of performing it, the third stage is required. The steps are: 1.Make a child free before performing a sexual intercourse again. This is the decree of God for all believers, so that they may beware of wrongdoing and pay the penalty as sin forfeiture of wrongdoing. God sees and knows all the acts of His servants, and will forgive all His servants who want to stop wrongdoing and carry out the laws of God. At this time slavery has been removed from the surface of the earth, so this first-degree abduction is no longer possible. Liberating slavery as infidelity, including one of the ways in Islam to abolish slavery, has never been so prevalent in the nations of the world, as it has been in America, Europe, and beyond. Therefore, Islam is a religion that seeks to abolish slavery and to devise ways to abolish it immediately. 2. If the first is not possible, fast for two consecutive months. Consecutive is one of the conditions of the fast that will take place. This means that if there are non-fasting days such as fasting one day or later not fasting the other day during those two months, then fasting cannot be considered a holiday, even if it is not fasting due to long travel (safar) or illness . The fasting should be done before having intercourse with the husband and wife. 3.If the second is not feasible then the third stage is to feed the poor sixty. Zihar is a kind of oath, which is the oath of a husband who says that his wife is illegally interrupted just as his mother intervenes. Therefore, the obligor to pay the infidelity is the husband who only performs zihar, because he swears, while the wife who never performs the zihar shall not pay the infidelity. The number or form of the zihar law enforcement is a very high number or form, especially considering that the law applies to all Muslims, whether rich or poor. For a rich person it is not difficult to pay for the infidelity, but it is a difficult and difficult thing to pay for the poor. Faced with such problems, Islamic law has principles that can ease the burden that God imposes on Muslims, the principle, \"Difficulty brings convenience,\" even though it is really an insurmountable difficulty, accompanied by the desire in the heart to seek God's will. In this regard, in the continuation of the hadith of Khuwailah the son of Malik narrated by Abu Dawud, it is said: Then the Messenger of Allah (may peace be upon him) said, \"Let him set free a slave.\" Khaulah said, \"He couldn't do it.\" The Prophet said, \"(If so) then he fasted two months in a row.\" Khaulah said, \"O Messenger of Allah, verily he (my husband) is an old man, unable to fast anymore.\" The Prophet said, \"Then he should feed the poor sixty.\" Khaulah said, \"He has nothing to offer.\" The Messenger of Allah (may peace be upon him) said, \"Then I will surely help him with a tar.\" Khaulah said, \"And I will help him again with a tamarind.\" The Messenger of Allah (may peace be upon him) said, \"You are very good, go away, and in His name, eat with this tame sixty poor people.\" (History of Abu Dawud) In another history it is said that the Khaulah told the Messenger of Allah that the poorest people in this country were his family. The Messenger of Allah (may peace be upon him) ordered the Khaulah to bring the palm as the kafarat returned to his home for his family to eat. In fact, the religion of Islam does not accept the existence of zihar, even viewing it as a sin and a sin, because it is a baseless act, saying something nonsense. However, because zihar is a custom of the Arabs of ignorance, being able to eradicate it in a short time will cause a stir in the newly-growing Muslim community, while that community comes from the Arabs of ignorance, so Islam does not immediately eradicate that habit. Islam removes all the consequences of the zihar act by setting a four-month waiting period. During that time, the husband can divorce his wife or pay the courtesy to those who wish to interfere with his wife's return, which is to revoke what she has said. So the zihar is derived from the Arabic law of ignorance that has been abolished by Islam. Therefore, for those countries or Muslims who do not know the zihar, there is no need to enact that law if they make a marriage law. At the end of this verse it is explained that Allah has explained the obligation to pay the infidelity to a husband who has revealed his wife is to deepen her faith, to believe in the Prophet Muhammad as the Messenger of Allah, and to be careful to speak a word, so as not to lie and say no- not. Thus, it is implanted in the heart of every believer the desire to carry out all of God's laws to the best of their ability. It also implies in their hearts that disobeying the laws of God will cause misery in this world and in the hereafter.",
      "text_tafsir": "Pada ayat-ayat ini diterangkan syarat-syarat bagi suami-istri agar dapat bercampur atau melaksanakan perkawinan kembali jika mereka telah bercerai, yaitu pihak suami wajib membayar kafarat. Kewajiban membayar kafarat itu disebabkan telah terjadinya zihar dan adanya kehendak suami mencampuri istrinya ('aud).\n\nDalam ayat ini diterangkan tiga tahap kafarat zihar. Tahap pertama harus diupayakan melaksanakannya. Kalau tahap pertama tidak sanggup dilaksanakan, boleh menjalankan tahap kedua. Bila tahap kedua juga tidak sanggup melaksanakannya, wajib dijalankan tahap ketiga. Tahap-tahap itu ialah:\n\n1.Memerdekakan seorang budak sebelum melaksanakan persetubuhan kembali. Ini adalah ketetapan Allah yang ditetapkan bagi seluruh orang yang beriman, agar mereka berhati-hati terhadap perbuatan mungkar dan membayar kafarat itu sebagai penghapus dosa perbuatan mungkar. Allah memperhatikan dan mengetahui semua perbuatan hamba-Nya, dan akan mengampuni semua hamba-Nya yang mau menghentikan perbuatan mungkar dan melaksanakan hukum-hukum Allah. Pada saat ini perbudakan telah hapus dari permukaan bumi, karena itu kafarat tingkat pertama ini tidak mungkin dilaksanakan lagi. Memerdekakan budak sebagai kafarat, termasuk salah satu cara dalam agama Islam untuk menghilangkan perbudakan, yang pernah membudaya di kalangan bangsa-bangsa di dunia, seperti yang terjadi di Amerika, Eropa, dan lain-lain. Oleh karena itu, agama Islam adalah agama yang berusaha menghapus perbudakan dan menetapkan cara-cara untuk melenyapkannya dengan segera.\n\n2.Jika yang pertama tidak dapat dilakukan, hendaklah puasa dua bulan berturut-turut. Berturut-turut merupakan salah satu syarat dari puasa yang akan dilakukan itu. Hal ini berarti jika ada hari-hari puasa yang tidak terlaksana seperti puasa sehari atau lebih kemudian tidak puasa pada hari yang lain dalam masa dua bulan itu, maka puasa itu tidak dapat dijadikan kafarat, walaupun tidak berpuasa itu disebabkan perjalanan jauh (safar) atau sakit. Puasa itu harus dilakukan sebelum melakukan persetubuhan suami istri.\n\n3.Jika yang kedua tidak juga dapat dilaksanakan, maka dilakukan tahap ketiga, yaitu memberi makan enam puluh orang miskin.\n\nZihar adalah semacam sumpah, yaitu sumpah suami yang menyatakan bahwa istrinya haram dicampuri seperti haramnya mencampuri ibunya. Oleh karena itu, yang wajib membayar kafarat ialah suami yang melakukan zihar saja, karena dialah yang bersumpah, sedang istri yang tidak pernah melakukan zihar tidak wajib membayar kafarat.\n\nJumlah atau bentuk kafarat zihar yang ditetapkan itu adalah jumlah atau bentuk yang sangat tinggi, apalagi jika diingat bahwa hukum itu berlaku bagi seluruh kaum Muslimin, baik yang kaya atau yang miskin. Bagi seorang yang kaya tidak ada kesulitan membayar kafarat itu, tetapi merupakan hal yang sulit dan berat membayarnya bagi orang-orang miskin.\n\nMenghadapi masalah yang seperti ini, syariat Islam mempunyai prinsip-prinsip yang dapat meringankan suatu beban yang dipikulkan Allah kepada kaum Muslimin, yaitu prinsip, \"Kesukaran itu menimbulkan kemudahan,\" asal saja kesukaran itu benar-benar suatu kesukaran yang tidak dapat diatasi, disertai dengan keinginan di dalam hati untuk mencari keridaan Allah.\n\nSehubungan dengan ini, pada kelanjutan hadis Khuwailah binti Malik yang diriwayatkan oleh Abu Dawud, dikatakan:\n\nMaka Rasulullah saw berkata, \"Hendaklah ia memerdekakan seorang budak.\" Khaulah berkata, \"Ia tidak sanggup mengusahakannya.\" Nabi berkata, \"(Kalau demikian) maka ia berpuasa dua bulan berturut-turut.\" Khaulah berkata, \"Ya Rasulullah, sesungguhnya ia (suamiku) adalah seorang yang telah tua bangka, tidak sanggup lagi berpuasa.\" Nabi berkata, \"Maka hendaklah ia memberi makan enam puluh orang miskin.\" Khaulah berkata, \"Ia tidak mempunyai sesuatu pun yang akan disedekahkannya.\" Rasulullah saw Berkata, \"(Kalau demikian) maka sesungguhnya aku akan membantunya dengan segantang tamar.\" Khaulah berkata, \"Dan aku akan membantunya pula dengan segantang tamar.\" Berkata Rasulullah saw, \"Engkau benar-benar baik, pergilah, maka beritahukanlah atas namanya, beri makanlah dengan tamar ini enam puluh orang fakir-miskin.\" (Riwayat Abu Dawud)\n\nPada riwayat yang lain diterangkan bahwa Khaulah mengatakan kepada Rasulullah saw bahwa orang yang paling miskin di negeri ini adalah keluarganya. Maka Rasulullah saw menyuruh Khaulah membawa kurma sebagai kafarat itu pulang ke rumahnya untuk dimakan keluarganya sendiri.\n\nPada dasarnya agama Islam tidak menyetujui adanya zihar itu, bahkan memandangnya sebagai perbuatan mungkar dan dosa, karena perbuatan zihar itu adalah perbuatan yang tidak mempunyai dasar, mengatakan sesuatu yang bukan-bukan. Akan tetapi, karena zihar itu adalah suatu kebiasaan bangsa Arab Jahiliah, sedang untuk menghapus kebiasaan itu dalam waktu yang singkat akan menimbulkan kegoncangan pada masyarakat Islam yang baru tumbuh, sedang masyarakat itu berasal dari orang-orang Arab masa Jahiliah, maka agama Islam tidak langsung menghapuskan kebiasaan tersebut. Agama Islam menghilangkan semua akibat yang ditimbulkan oleh perbuatan zihar itu dengan menetapkan waktu menunggu empat bulan. Dalam masa itu, suami boleh menceraikan istrinya atau membayar kafarat bagi yang ingin mencampuri istrinya kembali, yakni mencabut kembali ucapan zihar yang telah diucapkannya. Jadi zihar itu berasal dari hukum Arab masa Jahiliah yang telah dihapuskan oleh Islam. Oleh karena itu, bagi negara-negara atau umat Islam yang tidak mengenal zihar tersebut, tidak perlu mencantumkan hukum itu apabila mereka membuat suatu undang-undang perkawinan.\n\nPada akhir ayat ini diterangkan bahwa Allah menerangkan kewajiban membayar kafarat itu bagi suami yang telah menzihar istrinya adalah untuk memperdalam jiwa tauhid, mempercayai Nabi Muhammad saw sebagai rasul Allah, dan agar berhati-hati mengucapkan suatu perkataan, sehingga tidak mengadakan kedustaan dan mengatakan yang bukan-bukan. Dengan demikian, tertanamlah dalam hati setiap orang yang beriman keinginan melaksanakan semua hukum-hukum Allah dengan sebaik-baiknya. Tertanam juga dalam hati mereka bahwa mengingkari hukum-hukum Allah itu akan menimbulkan kesengsaraan di dunia maupun di akhirat nanti.",
      "text_translation": "Dan mereka yang menzihar istrinya, kemudian menarik kembali apa yang telah mereka ucapkan, maka (mereka diwajibkan) memerdekakan seorang budak sebelum kedua suami istri itu bercampur. Demikianlah yang diajarkan kepadamu, dan Allah Mahateliti terhadap apa yang kamu kerjakan. ",
      "text": "وَالَّذِيْنَ يُظٰهِرُوْنَ مِنْ نِّسَاۤىِٕهِمْ ثُمَّ يَعُوْدُوْنَ لِمَا قَالُوْا فَتَحْرِيْرُ رَقَبَةٍ مِّنْ قَبْلِ اَنْ يَّتَمَاۤسَّاۗ ذٰلِكُمْ تُوْعَظُوْنَ بِهٖۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ ",
      "text_translation_en": "hence, as for those who would separate themselves from their wives by saying, “Thou art as unlawful to me as my mother”, and thereafter would go back on what they have said, [their atonement] shall be the freeing of a human being from bondage before the couple may touch one another again: this you are [hereby] exhorted to do - for God is fully aware of all that you do.",
      "juz_number": 28
    },
    "4": {
      "text_tafsir_en": "In these verses the conditions for spouses to be mixed or remarried if they are divorced, the husband is obliged to pay the infidelity. The obligation to pay for the infidelity is due to the occurrence of zihar and the will of the husband to interfere with his wife ('aud). In this verse are described three stages of zihar kafarat. The first step should be to do it. If the first stage is not willing to perform, it can run the second stage. If the second stage is also not capable of performing it, the third stage is required. The steps are: 1.Make a child free before performing a sexual intercourse again. This is the decree of God for all believers, so that they may beware of wrongdoing and pay the penalty as sin forfeiture of wrongdoing. God sees and knows all the acts of His servants, and will forgive all His servants who want to stop wrongdoing and carry out the laws of God. At this time slavery has been removed from the surface of the earth, so this first-degree abduction is no longer possible. Liberating slavery as infidelity, including one of the ways in Islam to abolish slavery, has never been so prevalent in the nations of the world, as it has been in America, Europe, and beyond. Therefore, Islam is a religion that seeks to abolish slavery and to devise ways to abolish it immediately. 2. If the first is not possible, fast for two consecutive months. Consecutive is one of the conditions of the fast that will take place. This means that if there are non-fasting days such as fasting one day or later not fasting the other day during those two months, then fasting cannot be considered a holiday, even if it is not fasting due to long travel (safar) or illness . The fasting should be done before having intercourse with the husband and wife. 3.If the second is not feasible then the third stage is to feed the poor sixty. Zihar is a kind of oath, which is the oath of a husband who says that his wife is illegally interrupted just as his mother intervenes. Therefore, the obligor to pay the infidelity is the husband who only performs zihar, because he swears, while the wife who never performs the zihar shall not pay the infidelity. The number or form of the zihar law enforcement is a very high number or form, especially considering that the law applies to all Muslims, whether rich or poor. For a rich person it is not difficult to pay for the infidelity, but it is a difficult and difficult thing to pay for the poor. Faced with such problems, Islamic law has principles that can ease the burden that God imposes on Muslims, the principle, \"Difficulty brings convenience,\" even though it is really an insurmountable difficulty, accompanied by the desire in the heart to seek God's will. In this regard, in the continuation of the hadith of Khuwailah the son of Malik narrated by Abu Dawud, it is said: Then the Messenger of Allah (may peace be upon him) said, \"Let him set free a slave.\" Khaulah said, \"He couldn't do it.\" The Prophet said, \"(If so) then he fasted two months in a row.\" Khaulah said, \"O Messenger of Allah, verily he (my husband) is an old man, unable to fast anymore.\" The Prophet said, \"Then he should feed the poor sixty.\" Khaulah said, \"He has nothing to offer.\" The Messenger of Allah (may peace be upon him) said, \"Then I will surely help him with a tar.\" Khaulah said, \"And I will help him again with a tamarind.\" The Messenger of Allah (may peace be upon him) said, \"You are very good, go away, and in His name, eat with this tame sixty poor people.\" (History of Abu Dawud) In another history it is said that the Khaulah told the Messenger of Allah that the poorest people in this country were his family. The Messenger of Allah (may peace be upon him) ordered the Khaulah to bring the palm as the kafarat returned to his home for his family to eat. In fact, the religion of Islam does not accept the existence of zihar, even viewing it as a sin and a sin, because it is a baseless act, saying something nonsense. However, because zihar is a custom of the Arabs of ignorance, being able to eradicate it in a short time will cause a stir in the newly-growing Muslim community, while that community comes from the Arabs of ignorance, so Islam does not immediately eradicate that habit. Islam removes all the consequences of the zihar act by setting a four-month waiting period. During that time, the husband can divorce his wife or pay the courtesy to those who wish to interfere with his wife's return, which is to revoke what she has said. So the zihar is derived from the Arabic law of ignorance that has been abolished by Islam. Therefore, for those countries or Muslims who do not know the zihar, there is no need to enact that law if they make a marriage law. At the end of this verse it is explained that Allah has explained the obligation to pay the infidelity to a husband who has revealed his wife is to deepen her faith, to believe in the Prophet Muhammad as the Messenger of Allah, and to be careful to speak a word, so as not to lie and say no- not. Thus, it is implanted in the heart of every believer the desire to carry out all of God's laws to the best of their ability. It also implies in their hearts that disobeying the laws of God will cause misery in this world and in the hereafter.",
      "text_tafsir": "Pada ayat-ayat ini diterangkan syarat-syarat bagi suami-istri agar dapat bercampur atau melaksanakan perkawinan kembali jika mereka telah bercerai, yaitu pihak suami wajib membayar kafarat. Kewajiban membayar kafarat itu disebabkan telah terjadinya zihar dan adanya kehendak suami mencampuri istrinya ('aud).\n\nDalam ayat ini diterangkan tiga tahap kafarat zihar. Tahap pertama harus diupayakan melaksanakannya. Kalau tahap pertama tidak sanggup dilaksanakan, boleh menjalankan tahap kedua. Bila tahap kedua juga tidak sanggup melaksanakannya, wajib dijalankan tahap ketiga. Tahap-tahap itu ialah:\n\n1.Memerdekakan seorang budak sebelum melaksanakan persetubuhan kembali. Ini adalah ketetapan Allah yang ditetapkan bagi seluruh orang yang beriman, agar mereka berhati-hati terhadap perbuatan mungkar dan membayar kafarat itu sebagai penghapus dosa perbuatan mungkar. Allah memperhatikan dan mengetahui semua perbuatan hamba-Nya, dan akan mengampuni semua hamba-Nya yang mau menghentikan perbuatan mungkar dan melaksanakan hukum-hukum Allah. Pada saat ini perbudakan telah hapus dari permukaan bumi, karena itu kafarat tingkat pertama ini tidak mungkin dilaksanakan lagi. Memerdekakan budak sebagai kafarat, termasuk salah satu cara dalam agama Islam untuk menghilangkan perbudakan, yang pernah membudaya di kalangan bangsa-bangsa di dunia, seperti yang terjadi di Amerika, Eropa, dan lain-lain. Oleh karena itu, agama Islam adalah agama yang berusaha menghapus perbudakan dan menetapkan cara-cara untuk melenyapkannya dengan segera.\n\n2.Jika yang pertama tidak dapat dilakukan, hendaklah puasa dua bulan berturut-turut. Berturut-turut merupakan salah satu syarat dari puasa yang akan dilakukan itu. Hal ini berarti jika ada hari-hari puasa yang tidak terlaksana seperti puasa sehari atau lebih kemudian tidak puasa pada hari yang lain dalam masa dua bulan itu, maka puasa itu tidak dapat dijadikan kafarat, walaupun tidak berpuasa itu disebabkan perjalanan jauh (safar) atau sakit. Puasa itu harus dilakukan sebelum melakukan persetubuhan suami istri.\n\n3.Jika yang kedua tidak juga dapat dilaksanakan, maka dilakukan tahap ketiga, yaitu memberi makan enam puluh orang miskin.\n\nZihar adalah semacam sumpah, yaitu sumpah suami yang menyatakan bahwa istrinya haram dicampuri seperti haramnya mencampuri ibunya. Oleh karena itu, yang wajib membayar kafarat ialah suami yang melakukan zihar saja, karena dialah yang bersumpah, sedang istri yang tidak pernah melakukan zihar tidak wajib membayar kafarat.\n\nJumlah atau bentuk kafarat zihar yang ditetapkan itu adalah jumlah atau bentuk yang sangat tinggi, apalagi jika diingat bahwa hukum itu berlaku bagi seluruh kaum Muslimin, baik yang kaya atau yang miskin. Bagi seorang yang kaya tidak ada kesulitan membayar kafarat itu, tetapi merupakan hal yang sulit dan berat membayarnya bagi orang-orang miskin.\n\nMenghadapi masalah yang seperti ini, syariat Islam mempunyai prinsip-prinsip yang dapat meringankan suatu beban yang dipikulkan Allah kepada kaum Muslimin, yaitu prinsip, \"Kesukaran itu menimbulkan kemudahan,\" asal saja kesukaran itu benar-benar suatu kesukaran yang tidak dapat diatasi, disertai dengan keinginan di dalam hati untuk mencari keridaan Allah.\n\nSehubungan dengan ini, pada kelanjutan hadis Khuwailah binti Malik yang diriwayatkan oleh Abu Dawud, dikatakan:\n\nMaka Rasulullah saw berkata, \"Hendaklah ia memerdekakan seorang budak.\" Khaulah berkata, \"Ia tidak sanggup mengusahakannya.\" Nabi berkata, \"(Kalau demikian) maka ia berpuasa dua bulan berturut-turut.\" Khaulah berkata, \"Ya Rasulullah, sesungguhnya ia (suamiku) adalah seorang yang telah tua bangka, tidak sanggup lagi berpuasa.\" Nabi berkata, \"Maka hendaklah ia memberi makan enam puluh orang miskin.\" Khaulah berkata, \"Ia tidak mempunyai sesuatu pun yang akan disedekahkannya.\" Rasulullah saw Berkata, \"(Kalau demikian) maka sesungguhnya aku akan membantunya dengan segantang tamar.\" Khaulah berkata, \"Dan aku akan membantunya pula dengan segantang tamar.\" Berkata Rasulullah saw, \"Engkau benar-benar baik, pergilah, maka beritahukanlah atas namanya, beri makanlah dengan tamar ini enam puluh orang fakir-miskin.\" (Riwayat Abu Dawud)\n\nPada riwayat yang lain diterangkan bahwa Khaulah mengatakan kepada Rasulullah saw bahwa orang yang paling miskin di negeri ini adalah keluarganya. Maka Rasulullah saw menyuruh Khaulah membawa kurma sebagai kafarat itu pulang ke rumahnya untuk dimakan keluarganya sendiri.\n\nPada dasarnya agama Islam tidak menyetujui adanya zihar itu, bahkan memandangnya sebagai perbuatan mungkar dan dosa, karena perbuatan zihar itu adalah perbuatan yang tidak mempunyai dasar, mengatakan sesuatu yang bukan-bukan. Akan tetapi, karena zihar itu adalah suatu kebiasaan bangsa Arab Jahiliah, sedang untuk menghapus kebiasaan itu dalam waktu yang singkat akan menimbulkan kegoncangan pada masyarakat Islam yang baru tumbuh, sedang masyarakat itu berasal dari orang-orang Arab masa Jahiliah, maka agama Islam tidak langsung menghapuskan kebiasaan tersebut. Agama Islam menghilangkan semua akibat yang ditimbulkan oleh perbuatan zihar itu dengan menetapkan waktu menunggu empat bulan. Dalam masa itu, suami boleh menceraikan istrinya atau membayar kafarat bagi yang ingin mencampuri istrinya kembali, yakni mencabut kembali ucapan zihar yang telah diucapkannya. Jadi zihar itu berasal dari hukum Arab masa Jahiliah yang telah dihapuskan oleh Islam. Oleh karena itu, bagi negara-negara atau umat Islam yang tidak mengenal zihar tersebut, tidak perlu mencantumkan hukum itu apabila mereka membuat suatu undang-undang perkawinan.\n\nPada akhir ayat ini diterangkan bahwa Allah menerangkan kewajiban membayar kafarat itu bagi suami yang telah menzihar istrinya adalah untuk memperdalam jiwa tauhid, mempercayai Nabi Muhammad saw sebagai rasul Allah, dan agar berhati-hati mengucapkan suatu perkataan, sehingga tidak mengadakan kedustaan dan mengatakan yang bukan-bukan. Dengan demikian, tertanamlah dalam hati setiap orang yang beriman keinginan melaksanakan semua hukum-hukum Allah dengan sebaik-baiknya. Tertanam juga dalam hati mereka bahwa mengingkari hukum-hukum Allah itu akan menimbulkan kesengsaraan di dunia maupun di akhirat nanti.",
      "text_translation": "Maka barangsiapa tidak dapat (memerdekakan hamba sahaya), maka (dia wajib) berpuasa dua bulan berturut-turut sebelum keduanya bercampur. Tetapi barangsiapa tidak mampu, maka (wajib) memberi makan enam puluh orang miskin. Demikianlah agar kamu beriman kepada Allah dan Rasul-Nya. Itulah hukum-hukum Allah, dan bagi orang-orang yang mengingkarinya akan mendapat azab yang sangat pedih. ",
      "text": "فَمَنْ لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِنْ قَبْلِ اَنْ يَّتَمَاۤسَّاۗ فَمَنْ لَّمْ يَسْتَطِعْ فَاِطْعَامُ سِتِّيْنَ مِسْكِيْنًاۗ ذٰلِكَ لِتُؤْمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖۗ وَتِلْكَ حُدُوْدُ اللّٰهِ ۗوَلِلْكٰفِرِيْنَ عَذَابٌ اَلِيْمٌ ",
      "text_translation_en": "However, he who does not have the where­withal shall fast [instead] for two consecutive months before the couple may touch one another again; and he who is unable to do it shall feed sixty needy ones: this, so that you might prove your faith in God and His Apostle. Now these are the bounds set by God; and grievous suffering [in the life to come] awaits all who deny the truth.",
      "juz_number": 28
    },
    "5": {
      "text_tafsir_en": "This verse warns that people who oppose God and His Messenger, by choosing the law that applies to him, not the law that God and His Messenger have set, and embracing a religion that is not His religion. They will be punished in the form of humiliation for the rest of the world, as they were foretold to those who disobeyed the apostles whom God had sent to them. This verse is good news and adds to the spirit of Muslims who are under pressure from their allies in the War of Ahzab. At that time, the Jews, the Meccans, and the hypocrites were united against the Muslims, so that their numbers were much greater than that of the Muslims. Because of the high spirit of the Muslims and their confidence in God's help to be given to them, they were able to defeat the allied army. This verse serves as a reminder to leaders that they will be asked for the responsibility of God in the hereafter, whether they have obeyed the laws of God in their government. God has made it clear that the laws and religions that people can accept are only Islam. In addition, humans are not allowed to follow and obey them. Allah says: Today I have perfected your religion for you, and I have enough of my favors for you, and I have embraced Islam as your religion. But what is forced by hunger is not because of sin, but Allah is Oft-Forgiving, Most Merciful. (Al-Ma'idah \/ 5: 3) The Islamic religion in question is a religion that Muhammad declared acceptable to God. Whereas on matters already established, the authorities or persons representing their people are permitted to prescribe other laws governing their people's lives, as long as those laws are not contrary to the law prescribed by God. It is said that Allah had revealed His verses to the Prophet Muhammad, who presented strong arguments and evidence of religious truth and His laws. No one can break the arguments and the evidence, even if they still disobey and break those laws. It is from these verses that it is understood that God commands men, especially the sages, to study and discuss the laws of God, using their intellect, mind, and experience, even to the best of their ability. Then provide accurate and objective judgment. In the 4th verse it is said, \"Wa lil-kafirina 'adhabun alim\" (and for those who disbelieve in painful torment), while in the fifth verse it is said, \"Wa lil kafirina' adhabun muhin\" ( disbelievers of disgraceful torment). What is meant by the infidels in verse 4 are the believers who break the terms. They receive a painful torment as a lesson for them to repent quickly and realize their mistakes. Whereas the fifth verse in this verse refers to the unbelievers, not the believers. For those who suffer disgrace during the life of the world, such as losing their shame, feeling guilty of forbidden acts, feeling guilty of cheating and committing acts of disgust. Such people are usually powerful people who can do everything they want, but others no longer have the credit for what they really mean. There are many more serious forms of contempt.",
      "text_tafsir": "Ayat ini memperingatkan manusia yang menentang Allah dan rasul-Nya, dengan memilih hukum yang berlaku pada dirinya, bukan hukum yang telah ditetapkan Allah dan rasul-Nya, dan memeluk agama yang bukan agama yang disyariatkan-Nya. Mereka akan ditimpa azab berupa kehinaan selama hidup di dunia, sebagaimana telah ditimpakan kepada orang-orang dahulu yang mengingkari para rasul yang diutus Allah kepada mereka.\n\nAyat ini merupakan kabar gembira dan menambah semangat kaum Muslimin yang sedang mengalami tekanan dari orang-orang yang bersekutu dalam Perang Ahzab. Pada waktu itu, orang-orang Yahudi, orang-orang musyrik Mekah, dan orang-orang munafik bersatu dan bersekutu menghadapi kaum Muslimin, sehingga jumlah mereka jauh lebih besar dibandingkan dengan jumlah kaum Muslimin. Karena semangat kaum Muslimin yang tinggi dan keyakinan mereka akan pertolongan Allah yang akan diberikan kepada mereka, maka mereka dapat mengalahkan tentara yang bersekutu itu.\n\nAyat ini merupakan peringatan kepada para pemimpin bahwa mereka akan dimintai pertanggungjawaban oleh Allah di akhirat, apakah mereka telah menjalankan hukum-hukum Allah dalam pemerintahan mereka. Sebab, Allah telah menegaskan bahwa hukum dan agama yang boleh dianut manusia hanyalah agama Islam. Selain dari itu, manusia dilarang mengikuti dan menganutnya. Allah berfirman:\n\nPada hari ini telah Aku sempurnakan agamamu untukmu, dan telah Aku cukupkan nikmat-Ku bagimu, dan telah Aku ridai Islam sebagai agamamu. Tetapi barang siapa terpaksa karena lapar, bukan karena ingin berbuat dosa, maka sungguh, Allah Maha Pengampun, Maha Penyayang. (Al-Ma'idah\/5: 3)\n\nAgama Islam yang dimaksud ialah agama yang didakwahkan Nabi Muhammad yang diterima dari Allah.\n\nSementara itu mengenai hal-hal yang telah ditentukan, para penguasa atau orang-orang yang mewakili rakyatnya dibolehkan menetapkan hukum-hukum lain yang mengatur kehidupan masyarakatnya, selama hukum itu tidak bertentangan dengan hukum yang telah ditetapkan Allah.\n\nDiterangkan bahwa Allah telah menurunkan ayat-ayat-Nya kepada Nabi Muhammad, yang mengemukakan dalil-dalil dan bukti-bukti yang kuat akan kebenaran agama beserta hukum-hukum-Nya. Tidak seorang pun yang dapat mematahkan dalil-dalil dan bukti-bukti, sekalipun mereka masih tetap ingkar dan melanggar hukum-hukum itu.\n\nDari ayat-ayat ini dapat dipahami bahwa Allah memerintahkan kepada manusia terutama kepada cerdik-pandai agar mempelajari dan membahas hukum-hukum Allah, menggunakan akal, pikiran, dan pengalaman mereka, bahkan dengan seluruh kemampuan yang ada pada mereka. Kemudian memberikan penilaian yang tepat dan objektif.\n\nDalam ayat ke-4 yang lalu dikatakan, \"Wa lil-kafirina 'adhabun alim\" (dan bagi orang-orang kafir azab yang pedih), sedangkan pada ayat kelima ini dikatakan, \"Wa lil kafirina 'adhabun muhin\" (dan bagi orang-orang kafir azab yang menghinakan). Yang dimaksud dengan orang-orang kafir pada ayat ke-4 ialah orang-orang mukmin yang melanggar ketentuan-ketentuan. Mereka memperoleh azab yang pedih sebagai pelajaran bagi mereka agar segera bertobat dan menyadari kesalahan mereka. Sedangkan yang dimaksud dengan orang kafir pada ayat kelima ini ialah orang yang benar-benar kafir, tidak beriman. Bagi mereka azab yang menimbulkan kehinaan selama kehidupan dunia, seperti hilangnya rasa malu pada diri mereka, merasa biasa melakukan perbuatan terlarang, merasa biasa berbuat curang dan melakukan perbuatan keji. Orang yang seperti itu biasanya adalah orang yang berkuasa yang dapat melakukan semua yang dikehendakinya, tetapi orang lain tidak lagi mempunyai penghargaan dalam arti yang sebenarnya pada mereka. Banyak lagi bentuk penghinaan yang lebih berat yang mereka terima.",
      "text_translation": "Sesungguhnya orang-orang yang menentang Allah dan Rasul-Nya pasti mendapat kehinaan sebagaimana kehinaan yang telah didapat oleh orang-orang sebelum mereka. Dan sungguh, Kami telah menurunkan bukti-bukti yang nyata. Dan bagi orang-orang yang mengingkarinya akan mendapat azab yang menghinakan. ",
      "text": "اِنَّ الَّذِيْنَ يُحَاۤدُّوْنَ اللّٰهَ وَرَسُوْلَهٗ كُبِتُوْا كَمَا كُبِتَ الَّذِيْنَ مِنْ قَبْلِهِمْ وَقَدْ اَنْزَلْنَآ اٰيٰتٍۢ بَيِّنٰتٍۗ وَلِلْكٰفِرِيْنَ عَذَابٌ مُّهِيْنٌۚ ",
      "text_translation_en": "Verily, those who contend against God and His Apostle shall be brought low even as those [evildoers] who lived before them were brought low after We had bestowed [on them] clear messages from on high. And [so,] for those who deny the truth there will be shameful suffering in store",
      "juz_number": 28
    },
    "6": {
      "text_tafsir_en": "This verse describes the situation of those who oppose and break God's law in the hereafter. God brought them together from the first man, Adam, to the last human life, on the Day of Resurrection. Then Allah told them what they had done throughout their life. All of them are recorded in their books of record, none of which are forgotten, though they have forgotten them because nothing is lost from the knowledge of God.",
      "text_tafsir": "Dalam ayat ini diterangkan keadaan orang-orang yang menentang dan melanggar hukum Allah di akhirat nanti. Allah mengumpulkan mereka semua sejak manusia pertama yaitu Adam, sampai saat terakhir kehidupan manusia, pada hari Kiamat. Kemudian Allah memberitahukan kepada mereka yang telah mereka kerjakan selama hidup di dunia. Semuanya itu tercatat dalam kitab catatan mereka masing-masing, tidak ada satu pun yang dilupakan, walaupun mereka sendiri telah melupakannya karena tidak sesuatu pun yang luput dari pengetahuan Allah.",
      "text_translation": "Pada hari itu mereka semuanya dibangkitkan Allah, lalu diberitakan-Nya kepada mereka apa yang telah mereka kerjakan. Allah menghitungnya (semua amal perbuatan itu), meskipun mereka telah melupakannya. Dan Allah Maha Menyaksikan segala sesuatu. ",
      "text": "يَوْمَ يَبْعَثُهُمُ اللّٰهُ جَمِيْعًا فَيُنَبِّئُهُمْ بِمَا عَمِلُوْاۗ  اَحْصٰىهُ اللّٰهُ وَنَسُوْهُۗ وَاللّٰهُ عَلٰى كُلِّ شَيْءٍ شَهِيْدٌ ࣖ",
      "text_translation_en": "on the Day when God will raise them all from the dead and will make them truly understand all that they did [in life]: God will have taken [all of] it into account, even though they [themselves] may have forgotten it - for God is wit­ness unto everything.",
      "juz_number": 28
    },
    "7": {
      "text_tafsir_en": "This verse explains how broad, deep, and complete the knowledge of God about the creatures that He created, from the smallest to the largest. It was explained that Allah's knowledge encompasses everything in heaven and on earth, however small and delicate it is. If there are three people in heaven and on earth whispering, then God is the fourth. If those who whisper and hold secret talks are four people, then God is the fifth, and if those who whisper and hold secret talks are five people, then the sixth God. Even just how many people whisper and hold secret negotiations and wherever they do, surely God knows. The mention of the numbers three, four, and five in the verse is just to state that usually the negotiations were carried out by several people such as three, four, five, and so on, and each of these negotiations must have been God witnessed. Allah says: Do they not know that Allah knows their secrets and whispers, and that Allah knows all that is unseen? (at-Taubah \/ 9: 78) And said: Or do they think that We have not heard their secrets and their promptings? Actually (We hear), and Our messengers (angels) always record on their side. (az-Zukhruf \/ 43: 80) At the end of this verse, Allah affirms that the truth about Allah is All-Knowing all these things, then they will know later on the Day of Judgment, that is when their charity record is revealed in which all their deeds have been recorded. while living in the world, which is both good and bad deeds, nothing is forgotten to note. At that time, the infidels only regretted their actions, but regret later on was of no use at all.",
      "text_tafsir": "Ayat ini menerangkan bagaimana luas, dalam, dan lengkapnya pengetahuan Allah tentang makhluk yang diciptakan-Nya, sejak dari yang kecil sampai kepada yang sebesar-besarnya. Diterangkan bahwa ilmu Allah mencakup segala yang ada di langit dan di bumi, betapa pun kecil dan halusnya. Jika ada tiga orang di langit dan di bumi berbisik-bisik, maka Allah yang keempatnya. Jika yang berbisik dan mengadakan perundingan rahasia itu empat orang, maka Allah yang kelimanya, dan jika yang berbisik dan mengadakan perundingan rahasia itu lima orang maka Allah yang keenamnya. Bahkan berapa orang saja berbisik dan mengadakan perundingan rahasia dan di mana saja mereka melakukannya, pasti Allah mengetahuinya.\n\nPenyebutan bilangan tiga, empat, dan lima orang dalam ayat hanyalah untuk menyatakan bahwa biasanya perundingan itu dilakukan oleh beberapa orang seperti tiga, empat, lima, dan seterusnya, dan tiap-tiap perundingan itu pasti Allah menyaksikannya. Allah berfirman:\n\nTidakkah mereka mengetahui bahwa Allah mengetahui rahasia dan bisikan mereka, dan bahwa Allah mengetahui segala yang gaib? (at-Taubah\/9: 78)\n\nDan berfirman:\n\nAtaukah mereka mengira, bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka? Sebenarnya (Kami mendengar), dan utusan-utusan Kami (malaikat) selalu mencatat di sisi mereka. (az-Zukhruf\/43: 80)\n\nPada akhir ayat ini, Allah menegaskan bahwa kebenaran tentang Allah Maha Mengetahui segala sesuatu itu, barulah mereka ketahui di hari Kiamat nanti, yaitu ketika dikemukakan catatan amal mereka yang di dalamnya tercatat seluruh perbuatan yang pernah mereka kerjakan selama hidup di dunia, yaitu berupa perbuatan baik maupun perbuatan buruk, tidak ada satu pun yang dilupakan untuk dicatat. Pada saat itu, orang-orang kafir barulah menyesali perbuatan mereka, tetapi penyesalan di kemudian hari itu tidak ada gunanya sedikit pun.",
      "text_translation": "Tidakkah engkau perhatikan, bahwa Allah mengetahui apa yang ada di langit dan apa yang ada di bumi? Tidak ada pembicaraan rahasia antara tiga orang, melainkan Dialah yang keempatnya. Dan tidak ada lima orang, melainkan Dialah yang keenamnya. Dan tidak ada yang kurang dari itu atau lebih banyak, melainkan Dia pasti ada bersama mereka di mana pun mereka berada. Kemudian Dia akan memberitakan kepada mereka pada hari Kiamat apa yang telah mereka kerjakan. Sesungguhnya Allah Maha Mengetahui segala sesuatu. ",
      "text": "اَلَمْ تَرَ اَنَّ اللّٰهَ يَعْلَمُ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ مَا يَكُوْنُ مِنْ نَّجْوٰى ثَلٰثَةٍ اِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ اِلَّا هُوَ سَادِسُهُمْ وَلَآ اَدْنٰى مِنْ ذٰلِكَ وَلَآ اَكْثَرَ اِلَّا هُوَ مَعَهُمْ اَيْنَ مَا كَانُوْاۚ  ثُمَّ يُنَبِّئُهُمْ بِمَا عَمِلُوْا يَوْمَ الْقِيٰمَةِۗ اِنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ ",
      "text_translation_en": "ART THOU NOT aware that God knows all that is in the heavens and all that is on earth? Never can there be a secret confabulation between three persons without His being the fourth of them, nor between five without His being the sixth of them; and neither between less than that, or more, without His being with them wherever they may he. But in the end, on Resurrection Day, He will make them truly understand what they did: for, verily, God has full knowledge of everything.",
      "juz_number": 28
    },
    "8": {
      "text_tafsir_en": "This verse condemns the actions of the Jews who acted in a way that fostered strife and hostility between them and the Muslims, while a peace treaty was established between them and the Muslims. The Messenger of Allah (may peace be upon him) warned them, but they did not heed it. Their whispered conversation could actually magnify their sin against God. The sin was that they had broken the peace treaty they had entered into with the Messenger of Allah, that they and the Muslims would maintain peace and try to create a peaceful environment in the city of Medina. They are at fault for looking for opportunities to destroy the Muslims and to thwart Muhammad's preaching. The Jews if they met or came to the Messenger of Allah (may peace be upon him) they would say goodbye, but its contents insulted the Messenger of Allah. 'She answered with a more rude answer, as the attitude and actions of the Jews were beyond their limits, both in terms of their sense of decency and in terms of their custom. Judging from the religion of Islam, the actions of the Jews were completely out of bounds, because Muhammad was a prophet and apostle of Allah, whereby every Muslim prayed for salvation and goodwill for him. Allah swt says: Verily Allah and His angels care for the Prophet. O you who believe! Salute the Prophet and greet him with respect. (al-Ahzab \/ 33: 56) From the above verse and the reasons for its downfall it can be understood that we must be patient with the profanity that is spoken to us. Don't respond immediately as they do, because that's where the difference between Muslims and infidels lies. With patience they will realize and realize that they have made a mistake. After the Jews said good-bye to the Messenger of Allah as mentioned above, they said to one another, \"Why does God not punish us as a result of Muhammad's answer? If Muhammad was indeed a prophet and apostle whom Allah sent, torment. \" The idea of such a person against God, that God would immediately punish everyone who was unjust to him, is a false belief. It is true that He will punish everyone who is wicked to Him, but when the punishment comes, it is His business. He will suffer the punishment if He wills. But if such a punishment had come, then no one could escape it. When it comes to greeting non-Muslims, scholars disagree. Ibn 'Abbas, asy-Sya'bi, and the Qatadah state that saying greetings to non-Muslims is obligatory, just as answering greetings to fellow Muslims. While Imam Malik and the Shafi'i assert that this is not a requirement, in the sense it is only permissible. When they say hello, then we just have to answer it with '' alaika. ' At the end of this verse, God defies their notion that they will surely be cast into hell. They will burn in it. Hell is the worst place to return to unbelievers.",
      "text_tafsir": "Ayat ini mencela perbuatan yang dilakukan orang Yahudi yang melakukan tindakan yang memancing perselisihan dan permusuhan antara mereka dan kaum Muslimin, padahal telah diadakan perjanjian damai antara mereka dan kaum Muslimin. Rasulullah saw memperingatkan sikap mereka itu, tetapi mereka tidak mengindahkannya.\n\nPembicaraan mereka dengan berbisik-bisik itu sebenarnya dapat memperbesar dosa mereka kepada Allah. Dosa itu karena mereka telah melanggar perjanjian damai yang mereka adakan dengan Rasulullah, bahwa mereka dengan kaum Muslimin akan memelihara ketenteraman dan berusaha menciptakan suasana damai di kota Medinah. Mereka bersalah karena setiap saat mencari-cari kesempatan untuk menghancurkan kaum Muslimin dan menggagalkan dakwah Nabi Muhammad.\n\nOrang-orang Yahudi itu jika mereka bertemu atau datang kepada Rasulullah saw mereka mengucapkan salam, tetapi isinya menghina Rasulullah saw. 'Aisyah menjawab dengan jawaban yang lebih kasar, karena sikap dan tindakan orang-orang Yahudi itu melampaui batas, baik ditinjau dari segi rasa kesopanan dalam pergaulan maupun ditinjau dari segi adat kebiasaan yang berlaku waktu itu.\n\nDitinjau dari segi agama Islam, maka tindakan orang-orang Yahudi itu benar-benar telah melampaui batas, karena Muhammad saw adalah seorang nabi dan rasul Allah, di mana setiap kaum Muslimin mendoakan keselamatan dan kebaikan untuknya. Allah swt berfirman:\n\nSesungguhnya Allah dan para malaikat-Nya bersalawat untuk Nabi. Wahai orang-orang yang beriman! Bersalawatlah kamu untuk Nabi dan ucapkanlah salam dengan penuh penghormatan kepadanya. (al-Ahzab\/33: 56)\n\nDari ayat di atas dan sebab-sebab turunnya dapat diambil pengertian bahwa hendaklah kita berlaku sabar terhadap ucapan-ucapan keji yang dilontarkan kepada kita. Jangan langsung membalas seperti yang mereka lakukan, karena di sanalah letak perbedaan antara orang Muslim dan orang kafir. Dengan bersabar mereka akan sadar dan insaf bahwa mereka telah melakukan kesalahan.\n\nSetelah orang-orang Yahudi itu mengucapkan salam penghinaan kepada Rasulullah sebagaimana tersebut di atas, mereka berkata kepada sesamanya, \"Kenapa Allah tidak menimpakan azab kepada kita sebagai akibat jawaban Muhammad. Seandainya Muhammad benar-benar seorang nabi dan rasul yang diutus Allah, tentulah kita telah ditimpa azab.\" Sangkaan mereka yang demikian terhadap Allah, yaitu Allah akan langsung mengazab setiap orang yang durhaka kepada-Nya, adalah sangkaan yang salah. Benar Dia akan mengazab setiap orang yang durhaka kepada-Nya, tetapi kapan datangnya azab itu, adalah urusan-Nya. Dia akan menimpakan azab itu bila dikehendaki-Nya. Tetapi jika azab itu telah datang, maka tidak seorang pun yang dapat menghindarkan diri daripadanya.\n\nDalam hal menjawab salam terhadap non muslim, para ulama berbeda pendapat. Ibnu 'Abbas, asy-Sya'bi, dan Qatadah menyatakan bahwa menjawab salam terhadap non muslim hukumnya wajib, sama halnya dengan menjawab salam terhadap sesama muslim. Sedangkan Imam Malik dan Syafi'i menyatakan bahwa hal tersebut tidak wajib, dalam arti hanya boleh saja. Bila mereka mengucapkan salam, maka bagi kita cukup menjawabnya dengan \"'alaika.\" \n\nPada akhir ayat ini, Allah membantah anggapan mereka dengan tegas bahwa mereka pasti akan dimasukkan ke dalam neraka Jahanam. Mereka akan terbakar hangus di dalamnya. Jahanam itu adalah seburuk-buruknya tempat kembali yang disediakan bagi orang-orang kafir.",
      "text_translation": "Tidakkah engkau perhatikan orang-orang yang telah dilarang mengadakan pembicaraan rahasia, kemudian mereka kembali (mengerjakan) larangan itu dan mereka mengadakan pembicaraan rahasia untuk berbuat dosa, permusuhan dan durhaka kepada Rasul. Dan apabila mereka datang kepadamu (Muhammad), mereka mengucapkan salam dengan cara yang bukan seperti yang ditentukan Allah untukmu. Dan mereka mengatakan pada diri mereka sendiri, “Mengapa Allah tidak menyiksa kita atas apa yang kita katakan itu?” Cukuplah bagi mereka neraka Jahanam yang akan mereka masuki. Maka neraka itu seburuk-buruk tempat kembali. ",
      "text": "اَلَمْ تَرَ اِلَى الَّذِيْنَ نُهُوْا عَنِ النَّجْوٰى ثُمَّ يَعُوْدُوْنَ لِمَا نُهُوْا عَنْهُ وَيَتَنٰجَوْنَ بِالْاِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُوْلِۖ وَاِذَا جَاۤءُوْكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللّٰهُ ۙوَيَقُوْلُوْنَ فِيْٓ اَنْفُسِهِمْ لَوْلَا يُعَذِّبُنَا اللّٰهُ بِمَا نَقُوْلُۗ حَسْبُهُمْ جَهَنَّمُۚ يَصْلَوْنَهَاۚ فَبِئْسَ الْمَصِيْرُ ",
      "text_translation_en": "Art thou not aware of such as have been for­bidden [to intrigue through] secret confabulations, and yet [always] revert to that which they have been forbidden, and conspire with one another with a view to sinful doings, and aggressive conduct, and dis­obedience to the Apostle? Now whenever such [people] approach thee, [O Muhammad,] they salute thee with a greeting which God has never countenanced; and they say to themselves, “Why does not God chastise us for what we are saying?” Hell shall be their allotted portion: they shall [in­deed] enter it - and how vile a journey’s end!",
      "juz_number": 28
    },
    "9": {
      "text_tafsir_en": "Then Allah decreed the believers not to hold secret negotiations with them for the purpose of sinning, enmity, and disobeying God and the apostles. If they hold secret negotiations as well, that is allowed, but what is discussed in the negotiations is just virtue, discussing good ways, doing acts of piety, and refraining from evil acts. It should be noted that Allah knows everything, nothing is lost from His knowledge. Therefore, no matter how secret the negotiations are, he must know. Whoever disobeys Allah and His Messenger and disobeys His law, God will put it into the fire of hell, he will abide in it and he will receive a humiliating punishment. (an-Nisa '\/ 4: 14) In one hadith it is explained as follows: When you are three, let no two of you whisper without asking the third to join the others, for such is a sad feeling. (History of al-Bukhari and Muslim)",
      "text_tafsir": "Kemudian Allah menghadapkan perintahnya kepada orang-orang yang beriman agar jangan sekali-kali mengadakan perundingan rahasia di antara mereka dengan tujuan berbuat dosa, mengadakan permusuhan, dan mendurhakai Allah dan rasul.\n\nJika mereka mengadakan perundingan rahasia juga, hal itu diperbolehkan, tetapi yang dibicarakan di dalam perundingan itu hanyalah kebajikan, membahas cara-cara yang baik, mengerjakan perbuatan-perbuatan takwa, dan menghindarkan diri dari perbuatan mungkar. Perlu diketahui bahwa Allah mengetahui segala sesuatu, tidak ada sesuatu pun yang luput dari pengetahuan-Nya. Oleh karena itu, betapa pun rahasianya perundingan yang dilakukan, pasti diketahui-Nya.\n\nDan barang siapa mendurhakai Allah dan Rasul-Nya dan melanggar batas-batas hukum-Nya, niscaya Allah memasukkannya ke dalam api neraka, dia kekal di dalamnya dan dia akan mendapat azab yang menghinakan. (an-Nisa'\/4: 14)\n\nDalam satu hadis diterangkan sebagai berikut:\n\nApabila kamu bertiga, maka janganlah dua orang di antara kamu itu berbisik-bisik tanpa mengajak yang ketiga sehingga kamu bergabung dengan orang lain, karena sikap itu menyedihkan perasaannya. (Riwayat al-Bukhari dan Muslim)",
      "text_translation": "Wahai orang-orang yang beriman! Apabila kamu mengadakan pembicaraan rahasia, janganlah kamu membicarakan perbuatan dosa, permusuhan dan durhaka kepada Rasul. Tetapi bicarakanlah tentang perbuatan kebajikan dan takwa. Dan bertakwalah kepada Allah yang kepada-Nya kamu akan dikumpulkan kembali. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا تَنَاجَيْتُمْ فَلَا تَتَنَاجَوْا بِالْاِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُوْلِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوٰىۗ وَاتَّقُوا اللّٰهَ الَّذِيْٓ اِلَيْهِ تُحْشَرُوْنَ",
      "text_translation_en": "[Hence,] O you who have attained to faith, when you do hold secret confabulations, do not conspire with one another with a view to sinful doings, and aggressive conduct, and disobedience to the Apostle, but [rather] hold counsel in the cause of virtue and God-consciousness: and [always] remain conscious of God, unto whom you all shall be gathered.",
      "juz_number": 28
    },
    "10": {
      "text_tafsir_en": "In this verse it is explained that whispering and holding secret negotiations to provoke hostility and opposition is an attempt and act of the devil. He encouraged people to do it, so that they disobeyed Allah and His Messenger. That is the purpose of Satan's life. He influenced humans from their ancestors, namely the Prophet Adam. The more humans he can tempt, the more friends in hell. It was also explained that Satan's efforts were to cause sorrow in the hearts of those who believe. The whispers and secret negotiations carried out by Jews and hypocrites cause insecurity in the hearts of believers. Actually, human accidents attempted by Satan will not be realized and carried out, without the permission of Allah Almighty who is the All-Determining of all things. At the end of this verse, Allah insists that Muslims should not be provoked and feel insecure because of the whispers and secret treaties entered into by unbelievers. Everything will not be done, unless God allows it. Therefore, every Muslim must put his trust in Allah and not trust anyone, except Him.",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa berbisik-bisik dan mengadakan perundingan rahasia untuk menimbulkan permusuhan dan pertentangan itu adalah usaha dan perbuatan setan. Ia mendorong manusia melakukannya, agar mereka mendurhakai Allah dan Rasul-Nya. Itulah tujuan hidup setan. Ia mempengaruhi manusia sejak dari nenek moyang mereka, yaitu Nabi Adam. Semakin banyak manusia yang dapat digodanya, semakin banyak temannya di neraka.\n\nDiterangkan pula bahwa usaha setan adalah untuk menimbulkan kesedihan dalam hati orang-orang yang beriman. Bisik-bisik dan perundingan rahasia yang dilakukan orang-orang Yahudi dan orang-orang munafik, menimbulkan rasa tidak aman dalam hati orang-orang yang beriman. Sebenarnya kecelakaan manusia yang diusahakan oleh setan tidak akan terwujud dan terlaksana, tanpa izin dari Allah yang Mahakuasa lagi Maha Menentukan segala sesuatu.\n\nPada akhir ayat ini, Allah menegaskan bahwa kaum Muslimin tidak boleh terpancing dan merasa tidak aman karena bisik-bisik dan perjanjian rahasia yang diadakan orang-orang kafir. Semuanya tidak akan terlaksana, kecuali jika Allah mengizinkannya. Oleh karena itu, setiap Muslim mesti bertawakal kepada Allah dan tidak percaya kepada siapa pun, kecuali kepada-Nya.",
      "text_translation": "Sesungguhnya pembicaraan rahasia itu termasuk (perbuatan) setan, agar orang-orang yang beriman itu bersedih hati, sedang (pembicaraan) itu tidaklah memberi bencana sedikit pun kepada mereka, kecuali dengan izin Allah. Dan kepada Allah hendaknya orang-orang yang beriman bertawakal. ",
      "text": "اِنَّمَا النَّجْوٰى مِنَ الشَّيْطٰنِ لِيَحْزُنَ الَّذِيْنَ اٰمَنُوْا وَلَيْسَ بِضَاۤرِّهِمْ شَيْـًٔا اِلَّا بِاِذْنِ اللّٰهِ ۗوَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
      "text_translation_en": "[All other kinds of] secret confabulations are but of Satan’s doing, so that he might cause grief to those who have attained to faith; yet he cannot harm them in the least, unless it be by God’s leave: in God, then, let the believers place their trust!",
      "juz_number": 28
    },
    "11": {
      "text_tafsir_en": "This verse explains that if one of the Muslims is commanded by the Messenger of Allah (may peace be upon him) stand to give a certain person a chance to sit, or they are to go first, they must stand or leave, because he wants to honor those people, to be alone to think about religious matters, or to perform tasks that need to be completed immediately. From this verse it is possible to understand the following: 1. The Companions were searching for a place near the Messenger of Allah (may peace be upon him) to make it easier for them to hear the words which he uttered to them. 2. The government of giving newcomers a place is encouraged, if possible to do so, to create a sense of friendship among those present. 3. Verily, every one who gives the servant of Allah a chance to do good, Allah will give him freedom in this world and in the hereafter. Giving generosity to fellow Muslims in their pursuit of well-being and well-being, striving to please their brothers, giving help, and so on, including those organized by the Messenger of Allah. He said: God always helps me as long as he helps his brother. (Muslim History of Abu Hurairah) According to this verse the scholars hold that the people present at an assembly must abide by the provisions of the assembly or obey the orders of the people organizing the assembly. If you study the meaning of the verse above, there is a decree set out in this verse, namely, that people attend a good assembly that comes in time or too late, always maintaining a good mood, full brotherhood and mutual understanding. For those who come before, they must fill the place in advance, so that those who come later need not step over or disturb the person who has come before. For those who are late to come, be content with the situation they encounter, such as not having a seat. This is what the Prophet (peace and blessings be upon him) said: Let not any one of his friends stand in his place, and he shall sit in such place, but let them be forlorn and forbearing. \"(Muslim History of Ibn 'Umar) degrees of believers, obedient and obedient to Him, carrying out His commands, abstaining from His prohibitions, striving to create a peaceful, secure and peaceful environment in society, as well as knowledgeable people who use their knowledge to uphold the Word of God. it is understood that those who have the highest degree of Allah are believers and knowledgeable, and their knowledge is practiced according to the command of Allah and His Messenger. and he will render to you according to his deeds, good deeds will be rewarded. with heaven and evil and forbidden acts will be rewarded with the torment of hell.",
      "text_tafsir": "Ayat ini memberikan penjelasan bahwa jika di antara kaum Muslimin ada yang diperintahkan Rasulullah saw berdiri untuk memberikan kesempatan kepada orang tertentu untuk duduk, atau mereka diperintahkan pergi dahulu, hendaklah mereka berdiri atau pergi, karena beliau ingin memberikan penghormatan kepada orang-orang itu, ingin menyendiri untuk memikirkan urusan-urusan agama, atau melaksanakan tugas-tugas yang perlu diselesaikan dengan segera.\n\nDari ayat ini dapat dipahami hal-hal sebagai berikut:\n\n1.Para sahabat berlomba-lomba mencari tempat dekat Rasulullah saw agar mudah mendengar perkataan yang beliau sampaikan kepada mereka.\n\n2.Perintah memberikan tempat kepada orang yang baru datang merupakan anjuran, jika memungkinkan dilakukan, untuk menimbulkan rasa persahabatan antara sesama yang hadir.\n\n3.Sesungguhnya tiap-tiap orang yang memberikan kelapangan kepada hamba Allah dalam melakukan perbuatan-perbuatan baik, maka Allah akan memberi kelapangan pula kepadanya di dunia dan di akhirat.\n\nMemberi kelapangan kepada sesama Muslim dalam pergaulan dan usaha mencari kebajikan dan kebaikan, berusaha menyenangkan hati saudara-saudaranya, memberi pertolongan, dan sebagainya termasuk yang dianjurkan Rasulullah saw. Beliau bersabda:\n\nAllah selalu menolong hamba selama hamba itu menolong saudaranya. (Riwayat Muslim dari Abu Hurairah)\n\nBerdasarkan ayat ini para ulama berpendapat bahwa orang-orang yang hadir dalam suatu majelis hendaklah mematuhi ketentuan-ketentuan yang berlaku dalam majelis itu atau mematuhi perintah orang-orang yang mengatur majelis itu.\n\nJika dipelajari maksud ayat di atas, ada suatu ketetapan yang ditentukan ayat ini, yaitu agar orang-orang menghadiri suatu majelis baik yang datang pada waktunya atau yang terlambat, selalu menjaga suasana yang baik, penuh persaudaraan dan saling bertenggang rasa. Bagi yang lebih dahulu datang, hendaklah memenuhi tempat di muka, sehingga orang yang datang kemudian tidak perlu melangkahi atau mengganggu orang yang telah lebih dahulu hadir. Bagi orang yang terlambat datang, hendaklah rela dengan keadaan yang ditemuinya, seperti tidak mendapat tempat duduk. Inilah yang dimaksud dengan sabda Nabi saw:\n\nJanganlah seseorang menyuruh temannya berdiri dari tempat duduknya, lalu ia duduk di tempat tersebut, tetapi hendaklah mereka bergeser dan berlapang-lapang.\" (Riwayat Muslim dari Ibnu 'Umar)\n\nAkhir ayat ini menerangkan bahwa Allah akan mengangkat derajat orang yang beriman, taat dan patuh kepada-Nya, melaksanakan perintah-Nya, menjauhi larangan-Nya, berusaha menciptakan suasana damai, aman, dan tenteram dalam masyarakat, demikian pula orang-orang berilmu yang menggunakan ilmunya untuk menegakkan kalimat Allah. Dari ayat ini dipahami bahwa orang-orang yang mempunyai derajat yang paling tinggi di sisi Allah ialah orang yang beriman dan berilmu. Ilmunya itu diamalkan sesuai dengan yang diperintahkan Allah dan rasul-Nya.\n\nKemudian Allah menegaskan bahwa Dia Maha Mengetahui semua yang dilakukan manusia, tidak ada yang tersembunyi bagi-Nya. Dia akan memberi balasan yang adil sesuai dengan perbuatan yang telah dilakukannya. Perbuatan baik akan dibalas dengan surga dan perbuatan jahat dan terlarang akan dibalas dengan azab neraka.",
      "text_translation": "Wahai orang-orang yang beriman! Apabila dikatakan kepadamu, “Berilah kelapangan di dalam majelis-majelis,” maka lapangkanlah, niscaya Allah akan memberi kelapangan untukmu. Dan apabila dikatakan, “Berdirilah kamu,” maka berdirilah, niscaya Allah akan mengangkat (derajat) orang-orang yang beriman di antaramu dan orang-orang yang diberi ilmu beberapa derajat. Dan Allah Mahateliti apa yang kamu kerjakan. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا قِيْلَ لَكُمْ تَفَسَّحُوْا فِى الْمَجٰلِسِ فَافْسَحُوْا يَفْسَحِ اللّٰهُ لَكُمْۚ وَاِذَا قِيْلَ انْشُزُوْا فَانْشُزُوْا يَرْفَعِ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْۙ وَالَّذِيْنَ اُوْتُوا الْعِلْمَ دَرَجٰتٍۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
      "text_translation_en": "O YOU who have attained to faith! When you are told, “Make room for one another in your collective life”, do make room: [and in return,] God will make room for you [in His grace]. And whenever you are told, “Rise up [for a good deed]”, do rise up; [and] God will exalt by [many] degrees those of you who have attained to faith and, [above all,] such as have been vouchsafed [true] knowledge: for God is fully aware of all that you do.",
      "juz_number": 28
    },
    "12": {
      "text_tafsir_en": "According to the history of Ibn Abi at the heart of Ibn 'Abbas, it is explained that many friends wanted to ask the Messenger of Allah, and burden him. To ease the burden, God decreed this verse, ordering alms before the Messenger of Allah. This verse tells the believers that if they want to speak with the Messenger of Allah about something important, they should give a warning before doing the talk. The order was to prove the greatness of the Prophet by magnifying it, and to benefit the poor. It is also to distinguish between those who truly love the Prophet and expect a lesson from him, with hypocrites who have different words and deeds. On the other hand, this order prevented the people from coming to the Messenger without the utmost urgent necessity, and kept him busy. According to Abu Muslim, Allah commanded this because the hypocrites with his mouth professed faith, but his heart remained infidel. Saying that they converted to Islam is true. To test the statement, it came down to the commandment to give alms first before the Messenger of Allah. The benefits of giving alms are to receive the rich rewards of God, to purify and purify one's possessions, and to purify the soul from the desire to accumulate wealth and make it a living purpose. Giving alms can reduce the misery of the believers and may increase the word of God. The donated property was immediately given to those who were entitled to it, not given to the Prophet (peace be upon him), for the purpose of the charity was to honor the Messenger of Allah and ease the burden of the poor. At the end of this verse it is explained that if the person who is going to the Messenger of Allah (may peace be upon him) has nothing to offer, but he needs to meet with him, then Allah gives him relief without having to give alms. The charity here is the gift of the sun, not the obligatory charity, and the amount is not determined, only by sincerity and willingness to give. The emphasis of this verse is for Muslims to be charitable, indifferent, and aware that the wealth they have is simply a tool for seeking God's will. The need to give alms in this verse to test the willingness of new converts to Islam.",
      "text_tafsir": "Menurut riwayat Ibnu Abi hatim dari Ibnu 'Abbas, diterangkan bahwa para sahabat banyak yang ingin bertanya kepada Rasulullah saw, sehingga membebaninya. Untuk meringankan bebannya, Allah menurunkan ayat ini, dengan memerintahkan bersedekah sebelum menghadap Rasulullah.\n\nAyat ini memerintahkan kepada orang-orang yang beriman apabila mereka ingin berbicara secara rahasia dengan Rasulullah saw tentang sesuatu hal yang penting, hendaklah bersedekah sebelum melakukan pembicaraan itu. Perintah itu untuk membuktikan kebesaran Rasulullah dengan mengagungkannya, dan mendatangkan manfaat kepada fakir-miskin. Hal ini juga untuk membedakan antara orang yang benar-benar cinta kepada Rasulullah dan mengharapkan pelajaran darinya, dengan orang munafik yang berbeda perkataan dan perbuatannya. Di sisi lain, perintah ini mencegah orang yang datang beramai-ramai kepada Rasulullah tanpa keperluan yang sangat penting sehingga menyibukkan beliau.\n\nMenurut Abu Muslim, Allah memerintahkan demikian karena orang-orang munafik yang mulutnya menyatakan iman, sedang hatinya tetap kafir. Menyatakan bahwa mereka masuk Islam dengan sebenar-benarnya. Untuk menguji pernyataan itu, maka turun perintah untuk bersedekah lebih dahulu sebelum menghadap Rasulullah.\n\nFaedah memberi sedekah ialah mendapat pahala yang berlipat-ganda dari Allah, membersihkan dan menyucikan harta yang dimiliki, serta membersihkan jiwa dari keinginan mengumpulkan harta dan menjadikannya sebagai tujuan hidup. Suka bersedekah dapat mengurangi kesengsaraan orang-orang fakir dan dapat pula meninggikan kalimat Allah. Harta yang disedekahkan itu langsung diberikan kepada orang-orang yang berhak menerimanya, tidak diberikan kepada Nabi saw, karena di antara tujuan sedekah itu ialah mengagungkan Rasulullah saw dan meringankan beban hidup fakir-miskin.\n\nPada akhir ayat ini diterangkan bahwa jika orang yang akan menghadap Rasulullah saw itu tidak mempunyai sesuatu yang akan disedekahkan, sedangkan ia memerlukan sekali bertemu dengan beliau, maka Allah memberikan keringanan kepadanya dengan tidak mengharuskannya bersedekah.\n\nSedekah yang dimaksud di sini adalah sedekah sunah, bukan sedekah wajib, dan jumlahnya pun tidak ditentukan, hanya menurut keikhlasan dan kesanggupan yang memberi. Yang ditekankan ayat ini ialah agar kaum Muslimin suka bersedekah, tidak kikir, dan sadar bahwa harta yang mereka peroleh itu semata-mata sebagai alat untuk mencari keridaan Allah. Keharusan memberi sedekah dalam ayat ini untuk menguji kemauan orang-orang munafik yang baru masuk Islam.",
      "text_translation": "Wahai orang-orang yang beriman! Apabila kamu mengadakan pembicaraan khusus dengan Rasul, hendaklah kamu mengeluarkan sedekah (kepada orang miskin) sebelum (melakukan) pembicaraan itu. Yang demikian itu lebih baik bagimu dan lebih bersih. Tetapi jika kamu tidak memperoleh (yang akan disedekahkan) maka sungguh, Allah Maha Pengampun, Maha Penyayang.",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا نَاجَيْتُمُ الرَّسُوْلَ فَقَدِّمُوْا بَيْنَ يَدَيْ نَجْوٰىكُمْ صَدَقَةً ۗذٰلِكَ خَيْرٌ لَّكُمْ وَاَطْهَرُۗ فَاِنْ لَّمْ تَجِدُوْا فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ ",
      "text_translation_en": "O YOU who have attained to faith! Whenever you [intend to] consult the Apostle, offer up something in charity on the occasion of your consultation: this will be for your own good, and more conducive to your [inner] purity. Yet if you are unable to do so, [know that,] verily, God is much-forgiving, a dispen­ser of grace.",
      "juz_number": 28
    },
    "13": {
      "text_tafsir_en": "According to the history of Ibn Abi at the heart of Ibn 'Abbas it is said that after descending verse 12 above, most people hold back to ask the Messenger for the need to pay alms. Therefore, take down this verse as a warning to those who do not want to ask the Messenger of Allah for the sake of giving alms. This verse admonishes those who hold back from meeting the Messenger because of the need to pay alms first. In this verse it is said, \"Do you not come to the Messenger of Allah for fear of the poor because of the need to pay alms first, when you really need his explanation and explanation?\" Allah then granted them relief by concluding verse 12 with verse 13, especially by saying, \"If you really are not able to carry out the almsgiving before Allah's Messenger (may peace be upon him) it needs clarification, without giving alms in advance. Do what you have to say. \" Then Allah reminded the other duty of the Muslims to perform, that is, they should set up a continuous prayer at the appointed time, never abandoning it under any circumstances. Salat is of great benefit to mankind, namely, to perfect slavery to God, and to purify obedience and obedience only to Him, not to others. That prayer can eliminate and eradicate the desires to do evil and evil deeds. Muslims are also ordered to issue zakat if they meet the conditions. The charity aims to purify the soul, eliminate the stubbornness of the heart, and help the suffering of the poor. Then it was decreed that Muslims obey the commands of Allah and His Messenger and stop all that He forbids. At the end of this verse, God warns people to be careful of all their actions and desires. For God knows all things, and no one is unaware of His knowledge. According to His knowledge, He has provided a fair reward for every human being. Allah says: Whoever does good will weigh the particle, he will see it, and whoever does the evil will weigh it, he will see. (az-Zalzalah \/ 99: 7-8) And the Word of Allah: (That is) a sinner will not bear the sins of others, and that man will only obtain what he has done, and indeed his efforts will be revealed (to him), then it will be rewarded with the most perfect reply. (an Najm \/ 53: 38-41)",
      "text_tafsir": "Menurut riwayat Ibnu Abi hatim dari thalhah dari Ibnu 'Abbas dikatakan bahwa setelah turun ayat ke 12 di atas, maka kebanyakan orang menahan dirinya bertanya kepada Rasulullah karena keharusan membayar sedekah. Oleh karena itu, turunlah ayat ini sebagai teguran kepada orang-orang yang tidak mau bertanya kepada Rasulullah saw karena adanya keharusan membayar sedekah.\n\nAyat ini menegur orang-orang yang menahan dirinya untuk tidak menemui Rasulullah karena adanya keharusan membayar sedekah lebih dahulu. Dalam ayat ini dinyatakan, \"Apakah kamu tidak datang menghadap Rasulullah saw karena takut miskin lantaran keharusan membayar sedekah lebih dahulu, padahal kamu sangat memerlukan penjelasan dan keterangannya?\"\n\nAllah lalu memberikan keringanan kepada orang-orang itu dengan me-nasakh ayat 12 dengan ayat 13, terutama dengan menyatakan, \"Seandainya kamu sekalian benar-benar tidak sanggup melaksanakan anjuran untuk bersedekah sebelum menghadap Rasulullah saw, maka kamu sekalian boleh menghadap untuk menanyakan sesuatu yang diperlukan penjelasannya, tanpa memberi sedekah lebih dahulu. Laksanakanlah apa yang telah diterangkan ini dengan sebaik-baiknya.\"\n\nKemudian Allah mengingatkan kewajiban lainnya bagi kaum Muslimin yang harus dilaksanakan, yaitu agar mereka mendirikan salat terus-menerus menurut waktu yang telah ditentukan, jangan sekali-kali meninggalkannya walau dalam keadaan bagaimanapun. Salat sangat besar faedahnya bagi manusia, yaitu untuk menyempurnakan penghambaan diri kepada Allah, dan memurnikan ketaatan dan ketundukan hanya kepada-Nya, tidak kepada yang lain. Salat itu dapat menghilangkan dan mengikis keinginan-keinginan untuk mengerjakan perbuatan keji dan mungkar. \n\nKaum Muslimin juga diperintahkan untuk mengeluarkan zakat jika telah memenuhi syarat-syaratnya. Zakat itu bertujuan untuk menyucikan jiwa, menghilangkan sifat-sifat kikir yang ada dalam hati, dan membantu penderitaan orang miskin. Kemudian ditegaskan agar kaum Muslimin menaati perintah-perintah Allah dan rasul-Nya dan menghentikan segala yang dilarang-Nya.\n\nPada akhir ayat ini, Allah memperingatkan manusia agar selalu berhati-hati terhadap semua perbuatan dan keinginan hatinya. Sebab, Allah mengetahui semuanya, tidak ada yang luput dari pengetahuan-Nya. Berdasarkan pengetahuan-Nya itu, Dia memberi balasan yang setimpal kepada setiap manusia. Allah berfirman:\n\nMaka barang siapa mengerjakan kebaikan seberat zarah, niscaya dia akan melihat (balasan)nya, dan barang siapa mengerjakan kejahatan seberat zarah, niscaya dia akan melihat (balasan)nya. (az-Zalzalah\/99: 7-8)\n\nDan Firman Allah:\n\n(Yaitu) bahwa seseorang yang berdosa tidak akan memikul dosa orang lain, dan bahwa manusia hanya memperoleh apa yang telah diusahakannya, dan sesungguhnya usahanya itu kelak akan diperlihatkan (kepadanya), kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna. (an-Najm\/53: 38-41)",
      "text_translation": "Apakah kamu takut akan (menjadi miskin) karena kamu memberikan sedekah sebelum (melakukan) pembicaraan dengan Rasul? Tetapi jika kamu tidak melakukannya dan Allah telah memberi ampun kepadamu, maka laksanakanlah salat, dan tunaikanlah zakat serta taatlah kepada Allah dan Rasul-Nya! Dan Allah Mahateliti terhadap apa yang kamu kerjakan.",
      "text": "ءَاَشْفَقْتُمْ اَنْ تُقَدِّمُوْا بَيْنَ يَدَيْ نَجْوٰىكُمْ صَدَقٰتٍۗ فَاِذْ لَمْ تَفْعَلُوْا وَتَابَ اللّٰهُ عَلَيْكُمْ فَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَطِيْعُوا اللّٰهَ وَرَسُوْلَهٗ ۗوَاللّٰهُ خَبِيْرٌ ۢبِمَا تَعْمَلُوْنَ ࣖ ",
      "text_translation_en": "Do you, perchance, fear lest [you may be sinning if] you cannot offer up anything in charity on the occasion of your consultation [with the Apostle]? But if you fail to do it [for lack of opportunity], and God turns unto you in His mercy, remain but con­stant in prayer and render [no more than] the purify­ing dues, and [thus] pay heed unto God and His Apostle: for God is fully aware of all that you do.",
      "juz_number": 28
    },
    "14": {
      "text_tafsir_en": "Allah ordered the Muslims to pay close attention to the hypocrites who made the Jews their loyal companions, and they told the Jews the secrets they often heard from the Prophet and the Muslims. When they meet with believers, they declare their faith, and promise to preach and strive to uphold the word of God. However, when they met the Jews, they described the ugliness of the Muslims and promised together that they would destroy Islam and the Muslims. The Word of God: And some say, \"We believe in Allah and the Last Day,\" but they are not believers. They deceive Allah and the believers, but they are only fooling themselves without their knowledge. In their hearts there was disease, and Allah increased it; and they get a painful punishment, because they lie. (al-Baqarah \/ 2: 8-10) According to the history of Ahmad and al-judge received from Ibn 'Abbas as-Suddi, this verse was revealed in connection with' Abdullah bin Nabtal, a hypocrite who often shared secrets of the Muslims to the Jews. One day, the Prophet was sitting in his house, and he told his companions sitting around him, \"This man, who looks like a demon, will come to your place. If he does come, do not talk to him.\" Shortly thereafter, a man, 'Abdullah bin Nabtal, came and the Prophet said to him, \"Why are you and your friends taunting me and my friends?\" The man replied, \"I will call my friends to prove the allegations.\" When he and his companions came before the Messenger of Allah (may peace be upon him), they swore in the name of Allah that they had never done so. Allah asserts that hypocrites are not true believers, as they admit. They profess to believe only in the hearts of believers, and to maintain good relations with them. The hypocrites also did not include the true Jews. They claimed to be Jews only to win the hearts of the Jews, and to gain protection from them. In a two-way way, they suspect that they will be able to avoid war between Muslims and unbelievers, including Jews. Allah says: They are in a state of doubt (such as faith or infidelity), not in this group (believers) and not (in any way) those (unbelievers). Whoever is left astray by Allah, you will find no way. (an-Nisa '\/ 4: 143) It is said that hypocrites do not hesitate to swear by mentioning the name of Allah to convince believers and to declare that they are true believers in God and His Messenger. Similarly, when they met the Jews, they also swore that they were loyal friends and promised to help each other in dealing with the Muslims. Those hypocrites know for sure that their deeds are bad and forbidden",
      "text_tafsir": "Allah memerintahkan kaum Muslimin agar memperhatikan dengan seksama orang-orang munafik yang menjadikan orang-orang Yahudi sebagai teman setia mereka, dan mereka menyampaikan kepada orang-orang Yahudi rahasia-rahasia yang sering mereka dengarkan dari Nabi saw dan kaum Muslimin. Bila bertemu dengan orang-orang yang beriman, mereka menyatakan keimanan mereka, serta berjanji akan ikut berdakwah dan berjuang menegakkan kalimat Allah. Akan tetapi, bila mereka bertemu dengan orang-orang Yahudi, mereka menggambarkan kejelekan kaum Muslimin dan berjanji bersama-sama akan menghancurkan Islam dan kaum Muslimin. Firman Allah:\n\nDan di antara manusia ada yang berkata, \"Kami beriman kepada Allah dan hari akhir,\" padahal sesungguhnya mereka itu bukanlah orang-orang yang beriman. Mereka menipu Allah dan orang-orang yang beriman, padahal mereka hanyalah menipu diri sendiri tanpa mereka sadari. Dalam hati mereka ada penyakit, lalu Allah menambah penyakitnya itu; dan mereka mendapat azab yang pedih, karena mereka berdusta. (al-Baqarah\/2: 8-10)\n\nMenurut riwayat Ahmad dan al-hakim yang diterima dari as-Suddi dari Ibnu 'Abbas, bahwa ayat ini diturunkan berhubungan dengan 'Abdullah bin Nabtal, seorang munafik yang sering menyampaikan rahasia-rahasia kaum Muslimin kepada orang-orang Yahudi. Pada suatu hari, Rasulullah sedang duduk di rumahnya, kemudian beliau menyampaikan kepada para sahabat yang duduk di sekitar beliau, \"Akan datang ke tempatmu ini seorang yang pandangannya seperti pandangan setan. Jika ia datang nanti, janganlah kalian berbicara dengannya.\" Tidak berapa lama kemudian, datanglah seseorang, yaitu 'Abdullah bin Nabtal, dan Rasulullah berkata kepadanya, \"Mengapa kamu beserta teman-teman kamu itu mencaci-makiku dan sahabat-sahabatku?\" Orang itu menjawab, \"Akan aku panggil sahabat-sahabatku untuk membuktikan ketidakbenaran tuduhan itu.\" Setelah ia dan teman-temannya sampai di hadapan Rasulullah saw, mereka bersumpah dengan menyebut nama Allah, bahwa mereka semua tidak pernah melakukan seperti apa yang dituduhkan itu. \n\nAllah menegaskan bahwa orang-orang munafik bukanlah orang mukmin yang benar, sebagaimana pengakuan mereka. Mereka mengaku beriman semata-mata untuk mengambil hati orang-orang yang beriman saja, dan menjaga hubungan baik dengan mereka. Orang-orang munafik itu juga tidak termasuk golongan Yahudi yang benar. Mereka mengaku Yahudi semata-mata untuk mengambil hati orang-orang Yahudi, sehingga memperoleh perlindungan dari mereka. Dengan cara bermuka dua itu, mereka menduga akan dapat menghindarkan diri dari peperangan yang terjadi antara kaum Muslimin dan orang-orang kafir, termasuk di dalamnya orang Yahudi. Allah berfirman:\n\nMereka dalam keadaan ragu antara yang demikian (iman atau kafir), tidak termasuk kepada golongan ini (orang beriman) dan tidak (pula) kepada golongan itu (orang kafir). Barang siapa dibiarkan sesat oleh Allah, maka kamu tidak akan mendapatkan jalan (untuk memberi petunjuk) baginya. (an-Nisa'\/4: 143)\n\nDiterangkan bahwa orang-orang munafik itu tidak segan-segan bersumpah dengan menyebut nama Allah untuk meyakinkan orang-orang yang beriman dan menyatakan bahwa mereka benar-benar beriman kepada Allah dan Rasul-Nya. Demikian pula bila mereka bertemu dengan orang-orang Yahudi, mereka bersumpah pula bahwa mereka adalah teman setia dan berjanji akan saling membantu dalam menghadapi orang-orang Islam. Orang-orang munafik itu mengetahui benar bahwa perbuatan mereka itu adalah tidak baik dan terlarang",
      "text_translation": "Tidakkah engkau perhatikan orang-orang (munafik) yang menjadikan suatu kaum yang telah dimurkai Allah sebagai sahabat? Orang-orang itu bukan dari (kaum) kamu dan bukan dari (kaum) mereka. Dan mereka bersumpah atas kebohongan, sedang mereka mengetahuinya. ",
      "text": "۞ اَلَمْ تَرَ اِلَى الَّذِيْنَ تَوَلَّوْا قَوْمًا غَضِبَ اللّٰهُ عَلَيْهِمْۗ مَا هُمْ مِّنْكُمْ وَلَا مِنْهُمْۙ وَيَحْلِفُوْنَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُوْنَ ",
      "text_translation_en": "ART THOU NOT aware of those who would be friends with people whom God has condemned? They are neither of you [O believers] nor of those [who utterly reject the truth]: and so they swear to a falsehood the while they know [it to be false].",
      "juz_number": 28
    },
    "15": {
      "text_tafsir_en": "In this verse it is explained that because of that hypocrisy, Allah provided for them a very severe punishment. From this verse it can be understood that hypocrisy includes evil acts, harm to society, and great sin. The hypocrites deceived and exposed the secrets of the Muslims to their enemies, the Jews and the Meccans. These actions could lead to the destruction of Islam and Muslims. Allah provided for them in the hereafter the torment of hell as punishment for their deeds in the world.",
      "text_tafsir": "Pada ayat ini diterangkan bahwa karena kemunafikan itu, Allah menyediakan bagi mereka azab yang sangat berat. Dari ayat ini dapat dipahami bahwa kemunafikan itu termasuk perbuatan buruk, membahayakan masyarakat, dan dosa besar. Orang-orang munafik itu menipu dan membeberkan rahasia-rahasia kaum Muslimin kepada musuh-musuh mereka, yaitu orang-orang Yahudi dan orang-orang musyrik Mekah. Tindakan itu dapat mengakibatkan kehancuran agama Islam dan kaum Muslimin. Allah menyediakan bagi mereka di akhirat nanti azab neraka sebagai hukuman atas perbuatan mereka di dunia.",
      "text_translation": "Allah telah menyediakan azab yang sangat keras bagi mereka. Sungguh, betapa buruknya apa yang telah mereka kerjakan. ",
      "text": "اَعَدَّ اللّٰهُ لَهُمْ عَذَابًا شَدِيْدًاۗ اِنَّهُمْ سَاۤءَ مَا كَانُوْا يَعْمَلُوْنَ",
      "text_translation_en": "God has readied for them suffering severe [in the life to come]. Behold, evil indeed is what they are wont to do:",
      "juz_number": 28
    },
    "16": {
      "text_tafsir_en": "In this verse it is explained that their purpose is to practice such hypocrisy. By lying and swearing, many Muslims believe them. Because they are believed to be true believers, thus avoiding retaliation or expulsion by the Muslims. By doing so, they benefit the Muslims, who believe their words, and defend them. That way, they can prevent others from embracing Islam by insulting Islam and Muslims. They can even cause fear and a refusal in the hearts of Muslims to go to war with the Prophet. In one of his words, God explained the attitude of the hypocrites: Those who were left behind (not engaged in war), were happy to sit still after the Messenger's death. They do not like to fight for their wealth and soul in the way of Allah and they say, \"Do not go out in the heat of the heat.\" Say (Muhammad), \"Hellfire is hotter,\" if they know. (at-Taubah \/ 9: 81) Because of the great sin that they have committed, it is fitting that hypocrites should suffer humiliation in this world and in the Hereafter, in return for their actions.",
      "text_tafsir": "Dalam ayat ini diterangkan tujuan mereka melakukan kemunafikan itu. Dengan berdusta yang dikuatkan dengan sumpah, banyak kaum Muslimin yang mempercayai mereka. Karena disangka orang yang benar-benar beriman, sehingga terhindar dari pembalasan atau pengusiran oleh kaum Muslimin.\n\nDengan tindakan itu, mereka mendapat keuntungan dari kaum Muslimin, yang mempercayai perkataan mereka, sehingga membela mereka. Dengan jalan demikian, mereka dapat menghalang-halangi orang lain memeluk agama Islam dengan cara menjelek-jelekkan Islam dan kaum Muslimin. Bahkan mereka dapat menimbulkan ketakutan dan keengganan pada hati kaum Muslimin untuk ikut berperang bersama Rasulullah. Dalam salah satu firman-Nya, Allah menjelaskan sikap dari orang-orang munafik:\n\nOrang-orang yang ditinggalkan (tidak ikut berperang), merasa gembira dengan duduk-duduk diam sepeninggal Rasulullah. Mereka tidak suka berjihad dengan harta dan jiwa mereka di jalan Allah dan mereka berkata, \"Janganlah kamu berangkat (pergi berperang) dalam panas terik ini.\" Katakanlah (Muhammad), \"Api neraka Jahanam lebih panas,\" jika mereka mengetahui. (at-Taubah\/9: 81)\n\nKarena dosa besar yang telah mereka lakukan, maka sudah sepantasnya orang-orang munafik menerima siksa yang menghinakan di dunia dan di akhirat, sebagai balasan perbuatan mereka itu.",
      "text_translation": "Mereka menjadikan sumpah-sumpah mereka sebagai perisai, lalu mereka menghalang-halangi (manusia) dari jalan Allah; maka bagi mereka azab yang menghinakan.",
      "text": "اِتَّخَذُوْٓا اَيْمَانَهُمْ جُنَّةً فَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ فَلَهُمْ عَذَابٌ مُّهِيْنٌ ",
      "text_translation_en": "they have made their oaths a cover [for their falseness], and thus they turn others away from the path of God: hence, shameful suffering awaits them.",
      "juz_number": 28
    },
    "17": {
      "text_tafsir_en": "In this verse states that property and children hypocrites can not help save and avoid them from Allah. This verse illustrates that the character and nature of hypocrites is proud to have many children and possessions, as if what they possess can protect and liberate them from the dangers that threaten them. Allah says: And they say, \"We have more wealth and children (than you) and we will not be punished.\" (Saba '\/ 34: 35) Having received great favor in the world, the hypocrites feel that they are God's beloved and will not be punished in the hereafter. According to them, the picture of a person's afterlife is his or her worldly life. If someone is happy in the life of the world, then they are happy in the hereafter. On the other hand, if they are miserable in life, they will suffer in the hereafter. They are mistaken, because their main purpose is to seek God's will. As long as a person seeks God's will in his life, he is protected by it, whether he looks good enough or not. At the end of this verse it is stated that those who declare their property and their children may be used to escape the torment of Allah will be the dwellers of the Hereafter. They will live in it in agony.",
      "text_tafsir": "Dalam ayat ini ditegaskan bahwa harta dan anak-anak orang munafik tidak dapat membantu menyelamatkan dan menghindarkan diri mereka dari azab Allah. Ayat ini menggambarkan bahwa watak dan sifat orang-orang munafik adalah merasa bangga mempunyai anak-anak dan harta yang banyak, seakan-akan apa yang mereka miliki itu dapat membela dan melepaskan mereka dari malapetaka yang mengancam mereka. Allah berfirman:\n\nDan mereka berkata, \"Kami memiliki lebih banyak harta dan anak-anak (daripada kamu) dan kami tidak akan diazab.\" (Saba'\/34: 35)\n\nKarena mendapat nikmat yang besar di dunia, maka orang-orang munafik itu merasa bahwa mereka adalah orang yang dikasihi Allah dan tidak akan diazab di akhirat. Menurut mereka, gambaran kehidupan akhirat bagi seseorang adalah kehidupan dunianya. Jika seseorang berbahagia dalam kehidupan dunia, tentu mereka berbahagia pula dalam kehidupan akhirat. Sebaliknya jika mereka sengsara dalam kehidupan dunia, tentu akan sengsara pula dalam kehidupan akhirat. Dugaan mereka itu keliru, karena tujuan hidup yang utama ialah mencari keridaan Allah. Selama seorang mencari keridaan Allah dalam kehidupannya, selama itu pula ia dilindungi-Nya, baik ia terlihat hidup berkecukupan atau tidak.\n\nPada akhir ayat ini ditegaskan bahwa orang-orang yang menyatakan harta dan anak-anak mereka dapat digunakan untuk menghindarkan diri dari azab Allah akan menjadi penghuni neraka di akhirat. Mereka kelak hidup di dalamnya dengan penuh penderitaan.",
      "text_translation": "Harta benda dan anak-anak mereka tidak berguna sedikit pun (untuk menolong) mereka dari azab Allah. Mereka itulah penghuni neraka, mereka kekal di dalamnya. ",
      "text": "لَنْ تُغْنِيَ عَنْهُمْ اَمْوَالُهُمْ وَلَآ اَوْلَادُهُمْ مِّنَ اللّٰهِ شَيْـًٔاۗ  اُولٰۤىِٕكَ اَصْحٰبُ النَّارِۗ هُمْ فِيْهَا خٰلِدُوْنَ ",
      "text_translation_en": "Neither their worldly possessions nor their offspring will be of the least avail to them against God: it is they who are destined for the fire, therein to abide!",
      "juz_number": 28
    },
    "18": {
      "text_tafsir_en": "Those who claim that their wealth and their children can be used to escape the torment of Allah in the hereafter, they also lie before God in the day of reckoning. They swore that they were truly believers, just as they had sworn to live in the world, as if they could deceive God with such confession. They think that by lying like that, they will be able to avoid the torment that will befall them. This verse signifies that the character and character of a human being during the life of the world will be revealed by God in the hereafter. If their character, nature, and habits are good for life in the world, then they will be good in the hereafter. On the contrary, if their character, nature, and habits are bad for life on earth, it will look bad in the hereafter. In the world they can still deceive the human eye, while in the hereafter they are directly confronted by the All-Knowing, almighty God. In other verses, God describes the attitude of the hypocrites in the Hereafter: And when it is said to them, \"Do not harm the earth!\" They replied, \"We are actually the ones doing the repairs.\" Remember, they are the ones doing the damage, but they are unaware. (al-Baqarah \/ 2: 11-12)",
      "text_tafsir": "Orang-orang yang menyatakan bahwa harta dan anak-anak mereka dapat dipergunakan untuk menghindarkan diri dari azab Allah di akhirat, mereka juga berdusta di hadapan Allah ketika hari perhitungan nanti. Mereka bersumpah bahwa mereka benar-benar termasuk orang-orang beriman, sebagaimana mereka telah bersumpah sewaktu mereka hidup di dunia, seakan-akan mereka dapat mengelabui Allah dengan pengakuan tersebut. Mereka mengira bahwa dengan berdusta seperti itu, mereka akan dapat menghindarkan diri dari azab yang akan ditimpakan kepada mereka.\n\nAyat ini mengisyaratkan bahwa watak dan sifat seorang manusia selama hidup di dunia akan diperlihatkan Allah di akhirat. Jika watak, sifat, dan tabiat mereka baik selama hidup di dunia, maka hal itu akan tampak baik di akhirat. Sebaliknya jika watak, sifat, dan tabiat mereka jelek selama hidup di dunia, hal itu akan tampak jelek di akhirat. Di dunia mereka masih dapat mengelabui mata manusia, sedangkan di akhirat, mereka langsung berhadapan dengan Allah yang Maha Mengetahui lagi Mahakuasa.\n\nDalam ayat-ayat yang lain, Allah menerangkan sikap orang-orang munafik di akhirat, yaitu:\n\nDan apabila dikatakan kepada mereka, \"Janganlah berbuat kerusakan di bumi!\" Mereka menjawab, \"Sesungguhnya kami justru orang-orang yang melakukan perbaikan.\" Ingatlah, sesungguhnya merekalah yang berbuat kerusakan, tetapi mereka tidak menyadari. (al-Baqarah\/2: 11-12)",
      "text_translation": "(Ingatlah) pada hari (ketika) mereka semua dibangkitkan Allah, lalu mereka bersumpah kepada-Nya (bahwa mereka bukan orang musyrik) sebagaimana mereka bersumpah kepadamu; dan mereka menyangka bahwa mereka akan memperoleh sesuatu (manfaat). Ketahuilah, bahwa mereka orang-orang pendusta. ",
      "text": "يَوْمَ يَبْعَثُهُمُ اللّٰهُ جَمِيْعًا فَيَحْلِفُوْنَ لَهٗ كَمَا يَحْلِفُوْنَ لَكُمْ وَيَحْسَبُوْنَ اَنَّهُمْ عَلٰى شَيْءٍۗ  اَلَآ اِنَّهُمْ هُمُ الْكٰذِبُوْنَ",
      "text_translation_en": "On the Day when God will raise them all from the dead, they will swear before Him as they [now] swear before you, thinking that they are on firm ground [in their assumptions]. Oh, verily, it is they, they who are the [greatest] liars!",
      "juz_number": 28
    },
    "19": {
      "text_tafsir_en": "God explains why the hypocrites above were put into the fire of hell because their hearts and minds were influenced by the whisperings of the devil, so that they could no longer remember God, follow his commandments and avoid his prohibition. What is good in their minds is what their desires and desires are good for. Therefore, they vowed to draw other people's sympathy, as if what they were saying was true. The Word of God: And so for every prophet We make enemies of the devils of men and of spirits, some of them whisper to others beautiful words of deceit. And if your Lord wills, they will not do it, then leave them with what they lie. (al-An'am \/ 6: 112) At the end of this verse it is asserted that the hypocrites described above are the army and the devil's envoys. They gathered and held secret negotiations to commit sin and to cause animosity among the Muslims. Their purpose in doing so is to obey their passions. The army and the devil's envoys are the ones who disobey God. Those who disobey God will perish and perish, and in the hereafter they will be cast into hell.",
      "text_tafsir": "Allah menerangkan sebab-sebab orang-orang munafik di atas dimasukkan ke dalam api neraka adalah karena hati dan pikiran mereka telah dipengaruhi oleh bisikan-bisikan setan, sehingga mereka tidak dapat lagi mengingat Allah, mengikuti perintah dan menjauhi larangan-Nya. Yang baik menurut pikiran mereka ialah apa yang menurut nafsu dan keinginan mereka baik. Oleh karena itu, mereka bersumpah untuk menarik simpati orang lain, seakan-akan yang mereka ucapkan itu adalah suatu kebenaran. Firman Allah:\n\nDan demikianlah untuk setiap nabi Kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin, sebagian mereka membisikkan kepada sebagian yang lain perkataan yang indah sebagai tipuan. Dan kalau Tuhanmu menghendaki, niscaya mereka tidak akan melakukannya, maka biarkanlah mereka bersama apa (kebohongan) yang mereka ada-adakan. (al-An'am\/6: 112)\n\nPada akhir ayat ini ditegaskan bahwa orang-orang munafik yang diterangkan di atas adalah tentara dan pesuruh setan. Mereka berkumpul dan mengadakan perundingan rahasia untuk mengerjakan perbuatan dosa dan menimbulkan permusuhan di kalangan kaum Muslimin. Tujuan mereka melakukan usaha yang demikian adalah untuk menuruti hawa nafsu mereka. Tentara dan pesuruh setan itu adalah orang-orang yang durhaka kepada Allah. Orang-orang yang durhaka kepada Allah pasti akan binasa dan hancur, serta di akhirat akan dimasukkan ke dalam neraka.",
      "text_translation": "Setan telah menguasai mereka, lalu menjadikan mereka lupa mengingat Allah; mereka itulah golongan setan. Ketahuilah, bahwa golongan setan itulah golongan yang rugi. ",
      "text": "اِسْتَحْوَذَ عَلَيْهِمُ الشَّيْطٰنُ فَاَنْسٰىهُمْ ذِكْرَ اللّٰهِ ۗ اُولٰۤىِٕكَ حِزْبُ الشَّيْطٰنِۗ  اَلَآ اِنَّ حِزْبَ الشَّيْطٰنِ هُمُ الْخٰسِرُوْنَ",
      "text_translation_en": "Satan has gained mastery over them, and has caused them to remain oblivious of the remem­brance of God. Such as these are Satan’s partisans: oh, verily, it is they, the partisans of Satan, who will truly be the losers!",
      "juz_number": 28
    },
    "20": {
      "text_tafsir_en": "This verse describes those who disobey God, disobey His commands, disobey His commands, and refuse to perform the duties that God has set for them. They are among the despised because the Muslims will defeat them by fighting and capturing them. There are even those who were expelled from their country. This verse reminds the Muslims of the punishment of Allah which was inflicted on the Meccans in the defeat of Mecca. As a result of the Ahzab War the Jews were expelled from the city of Medina for breaking the peace treaty with the Messenger of Allah. Those whom God has described as despicable, cannot be praised by anyone, as it is said in his Word: O our Lord, verily thou hast entered into hell; even a helper to the unjust. (Â'li 'Imran \/ 3: 192) This 20th verse is good news for believers who are under severe trial that they will be able to defeat their enemies and Islam will flourish where -where in the near future.",
      "text_tafsir": "Ayat ini menerangkan tentang orang-orang yang menentang Allah, mereka tidak mengindahkan perintah-perintah-Nya, tidak mematuhi larangan-larangan-Nya, dan enggan mengerjakan kewajiban-kewajiban yang telah ditetapkan Allah bagi mereka. Mereka termasuk orang-orang yang hina karena kaum Muslimin akan mengalahkan mereka dengan memerangi dan menawan mereka. Bahkan ada di antara mereka yang diusir dari negeri mereka.\n\nAyat ini mengingatkan kaum Muslimin akan azab Allah yang ditimpakan kepada orang-orang musyrik Mekah berupa kekalahan pada fath Makkah. Akibat Perang Ahzab orang-orang Yahudi diusir dari kota Medinah karena melanggar perjanjian damai dengan Rasulullah saw. Orang-orang yang telah dinyatakan Allah sebagai orang yang hina, tidak dapat dimuliakan oleh siapa pun, sebagaimana tersebut dalam firman-Nya:\n\nYa Tuhan kami, sesungguhnya orang yang Engkau masukkan ke dalam neraka, maka sungguh, Engkau telah menghinakannya, dan tidak ada seorang penolong pun bagi orang yang zalim. (Â'li 'Imran\/3: 192)\n\nAyat ke-20 ini merupakan kabar gembira bagi orang-orang yang beriman yang sedang menerima cobaan-cobaan yang sangat berat bahwa mereka akan dapat mengalahkan musuh-musuh mereka dan agama Islam akan berkembang di mana-mana dalam waktu dekat.",
      "text_translation": "Sesungguhnya orang-orang yang menentang Allah dan Rasul-Nya, mereka termasuk orang-orang yang sangat hina. ",
      "text": "اِنَّ الَّذِيْنَ يُحَاۤدُّوْنَ اللّٰهَ وَرَسُوْلَهٗٓ اُولٰۤىِٕكَ فِى الْاَذَلِّيْنَ",
      "text_translation_en": "Verily, those who contend against God and His Apostle - it is they who [on Judgment Day] shall find themselves among the most abject.",
      "juz_number": 28
    },
    "21": {
      "text_tafsir_en": "Allah reminds people of His precepts set in the Far Mahfudh and takes place at all times and in all places. His teachings are about the decrees of God and His messenger who will surely defeat all who disobey Him. Among them God has destroyed the people of Noah, Lot, Saleh, Pharaoh and his followers in various ways. Such victories will be won by the Prophet Muhammad and his followers, as well as everyone who practiced Islam in the best way. This is a prayer that is for His servants. Allah says: And verily, Our promise to our servants who are apostles, (that is) will surely be their help. And indeed our soldiers are the ones who will surely win. (as-saffat \/ 37: 171-173) At the end of this verse it is reiterated that God has absolute authority, the power to help his apostles and believers, and to defeat the unbelievers. No one in heaven or on earth could resist His will. He is very easy to do. Allah says: Indeed, when He wants something He just says to it, \"Be it!\" Then be something. (Yasin \/ 36: 82)",
      "text_tafsir": "Allah mengingatkan manusia tentang sunah-Nya yang telah ditetapkan di Lauh Mahfudh dan berlaku di sepanjang masa dan di semua tempat. Sunah-Nya itu ialah mengenai ketetapan Allah dan rasul-Nya yang pasti akan mengalahkan setiap orang yang ingkar kepada-Nya. Di antaranya Allah telah menghancurkan kaum Nuh, kaum Lut, kaum Saleh, Fir'aun serta pengikutnya dengan bermacam-macam cara. Kemenangan seperti itu akan diperoleh pula oleh Nabi Muhammad dan pengikut-pengikutnya, dan juga setiap orang yang benar-benar melaksanakan agama Islam dengan sebaik-baiknya. Ini adalah sunatullah yang berlaku bagi hamba-Nya. Allah berfirman:\n\nDan sungguh, janji Kami telah tetap bagi hamba-hamba Kami yang menjadi rasul, (yaitu) mereka itu pasti akan mendapat pertolongan. Dan sesungguhnya bala tentara Kami itulah yang pasti menang. (as-saffat\/37: 171-173)\n\nPada akhir ayat ini ditegaskan lagi bahwa Allah mempunyai kekuasaan yang mutlak, kuasa menolong rasul-Nya dan orang-orang yang beriman, dan mengalahkan orang-orang kafir. Tidak seorang pun di langit maupun di bumi yang sanggup melawan kehendak-Nya. Dia sangat mudah melaksanakan kehendak-Nya. Allah berfirman:\n\nSesungguhnya urusan-Nya apabila Dia menghendaki sesuatu Dia hanya berkata kepadanya, \"Jadilah!\" Maka jadilah sesuatu itu. (Yasin\/36: 82)",
      "text_translation": "Allah telah menetapkan, “Aku dan rasul-rasul-Ku pasti menang.” Sungguh, Allah Mahakuat, Mahaperkasa.",
      "text": "كَتَبَ اللّٰهُ لَاَغْلِبَنَّ اَنَا۠ وَرُسُلِيْۗ اِنَّ اللّٰهَ قَوِيٌّ عَزِيْزٌ ",
      "text_translation_en": "[For] God has thus ordained: “I shall most certainly prevail, I and My apostles!” Verily, God is powerful, almighty!",
      "juz_number": 28
    },
    "22": {
      "text_tafsir_en": "Ibn Abi hatim, ath-thabrani, Abu Nu'aim, and al-Baihaqi of Ibn 'Abbas, recounted that he said, \"This verse goes down in connection with Abu Ubaidah bin' Abdillah al-Jarrah, which in the Battle of Badr, is always challenged fighting with his father, 'Abdullah al-Jarrah, but he always tried to escape from the war, because his father was constantly searching for him, and he was forced to serve him, so Abu Ubaidah killed his father. this explains that the hypocrites are actually unbelievers, even more dangerous than the ones who openly declare their disbelief. The hypocrites in this verse are people who are always trying and scheming to achieve their goal of destroying Islam and Muslims. Those who disbelieve in Muslims or those who do not try to destroy Islam and Muslims are not included in the verse Here. Muslims are not allowed to associate with unbelievers who are enemies of Islam because that means trying to destroy Islam and Muslims. As for the unbelievers who do not oppress the Muslims and do not try to destroy Islam, the Muslims are allowed to make friends and associate with them, as did the Messenger of Allah himself and his companions. In accordance with the word of God: Allah does not forbid you to be kind and fair to those who do not harass you in religious matters and do not expel you from your hometown. Verily, Allah loves those who are just. (al-Mumtahanah \/ 60: 8) Then it was pointed out that if there were Muslims who were close friends with unbelievers who were hostile to Islam then that would be an unreasonable attitude. Therefore, it is impossible for some believers who truly believe in Allah to be friends with unbelievers who want to destroy Islam. Thus, Muslims are urged to be on guard against any hostility and hostilities with the heathen. Never befriend them, as it will endanger the Muslims. Allah explains that those who have described the strength of their faith and the sincerity of their hearts, such as Abu Ubaidah, are those who have instilled faith in their hearts. So that they could not bear to hear Allah and His Messenger being ridiculed, or Islam being degraded. In addition to having strong faith, God has also strengthened their hearts and souls to bring peace of mind and determination to uphold the religion of God. Therefore, they cannot cooperate with people who are hostile to Islam and Muslims. At the end of this verse is the answer they will receive from God, namely: 1. In the Hereafter they will be placed in a paradise full of delights, and beneath them will flow rivers. They remain in it. 2. Enjoy and enjoy the work they have done throughout their lives and their future here. They are pleased and pleased with the reward God has given them sooner or later. 3. They include those whom God honors for being God's soldiers and sacrificing everything they have to uplift His Word. 4. They include those who are fortunate, because he has successfully fulfilled his life as a servant of God in the world and in the hereafter.",
      "text_tafsir": "Diriwayatkan oleh Ibnu Abi hatim, ath-thabrani, Abu Nu'aim, dan al-Baihaqi dari Ibnu 'Abbas bahwa ia berkata, \"Ayat ini turun berhubungan dengan Abu Ubaidah bin 'Abdillah al-Jarrah, yang mana dalam Perang Badar, selalu ditantang berperang tanding oleh ayahnya, 'Abdullah al-Jarrah. Akan tetapi, ia selalu berusaha menghindarkan diri dari perang tanding itu. Karena terus-menerus dicari dan diburu oleh ayahnya, ia terpaksa melayaninya, sehingga Abu Ubaidah membunuh ayahnya. Maka turunlah ayat ini.\n\nAyat ini menerangkan bahwa sebenarnya orang munafik itu benar-benar kafir, bahkan lebih berbahaya dari orang yang terang-terangan menyatakan kekafirannya. Orang-orang munafik yang dimaksud dalam ayat ini ialah orang-orang yang selalu berusaha dan mengadakan tipu daya dalam mencapai tujuan mereka untuk menghancurkan agama Islam dan kaum Muslimin. Orang-orang kafir yang tidak memusuhi kaum Muslimin atau orang yang tidak berusaha menghancurkan agama Islam dan kaum Muslimin tidak termasuk dalam ayat ini.\n\nKaum Muslimin dilarang berteman dengan orang-orang kafir yang menjadi musuh Islam karena hal itu berarti ikut berusaha menghancurkan Islam dan kaum Muslimin. Sedangkan terhadap orang-orang kafir yang tidak memusuhi kaum Muslimin dan tidak berusaha menghancurkan agama Islam, kaum Muslimin dibolehkan berteman dan bergaul dengan mereka, seperti yang dilakukan oleh Rasulullah saw sendiri dan para sahabat. Sesuai dengan firman Allah:\n\nAllah tidak melarang kamu berbuat baik dan berlaku adil terhadap orang-orang yang tidak memerangimu dalam urusan agama dan tidak mengusir kamu dari kampung halamanmu. Sesungguhnya Allah mencintai orang-orang yang berlaku adil. (al-Mumtahanah\/60: 8)\n\nKemudian ditegaskan, seandainya ada kaum Muslimin yang berteman erat dengan orang kafir yang memusuhi Islam maka hal itu adalah sikap yang tidak wajar. Sebab, tidak mungkin ada orang-orang mukmin yang benar-benar beriman kepada Allah berteman dengan orang kafir yang ingin menghancurkan Islam.\n\nDengan demikian, kaum Muslimin diminta agar selalu waspada setiap terjadi permusuhan dan pertempuran dengan orang-orang kafir. Sekali-kali tidak boleh berteman erat dengan mereka, karena akan membahayakan kaum Muslimin. \n\nAllah menerangkan bahwa orang-orang yang telah diterangkan kekuatan iman dan keikhlasan hati mereka, seperti Abu Ubaidah, adalah orang yang telah tertanam keimanan dalam hatinya. Sehingga mereka tidak tahan mendengar Allah dan Rasul-Nya dicaci-maki orang, atau agama Islam direndahkan.\n\nDi samping mempunyai keimanan yang kuat, Allah juga telah menguatkan hati dan jiwa mereka sehingga menimbulkan ketenangan jiwa dan ketetapan hati dalam menegakkan agama Allah. Oleh karena itu, mereka tidak dapat melakukan kerja sama dengan orang-orang yang memusuhi Islam dan kaum Muslimin.\n\nPada akhir ayat ini diterangkan balasan yang akan mereka peroleh dari Allah, yaitu:\n\n1.Di akhirat mereka akan ditempatkan di dalam surga yang penuh kenikmatan, dan di bawahnya mengalir sungai-sungai. Mereka kekal di dalamnya.\n\n2.Allah rida dan menyukai perbuatan-perbuatan yang telah mereka lakukan selama hidup di dunia dan keadaan mereka di akhirat. Mereka pun rida dan senang terhadap balasan yang dianugerahkan Allah kepada mereka cepat atau lambat.\n\n3.Mereka termasuk orang-orang yang dimuliakan Allah karena telah bersedia menjadi tentara Allah dan mengorbankan segala yang ada pada mereka untuk meninggikan kalimat-Nya.\n\n4.Mereka termasuk orang-orang yang beruntung, karena dirinya telah berhasil melaksanakan tugas hidupnya sebagai hamba Allah di dunia dan di akhirat.",
      "text_translation": "Engkau (Muhammad) tidak akan mendapatkan suatu kaum yang beriman kepada Allah dan hari akhirat saling berkasih sayang dengan orang-orang yang menentang Allah dan Rasul-Nya, sekalipun orang-orang itu bapaknya, anaknya, saudaranya atau keluarganya. Mereka itulah orang-orang yang dalam hatinya telah ditanamkan Allah keimanan dan Allah telah menguatkan mereka dengan pertolongan yang datang dari Dia. Lalu dimasukkan-Nya mereka ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Allah rida terhadap mereka dan mereka pun merasa puas terhadap (limpahan rahmat)-Nya. Merekalah golongan Allah. Ingatlah, sesungguhnya golongan Allah itulah yang beruntung. ",
      "text": "لَا تَجِدُ قَوْمًا يُّؤْمِنُوْنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ يُوَاۤدُّوْنَ مَنْ حَاۤدَّ اللّٰهَ وَرَسُوْلَهٗ وَلَوْ كَانُوْٓا اٰبَاۤءَهُمْ اَوْ اَبْنَاۤءَهُمْ اَوْ اِخْوَانَهُمْ اَوْ عَشِيْرَتَهُمْۗ  اُولٰۤىِٕكَ كَتَبَ فِيْ قُلُوْبِهِمُ الْاِيْمَانَ وَاَيَّدَهُمْ بِرُوْحٍ مِّنْهُ ۗوَيُدْخِلُهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَاۗ رَضِيَ اللّٰهُ عَنْهُمْ وَرَضُوْا عَنْهُۗ  اُولٰۤىِٕكَ حِزْبُ اللّٰهِ ۗ اَلَآ اِنَّ حِزْبَ اللّٰهِ هُمُ الْمُفْلِحُوْنَ ࣖ ",
      "text_translation_en": "Thou canst not find people who [truly] believe in God and the Last Day and [at the same time] love anyone who contends against God and His Apostle - even though they be their fathers, or their sons, or their brothers, or [others of] their kindred. [As for the true believers,] it is they in whose hearts He has inscribed faith, and whom He has strength­ened with inspiration from Himself, and whom [in time] He will admit into gardens through which running waters flow, therein to abide. Well-pleased is God with them, and well-pleased are they with Him. They are God’s partisans: oh, verily, it is they, the partisans of God, who shall attain to a happy state!",
      "juz_number": 28
    }
  },
  "name": "المجادلة",
  "name_translation_en": "The Pleading Woman",
  "name_translation": "Gugatan",
  "name_latin": "Al-Mujadalah"
}