{
  "number": 59,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 24,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse explains that he praised God and exalted all that is in heaven and on earth, purifying it from his unworthy qualities, by his words, deeds, and expressions of heart. God said: The seven heavens, the earth, and all things therein, glorify God. And there is nothing but praise in His praise, but you do not understand them. Truly, He is Oft-Forgiving, Most Forgiving. (al-Isra '\/ 17: 44) From this first verse it is understood that all beings of God in heaven and on earth, whether living beings, such as humans, animals, and plants, or dead things such as stone, water, air , planets, rivers, and so on, glorify Him. Each of them commends according to their circumstances and circumstances. In view of all the creatures of God, it will be known that each being is subject to the laws and regulations that have been established for it. It is as if the creatures are not able to break free from that law and order. If he violates it, he will be damaged or destroyed. These laws and regulations are a matter of obedience. An example is the law of water flowing from high to low. Rainfall falling from the sky over mountainous terrain, will stop the flow if anyone holds it. The only ones that survive are the plants that grow in the mountains. With the growth of plants, the water will enter the soil through its roots, so that the rainwater does not flow directly to the lowlands. The water seems to be organized in such a way that it can be used by humans for drinking, agriculture, and so on. If an area is a barren area, then no rainwater can hold it. Water flows directly into the lowlands to the sea, making it impossible for humans to use, even damaging people with the danger of flooding and drought in the dry season. In this case, water is subject to the laws and regulations that God has set. No one can break that law and the rules, including humans. If humans destroy the forest, then the danger is immediately upon them. On the contrary, if they take good care of them, the benefits will be immediate. There are many other examples that show that all beings are always submissive to God's law, such as the law of attraction, and the laws that apply to humans such as, who will work hard, and who will not work. All human beings are physically subject to this law. Following the law and the decree of God well means being grateful to Him. All things in heaven and on earth, from the smallest particles to the super-galaxies are subject to the rule of God (sunatullah). An example is the mass and orbit of the planets in our solar system forming a stable and perfect dynamic system, and interacting with one another in harmony. All praise or obey Allah. As it has been explained in previous verses that the law of God is circumcision, which is the law of nature. The Shari'ah is the rule and rule of God that the apostles brought to mankind. Humans must be obedient and obedient to Allah and must obey and obey Allah's law. As for the other creatures, they are subject only to the Sunatullah. The man who obeys the two laws of God is the one who is happy in his life here and in the hereafter. At the end of this verse it is stated that Almighty Allah is also Almighty. What it means is that God the Creator of the universe is the Almighty, there is nothing that can violate His law and decree. Anyone who opposes and violates them will feel the consequences directly or indirectly. If in the world they have not received the consequences, the future will surely be felt. He is the creator of all things, and He knows the benefits and benefits of His creation. God knows exactly why something is created and knows exactly the consequences that His creation will bring, whether the consequences are big or small.",
      "text_tafsir": "Ayat ini menerangkan bahwa telah bertasbih kepada Allah dan mengagungkan-Nya segala yang ada di langit dan di bumi, dengan menyucikan-Nya dari sifat-sifat yang tidak layak bagi-Nya, baik dengan ucapan, perbuatan, maupun dengan pernyataan hati sanubarinya. Allah berfirman:\n\nLangit yang tujuh, bumi dan semua yang ada di dalamnya bertasbih kepada Allah. Dan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. Sungguh, Dia Maha Penyantun, Maha Pengampun. (al-Isra'\/17: 44)\n\nDari ayat pertama ini dipahami bahwa seluruh makhluk Allah yang di langit dan di bumi, baik berupa makhluk hidup, seperti manusia, binatang, dan tumbuh-tumbuhan, maupun makhluk mati seperti batu, air, udara, planet, sungai-sungai, dan sebagainya, bertasbih kepada-Nya. Masing-masing bertasbih menurut keadaan dan kejadiannya. Jika diperhatikan seluruh makhluk Allah yang ada, akan diketahui bahwa tiap-tiap makhluk itu tunduk kepada hukum dan ketetapan yang telah ditentukan baginya. Seakan-akan makhluk-makhluk itu tidak sanggup melepaskan diri dari hukum dan ketetapan itu. Jika ia melanggarnya, niscaya ia akan rusak atau hancur. Hukum dan ketetapan ini merupakan sunatullah.\n\nSebagai contoh ialah hukum air yang mengalir dari tempat yang tinggi ke tempat yang rendah. Air hujan yang turun dari langit menimpa daerah pegunungan, akan tertahan alirannya jika ada yang menahannya. Yang menahannya ialah tumbuh-tumbuhan yang tumbuh dengan subur di pegunungan. Dengan adanya tumbuh-tumbuhan, maka air akan masuk ke dalam tanah melalui akar-akarnya, sehingga air hujan tidak langsung mengalir ke tempat yang rendah. Aliran air itu seakan-akan diatur sedemikian rupa sehingga dapat dimanfaatkan oleh manusia untuk minum, pertanian, dan sebagainya. \n\nJika suatu daerah adalah area yang tandus, maka air hujan tidak ada yang menahannya. Air langsung mengalir ke tempat yang rendah menuju laut, sehingga tidak dapat dimanfaatkan manusia, bahkan dapat merusak manusia dengan adanya bahaya banjir dan kekeringan pada musim kemarau. Dalam hal ini, air tunduk kepada hukum dan ketetapan yang ditetapkan Allah. Tidak seorang pun yang dapat mengingkari hukum dan ketetapan itu, termasuk manusia. Jika manusia memusnahkan hutan, maka bahayanya langsung menimpa mereka. Sebaliknya, jika mereka memeliharanya dengan baik, maka manfaatnya langsung pula mereka terima.\n\nBanyak lagi contoh lain yang menunjukkan bahwa seluruh makhluk senantiasa tunduk dan patuh kepada hukum Allah, seperti hukum daya tarik bumi, dan hukum yang berlaku bagi manusia seperti, barang siapa yang rajin akan berhasil, dan barang siapa yang pemalas tidak akan berhasil. Semua manusia secara fisik tunduk kepada hukum ini. Mengikuti hukum dan ketetapan Allah dengan sebaik-baiknya itu berarti bertasbih kepada-Nya.\n\nSeluruh benda baik di langit maupun di bumi, dari partikel terkecil hingga super galaksi tunduk mengikuti ketetapan Allah (sunatullah). Sebagai contoh adalah perbedaan massa dan orbit planet-planet dalam tata surya kita membentuk sistem dinamis yang stabil dan sempurna, dan berinteraksi satu sama lain dengan penuh harmoni. Semua bertasbih atau tunduk pada ketentuan Allah. \n\nSebagaimana telah diterangkan pada ayat-ayat yang lalu bahwa hukum Allah itu berupa sunatullah, yaitu hukum yang berlaku di alam ini. Syariat adalah ketentuan dan aturan Allah yang dibawa oleh para rasul untuk manusia. Manusia pasti tunduk dan patuh kepada sunatullah dan wajib taat dan melaksanakan syariat Allah. Adapun makhluk-makhluk yang lain hanya tunduk kepada sunatullah. Manusia yang tunduk kepada kedua hukum Allah itu adalah manusia yang berbahagia hidupnya di dunia dan di akhirat.\n\nPada akhir ayat ini ditegaskan bahwa Allah Mahaperkasa lagi Mahabijaksana. Maksudnya ialah Allah Pencipta semesta alam adalah Zat Mahaperkasa, tidak ada suatu apa pun yang dapat melanggar hukum dan ketetapan-Nya. Barang siapa yang menentang dan melanggarnya akan merasakan akibatnya baik secara langsung atau tidak. Seandainya di dunia mereka belum menerima akibatnya, di akhirat pasti akan merasakannya. Allah-lah yang menciptakan segala sesuatu, dan Dia mengetahui dengan pasti faedah dan kegunaan penciptaannya. Allah mengetahui dengan pasti sebab sesuatu diciptakan dan mengetahui dengan pasti pula akibat-akibat yang akan ditimbulkan ciptaan-Nya itu, baik akibatnya itu besar atau kecil.",
      "text_translation": "Apa yang ada di langit dan apa yang ada di bumi bertasbih kepada Allah; dan Dialah Yang Mahaperkasa, Mahabijaksana.",
      "text": "سَبَّحَ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۚ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ ",
      "text_translation_en": "ALL THAT IS in the heavens and all that is on earth extols God’s limitless glory: for He alone is almighty, truly wise.",
      "juz_number": 28
    },
    "2": {
      "text_tafsir_en": "In this verse it is explained that among the proofs of the power and wisdom of God is to keep the Jews out of the city of Medina. With his help, the Muslims were able to evict them from their place of residence, while they were the predecessors of the Aus and Khazraj tribes in various fields of life. From before the birth of Jesus, the Jews had lived in the city of Medina. They consist of three tribes, namely the Bani Qainuqa ', the Bani Nadhir, and the Children of Quraidah. After the Prophet Muhammad emigrated to Medinah, he made a peace treaty with the three tribes. Among the contents of the peace treaty are: 1.The Muslims and the Jews work together to create a peaceful atmosphere in the city of Medina. Each of them was released into the religion they believed in. 2.The Muslims and the Jews must help each other and fight against any other people or tribes who want to attack the city of Medina. 3.Any one of them living in or outside the city of Medina is obliged to maintain their security and property. 4. In the event of a dispute or dispute between the Muslims and the Jews, which cannot be resolved, the matter is handed over to the Prophet Muhammad. Despite the peace treaty as described above, in the hearts of the Jews there was still envy and envy of the Prophet Muhammad and the Muslims. They consider themselves sons and daughters of God, and thus the apostle and prophetic are their rights as Jews. According to them, the other tribes were not entitled to that God-given position. Their jealousy and envy increased after seeing the success of the Prophet Muhammad's spread of Islam, and the day grew, but they could not prevent it. However, they always look for opportunities to fulfill their wishes. Allah says: Many of the Scripture Wants to wish that they could return you after your faith, to become infidels again, out of jealousy within them, after the truth was clear to them. So forgive and hold fast, until God gives his command. Indeed, Allah is Almighty over all things. (al-Baqarah \/ 2: 109) At first, they tried to defeat the Prophet Muhammad in an argument, but they always failed to break the reasons he gave. As a result, they began to resort to violence, provocation, and slander. First the Qainuqa Children 'broke the peace treaty that was made with the Messenger of Allah. One day, a Muslim Arab woman entered the Qainuqa Children 'market, and they persecuted her. An Arab who happened to pass by the place tried to defend him, but was raped and beaten to death. The Qainuqa Children 's actions provoked the anger of the Muslims, resulting in fights between the two groups, resulting in loss of property and soul on both sides. Allah's Messenger (may peace be upon him) tried to reconcile it, but they always disobeyed it and practiced it. Because of their attitude of always showing hostility to the Muslims and endangering the security of Medina, the Messenger decided to fight them until they left Medina. It happened after the Badr War. After the events of the Qainuqa Children, the Jews of Bani Nadhir committed treason. They planned the assassination of the Prophet Muhammad. They attempted murder at the time of the Prophet and his companions visited their village. However, their plan failed and the Messenger of Allah (may peace be upon him) survived the attempted assassination. In this regard, Allah says: O you who believe! Remember the favor of Allah upon you when a people intends to attack you with their hands, and Allah holds their hand out of you. And fear Allah, and only in Allah should the believers trust. (al-Ma'idah \/ 5:11) When the Messenger of Allah (may peace be upon him) revealed the plan of killing, he decided to expel Bani Nadhir from the city of Medina. The expulsion took place in Rabiulawal in the fourth year of the Hijri. Among them were settlers in Sham and Khaibar. The Messenger of Allah (may peace be upon him) made this decision, and they secretly built up strength to fight the Muslims. They had alliances with the Meccans and the hypocrites. The Quraida children who were still living in the city of Medinah also joined the alliance. The Messenger of Allah (may peace be upon him) surrounded them for 25 days. Some of them were killed and kicked out. Thus, all the Jews who once lived in Medina had moved to other places, such as Khaibar, Sham, and other states. This is what the expulsion of this verse meant, the expulsion of the Jews from the city of Medina because of their betrayal of the treaty they had made with the Messenger of Allah. This verse explains that God had expelled the Jews, the Bani Qainuqa 'and the Bani Nadhir, from Medina for the first time by providing assistance to Muslims to defeat and expel them. The word \"for the first time\" indicates that there were several times the expulsion of the Jews from Medina. What is meant by this verse is the first expulsion. The next expulsions were the expulsion of the Quraidh Jews after the War of Ahzab, and the expulsion of 'Umar bin al-Khaththab during his caliphate. Believers do not think that Jews can leave the city of Medina, remembering their condition, strength, wealth, knowledge, and equipment. The Jews living in Medina at that time were in better condition than the Muhajirin and Ansar people. They are literate, knowledgeable, and so on, besides their skill in trying, trading and managing things. The facts show that the eviction was carried out. This can strengthen the faith of the Muslims and their belief in God's help. The people of Nadhir again thought that the strong fortifications they had built could save them from the onslaught of the enemies. They believed in his power so much that they became even more bold in criticizing the sheep and slandering the Muslims, so that the Meccans became more and more hostile. The Jews then planned an alliance with the heathen and the hypocrites to fight the Muslims. In such a situation, the Bani Nadhir was suddenly defeated by the Muslims whom they had regarded so lightly. They were even kicked out of Medina. They are only allowed to carry their belongings just as their camels can carry. Some of the Children of Nadhir went to Adhriat (Sham) and some to Khaibar. He then explained the reasons for the defeat, acceptance, and submission of Bani Nadhir to the decision of the Prophet when he came to them. At that time, there was a great fear in their hearts, especially because of the actions of the Prophet sentenced to death by their leader Ka'ab bin Asyraf and added to the actions of the hypocrites who did not keep his promise to them. God described the condition of the Jews of the Bani Nadhir when they left Medina in a state of depravity. They demolished their houses, and closed the streets of their villages, with the intention of making the house unavailable to the Muslims and for carrying as much equipment as possible. They left Medina with anger and resentment towards the Muslims, but they did not want to understand and think about the reasons for their expulsion, whether their decision was appropriate or not. At the end of this verse, Allah warns Muslims who want to use their minds to reflect on the event, and to take lessons from it. If they ponder and think carefully, it will be concluded that the decisions and punishments imposed upon the Children of Nadhir were fair and punitive, even considered light in the light of their deeds and actions.",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa di antara bukti keperkasaan dan kebijaksanaan Allah ialah menjadikan orang Yahudi terusir dari kota Medinah. Atas pertolongan-Nya, kaum Muslimin dapat mengusir mereka dari tempat kediaman mereka, padahal mereka sebelumnya adalah orang-orang yang mempunyai kekuatan menguasai suku Aus dan Khazraj dalam berbagai bidang kehidupan.\n\nSejak sebelum kelahiran Nabi Isa, orang-orang Yahudi telah mendiami kota Medinah. Mereka terdiri atas tiga suku, yaitu suku Bani Qainuqa', Bani Nadhir, dan Bani Quraidhah. Setelah Nabi Muhammad hijrah ke Medinah, beliau mengadakan perjanjian damai dengan ketiga suku itu. Di antara isi perjanjian damai itu ialah:\n\n1.Kaum Muslimin dan orang-orang Yahudi sama-sama berusaha menciptakan suasana damai di kota Medinah. Masing-masing dari mereka dibebaskan memeluk agama yang mereka yakini.\n\n2.Kaum Muslimin dan orang-orang Yahudi wajib saling menolong dan memerangi setiap orang atau kabilah lain yang hendak menyerang kota Medinah.\n\n3.Barang siapa di antara masing-masing mereka bertempat tinggal di dalam atau di luar kota Medinah, wajib dipelihara keamanan dan hartanya.\n\n4.Seandainya terjadi perselisihan atau pertentangan antara kaum Muslimin dan orang-orang Yahudi, yang tidak dapat diselesaikan, maka urusannya diserahkan kepada Nabi Muhammad.\n\nSekalipun telah diadakan perjanjian damai seperti yang telah diterangkan di atas, dalam hati orang-orang Yahudi masih tertanam rasa dengki dan iri hati kepada Nabi Muhammad saw dan kaum Muslimin. Mereka menganggap diri mereka sebagai putra dan kekasih Allah, dengan demikian rasul dan kenabian itu adalah hak mereka sebagai orang Yahudi. Menurut mereka, suku bangsa yang lain tidak berhak atas kedudukan yang diberikan Allah itu. Perasaan dengki dan iri hati mereka semakin bertambah setelah melihat keberhasilan Nabi Muhammad menyebarkan agama Islam, sehingga semakin hari semakin berkembang, sedangkan mereka tidak mampu menghalanginya. Sekalipun demikian, mereka selalu mengintai kesempatan untuk melaksanakan keinginan mereka. Allah berfirman:\n\nBanyak di antara Ahli Kitab menginginkan sekiranya mereka dapat mengembalikan kamu setelah kamu beriman, menjadi kafir kembali, karena rasa dengki dalam diri mereka, setelah kebenaran jelas bagi mereka. Maka maafkanlah dan berlapangdadalah, sampai Allah memberikan perintah-Nya. Sungguh, Allah Mahakuasa atas segala sesuatu. (al-Baqarah\/2: 109)\n\nPada awalnya, mereka mencoba mengalahkan Nabi Muhammad dengan cara berdebat, tetapi mereka selalu gagal dalam mematahkan alasan-alasan yang dikemukakannya. Oleh karena itu, mereka mulai menempuh cara kekerasan, provokasi, dan fitnah.\n\nMula-mula Bani Qainuqa' melanggar perjanjian damai yang telah dibuat dengan Rasulullah saw. Pada suatu hari, seorang perempuan Arab Muslimah masuk pasar Bani Qainuqa', lalu mereka menganiayanya. Seorang Arab yang kebetulan sedang lewat di tempat itu mencoba membelanya, tetapi ia dikeroyok dan dipukuli sampai meninggal dunia. Perbuatan Bani Qainuqa' ini menimbulkan amarah kaum Muslimin, sehingga terjadilah perkelahian antara kedua kelompok, yang menimbulkan kerugian harta dan jiwa pada kedua belah pihak. Rasulullah saw berusaha mendamaikannya, tetapi mereka selalu mengingkarinya dan melakukan keonaran. Karena sikap mereka yang selalu menunjukkan permusuhan kepada kaum Muslimin dan membahayakan keamanan kota Medinah, maka Rasulullah memberi keputusan memerangi mereka sehingga mereka keluar dari kota Medinah. Peristiwa itu terjadi setelah Perang Badar.\n\nSetelah peristiwa Bani Qainuqa', orang-orang Yahudi Bani Nadhir melakukan pengkhianatan pula. Mereka merencanakan pembunuhan atas diri Nabi Muhammad. Percobaan pembunuhan itu mereka lakukan pada waktu Nabi dan para sahabat berkunjung ke perkampungan mereka. Akan tetapi, rencana mereka itu gagal dan Rasulullah saw selamat dari percobaan pembunuhan itu. Sehubungan dengan hal itu, Allah berfirman:\n\nWahai orang-orang yang beriman! Ingatlah nikmat Allah (yang diberikan) kepadamu, ketika suatu kaum bermaksud hendak menyerangmu dengan tangannya, lalu Allah menahan tangan mereka dari kamu. Dan bertakwalah kepada Allah, dan hanya kepada Allah-lah hendaknya orang-orang beriman itu bertawakal. (al-Ma'idah\/5: 11)\n\nSetelah Rasulullah saw membongkar rencana pembunuhan itu, maka beliau memutuskan untuk mengusir Bani Nadhir dari kota Medinah. Pengusiran ini terjadi pada bulan Rabiulawal tahun keempat Hijriah. Di antara mereka ada yang menetap di Syam dan Khaibar. \n\nKeputusan Rasulullah saw ini mereka tentang, dan secara diam-diam mereka menyusun kekuatan untuk memerangi kaum Muslimin. Mereka mengadakan persekutuan dengan orang-orang musyrik Mekah dan orang munafik. Bani Quraidhah yang masih tinggal dalam kota Medinah ikut pula dalam persekutuan itu. Maka Rasulullah saw mengepung mereka selama 25 hari. Di antara mereka ada yang terbunuh dan diusir. \n\nDengan demikian, semua orang Yahudi yang dahulu tinggal di Medinah telah berpindah ke tempat lain, seperti Khaibar, Syam, dan negeri-negeri yang lain. Inilah yang dimaksud dengan pengusiran dalam ayat ini, yaitu pengusiran orang-orang Yahudi dari kota Medinah karena pengkhianatan mereka terhadap perjanjian yang telah mereka buat dengan Rasulullah saw.\n\nAyat ini menerangkan bahwa Allah telah mengusir orang-orang Yahudi, Bani Qainuqa' dan Bani Nadhir, dari Medinah untuk pertama kalinya dengan memberikan pertolongan kepada kaum Muslimin untuk mengalahkan dan mengusir mereka.\n\nPerkataan \"pertama kalinya\" menunjukkan bahwa ada beberapa kali terjadi pengusiran orang-orang Yahudi dari Medinah. Adapun yang dimaksud dalam ayat ini adalah pengusiran pertama. Pengusiran berikutnya ialah pengusiran orang-orang Yahudi Bani Quraidhah setelah Perang Ahzab, dan pengusiran yang dilakukan 'Umar bin al-Khaththab ketika beliau menjadi khalifah.\n\nOrang-orang yang beriman tidak mengira bahwa orang-orang Yahudi dapat terusir dari kota Medinah, mengingat keadaan, kekuatan, kekayaan, pengetahuan, dan perlengkapan mereka. Orang-orang Yahudi yang tinggal di Medinah pada waktu itu lebih baik keadaannya dibandingkan dengan kaum Muhajirin dan kaum Ansar. Mereka banyak yang pandai tulis baca, banyak yang berilmu, dan sebagainya, di samping kelihaian mereka dalam berusaha, berdagang dan mengurus sesuatu. Kenyataan menunjukkan bahwa pengusiran itu terlaksana. Hal ini dapat memperkuat iman kaum Muslimin dan kepercayaan mereka akan adanya pertolongan Allah.\n\nBani Nadhir semula mengira bahwa benteng-benteng yang kokoh yang telah mereka buat dapat menyelamatkan mereka dari serangan musuh-musuh. Mereka percaya benar akan kekuatannya, sehingga mereka semakin berani mengadu domba dan memfitnah kaum Muslimin, sehingga orang-orang musyrik Mekah bertambah kuat rasa permusuhannya. Lalu orang Yahudi merencanakan persekutuan dengan orang-orang musyrik dan orang-orang munafik untuk memerangi kaum Muslimin.\n\nDalam keadaan yang demikian itu, tiba-tiba Bani Nadhir dikalahkan oleh kaum Muslimin yang mereka anggap enteng selama ini. Bahkan mereka diusir dari Medinah. Mereka hanya diperkenankan membawa barang-barang mereka sekadar yang dapat dibawa unta-unta mereka. Sebagian Bani Nadhir pergi ke Adhriat (Syam) dan sebahagian lagi ke Khaibar.\n\nKemudian diterangkan sebab-sebab kekalahan, penerimaan, dan ketundukan Bani Nadhir kepada keputusan Rasulullah saw ketika beliau datang kepada mereka. Pada waktu itu, timbullah ketakutan yang amat sangat dalam hati mereka, terutama karena tindakan Rasulullah menjatuhkan hukuman mati kepada pimpinan mereka yaitu Ka'ab bin Asyraf dan ditambah lagi dengan tindakan orang-orang munafik yang tidak menepati janjinya terhadap mereka.\n\nAllah menerangkan keadaan orang-orang Yahudi Bani Nadhir di waktu mereka akan meninggalkan Medinah dalam keadaan terusir. Mereka meruntuhkan rumah-rumah mereka, dan menutup jalan-jalan yang ada dalam perkampungan mereka, dengan maksud agar rumah itu tidak dapat dipakai kaum Muslimin dan agar mereka dapat membawa peralatannya sebanyak mungkin. Mereka meninggalkan Medinah dengan penuh kemarahan dan dendam kepada kaum Muslimin, tetapi mereka tidak mau memahami dan memikirkan sebab-sebab mereka diusir, apakah keputusan itu telah sesuai dengan tindakan mereka atau tidak.\n\nPada akhir ayat ini, Allah memperingatkan kaum Muslimin yang mau menggunakan pikirannya agar merenungkan peristiwa itu, dan mengambil pelajaran darinya. Jika mereka merenungkan dan memikirkan dengan baik, tentu akan berkesimpulan bahwa keputusan dan hukuman yang dijatuhkan kepada Bani Nadhir itu adalah keputusan dan hukuman yang setimpal, bahkan dianggap ringan mengingat perbuatan dan tindakan yang telah mereka lakukan.",
      "text_translation": "Dialah yang mengeluarkan orang-orang kafir di antara Ahli Kitab dari kampung halamannya pada saat pengusiran yang pertama. Kamu tidak menyangka, bahwa mereka akan keluar dan mereka pun yakin, benteng-benteng mereka akan dapat mempertahankan mereka dari (siksaan) Allah; maka Allah mendatangkan (siksaan) kepada mereka dari arah yang tidak mereka sangka-sangka. Dan Allah menanamkan rasa takut ke dalam hati mereka; sehingga memusnahkan rumah-rumah mereka dengan tangannya sendiri dan tangan orang-orang mukmin. Maka ambillah (kejadian itu) untuk menjadi pelajaran, wahai orang-orang yang mempunyai pandangan!",
      "text": "هُوَ الَّذِيْٓ اَخْرَجَ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ مِنْ دِيَارِهِمْ لِاَوَّلِ الْحَشْرِۗ مَا ظَنَنْتُمْ اَنْ يَّخْرُجُوْا وَظَنُّوْٓا اَنَّهُمْ مَّانِعَتُهُمْ حُصُوْنُهُمْ مِّنَ اللّٰهِ فَاَتٰىهُمُ اللّٰهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوْا وَقَذَفَ فِيْ قُلُوْبِهِمُ الرُّعْبَ يُخْرِبُوْنَ بُيُوْتَهُمْ بِاَيْدِيْهِمْ وَاَيْدِى الْمُؤْمِنِيْنَۙ فَاعْتَبِرُوْا يٰٓاُولِى الْاَبْصَارِ ",
      "text_translation_en": "He it is who turned out of their homes, at the time of [their] first gathering [for war], such of the followers of earlier revelation as were bent on denying the truth. You did not think [O believers] that they would depart [without resistance] - just as they thought that their strongholds would protect them against God: but God came upon them in a manner which they had not expected, and cast terror into their hearts; [and thus] they destroyed their homes by their own hands as well as the hands of the believers. Learn a lesson, then, O you who are endowed with insight!",
      "juz_number": 28
    },
    "3": {
      "text_tafsir_en": "In this verse Allah emphasizes that the death penalty for their leader and the punishment of expulsion is a punishment equivalent to the crime they have committed. In fact, the punishment was still milder compared to the punishment given to the Muslims in the Badr War, much less so than the punishment given to the Quraida tribe. Especially compared to the punishments God inflicted on the people of the past.",
      "text_tafsir": "Dalam ayat ini Allah menegaskan bahwa hukuman mati bagi pemimpin mereka dan hukuman pengusiran itu adalah hukuman yang sebanding dengan kejahatan yang telah mereka lakukan. Sebenarnya hukuman itu masih lebih ringan jika dibandingkan dengan hukuman yang diberikan kepada orang-orang musyrik di Perang Badar, lebih ringan dari hukuman yang diberikan kepada suku Bani Quraidhah. Apalagi dibanding dengan hukuman-hukuman yang ditimpakan Allah kepada umat-umat yang lalu.",
      "text_translation": "Dan sekiranya tidak karena Allah telah menetapkan pengusiran terhadap mereka, pasti Allah mengazab mereka di dunia. Dan di akhirat mereka akan mendapat azab neraka. ",
      "text": "وَلَوْلَآ اَنْ كَتَبَ اللّٰهُ عَلَيْهِمُ الْجَلَاۤءَ لَعَذَّبَهُمْ فِى الدُّنْيَاۗ وَلَهُمْ فِى الْاٰخِرَةِ عَذَابُ النَّارِ ",
      "text_translation_en": "And had it not been for God’s having ordained banishment for them, He would indeed have imposed [yet greater] suffering on them in this world: still, in the life to come there awaits them suffering through fire:",
      "juz_number": 28
    },
    "4": {
      "text_tafsir_en": "The punishment that the Jews received was that they were defeated by the believers and expelled from Medina. The punishment came because they were against God and His apostles, and denied His revelation. It has been said that everyone who obeys Allah and His Messenger will be punished and humiliated in this world and in the Hereafter. According to al-judges of 'A'isha, the Bani Nadhir Jews who lived and cultivated palm trees in the city of Medina were restricted in their actions by the Messenger of Allah six months after the Badr War. Then they were driven out of the city of Medina and allowed to carry their wealth just as their camels could carry. Before that, the Messenger of Allah (may peace be upon him) ordered them to control and cut down their palm trees.",
      "text_tafsir": "Hukuman yang diperoleh orang-orang Yahudi ialah mereka dikalahkan oleh orang-orang yang beriman dan diusir dari Medinah. Hukuman itu terjadi karena mereka menentang Allah dan rasul-Nya, serta mendustakan wahyu-Nya. Telah menjadi sunatullah bahwa setiap orang yang mendurhakai Allah dan rasul-Nya akan ditimpa azab dan mendapat kehinaan di dunia dan di akhirat.\n\nMenurut riwayat al-hakim dari 'Aisyah, golongan Yahudi Bani Nadhir yang tinggal dan berkebun kurma dalam kota Medinah telah dibatasi gerak-gerik mereka oleh Rasulullah saw enam bulan setelah Perang Badar. Kemudian mereka diusir ke luar kota Medinah dan dibolehkan membawa harta kekayaan mereka sekadar apa yang dapat dibawa oleh unta mereka. Sebelum itu Rasulullah saw memerintahkan untuk menguasai dan menebang pohon kurma mereka.",
      "text_translation": "Yang demikian itu karena sesungguhnya mereka menentang Allah dan Rasul-Nya. Barangsiapa menentang Allah, maka sesungguhnya Allah sangat keras hukuman-Nya. ",
      "text": "ذٰلِكَ بِاَنَّهُمْ شَاۤقُّوا اللّٰهَ وَرَسُوْلَهٗ  ۖوَمَنْ يُّشَاۤقِّ اللّٰهَ فَاِنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ",
      "text_translation_en": "this, because they cut themselves off from God and His Apostle: and as for him who cuts himself off from God and His Apostle - verily, God is severe in retribution!",
      "juz_number": 28
    },
    "5": {
      "text_tafsir_en": "It is narrated from Ibn Ishaq and Ibn Jarir from Qatadah, Mujahid, and Yazid bin Ruman that when the Prophet reached the place of the Children of Nadhir, they hid in their fortresses. The Messenger of Allah (may peace be upon him) ordered the Muslims to cut down and burn their palm trees to bring forth smoke. The children of Nadhir cried out to the Messenger of Allah (may peace be upon him), \"O Muhammad, you have forbidden the destruction of this land and condemned those who did it, but why did you cut down the palm trees and burn it?\" Therefore, it is in the minds of those who believe in doubt. They said, \"We will ask the Messenger of Allah (may peace be upon him). Do we receive the reward for cutting down the palm trees, or do we sin because we do not know?\" So this verse goes on to explain that the decree of burning and burning the palm trees of the Jews was at the command of God, and that God allowed to destroy the property of the infidels if necessary. All the actions of the Prophet against the Jews of the Children of Nadhir, whether to destroy their palm trees or not, were all based on the order of God to purge the Medina from the crime of the Children of Nadhir. At the end of this verse it is affirmed that God commanded this to glorify and encourage the believers, as well as to humiliate and multiply the sorrows of the Jews of the Bani Nadhir. The pain of losing the war, the pain of being displaced from their hometowns, and the sadness of the destruction of their property.",
      "text_tafsir": "Diriwayatkan dari Ibnu Ishaq dan Ibnu Jarir yang berasal dari Qatadah, Mujahid, dan Yazid bin Ruman bahwa ketika Rasulullah sampai ke tempat Bani Nadhir, mereka bersembunyi dalam benteng-benteng mereka. Rasulullah saw memerintahkan kaum Muslimin menebang dan membakar pohon kurma mereka sehingga memunculkan asap. Bani Nadhir berteriak memanggil Rasulullah saw, \"Hai Muhammad, engkau telah melarang mengadakan kerusakan di muka bumi ini dan mencela orang-orang yang berbuat kerusakan itu, akan tetapi mengapa engkau menebang pohon kurma dan membakarnya?\" Oleh karena itu, timbullah pada pikiran orang-orang yang beriman keragu-raguan. Mereka berkata, \"Kami akan menanyakan kepada Rasulullah saw. Apakah kami memperoleh pahala karena menebang pohon-pohon kurma itu, atau kami berdosa karena kami tidak mengetahui.\" Maka turunlah ayat ini yang menerangkan bahwa perintah penebangan dan pembakaran pohon kurma orang-orang Yahudi itu adalah atas perintah Allah, dan Allah membenarkan untuk merusak harta orang-orang kafir seandainya hal itu diperlukan.\n\nSemua tindakan yang dilakukan Rasulullah terhadap orang-orang Yahudi Bani Nadhir, baik merobohkan pohon-pohon kurma mereka atau tidak, semua itu berdasarkan perintah Allah dengan maksud membersihkan Medinah dari kejahatan Bani Nadhir.\n\nPada akhir ayat ini ditegaskan bahwa Allah memerintahkan yang demikian itu untuk memuliakan dan meningkatkan semangat orang-orang yang beriman, serta menghinakan dan melipatgandakan kedukaan orang-orang Yahudi Bani Nadhir. Kedukaan karena kalah dalam berperang, kedukaan karena terusir dari kampung halaman, dan kedukaan karena kemusnahan harta benda mereka.",
      "text_translation": "Apa yang kamu tebang di antara pohon kurma (milik orang-orang kafir) atau yang kamu biarkan (tumbuh) berdiri di atas pokoknya, maka (itu terjadi) dengan izin Allah; dan karena Dia hendak memberikan kehinaan kepada orang-orang fasik.",
      "text": "مَا قَطَعْتُمْ مِّنْ لِّيْنَةٍ اَوْ تَرَكْتُمُوْهَا قَاۤىِٕمَةً عَلٰٓى اُصُوْلِهَا فَبِاِذْنِ اللّٰهِ وَلِيُخْزِيَ الْفٰسِقِيْنَ ",
      "text_translation_en": "Whatever [of their] palm trees you may have cut down, [O believers,] or left standing on their roots, was [done] by God’s leave, and in order that He might confound the iniquitous.",
      "juz_number": 28
    },
    "6": {
      "text_tafsir_en": "This verse describes the law of fai ', which is the spoils obtained from the enemy, without war. This happened because the enemy had given up and claimed defeat, before the battle. The possessions left by the Bani Nadhir after they were expelled from the city of Medina are considered fai ', since the Bani Nadhir surrendered to the Muslims before the war. Allah explained that the treasures of the Children of Nadhir that they had left as a result of being expelled from Medina fell into the hands of the Messenger of Allah (may peace be upon him), and thus belonged to Allah and His Messenger. The property was not distributed to the warriors, as was the case with the spoils. As the property was acquired without war, without the use of cavalry and troops, it was as if no effort had been made by the Muslim army to acquire the property. The Jews of the Bani Nadhir who owned the property claimed that they had confessed their defeat before the war, and were willing to accept the terms that God and His Messenger had set for them. The property is used to uphold the religion of God and the public interest. According to al-Qurthubi, that the fai 'property that God gave to His Messenger was not taken away and used by the Messenger at all, but the Messenger took it only for the needs of his family. While the rest is used for the benefit and welfare of the Muslims. God explains that His Sunnah applies to all His creatures in every circumstance, time, and place, that is to defeat and cause fear in the hearts of His enemies. Among them was Allah who made the hearts of the Children of Nadhir fearful, and they surrendered to the Messenger of Allah. Because they surrendered, God granted His Messenger the power to take possession of the Children of Nadhir. Therefore, the Muslim army was not entitled to it. At the end of this verse, Allah reminds us of His power over all His creatures. If Allah wills, He will instill fear and fear of His enemies without a battle, just like what happened to the Bani Nadhir. They gave up, even in strong fortresses.",
      "text_tafsir": "Ayat ini menerangkan hukum fai', yaitu harta rampasan yang diperoleh dari musuh, tanpa peperangan. Hal ini terjadi karena musuh telah menyerah dan mengaku kalah, sebelum terjadinya pertempuran. Harta-harta yang ditinggalkan Bani Nadhir setelah mereka diusir dari kota Medinah dianggap sebagai fai', karena Bani Nadhir menyerah kepada kaum Muslimin sebelum terjadi peperangan.\n\nAllah menerangkan bahwa harta-harta Bani Nadhir yang mereka tinggalkan karena diusir dari Medinah jatuh ke tangan Rasulullah saw dengan kehendak Allah, sehingga menjadi milik Allah dan rasul-Nya. Harta itu tidak dibagi-bagikan kepada tentara yang berperang, sebagaimana yang berlaku pada harta rampasan perang (ganimah). Karena harta itu diperoleh tanpa melalui peperangan, tanpa menggunakan tentara berkuda dan berunta, seakan-akan tidak ada usaha dari tentara kaum Muslimin dalam mendapatkan harta itu. Orang-orang Yahudi Bani Nadhir yang memiliki harta itu telah menyatakan bahwa mereka mengaku kalah sebelum terjadinya peperangan, dan bersedia menerima syarat-syarat yang ditetapkan Allah dan rasul-Nya bagi mereka. Harta itu digunakan untuk menegakkan agama Allah dan kepentingan umum.\n\nMenurut al-Qurthubi, bahwa harta fai' yang diserahkan Allah kepada Rasul-Nya tidak diambil dan dipergunakan Rasul semuanya, tetapi Rasul hanya mengambil sekedar untuk kebutuhan keluarganya. Sedangkan sisa yang lain dipergunakan untuk kemaslahatan dan kesejahteraan kaum Muslimin.\n\nAllah menerangkan bahwa sunah-Nya telah berlaku bagi semua makhluk ciptaan-Nya pada setiap keadaan, masa, dan tempat, yaitu mengalahkan dan menimbulkan rasa takut di dalam hati musuh-musuh rasul-Nya. Di antaranya adalah Allah telah menjadikan dalam hati Bani Nadhir rasa takut, sehingga mereka menyerah kepada Rasulullah saw. Karena mereka telah menyerah, maka Allah memberikan wewenang kepada rasul-Nya untuk menguasai harta Bani Nadhir. Oleh karenanya, tentara kaum Muslimin tidak berhak memperolehnya.\n\nPada akhir ayat ini, Allah mengingatkan kekuasaan-Nya atas semua makhluk ciptaan-Nya. Jika Allah menghendaki, Dia menanamkan rasa takut dan gentar musuh-musuh-Nya tanpa pertempuran, sebagaimana yang telah terjadi pada Bani Nadhir. Mereka menyerah kalah, walaupun berada dalam benteng-benteng yang kukuh.",
      "text_translation": "Dan harta rampasan fai' dari mereka yang diberikan Allah kepada Rasul-Nya, kamu tidak memerlukan kuda atau unta untuk mendapatkannya, tetapi Allah memberikan kekuasaan kepada rasul-rasul-Nya terhadap siapa yang Dia kehendaki. Dan Allah Mahakuasa atas segala sesuatu.",
      "text": "وَمَآ اَفَاۤءَ اللّٰهُ عَلٰى رَسُوْلِهٖ مِنْهُمْ فَمَآ اَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَّلَا رِكَابٍ وَّلٰكِنَّ اللّٰهَ يُسَلِّطُ رُسُلَهٗ عَلٰى مَنْ يَّشَاۤءُۗ وَاللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ",
      "text_translation_en": "Yet [remember:] whatever [spoils taken] from the enemy God has turned over to His Apostle, you did not have to spur horse or riding-camel for its sake: but God gives His apostles mastery over whomever He wills - for God has the power to will anything.",
      "juz_number": 28
    },
    "7": {
      "text_tafsir_en": "This verse explains that the fairies' wealth derived from the infidels, such as the treasures of the Quraida, the Bani Nadhir, the people of Fadak and the Khaibar, was then handed over to Allah by His Messenger, and used for the common good, not shared with the army of Muslims . Then described the distribution of the treasure to Allah, the Prophet, the Prophet's relatives of the Children of Hashim and the Children of Muththalib, the poor orphans, the poor in need, and those who ran out of money on their way. After the Messenger of Allah (may peace be upon him) died, then the fourth and fifth parts of the Messenger were used for the purpose of those who continued their duties, such as the fighters in the cause of Allah, the dads, and so on. Some Shiafi'i followers believe that the Prophet's portion was given to bodies that sought to support the Muslims and to uphold Islam. The Ibnus-sabil referred to in this verse are those who have been displaced for good cause, because of their cost and the displaced have no place to live. It is further explained that Allah set such divisions aimed at preventing them from falling under the power of the rich and dividing them, so that the property would only rotate among them as it was practiced in the Arabian period of ignorance. Allah instructs the Muslims to abide by the conditions that have been decided, both in terms of fai 'and' ganimah '. The property is lawful for the Muslims and everything forbidden by Allah should be avoided and not taken away. This verse contains the general principles of Islam, which is to obey the Messenger by obeying his commands and abstaining from his prohibition, for obeying the Messenger of Allah in fact obeying Allah. Everything that the Messenger of Allah conveyed came from Allah, as He said: And it was not what He said (the Qur'an) according to His will. No other (the Qur'an) is a revealed revelation (to him). (an Najm \/ 53: 3-4) The Messenger of Allah (may peace be upon him) conveyed everything to mankind with the purpose of explaining the religion of Allah found in the Qur'an. Allah says: (They are sent by us) with the evidence and the scriptures. And We send down to you the Qur'an, that you may explain to men what is revealed to them and that they may think. (an-Nahl \/ 16: 44) Verse 44 of this surah an-Nahl warns Muslims to carry out the hadith of the Messenger of Allah, just as they carry out the Qur'anic messages, since they are one inseparable unity. At the end of verse 7, God commands mankind to obey Him by doing all His commandments and abstaining from His prohibition. Not fearing God means disobedience to Him. Every wicked person will be punished with a painful punishment.",
      "text_tafsir": "Ayat ini menerangkan bahwa harta fai' yang berasal dari orang kafir, seperti harta-harta Bani Quraidhah, Bani Nadhir, penduduk Fadak dan Khaibar, kemudian diserahkan Allah kepada Rasul-Nya, dan digunakan untuk kepentingan umum, tidak dibagi-bagikan kepada tentara kaum Muslimin. Kemudian diterangkan pembagian harta fai itu untuk Allah, Rasulullah, kerabat-kerabat Rasulullah dari Bani Hasyim dan Bani Muththalib, anak-anak yatim yang fakir, orang-orang miskin yang memerlukan pertolongan, dan orang-orang yang kehabisan uang belanja dalam perjalanan.\n\nSetelah Rasulullah saw wafat, maka bagian Rasul yang empat perlima dan yang seperlima dari seperlima itu digunakan untuk keperluan orang-orang yang melanjutkan tugas kerasulan, seperti para pejuang di jalan Allah, para dai, dan sebagainya. Sebagian pengikut Syafi'i berpendapat bahwa bagian Rasulullah itu diserahkan kepada badan-badan yang mengusahakan kemaslahatan kaum Muslimin dan untuk menegakkan agama Islam.\n\nIbnus-sabil yang dimaksud dalam ayat ini ialah orang-orang yang terlantar dalam perjalanan untuk tujuan baik, karena kehabisan ongkos dan orang-orang yang terlantar tidak mempunyai tempat tinggal. Kemudian diterangkan bahwa Allah menetapkan pembagian yang demikian bertujuan agar harta itu tidak jatuh ke bawah kekuasaan orang-orang kaya dan dibagi-bagi oleh mereka, sehingga harta itu hanya berputar di kalangan mereka saja seperti yang biasa dilakukan pada zaman Arab Jahiliah.\n\nAllah memerintahkan kaum Muslimin agar mengikuti ketentuan-ketentuan yang telah diputuskan itu, baik mengenai harta fai' maupun harta ganimah. Harta itu halal bagi kaum Muslimin dan segala sesuatu yang dilarang Allah hendaklah mereka jauhi dan tidak mengambilnya.\n\nAyat ini mengandung prinsip-prinsip umum agama Islam, yaitu agar menaati Rasulullah dengan melaksanakan segala perintahnya dan menjauhi larangannya, karena menaati Rasulullah saw pada hakikatnya menaati Allah juga. Segala sesuatu yang disampaikan Rasulullah berasal dari Allah, sebagaimana firman-Nya:\n\nDan tidaklah yang diucapkannya itu (Al-Qur'an) menurut keinginannya. Tidak lain (Al-Qur'an itu) adalah wahyu yang diwahyukan (kepadanya). (an Najm\/53: 3-4)\n\nRasulullah saw menyampaikan segala sesuatu kepada manusia dengan tujuan untuk menjelaskan agama Allah yang terdapat dalam Al-Qur'an. Allah berfirman:\n\n(Mereka Kami utus) dengan membawa keterangan-keterangan (mukjizat) dan kitab-kitab. Dan Kami turunkan Adh-dzikr (Al-Qur'an) kepadamu, agar engkau menerangkan kepada manusia apa yang telah diturunkan kepada mereka dan agar mereka memikirkan. (an-Nahl\/16: 44)\n\nAyat 44 surah an-Nahl ini mengisyaratkan kepada kaum Muslimin agar melaksanakan hadis-hadis Rasulullah, sebagaimana melaksanakan pesan-pesan Al-Qur'an, karena keduanya merupakan satu kesatuan yang tidak terpisahkan.\n\nPada akhir ayat 7 ini, Allah memerintahkan manusia bertakwa kepada-Nya dengan melaksanakan segala perintah-Nya dan menjauhi larangan-Nya. Tidak bertakwa kepada Allah berarti durhaka kepada-Nya. Setiap orang yang durhaka itu akan ditimpa azab yang pedih.",
      "text_translation": "Harta rampasan (fai') dari mereka yang diberikan Allah kepada Rasul-Nya (yang berasal) dari penduduk beberapa negeri, adalah untuk Allah, Rasul, kerabat (Rasul), anak-anak yatim, orang-orang miskin dan untuk orang-orang yang dalam perjalanan, agar harta itu jangan hanya beredar di antara orang-orang kaya saja di antara kamu. Apa yang diberikan Rasul kepadamu maka terimalah. Dan apa yang dilarangnya bagimu maka tinggalkanlah. Dan bertakwalah kepada Allah. Sungguh, Allah sangat keras hukuman-Nya. ",
      "text": "مَآ اَفَاۤءَ اللّٰهُ عَلٰى رَسُوْلِهٖ مِنْ اَهْلِ الْقُرٰى فَلِلّٰهِ وَلِلرَّسُوْلِ وَلِذِى الْقُرْبٰى وَالْيَتٰمٰى وَالْمَسٰكِيْنِ وَابْنِ السَّبِيْلِۙ كَيْ لَا يَكُوْنَ دُوْلَةً ۢ بَيْنَ الْاَغْنِيَاۤءِ مِنْكُمْۗ وَمَآ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ وَمَا نَهٰىكُمْ عَنْهُ فَانْتَهُوْاۚ وَاتَّقُوا اللّٰهَ ۗاِنَّ اللّٰهَ شَدِيْدُ الْعِقَابِۘ ",
      "text_translation_en": "Whatever [spoils taken] from the people of those villages God has turned over to His Apostle - [all of it] belongs to God and the Apostle, and the near of kin [of deceased believers], and the orphans, and the needy, and the wayfarer, so that it may not be [a benefit] going round and round among such of you as may [already] be rich. Hence, accept [willing­ly] whatever the Apostle* gives you [thereof], and refrain from [demanding] anything that he withholds from you; and remain conscious of God: for, verily, God is severe in retribution.",
      "juz_number": 28
    },
    "8": {
      "text_tafsir_en": "This verse explains that the people who are entitled to the division of fai 'property in verse 7 above, are the Muhajirin people because they are considered relatives of the Messenger of Allah. They as Muhajirin had come to Medinah following the Messenger of Allah (may peace be upon him) by leaving their hometowns, relatives, possessions, and a generous helping hand. In Medina they lived in poverty, but they were the defenders of the Messenger and fighters in the way of God. As with this verse, Allah ordered the Prophet Muhammad to pay attention to them by giving some of these fairies to them. Then God described the characteristics of the Muhajirin as follows: 1. Those who believe in Allah and His Messenger, they show their devotion only to Allah by sacrificing everything they have just to seek His will. 2. People who are willing to leave their homes and property to obey the commands of God and His Messenger. 3. People who dared to sacrifice their souls and souls to defend God and His Messenger. It is narrated that the poverty and suffering of the Muhajirin were so great that some tied a rope to their stomachs to alleviate their hunger. However, they do not expose their poverty and suffering to others. In another verse, Allah instructs the Muslims to provide for them, while also mentioning their characteristics: (What you are infecting) is for those who are hindered (in the cause of jihad) in the way of Allah, so that he does not can strive on earth; (others) who do not know, think that they are rich because they take care of themselves. You (Muhammad) know them by nature, they do not force others. Whatever good property you infest, surely Allah knows. (al-Baqarah \/ 2: 273) Therefore, Allah provided for them a great reward as described in a hadith of the Prophet saw: The Messenger of Allah (may peace be upon him) said, \"Give glad tidings of the poor Muhajirin with perfect light on the Day of Judgment. enter heaven first half a day before the rich. Half a day (on the Day of Resurrection) is five hundred years (time on earth). \" (History of Abu Dawud from Sa'id al-Khudri) People who have such qualities and qualities as the Muhajirin exist all the time during the struggle to uphold the religion of Allah. Therefore, the precepts in this verse apply to Muslims today and Muslims in the future.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang yang berhak memperoleh pembagian harta fai' dalam ayat 7 di atas, adalah orang-orang Muhajirin karena mereka dianggap kerabat Rasulullah saw. Mereka sebagai Muhajirin telah datang ke Medinah mengikuti Rasulullah saw berhijrah dengan meninggalkan kampung halaman, sanak keluarga, harta benda, dan handai tolan yang biasa membantu mereka. Di Medinah mereka hidup dalam keadaan miskin, tetapi mereka adalah pembela Rasul dan pejuang di jalan Allah. Seakan-akan dengan ayat ini, Allah memerintahkan Nabi Muhammad agar memperhatikan mereka dengan menyerahkan sebagian fai' ini untuk mereka.\n\nKemudian Allah menerangkan sifat-sifat orang-orang Muhajirin itu sebagai berikut: \n\n1.Orang-orang yang beriman kepada Allah dan Rasul-Nya, mereka menunjukkan ketaatan mereka hanya kepada Allah saja dengan mengorbankan semua yang mereka miliki hanya untuk mencari keridaan-Nya.\n\n2.Orang-orang yang rela meninggalkan rumah dan harta bendanya untuk melaksanakan perintah Allah dan Rasul-Nya.\n\n3.Orang-orang yang berani mengorbankan jiwa dan raganya untuk membela Allah dan Rasul-Nya.\n\nDiriwayatkan bahwa kemiskinan dan penderitaan orang-orang Muhajirin sedemikian rupa sehingga ada yang mengikatkan tali ke perut mereka untuk mengurangi rasa lapar. Namun demikian, mereka tidak menampakkan kemiskinan dan penderitaan mereka kepada orang lain.\n\nPada ayat yang lain, Allah memerintahkan kaum Muslimin agar memberi nafkah kepada mereka, di samping juga menyebutkan sifat-sifat mereka:\n\n(Apa yang kamu infakkan) adalah untuk orang-orang fakir yang terhalang (usahanya karena jihad) di jalan Allah, sehingga dia tidak dapat berusaha di bumi; (orang lain) yang tidak tahu, menyangka bahwa mereka adalah orang-orang kaya karena mereka menjaga diri (dari meminta-minta). Engkau (Muhammad) mengenal mereka dari ciri-cirinya, mereka tidak meminta secara paksa kepada orang lain. Apa pun harta yang baik yang kamu infakkan, sungguh, Allah Maha Mengetahui. (al-Baqarah\/2: 273)\n\nOleh karena itu, Allah menyediakan pahala yang besar untuk mereka sebagaimana diterangkan dalam sebuah hadis Nabi saw: \n\nRasulullah saw bersabda, \"Berilah kabar gembira wahai kaum Muhajirin yang miskin dengan cahaya yang sempurna di hari Kiamat. Kalian masuk surga lebih dahulu setengah hari sebelum orang-orang kaya. Setengah hari (pada hari Kiamat) adalah selama lima ratus tahun (masa di dunia).\" (Riwayat Abu Dawud dari Sa'id al-Khudri)\n\nOrang yang memiliki sifat dan keadaan seperti orang Muhajirin itu ada sepanjang masa selama ada perjuangan menegakkan agama Allah. Oleh karena itu, perintah dalam ayat ini berlaku juga bagi kaum Muslimin saat ini dan kaum Muslimin di masa yang akan datang.",
      "text_translation": "(Harta rampasan itu juga) untuk orang-orang fakir yang berhijrah yang terusir dari kampung halamannya dan meninggalkan harta bendanya demi mencari karunia dari Allah dan keridaan(-Nya) dan (demi) menolong (agama) Allah dan Rasul-Nya. Mereka itulah orang-orang yang benar. ",
      "text": "لِلْفُقَرَاۤءِ الْمُهٰجِرِيْنَ الَّذِيْنَ اُخْرِجُوْا مِنْ دِيَارِهِمْ وَاَمْوَالِهِمْ يَبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَرِضْوَانًا وَّيَنْصُرُوْنَ اللّٰهَ وَرَسُوْلَهٗ ۗ اُولٰۤىِٕكَ هُمُ الصّٰدِقُوْنَۚ ",
      "text_translation_en": "[Thus, part of such war-gains shall be given] to the poor among those who have forsaken the domain of evil: those who have been driven from their homelands and their possessions, seeking favour with God and [His] goodly acceptance, and who aid [the cause of] God and His Apostle: it is they, they who are true to their word!",
      "juz_number": 28
    },
    "9": {
      "text_tafsir_en": "This verse describes the attitude of the believers of the Ansar people in accepting and helping their brethren the poor Muslims, and the statement of Allah praising their attitude. The attributes of the Ansar were: 1. They loved the Muhajirin, and wished the Muhajirin as much as they wished it to be. The Messenger of Allah (may peace be upon him) associated the Muhajirin people with the Ansar, as if they were siblings. The Ansar people provided some of their homes for the Muhajirin, and sought out the Ansar women to be the wives of the Muhajirin and so on. 'Umar bin al-Khaththab once said, \"I ascribe to the caliphate after me, that they may know the rights of the Muhajirin and protect their honor. before the coming of the Muhajirin, for Allah to accept their good and forgive them all. \" Ibn Mundhir, from Yazid bin al-Aslam, narrated that the Ansar people said, \"O Messenger of Allah, this is our land, some for us Ansar and some for Muhajirin.\" The Prophet (peace be upon him) said, \"No, just fulfill their needs and for the sake of the two fruits, the land is yours.\" They said, \"We are pleased with the decision.\" So this verse comes down which describes the character of the Ansar people. 2. Ansar people did not want to acquire the fai 'property as it was given to the Muhajirin. It is reported that the Messenger of Allah (may peace be upon him) said to the people of Ansar, \"Indeed, our relatives (Muhajirin) have left behind their possessions and their children and have migrated to your country.\" They said, \"Our property has been divided between us.\" The Prophet said, \"Or something else?\" They said, \"What is the Messenger of Allah?\" He said, \"They are people who don't work, so get some tamarind and distribute it to them.\" They replied, \"All right, Prophet.\" 3.They gave priority to the Muhajirin over themselves, even if they were in trouble, so that one Ansar had two wives, and the other he divorced in order to marry his friend Muhajirin. Narrated by al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i of Abu Hurairah, he said, \"A man came to the Messenger of Allah, and said, 'I am hungry.' Asking for food, but no, he said, 'Is no one willing to accept this person as a guest tonight? Know that whoever wants to accept this man as a guest (and feed) tonight, will be favored by Allah Abu thalhah, one of the Ansar people, said, 'I am the Messenger of Allah.' Then he went to meet his wife and said, 'Respect the Messenger of Allah's Messenger.' His wife replied, 'By Allah, there is no food but food for the children. \"When the children are ready for dinner, put them to sleep, turn off the light, and let us wait for the night so that we may receive the Messenger of Allah (may peace be upon him).\" So his wife did this morning. that night and he said, 'God was really impressed that night for what the wives did. Then this verse comes down to the incident. \"It was narrated by al-Wahidi of Muharib bin Ditsar of Ibn 'Umar that a friend of the Messenger of Allah (may peace be upon him) was given the head of a goat. and the head of the goat was sent to his companion, but he sent it to another, and it went on to the seven houses, and to the house of the first; and this history is related to the decline of this verse. asserting that those who can control himself by following the religion of God, so that he may lose a great deal of wealth, self-esteem, and self-esteem, are the lucky ones. They have succeeded in achieving his purpose as God has outlined. In a hadith the Prophet (peace be upon him) made it clear that he said: gathering dust (which is sticky) on one's face while fighting in the way of God with the smoke of Hell forever, and will never accumulate in the heart of a servant of thought and faith forever. (An-Nasa'i History) In another hadith it is explained: The Messenger of Allah said, \"Protect yourselves from unrighteous acts; who before you have caused bloodshed among them, and shall have justified their blood. \" (History of Ahmad, al-Bukhari, Muslim, and al-Baihaqi of Jabir bin 'Abdullah) The Prophet also said in another hadith: (Three groups) who are free from charity, who pay alms, honor guests, and give something to the poor. (Ath-thabrani history)",
      "text_tafsir": "Dalam ayat ini diterangkan sikap orang-orang mukmin dari golongan Ansar dalam menerima dan menolong saudara-saudara mereka orang-orang Muhajirin yang miskin, dan pernyataan Allah yang memuji sikap mereka itu. Sifat-sifat orang Ansar itu ialah:\n\n1.Mereka mencintai orang-orang Muhajirin, dan menginginkan agar orang Muhajirin itu memperoleh kebaikan sebagaimana mereka menginginkan kebaikan itu untuk dirinya. Rasulullah saw memper-saudarakan orang-orang Muhajirin dengan orang-orang Ansar, seakan-akan mereka saudara kandung. Orang-orang Ansar menyedia-kan sebagian rumah-rumah mereka untuk orang-orang Muhajirin, dan mencarikan perempuan-perempuan Ansar untuk dijadikan istri orang-orang Muhajirin dan sebagainya.\n\n'Umar bin al-Khaththab pernah berkata, \"Aku mewasiatkan kepada khalifah yang diangkat sesudahku, agar mereka mengetahui hak orang Muhajirin dan memelihara kehormatan mereka. Dan aku berwasiat agar berbuat baik kepada orang-orang Ansar, orang yang tinggal di kota Medinah dan telah beriman sebelum kedatangan orang Muhajirin, agar Allah menerima kebaikan mereka dan memaafkan segala kesalahan mereka.\"\n\nDiriwayatkan oleh Ibnu Mundhir dari Yazid bin al-Aslam diterangkan bahwa orang Ansar berkata, \"Ya Rasulullah, bagi dia tanah kami ini, yang sebagian untuk kami kaum Ansar dan sebagian lagi untuk kaum Muhajirin.\" Nabi saw menjawab, \"Tidak, penuhi saja keperluan mereka dan bagi dualah buah kurma itu, tanah itu tetap kepunyaanmu.\" Mereka berkata, \"Kami rida atas keputusan itu.\" Maka turunlah ayat ini yang menggambarkan sifat-sifat orang-orang Ansar.\n\n2.Orang Ansar tidak berkeinginan memperoleh harta fai' itu seperti yang telah diberikan kepada kaum Muhajirin. Diriwayatkan bahwa Rasulullah saw berkata kepada orang-orang Ansar, \"Sesungguhnya saudara-saudara kami (Muhajirin) telah meninggalkan harta-harta dan anak-anak mereka dan telah hijrah ke negerimu.\" Mereka berkata, \"Harta kami telah terbagi-bagi di antara kami.\" Rasulullah berkata, \"Atau yang lain dari itu?\" Mereka berkata, \"Apa ya Rasulullah?\" Beliau berkata, \"Mereka adalah orang yang tidak bekerja, maka sediakan tamar dan bagikanlah kepada mereka.\" Mereka menjawab, \"Baik ya Rasulullah.\"\n\n3.Mereka mengutamakan orang Muhajirin atas diri mereka, sekalipun mereka sendiri dalam kesempitan, sehingga ada seorang Ansar mempunyai dua orang istri, kemudian yang seorang diceraikannya agar dapat dikawini temannya Muhajirin.\n\nDiriwayatkan oleh al-Bukhari, Muslim, at-Tirmidhi, dan an-Nasa'i dari Abu Hurairah, ia berkata, \"Seorang laki-laki telah datang kepada Rasulullah saw, dan berkata, 'Aku lapar. Maka Rasulullah berkata kepada istri-istrinya menanyakan makanan, tapi tidak ada, beliau berkata, 'Apakah tidak ada seorang yang mau menerima orang ini sebagai tamu malam ini? Ketahuilah bahwa orang yang mau menerima laki-laki ini sebagai tamu (dan memberi makan) malam ini, akan diberi rahmat oleh Allah. Abu thalhah, seorang dari golongan Ansar, berkata, 'Saya ya Rasulullah. Maka ia pergi menemui istrinya dan berkata, 'Hormatilah tamu Rasulullah. Istrinya menjawab, 'Demi Allah, tidak ada makanan kecuali makanan untuk anak-anak. Abu thalhah berkata, 'Apabila anak-anak hendak makan malam, tidurkanlah mereka, padamkanlah lampu biarlah kita menahan lapar pada malam ini agar kita dapat menerima tamu Rasulullah. Maka hal itu dilakukan istrinya. Pagi-pagi besoknya Abu thalhah menghadap Rasulullah saw menceritakan peristiwa malam itu dan beliau bersabda, 'Allah benar-benar kagum malam itu terhadap perbuatan suami-istri tersebut. Maka ayat ini turun berkenaan dengan peristiwa itu.\"\n\nDiriwayatkan pula oleh al-Wahidi dari Muharib bin Ditsar dari Ibnu 'Umar bahwa seorang sahabat Rasulullah saw dari golongan Ansar diberi kepala kambing. Timbul dalam pikirannya bahwa mungkin ada orang lain lebih memerlukan dari dirinya. Seketika itu juga kepala kambing itu dikirimkan kepada kawannya, tetapi oleh kawannya itu dikirim pula kepada kawannya yang lain, sehingga kepala kambing itu berpindah-pindah pada tujuh rumah dan akhirnya kembali ke rumah orang yang pertama. Riwayat ini ada hubungannya dengan penurunan ayat ini.\n\nAllah selanjutnya menegaskan bahwa orang-orang yang dapat mengendalikan dirinya dengan mengikuti agama Allah, sehingga ia dapat menghilangkan rasa loba terhadap harta, sifat kikir, dan sifat mengutamakan diri sendiri, adalah orang-orang yang beruntung. Mereka telah berhasil mencapai tujuan hidupnya sebagaimana yang telah digariskan Allah.\n\nDalam sebuah hadis Nabi saw dijelaskan bahwa beliau bersabda:\n\nTidak akan berkumpul debu-debu (yang lengket) pada wajah seseorang ketika berjuang di jalan Allah dengan asap neraka Jahannam selama-lamanya, dan tidak akan berkumpul pada hati seorang hamba sifat kikir dan keimanan selama-lamanya. (Riwayat an-Nasa'i)\n\nDalam hadis lain dijelaskan:\n\nRasulullah bersabda, \"Peliharalah dirimu dari perbuatan zalim, sesungguhnya perbuatan zalim (menimbulkan) kegelapan di hari Kiamat, peliharalah dirimu dari sifat-sifat kikir, karena sesungguhnya kikir itu menghancurkan orang-orang yang sebelum kamu, menimbulkan pertumpahan darah di antara mereka dan akan menghalalkan yang mereka haramkan.\" (Riwayat Ahmad, al-Bukhari, Muslim, dan al-Baihaqi dari Jabir bin 'Abdullah)\n\nNabi saw juga bersabda dalam hadis lain:\n\n(Tiga golongan) yang terbebas dari sifat kikir, yaitu orang yang membayarkan zakat, memuliakan tamu, dan memberikan sesuatu kepada orang yang susah. (Riwayat ath-thabrani)",
      "text_translation": "Dan orang-orang (Ansar) yang telah menempati kota Madinah dan telah beriman sebelum (kedatangan) mereka (Muhajirin), mereka mencintai orang yang berhijrah ke tempat mereka. Dan mereka tidak menaruh keinginan dalam hati mereka terhadap apa yang diberikan kepada mereka (Muhajirin); dan mereka mengutamakan (Muhajirin), atas dirinya sendiri, meskipun mereka juga memerlukan. Dan siapa yang dijaga dirinya dari kekikiran, maka mereka itulah orang-orang yang beruntung. ",
      "text": "وَالَّذِيْنَ تَبَوَّءُو الدَّارَ وَالْاِيْمَانَ مِنْ قَبْلِهِمْ يُحِبُّوْنَ مَنْ هَاجَرَ اِلَيْهِمْ وَلَا يَجِدُوْنَ فِيْ صُدُوْرِهِمْ حَاجَةً مِّمَّآ اُوْتُوْا وَيُؤْثِرُوْنَ عَلٰٓى اَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ  ۗوَمَنْ يُّوْقَ شُحَّ نَفْسِهٖ فَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَۚ ",
      "text_translation_en": "And [it shall be offered, too, unto the poor from among] those who, before them, had their abode in this realm and in faith - [those] who love all that come to them in search of refuge, and who harbour in their hearts no grudge for whatever the others may have been given, but rather give them preference over themselves, even though poverty be their own lot: for, such as from their own covetousness are saved - it is they, they that shall attain to a happy state!",
      "juz_number": 28
    },
    "10": {
      "text_tafsir_en": "This verse explains that the next generation of Muslims, after the end of the Muhajirin and Ansar generations, until the day of Resurrection prayed to Allah, which means, \"O our Lord, forgive us our sins and the sins of our brothers and sisters first believe us. \" There are several things to be taken from this verse, namely: 1. If one prays, then the prayer begins for oneself, then for others. 2.Kaum Muslims with each other have a brotherly relationship, such as a sibling relationship. They pray that God will forgive all their sins, both now and in the past. 3.The Muslims must love the companions of the Messenger of Allah (may peace be upon him), for they have set an example in good relations with fellow human beings. If one wants to live a happy life in the world and in the hereafter, he should imitate the brotherhood that the Muhajirin and Ansar have established. This 10th verse is closely linked to the previous verse (verse 9). Therefore, the purpose of this verse is to explain how the Muhajirin people who left their hometowns, their families and their possessions in Mecca were related to the Ansar believers who accepted the Muhajirin people in their hometown and their love. , which they do solely to seek God's will and to uphold the religion of God and to show their true faith, so should the Muslim relationship that comes afterwards. Let them help one another and strengthen the brotherhood in raising the word of God. From this verse it can be understood that the relationship of the emigrant and the people of the land who received them, can create a strong bond of brotherhood between the people, since there are elements of faith, sincerity, and mutual help, just as the people have done. Muhajirin and the Ansar people. In this situation there is the greatest opportunity for a believer to perform various acts that shape the attributes of God-fearing and acceptable. Ibn Abi Laila said, \"Humans are divided into several levels namely the Muhajirin, the Ansar, and the later generations who have always followed the footsteps of Muhajirin and Ansar. Therefore, we should strive to enter one of these three levels. is mentioned in the prayer of the believers, which means, \"O our Lord, do not let our hearts be envious of those who believe.\" Envy and revenge are the source of all the evils and evils that lead men to perdition, injustice, and shed blood on the earth Allah said: And the first (first) converts among the Muhajirin and Ansar and those who followed them well, Allah invited them and they have given to Allah, and He has provided for them a paradise which flows beneath the rivers, and dwells therein forever. . That's a great victory. (at-Taubah \/ 9: 100) At the end of this verse it is explained that the people mentioned in verse 10 say that Allah is Most Merciful to His servants, and abundant in His grace. Therefore, they ask that He grant them their prayers. Ibn 'Umar narrated that he heard a man meet some Muhajirin, then recited the verse, \"Lil fuqara'il-muhajirin\" (one of the Muhajirin's followers), and then one said to him, \"They are people Muhajirin, are you one of them. \" The man replied, \"No.\" Then it was read to him again: \"Wal-ladhina tabawwa'ud-dara wal-imana min qablihim\" (and those who had occupied the city of Medina and had believed before their arrival). Then one of them said to him, \"Are they of Ansar? Are you from them?\" He replied, \"No.\" Then the verse was read: \"Wal-ladhina ja'u min ba'dihim\". Then someone asked him, \"Are you from them?\" He replied, \"I hope so.\" Then he said, \"Don't some of them criticize others?\" This verse shows that among believers there is no need to criticize one another.",
      "text_tafsir": "Ayat ini menerangkan bahwa generasi kaum Muslimin yang datang kemudian, setelah berakhirnya generasi Muhajirin dan Ansar, sampai datangnya hari Kiamat nanti berdoa kepada Allah, yang artinya, \"Wahai Tuhan kami, ampunilah dosa-dosa kami dan dosa-dosa saudara-saudara kami seagama yang lebih dahulu beriman daripada kami.\"\n\nAda beberapa hal yang dapat diambil dari ayat ini, yaitu:\n\n1.Jika seseorang berdoa, maka doa itu dimulai untuk diri sendiri, kemudian untuk orang lain.\n\n2.Kaum Muslimin satu dengan yang lain mempunyai hubungan persaudaraan, seperti hubungan saudara seibu-sebapak. Mereka saling mendoakan agar diampuni Allah segala dosa-dosanya, baik yang sekarang, maupun yang terdahulu.\n\n3.Kaum Muslimin wajib mencintai para sahabat Rasulullah saw, karena mereka telah memberikan contoh dalam berhubungan yang baik dengan sesama manusia. Jika seseorang ingin hidupnya bahagia di dunia dan di akhirat, hendaklah mencontoh hubungan persaudaraan yang telah dilakukan kaum Muhajirin dan Ansar itu.\n\nAyat ke-10 ini mempunyai hubungan erat dengan ayat sebelumnya (ayat ke-9). Oleh karena itu, maksud ayat ini ialah menjelaskan bagaimana hubungan orang-orang Muhajirin yang telah meninggalkan kampung halaman, keluarga, dan harta mereka di Mekah dengan orang-orang Ansar yang beriman yang menerima orang-orang Muhajirin dengan penuh kecintaan dan persaudaraan di kampung halaman mereka, yang mereka lakukan semata-mata untuk mencari keridaan Allah dan bersama-sama menegakkan agama Allah serta menunjukkan iman mereka yang benar, demikian pulalah hendaknya hubungan kaum Muslimin yang datang sesudahnya. Hendaklah mereka tolong-menolong dan mempererat persaudaraan dalam meninggikan kalimat Allah.\n\nDari ayat ini dapat dipahami bahwa hubungan orang yang sedang berhijrah dan penduduk negeri yang menerima mereka, dapat menimbulkan hubungan persaudaraan yang kuat di antara manusia, asal dalam hubungan itu terdapat unsur-unsur keimanan, keikhlasan, dan tolong-menolong, seperti yang telah dilakukan kaum Muhajirin dan kaum Ansar. Dalam situasi ini terdapat kesempatan yang paling banyak bagi seorang mukmin untuk melakukan berbagai perbuatan yang membentuk sifat-sifat takwa dan diridai Allah.\n\nIbnu Abi Laila berkata, \"Manusia terbagi kepada beberapa tingkatan yaitu tingkatan Muhajirin, tingkatan Ansar, dan tingkatan generasi sesudahnya yang selalu mengikuti jejak Muhajirin dan Ansar. Oleh karena itu, hendaknya kita berupaya agar dapat masuk ke dalam salah satu dari tiga tingkatan tersebut.\n\nKemudian disebutkan lanjutan doa orang-orang yang beriman itu, yang artinya, \"Wahai Tuhan kami, janganlah Engkau timbulkan dalam hati kami rasa dengki kepada orang-orang yang beriman.\"\n\nRasa dengki dan dendam adalah sumber segala kejahatan dan maksiat yang mendorong orang berbuat kebinasaan, kezaliman, dan menumpahkan darah di muka bumi. Allah berfirman:\n\nDan orang-orang yang terdahulu lagi yang pertama-tama (masuk Islam) di antara orang-orang Muhajirin dan Ansar dan orang-orang yang mengikuti mereka dengan baik, Allah rida kepada mereka dan mereka pun rida kepada Allah. Allah menyediakan bagi mereka surga-surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung. (at-Taubah\/9: 100)\n\nPada akhir ayat ini dijelaskan bahwa orang-orang yang tersebut dalam ayat 10 ini mengatakan bahwa Allah Maha Penyayang kepada para hamba-Nya, dan banyak melimpahkan rahmat-Nya. Oleh karena itu, mereka mohon agar Dia memperkenankan doa-doa mereka.\n\nDiriwayatkan dari Ibnu 'Umar bahwa ia mendengar seorang laki-laki bertemu dengan sebagian orang Muhajirin, maka dibacakan ayat, \"Lil fuqara'il-muhajirin\" (bagi orang fakir golongan Muhajirin), kemudian salah seorang berkata kepadanya, \"Mereka itu orang-orang Muhajirin, apakah kamu termasuk sebagian dari mereka.\" Orang itu menjawab, \"Tidak.\" Kemudian dibacakan pula kepadanya: \"Wal-ladhina tabawwa'ud-dara wal-imana min qablihim\" (dan orang-orang yang telah menempati kota Medinah dan telah beriman sebelum kedatangan mereka). Kemudian salah seorang berkata kepadanya, \"Mereka itu golongan Ansar, apakah engkau dari golongan mereka?\" Ia menjawab, \"Tidak.\" Kemudian dibacakan ayat: \"Wal-ladhina ja'u min ba'dihim\" (orang-orang yang datang kemudian), Seseorang juga bertanya kepadanya, \"Apakah engkau dari golongan mereka?\" Ia menjawab, \"Aku mengharap demikian.\" Kemudian ia berkata, \"Bukankah sebagian mereka mencela sebagian yang lain?\" Ayat ini menunjukkan bahwa antara orang-orang mukmin tidak boleh mencela sesama mereka.",
      "text_translation": "Dan orang-orang yang datang sesudah mereka (Muhajirin dan Ansar), mereka berdoa, “Ya Tuhan kami, ampunilah kami dan saudara-saudara kami yang telah beriman lebih dahulu dari kami, dan janganlah Engkau tanamkan kedengkian dalam hati kami terhadap orang-orang yang beriman. Ya Tuhan kami, Sungguh, Engkau Maha Penyantun, Maha Penyayang.”  ",
      "text": "وَالَّذِيْنَ جَاۤءُوْ مِنْۢ بَعْدِهِمْ يَقُوْلُوْنَ رَبَّنَا اغْفِرْ لَنَا وَلِاِخْوَانِنَا الَّذِيْنَ سَبَقُوْنَا بِالْاِيْمَانِ وَلَا تَجْعَلْ فِيْ قُلُوْبِنَا غِلًّا لِّلَّذِيْنَ اٰمَنُوْا رَبَّنَآ اِنَّكَ رَءُوْفٌ رَّحِيْمٌ ࣖ ",
      "text_translation_en": "And so, they who come after them pray: “O our Sustainer! Forgive us our sins, as well as those of our brethren who preceded us in faith, and let not our hearts entertain any unworthy thoughts or feelings against [any of] those who have attained to faith. O our Sustainer! Verily, Thou art compassionate, a dispenser of grace!”",
      "juz_number": 28
    },
    "11": {
      "text_tafsir_en": "Ibn Ishaq, Ibn Mundhir, and Abu Nu'aim of Ibn 'Abbas, reported that this verse is related to a group of people from the Children of Auf, including' Abdullah bin Ubay bin Salul, Wadi'ah bin Malik, Suwaid, and Da ' is, sent to the Children of Nadhir as described in this verse. Allah said to the Messenger of Allah (may peace be upon him): \"Do you not wonder that Muhammad saw the deeds of the hypocrites? They promised the Jews the Bani Nadhir, contrary to their own will. The hypocrites led by 'Abdullah bin Ubay told the Jews of Bani Nadhir that they were close friends, because they kept hostility with the Muslims. \" They said, \"O Bani Nadhir, if you were all driven out of your country as Muhammad saw and the Muslims wanted, we would certainly be with you, and no one could prevent us from joining you.\" Then the hypocrites said, \"O Bani Nadhir, if you were to fight Muhammad we would have helped you and would have killed your enemies\", in fact all that the hypocrites had promised was a lie. They easily disobey the promise they have made even though it is bound by the oath. Allah knows that they are lying. The word \"God sees that they are really liars\" is a miracle that will happen in the future. It is said that the hypocrites had promised to the Children of Nadhir, but Allah declared that the hypocrites would not keep his promise. That will be proven later. The announcement of an event that would occur later today included proof of the miracle of the Qur'an. 'Abdullah bin Ubay and his friends saw the Muslims besieging Bani Nadhir, sending two messengers to convey the message that he and his friends would come to their aid with all their might, to free them from the siege of Muhammad. After Bani Nadhir was surrounded by Muslims for many days, the promised relief did not come. Finally, the Jews of Bani Nadhir were convinced that the promise of 'Abdullah bin Ubay and his friends was a false promise. Then fear and trembling were in their hearts. Therefore, they claimed to surrender to the Messenger of Allah unconditionally. The Messenger of Allah (may peace be upon him) decreed that they should accept the punishment imposed upon them, and forcibly leave the city of Medina.",
      "text_tafsir": "Diriwayatkan oleh Ibnu Ishaq, Ibnu Mundhir, dan Abu Nu'aim dari Ibnu 'Abbas bahwa ayat ini turun berhubungan dengan segolongan orang dari Bani Auf, di antaranya ialah 'Abdullah bin Ubay bin Salul, Wadi'ah bin Malik, Suwaid, dan Da'is, diutus kepada Bani Nadhir sebagaimana diterangkan ayat ini.\n\nAllah mengatakan kepada Rasulullah saw, \"Apakah engkau tidak heran hai Muhammad melihat tindakan-tindakan orang-orang munafik itu? Mereka menjanjikan sesuatu kepada orang-orang Yahudi Bani Nadhir, yang berlawanan dengan keinginan mereka sendiri. Orang-orang munafik yang dipimpin oleh 'Abdullah bin Ubay mengatakan kepada orang Yahudi Bani Nadhir bahwa mereka adalah teman akrab, karena mereka menyimpan permusuhan dengan kaum Muslimin.\"\n\nMereka mengatakan, \"Hai Bani Nadhir, jika kamu sekalian diusir dari negerimu sebagaimana dikehendaki Muhammad saw dan kaum Muslimin, pastilah kami akan bersama-sama dengan kamu, dan tidak ada seorang pun yang dapat menghalangi kami ikut serta dengan kamu sekalian.\"\n\nSelanjutnya orang-orang munafik itu mengatakan, \"Hai Bani Nadhir, jika kamu sekalian diperangi Muhammad kami pasti menolongmu dan ikut menumpas musuh-musuh kamu\", kenyataannya semua yang dijanjikan orang-orang munafik itu bohong belaka. Mereka dengan mudah mengingkari janji yang telah mereka janjikan walaupun janji itu dikuatkan dengan sumpah. Allah mengetahui bahwa mereka berdusta.\n\nPerkataan \"Allah menyaksikan bahwa mereka benar-benar pendusta\" merupakan suatu kabar gaib yang akan terjadi pada masa yang akan datang. Sebagaimana disebutkan bahwa orang-orang munafik telah menjanjikan pertolongan kepada Bani Nadhir, tetapi Allah menyatakan bahwa orang-orang munafik itu tidak akan menepati janjinya. Hal itu benar-benar terbukti di kemudian hari. Pemberitaan suatu kejadian yang akan terjadi di kemudian hari ini termasuk bukti kemukjizatan Al-Qur'an.\n\n'Abdullah bin Ubay dan kawan-kawannya ketika melihat kaum Muslimin mengepung Bani Nadhir, mengirim dua orang utusan untuk menyampaikan pesan bahwa ia dan kawan-kawannya akan datang membantu dengan segala kekuatan yang ada pada mereka, untuk membebaskan mereka dari kepungan Muhammad. Setelah Bani Nadhir dikepung rapat oleh kaum Muslimin selama berhari-hari, bantuan yang dijanjikan itu tidak kunjung datang. Akhirnya orang Yahudi Bani Nadhir yakin bahwa janji 'Abdullah bin Ubay dan kawan-kawannya itu adalah janji bohong belaka. Maka timbullah rasa takut dan gentar dalam hati mereka. Oleh karena itu, mereka menyatakan menyerah kepada Rasulullah saw tanpa syarat. Maka Rasulullah saw menetapkan bahwa mereka harus menerima hukuman yang ditetapkan bagi mereka, dan keluar dari kota Medinah dengan paksa.",
      "text_translation": "Tidakkah engkau memperhatikan orang-orang munafik yang berkata kepada saudara-saudaranya yang kafir di antara Ahli Kitab, “Sungguh, jika kamu diusir niscaya kami pun akan keluar bersama kamu; dan kami selama-lamanya tidak akan patuh kepada siapa pun demi kamu, dan jika kamu diperangi pasti kami akan membantumu.” Dan Allah menyaksikan, bahwa mereka benar-benar pendusta. ",
      "text": "۞ اَلَمْ تَرَ اِلَى الَّذِيْنَ نَافَقُوْا يَقُوْلُوْنَ لِاِخْوَانِهِمُ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ لَىِٕنْ اُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيْعُ فِيْكُمْ اَحَدًا اَبَدًاۙ وَّاِنْ قُوْتِلْتُمْ لَنَنْصُرَنَّكُمْۗ وَاللّٰهُ يَشْهَدُ اِنَّهُمْ لَكٰذِبُوْنَ ",
      "text_translation_en": "ART THOU NOT aware of how those who would always dissemble [their real feelings] speak to their truth-denying brethren from among the followers of earlier revelation: “If you are driven away, we shall most certainly go forth with you, and shall never pay heed to anyone against you; and if war is waged against you, we shall most certainly come to your succour.” But God bears witness that they are most flagrantly lying:",
      "juz_number": 28
    },
    "12": {
      "text_tafsir_en": "In this verse God reaffirmed the truth of the news that a future event would occur by stating that if the Bani Nadhir were expelled from the city of Medina, no hypocrites would accompany them. Similarly, if Muhammad saw to fight the Children of Nadhir, they would not help and the Children of Nadhir would be defeated, because Allah would not help them.",
      "text_tafsir": "Pada ayat ini Allah menegaskan kebenaran kembali pemberitaan akan terjadinya suatu peristiwa pada masa yang akan datang dengan menyatakan bahwa sebenarnya jika Bani Nadhir itu diusir dari kota Medinah, tidak ada orang munafik yang ikut bersama mereka. Demikian pula jika Muhammad saw memerangi Bani Nadhir, mereka pun tidak akan memberikan pertolongan dan Bani Nadhir akan kalah, karena Allah tidak memberi pertolongan kepada mereka.",
      "text_translation": "Sungguh, jika mereka diusir, orang-orang munafik itu tidak akan keluar bersama mereka, dan jika mereka di-perangi; mereka (juga) tidak akan menolongnya; dan kalau pun mereka menolongnya pastilah mereka akan berpaling lari ke belakang, kemudian mereka tidak akan mendapat pertolongan. ",
      "text": "لَىِٕنْ اُخْرِجُوْا لَا يَخْرُجُوْنَ مَعَهُمْۚ وَلَىِٕنْ قُوْتِلُوْا لَا يَنْصُرُوْنَهُمْۚ وَلَىِٕنْ نَّصَرُوْهُمْ لَيُوَلُّنَّ الْاَدْبَارَۙ ثُمَّ لَا يُنْصَرُوْنَ ",
      "text_translation_en": "[for] if those [to whom they have pledged themselves] are indeed driven away, they will not go forth with them; and if war is waged against them, they will not come to their succour; and even if they [try to] succour them, they will most certainly turn their backs [in flight], and in the end will [themselves] find no succour.",
      "juz_number": 28
    },
    "13": {
      "text_tafsir_en": "In this verse it is explained that the reason the hypocrites did not keep their promise to help the Bayan Nadhir, as they had agreed, was because they feared the Muslims more than God. Therefore, they did not dare to fight the Muslims, even though they were with Bani Nadhir. This verse shows what is in the hearts of hypocrites. They do not believe in the power and greatness of God. The most important thing for them is their personal safety and property. For their safety, they did what was possible, such as the act of nifaq, to the Messenger of Allah (may peace be upon them), including those who believed, and to the Bani Nadhir they expressed solidarity and responsibility in facing the Muslims. In addition, they did not want to understand the teachings that the Messenger had conveyed to them. Whether or not that teaching is true, for them, determines everything but wealth and wealth. Therefore, it appears that in their attitude when faced with difficulties, they have no grip, and are rushing to and fro. They fear man more than God. The Word of God: When they were obliged to fight, some of them (the hypocrites) feared the people, as they feared God, and were even more afraid. (Nisa '\/ 4: 77)",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa sebab-sebab orang munafik tidak menepati janjinya menolong Bani Nadhir, sebagaimana yang telah mereka sepakati, adalah karena mereka lebih takut kepada kaum Muslimin daripada kepada Allah. Oleh karena itu, mereka tidak berani melawan kaum Muslimin, meskipun mereka bersama Bani Nadhir.\n\nAyat ini menunjukkan apa yang terkandung dalam hati orang-orang munafik. Mereka tidak percaya kepada kekuasaan dan kebesaran Allah. Hal terpenting bagi mereka ialah keselamatan diri dan harta benda mereka masing-masing. Untuk keselamatan itu, mereka melakukan apa yang mungkin dilakukan, seperti perbuatan nifaq, kepada Rasulullah mereka menyatakan termasuk orang-orang yang beriman, sedang kepada Bani Nadhir mereka menyatakan senasib dan sepenanggungan dalam menghadapi kaum Muslimin.\n\nDi samping itu, mereka tidak mau memahami ajaran yang disampaikan Rasulullah kepada mereka. Apakah ajaran itu benar atau tidak, bagi mereka, yang menentukan segala sesuatu hanyalah harta benda dan kekayaan. Oleh karena itu, tampak dalam sikap mereka ketika menghadapi kesulitan, mereka tidak mempunyai pegangan, dan terombang-ambing ke sana ke mari. Mereka lebih takut kepada manusia daripada Allah. Firman Allah:\n\nKetika mereka diwajibkan berperang, tiba-tiba sebagian mereka (golongan munafik) takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih takut (dari itu). (an-Nisa'\/4: 77)",
      "text_translation": "Sesungguhnya dalam hati mereka, kamu (Muslimin) lebih ditakuti daripada Allah. Yang demikian itu karena mereka orang-orang yang tidak mengerti.",
      "text": "لَاَنْتُمْ اَشَدُّ رَهْبَةً فِيْ صُدُوْرِهِمْ مِّنَ اللّٰهِ ۗذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا يَفْقَهُوْنَ ",
      "text_translation_en": "Nay, [O believers,] you arouse in their bosoms a fear more intense than [even their fear of] God: this, because they are people who fail to grasp the truth.",
      "juz_number": 28
    },
    "14": {
      "text_tafsir_en": "In this verse it is explained that the mentality of the Jews and the hypocrites has fallen in such a way. Had the hypocrites kept their promise and fought with the Bani Nadhir Jews against the Muslims, they would not have been able to deal with it, for in their hearts had aroused fear and fear for the Muslims. If they were also at war, they would only fight behind the fortifications they had built, behind the walls of their homes, without daring to go out in front of the Muslims. At the end of this verse is another reason why they are afraid of fighting the Muslims, that among themselves there is great conflict and hostility, there is no unity among them. This verse signifies to the Muslims that unity and unity are a prerequisite to victory. No matter how strong the weapons, equipment, and unity of the army, they will be meaningless if they are unified and unsure of their ambitions. Because a united nation or people even with adequate equipment will achieve all their ambitions. This provision applies to all mankind wherever they may be. With regard to the need for strong faith, unity, and unity in any situation, God says: O you who believe! When you meet the enemy, be strong and call on Allah (many) names (remembering and praying) that you may prosper. And obey Allah and His Messenger, and do not disagree, which causes you to be afraid and to lose your strength and be patient. Indeed, Allah is with the patient. (al-Anfal \/ 8: 45-46) If planted in a nation of strong faith and a solid and unified army, they will be able to withstand all kinds of adversity against their enemies. God says: Those who believe they will meet God say, \"How many small groups beat large groups with God's permission.\" And Allah is with those who are patient. (al-Baqarah \/ 2: 249) In the meantime, Allah warned the Muslims not to be influenced by something that seemed as good as the hypocrites' relationship with the Bani Nadhir, as if they were united in facing the Muslims, between them there is opposition and hostility.",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa mental orang Yahudi dan orang munafik itu telah jatuh sedemikian rupa. Seandainya orang-orang munafik menepati janji mereka dan berperang bersama orang Yahudi Bani Nadhir menghadapi kaum Muslimin, mereka pun tidak akan mampu menghadapinya, karena dalam hati mereka telah timbul rasa takut dan gentar terhadap kaum Muslimin. Seandainya mereka berperang juga, mereka hanya berperang di balik benteng-benteng yang kokoh yang telah mereka buat, di balik tembok rumah-rumah mereka, tidak berani keluar berhadapan dengan kaum Muslimin.\n\nPada akhir ayat ini diterangkan sebab lain yang menyebabkan mereka takut berperang menghadapi kaum Muslimin, yaitu di antara mereka sendiri terjadi pertentangan dan permusuhan yang hebat, tak ada persatuan di antara mereka.\n\nAyat ini mengisyaratkan kepada kaum Muslimin bahwa persatuan dan kesatuan itu merupakan syarat untuk mencapai kemenangan. Betapa pun kuatnya persenjataan, perlengkapan, dan kesatuan tentara, tidak akan ada artinya apabila mereka tidak bersatu dan tidak yakin akan tercapainya cita-cita mereka. Karena bangsa atau umat yang bersatu meskipun dengan perlengkapan yang memadai akan dapat mencapai segala yang mereka cita-citakan. Ketentuan ini berlaku bagi seluruh umat manusia di mana pun mereka berada.\n\nSehubungan dengan perlu adanya keyakinan yang kuat, persatuan, dan kesatuan dalam menghadapi apa pun, Allah berfirman:\n\nWahai orang-orang yang beriman! Apabila kamu bertemu pasukan (musuh), maka berteguh hatilah dan sebutlah (nama) Allah banyak-banyak (berzikir dan berdoa) agar kamu beruntung. Dan taatilah Allah dan Rasul-Nya dan janganlah kamu berselisih, yang menyebabkan kamu menjadi gentar dan kekuatanmu hilang dan bersabarlah. Sungguh, Allah beserta orang-orang sabar. (al-Anfal\/8: 45-46)\n\nJika tertanam pada suatu bangsa iman yang kuat dan persatuan yang kokoh dan kesatuan tentara yang tak terpecahkan, niscaya mereka akan sanggup menghadapi segala macam kesukaran menghadapi musuh-musuh yang akan memerangi mereka. Allah berfirman:\n\nMereka yang meyakini bahwa mereka akan menemui Allah berkata, \"Betapa banyak kelompok kecil mengalahkan kelompok besar dengan izin Allah.\" Dan Allah beserta orang-orang yang sabar. (al-Baqarah\/2: 249)\n\nSementara itu, Allah mengingatkan kaum Muslimin agar jangan sekali-kali terpengaruh oleh sesuatu yang kelihatannya baik seperti hubungan orang-orang munafik dengan Bani Nadhir , mereka seakan-akan bersatu-padu menghadapi kaum Muslimin, padahal di antara mereka terdapat pertentangan dan permusuhan.",
      "text_translation": "Mereka tidak akan memerangi kamu (secara) bersama-sama, kecuali di negeri-negeri yang berbenteng atau di balik tembok. Permusuhan antara sesama mereka sangat hebat. Kamu kira mereka itu bersatu padahal hati mereka terpecah belah. Yang demikian itu karena mereka orang-orang yang tidak mengerti. ",
      "text": "لَا يُقَاتِلُوْنَكُمْ جَمِيْعًا اِلَّا فِيْ قُرًى مُّحَصَّنَةٍ اَوْ مِنْ وَّرَاۤءِ جُدُرٍۗ بَأْسُهُمْ بَيْنَهُمْ شَدِيْدٌ ۗ تَحْسَبُهُمْ جَمِيْعًا وَّقُلُوْبُهُمْ شَتّٰىۗ ذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا يَعْقِلُوْنَۚ ",
      "text_translation_en": "Never will they fight you, [even] in unison, otherwise than from within fortified strongholds or from behind walls. Severe is their warlike discord among themselves: thou wouldst think that they are united, whereas [in fact] their hearts are at odds [with one another]: this, because they are people who will not use their reason.",
      "juz_number": 28
    },
    "15": {
      "text_tafsir_en": "Allah explains that the Jews of the Bani Nadhir were in a similar position to the Qainuqa Bani Jews who also lived in the vicinity of Medina. Because of the actions of the Children of Qainuqa 'similar to those of the Children of Nadhir, they were confronted by the Messenger of Allah (may peace be upon him) on the Saturday of Syawal, 20 months after the Prophet's departure. Finally they were driven from Medina to a place called Adhri'at in the land of Sham. The Qainuqa 'children have felt the consequences of their actions. The distance between the two events was short, just two years. So Bani Nadhir's events took place in the fourth year of migration. Of course, the expulsion of the Qainuqa Bani 'exile was a lesson for Bani Nadhir when he made contact with Muslims in Medinah. Had they fulfilled the terms of the peace treaty they had established with the Messenger of Allah, they would have lived in peace and harmony under the Messenger of Allah. But they violated the peace treaty, until they had the same fate as the Children of Qainuqa '. From this verse it can be understood that Muslims are commanded to be nice to non-Muslims, as long as those who are not Muslims are nice to them. It is a reflection of the desire of the heart, then embodied in actions and actions, both explicitly and covertly. The desire of the heart is also read on the face of a person in his association. If non-Muslims do not behave well, as Bani Qainuqa 'and Bani Nadhir do, it is natural for Muslims to take appropriate action to compensate for their actions.",
      "text_tafsir": "Allah menerangkan bahwa keadaan orang-orang Yahudi Bani Nadhir itu sama halnya dengan orang-orang Yahudi Bani Qainuqa' yang juga berdomisili di sekitar kota Medinah. Karena tindakan Bani Qainuqa' serupa dengan tindakan Bani Nadhir, maka mereka diperangi oleh Rasulullah saw pada hari Sabtu bulan Syawal, 20 bulan setelah Nabi hijrah. Akhirnya mereka diusir dari Medinah ke suatu tempat bernama Adhri'at di negeri Syam. Bani Qainuqa' telah merasakan akibat buruk dari perbuatan mereka. Jarak waktu antara kedua kejadian itu tidak lama, hanya dua tahun. Jadi peristiwa Bani Nadhir terjadi pada tahun keempat hijrah.\n\nSemestinya peristiwa pengusiran Bani Qainuqa' menjadi pelajaran bagi Bani Nadhir ketika mengadakan hubungan dengan kaum Muslimin di Medinah. Seandainya mereka melaksanakan ketentuan yang disepakati dalam perjanjian damai yang telah mereka tetapkan bersama Rasulullah saw, mereka akan hidup damai dan tenteram di bawah pemerintahan Rasulullah saw. Tetapi mereka melanggar perjanjian damai itu, sehingga mereka mengalami nasib yang sama dengan Bani Qainuqa'.\n\nDari ayat ini dapat dipahami bahwa kaum Muslimin diperintahkan bersikap baik kepada orang-orang yang bukan Islam, selama orang-orang yang bukan Islam itu bersikap baik kepada mereka. Sikap baik itu adalah cermin dari keinginan hati, kemudian terwujud dalam perbuatan dan tindakan, baik secara terang-terangan maupun secara sembunyi-sembunyi. Keinginan hati itu terbaca pula pada air muka seseorang dalam pergaulannya. Seandainya orang-orang yang bukan Muslim tidak bersikap baik, seperti yang dilakukan Bani Qainuqa' dan Bani Nadhir, adalah wajar apabila kaum Muslimin melakukan tindakan yang setimpal untuk mengimbangi tindakan-tindakan mereka.",
      "text_translation": "(Mereka) seperti orang-orang yang sebelum mereka (Yahudi) belum lama berselang, telah merasakan akibat buruk (terusir) disebabkan perbuatan mereka sendiri. Dan mereka akan men-dapat azab yang pedih. ",
      "text": "كَمَثَلِ الَّذِيْنَ مِنْ قَبْلِهِمْ قَرِيْبًا ذَاقُوْا وَبَالَ اَمْرِهِمْۚ وَلَهُمْ عَذَابٌ اَلِيْمٌۚ ",
      "text_translation_en": "[To both kinds of your enemies, O believers, is bound to happen] the like of [what happened to] those who, a short while before them, had to taste the evil that came from their own doings, with [yet more] grievous suffering awaiting them [in the life to come]:",
      "juz_number": 28
    },
    "16": {
      "text_tafsir_en": "This verse explains that the treachery of the hypocrites who promised to help Bani Nadhir when attacked by Muslims and following them when they were expelled from Medinah, was a demonic act. Satan is always begging people to turn against God and not follow the religion that his apostles have preached. However, when the people needed help in the face of the misery and calamity that came upon them, the demon escaped and did not keep its promise. They even say, \"Truly I fear God, the Lord of hosts.\" God equates the hypocrites with the devil to show that the nature of the hypocrites is the same as the devil's. The wicked devil obeys the laws of God, believes that God exists, is the One, and is the only One who is worthy of worship. Satan also believes that the conditions for happiness in life here and in the hereafter are only by following the religion of God. However, they are wicked people. They know the truth of something but don't do it. Likewise with hypocrites, they know what is right and what is wrong, but they do not practice it. They even commit seditious and forbidden acts. Allah says: And the devil said when the matter (hisab) was completed, \"Verily, Allah hath promised you the truth, and I have promised you, but I have wronged it. obey my voice, therefore despise me not, but condemn yourself: I cannot help you, neither can you help me: surely I have not suffered your deeds to be an everlasting covenant with me. Truly, the unjust will receive a painful torment. (Ibrahim \/ 14:22) So the form of the parable in this verse is that the hypocrites are treated with demons. The Jews of the Children of Nadhir were likened to those who were deceived by Satan's persuasion. Their fear of the Muslims is equated with their fear of God, even more so.",
      "text_tafsir": "Ayat ini menjelaskan bahwa perbuatan khianat orang-orang munafik yang berjanji akan menolong Bani Nadhir bila diserang kaum Muslimin dan ikut mereka bila diusir dari Medinah, adalah seperti perbuatan setan.\n\nSetan selalu merayu manusia agar mengingkari Allah dan tidak mengikuti agama yang telah disampaikan rasul-Nya. Akan tetapi, bila manusia itu memerlukan pertolongan dalam menghadapi kesengsaraan dan malapetaka yang datang kepada mereka, setan berlepas diri dan tidak menepati janjinya. Mereka bahkan berkata, \"Sesungguhnya aku takut kepada Allah Tuhan semesta alam.\"\n\nAllah menyamakan orang-orang munafik dengan setan untuk menunjukkan bahwa sifat-sifat orang-orang munafik itu sama dengan sifat-sifat setan. Setan yang durhaka mematuhi hukum-hukum Allah, percaya bahwa Allah itu ada, Maha Esa, dan hanya Dia yang berhak disembah. Setan juga percaya bahwa syarat-syarat memperoleh kebahagiaan hidup di dunia dan di akhirat hanya dengan mengikuti agama Allah. Akan tetapi, mereka adalah kaum yang fasik. Mereka mengetahui kebenaran sesuatu tetapi tidak melaksanakannya. Demikian pula halnya dengan orang-orang munafik, mereka tahu mana yang benar dan mana yang salah, tetapi mereka tidak melaksanakan kebenaran itu. Mereka bahkan melakukan perbuatan-perbuatan menghasut dan terlarang. Allah berfirman:\n\nDan setan berkata ketika perkara (hisab) telah diselesaikan, \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan aku pun telah menjanjikan kepadamu, tetapi aku menyalahinya. Tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri. Aku tidak dapat menolongmu, dan kamu pun tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.\" Sungguh, orang yang zalim akan mendapat siksaan yang pedih. (Ibrahim\/14: 22)\n\nJadi bentuk perumpamaan dalam ayat ini ialah orang-orang munafik diserupakan dengan setan. Orang-orang Yahudi Bani Nadhir disamakan dengan orang-orang yang teperdaya oleh bujukan setan. Ketakutan mereka kepada kaum Muslimin disamakan dengan ketakutan mereka kepada Allah, bahkan lebih dari itu.",
      "text_translation": "(Bujukan orang-orang munafik itu) seperti (bujukan) setan ketika ia berkata kepada manusia, “Kafirlah kamu!” Kemudian ketika manusia itu menjadi kafir ia berkata, “Sesungguhnya aku berlepas diri dari kamu, karena sesungguhnya aku takut kepada Allah, Tuhan seluruh alam.” ",
      "text": "كَمَثَلِ الشَّيْطٰنِ اِذْ قَالَ لِلْاِنْسَانِ اكْفُرْۚ فَلَمَّا كَفَرَ قَالَ اِنِّيْ بَرِيْۤءٌ مِّنْكَ اِنِّيْٓ اَخَافُ اللّٰهَ رَبَّ الْعٰلَمِيْنَ ",
      "text_translation_en": "the like of [what happens] when Satan says unto man, “Deny the truth!” - but as soon as [man] has denied the truth, [Satan] says, “Behold, I am not responsible for thee: behold, I fear God, the Sustainer of all the worlds!”",
      "juz_number": 28
    },
    "17": {
      "text_tafsir_en": "This verse describes the consequences of the hypocrites and Jews of the Bani Nadhir who have been deceived. Both groups will be cast into hell with the demons who are their friends. They will remain in hell. That is the reward of their deeds.",
      "text_tafsir": "Pada ayat ini diterangkan akibat yang akan dialami oleh orang-orang munafik dan orang-orang Yahudi Bani Nadhir yang telah diperdaya setan. Kedua golongan ini akan dimasukkan ke dalam neraka bersama setan yang menjadi teman mereka. Mereka kekal di dalam neraka. Itulah balasan yang setimpal dengan perbuatan-perbuatan mereka.",
      "text_translation": "Maka kesudahan bagi keduanya, bahwa keduanya masuk ke dalam neraka, kekal di dalamnya. Demikianlah balasan bagi orang-orang zalim. ",
      "text": "فَكَانَ عَاقِبَتَهُمَآ اَنَّهُمَا فِى النَّارِ خَالِدَيْنِ فِيْهَاۗ وَذٰلِكَ جَزٰۤؤُا الظّٰلِمِيْنَ ࣖ",
      "text_translation_en": "Thus, in the end, both [the deniers of the truth and the hypocrites] will find themselves in the fire, therein to abide: for such is the recompense of evil­doers.",
      "juz_number": 28
    },
    "18": {
      "text_tafsir_en": "To those who believe, they are commanded to fear Allah, by executing His commandments and abstaining from His prohibitions. Executing the commands of God is purifying obedience and submissiveness only to Him, there is no element of shirk in it, performing compulsory worship, and establishing good relations with mankind. In another verse the signs of the righteous are explained: It is not good to look to the east and to the west, but the virtue is to those who believe in Allah, the Last Day, the angels, the scriptures, and the prophets. Prophets and give their loved ones to relatives, orphans, the poor, those on the go, pilgrims, and to liberate the servants of the sahaya, who perform their prayers and perform alms, those who keep the promises when promised, and the patient in pain, suffering and in times of war. They are the righteous, and they are the righteous. (al-Baqarah \/ 2: 177) In the Qur'an the word piety has several meanings, including: First, obeying the commands of Allah and avoiding His prohibition, as mentioned in the Qur'an and taught by the Messenger of Allah (may peace be upon him) example sentence above. Second, fear of disobeying Allah and keeping yourself from evil deeds. Those who fear Allah should always pay attention to what they will do, whether they will benefit in the hereafter or not. Certainly what he will do will benefit him in the hereafter. In addition, one should always consider his own actions, whether in accordance with religious teachings or not. If more work is prohibited by Allah, he should try to cover it with righteous deeds. In other words, this verse commands the human being to be self-aware, to account for everything he has done and done before God counts it in the hereafter. It is a warning at the end of this verse to always fear God, for He knows everything that His servants do, both visible and unseen, both born and inward, and nothing escapes His knowledge.",
      "text_tafsir": "Kepada orang-orang yang beriman diperintahkan agar bertakwa kepada Allah, dengan melaksanakan perintah-perintah dan menjauhi larangan-larangan-Nya. Termasuk melaksanakan perintah Allah ialah memurnikan ketaatan dan menundukkan diri hanya kepada-Nya, tidak ada sedikit pun unsur syirik di dalamnya, melaksanakan ibadah-ibadah yang diwajibkan, dan mengadakan hubungan baik sesama manusia.\n\nDalam ayat yang lain diterangkan tanda-tanda orang bertakwa:\n\nKebajikan itu bukanlah menghadapkan wajahmu ke arah timur dan ke barat, tetapi kebajikan itu ialah (kebajikan) orang yang beriman kepada Allah, hari akhir, malaikat-malaikat, kitab-kitab, dan nabi-nabi dan memberikan harta yang dicintainya kepada kerabat, anak yatim, orang-orang miskin, orang-orang yang dalam perjalanan (musafir), peminta-minta, dan untuk memerdekakan hamba sahaya, yang melaksanakan salat dan menunaikan zakat, orang-orang yang menepati janji apabila berjanji, dan orang yang sabar dalam kemelaratan, penderitaan dan pada masa peperangan. Mereka itulah orang-orang yang benar, dan mereka itulah orang-orang yang bertakwa. (al-Baqarah\/2: 177)\n\nDalam Al-Qur'an ungkapan kata takwa mempunyai beberapa arti, di antaranya: Pertama, melaksanakan perintah Allah dan menjauhi larangan-Nya, sebagaimana yang disebutkan dalam Al-Qur'an dan diajarkan Rasulullah saw seperti contoh ayat di atas. Kedua, takut melanggar perintah Allah dan memelihara diri dari perbuatan maksiat.\n\nOrang yang bertakwa kepada Allah hendaklah selalu memperhatikan dan meneliti apa yang akan dikerjakan, apakah ada manfaat untuk dirinya di akhirat nanti atau tidak. Tentu yang akan dikerjakannya semua bermanfaat bagi dirinya di akhirat nanti. Di samping itu, hendaklah seseorang selalu memperhitungkan perbuatannya sendiri, apakah sesuai dengan ajaran agama atau tidak. Jika lebih banyak dikerjakan yang dilarang Allah, hendaklah ia berusaha menutupnya dengan amal-amal saleh. Dengan perkataan lain, ayat ini memerintahkan manusia agar selalu mawas diri, memperhitungkan segala yang akan dan telah diperbuatnya sebelum Allah menghitungnya di akhirat nanti.\n\nSuatu peringatan pada akhir ayat ini agar selalu bertakwa kepada Allah, karena Dia mengetahui semua yang dikerjakan hamba-hamba-Nya, baik yang tampak maupun yang tidak tampak, yang lahir maupun yang batin, tidak ada sesuatu pun yang luput dari pengetahuan-Nya.",
      "text_translation": "Wahai orang-orang yang beriman! Bertakwalah kepada Allah dan hendaklah setiap orang memperhatikan apa yang telah diperbuatnya untuk hari esok (akhirat), dan bertakwalah kepada Allah. Sungguh, Allah Mahateliti terhadap apa yang kamu kerjakan. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَلْتَنْظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍۚ وَاتَّقُوا اللّٰهَ ۗاِنَّ اللّٰهَ خَبِيْرٌ ۢبِمَا تَعْمَلُوْنَ ",
      "text_translation_en": "O YOU who have attained to faith! Remain conscious of God; and let every human being look to what he sends ahead for the morrow! And [once again]: Remain conscious of God, for God is fully aware of all that you do;",
      "juz_number": 28
    },
    "19": {
      "text_tafsir_en": "This verse can mean something special and it can also mean general. What is significant is that this verse deals with the hypocrites and Jews of Bani Nadhir and their attitudes and actions towards the Muslims at the time of this verse. The general meaning is that all who love to mislead others from the right path and those who want to be misled by deceit and grand promises of misleading people. That is to say, do not ever believe as you forget God, and Allah forgets it. People who forget Allah, such as the hypocrites and the Jews of the Bani Nadhir in the time of the Prophet, did not fear Him. They think only of the life of the world, not of the afterlife. They are overwhelmed by their property and grandchildren and everything related to worldly pleasures. The Word of God: O you who believe! Let not your wealth and your children forget you from remembering Allah. And whoever does that, then they are the losers. (al-Munafiqun \/ 63: 9) Then it is explained that if one forgets God, then Allah forgets it. What God meant to forget about them was that God did not like them, so that they wandered in error, the more they went astray, the further they went from the straight path, the path that God approved. Therefore, in the Hereafter they are also forgotten by God, and Allah does not help and relieve their suffering. Finally, they are cast into hell, in return for their deeds and actions. It is argued that people like the hypocrites and the Jews of the Bani Nadhir were evildoers. They know what is good and what is wrong, what is good and what is bad. However, they do not do what is right and good, but instead they practice what is good and bad.",
      "text_tafsir": "Ayat ini dapat berarti khusus dan dapat pula berarti umum. Berarti khusus ialah ayat ini berhubungan dengan orang munafik dan orang-orang Yahudi Bani Nadhir serta sikap dan tindakan mereka terhadap kaum Muslimin pada waktu turunnya ayat ini. Berarti umum ialah semua orang yang suka menyesatkan orang lain dari jalan yang benar dan orang-orang yang mau disesatkan karena teperdaya oleh rayuan dan janji-janji yang muluk-muluk dari orang yang menyesatkan.\n\nMaksudnya, janganlah sekali-kali orang yang beriman seperti orang yang lupa kepada Allah, lalu Allah melupakannya. Orang yang lupa kepada Allah, seperti orang munafik dan orang Yahudi Bani Nadhir di masa Rasulullah saw, tidak bertakwa kepada-Nya. Mereka hanya memikirkan kehidupan dunia saja, tidak memikirkan kehidupan di akhirat. Mereka disibukkan oleh harta dan anak cucu mereka serta segala yang berhubungan dengan kesenangan duniawi. Firman Allah:\n\nWahai orang-orang yang beriman! Janganlah harta bendamu dan anak-anakmu melalaikan kamu dari mengingat Allah. Dan barang siapa berbuat demikian, maka mereka itulah orang-orang yang rugi. (al-Munafiqun\/63: 9)\n\nKemudian diterangkan bahwa jika seseorang lupa kepada Allah, maka Allah pun melupakannya. Maksud pernyataan Allah melupakan mereka ialah Allah tidak menyukai mereka, sehingga mereka bergelimang dalam kesesatan, makin lama mereka makin sesat, sehingga makin jauh dari jalan yang lurus, jalan yang diridai Allah. Oleh karena itu, di akhirat mereka juga dilupakan Allah, dan Allah tidak menolong dan meringankan beban penderitaan mereka. Akhirnya mereka dimasukkan ke dalam neraka, sebagai balasan perbuatan dan tindakan mereka.\n\nDitegaskan bahwa orang-orang seperti kaum munafik dan Yahudi Bani Nadhir adalah orang-orang yang fasik. Mereka mengetahui mana yang baik (hak) dan mana yang batil, mana yang baik dan mana yang jahat. Namun demikian, mereka tidak melaksanakan yang benar dan baik itu, tetapi malah melaksanakan yang batil dan yang jahat.",
      "text_translation": "Dan janganlah kamu seperti orang-orang yang lupa kepada Allah, sehingga Allah menjadikan mereka lupa akan diri sendiri. Mereka itulah orang-orang fasik. ",
      "text": "وَلَا تَكُوْنُوْا كَالَّذِيْنَ نَسُوا اللّٰهَ فَاَنْسٰىهُمْ اَنْفُسَهُمْۗ  اُولٰۤىِٕكَ هُمُ الْفٰسِقُوْنَ ",
      "text_translation_en": "and be not like those who are oblivious of God, and whom He therefore causes to be oblivious of [what is good for] their own selves: [for] it is they, they who are truly depraved!",
      "juz_number": 28
    },
    "20": {
      "text_tafsir_en": "Not as hell's like the hypocrites and the Children of Nadhir, with the inhabitants of heaven, like the Muhajirin and Ansar. Allah says: Do those who do evil think that We will treat them as believers and do good, the same in life and death? What a waste of their judgment. (al-Jatsiyah \/ 45: 21) And He says: Should we treat those who believe and do good deeds like those who do evil on earth? Or do We consider the righteous to be the same as the wicked? (sad \/ 38: 28) Allah makes it clear that they are not the same, because those who go into heaven are those who are lucky, to achieve what they want. The virtuous deeds that they do are beyond the evil that they have done, so that the reward they receive can cover the sins they have committed.",
      "text_tafsir": "Tidaklah sama penghuni neraka seperti orang-orang munafik dan Bani Nadhir, dengan penghuni surga, seperti kaum Muhajirin dan Ansar. Allah berfirman:\n\nApakah orang-orang yang melakukan kejahatan itu mengira bahwa Kami akan memperlakukan mereka seperti orang-orang yang beriman dan yang mengerjakan kebajikan, yaitu sama dalam kehidupan dan kematian mere-ka? Alangkah buruknya penilaian mereka itu. (al-Jatsiyah\/45: 21)\n\nDan firman-Nya:\n\nPantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan sama dengan orang-orang yang berbuat kerusakan di bumi? Atau pantaskah Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang jahat? (sad\/38: 28)\n\nAllah menjelaskan bahwa mereka tidak sama, karena orang-orang yang dimasukkan ke dalam surga itu adalah mereka yang beruntung, mencapai apa yang diinginkannya. Amal saleh yang mereka kerjakan melebihi perbuatan buruk yang terlanjur mereka kerjakan, sehingga pahala yang mereka terima dapat menutupi dosa-dosa yang telah mereka lakukan.",
      "text_translation": "Tidak sama para penghuni neraka dengan para penghuni surga; para penghuni surga itulah orang-orang yang memperoleh kemenangan.",
      "text": "لَا يَسْتَوِيْٓ اَصْحٰبُ النَّارِ وَاَصْحٰبُ الْجَنَّةِۗ  اَصْحٰبُ الْجَنَّةِ هُمُ الْفَاۤىِٕزُوْنَ ",
      "text_translation_en": "Not equal are those who are destined for the fire and those who are destined for paradise: those who are destined for paradise - it is they, they [alone] who shall triumph [on Judgment Day]!",
      "juz_number": 28
    },
    "21": {
      "text_tafsir_en": "In this verse explained that if the mountains were given reason, thoughts, and feelings as bestowed on humans, then sent down the Qur'an to him, surely the mountains were subject to God, even destroyed because of fear of- His. However, the Qur'an is not for mountains, but for humans. What a beautiful metaphor, comparing human beings who are small and weak, with mountains that are so big, tall, and hard. It is said that the mountain will bow before God's revelation, and will be destroyed because of fear. This verse is a warning to humans who do not want to use the intellect, thoughts, and feelings that God has bestowed on them. They are more influenced by the passions and pleasures of life in the world, so it closes their minds and minds. For fear of losing their influence and position, they will not want to follow the truth. How high the value of the Qur'an, so that not all creatures of God can understand well the purpose and purpose. To understand it must meet certain requirements, including: adequate knowledge, using the mind, clearing his conscience, and sincere intentions. The situation of some people is explained in the word of God: Then after that your heart becomes hard, so that (your heart) is like a stone, even harder. Whereas from those stones there must be rivers that emanate from them. There is also a split and spring water comes out of it. And some are sliding down because they fear God. And Allah is not unaware of what you do. (al-Baqarah \/ 2: 74) This verse is the same as the word of God: And if there is a reading (Scripture) with which mountains can be shaken, or the earth will be divided, or the dead can speak, (that is Al-Qur'an). (ar-Ra'd \/ 13: 31) Then it is explained that the parables contained in the Qur'an must be a lesson for those who want to use their reason, thoughts, and feelings. Thus, they can carry out the instructions of the Qur'an as well as possible.",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa seandainya gunung-gunung itu diberi akal, pikiran, dan perasaan seperti yang telah dianugerahkan kepada manusia, kemudian diturunkan Al-Qur'an kepadanya, tentulah gunung-gunung itu tunduk kepada Allah, bahkan hancur-lebur karena takut kepada-Nya. Akan tetapi, Al-Qur'an bukan untuk gunung, melainkan untuk manusia. Sungguh indah metafora ini, membandingkan manusia yang kecil dan lemah, dengan gunung yang begitu besar, tinggi, dan keras. Dikatakan bahwa gunung itu akan tunduk di hadapan wahyu Allah, dan akan hancur karena rasa takut.\n\nAyat ini merupakan suatu peringatan kepada manusia yang tidak mau menggunakan akal, pikiran, dan perasaan yang telah dianugerahkan Allah kepada mereka. Mereka lebih banyak terpengaruh oleh hawa nafsu dan kesenangan hidup di dunia, sehingga hal itu menutup akal dan pikiran mereka. Karena takut kehilangan pengaruh dan kedudukan, maka mereka tidak akan mau mengikuti kebenaran.\n\nBetapa tingginya nilai Al-Qur'an, sehingga tidak semua makhluk Allah dapat memahami dengan baik maksud dan tujuannya. Untuk memahaminya harus memenuhi syarat-syarat tertentu, antara lain: ilmu yang memadai, menggunakan akal pikiran, membersihkan hati nuraninya, dan niat yang setulus-tulusnya.\n\nKeadaan sebagian manusia diterangkan dalam firman Allah:\n\nKemudian setelah itu hatimu menjadi keras, sehingga (hatimu) seperti batu, bahkan lebih keras. Padahal dari batu-batu itu pasti ada sungai-sungai yang (airnya) memancar daripadanya. Ada pula yang terbelah lalu keluarlah mata air daripadanya. Dan ada pula yang meluncur jatuh karena takut kepada Allah. Dan Allah tidaklah lengah terhadap apa yang kamu kerjakan. (al-Baqarah\/2: 74)\n\nAyat ini sama pula dengan firman Allah:\n\nDan sekiranya ada suatu bacaan (Kitab Suci) yang dengan itu gunung-gunung dapat diguncangkan, atau bumi jadi terbelah, atau orang yang sudah mati dapat berbicara, (itulah Al-Qur'an). (ar-Ra'd\/13: 31)\n\nKemudian diterangkan bahwa perumpamaan-perumpamaan yang terdapat dalam Al-Qur'an itu harus menjadi pelajaran bagi orang yang mau mempergunakan akal, pikiran, dan perasaannya. Dengan demikian, mereka dapat melaksanakan petunjuk-petunjuk Al-Qur'an dengan sebaik-baiknya.",
      "text_translation": "Sekiranya Kami turunkan Al-Qur'an ini kepada sebuah gunung, pasti kamu akan melihatnya tunduk terpecah belah disebabkan takut kepada Allah. Dan perumpamaan-perumpamaan itu Kami buat untuk manusia agar mereka berpikir.",
      "text": "لَوْ اَنْزَلْنَا هٰذَا الْقُرْاٰنَ عَلٰى جَبَلٍ لَّرَاَيْتَهٗ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللّٰهِ ۗوَتِلْكَ الْاَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُوْنَ ",
      "text_translation_en": "HAD WE bestowed this Qur’an from on high upon a mountain, thou wouldst indeed see it humbling itself, breaking asunder for awe of God. And [all] such parables We propound unto men, so that they might [learn to] think.",
      "juz_number": 28
    },
    "22": {
      "text_tafsir_en": "God, who revealed the Qur'an and established it as a guide for mankind, is the One God, and there is no god but Him. He is worthy of worship, nothing else. All worship of other than God, such as trees, stones, statues, sun, etc., is a heresy. He is All-knowing, both visible and supernatural in the heavens and the earth. He is Most Gracious to His creatures, and Most Merciful.",
      "text_tafsir": "Allah yang menurunkan Al-Qur'an dan menetapkannya sebagai petunjuk bagi manusia, adalah Tuhan Yang Maha Esa, tidak ada tuhan selain Dia. Dialah yang berhak disembah, tidak ada yang lain. Segala penyembahan terhadap selain Allah, seperti pohon, batu, patung, matahari, dan sebagainya, adalah perbuatan sesat. Dia Maha Mengetahui segala yang ada, baik yang tampak maupun yang gaib di langit dan di bumi. Dia Maha Pemurah kepada makhluk-Nya, dan Maha Pengasih.",
      "text_translation": "Dialah Allah tidak ada tuhan selain Dia. Yang Mengetahui yang gaib dan yang nyata, Dialah Yang Maha Pengasih, Maha Penyayang. ",
      "text": "هُوَ اللّٰهُ الَّذِيْ لَآ اِلٰهَ اِلَّا هُوَۚ عَالِمُ الْغَيْبِ وَالشَّهَادَةِۚ هُوَ الرَّحْمٰنُ الرَّحِيْمُ ",
      "text_translation_en": "GOD IS HE save whom there is no deity: the One who knows all that is beyond the reach of a created being’s perception, as well as all that can be wit­nessed by a creature’s senses or mind: He, the Most Gracious, the Dispenser of Grace.",
      "juz_number": 28
    },
    "23": {
      "text_tafsir_en": "He is God, the One and Only God, who possesses all that is, and does everything according to His will. The Holy of all kinds of defects and deficiencies. The Mighty, the Maintain of the security, the balance, and the survival of all His creatures, the Almighty does not abuse His creatures, but His demands are very severe. He is the Great and the Holy of all that is with him.",
      "text_tafsir": "Dialah Allah, Tuhan Yang Maha Esa, yang memiliki segala sesuatu yang ada, dan mengurus segalanya menurut yang dikehendaki-Nya. Yang Mahasuci dari segala macam bentuk cacat dan kekurangan. Yang Mahasejahtera, Yang Maha Memelihara keamanan, keseimbangan, dan kelangsungan hidup seluruh makhluk-Nya, Mahaperkasa tidak menganiaya makhluk-Nya, tetapi tuntutan-Nya sangat keras. Dia Mahabesar dan Mahasuci dari segala apa yang dipersekutukan dengan-Nya.",
      "text_translation": "Dialah Allah tidak ada tuhan selain Dia. Maharaja, Yang Mahasuci, Yang Mahasejahtera, Yang Menjaga Keamanan, Pemelihara Keselamatan, Yang Mahaperkasa, Yang Mahakuasa, Yang Memiliki Segala Keagungan, Mahasuci Allah dari apa yang mereka persekutukan.",
      "text": "هُوَ اللّٰهُ الَّذِيْ لَآ اِلٰهَ اِلَّا هُوَ ۚ اَلْمَلِكُ الْقُدُّوْسُ السَّلٰمُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيْزُ الْجَبَّارُ الْمُتَكَبِّرُۗ سُبْحٰنَ اللّٰهِ عَمَّا يُشْرِكُوْنَ",
      "text_translation_en": "God is He save whom there is no deity: the Sovereign Supreme, the Holy, the One with whom all salvation rests, the Giver of Faith, the One who determines what is true and false, the Almighty, the One who subdues wrong and restores right, the One to whom all greatness belongs! Utterly remote is God, in His limitless glory, from anything to which men may ascribe a share in His divinity!",
      "juz_number": 28
    },
    "24": {
      "text_tafsir_en": "God is the Creator of all His creatures. He created all beings from nothing to nothing. They form beings according to their duties and attributes. He has beautiful attributes, a great name that no one else has, other than Him. To Him be the glory and praise of the heavens and the earth. What is really important in prayer is sincerity, devotion and submission to God. By reading these verses, it is hoped that all three will appear, so that the prayer is accepted by God. Al-Bukhari and Muslim from Abu Hurairah, from the Holy Prophet, reported: Allah has ninety-nine names, one hundred and one, those who memorize, appreciate, and absorb, will enter heaven. (History of al-Bukhari and Muslim) The meaning of knowing and absorbing it here is to fully understand the attributes of Allah, to feel His greatness, greatness, and power over all beings, and to feel His love. It creates subjectivity, obedience, and disdain for everyone who worships Him.",
      "text_tafsir": "Allah Pencipta seluruh makhluk-Nya. Dia yang mengadakan seluruh makhluk dari tidak ada kepada ada. Yang membentuk makhluk sesuai dengan tugas dan sifatnya masing-masing. Dia mempunyai sifat-sifat yang indah, nama yang agung yang tidak dipunyai oleh makhluk lain, selain dari Dia. Kepada-Nya bertasbih dan memuji segala yang ada di langit dan di bumi.\n\nSebenarnya yang penting dalam berdoa adalah keikhlasan hati, kekhusyukan dan ketundukan kepada Allah. Dengan membaca ayat-ayat itu, diharapkan ketiganya muncul, sehingga doa itu diterima Allah.\n\nDiriwayatkan oleh al-Bukhari dan Muslim dari Abu Hurairah dari Nabi saw bersabda:\n\nSesungguhnya Allah mempunyai sembilan puluh sembilan nama, seratus kurang satu, barang siapa yang menghafal, menghayati, dan meresapinya, niscaya akan masuk surga. (Riwayat al-Bukhari dan Muslim)\n\nYang dimaksud dengan menghayati dan meresapinya di sini ialah benar-benar memahami sifat-sifat Allah itu, merasakan keagungan, kebesaran, dan kekuasaan-Nya atas seluruh makhluk, dan merasakan kasih sayang-Nya. Hal itu menimbulkan ketundukan, kepatuhan, dan kekhusyukan pada setiap orang yang melakukan ibadah kepada-Nya.",
      "text_translation": "Dialah Allah Yang Menciptakan, Yang Mengadakan, Yang Membentuk Rupa, Dia memiliki nama-nama yang indah. Apa yang di langit dan di bumi bertasbih kepada-Nya. Dan Dialah Yang Mahaperkasa, Mahabijaksana.",
      "text": "هُوَ اللّٰهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْاَسْمَاۤءُ الْحُسْنٰىۗ يُسَبِّحُ لَهٗ مَا فِى السَّمٰوٰتِ وَالْاَرْضِۚ وَهُوَ الْعَزِيْزُ الْحَكِيْمُ ࣖ ",
      "text_translation_en": "He is God, the Creator, the Maker who shapes all forms and appearances! His [alone] are the attributes of perfection. All that is in the heavens and on earth extols His limitless glory: for He alone is almighty, truly wise!",
      "juz_number": 28
    }
  },
  "name": "الحشر",
  "name_translation_en": "The Exile",
  "name_translation": "Pengusiran",
  "name_latin": "Al-Hasyr"
}