{
  "number": 60,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 13,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse warns Muslims not to make love with the Muslims who are enemies of God and the Muslims. Because of such a connection, they unknowingly uncovered the secrets of the Muslims, conveying something that the Messenger of Allah (PBUH) would do to them in an effort to uphold the word of Allah. Therefore, Muslims are forbidden to do so even to their relatives. Making the unbelievers hostile to the Muslims is a loyal friend and helper. This is not possible as long as the pagans want to destroy Islam and Muslims. Allah then explained the reasons for prohibiting the disbelievers from being friends, namely: 1. They denied and disbelieved all that the Messenger of Allah had brought. They disobeyed Allah, His Messenger, and the Qur'an. Could it be that such people have been turned into helpers and loyal friends? Then tell them secrets that are beneficial to them and pose a danger to Muslims? 2. They expelled the Messenger of Allah (may peace be upon him) and the people of Muhajirin from their hometown because of faith in Allah, not for any other reason. This verse has the same meaning as the Word of God: And they persecute the believers only because they believe in the Almighty, the Praised (al-Buruj \/ 85: 8) and the Word of God: people who were expelled from their hometown for no good reason, just because they said, \"Our God is God.\" If God had not rejected (violence) some people with others, it would have demolished the Christian monasteries, churches, Jewish houses of worship and mosques, many of which were called by the name of God. Allah will surely help those who help (His) religion. Indeed, Allah Almighty, Almighty (al-hajj \/ 22: 40) Allah warns Muslims that if they leave their hometown or flee from jihad in the cause of Allah and seek His Messenger, then do not make them disbelievers. as their loyal friends and helpers. It is enough that Muslims suffer from their actions, and never allow them to increase the suffering of Muslims. How is it possible for some of the Muslims to do what Allah has done to convey to the disbelievers the steps that the Prophet would take in facing the unbelievers? Allah knows what His servants do. Therefore, He conveyed it to the Messenger of Allah, so that he could take action immediately. Thus, Muslims are not harmed. At the end of this verse it is stated that whoever pitied the enemy of Islam and made them his helpers, he had deviated from the straight path.",
      "text_tafsir": "Ayat ini memperingatkan kaum Muslimin agar tidak mengadakan hubungan kasih sayang dengan kaum musyrik yang menjadi musuh Allah dan kaum Muslimin. Sebab, dengan adanya hubungan yang demikian itu, tanpa disadari mereka telah membukakan rahasia-rahasia kaum Muslimin, menyampaikan sesuatu yang akan dilaksanakan Rasulullah saw kepada mereka dalam usaha menegakkan kalimat Allah. Oleh karena itu, kaum Muslimin dilarang melakukan yang demikian sekalipun kepada kaum kerabatnya.\n\nMenjadikan orang-orang kafir yang memusuhi kaum Muslimin sebagai teman setia dan penolong adalah suatu hal yang dilarang. Hal ini tidak boleh dilakukan selama orang-orang kafir itu ingin menghancurkan agama Islam dan kaum Muslimin. \n\nAllah kemudian menjelaskan penyebab larangan menjadikan orang-orang kafir sebagai teman setia, yaitu:\n\n1.Mereka menyangkal dan tidak membenarkan semua yang dibawa Rasulullah. Mereka ingkar kepada Allah, Rasul-Nya, dan Al-Qur'an. Mungkinkah orang yang seperti itu dijadikan penolong-penolong dan teman setia? Kemudian disampaikan kepada mereka rahasia-rahasia yang bermanfaat bagi mereka dan menimbulkan bahaya bagi kaum Muslimin?\n\n2.Mereka telah mengusir Rasulullah saw dan orang-orang Muhajirin dari kampung halaman mereka karena beriman kepada Allah, bukan karena sebab yang lain.\n\nAyat ini sama maksudnya dengan firman Allah:\n\nDan mereka menyiksa orang-orang mukmin itu hanya karena (orang-orang mukmin itu) beriman kepada Allah Yang Mahaperkasa, Maha Terpuji (al-Buruj\/85: 8)\n\nDan Firman Allah:\n\n(Yaitu) orang-orang yang diusir dari kampung halamannya tanpa alasan yang benar, hanya karena mereka berkata, \"Tuhan kami ialah Allah.\" Seandainya Allah tidak menolak (keganasan) sebagian manusia dengan sebagian yang lain, tentu telah dirobohkan biara-biara Nasrani, gereja-gereja, rumah-rumah ibadah orang Yahudi dan masjid-masjid, yang di dalamnya banyak disebut nama Allah. Allah pasti akan menolong orang yang menolong (agama)-Nya. Sungguh, Allah Mahakuat, Mahaperkasa (al-hajj\/22: 40)\n\nAllah memperingatkan kaum Muslimin bahwa jika mereka keluar dari kampung halaman atau terusir karena berjihad di jalan Allah dan mencari keridaan-Nya, maka janganlah sekali-kali menjadikan orang-orang kafir itu sebagai teman setia dan penolong-penolong mereka. Cukuplah kaum Muslimin menderita akibat tindakan-tindakan mereka, dan jangan sekali-kali memberi kesempatan kepada mereka menambah penderitaan kaum Muslimin. Bagaimana mungkin ada di antara kaum Muslimin melakukan seperti yang dilakukan hathib yang menyampaikan kepada orang-orang kafir langkah-langkah yang akan diambil Rasulullah dalam menghadapi orang-orang kafir?\n\nAllah Mahatahu segala yang dilakukan hamba-hamba-Nya. Oleh karena itu, Dia menyampaikan hal tersebut kepada Rasulullah, sehingga beliau segera dapat mengambil tindakan. Dengan demikian, kaum Muslimin tidak dirugikan.\n\nPada akhir ayat ini ditegaskan bahwa barang siapa yang berkasih-kasihan dengan musuh Islam dan menjadikan mereka penolong-penolong, berarti ia telah menyimpang dari jalan yang lurus.",
      "text_translation": "Wahai orang-orang yang beriman! Janganlah kamu menjadikan musuh-Ku dan musuhmu sebagai teman-teman setia sehingga kamu sampaikan kepada mereka (berita-berita Muhammad), karena rasa kasih sayang; padahal mereka telah ingkar kepada kebenaran yang disampaikan kepadamu. Mereka mengusir Rasul dan kamu sendiri karena kamu beriman kepada Allah, Tuhanmu. Jika kamu benar-benar keluar untuk berjihad pada jalan-Ku dan mencari keridaan-Ku (janganlah kamu berbuat demikian). Kamu memberitahukan secara rahasia (berita-berita Muhammad) kepada mereka, karena rasa kasih sayang, dan Aku lebih mengetahui apa yang kamu sembunyikan dan apa yang kamu nyatakan. Dan barangsiapa di antara kamu yang melakukannya, maka sungguh, dia telah tersesat dari jalan yang lurus. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوْا عَدُوِّيْ وَعَدُوَّكُمْ اَوْلِيَاۤءَ تُلْقُوْنَ اِلَيْهِمْ بِالْمَوَدَّةِ وَقَدْ كَفَرُوْا بِمَا جَاۤءَكُمْ مِّنَ الْحَقِّۚ  يُخْرِجُوْنَ الرَّسُوْلَ وَاِيَّاكُمْ اَنْ تُؤْمِنُوْا بِاللّٰهِ رَبِّكُمْۗ اِنْ كُنْتُمْ خَرَجْتُمْ جِهَادًا فِيْ سَبِيْلِيْ وَابْتِغَاۤءَ مَرْضَاتِيْ تُسِرُّوْنَ اِلَيْهِمْ بِالْمَوَدَّةِ وَاَنَا۠ اَعْلَمُ بِمَآ اَخْفَيْتُمْ وَمَآ اَعْلَنْتُمْۗ وَمَنْ يَّفْعَلْهُ مِنْكُمْ فَقَدْ ضَلَّ سَوَاۤءَ السَّبِيْلِ ",
      "text_translation_en": "O YOU who have attained to faith! Do not take My enemies - who are your enemies as well - for your friends, showing them affection even though they are bent on denying whatever truth has come unto you, [and even though] they have driven the Apostle and yourselves away, [only] because you believe in God, your Sustainer! If [it be true that] you have gone forth [from your homes] to strive in My cause, and out of a longing for My goodly acceptance, [do not take them for your friends,] inclining towards them in secret affection: for I am fully aware of all that you may conceal as well as of all that you do openly. And any of you who does this has already strayed from the right path.",
      "juz_number": 28
    },
    "2": {
      "text_tafsir_en": "In this verse are explained other reasons Allah forbids Muslims to be friends and help each other with unbelievers, namely: 1. If they catch or defeat the Muslims, they will certainly commit unreasonable tyranny. They are friends with Muslims just to benefit themselves and their people. When no profit is expected, they will distance themselves, even destroying the Muslims. 2. They always try to insult and oppress the Muslims. How could one or more of the Muslims open their secrets or become close friends with them. The only person who can be our friend is the one who wants the good for us, not the other way around. 3.They expect the Muslims to disbelieve in Allah and the unbelievers, so that the Muslims are equal to them, namely the infidels. Therefore, they only want to be close friends or help the Muslims as long as it can fulfill their desires.",
      "text_tafsir": "Dalam ayat ini diterangkan sebab-sebab yang lain Allah melarang kaum Muslimin berteman akrab dan saling menolong dengan orang kafir, yaitu:\n\n1.Jika suatu waktu mereka menangkap atau mengalahkan kaum Muslimin, mereka pasti akan melakukan kezaliman yang di luar dugaan. Mereka berteman dengan kaum Muslimin semata-mata mencari keuntungan bagi diri dan golongan mereka. Bila tidak ada keuntungan yang diharapkan, mereka akan menjauhkan diri, bahkan akan menghancurkan kaum Muslimin.\n\n2.Mereka selalu berusaha menjelek-jelekkan dan memusuhi kaum Muslimin. Bagaimana mungkin ada satu atau sebagian dari kaum Muslimin membukakan rahasia kepada mereka atau berteman erat dengan mereka. Orang yang dapat dijadikan teman itu hanyalah orang yang menginginkan kebaikan untuk kita, bukan sebaliknya.\n\n3.Mereka mengharapkan kaum Muslimin mengingkari kebenaran dan kafir kepada Allah, sehingga kaum Muslimin sama dengan mereka, yaitu sama-sama kafir. Oleh karena itu, mereka hanya mau berteman erat atau bertolong-tolongan dengan kaum Muslimin selama hal itu bisa memenuhi keinginan-keinginan mereka.",
      "text_translation": "Jika mereka menangkapmu, niscaya mereka bertindak sebagai musuh bagimu lalu melepaskan tangan dan lidahnya kepadamu untuk menyakiti dan mereka ingin agar kamu (kembali) kafir. ",
      "text": "اِنْ يَّثْقَفُوْكُمْ يَكُوْنُوْا لَكُمْ اَعْدَاۤءً وَّيَبْسُطُوْٓا اِلَيْكُمْ اَيْدِيَهُمْ وَاَلْسِنَتَهُمْ بِالسُّوْۤءِ وَوَدُّوْا لَوْ تَكْفُرُوْنَۗ ",
      "text_translation_en": "If they could but overcome you, they would [still] remain your foes, and would stretch forth their hands and tongues against you with evil intent: for they desire that you [too] should deny the truth.",
      "juz_number": 28
    },
    "3": {
      "text_tafsir_en": "On the Day of Judgment each person will commit himself to God. Even relatives, loyal friends, children, or parents cannot even help someone on Judgment Day. The only thing that can save a person from the torment of God is the faith and good deeds that he has done throughout his life. Relatives, loyal friends, children and parents cannot be a helper on the Day of Judgment because they each seek to escape from the catastrophe that is to come, so they cannot think of their relatives or friends, as the word of God says: Then when the voice comes In that day a man runs away from his brother, And from his mother and his father, And from his wife and children. Every single one of them that day had an affair. ('Abasa \/ 80: 33-37) At the end of this verse, Allah warns that He is fully aware of all that is done by man, that no one is ignorant of His knowledge. Therefore, He will provide a just reply. So be careful and take good care of yourself.",
      "text_tafsir": "Pada hari Kiamat setiap orang mempertanggungjawabkan diri mereka masing-masing kepada Allah. Karib-kerabat, teman setia, anak-anak, atau orang tua sekalipun tidak dapat menolong seseorang di hari Kiamat. Yang dapat menolong seseorang dari siksa Allah hanyalah iman dan amal saleh yang dilakukan selama hidup di dunia.\n\nKarib-kerabat, teman setia, anak-anak dan orang tua tidak dapat dijadikan penolong di hari Kiamat karena masing-masing berusaha menghindarkan diri dari malapetaka yang akan menimpa, sehingga tidak sempat memikirkan kerabat atau temannya, sebagaimana firman Allah:\n\nMaka apabila datang suara yang memekakkan (tiupan sangkakala yang kedua), Pada hari itu manusia lari dari saudaranya, Dan dari ibu dan bapaknya, Dan dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. ('Abasa\/80: 33-37)\n\nPada akhir ayat ini, Allah memberi peringatan bahwa Dia Maha Mengetahui semua yang dilakukan manusia, tidak ada satu pun yang luput dari pengetahuan-Nya. Oleh karena itu, Dia akan memberikan balasan yang seadil-adilnya. Maka itu berhati-hatilah dan jagalah dirimu sebaik mungkin.",
      "text_translation": "Kaum kerabatmu dan anak-anakmu tidak akan bermanfaat bagimu pada hari Kiamat. Dia akan memisahkan antara kamu. Dan Allah Maha Melihat apa yang kamu kerjakan.",
      "text": "لَنْ تَنْفَعَكُمْ اَرْحَامُكُمْ وَلَآ اَوْلَادُكُمْ ۛيَوْمَ الْقِيٰمَةِ ۛيَفْصِلُ بَيْنَكُمْۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ ",
      "text_translation_en": "But [bear in mind that] neither your kinsfolk nor [even] your own children will be of any benefit to you on Resurrection Day, [for then] He will decide between you [on your merit alone]: and God sees all that you do.",
      "juz_number": 28
    },
    "4": {
      "text_tafsir_en": "Allah commanded the Muslims to emulate Abraham and his fellow believers, when he said to his disbelievers and idolaters, \"O my people! We are indeed departing from you all, and from what you worship besides Allah.\" Then it is explained that Abraham meant his departure: 1. Abraham disobeyed his people, disregarded their gods, and did not allow their acts of worshiping statues that could not benefit and harm anyone. Allah says: O mankind! An analogy has been made. Then listen! Indeed, all that you call on besides Allah cannot create a fly, though they are united to create it. And if the fly snatches something from them, they won't be able to take it back. The weak are the worshipers and the worshipers. (al-hajj \/ 22: 73) 2. Abraham said that between him and his disobedient people there was hostility and hatred for one another. Ibrahim declared that he would continue to oppose his people until they abandoned the practice of shirk. If they had believed, the hostility would have ended. To his disbelieving father, he did not take as firm an attitude as his people. He promised to pray for God to forgive his father's sins. In this case, God forbade Muslims to emulate Ibrahim, even though he eventually extended his hand to his father, after his father's disobedience. It is true that some believers pray for their deceased fathers in their homes. They reasoned on Abraham's actions. So Allah denied them: It is not right for the Prophet and the believers to seek forgiveness (for Allah) for the Gentiles, even if they are relatives, when it is clear to them hell. Abraham's request for forgiveness for his father was nothing more than a promise he had made to his father. So when it became clear to Abraham that his father was an enemy of God, Abraham withdrew from him. Indeed, Abraham was a very gentle man and a supportive man. (at-Taubah \/ 9: 113-114) Then Abraham said to his father that he could not help him. He could only pray that God would give him faith in him.",
      "text_tafsir": "Allah memerintahkan kaum Muslimin untuk mencontoh Nabi Ibrahim dan orang-orang yang beriman besertanya, ketika ia berkata kepada kaumnya yang kafir dan menyembah berhala, \"Hai kaumku, sesungguhnya kami berlepas diri dari kamu semua, dan dari apa yang kamu sembah selain Allah.\"\n\nKemudian diterangkan bahwa yang dimaksud Ibrahim dengan berlepas diri itu ialah:\n\n1.Nabi Ibrahim mengingkari kaumnya, tidak mengacuhkan tuhan-tuhan mereka, dan tidak membenarkan perbuatan mereka yang menyembah patung-patung yang tidak dapat memberi manfaat dan mudarat kepada siapa pun. Allah berfirman: \n\nWahai manusia! Telah dibuat suatu perumpamaan. Maka dengarkanlah! Sesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. Sama lemahnya yang menyembah dan yang disembah. (al-hajj\/22: 73)\n\n2.Nabi Ibrahim mengatakan bahwa antara dia dengan kaumnya yang ingkar telah terjadi permusuhan dan saling membenci selamanya. Ibrahim menyatakan akan tetap menentang kaumnya sampai mereka meninggalkan perbuatan syirik. Jika mereka telah beriman, permusuhan itu baru akan berakhir.\n\nTerhadap ayahnya yang masih kafir, ia tidak mengambil sikap yang tegas seperti sikapnya terhadap kaumnya. Ia berjanji akan mendoakan agar Allah mengampuni dosa-dosa ayahnya. Dalam hal ini, Allah melarang kaum Muslimin mencontoh Ibrahim, sekalipun ia akhirnya berlepas tangan pula terhadap ayahnya, setelah nyata baginya keingkaran bapaknya itu.\n\nBenar ada di antara orang yang beriman mendoakan ayah-ayah mereka yang meninggal dalam keadaan musyrik. Mereka beralasan mencontoh perbuatan Ibrahim itu. Maka Allah membantah perbuatan mereka:\n\nTidak pantas bagi Nabi dan orang-orang yang beriman memohonkan ampunan (kepada Allah) bagi orang-orang musyrik, sekalipun orang-orang itu kaum kerabat(nya), setelah jelas bagi mereka, bahwa orang-orang musyrik itu penghuni neraka Jahanam. Adapun permohonan ampunan Ibrahim (kepada Allah) untuk bapaknya, tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya. Maka ketika jelas bagi Ibrahim bahwa bapaknya adalah musuh Allah, maka Ibrahim berlepas diri darinya. Sungguh, Ibrahim itu seorang yang sangat lembut hatinya lagi penyantun. (at-Taubah\/9: 113-114)\n\nSelanjutnya Nabi Ibrahim berkata kepada ayahnya bahwa dia tidak mampu menolongnya. Ia hanya bisa berdoa agar Allah memberi taufik berupa iman kepadanya.",
      "text_translation": "Sungguh, telah ada suri teladan yang baik bagimu pada Ibrahim dan orang-orang yang bersama dengannya, ketika mereka berkata kepada kaumnya, “Sesungguhnya kami berlepas diri dari kamu dan dari apa yang kamu sembah selain Allah, kami mengingkari (kekafiran)mu dan telah nyata antara kami dan kamu ada permusuhan dan kebencian untuk selama-lamanya sampai kamu beriman kepada Allah saja,” kecuali perkataan Ibrahim kepada ayahnya, ”Sungguh, aku akan memohonkan ampunan bagimu, namun aku sama sekali tidak dapat menolak (siksaan) Allah terhadapmu.” (Ibrahim berkata), “Ya Tuhan kami, hanya kepada Engkau kami bertawakal dan hanya kepada Engkau kami bertobat dan hanya kepada Engkaulah kami kembali,",
      "text": "قَدْ كَانَتْ لَكُمْ اُسْوَةٌ حَسَنَةٌ فِيْٓ اِبْرٰهِيْمَ وَالَّذِيْنَ مَعَهٗۚ اِذْ قَالُوْا لِقَوْمِهِمْ اِنَّا بُرَءٰۤؤُا مِنْكُمْ وَمِمَّا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ ۖ كَفَرْنَا بِكُمْ وَبَدَا بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَاۤءُ اَبَدًا حَتّٰى تُؤْمِنُوْا بِاللّٰهِ وَحْدَهٗٓ اِلَّا قَوْلَ اِبْرٰهِيْمَ لِاَبِيْهِ لَاَسْتَغْفِرَنَّ لَكَ وَمَآ اَمْلِكُ لَكَ مِنَ اللّٰهِ مِنْ شَيْءٍۗ رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَاِلَيْكَ اَنَبْنَا وَاِلَيْكَ الْمَصِيْرُ ",
      "text_translation_en": "Indeed, you have had a good example in Abraham and those who followed him, when they said unto their [idolatrous] people: \"Verily, we are quit of you and of all that you worship instead of God: we deny the truth of whatever you believe; and between us and you there has arisen enmity and hatred, to last until such a time as you come to believe in the One God!\" The only exception was Abraham's saying to his father \"I shall indeed pray for [God's] forgiveness for thee, although I have it not in my power to obtain anything from God in thy behalf.\" [And Abraham and his followers prayed:] \"O our Sustainer! In Thee have we placed our trust, and unto Thee do we turn: for unto Thee is all journeys' end.",
      "juz_number": 28
    },
    "5": {
      "text_tafsir_en": "Before Abraham was separated from his people who would not accept his call, he prayed to God with a submissive heart and surrendered to him. In his prayer he said, \"Our Lord, do not make us a target for disbelievers.\" In other words, the meaning of this verse is that Abraham prayed that Allah would not win the unbelievers over the believers. It will give the unbelievers the opportunity to slander the believers. The victory can also give the unbelievers confidence that they are on the right path while the believers are on the wrong path. At the end of the verse, Abraham prayed, \"O our Lord, forgive us and forgive us our sins so that we may never commit sin. You are our place of refuge. , its benefits, and its benefits. \"",
      "text_tafsir": "Sebelum Nabi Ibrahim berpisah dengan kaumnya yang tidak mau menerima seruannya, ia berdoa kepada Allah dengan hati yang tunduk dan berserah diri kepada-Nya. Dalam doanya ia berkata, \"Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi orang-orang kafir.\"\n\nDengan perkataan lain, arti ayat ini ialah Nabi Ibrahim memohon agar Allah tidak memenangkan orang kafir atas orang beriman. Hal itu akan memberi kesempatan kepada orang kafir untuk memfitnah orang beriman. Kemenangan itu juga bisa menimbulkan keyakinan pada orang kafir bahwa mereka berada di jalan yang benar sedangkan orang beriman berada di jalan yang salah.\n\nDi akhir ayat, Nabi Ibrahim berdoa, \"Wahai Tuhan kami, ampunilah dan maafkanlah dosa kami sehingga perbuatan dosa itu seakan-akan tidak pernah kami kerjakan. Engkaulah tempat kami berlindung. Tuntutan-Mu sangat keras. Engkau melakukan dan menciptakan segala sesuatu sesuai dengan sifat, guna, dan faedahnya.\"",
      "text_translation": "Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi orang-orang kafir. Dan ampunilah kami, ya Tuhan kami. Sesungguhnya Engkau yang Mahaperkasa, Mahabijaksana.”",
      "text": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِيْنَ كَفَرُوْا وَاغْفِرْ لَنَا رَبَّنَاۚ اِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُ ",
      "text_translation_en": "O our Sustainer! Make us not a plaything for those who are bent on denying the truth! And forgive us our sins, O our sustainer: for Thou alone art, almighty, truly wise!\"",
      "juz_number": 28
    },
    "6": {
      "text_tafsir_en": "This verse repeats the command to make Abraham and the believers with him a good example with the purpose of making the order known to the believers. It is primarily for those who are confident in meeting God in the hereafter, and expect the reward and reward of heaven as a place of delight. Those who do not obey Allah's commands, and do not take the example of the righteous, let them know that Allah does not need them at all. God is praised in heaven and on earth, and He does not need the help of His creatures in carrying out His will. Allah says: And Moses said, \"If you and all the inhabitants of the earth are disbelieving, then surely Allah is All-Mighty, All-Glorious (Abraham \/ 14: 8)",
      "text_tafsir": "Ayat ini mengulang perintah untuk menjadikan Nabi Ibrahim dan orang-orang yang beriman besertanya sebagai teladan yang baik dengan maksud agar perintah itu diperhatikan oleh orang-orang yang beriman. Hal ini terutama ditujukan bagi orang yang yakin akan bertemu dengan Allah di akhirat, dan mengharapkan pahala serta balasan surga sebagai tempat yang nikmat.\n\nOrang yang tidak mengikuti perintah Allah, dan tidak mengambil teladan dari orang-orang yang saleh, maka hendaklah mereka ketahui bahwa Allah sedikit pun tidak memerlukannya. Allah Maha Terpuji di langit dan di bumi, dan Dia tidak memerlukan bantuan makhluk-Nya dalam melaksanakan kehendak-Nya. Allah berfirman:\n\nDan Musa berkata, \"Jika kamu dan orang yang ada di bumi semuanya mengingkari (nikmat Allah), maka sesungguhnya Allah Mahakaya, Maha Terpuji. (Ibrahim\/14: 8)",
      "text_translation": "Sungguh, pada mereka itu (Ibrahim dan umatnya) terdapat suri teladan yang baik bagimu; (yaitu) bagi orang yang mengharap (pahala) Allah dan (keselamatan pada) hari kemudian, dan barangsiapa berpaling, maka sesungguhnya Allah, Dialah Yang Mahakaya, Maha Terpuji.",
      "text": "لَقَدْ كَانَ لَكُمْ فِيْهِمْ اُسْوَةٌ حَسَنَةٌ لِّمَنْ كَانَ يَرْجُو اللّٰهَ وَالْيَوْمَ الْاٰخِرَۗ وَمَنْ يَّتَوَلَّ فَاِنَّ اللّٰهَ هُوَ الْغَنِيُّ الْحَمِيْدُ ࣖ ",
      "text_translation_en": "In them, indeed, you have a good example for everyone who looks forward [with hope and awe] to God and the Last Day. And if any turns away, [let him know that] God is truly self-sufficient, the One to whom all praise is due.\"",
      "juz_number": 28
    },
    "7": {
      "text_tafsir_en": "According to al-hasan al-Basri and Abu salih, this verse was revealed in connection with the Khuza'ah, the Children of al-harits bin Ka'ab, Kinanah, Khuzaimah, and other Arab tribes. They demand peace with the Muslims by pledging that they will not fight the Muslims and will not help their enemies. So this verse goes down that commands the Muslims to accept their hostility. This verse tells the Messenger of Allah and the believers that it is possible that Allah will establish the love and affection between the Muslims in Medina and the Mecca Muslims who have always hated and hated them. It is easy for God, as the Almighty and to determine everything. Moreover, if the unbelievers want to believe in Allah and His Messenger, then Allah will forgive their sins that they have committed in the past, which is the sin of the Messenger and the Muslims. The gestures contained in this verse prove true to the liberation of the city of Mecca by the Muslims, without bloodshed. When the Prophet entered the city of Mecca, because the Muslims broke their agreement with the Muslims, they were afraid of facing the army of Muslims, and hiding in their houses. Therefore, the Messenger of Allah announced that whoever entered the Temple, then he was safe, whoever entered the Sacred Mosque, then he was safe, and whoever entered Abu Sufyan's house, he was safe. The order was obeyed by the Muslims and they took refuge in the Kaaba, the Sacred Mosque, and the house of Abu Sufyan. Thus, the Muslims who had emigrated with the Prophet to Medinah reunited with his family who were still Muslims and remained in Mecca, after many years of separation. Then re-establish good relationships and love between them. Because of the good attitude of the Muslims towards them, they flock to Islam. The Word of God: When Allah's help and victory come, and you see people flocking to the religion of God. So glorify your Lord and seek His forgiveness. Indeed, He is the Benefactor of repentance. (Nasr \/ 110: 1-3)",
      "text_tafsir": "Menurut al-hasan al-Basri dan Abu salih, ayat ini diturunkan berhubungan dengan Khuza'ah, Bani al-harits bin Ka'ab, Kinanah, Khuzaimah, dan kabilah-kabilah Arab lainnya. Mereka minta diadakan perdamaian dengan kaum Muslimin dengan mengemukakan ikrar tidak akan memerangi kaum Muslimin dan tidak menolong musuh-musuh mereka. Maka turunlah ayat ini yang memerintahkan kaum Muslimin untuk menerima permusuhan mereka.\n\nAyat ini menyatakan kepada Rasulullah dan orang-orang yang beriman bahwa mudah-mudahan Allah akan menjalinkan rasa cinta dan kasih sayang antara kaum Muslimin yang ada di Medinah dengan orang-orang musyrik Mekah yang selama ini membenci dan menjadi musuh mereka. Hal itu mudah bagi Allah, sebagai Zat Yang Mahakuasa dan menentukan segalanya. Apalagi jika orang-orang kafir mau beriman kepada Allah dan rasul-Nya, maka Allah akan mengampuni dosa-dosa yang telah mereka lakukan sebelumnya, yaitu dosa memusuhi Rasulullah dan kaum Muslimin.\n\nIsyarat yang terdapat dalam ayat ini terbukti kebenarannya pada pembebasan kota Mekah oleh kaum Muslimin, tanpa terjadi pertumpahan darah. Sewaktu Rasulullah memasuki kota Mekah, karena orang-orang musyrik melanggar perjanjian mereka dengan kaum Muslimin, mereka merasa gentar menghadapi tentara kaum Muslimin, dan bersembunyi di rumah-rumah mereka. Oleh karena itu, Rasulullah mengumumkan bahwa barang siapa memasuki Baitullah, maka dia mendapat keamanan, barang siapa memasuki Masjidil Haram, maka ia mendapat keamanan, dan barang siapa memasuki rumah Abu Sufyan, ia mendapat keamanan. Perintah itu ditaati oleh kaum musyrik dan mereka pun berlindung di Ka'bah, di Masjidil Haram, dan rumah Abu Sufyan. Maka waktu itu, kaum Muslimin yang telah hijrah bersama Rasulullah ke Medinah bertemu kembali dengan keluarganya yang masih musyrik dan tetap tinggal di Mekah, setelah beberapa tahun mereka berpisah. Maka terjalinlah kembali hubungan baik dan kasih sayang diantara mereka.\n\nKarena baiknya sikap kaum Muslimin kepada mereka, maka mereka berbondong-bondong masuk Islam. Firman Allah: \n\nApabila telah datang pertolongan Allah dan kemenangan, dan engkau melihat manusia berbondong-bondong masuk agama Allah. Maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampunan kepada-Nya. Sungguh, Dia Maha Penerima tobat. (an-Nasr\/110:1-3)",
      "text_translation": "Mudah-mudahan Allah menimbulkan kasih sayang di antara kamu dengan orang-orang yang pernah kamu musuhi di antara mereka. Allah Mahakuasa. Dan Allah Maha Pengampun, Maha Penyayang.",
      "text": "۞ عَسَى اللّٰهُ اَنْ يَّجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِيْنَ عَادَيْتُمْ مِّنْهُمْ مَّوَدَّةًۗ وَاللّٰهُ قَدِيْرٌۗ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ ",
      "text_translation_en": "[But] it may well be that God will bring about [mutual] affection between you [O believers] and some of those whom you [now] face as enemies: for, God is all-powerful - and God is much-forgiving, a dispenser of grace.",
      "juz_number": 28
    },
    "8": {
      "text_tafsir_en": "Narrated that Ahmad bin hanbal narrated to some other priests of 'Abdullah bin Zubair, he said, \"Qutailah bint' Abdul 'Uzza, ex-wife of Abu Bakr, had come to Medina before converting to Islam, to meet his daughter Asma' daughter Abu Bakr brought gifts and Asma refused to accept the gift and did not allow his mother to come to his house, and Asma 'sent someone to' Aisha to ask the Messenger of Allah. God does not forbid good people to do good, to have brotherly relations, to help, and to help one another as long as they have no intention of destroying Islam and Muslims, nor expelling Muslims from the states. them, and they are not friendly to the person who expelled them Islam in relationships with non-Muslims in one country. Muslims are obliged to be good and to associate with unbelievers, as long as they are friendly and want to get along, especially with Muslims. If in the history of Islam, especially in the time of the Prophet and the Companions, there were acts of violence committed by the Muslims against the Muslims, it would be done solely to defend themselves against the tyranny and torture committed by the Muslims. In Mecca, the Prophet and his companions were tortured and persecuted by the Muslims until they were forced to emigrate to Medina. Once in Medina, they were persecuted by the Jews allied with the Muslims, even though a peace treaty was established between them and the Messenger of Allah. Therefore, the Prophet had to take hard action against them. Similarly, when the Muslims confronted the Persian and Roman empires, the infidels there provoked hostility until war broke out. So there is one principle to keep in mind in relation to Muslims and unbelievers, that is, they can have good relations, as long as the non-Muslims do the same. This can only be proven in the attitudes and actions of both parties. In Indonesia this principle can be practiced, as long as no other religion intends to destroy Muslims or destroy Islam and Muslims.",
      "text_tafsir": "Diriwayatkan bahwa Ahmad bin hanbal menceritakan kepada beberapa imam yang lain dari 'Abdullah bin Zubair, ia berkata, \"Telah datang ke Medinah (dari Mekah) Qutailah binti 'Abdul 'Uzza, bekas istri Abu Bakar sebelum masuk Islam, untuk menemui putrinya Asma' binti Abu Bakar dengan membawa berbagai hadiah. Asma' enggan menerima hadiah itu dan tidak memperkenankan ibunya memasuki rumahnya. Kemudian Asma' mengutus seseorang kepada 'Aisyah agar menanyakan hal itu kepada Rasulullah. Maka turunlah ayat ini yang membolehkan Asma' menerima hadiah dan mengizinkan ibunya yang kafir itu tinggal di rumahnya.\n\nAllah tidak melarang orang-orang yang beriman berbuat baik, mengadakan hubungan persaudaraan, tolong-menolong, dan bantu-membantu dengan orang musyrik selama mereka tidak mempunyai niat menghancurkan Islam dan kaum Muslimin, tidak mengusir kaum Muslimin dari negeri-negeri mereka, dan tidak pula berteman akrab dengan orang yang hendak mengusir itu.\n\nAyat ini memberikan ketentuan umum dan prinsip agama Islam dalam menjalin hubungan dengan orang-orang yang bukan Islam dalam satu negara. Kaum Muslimin diwajibkan bersikap baik dan bergaul dengan orang-orang kafir, selama mereka bersikap dan ingin bergaul baik, terutama dengan kaum Muslimin.\n\nSeandainya dalam sejarah Islam, terutama pada masa Rasulullah saw dan masa para sahabat, terdapat tindakan kekerasan yang dilakukan oleh kaum Muslimin kepada orang-orang musyrik, maka tindakan itu semata-mata dilakukan untuk membela diri dari kezaliman dan siksaan yang dilakukan oleh pihak musyrik.\n\nDi Mekah, Rasulullah dan para sahabat disiksa dan dianiaya oleh orang-orang musyrik, sampai mereka terpaksa hijrah ke Medinah. Sesampai di Medinah, mereka pun dimusuhi oleh orang Yahudi yang bersekutu dengan orang-orang musyrik, sekalipun telah dibuat perjanjian damai antara mereka dengan Rasulullah. Oleh karena itu, Rasulullah terpaksa mengambil tindakan keras terhadap mereka. Demikian pula ketika kaum Muslimin berhadapan dengan kerajaan Persia dan Romawi, orang-orang kafir di sana telah memancing permusuhan sehingga terjadi peperangan.\n\nJadi ada satu prinsip yang perlu diingat dalam hubungan orang-orang Islam dengan orang-orang kafir, yaitu boleh mengadakan hubungan baik, selama pihak yang bukan Islam melakukan yang demikian pula. Hal ini hanya dapat dibuktikan dalam sikap dan perbuatan kedua belah pihak.\n\nDi Indonesia prinsip ini dapat dilakukan, selama tidak ada pihak agama lain bermaksud memurtadkan orang Islam atau menghancurkan Islam dan kaum Muslimin.",
      "text_translation": "Allah tidak melarang kamu berbuat baik dan berlaku adil terhadap orang-orang yang tidak memerangimu dalam urusan agama dan tidak mengusir kamu dari kampung halamanmu. Sesungguhnya Allah mencintai orang-orang yang berlaku adil.",
      "text": "لَا يَنْهٰىكُمُ اللّٰهُ عَنِ الَّذِيْنَ لَمْ يُقَاتِلُوْكُمْ فِى الدِّيْنِ وَلَمْ يُخْرِجُوْكُمْ مِّنْ دِيَارِكُمْ اَنْ تَبَرُّوْهُمْ وَتُقْسِطُوْٓا اِلَيْهِمْۗ اِنَّ اللّٰهَ يُحِبُّ الْمُقْسِطِيْنَ ",
      "text_translation_en": "As for such [of the unbelievers] as do not fight against you on account of [your] faith, and neither drive you forth from your homelands, God does not forbid you to show them kindness and to behave towards them with full equity: for, verily, God loves those who act equitably.",
      "juz_number": 28
    },
    "9": {
      "text_tafsir_en": "In this verse it is explained that Allah only prohibits Muslims from interfering with those who obstruct or obstruct their worship in the way of Allah, and deprive the Muslims of his devotion to other religions, who fight, expel, and assist the expulsion of Muslims from the state them. With such a person, God strictly forbids Muslims to be friends with them. At the end of this verse, Allah reminds the Muslims that they make their enemies their friends and help them, that if they break this prohibition, then they are the wrongdoers.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa Allah hanya melarang kaum Muslimin bertolong-tolongan dengan orang-orang yang menghambat atau menghalangi manusia beribadah di jalan Allah, dan memurtadkan kaum Muslimin sehingga ia berpindah kepada agama lain, yang memerangi, mengusir, dan membantu pengusir kaum Muslimin dari negeri mereka. Dengan orang yang semacam itu, Allah dengan tegas melarang kaum Muslimin untuk berteman dengan mereka.\n\nDi akhir ayat ini, Allah mengingatkan kaum Muslimin yang menjadikan musuh-musuh mereka sebagai teman dan tolong-menolong dengan mereka, bahwa jika mereka melanggar larangan ini, maka mereka adalah orang-orang yang zalim.",
      "text_translation": "Sesungguhnya Allah hanya melarang kamu menjadikan mereka sebagai kawanmu orang-orang yang memerangi kamu dalam urusan agama dan mengusir kamu dari kampung halamanmu dan membantu (orang lain) untuk mengusirmu. Barangsiapa menjadikan mereka sebagai kawan, mereka itulah orang-orang yang zalim.",
      "text": "اِنَّمَا يَنْهٰىكُمُ اللّٰهُ عَنِ الَّذِيْنَ قَاتَلُوْكُمْ فِى الدِّيْنِ وَاَخْرَجُوْكُمْ مِّنْ دِيَارِكُمْ وَظَاهَرُوْا عَلٰٓى اِخْرَاجِكُمْ اَنْ تَوَلَّوْهُمْۚ وَمَنْ يَّتَوَلَّهُمْ فَاُولٰۤىِٕكَ هُمُ الظّٰلِمُوْنَ ",
      "text_translation_en": "God only forbids you to turn in friendship towards such as fight against you because of [your] faith, and drive you forth from your homelands, or aid [others] in driving you forth: and as for those [from among you] who turn towards them in friendship; it is they, they who are truly wrongdoers!",
      "juz_number": 28
    },
    "10": {
      "text_tafsir_en": "This verse explains the command of Allah to the Messenger and the believers about the attitude to be taken, if a believing woman from an unbelieving area comes to seek or seek protection. Allah declares that when a woman comes from an unbeliever who recites two verses of confession and does not see any signs of heresy or hypocrisy, it is necessary to first check whether they have truly believed, or come for her husband's escape, when she is not believers. God does not say that it is not because He does not know what they are. God is well aware of the truth of their faith, even knowing everything that is in their hearts. However, for the vigilance and vigilance of Muslims who are at war with unbelievers, efforts to conduct such research should be made, even if they are relatives. If the examination proves that they are believers, then the Muslims should not return them to unbelievers, because the believing women are no longer halal to their unbelieving husbands. On the contrary, unbelieving men are not lawful for believing women. From this verse can be established a law stating that if a wife has converted to Islam, then she has divorced her infidel husband. Therefore, it was illegal for her to return to her husband. This verse also enforces the law stating that it is illegal for a Muslim woman to marry a male infidel. Then Allah decreed that the dowry received by the wife who converted to Islam be returned to her husband. According to Imam Shafi'i, the wife was obliged to return the dowry if her unbelieving husband asked her. If the husband does not request it, then the dowry is not required to return. Some scholars argue that the dowry is to be returned if her husband is among those who have entered into a peace agreement with the Muslims, while the husband who is not in the peace agreement with the dowry Muslim is not obliged to return it. Some scholars believe that the law of the dowry is not compulsory but it is a sunnah and it is also requested by her husband. Meanwhile, Muslims were allowed to marry the emigrant women by paying dowry. This means that women should not be slaves, since they are not prisoners of war. Allah urges Muslims to lead them to be protected. Allah explains that the reason for the prohibition of continuing the marriage of a believing wife with a disbelieving husband is because there will be no marriage relationship between believing women and their unbelieving husbands and in disbelievers. Their marriage contract has not expired since the wife converted to Islam. On the contrary, if those who went to the infidel were wives of believers and then he became infidels, the Muslims were ordered to let them go. However, they had to return the goods that her Muslim husband had given her. All that is said is the law of God which all who desire to obey Him must obey, for in establishing His law, Allah is All-Knowing the willingness of the servant to bear that law and know the best things that His servants can do. -Yes. In establishing the law, God also knows the benefits and consequences of establishing the law and its compatibility with those who carry it.",
      "text_tafsir": "Ayat ini menerangkan perintah Allah kepada Rasulullah dan orang-orang yang beriman tentang sikap yang harus diambil, jika seorang perempuan beriman yang berasal dari daerah kafir datang menghadap atau minta perlindungan. Allah menyatakan bahwa apabila datang seorang perempuan dari daerah kafir yang mengucapkan dua kalimat syahadat dan tidak tampak padanya tanda-tanda keingkaran dan kemunafikan, maka perlu diperiksa lebih dahulu, apakah mereka benar telah beriman, atau datang karena melarikan diri dari suaminya, sedangkan ia sebenarnya tidak beriman.\n\nAllah memerintahkan yang demikian itu bukan karena Dia tidak mengetahui hal ihwal mereka. Allah Maha Mengetahui hakikat iman mereka, bahkan mengetahui semua yang terbesit dalam hati mereka. Akan tetapi, untuk kewaspadaan dan berjaga-jaga di kalangan kaum Muslimin yang sedang berperang menghadapi orang-orang kafir, maka usaha-usaha mengadakan penelitian itu harus dilakukan, walaupun orang itu kerabat sendiri.\n\nJika dalam pemeriksaan itu terbukti mereka adalah orang-orang yang beriman, maka jangan sekali-kali kaum Muslimin mengembalikan mereka ke daerah kafir, sebab perempuan-perempuan yang beriman tidak halal lagi bagi suaminya yang kafir. Sebaliknya, pria-pria yang kafir tidak halal bagi perempuan yang beriman.\n\nDari ayat ini dapat ditetapkan suatu hukum yang menyatakan bahwa jika seorang istri telah masuk Islam, berarti sejak itu ia telah bercerai dengan suaminya yang masih kafir. Oleh karena itu, ia haram kembali kepada suaminya. Ayat ini juga menguatkan hukum yang menyatakan bahwa haram hukumnya seorang perempuan muslimat kawin dengan laki-laki kafir.\n\nKemudian Allah menetapkan agar mas kawin yang telah diterima istri yang masuk Islam itu dikembalikan kepada suaminya. Menurut Imam Syafi'i, istri wajib mengembalikan mahar itu jika pihak suaminya yang kafir itu memintanya. Jika pihak suami tidak memintanya, maka mahar itu tidak wajib dikembalikan. Sebagian ulama berpendapat bahwa mahar yang wajib dikembalikan itu jika suaminya termasuk orang yang telah melakukan perjanjian damai dengan kaum Muslimin, sedang bagi suami yang tidak termasuk dalam perjanjian damai dengan kaum Muslimin maharnya tidak wajib dikembalikan. Sebagian ulama lain berpendapat bahwa hukum pengembalian mahar itu bukan wajib tetapi sunah dan itu pun jika diminta oleh suaminya.\n\nSementara itu kaum Muslimin dibolehkan mengawini perempuan-perempuan mukminat yang berhijrah itu dengan membayar mahar. Hal ini berarti bahwa perempuan itu tidak boleh dijadikan budak, karena mereka bukan berasal dari tawanan perang. Allah menganjurkan kaum Muslimin mengawini mereka agar diri mereka terpelihara. \n\nAllah menerangkan bahwa penyebab larangan melanjutkan perkawinan istri yang beriman dengan suami yang kafir itu adalah karena tidak akan ada hubungan perkawinan antara perempuan-perempuan yang sudah beriman dengan suami-suami mereka yang masih kafir dan berada di daerah kafir. Akad perkawinan mereka tidak berlaku lagi sejak sang istri masuk Islam. Sebaliknya jika yang pergi ke daerah kafir itu adalah istri-istri yang beriman kemudian ia menjadi kafir, kaum Muslimin diperintahkan untuk membiarkan mereka pergi. Akan tetapi, mereka harus mengembalikan barang-barang yang pernah diberikan suaminya yang Muslim.\n\nSemua yang disebutkan itu adalah hukum-hukum Allah yang wajib ditaati oleh setiap orang yang menghambakan diri kepada-Nya, karena dalam menetapkan hukum-Nya, Allah Maha Mengetahui kesanggupan hamba yang akan memikul hukum itu dan mengetahui sesuatu yang paling baik dilakukan oleh hamba-hamba-Nya. Dalam menetapkan hukum itu, Allah juga mengetahui faedah dan akibat menetapkan hukum serta keserasian hukum itu bagi yang memikulnya.",
      "text_translation": "Wahai orang-orang yang beriman! Apabila perempuan-perempuan mukmin datang berhijrah kepadamu, maka hendaklah kamu uji (keimanan) mereka. Allah lebih mengetahui tentang keimanan mereka; jika kamu telah mengetahui bahwa mereka (benar-benar) beriman maka janganlah kamu kembalikan mereka kepada orang-orang kafir (suami-suami mereka). Mereka tidak halal bagi orang-orang kafir itu dan orang-orang kafir itu tidak halal bagi mereka. Dan berikanlah kepada (suami) mereka mahar yang telah mereka berikan. Dan tidak ada dosa bagimu menikahi mereka apabila kamu bayar kepada mereka maharnya. Dan janganlah kamu tetap berpegang pada tali (pernikahan) dengan perempuan-perempuan kafir; dan hendaklah kamu minta kembali mahar yang telah kamu berikan; dan (jika suaminya tetap kafir) biarkan mereka meminta kembali mahar yang telah mereka bayar (kepada mantan istrinya yang telah beriman). Demikianlah hukum Allah yang ditetapkan-Nya di antara kamu. Dan Allah Maha Mengetahui, Mahabijaksana.",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا جَاۤءَكُمُ الْمُؤْمِنٰتُ مُهٰجِرٰتٍ فَامْتَحِنُوْهُنَّۗ  اَللّٰهُ اَعْلَمُ بِاِيْمَانِهِنَّ فَاِنْ عَلِمْتُمُوْهُنَّ مُؤْمِنٰتٍ فَلَا تَرْجِعُوْهُنَّ اِلَى الْكُفَّارِۗ  لَا هُنَّ حِلٌّ لَّهُمْ وَلَا هُمْ يَحِلُّوْنَ لَهُنَّۗ وَاٰتُوْهُمْ مَّآ اَنْفَقُوْاۗ وَلَا جُنَاحَ عَلَيْكُمْ اَنْ تَنْكِحُوْهُنَّ اِذَآ اٰتَيْتُمُوْهُنَّ اُجُوْرَهُنَّۗ وَلَا تُمْسِكُوْا بِعِصَمِ الْكَوَافِرِ وَسْـَٔلُوْا مَآ اَنْفَقْتُمْ وَلْيَسْـَٔلُوْا مَآ اَنْفَقُوْاۗ ذٰلِكُمْ حُكْمُ اللّٰهِ ۗيَحْكُمُ بَيْنَكُمْۗ وَاللّٰهُ عَلِيْمٌ حَكِيْمٌ ",
      "text_translation_en": "O YOU who have attained to faith! Whenever believing women come unto you, forsaking the domain of evil, examine them, [although only] God is fully aware of their faith; and if you have thus ascertained that they are believers, do not send them back to the deniers of the truth, [since] they are [no longer] lawful to their erstwhile husbands, and these are [no longer] lawful to them. None the less, you shall return to them whatever they have spent [on their wives by way of dower]; and [then, O believers,] you will be committing no sin if you marry them after giving them their dowers. On the other hand, hold not to the marriage-tie with women who [continue to] deny the truth, and ask but for [the return of] whatever you have spent [by way of dower] -just as they [whose wives have gone over to you] have the right to demand [the return of] whatever they have spent. Such is God's judgment: He judges between you [in equity] - for God is all-knowing, wise.",
      "juz_number": 28
    },
    "11": {
      "text_tafsir_en": "In this verse is explained the law of a apostate wife who runs away from her husband to the unbelieving area, while she has not returned the dowry received from her believing husband. If the husband invades the unbelieving area, then he can capture his ex-wife, then he can take it back by replacing the dowry received by the wife of the infidel. Ibn Abi narrated from al-hasan that this verse was revealed in connection with the events of the Ummul of Abi Sufyan who had apostatized and fled from her husband, and then he married a man of the Bani tehqif. This verse ordered that the dowry received by the Ummah of the unbelieving husband be changed and taken from the spoils of war, and the Ummul returned to her husband (the Muslim). According to Ibn 'Abbas' history, the dowry was taken and given to the unbelieving husband before the spoils of war were divided into five as many as the unbelieving husband had given to the fleeing woman. At the end of this verse, Allah commands the Muslims to obey and obey His commands and put an end to His prohibitions, as described in the above verses, or those mentioned in other verses and in the hadith, if they believed in him and his messenger.",
      "text_tafsir": "Dalam ayat ini diterangkan hukum seorang istri mukminat yang murtad dan lari dari suaminya ke daerah kafir, sedang ia belum mengembalikan mahar yang pernah diterima dari suaminya yang Mukmin itu. Jika si suami menyerang daerah kafir, kemudian dapat menawan bekas istrinya, maka bekas istrinya itu boleh diambilnya kembali dengan mengganti mahar yang telah diterima oleh istri dari suami yang kafir.\n\nDiriwayatkan oleh Ibnu Abi hatim dari al-hasan bahwa ayat ini diturunkan berhubungan dengan peristiwa Ummul hakam binti Abi Sufyan yang telah murtad dan melarikan diri dari suaminya, kemudian ia menikah dengan seorang laki-laki dari Bani tsaqif. Ayat ini memerintahkan agar mas kawin yang diterima Ummul hakam dari suaminya yang kafir itu diganti dan diambilkan dari hasil rampasan perang, dan Ummul hakam kembali kepada suaminya semula (yang Muslim).\n\nMenurut riwayat Ibnu 'Abbas, mas kawin itu diambil dan diberikan kepada suami yang kafir sebelum harta rampasan perang dibagi lima sebanyak yang pernah diberikan suami yang kafir kepada perempuan yang lari itu.\n\nPada akhir ayat ini Allah memerintahkan agar kaum Muslimin bertakwa dan melaksanakan perintah-perintah-Nya dan menghentikan larangan-larangan-Nya, baik yang diterangkan pada ayat di atas, maupun yang disebut pada ayat-ayat yang lain serta yang terdapat di dalam hadis, jika mereka beriman kepada-Nya dan kepada Rasul-Nya.",
      "text_translation": "Dan jika ada sesuatu (pengembalian mahar) yang belum kamu selesaikan dari istri-istrimu yang lari kepada orang-orang kafir, lalu kamu dapat mengalahkan mereka maka berikanlah (dari harta rampasan) kepada orang-orang yang istrinya lari itu sebanyak mahar yang telah mereka berikan. Dan bertakwalah kamu kepada Allah yang kepada-Nya kamu beriman.",
      "text": "وَاِنْ فَاتَكُمْ شَيْءٌ مِّنْ اَزْوَاجِكُمْ اِلَى الْكُفَّارِ فَعَاقَبْتُمْ فَاٰتُوا الَّذِيْنَ ذَهَبَتْ اَزْوَاجُهُمْ مِّثْلَ مَآ اَنْفَقُوْاۗ وَاتَّقُوا اللّٰهَ الَّذِيْٓ اَنْتُمْ بِهٖ مُؤْمِنُوْنَ ",
      "text_translation_en": "And if any of your wives should go over to the deniers of the truth, and you are thus afflicted in turn, then give unto those whose wives have gone away the equivalent of what they had spent [on their wives by way of dower], and remain conscious of God, in whom you believe!",
      "juz_number": 28
    },
    "12": {
      "text_tafsir_en": "Allah told Muhammad that women who professed faith and obedience must promise that they would not associate with Allah in anything, would not steal others' property, would not commit adultery, would not abort children in their womb, and would not do what was forbidden. , such as mourning the dead by ripping clothes, and so on. If they have made a promise, then their statement of faith must be accepted. The Prophet was also told to tell them that they would receive Allah's forgiveness and reward from Him if they were to fulfill their promise. The Prophet was also asked to pray to Allah for their sins to be forgiven, for Allah is Oft-Forgiving, Most Merciful. Al-Bukhari of 'Urwah bin Zubair narrates that' she said, \"The Messenger of Allah (may peace be upon him) test the emigrant women according to the verse: yes ayyuhan-nabiyy idha ja'akal-mu'minat¦..innallaha capable the above terms mean that the woman has made a declaration that she is a believer. \" 'Urwah bin Zubair of' Aisha also recounts, saying, \"Fathimah binti 'Utbah had come to confess his faith to the Messenger of Allah. so Fathimah shyly recited the promise while putting his hand on his head. \" She said, \"You must admit what the Prophet said. By Allah, we do not declare faith except in that way.\" Fathimah carried out the request of 'Aisha, and the Prophet received his confession. According to other accounts, Prophet Muhammad received many statements from women during the conquest of Mecca. Among those who profess his faith are Hindun bint 'Utbah, wife of Abu Sufyan, head of the Quraysh tribe.",
      "text_tafsir": "Allah menyatakan kepada Nabi Muhammad bahwa perempuan-perempuan yang menyatakan keimanan dan ketaatannya harus berjanji bahwa mereka tidak akan mempersekutukan Allah dengan sesuatu pun, tidak akan mencuri harta orang lain, tidak akan berzina, tidak akan menggugurkan anak dalam kandungannya, dan tidak akan mengerjakan yang dilarang, seperti meratapi orang mati dengan mengoyak-ngoyak pakaian, dan sebagainya. Bila mereka telah berjanji, maka pernyataan iman mereka harus diterima. Nabi juga diperintahkan untuk mengatakan kepada mereka bahwa mereka akan mendapat ampunan Allah dan pahala dari-Nya jika mereka konsekuen melaksanakan janji mereka itu. Nabi juga diminta untuk berdoa kepada Allah agar dosa-dosa mereka diampuni, karena sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n\nDiriwayatkan oleh al-Bukhari dari 'Urwah bin Zubair bahwa 'Aisyah berkata, \"Rasulullah saw menguji perempuan yang hijrah sesuai ayat: ya ayyuhan-nabiyy idha ja'akal-mu'minat¦..innallaha gafurur-rahim. Barang siapa yang telah memenuhi syarat-syarat di atas, berarti perempuan itu telah mengikrarkan pernyataan bahwa dirinya beriman.\"\n\nDiriwayatkan pula oleh 'Urwah bin Zubair dari 'Aisyah, ia berkata, \"Telah datang Fathimah binti 'Utbah untuk menyatakan keimanannya kepada Rasulullah, maka beliau meminta ia berjanji tidak akan mempersekutukan Allah dengan sesuatu pun, tidak mencuri, tidak berzina, tidak menggugurkan kandungannya, maka Fathimah merasa malu menyebut janji itu sambil meletakkan tangan di atas kepalanya.\" Maka 'Aisyah berkata, \"Hendaklah engkau akui yang dikatakan Nabi itu. Demi Allah, kami tidak menyatakan keimanan kecuali dengan cara demikian.\" Fathimah melaksanakan yang diminta 'Aisyah itu, lalu Nabi menerima pengakuannya.\n\nMenurut riwayat yang lain bahwa Nabi Muhammad banyak menerima pernyataan beriman dari para perempuan ketika penaklukan Mekah. Di antara yang menyatakan keimanannya itu terdapat Hindun binti 'Utbah, istri Abu Sufyan, kepala suku Quraisy.",
      "text_translation": "Wahai Nabi! Apabila perempuan-perempuan yang mukmin datang kepadamu untuk mengadakan bai‘at (janji setia), bahwa mereka tidak akan mempersekutukan sesuatu apa pun dengan Allah; tidak akan mencuri, tidak akan berzina, tidak akan membunuh anak-anaknya, tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka dan tidak akan mendurhakaimu dalam urusan yang baik, maka terimalah janji setia mereka dan mohonkanlah ampunan untuk mereka kepada Allah. Sungguh, Allah Maha Pengampun, Maha Penyayang.",
      "text": "يٰٓاَيُّهَا النَّبِيُّ اِذَا جَاۤءَكَ الْمُؤْمِنٰتُ يُبَايِعْنَكَ عَلٰٓى اَنْ لَّا يُشْرِكْنَ بِاللّٰهِ شَيْـًٔا وَّلَا يَسْرِقْنَ وَلَا يَزْنِيْنَ وَلَا يَقْتُلْنَ اَوْلَادَهُنَّ وَلَا يَأْتِيْنَ بِبُهْتَانٍ يَّفْتَرِيْنَهٗ بَيْنَ اَيْدِيْهِنَّ وَاَرْجُلِهِنَّ وَلَا يَعْصِيْنَكَ فِيْ مَعْرُوْفٍ فَبَايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللّٰهَ ۗاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ ",
      "text_translation_en": "O Prophet! Whenever believing women come unto thee to pledge their allegiance to thee, [pledging] that [henceforth] they would not ascribe divinity, in any way, to aught but God, and would not steal, and would not commit adultery, and would not kill their children, and would not indulge in slander, falsely devising it out of nothingness: and would not disobey thee in anything [that thou declarest to be] right - then accept their pledge of allegiance, and pray to God to forgive them their [past] sins: for, behold, God is much-forgiving, a dispenser of grace.",
      "juz_number": 28
    },
    "13": {
      "text_tafsir_en": "Narrated by Ibn Mundhir of Ibn Ishaq of 'Ikrimah and Abu Sa'id of Ibn' Abbas, he explained that 'Abdullah bin' Umar and Zaid bin haritsah were friendly to the Jews. So this verse goes down that prohibits Muslims from being close friends with Allah's wrath. In this verse, God reiterates the prohibition of making Jews, Christians, and Meccans maliciously treat Muslims as their guardians or acquaintances, fearing that believers will tell them important secrets. At the end of this verse, Allah declares that the disbelievers are desperate for the benefit of Allah in the hereafter, because of their disobedience to the Messenger of Allah (may peace be upon him) who has announced his arrival in their books. In fact, the question has been further strengthened with clear evidence and clear miracles. Their desperation for God's grace in the hereafter is just as much as their desperation in the grave because they do not believe in the resurrection.",
      "text_tafsir": "Diriwayatkan oleh Ibnu Mundhir dari Ibnu Ishaq dari 'Ikrimah dan Abu Sa'id dari Ibnu 'Abbas, ia menerangkan bahwa 'Abdullah bin 'Umar dan Zaid bin haritsah bersahabat dengan orang-orang Yahudi. Maka turunlah ayat ini yang melarang kaum Muslimin berteman erat dengan orang yang dimurkai Allah.\n\nDalam ayat ini, Allah menegaskan kembali larangan menjadikan orang-orang Yahudi, Nasrani, dan musyrik Mekah yang berniat jahat terhadap kaum Muslimin sebagai wali atau teman akrab, karena dikhawatirkan orang-orang yang beriman akan menyampaikan rahasia-rahasia penting kepada mereka.\n\nPada akhir ayat ini, Allah menerangkan bahwa orang-orang kafir itu telah putus asa untuk memperoleh kebaikan dari Allah di akhirat, karena kedurhakaan mereka kepada Rasulullah saw yang telah diisyaratkan kedatangannya dalam kitab-kitab mereka. Padahal, persoalan itu sudah dikuatkan pula dengan bukti-bukti yang jelas dan mukjizat yang nyata. Keputusasaan mereka untuk memperoleh rahmat Allah di hari akhirat sama halnya dengan keputusasaan mereka di dalam kubur karena mereka tidak percaya adanya kebangkitan kembali di akhirat.",
      "text_translation": "Wahai orang-orang yang beriman! Janganlah kamu jadikan orang-orang yang dimurkai Allah sebagai penolongmu, sungguh, mereka telah putus asa terhadap akhirat sebagaimana orang-orang kafir yang telah berada dalam kubur juga berputus asa.",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَوَلَّوْا قَوْمًا غَضِبَ اللّٰهُ عَلَيْهِمْ قَدْ يَىِٕسُوْا مِنَ الْاٰخِرَةِ كَمَا يَىِٕسَ الْكُفَّارُ مِنْ اَصْحٰبِ الْقُبُوْرِ ࣖ ",
      "text_translation_en": "O YOU who have attained to faith! Be not friends with people whom God has condemned! They [who would befriend them] are indeed bereft of all hope of a life to come - just as those deniers of the truth are bereft of all hope of [ever again seeing] those who are [now] in their graves.",
      "juz_number": 28
    }
  },
  "name": "الممتحنة",
  "name_translation_en": "She that is to be examined",
  "name_translation": "Wanita Yang Diuji",
  "name_latin": "Al-Mumtahanah"
}