{
  "number": 64,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 18,
  "ayat": {
    "1": {
      "text_tafsir_en": "God explains that whatever is in the heavens and on the earth is His praise. This means that what is in the heavens and on the earth shows the purity and perfection of God and all beings are submissive and submissive to Him. He is the Emperor who is able to do according to His will in all things, worthy of praise for His creation, for He is the source of all goodness. Almighty God in all things, what He wills, will surely come to pass and nothing can hinder him. As for what He does not want, it will not exist.",
      "text_tafsir": "Allah menerangkan bahwa apa yang ada di langit dan di bumi bertasbih menyucikan-Nya. Ini berarti bahwa apa yang ada di langit dan di bumi menunjukkan kesucian dan kesempurnaan Allah serta semua makhluk itu tunduk dan menyerah kepada-Nya. Dialah Maharaja yang berwenang berbuat sesuai dengan kehendak-Nya terhadap semua yang ada, berhak dipuji atas penciptaan-Nya, karena Dia sumber segala kebaikan. Allah Mahakuasa atas segala sesuatu, apa yang dikehendaki-Nya pasti berwujud dan menjadi kenyataan tanpa ada yang dapat menghalangi-Nya. Sedangkan terhadap apa yang tidak dikehendaki-Nya, hal itu tidak akan ada.",
      "text_translation": "Apa yang ada di langit dan apa yang ada di bumi senantiasa bertasbih kepada Allah; milik-Nya semua kerajaan dan bagi-Nya (pula) segala puji; dan Dia Mahakuasa atas segala sesuatu. ",
      "text": "يُسَبِّحُ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُۖ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ",
      "text_translation_en": "ALL THAT IS in the heavens and all that is on earth extols God's limitless glory: His is all dominion, and to Him all praise is due; and He has the power to will anything.",
      "juz_number": 28
    },
    "2": {
      "text_tafsir_en": "This verse explains that it is Allah who created all things according to His will. Allah says: Allah is the Creator of all things and He is the Author of all things. (az-Zumar \/ 39: 62) Basically human beings are born in the nature of nature, but some of them choose disbelief against their nature and some choose faith in accordance with the nature of their nature, as the Prophet saw: Every child is born in a state of nature (Islam). Then the two men would make him a Jew, a Christian, or a Magician. (History of al-Bukhari and Muslim) Even if the person wants to reflect on the events and events in this universe, it would be sufficient guarantee for humanity to return to the right by choosing faith, and to appreciate the blessings bestowed upon it. However, the human being is unconscious and conscious of it, leading to disunity, the disobedience of the Creator, and the blessings bestowed upon him. It is fitting that man recognizes that God sees everything he does, and that he will be rewarded in the hereafter. The good is repaid in heaven, while the wicked are rewarded with torment and cast into hell, the wicked abode of dwellings, as God says: Indeed, Hell is a terrible abode of dwellings and abodes. (al-Furqan \/ 25: 66)",
      "text_tafsir": "Ayat ini menerangkan bahwa Allahlah yang menciptakan semua yang ada menurut kehendak-Nya. Allah berfirman:\n\nAllah pencipta segala sesuatu dan Dia Maha Pemelihara atas segala sesuatu. (az-Zumar\/39: 62)\n\nPada dasarnya manusia ketika dilahirkan dalam keadaan fitrah, tetapi sebagian dari manusia itu memilih kekafiran yang bertentangan dengan fitrahnya dan sebahagian lagi memilih iman sesuai dengan tuntutan fitrahnya, sebagaimana sabda Nabi saw:\n\nSetiap anak dilahirkan dalam keadaan fitrah (Islam). Maka kedua orang tualah yang akan menjadikannya seorang Yahudi, Nasrani, atau Majusi. (Riwayat al-Bukhari dan Muslim)\n\nAndaikata manusia itu mau memikirkan kejadiannya dan kejadian yang ada di alam raya ini, pasti cukup menjadi jaminan bagi manusia untuk kembali kepada yang hak dengan memilih iman, dan mensyukuri nikmat yang telah dianugerahkan kepadanya. Akan tetapi, manusia itu tidak sadar dan insaf atas semuanya itu, sehingga terjadilah perpecahan, mengingkari Tuhan yang menciptakannya, serta nikmat-nikmat yang telah dianugerahkan kepadanya. Selayaknya manusia itu menginsafi bahwa Allah melihat segala yang dikerjakannya, dan di akhirat nanti dia akan diberi balasan terhadap semua itu. Yang baik dibalas dengan surga, sedangkan yang jahat dibalas dengan siksaan dan dimasukkan ke dalam neraka Jahanam, sejahat-jahat tempat kediaman, sebagaimana Allah berfirman:\n\nSungguh, Jahanam itu seburuk-buruk tempat menetap dan tempat kediaman. (al-Furqan\/25: 66)",
      "text_translation": "Dialah yang menciptakan kamu, lalu di antara kamu ada yang kafir dan di antara kamu (juga) ada yang mukmin. Dan Allah Maha Melihat apa yang kamu kerjakan.",
      "text": "هُوَ الَّذِيْ خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَّمِنْكُمْ مُّؤْمِنٌۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ ",
      "text_translation_en": "He it is who has created you: and among you are such as deny this truth, and among you are such as believe [in it]. And God sees all that you do.",
      "juz_number": 28
    },
    "3": {
      "text_tafsir_en": "This verse explains that God created heaven and earth with the right purpose, the wisdom, and the happiness of his creatures in this world and the hereafter. He is the one who created man in a very good form, different from other beings. Humans will take responsibility for everything they do in the world and get a fair reward, God says: We have created man in the best possible way. (at-Tin \/ 95: 4) In another verse God says: And fear the day when you will all be returned to Allah. Then each person will be rewarded according to what he has done, and they will not be harmed. (al-Baqarah \/ 2: 281) An explanation of creation with the right purpose can be found in the description of the same in Surah ad-Dukhan \/ 44: 38-39 and sad \/ 38: 27.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menciptakan langit dan bumi dengan tujuan yang benar, penuh kebijaksanaan, dan menjamin kebahagiaan makhluknya di dunia dan akhirat. Dia pulalah yang menjadikan manusia dalam bentuk yang sebagus-bagusnya, berbeda dengan makhluk yang lain. Manusia akan mempertanggungjawabkan segala perbuatannya di dunia lalu mendapat balasan yang setimpal, Allah berfirman:\n\nSungguh, Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya. (at-Tin\/95: 4)\n\nDalam ayat lain Allah berfirman:\n\nDan takutlah pada hari (ketika) kamu semua dikembalikan kepada Allah. Kemudian setiap orang diberi balasan yang sempurna sesuai dengan apa yang telah dilakukannya, dan mereka tidak dizalimi (dirugikan). (al-Baqarah\/2: 281)\n\nPenjelasan mengenai penciptaan dengan tujuan yang benar dapat dilihat pada uraian mengenai hal yang sama pada Surah ad-Dukhan\/44: 38-39 dan sad\/38: 27.",
      "text_translation": "Dia menciptakan langit dan bumi dengan (tujuan) yang benar, Dia membentuk rupamu lalu memperbagus rupamu, dan kepada-Nya tempat kembali. ",
      "text": "خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَاَحْسَنَ صُوَرَكُمْۚ وَاِلَيْهِ الْمَصِيْرُ ",
      "text_translation_en": "He has created the heavens and the earth in accordance with [an inner] truth, and has formed you - and formed you so well; and with Him is your journey's end.",
      "juz_number": 28
    },
    "4": {
      "text_tafsir_en": "This verse states that Allah is All-Knowing in the heavens and on the earth. There is nothing hidden for him. He is the one who governs according to His vast knowledge and His power which covers and covers all things according to His will, as God says: Indeed it is His business when He desires something He just says to it, \"Be it!\" Then be something. (Yasin \/ 36: 82) Allah knows all things, whether they are hidden or not. Thus, human beings do according to what the religion of Allah outlined by our Prophet Muhammad (peace be upon him) is called Islam, to obtain his will, to obtain double merit, and to be happy in this world and the Hereafter. This 4th verse closes with an affirmation that God is all-knowing in all hearts, with nothing hidden for Him. Allah's Word: Indeed, Allah is All-Knowing. (al-'Ankabut \/ 29: 62) In another verse Allah says: Verily, Allah is All-knowing. (Luqman \/ 31: 23)",
      "text_tafsir": "Ayat ini menyatakan bahwa Allah Maha Mengetahui apa yang ada di langit dan di bumi. Tidak satu pun yang tersembunyi bagi-Nya. Dialah yang mengatur yang ada sesuai dengan ilmu-Nya yang luas dan kekuasaan-Nya yang mencakup dan meliputi segala sesuatu menurut kehendak-Nya, sebagaimana Allah berfirman:\n\nSesungguhnya urusan-Nya apabila Dia menghendaki sesuatu Dia hanya berkata kepadanya, \"Jadilah!\" Maka jadilah sesuatu itu. (Yasin\/36: 82)\n\nAllah mengetahui segala sesuatu, baik yang dirahasiakan apalagi yang tampak nyata. Maka seyogyanya manusia berbuat sesuai dengan apa yang digariskan agama Allah yang dibawa junjungan kita Nabi Muhammad saw yaitu agama Islam, untuk mendapat rida-Nya, memperoleh pahala yang berlipat-ganda, dan berbahagia di dunia dan akhirat.\n\nAyat ke-4 ini ditutup dengan satu ketegasan bahwa Allah itu Maha Mengetahui segala isi hati, tidak ada sesuatu pun yang tersembunyi bagi-Nya. Firman Allah:\n\nSungguh, Allah Maha Mengetahui segala sesuatu. (al-'Ankabut\/29: 62)\n\nDalam ayat lain Allah berfirman:\n\nSesungguhnya Allah Maha Mengetahui segala isi hati. (Luqman\/31: 23)",
      "text_translation": "Dia mengetahui apa yang di langit dan di bumi, dan mengetahui apa yang kamu rahasiakan dan apa yang kamu nyatakan. Dan Allah Maha Mengetahui segala isi hati. ",
      "text": "يَعْلَمُ مَا فِى السَّمٰوٰتِ وَالْاَرْضِ وَيَعْلَمُ مَا تُسِرُّوْنَ وَمَا تُعْلِنُوْنَۗ وَاللّٰهُ عَلِيْمٌ ۢبِذَاتِ الصُّدُوْرِ ",
      "text_translation_en": "He knows all that is in the heavens and on earth; and He knows all that you keep secret as well as all that you bring into the open: for God has full knowledge of what is in the hearts [of men].",
      "juz_number": 28
    },
    "5": {
      "text_tafsir_en": "The hypocrites, when called upon the Messenger of Allah (may peace be upon him) to ask Allah for forgiveness of their sins, rejected the invocation. They turned his face in a style that showed arrogance and arrogance. This is also mentioned in the word of Allah: And when it is said to them, \"Obey what Allah has sent down and (obey) the Messenger,\" (Muhammad) you will see the hypocrites stubbornly blocking you. (Nisa '\/ 4: 61)",
      "text_tafsir": "Orang-orang munafik itu apabila diajak mendatangi Rasulullah saw agar beliau memintakan ampunan kepada Allah atas dosa-dosa yang telah diperbuat, mereka itu menolak mentah-mentah ajakan itu. Mereka memalingkan mukanya dengan gaya yang menunjukkan keangkuhan dan kesombongan. Hal ini disebutkan pula dalam firman Allah:\n\nDan apabila dikatakan kepada mereka, \"Marilah (patuh) kepada apa yang telah diturunkan Allah dan (patuh) kepada Rasul,\" (niscaya) engkau (Muhammad) melihat orang munafik menghalangi dengan keras darimu. (an-Nisa'\/4: 61)",
      "text_translation": "Apakah belum sampai kepadamu (orang-orang kafir) berita orang-orang kafir dahulu? Maka mereka telah merasakan akibat buruk dari perbuatannya dan mereka memperoleh azab yang pedih. ",
      "text": "اَلَمْ يَأْتِكُمْ نَبَؤُا الَّذِيْنَ كَفَرُوْا مِنْ قَبْلُ ۖفَذَاقُوْا وَبَالَ اَمْرِهِمْ وَلَهُمْ عَذَابٌ اَلِيْمٌ ",
      "text_translation_en": "HAVE THE STORIES of those who, in earlier times, refused to acknowledge the truth never yet come within your ken? [They denied it -] and so they had to taste the evil outcome of their own doings, with [more] grievous suffering awaiting them [in the life to come]:",
      "juz_number": 28
    },
    "6": {
      "text_tafsir_en": "God warned the Meccans of the Meccans about the experiences of those who had rejected the apostles before them, such as the Noah, the Huds, the Salehites, and others. To them were all kinds of torments and tortures. Some are floods that submerge and destroy what is on the earth, some are hurricanes that destroy and destroy their buildings, and so on. (6) Allah explains that the reason for the plagues was inflicted on the ancients was because they were carelessly denying the apostles after being given clear evidence, and showing miraculous signs. They say, \"One of the wonderful things that will guide us is the ordinary man who has no advantage over us. He has no superior mind over us, and has no power and authority to subdue us.\" In another verse God says: Then they say, \"How shall we follow a man among us?\" (al-Qamar \/ 54: 24) They do not know that those prophets and apostles are those whom God has chosen according to His will, as it is stated in His Word: Allah knows best where He has put His message. (al-An'am \/ 6: 124) When their disobedience was prolonged and their dissent ceased, Allah destroyed them. Allah does not need them and has little interest in them. He is the Almighty, having no need for anything, to be commended for all the good that has been bestowed upon his creatures.",
      "text_tafsir": "Allah memperingatkan orang-orang musyrik penduduk Mekah tentang kejadian-kejadian yang telah dialami oleh orang-orang yang mengingkari para rasul sebelum mereka, seperti kaum Nuh, kaum Hud, kaum Saleh, dan lainnya. Kepada mereka telah ditimpakan berbagai azab dan siksa yang bermacam-macam bentuknya. Ada yang berupa banjir yang menenggelamkan dan merusak apa yang ada di atas bumi, ada yang berupa angin topan yang menerbangkan dan menghancurkan bangunan-bangunan tempat tinggal mereka, dan lain sebagainya.\n\n(6) Allah menerangkan bahwa sebab-sebab ditimpakan berbagai azab kepada umat terdahulu itu ialah karena kecerobohan mereka mendustakan para rasul sesudah mereka diberi keterangan yang jelas, dan diperlihatkan mukjizat-mukjizat nyata. Mereka berkata, \"Satu hal yang ajaib bahwa orang yang akan memberi petunjuk kepada kami ialah manusia biasa yang tidak mempunyai sedikit pun kelebihan dari kami. Ia tidak mempunyai pikiran lebih unggul dari kami, dan tidak memiliki kekuatan dan kekuasaan untuk menundukkan kami.\" Dalam ayat yang lain Allah berfirman:\n\nMaka mereka berkata, \"Bagaimana kita akan mengikuti seorang manusia (biasa) di antara kita?\" (al-Qamar\/54: 24)\n\nMereka tidak mengetahui bahwa para nabi dan rasul itu adalah orang-orang yang telah dipilih Allah menurut kehendak-Nya, sebagaimana diterangkan dalam firman-Nya:\n\nAllah lebih mengetahui di mana Dia menempatkan tugas kerasulan-Nya. (al-An'am\/6: 124)\n\nSetelah keingkaran mereka berkepanjangan dan pembangkangan mereka berlarut-larut, maka Allah membinasakan mereka. Allah tidak memerlukan mereka serta tidak mempunyai kepentingan sedikit pun kepada mereka. Dia Mahakuasa, tidak mempunyai keperluan sedikit pun kepada sesuatu, Maha Terpuji atas segala nikmat yang telah ditetapkan kepada makhluk-Nya.",
      "text_translation": "Yang demikian itu karena sesungguhnya ketika rasul-rasul datang kepada mereka (membawa) keterangan-ke-terangan lalu mereka berkata, “Apakah  (pantas) manusia yang memberi petunjuk kepada kami?” Lalu mereka ingkar dan berpaling; padahal Allah tidak memerlukan (mereka). Dan Allah Mahakaya, Maha Terpuji. ",
      "text": "ذٰلِكَ بِاَنَّهٗ كَانَتْ تَّأْتِيْهِمْ رُسُلُهُمْ بِالْبَيِّنٰتِ فَقَالُوْٓا اَبَشَرٌ يَّهْدُوْنَنَاۖ فَكَفَرُوْا وَتَوَلَّوْا وَّاسْتَغْنَى اللّٰهُ ۗوَاللّٰهُ غَنِيٌّ حَمِيْدٌ ",
      "text_translation_en": "this, because time and again there came unto them their apostles with all evidence of the truth, but they [always] replied, \"Shall mere mortal men be our guides?\" And so they. denied the truth and turned away. But God was not in need [of them]: for God is self-sufficient, ever to be praised.",
      "juz_number": 28
    },
    "7": {
      "text_tafsir_en": "In this verse, God explains that the monks think there will be no day of resurrection, day of reckoning, and day of retribution. These assumptions are also expressed in the verse that says: If we were to become a land, would we (re) become a new creature? (ar-Ra'd \/ 13: 5) The Word of God: Who can revive the bones, which have perished? (Yasin \/ 36: 78) The presumption of the wrongdoer was rejected by God strictly. Allah declares that the day of resurrection and the day of vengeance must exist, and that all men are brought back to life on that day. Then they were told all they had done in the world to the smallest to be pitied and rewarded. So this is for Allah very easy and there is no difficulty at all. The Word of Allah: Say (Muhammad), \"He who gives life to him first created it, and He is the All-Knowing of all beings.\" (Yasin \/ 36: 79) In another verse Allah says: And those who disbelieve say , \"The Day of Judgment will not come to us.\" Say, \"Surely, for the sake of my supernatural God, it will surely come to you. (Saba '\/ 34: 3)",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa orang musyrik beranggapan tidak akan ada hari kebangkitan, hari perhitungan, dan hari pembalasan. Anggapan mereka ini diungkapkan juga dalam ayat yang berbunyi:\n\nApabila kami telah menjadi tanah, apakah kami akan (dikembalikan) menjadi makhluk yang baru? (ar-Ra'd\/13: 5)\n\nFirman Allah:\n\nSiapakah yang dapat menghidupkan tulang-belulang, yang telah hancur luluh? (Yasin\/36: 78)\n\nAnggapan orang musyrik yang salah itu ditolak Allah dengan tegas. Allah menyatakan bahwa hari kebangkitan dan hari pembalasan itu pasti ada, dan semua manusia dihidupkan kembali pada hari itu. Lalu diberitakan semua yang pernah mereka perbuat di dunia sampai kepada yang sekecil-kecilnya untuk dihisab dan diberi balasan. Yang demikian ini bagi Allah sangat mudah dan tidak ada kesulitan sama sekali. Firman Allah:\n\nKatakanlah (Muhammad), \"Yang akan menghidupkannya ialah (Allah) yang menciptakannya pertama kali. Dan Dia Maha Mengetahui tentang segala makhluk. (Yasin\/36:79)\n\nDalam ayat yang lain Allah berfirman:\n\nDan orang-orang yang kafir berkata, \"Hari Kiamat itu tidak akan datang kepada kami.\" Katakanlah, \"Pasti datang, demi Tuhanku yang mengetahui yang gaib, Kiamat itu pasti akan datang kepadamu. (Saba'\/34: 3)",
      "text_translation": "Orang-orang yang kafir mengira, bahwa mereka tidak akan dibangkitkan. Katakanlah (Muhammad), “Tidak demikian, demi Tuhanku, kamu pasti dibangkitkan, kemudian diberitakan semua yang telah kamu kerjakan.” Dan yang demikian itu mudah bagi Allah. ",
      "text": "زَعَمَ الَّذِيْنَ كَفَرُوْٓا اَنْ لَّنْ يُّبْعَثُوْاۗ قُلْ بَلٰى وَرَبِّيْ لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْۗ وَذٰلِكَ عَلَى اللّٰهِ يَسِيْرٌ ",
      "text_translation_en": "They who are bent on denying the truth claim that they will never be raised from the dead! Say: \"Yea, by my Sustainer! Most surely will you be raised from the dead, and then, most surely, will you be made to understand what you did [in life]! For, easy is this for God!\"",
      "juz_number": 28
    },
    "8": {
      "text_tafsir_en": "In this verse, God commands the unbelievers, after asserting that the day of resurrection must exist, to believe in Him, His Messenger, and the light of His revealed Quran, which will guide and guide mankind to the right path. There is nothing hidden from their deeds. Everything is known to Him and will be repaid on the Day of Resurrection, good or bad.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan orang-orang musyrik, sesudah ditegaskan bahwa hari kebangkitan itu pasti ada, agar beriman kepada-Nya, Rasul-Nya, dan cahaya Al-Qur'an yang telah diturunkan-Nya, yang akan memberi petunjuk dan membimbing manusia ke jalan yang benar. Amal perbuatan mereka itu tidak ada yang tersembunyi bagi Allah. Semua diketahui-Nya dan akan dibalas pada hari kebangkitan nanti, yang baik maupun yang buruk.",
      "text_translation": "Maka berimanlah kamu kepada Allah dan Rasul-Nya dan kepada cahaya (Al-Qur'an) yang telah Kami turunkan. Dan Allah Mahateliti terhadap apa yang kamu kerjakan.",
      "text": "فَاٰمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَالنُّوْرِ الَّذِيْٓ اَنْزَلْنَاۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ ",
      "text_translation_en": "Believe then, [O men,] in God and His Apostle, and in the light [of revelation] which We have bestowed [on you] from on high! And God is fully aware of all that you do.",
      "juz_number": 28
    },
    "9": {
      "text_tafsir_en": "In this verse, God explains that on the Day of Judgment He will gather the ancient and the later ones in a field, as He says: That is the day when all men are gathered (to be crowned), and that is the day (by all creature). (Hud \/ 11: 103) The Word of God in another verse says: \"(Yes), surely the former and the latter will certainly be gathered at a certain time, on a given day.\" (al-Waqi'ah \/ 56: 49-50) That day will be examined and rewarded by the deeds done by every human being in the world. All deeds, whether in error or truth, will be revealed on that day. That day is called \"sunset\". The unbelievers who have exchanged the afterlife with the world by choosing the delights of the world from the pleasures of the hereafter, will suffer loss and gain nothing. While the believers who have sacrificed themselves to gain heaven, they are fortunate and will not lose anything. In a hadith, it is narrated: No one goes to heaven unless he is shown a place (in which he had been prepared) in hell, if he does evil to increase gratitude. And no man goes to hell unless he is shown a place (in which he has been prepared) in heaven, if he does good to increase his regret. (History of Ahmad and al-Bukhari of Abu Hurairah) Those who believed in Allah and obeyed His command, abstained from His prohibition, were blotted out of all their sins and sins, and were forgiven and included in a river flowing beneath the river, river. They will remain in it, they will not die, and will not go out from there. Thus it is an unparalleled advantage and happiness, having escaped destruction and destruction. God says in another verse: But those who come to him in faith, and do good, then they are those who have a high degree, (that is) the paradise of 'Adn, which flows beneath the river, the river, they remain in it. That is the reward for those who purify themselves. (thaha \/ 20: 75-76)",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa pada hari Kiamat nanti Dia akan mengumpulkan orang-orang terdahulu dan yang datang kemudian di suatu lapangan, sebagaimana firman-Nya:\n\nItulah hari ketika semua manusia dikumpulkan (untuk dihisab), dan itulah hari yang disaksikan (oleh semua makhluk). (Hud\/11: 103)\n\nFirman Allah dalam ayat lain:\n\nKatakanlah, \"(Ya), sesungguhnya orang-orang yang terdahulu dan yang kemudian, pasti semua akan dikumpulkan pada waktu tertentu, pada hari yang sudah dimaklumi.\" (al-Waqi'ah\/56: 49-50)\n\nPada hari itulah nanti akan diteliti dan dibalas amal yang telah dilakukan setiap manusia di dunia ini. Semua amal, baik berupa kesalahan atau kebenaran, akan terungkap pada hari itu. Hari itulah yang dinamakan hari \"tagabun\". Orang-orang kafir yang telah menukar kehidupan akhirat dengan dunia yakni memilih kelezatan dunia dari kenikmatan akhirat, akan merugi dan tidak memperoleh keuntungan sedikit pun. Sedangkan orang-orang mukmin yang telah mengorbankan dirinya untuk memperoleh surga, mereka itulah yang beruntung dan tak akan merugi sedikit pun. Dalam sebuah hadis diriwayatkan:\n\nTidak seseorang masuk surga melainkan diperlihatkan kepadanya tempat (yang pernah disediakan baginya) di neraka, seandainya ia berbuat keburukan agar menambah kesyukuran. Dan tidaklah seseorang masuk neraka melainkan diperlihatkan kepadanya tempat (yang pernah disediakan baginya) di surga, seandainya ia berbuat kebaikan agar penyesalannya bertambah. (Riwayat Ahmad dan al-Bukhari dari Abu Hurairah)\n\nOrang-orang yang percaya kepada Allah dan taat kepada perintah-Nya, menjauhi larangan-Nya, niscaya dihapus semua kesalahan dan dosanya, serta diampuni dan dimasukkan ke dalam surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya, tidak akan mati, dan tidak akan keluar dari sana. Yang demikian itu adalah satu keuntungan dan kebahagiaan yang tiada taranya, karena telah terhindar dari kebinasaan dan kehancuran. Allah berfirman dalam ayat lain:\n\nTetapi barang siapa datang kepada-Nya dalam keadaan beriman, dan telah mengerjakan kebajikan, maka mereka itulah orang yang memperoleh derajat yang tinggi (mulia), (yaitu) surga-surga 'Adn, yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Itulah balasan bagi orang yang menyucikan diri. (thaha\/20: 75-76)",
      "text_translation": "(Ingatlah) pada hari (ketika) Allah mengumpulkan kamu pada hari berhimpun, itulah hari pengungkapan kesalahan-kesalahan. Dan barangsiapa beriman kepada Allah dan mengerjakan kebajikan niscaya Allah akan menghapus kesalahan-kesalahannya dan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung. ",
      "text": "يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ذٰلِكَ يَوْمُ التَّغَابُنِۗ وَمَنْ يُّؤْمِنْۢ بِاللّٰهِ وَيَعْمَلْ صَالِحًا يُّكَفِّرْ عَنْهُ سَيِّاٰتِهٖ وَيُدْخِلْهُ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَآ اَبَدًاۗ ذٰلِكَ الْفَوْزُ الْعَظِيْمُ ",
      "text_translation_en": "[Think of] the time when He shall gather you all together unto the Day of the [Last] Gathering - that Day of Loss and Gain! For, as for him who shall have believed in God and done what is just and right, He will [on that Day] efface his bad deeds, and will admit him into gardens through which running waters flow, therein to abide beyond the count of time: that will be a triumph supreme!",
      "juz_number": 28
    },
    "10": {
      "text_tafsir_en": "In this verse, Allah explains that those who disobey His will, and reject the Qur'anic verses that have been revealed to the Prophet Muhammad, are the inhabitants of hell. They will dwell therein, as Allah says: As for those who disbelieve and deny Our Signs, they are the dwellers of Hell, they dwell therein. (al-Baqarah \/ 2:39) In another verse Allah says: As for those who disbelieve and deny Our Signs, they are the dwellers of hell. (al-Ma'idah \/ 5: 10) What a loss to the inhabitants of hell because the place is a terrible place to return, and a wicked place of residence, as Allah says: Indeed, Hell is a terrible place to dwell and a dwelling place. (al-Furqan \/ 25: 66)",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa orang-orang yang mengingkari keesaan-Nya, dan mendustakan ayat-ayat Al-Qur'an yang telah diturunkan kepada Nabi Muhammad, adalah penghuni neraka. Mereka akan tinggal kekal di dalamnya, sebagaimana Allah berfirman:\n\nAdapun orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itu penghuni neraka, mereka kekal di dalamnya. (al-Baqarah\/2: 39)\n\nDalam ayat yang lain Allah berfirman:\n\nAdapun orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itu penghuni neraka. (al-Ma'idah\/5: 10)\n\nAlangkah ruginya penghuni neraka karena tempat itu adalah seburuk-buruk tempat kembali, dan sejahat-jahat tempat tinggal, sebagaimana Allah berfirman:\n\nSungguh, Jahanam itu seburuk-buruk tempat menetap dan tempat kediaman. (al-Furqan\/25: 66)",
      "text_translation": "Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itulah penghuni neraka, mereka kekal di dalamnya. Dan itulah seburuk-buruk tempat kembali. ",
      "text": "وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَآ اُولٰۤىِٕكَ اَصْحٰبُ النَّارِ خٰلِدِيْنَ فِيْهَاۗ وَبِئْسَ الْمَصِيْرُ ࣖ ",
      "text_translation_en": "But as for those who are bent on denying the truth and on giving the lie to Our messages - they are destined for the fire, therein to abide: and how vile a journey’s end!",
      "juz_number": 28
    },
    "11": {
      "text_tafsir_en": "Allah explained that what happened to humans, both the pleasure of the world and in the form of torture is qadha 'and qadar, according to the will of God that has been set on earth. In trying hard, humans should not regret and feel disappointed when they encounter things that are not in accordance with their efforts and desires. It was beyond his ability, because it is God's provision that will apply and come true. As He said: Say (Muhammad), \"Nothing will happen to us but what Allah has decreed for us.\" (At-Taubah \/ 9: 51) Allah instructs a believer to open his chest, accepting with pleasure what happens to him, both as desired and not, because he believes that all of it is from God. Ibn Abbas interpreted that Allah gave the believers in his heart a belief. Similarly, when someone is overwritten by calamity, he says inna lillahi wa inna ilaihi raji'un, it is because of faith that causes patience and finally the calamity is light for him.",
      "text_tafsir": "Allah menerangkan bahwa apa yang menimpa manusia, baik yang merupakan kenikmatan dunia maupun yang berupa siksa adalah qadha' dan qadar, sesuai dengan kehendak Allah yang telah ditetapkan di muka bumi. Dalam berusaha keras, manusia hendaknya tidak menyesal dan merasa kecewa apabila menemui hal-hal yang tidak sesuai dengan usaha dan keinginannya. Hal itu di luar kemampuannya, karena ketentuan Allah-lah yang akan berlaku dan menjadi kenyataan. Sebagaimana firman-Nya:\n\nKatakanlah (Muhammad), \"Tidak akan menimpa kami melainkan apa yang telah ditetapkan Allah bagi kami.\" (at-Taubah\/9: 51)\n\nAllah memberi petunjuk kepada orang yang beriman untuk melapangkan dadanya, menerima dengan segala senang hati apa yang terjadi pada dirinya, baik sesuai dengan yang diinginkan, maupun yang tidak, karena ia yakin bahwa kesemuanya itu dari Allah. Ibnu Abbas menafsirkan bahwa Allah memberikan kepada orang mukmin dalam hatinya suatu keyakinan. Begitu pula ketika seseorang ditimpa musibah, ia mengatakan inna lillahi wa inna ilaihi raji'un, hal itu karena iman yang menyebabkan sabar dan akhirnya musibah itu ringan baginya.",
      "text_translation": "Tidak ada sesuatu musibah yang menimpa (seseorang), kecuali dengan izin Allah; dan barangsiapa beriman kepada Allah, niscaya Allah akan memberi petunjuk kepada hatinya. Dan Allah Maha Mengetahui segala sesuatu. ",
      "text": "مَآ اَصَابَ مِنْ مُّصِيْبَةٍ اِلَّا بِاِذْنِ اللّٰهِ ۗوَمَنْ يُّؤْمِنْۢ بِاللّٰهِ يَهْدِ قَلْبَهٗ ۗوَاللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ ",
      "text_translation_en": "NO CALAMITY can ever befall [man] unless it be by God's leave: hence, whoever believes in God guides his [own] heart [towards this truth]; and God has full knowledge of everything.",
      "juz_number": 28
    },
    "12": {
      "text_tafsir_en": "God commands that humans obey Him and His apostles by carrying out His commands and abandoning His prohibitions. When they remain disobedient and obedient, know that the task of the Messenger of Allah is merely conveying what is his duty and obligation, as confirmed in the word of God: If you turn away, then know that the obligation of our apostles is only to convey (mandate) clearly. (al-Ma'idah \/ 5: 92)",
      "text_tafsir": "Allah memerintahkan agar manusia taat kepada-Nya dan rasul-Nya dengan melaksanakan perintah-Nya dan meninggalkan larangan-Nya. Manakala mereka itu tetap tidak menaati dan patuh, ketahuilah bahwa tugas Rasulullah hanyalah sekedar menyampaikan apa yang menjadi tugas dan kewajibannya, sebagaimana ditegaskan dalam firman Allah:\n\nJika kamu berpaling, maka ketahuilah bahwa kewajiban rasul Kami hanyalah menyampaikan (amanat) dengan jelas. (al-Ma'idah\/5: 92)",
      "text_translation": "Dan taatlah kepada Allah dan taatlah kepada Rasul. Jika kamu berpaling maka sesungguhnya kewajiban Rasul Kami hanyalah menyampaikan (amanah Allah) dengan terang. ",
      "text": "وَاَطِيْعُوا اللّٰهَ وَاَطِيْعُوا الرَّسُوْلَۚ فَاِنْ تَوَلَّيْتُمْ فَاِنَّمَا عَلٰى رَسُوْلِنَا الْبَلٰغُ الْمُبِيْنُ ",
      "text_translation_en": "Pay heed, then, unto God, and pay heed unto the Apostle; and if you turn away, [know that] Our Apostle's only duty is a clear delivery of this message:",
      "juz_number": 28
    },
    "13": {
      "text_tafsir_en": "God explains that He is the One God, there is no God but Him. Then let us all despair of Him, serve Him sincerely, and not associate with Him in anything, as His Word says: (He is) the Lord of the east and the west, and there is no god but Him; protector. (al-Muzzammil \/ 73: 9) And it is explained in another verse: And worship Allah, and do not associate with him in anything. (an-Nisa '\/ 4: 36) Because Allah is the Creator and the Provider. It is to Allah that believers should trust. The Word of God: And trust in Allah only if you are believers. (al-Ma'idah \/ 5: 23)",
      "text_tafsir": "Allah menjelaskan bahwa Dialah Tuhan Yang Maha Esa, tidak ada Tuhan selain Dia. Maka hendaklah kita semua mengesakan-Nya, berbakti kepada-Nya dengan ikhlas, dan tidak menyekutukan-Nya dengan sesuatu apa pun, sebagaimana dijelaskan dalam firman-Nya:\n\n(Dialah) Tuhan timur dan barat, tidak ada tuhan selain Dia, maka jadikanlah Dia sebagai pelindung. (al-Muzzammil\/73: 9)\n\nDan dijelaskan pula dalam ayat lain:\n\nDan sembahlah Allah dan janganlah kamu mempersekutukan-Nya dengan sesuatu apa pun. (an-Nisa'\/4: 36)\n\nKarena Allah adalah Maha Pencipta dan Maha Pemberi rezeki. Kepada Allah-lah orang-orang mukmin itu hendaknya bertawakal. Firman Allah:\n\nDan bertawakallah kamu hanya kepada Allah, jika kamu orang-orang beriman. (al-Ma'idah\/5: 23)",
      "text_translation": "(Dialah) Allah, tidak ada tuhan selain Dia. Dan hendaklah orang-orang mukmin bertawakal kepada Allah.",
      "text": "اَللّٰهُ لَآ اِلٰهَ اِلَّا هُوَۗ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ ",
      "text_translation_en": "God - there is no deity save Him! In God then let the believers place their trust.",
      "juz_number": 28
    },
    "14": {
      "text_tafsir_en": "God explains that there are wives and children who are enemies to their husbands and parents who prevent them from doing good and drawing closer to God, preventing them from practicing virtues that are useful to their afterlife. Sometimes they even indulge in evil deeds, illegal activities prohibited by religion. Because of their love and affection for their wives and children, for both to live a happy and happy life, a husband or father is reluctant to do what is forbidden in religion, such as corruption and others. Therefore, he should be careful, and be patient with his wife's daughter. They need guidance, not too much pressure, they should be forgiven and not scolded, but they are forgiven. God Himself is Oft-Forgiving, Most Merciful, as His Word says: But if you have patience, it is better for you. Allah is Oft-Forgiving, Most Merciful. (Nisa '\/ 4: 25)",
      "text_tafsir": "Allah menjelaskan bahwa ada di antara istri-istri dan anak-anak yang menjadi musuh bagi suami dan orang tuanya yang mencegah mereka berbuat baik dan mendekatkan diri kepada Allah, menghalangi mereka beramal saleh yang berguna bagi akhirat mereka. Bahkan adakalanya menjerumuskan mereka kepada perbuatan maksiat, perbuatan haram yang dilarang oleh agama.\n\nKarena rasa cinta dan sayang kepada istri dan anaknya, agar keduanya hidup mewah dan senang, seorang suami atau ayah tidak segan berbuat yang dilarang agama, seperti korupsi dan lainnya. Oleh karena itu, ia harus berhati-hati, dan sabar menghadapi anak istrinya. Mereka perlu dibimbing, tidak terlalu ditekan, sebaiknya dimaafkan dan tidak dimarahi, tetapi diampuni. Allah sendiri pun Maha Pengampun, lagi Maha Penyayang, sebagaimana dijelaskan dalam firman-Nya:\n\nTetapi jika kamu bersabar, itu lebih baik bagimu. Allah Maha Pengampun, Maha Penyayang. (an-Nisa'\/4: 25)",
      "text_translation": "Wahai orang-orang yang beriman! Sesungguhnya di antara istri-istrimu dan anak-anakmu ada yang menjadi musuh bagimu, maka berhati-hatilah kamu terhadap mereka; dan jika kamu maafkan dan kamu santuni serta ampuni (mereka), maka sungguh, Allah Maha Pengampun, Maha Penyayang.",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنَّ مِنْ اَزْوَاجِكُمْ وَاَوْلَادِكُمْ عَدُوًّا لَّكُمْ فَاحْذَرُوْهُمْۚ وَاِنْ تَعْفُوْا وَتَصْفَحُوْا وَتَغْفِرُوْا فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ ",
      "text_translation_en": "O YOU who have attained to faith! Behold, some of your spouses and your children are enemies unto you: so beware of them! But if you pardon [their faults] and forbear, and forgive-then, behold, God will be much-forgiving, a dispenser of grace.",
      "juz_number": 28
    },
    "15": {
      "text_tafsir_en": "God explains that love for property and children is a test. If you're not careful, it can be catastrophic. Few people, because of their excessive love for property and their children, dared to do unreasonable things and violate religious rules. In this verse, the treasure comes first from the child because the test and the catastrophe are greater, as God says: Never! Indeed, the man really goes beyond the limits, when he sees himself as self-sufficient. (al-'Alaq \/ 96: 6-7) It is also explained in the words of the Prophet. Verily, for every people there is a trial and indeed a trial for my (heavy) people is a treasure, (History of Ahmad, at-Tirmidhi, ath-thabrani, and al-judge, from Ka'ab bin 'Iyadh) will not overstate his love for property and his son, if his love for God is greater than his love for others, then he will have a great and abundant reward.",
      "text_tafsir": "Allah menerangkan bahwa cinta terhadap harta dan anak adalah cobaan. Jika tidak berhati-hati, akan mendatangkan bencana. Tidak sedikit orang, karena cintanya yang berlebihan kepada harta dan anaknya, berani berbuat yang bukan-bukan dan melanggar ketentuan agama. Dalam ayat ini, harta didahulukan dari anak karena ujian dan bencana harta itu lebih besar, sebagaimana firman Allah:\n\nSekali-kali tidak! Sungguh, manusia itu benar-benar melampaui batas, apabila melihat dirinya serba cukup. (al-'Alaq\/96: 6-7)\n\nDijelaskan pula dalam sabda Nabi saw.\n\nSesungguhnya bagi tiap-tiap umat ada cobaan dan sesungguhnya cobaan umatku (yang berat) ialah harta, (Riwayat Ahmad, at-Tirmidhi, ath-thabrani, dan al-hakim, dari Ka'ab bin 'Iyadh)\n\nKalau manusia dapat menahan diri, tidak akan berlebihan cintanya kepada harta dan anaknya, jika cintanya kepada Allah lebih besar daripada cintanya kepada yang lain, maka ia akan mendapat pahala yang besar dan berlipat ganda.",
      "text_translation": "Sesungguhnya hartamu dan anak-anakmu hanyalah cobaan (bagimu), dan di sisi Allah pahala yang besar. ",
      "text": "اِنَّمَآ اَمْوَالُكُمْ وَاَوْلَادُكُمْ فِتْنَةٌ  ۗوَاللّٰهُ عِنْدَهٗٓ اَجْرٌ عَظِيْمٌ ",
      "text_translation_en": "Your worldly goods and your children are but a trial and a temptation, whereas with God there is a tremendous reward.",
      "juz_number": 28
    },
    "16": {
      "text_tafsir_en": "Allah commands that rich men, children, and wives trust in Him with all their might and power, as the Prophet (peace and blessings be upon him) explains: When I command you to do something, do it to the best of my ability and do not forbid it. (The History of al-Bukhari from Abu Hurairah) In the word of Allah is also explained: Be afraid of Allah and truly fear Him and do not die except in the Muslim world. (Ali 'Imran \/ 3: 102) Then Allah commanded the believers to obey and obey the commands of Allah and His Messenger. Not influenced by the surrounding environment, thus violating what is prohibited by religion. Property to be spent to alleviate the suffering of the poor, to help those in need, and to assist in various activities useful to the people and religions, which bring happiness to the world and the hereafter. That is far better than accumulating wealth and spoiling children. This 16th verse closes with an affirmation that the one who abstains from greed and greed for wealth is the lucky one. He will fulfill his desire in this world and the hereafter, and be loved by his friends. In the hereafter, he is greatly blessed for being close to his Lord, loved, loved, and included in heaven.",
      "text_tafsir": "Allah memerintahkan agar manusia yang mempunyai harta, anak, dan istri bertakwa kepada-Nya sekuat tenaga dan kemampuannya, sebagaimana dijelaskan oleh sabda Nabi saw:\n\nApabila saya perintahkan kamu dengan sesuatu maka laksanakanlah dengan maksimal dan apa yang saya larang melakukannya, maka jauhilah ia. (Riwayat al-Bukhari dari Abu Hurairah)\n\n\n\nDalam firman Allah juga dijelaskan:\n\nBertakwalah kepada Allah sebenar-benar takwa kepada-Nya dan janganlah kamu mati kecuali dalam keadaan muslim. (Ali 'Imran\/3: 102)\n\nSelanjutnya Allah memerintahkan orang-orang beriman agar mendengar dan patuh kepada perintah Allah dan rasul-Nya. Tidak terpengaruh oleh keadaan sekelilingnya, sehingga melanggar apa yang dilarang agama. Harta benda agar dibelanjakan untuk meringankan penderitaan fakir miskin, menolong orang-orang yang memerlukan pertolongan, dan untuk membantu berbagai kegiatan yang berguna bagi umat dan agama, yang membawa kebahagiaan dunia dan akhirat. Yang demikian itu jauh lebih baik daripada menumpuk harta dan memanjakan anak. \n\nAyat ke-16 ini ditutup dengan satu penegasan bahwa orang yang menjauhi kebakhilan dan ketamakan pada harta adalah orang yang beruntung. Ia akan mencapai keinginannya di dunia dan akhirat, serta disenangi oleh teman-temannya. Di akhirat nanti, ia sangat berbahagia karena dekat dengan Tuhannya, disenangi, diridai, dan dimasukkan ke dalam surga.",
      "text_translation": "Maka bertakwalah kamu kepada Allah menurut kesanggupanmu dan dengarlah serta taatlah; dan infakkanlah harta yang baik untuk dirimu. Dan barang-siapa dijaga dirinya dari kekikiran, mereka itulah orang-orang yang beruntung. ",
      "text": "فَاتَّقُوا اللّٰهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوْا وَاَطِيْعُوْا وَاَنْفِقُوْا خَيْرًا لِّاَنْفُسِكُمْۗ وَمَنْ يُّوْقَ شُحَّ نَفْسِهٖ فَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ ",
      "text_translation_en": "Remain, then, conscious of God as best you can, and listen [to Him], and pay heed. And spend in charity for the good of your own selves: for, such as from their own covetousness are saved – it is they, they that shall attain to a happy state!",
      "juz_number": 28
    },
    "17": {
      "text_tafsir_en": "God explains that those who lend to him with a good loan while in the world by spending his wealth in the way he directs, approach him with all sincerity and heart, will multiply his reward. One good will be rewarded with ten to seven hundred rewards. It will be multiplied even more, in accordance with the sincerity of the heart, as explained in the Word of God: Whoever lends to God for a good loan then Allah multiply to him much. (al-Baqarah \/ 2: 245) In addition, his sins will be forgiven by God. He is the Rewarder, multiplying the reward for those who obey him, the Most Merciful. God does not hasten to punish the sinner, though his sins and wrongdoings are confounded.",
      "text_tafsir": "Allah menerangkan bahwa orang yang meminjamkan kepada-Nya dengan pinjaman yang baik sewaktu di dunia yakni membelanjakan harta-bendanya di jalan yang diridai-Nya, mendekatkan diri kepada-Nya dengan ikhlas dan hati yang lega, akan dilipatgandakan pahalanya. Satu kebaikan akan dibalas dengan sepuluh sampai tujuh ratus pahala. Bahkan akan dilipatgandakan lebih dari itu, sesuai dengan keikhlasannya yang mantap di dalam hati, sebagaimana dijelaskan dalam firman Allah:\n\nBarang siapa meminjami Allah dengan pinjaman yang baik maka Allah melipatgandakan ganti kepadanya dengan banyak. (al-Baqarah\/2: 245)\n\nSelain daripada itu, dosanya pun akan diampuni Allah. Dia Maha Pembalas jasa, melipatgandakan pahala bagi orang yang taat kepada-Nya, lagi Maha Penyantun. Allah tidak menyegerakan azab kepada orang yang berdosa, meskipun dosa dan kesalahannya bertumpuk.",
      "text_translation": "Jika kamu meminjamkan kepada Allah dengan pinjaman yang baik, niscaya Dia melipatgandakan (balasan) untukmu dan mengampuni kamu. Dan Allah Maha Mensyukuri, Maha Penyantun.",
      "text": "اِنْ تُقْرِضُوا اللّٰهَ قَرْضًا حَسَنًا يُّضٰعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْۗ وَاللّٰهُ شَكُوْرٌ حَلِيْمٌۙ ",
      "text_translation_en": "If you offer up to God a goodly loan, He will amply repay you for it, and will forgive you your sins: for God is ever responsive to gratitude, forbearing,",
      "juz_number": 28
    },
    "18": {
      "text_tafsir_en": "This verse explains that Allah is Knower of the supernatural and the visible. Whatever man does, everything is recorded and kept by his side. No one is spared the size of a mustard seed, as God explained in his Word: What is this book, none is left, small and great, except it is written all over it? \"(Al-Kahf \/ 18: 49) For the deeds of God must be fully repaid, and the good will be repaid in heaven, and the wicked will be punished in hell. He is the Almighty and the Almighty, and all His desires are fulfilled, the Almighty directs His creation, giving what is good to whom He pleases.",
      "text_tafsir": "Ayat ini menjelaskan bahwa Allah Maha Mengetahui yang gaib apalagi yang tampak. Apa saja yang dikerjakan oleh manusia, semuanya tercatat dan tersimpan di sisi-Nya. Tidak satu pun yang luput sekalipun sebesar biji sawi, sebagaimana dijelaskan oleh Allah dengan firman-Nya:\n\nKitab apakah ini, tidak ada yang tertinggal, yang kecil dan yang besar melainkan tercatat semuanya,\" (al-Kahf\/18: 49)\n\nAyat di atas mendorong manusia untuk berinfak, karena segala perbuatan pasti terlihat oleh Allah dan dibalas dengan berlipat ganda.\n\nAmal yang tercatat dalam kitab seseorang akan dibalas oleh Allah dengan sangat teliti. Yang baik dibalas dengan baik yaitu surga, dan yang jahat dibalas dengan siksa di dalam neraka. Dia itu Mahaperkasa dan Mahakuasa. Semua kehendak-Nya terwujud menjadi kenyataan, Mahabijaksana mengatur ciptaan-Nya, memberikan apa yang baik kepada siapa yang dikehendaki-Nya.",
      "text_translation": "Yang Mengetahui yang gaib dan yang nyata. Yang Mahaperkasa, Mahabijaksana.",
      "text": "عٰلِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيْزُ الْحَكِيْمُ ࣖ ",
      "text_translation_en": "knowing all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind - the Almighty, the Wise!",
      "juz_number": 28
    }
  },
  "name": "التغابن",
  "name_translation_en": "Mutual Disillusion",
  "name_translation": "Pengungkapan Kesalahan",
  "name_latin": "At-Tagabun"
}