{
  "number": 66,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 12,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, Allah admonished the Prophet (peace be upon him) for swearing that he would not drink any more honey, but honey was a lawful drink. The reason is simply because he wants his wife's comfort. This verse closes with an affirmation that Allah is Oft-forgiving of the sins of His repentant servant, and He forgave the error of the Prophet (peace be upon him) who swore to drink no honey.",
      "text_tafsir": "Pada ayat ini, Allah menegur Nabi saw karena bersumpah tidak akan meminum madu lagi, padahal madu itu adalah minuman yang halal. Sebabnya hanyalah karena menghendaki kesenangan hati istri-istrinya.\n\nAyat ini ditutup dengan satu ketegasan bahwa Allah Maha Pengampun atas dosa hamba-Nya yang bertobat, dan Dia telah mengampuni kesalahan Nabi saw yang telah bersumpah tidak mau lagi minum madu.",
      "text_translation": "Wahai Nabi! Mengapa engkau mengharamkan apa yang dihalalkan Allah bagimu? Engkau ingin menyenangkan hati istri-istrimu? Dan Allah Maha Pengampun, Maha Penyayang. ",
      "text": "يٰٓاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَآ اَحَلَّ اللّٰهُ لَكَۚ تَبْتَغِيْ مَرْضَاتَ اَزْوَاجِكَۗ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ ",
      "text_translation_en": "O PROPHET! Why dost thou, out of a desire to please [one or another of] thy wives, impose [on thyself] a prohibition of something that God has made lawful to thee? But God is much-forgiving, a dispenser of grace:",
      "juz_number": 28
    },
    "2": {
      "text_tafsir_en": "In this verse, God explains that He has made a provision that it is obligatory for a person to free himself from an oath he has spoken by paying the penalty as explained in God's word: Then his law (the penalty for breaking the oath) is to feed ten poor, that is, of food. that you usually give to your family, or give them clothes or set free a maid servant. Whoever is not able to do it, then (the disbelievers) will enjoy three days. That is the fulfillment of your oaths when you swear. (al-Ma'idah \/ 5: 89) An oath that must be violated is if it is legal to do something that is illegal, or rather it is prohibiting something lawful. To abolish the oath of abstinence from honey, the Prophet (saw) fulfilled the above Allah, paying the penalty for liberating a slave, as stated in a hadith: From Ibn 'Abbas, he said, \"I asked' Umar bin al-Khaththab He said, 'A'ishah and Hafsah. She begins the story of Umm Ibrahim (Mariyah) al-Qibthiyyah whom the Prophet saw in his Hafsah on the day of his return, and Hafsah found out. Prophet of Allah, you have treated me with treatment you did not do to other wives in my day, in my house, and on my bed. \"He said, 'How would you like it if I banned it from wearing it again? 'Well, forbid him!' And the Prophet said, 'Don't tell anyone this.' But Hafsah told 'A'ishah. I saw it, and then he uttered the verse: \"ya ayyuhan-nabiyyu your five minds\" and so on. We have heard that the Prophet (peace and blessings be upon him) paid the fulfillment of his oath and restored Maryam al-Qibtiyyah. \"(The History of Ibn Jarir and Ibn Mundhir). be it slaves, drinks, etc. Whatever the case may be, it is clear that the Prophet forbade anything that was allowed by Allah, so Allah rebuked him and asked the Prophet to abolish his oath and pay the penalty. , defeating his enemies, making it possible for him to find favorable ways in the world and in the hereafter, providing guidance and guidance for the happiness of the world and the hereafter. He is All-Knowing in what he does. the purpose is human error.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa Dia telah menetapkan satu ketentuan yaitu wajib bagi seseorang membebaskan dirinya dari sumpah yang pernah diucapkannya dengan membayar kafarat sebagaimana yang dijelaskan dalam firman Allah:\n\nMaka kafaratnya (denda pelanggaran sumpah) ialah memberi makan sepuluh orang miskin, yaitu dari makanan yang biasa kamu berikan kepada keluargamu, atau memberi mereka pakaian atau memerdekakan seorang hamba sahaya. Barangsiapa tidak mampu melakukannya, maka (kafaratnya) berpuasalah tiga hari. Itulah kafarat sumpah-sumpahmu apabila kamu bersumpah. (al-Ma'idah\/5: 89)\n\nSumpah yang wajib dilanggar ialah jika bersifat menghalalkan sesuatu yang hukumnya haram, atau sebaliknya sumpah itu mengharamkan sesuatu yang halal. Untuk membatalkan sumpah tidak minum madu, Nabi saw telah memenuhi ketentuan Allah tersebut di atas, dengan membayar kafarat yaitu memerdekakan seorang budak, sebagaimana yang diinformasikan dalam sebuah hadis: \n\nDari Ibnu 'Abbas, ia berkata, \"Saya bertanya kepada 'Umar bin al-Khaththab tentang siapa kedua perempuan itu? Ia berkata, 'Aisyah dan Hafsah. Dia mengawali cerita tentang Ummu Ibrahim (Mariyah) al-Qibthiyyah yang digauli Nabi saw di rumah Hafsah pada hari (giliran)nya, lalu Hafsah mengetahuinya. Hafsah lalu berkata, 'Wahai Nabi Allah, engkau telah memperlakukan saya dengan perlakuan yang tidak engkau lakukan kepada istri-istrimu yang lain pada hari saya, rumah saya, dan di atas tempat tidur saya. Nabi berkata, 'Senangkah engkau bila saya mengharamkannya dengan tidak menggaulinya lagi? Ia menjawab, 'Baik, haramkan dia! Nabi lalu berkata, 'Janganlah engkau katakan hal ini kepada siapa pun. Tetapi Hafsah mengatakannya kepada 'Aisyah. Kemudian Allah memberitahukan hal itu kepada Nabi saw, lalu menurunkan ayat: \"ya ayyuhan-nabiyyu lima tuharrimu¦\" dan seterusnya. Kami mendapat berita bahwa Nabi saw membayar kafarat sumpahnya dan menggauli Maryam al-Qibtiyyah kembali.\" (Riwayat Ibnu Jarir dan Ibnu Mundhir)\n\nKesimpulan dari apa yang terkandung dalam ayat ini adalah bahwa yang diharamkan Nabi saw untuk dirinya adalah sesuatu yang telah dihalalkan Allah, bisa berupa budak, minuman, atau yang lainnya. Apa pun kasusnya, yang jelas Nabi mengharamkan sesuatu yang dihalalkan Allah. Oleh karena itulah, Allah menegur dan meminta Nabi untuk membatalkan sumpahnya dan membayar kafarat.\n\nDi bagian akhir ayat ini dijelaskan bahwa Allah adalah pelindung orang beriman, mengalahkan musuh-musuhnya, memudahkannya menempuh jalan yang menguntungkan di dunia dan di akhirat, memberikan hidayat dan bimbingan untuk mencapai kebahagiaan dunia dan akhirat. Dia Maha Mengetahui apa yang mendatangkan maslahat. Allah Mahabijaksana dalam mengatur segala sesuatunya, tidak akan melarang dan memerintahkan sesuatu kecuali tujuannya ialah maslahat manusia.",
      "text_translation": "Sungguh, Allah telah mewajibkan kepadamu membebaskan diri dari sumpahmu; dan Allah adalah pelindungmu dan Dia Maha Mengetahui, Mahabijaksana. ",
      "text": "قَدْ فَرَضَ اللّٰهُ لَكُمْ تَحِلَّةَ اَيْمَانِكُمْۚ وَاللّٰهُ مَوْلٰىكُمْۚ وَهُوَ الْعَلِيْمُ الْحَكِيْمُ ",
      "text_translation_en": "God has already enjoined upon you [O believers] the breaking and expiation of [such of] your oaths [as may run counter to what is right and just]: for, God is your Lord Supreme, and He alone is all-knowing, truly wise.",
      "juz_number": 28
    },
    "3": {
      "text_tafsir_en": "In this verse, Allah reminds us of an incident that occurred to the Prophet (saw) when he asked Hafsah (one of his wives) to keep it secret and did not tell anyone that he had drunk honey in Zainab bint Jahsy's house, and swore he would not repeat it that again. After Hafsah reported the matter to 'A'isha, Allah told the Prophet the conversation between the two. The Prophet (peace be upon him) later told Hafsah of his deeds which had spread his secret. At that Hafsah was surprised and asked, \"Who told you this?\" He thought that 'He is the One who informed, the Prophet (saws) replied that the One who informed is Allah, the All-knowing God of all secrets and whispers, the All-Knowing of what is on earth and what is in heaven, there is nothing hidden for Him. God's Word: For Allah there is nothing hidden on earth and in heaven. (Ali 'Imran \/ 3: 5)",
      "text_tafsir": "Dalam ayat ini, Allah mengingatkan suatu peristiwa yang terjadi pada diri Nabi saw yaitu ketika beliau meminta kepada Hafsah (salah seorang istrinya) untuk merahasiakan dan tidak memberitahukan kepada siapa pun bahwa beliau pernah meminum madu di rumah Zainab binti Jahsy, lalu bersumpah tidak akan mengulangi hal itu lagi. Setelah Hafsah menceritakan hal itu kepada 'Aisyah, Allah lalu memberitahukan kepada Nabi percakapan antara keduanya itu. Nabi saw kemudian memberitahu Hafsah tentang perbuatannya yang telah menyiarkan rahasia beliau. Ketika itu Hafsah menjadi heran dan bertanya, \"Siapakah yang telah memberitahukan hal ini kepadamu?\" Ia menyangka bahwa 'Aisyahlah yang memberitahukan, Nabi saw menjawab bahwa yang memberitahukan ialah Allah, Tuhan Yang Maha Mengetahui segala rahasia dan bisikan, Maha Mengenal apa yang ada di bumi dan apa yang ada di langit, tiada sesuatu yang tersembunyi bagi-Nya. Firman Allah:\n\nBagi Allah tidak ada sesuatu pun yang tersembunyi di bumi dan di langit. (Ali 'Imran\/3: 5)",
      "text_translation": "Dan ingatlah ketika secara rahasia Nabi membicarakan suatu peristiwa kepada salah seorang istrinya (Hafsah). Lalu dia menceritakan peristiwa itu (kepada Aisyah) dan Allah memberitahukan peristiwa itu kepadanya (Nabi), lalu (Nabi) memberitahukan (kepada Hafsah) sebagian dan menyembunyikan sebagian yang lain. Maka ketika dia (Nabi) memberitahukan pembicaraan itu kepadanya (Hafsah), dia bertanya, “Siapa yang telah memberitahukan hal ini kepadamu?” Nabi menjawab, “Yang memberitahukan kepadaku adalah Allah Yang Maha Mengetahui, Mahateliti.” ",
      "text": "وَاِذْ اَسَرَّ النَّبِيُّ اِلٰى بَعْضِ اَزْوَاجِهٖ حَدِيْثًاۚ فَلَمَّا نَبَّاَتْ بِهٖ وَاَظْهَرَهُ اللّٰهُ عَلَيْهِ عَرَّفَ بَعْضَهٗ وَاَعْرَضَ عَنْۢ بَعْضٍۚ فَلَمَّا نَبَّاَهَا بِهٖ قَالَتْ مَنْ اَنْۢبَاَكَ هٰذَاۗ قَالَ نَبَّاَنِيَ الْعَلِيْمُ الْخَبِيْرُ ",
      "text_translation_en": "And lo! [It so happened that] the Prophet told something in confidence to one of his wives; and when she thereupon divulged it, and God made this known to him, he acquainted [others] with some of it and passed over some of it. And as soon as he let her know it, she asked, \"Who has told thee this?\" - [to which] he replied, \"The All-Knowing, the All-Aware has told me.\"",
      "juz_number": 28
    },
    "4": {
      "text_tafsir_en": "In this verse, Allah explains that if Hafsah and 'A'isha would repent, and say that she had violated the will of the Prophet, they both loved what she loved, and hated what she hated, then both were inclined to receive good. In another story, Ibn 'Abbas said, \"I always asked Umar about the two wives of the Prophet (peace and blessings be upon him) with the words of Allah,\" If you two repent to Allah, \"until' Umar performed the Hajj and I performed the Hajj with him When 'Umar was on his way to prostrate, I turned his hand and asked,' O Messenger of Allah! Which of the two wives of the Prophet to whom Allah said, 'If you two repent to Allah?' 'Umar replied,' O Ibn. Abbas! The two wives of the Prophet (peace be upon him) referred to as 'Aisha and Hafsah. If both (' Aisha and Hafsah) agreed to do what had hurt the Prophet's heart by spreading his secrets, it would not have bothered the Prophet, as well as helping him in matters of religion and all that he faced.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa jika Hafsah dan 'Aisyah mau bertobat, dan mengatakan bahwa dirinya telah menyalahi kehendak Nabi saw, keduanya cinta kepada apa yang beliau cintai, dan membenci apa yang beliau benci, berarti keduanya telah cenderung untuk menerima kebaikan.\n\nDalam riwayat lain, Ibnu 'Abbas berkata, \"Saya senantiasa ingin menanyakan kepada Umar tentang dua istri Nabi saw yang dimaksudkan firman Allah, \"Jika kamu berdua bertobat kepada Allah¦,\" sampai 'Umar menunaikan ibadah haji dan saya pun menunaikan ibadah haji bersama dia. Ketika 'Umar dalam perjalanannya mampir untuk berwudu, saya guyur kedua tangannya dan bertanya, 'Wahai Amirul Mukminin! Siapakah kedua istri Nabi yang dituju oleh firman Allah, \"Jika kamu berdua bertobat kepada Allah ¦.\" 'Umar lalu menjawab, 'Wahai Ibnu 'Abbas! Kedua istri Nabi saw yang dimaksud itu ialah 'Aisyah dan Hafsah. Kalau keduanya ('Aisyah dan Hafsah) tetap sepakat berbuat apa yang menyakiti hati Nabi saw dengan menyiarkan rahasianya, hal itu tidak akan menyusahkan Nabi, karena Allah-lah pelindungnya, serta membantunya di dalam urusan agama dan semua hal yang dihadapinya. Begitu pula Jibril, orang-orang mukmin yang saleh, dan para malaikat, semuanya turut menolong dan membantunya.",
      "text_translation": "Jika kamu berdua bertobat kepada Allah, maka sungguh, hati kamu berdua telah condong (untuk menerima kebenaran); dan jika kamu berdua saling bantu-membantu menyusahkan Nabi, maka sungguh, Allah menjadi pelindungnya dan (juga) Jibril dan orang-orang mukmin yang baik; dan selain itu malaikat-malaikat adalah penolongnya. ",
      "text": "اِنْ تَتُوْبَآ اِلَى اللّٰهِ فَقَدْ صَغَتْ قُلُوْبُكُمَاۚ وَاِنْ تَظٰهَرَا عَلَيْهِ فَاِنَّ اللّٰهَ هُوَ مَوْلٰىهُ وَجِبْرِيْلُ وَصَالِحُ الْمُؤْمِنِيْنَۚ وَالْمَلٰۤىِٕكَةُ بَعْدَ ذٰلِكَ ظَهِيْرٌ ",
      "text_translation_en": "[Say, O Prophet:] \"Would that you two turn unto God in repentance, for the hearts of both of you have swerved [from what is right]! And if you uphold each other against him [who is God's message-bearer, know that] God Himself is his Protector, and [that,] therefore, Gabriel, and all the righteous among the believers and all the [other] angels will come to his aid.\"",
      "juz_number": 28
    },
    "5": {
      "text_tafsir_en": "Anas from 'Umar, narrated that he said, \"It is up to me that some of the wives of the Prophet acted harshly on the Prophet and hurt his heart. So I investigated it. I advised him one by one and forbade him to hurt the Prophet's heart, \"If you are still not obedient then Allah may give the Prophet new wives better than you. And after I met Zainab, he said, 'O Ibn Khaththab! Is there no attempt by the Prophet to advise his wives? So advise them that they are not divorced, and this verse goes down. \" This verse contains warnings from Allah against wives who hurt the Prophet's heart. If the Prophet divorces them, it may be that God replaces them with new wives better than them, whether they are believers or believers, those who are devout wives, repent to God, obey the commandments of the Apostles.",
      "text_tafsir": "Diriwayatkan oleh Anas dari 'Umar bahwa ia berkata, \"Telah sampai kepadaku bahwa sebagian istri-istri Nabi bersikap keras kepada Nabi dan menyakiti hati beliau. Maka saya selidiki hal itu. Saya menasihatinya satu-persatu dan melarangnya menyakiti hati Nabi saw, saya berkata, 'Jika kalian tetap tidak mau taat maka boleh jadi Allah memberikan kepada Nabi, istri-istri baru yang lebih baik dari kalian. Dan setelah saya menemui Zainab, ia berkata, 'Wahai Ibnu Khaththab! Apakah tidak ada usaha Rasulullah untuk menasihati istri-istrinya? Maka nasihatilah mereka sampai mereka itu tidak diceraikan, maka turunlah ayat ini.\"\n\nAyat ini berisi peringatan dari Allah terhadap istri-istri yang menyakiti hati Nabi saw. Jika Nabi menceraikan mereka, boleh jadi Allah menggantinya dengan istri-istri baru yang lebih baik dari mereka, baik keislaman maupun keimanannya, yaitu istri-istri yang tekun beribadah, bertobat kepada Allah, patuh kepada perintah-perintah Rasul.",
      "text_translation": "Jika dia (Nabi) menceraikan kamu, boleh jadi Tuhan akan memberi ganti kepadanya dengan istri-istri yang lebih baik dari kamu, perempuan-perempuan yang patuh, yang beriman, yang taat, yang bertobat, yang beribadah, yang berpuasa, yang janda dan yang perawan. ",
      "text": "عَسٰى رَبُّهٗٓ اِنْ طَلَّقَكُنَّ اَنْ يُّبْدِلَهٗٓ اَزْوَاجًا خَيْرًا مِّنْكُنَّ مُسْلِمٰتٍ مُّؤْمِنٰتٍ قٰنِتٰتٍ تٰۤىِٕبٰتٍ عٰبِدٰتٍ سٰۤىِٕحٰتٍ ثَيِّبٰتٍ وَّاَبْكَارًا ",
      "text_translation_en": "[O wives of the Prophet!] Were he to divorce [any of] you, God might well give him in your stead spouses better than you - women who surrender themselves unto God, who truly believe, devoutly obey His will, turn [unto Him] in repentance [whenever they have sinned] worship [Him alone] and go on and on [seeking His goodly acceptance] - be they women previously married or virgins.",
      "juz_number": 28
    },
    "6": {
      "text_tafsir_en": "In this verse, God instructs believers to protect themselves from the fire of fire, which is made up of people and rocks, obeying and obeying God's commands. They were also instructed to teach their families to obey and obey God's commandments to save them from the fire of hell. The family is a mandate for the well-being of both physical and spiritual well-being. Among the ways to escape from the fire of hell is to pray and be patient, as God says: And command your family to pray and be patient in doing so. (thaha \/ 20: 132) And warn thy near kinsmen (Muhammad). (asy-Syu'ara '\/ 26: 214) It is reported that when this 6th verse came down,' Umar said, \"O Messenger of Allah, we have taken care of ourselves, and how do we look after our family?\" The Messenger of Allah (may peace be upon him) said: \"Do not forbid them to do what you are forbidden to do, and may they do what Allah has commanded you. That is how they were saved from the fiery and fierce angels of their nineteen leaders. They are tormentors in hell, they are angels who do not obey God for what He commands and do what He commands.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan orang-orang yang beriman agar menjaga dirinya dari api neraka yang bahan bakarnya terdiri dari manusia dan batu, dengan taat dan patuh melaksanakan perintah Allah. Mereka juga diperintahkan untuk mengajarkan kepada keluarganya agar taat dan patuh kepada perintah Allah untuk menyelamatkan mereka dari api neraka. Keluarga merupakan amanat yang harus dipelihara kesejahteraannya baik jasmani maupun rohani.\n\nDi antara cara menyelamatkan diri dari api neraka itu ialah mendirikan salat dan bersabar, sebagaimana firman Allah:\n\nDan perintahkanlah keluargamu melaksanakan salat dan sabar dalam mengerjakannya. (thaha\/20: 132)\n\nDan berilah peringatan kepada kerabat-kerabatmu (Muhammad) yang terdekat. (asy-Syu'ara'\/26: 214)\n\nDiriwayatkan bahwa ketika ayat ke-6 ini turun, 'Umar berkata, \"Wahai Rasulullah, kami sudah menjaga diri kami, dan bagaimana menjaga keluarga kami?\" Rasulullah saw menjawab, \"Larang mereka mengerjakan apa yang kamu dilarang mengerjakannya dan perintahkan mereka melakukan apa yang diperintahkan Allah kepadamu. Begitulah caranya menyelamatkan mereka dari api neraka. Neraka itu dijaga oleh malaikat yang kasar dan keras yang pemimpinnya berjumlah sembilan belas malaikat. Mereka diberi kewenangan mengadakan penyiksaan di dalam neraka. Mereka adalah para malaikat yang tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya dan selalu mengerjakan apa yang diperintahkan-Nya.",
      "text_translation": "Wahai orang-orang yang beriman! Peliharalah dirimu dan keluargamu dari api neraka yang bahan bakarnya adalah manusia dan batu; penjaganya malaikat-malaikat yang kasar, dan keras, yang tidak durhaka kepada Allah terhadap apa yang Dia perintahkan kepada mereka dan selalu mengerjakan apa yang diperintahkan. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا قُوْٓا اَنْفُسَكُمْ وَاَهْلِيْكُمْ نَارًا وَّقُوْدُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلٰۤىِٕكَةٌ غِلَاظٌ شِدَادٌ لَّا يَعْصُوْنَ اللّٰهَ مَآ اَمَرَهُمْ وَيَفْعَلُوْنَ مَا يُؤْمَرُوْنَ ",
      "text_translation_en": "O YOU who have attained to faith! Ward off from yourselves and those who are close to you that fire [of the hereafter] whose fuel is human beings and stones: [lording] over it are angelic powers awesome [and] severe, who do not disobey God in whatever He has commanded them, but [always] do what they are bidden to do.",
      "juz_number": 28
    },
    "7": {
      "text_tafsir_en": "In this verse, Allah expresses a certainty directed at the unbelievers that in the future, they will have no reason to reason, and will desire a will and hope. The time and opportunity to present the reason and hope are over. The Day of Judgment is only a day for taking responsibility and receiving vengeance for what has been done in the world, as Allah says: Thus do We punish them for their rebellion. And indeed, We are Righteous. (al-An'am \/ 6: 146) In another verse it is explained: Thus We rewarded them for their unbelief. And We do not bring down the punishment, but only those who disbelieve. (Saba '\/ 34: 17)",
      "text_tafsir": "Pada ayat ini, Allah mengeluarkan satu ketegasan yang ditujukan kepada orang-orang kafir bahwa di hari kemudian nanti, tidak ada lagi gunanya mereka itu mengemukakan alasan, serta menginginkan satu kehendak dan harapan. Waktu dan kesempatan untuk mengemukakan alasan dan harapan sudah lewat. Hari Kiamat hanyalah hari untuk mempertanggungjawabkan dan menerima pembalasan dari apa yang telah dikerjakan di dunia, sebagaimana firman Allah:\n\nDemikianlah Kami menghukum mereka karena kedurhakaannya. Dan sungguh, Kami Mahabenar. (al-An'am\/6: 146)\n\nDijelaskan pula dalam ayat lain:\n\nDemikianlah Kami memberi balasan kepada mereka karena kekafiran mereka. Dan Kami tidak menjatuhkan azab (yang demikian itu), melainkan hanya kepada orang-orang yang sangat kafir. (Saba'\/34: 17)",
      "text_translation": "Wahai orang-orang kafir! Janganlah kamu mengemukakan alasan pada hari ini. Sesungguhnya kamu hanya diberi balasan menurut apa yang telah kamu kerjakan. ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ كَفَرُوْا لَا تَعْتَذِرُوا الْيَوْمَۗ اِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُوْنَ ࣖ",
      "text_translation_en": "[Hence,] O you who are bent on denying the truth, make no [empty] excuses today: [in the life to come] you shall be but recompensed for what you were doing [in this world].",
      "juz_number": 28
    },
    "8": {
      "text_tafsir_en": "The call to this verse is for those who believe in God and His apostles. They were commanded to repent to Allah from their sins with true repentance (repentance of repentance), that is, the threefold repentance. First, stop doing evil. Second, regretting his actions, and third, resolving not to repeat the act. When those conditions are met, God removes all the past wrongs and evils and puts them in a river that flows beneath the rivers. At that time, Allah did not disappoint and despise the Prophet and those who believed in it. Even on that day, their happiness was reflected, their light illuminated them as they walked toward Mahsyar where they were accounted for and accountable. They ask Allah for their light to be refined, to emit light and not to be extinguished until they pass the sirathal Mustaqim, where the hypocrites, both men and women, pray earnestly to wait to take advantage of their light. They also ask that their sins be blotted out and forgiven. Thus, they do not feel ashamed and frustrated at the time of hisabab and responsibility. There is no need to be asked to perfect the light and to forgive sins except God, for He is the Almighty over all things, doing according to His statutes and ordinances.",
      "text_tafsir": "Seruan pada ayat ini ditujukan kepada orang-orang yang percaya kepada Allah dan para rasul-Nya. Mereka diperintahkan bertobat kepada Allah dari dosa-dosa mereka dengan tobat yang sebenar-benarnya (tobat nasuha), yaitu tobat yang memenuhi tiga syarat. Pertama, berhenti dari maksiat yang dilakukannya. Kedua, menyesali perbuatannya, dan ketiga, berketetapan hati tidak akan mengulangi perberbuatan maksiat tersebut. \n\nBila syarat-syarat itu terpenuhi, Allah menghapuskan semua kesalahan dan kejahatan yang telah lalu dan memasukkan mereka ke dalam surga yang mengalir di bawahnya sungai-sungai. Pada saat itu, Allah tidak mengecewakan dan menghinakan Nabi saw dan orang-orang yang beriman bersamanya. Bahkan pada hari itu, kebahagiaan mereka ditonjolkan, cahaya mereka memancar menerangi mereka waktu berjalan menuju Mahsyar tempat diadakan perhitungan dan pertanggungjawaban. Mereka itu meminta kepada Allah agar cahaya mereka disempurnakan, tetap memancar dan tidak akan padam sampai mereka itu melewati sirathal Mustaqim, tempat orang-orang munafik baik laki-laki maupun perempuan memohon dengan sangat agar dapat ditunggu untuk dapat ikut memanfaatkan cahaya mereka. \n\nMereka juga memohon agar dosa-dosa mereka dihapus dan diampuni. Dengan demikian, mereka tidak merasa malu dan kecewa pada waktu diadakan hisab dan pertanggungjawaban. Tidak ada yang patut dimintai untuk menyempurnakan cahaya dan mengampuni dosa kecuali Allah, karena Dialah Yang Mahakuasa atas segala sesuatu, berbuat sesuai dengan kodrat dan iradat-Nya.",
      "text_translation": "Wahai orang-orang yang beriman! Bertobatlah kepada Allah dengan tobat yang semurni-murninya, mudah-mudahan Tuhan kamu akan menghapus kesalahan-kesalahanmu dan memasukkan kamu ke dalam surga yang mengalir di bawahnya sungai-sungai, pada hari ketika Allah tidak mengecewakan Nabi dan orang-orang yang beriman bersama dengannya; sedang cahaya mereka memancar di hadapan dan di sebelah kanan mereka, sambil mereka berkata, “Ya Tuhan kami, sempurnakanlah untuk kami cahaya kami dan ampunilah kami; Sungguh, Engkau Mahakuasa atas segala sesuatu.” ",
      "text": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا تُوْبُوْٓا اِلَى اللّٰهِ تَوْبَةً نَّصُوْحًاۗ عَسٰى رَبُّكُمْ اَنْ يُّكَفِّرَ عَنْكُمْ سَيِّاٰتِكُمْ وَيُدْخِلَكُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُۙ يَوْمَ لَا يُخْزِى اللّٰهُ النَّبِيَّ وَالَّذِيْنَ اٰمَنُوْا مَعَهٗۚ نُوْرُهُمْ يَسْعٰى بَيْنَ اَيْدِيْهِمْ وَبِاَيْمَانِهِمْ يَقُوْلُوْنَ رَبَّنَآ اَتْمِمْ لَنَا نُوْرَنَا وَاغْفِرْ لَنَاۚ اِنَّكَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ",
      "text_translation_en": "O you who have attained to faith! Turn unto God in sincere repentance: it may well be that your Sustainer will efface from you your bad deeds, and will admit you into gardens through which running waters flow, on a Day on which God will not shame the Prophet and those who share his faith: their light will spread rapidly before them, and on their right; [and] they will pray: \"O our Sustainer! Cause this our light to shine for us forever, and forgive us our sins: for, verily, Thou hast the power to will anything!\"",
      "juz_number": 28
    },
    "9": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad to raise his arms and fight the unbelievers with great fervor and threaten and act decisively and harshly on the hypocrites. The Prophet was also told to explain that they would be disappointed in the hereafter because of their hypocrisy. Therefore, the Prophet (peace be upon him) had once expelled some hypocrites and sent them out of the mosque. They will be put into Hellfire, which is a very bad place of residence, as God explained in His Word: Surely Hell is a terrible dwelling place and a dwelling place. (al-Furqan \/ 25: 66) In another verse it is also stated: They are hell in hell, and (Hell) is the worst place to return. (Nisa '\/ 4: 97)",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad mengangkat senjata dan memerangi orang-orang kafir dengan sungguh-sungguh dan memberi ancaman serta bertindak tegas dan keras kepada orang-orang munafik. Nabi juga diperintahkan untuk menjelaskan bahwa mereka akan mengalami kekecewaan di akhirat nanti karena kemunafikan mereka. Oleh karena itu, Nabi saw pernah mengusir secara tegas sebagian orang munafik dan menyuruhnya keluar dari masjid. Mereka itu akan dimasukkan ke dalam neraka Jahanam yang merupakan seburuk-buruk tempat tinggal, sebagaimana dijelaskan Allah dalam firman-Nya:\n\nSungguh, Jahanam itu seburuk-buruk tempat menetap dan tempat kediaman. (al-Furqan\/25: 66)\n\nDalam ayat lain juga dijelaskan:\n\nMaka orang-orang itu tempatnya di neraka Jahanam, dan (Jahanam) itu seburuk-buruk tempat kembali. (an-Nisa'\/4: 97)",
      "text_translation": "Wahai Nabi! Perangilah orang-orang kafir dan orang-orang munafik dan bersikap keraslah terhadap mereka. Tempat mereka adalah neraka Jahanam dan itulah seburuk-buruk tempat kembali. ",
      "text": "يٰٓاَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنٰفِقِيْنَ وَاغْلُظْ عَلَيْهِمْۗ وَمَأْوٰىهُمْ جَهَنَّمُۗ وَبِئْسَ الْمَصِيْرُ ",
      "text_translation_en": "O PROPHET! Strive hard against the deniers of the truth and the hypocrites, and be adamant with them. And [if they do not repent,] their goal shall be hell - and how vile a journey’s end!",
      "juz_number": 28
    },
    "10": {
      "text_tafsir_en": "In this verse, God creates a parable that explains the condition of the unbelievers who are no longer useful to him or her for the lessons and advice of the faithful believers, including the prophets and apostles because of their hard hearts. They have no willingness to believe and their nature has deviated from the truth, as did Noah's wife and Lot's wife. Both are in the care and supervision of two prophets, who should be able to provide guidance for worldly happiness and the afterlife. However, the two did not want to, even though they practiced treachery and unbelief. The wife of Noah accused her husband of insanity, while his wife Lut led her people to do unkind and unkind things to her husband's guests, the angels. The intimacy of the two wives with their husbands, Noah and Lot, two virtuous servants of God, could not contain and prevent them from committing treachery and disbelief. Therefore, both wives deserve the punishment of God and will be cast into hell with the entourage of hell, in return for their evil deeds, which are a great sin.",
      "text_tafsir": "Dalam ayat ini, Allah membuat satu perumpamaan yang menjelaskan keadaan orang-orang kafir yang tidak bermanfaat lagi baginya pelajaran dan nasihat dari orang-orang mukmin yang jujur, antara lain para nabi dan rasul karena kerasnya hati mereka. Tidak ada kesediaan mereka untuk beriman dan fitrah mereka sudah menyimpang dari kebenaran, seperti istri Nabi Nuh dan istri Nabi Lut. Keduanya di dalam asuhan dan pengawasan dua orang nabi, yang mestinya dapat memberikan petunjuk sehingga memperoleh kebahagiaan dunia dan akhirat. Akan tetapi, keduanya tidak mau, bahkan mereka berbuat khianat dan kekafiran. Istri Nabi Nuh menuduh suaminya gila, sedang istri Nabi Lut menuntun kaum suaminya untuk berbuat yang tidak wajar dan tidak sopan terhadap tamu-tamu suaminya yaitu para malaikat. \n\nKeakraban kedua istri-istri itu dengan para suami yaitu Nabi Nuh dan Nabi Lut, dua hamba Allah yang saleh, tidak dapat membendung dan mencegah keduanya dari berbuat khianat dan kufur. Oleh karena itu, kedua istri itu pantas mendapat azab Allah dan akan dimasukkan ke dalam neraka bersama rombongan penghuni neraka, sebagai balasan yang setimpal dari perbuatan keduanya yang jahat, yang merupakan dosa besar.",
      "text_translation": "Allah membuat perumpamaan bagi orang-orang kafir, istri Nuh dan istri Lut. Keduanya berada di bawah pengawasan dua orang hamba yang saleh di antara hamba-hamba Kami; lalu kedua istri itu berkhianat kepada kedua suaminya, tetapi kedua suaminya itu tidak dapat membantu mereka sedikit pun dari (siksaan) Allah; dan dikatakan (kepada kedua istri itu), “Masuklah kamu berdua ke neraka bersama orang-orang yang masuk (neraka).” ",
      "text": "ضَرَبَ اللّٰهُ مَثَلًا لِّلَّذِيْنَ كَفَرُوا امْرَاَتَ نُوْحٍ وَّامْرَاَتَ لُوْطٍۗ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتٰهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللّٰهِ شَيْـًٔا وَّقِيْلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِيْنَ ",
      "text_translation_en": "For those who are bent on denying the truth God has propounded a parable in [the stories of] Noah's wife and Lot's wife: they were wedded to two of Our righteous servants, and each one betrayed her husband; and neither of the two [husbands] will be of any avail to these two women when they are told [on Judgment Day], \"Enter the fire with all those [other sinners] who enter it!\"",
      "juz_number": 28
    },
    "11": {
      "text_tafsir_en": "In this verse, God creates the opposite of the state of believers. The parable is Asiyah bint Muzahim, Pharaoh's wife. In that parable, God explained that the relationship of the believers with the unbelievers would not harm them if they were pure and holy from the filth. Even though Asiyah bint Muzahim was under the supervision of her husband, a very dangerous enemy of God, he still believed. He prayed and prayed, \"My Lord! Build for me a house in heaven and save me from Pharaoh and his deeds, and deliver me from the unjust people.\"",
      "text_tafsir": "Pada ayat ini, Allah membuat perumpamaan sebaliknya yaitu keadaan orang-orang yang beriman. Perumpamaan itu ialah Asiyah binti Muzahim, istri Fir'aun. Dalam perumpamaan itu, Allah menjelaskan bahwa hubungan orang-orang mukmin dengan orang-orang kafir tidak akan membahayakan kalau diri itu murni dan suci dari kotoran. Sekalipun Asiyah binti Muzahim berada di bawah pengawasan suaminya, musuh Allah yang sangat berbahaya, tetapi ia tetap beriman. Ia selalu memohon dan berdoa, \"Ya Tuhanku! Bangunlah untukku sebuah rumah di sisi-Mu dalam surga dan selamatkanlah aku dari Fir'aun dan perbuatannya, dan selamatkanlah aku dari kaum yang zalim.\"",
      "text_translation": "Dan Allah membuat perumpamaan bagi orang-orang yang beriman, istri Fir‘aun, ketika dia berkata, “Ya Tuhanku, bangunkanlah untukku sebuah rumah di sisi-Mu dalam surga dan selamatkanlah aku dari Fir‘aun dan perbuatannya, dan selamatkanlah aku dari kaum yang zalim,” ",
      "text": "وَضَرَبَ اللّٰهُ مَثَلًا لِّلَّذِيْنَ اٰمَنُوا امْرَاَتَ فِرْعَوْنَۘ اِذْ قَالَتْ رَبِّ ابْنِ لِيْ عِنْدَكَ بَيْتًا فِى الْجَنَّةِ وَنَجِّنِيْ مِنْ فِرْعَوْنَ وَعَمَلِهٖ وَنَجِّنِيْ مِنَ الْقَوْمِ الظّٰلِمِيْنَۙ ",
      "text_translation_en": "And for those who have attained to faith God has propounded a parable in [the story of] Pharaoh's wife as she prayed \"O my Sustainer! Build Thou for me a mansion in the paradise [that is] with Thee, and save me from Pharaoh and his doings, and save me, from all evildoing folk!",
      "juz_number": 28
    },
    "12": {
      "text_tafsir_en": "In this verse, God once again made a metaphor for the believers, the state of Mary the daughter of Imran who kept her honor and was given a gift in this world and the hereafter. He was chosen by his Lord for reacting to Gabriel for the filling of his womb with words as they are recorded in the Qur'an: He (Mary) said, \"Indeed, I seek refuge in the Most Merciful of you, if you are the one who fears.\" (Mary \/ 19: 18) Thus, her sincerity was firm and perfect in her purity, and in her womb was blown into the womb by Gabriel some of the spirit of God, who created a prophet, Jesus son of Mary the daughter of Imran, justifying the law of God and the books that were revealed, To his prophet. He included and was known for his piety, zealous worship, humility, and obedience to his God. Ahmad recounted in his Musnad that the head of the women of heaven was Maryam and Fatimah followed Khadijah and Asiyah. In the authentic book it is explained that perfect men are many, but only perfect women are Asiyah daughter of Muzahim (Pharaoh's wife), Maryam daughter of 'Imran, Khadijah daughter of Khuwailid, and Fathimah daughter of Muhammad. While Siti 'Aisha's advantage over other women is like the advantage of other foods.",
      "text_tafsir": "Pada ayat ini, Allah sekali lagi membuat perumpamaan bagi orang-orang mukmin yaitu keadaan Maryam binti Imran yang memelihara kehormatannya dan telah diberikan karamah di dunia dan akhirat. Ia dipilih Tuhannya karena bereaksi kepada Jibril tentang pengisian rahimnya dengan ucapan sebagaimana diabadikan di dalam Al-Qur'an:\n\nDia (Maryam) berkata, \"Sungguh, aku berlindung kepada Tuhan Yang Maha Pengasih terhadapmu, jika engkau orang yang bertakwa.\" (Maryam\/19: 18)\n\nDengan demikian, kesalehannya menjadi mantap dan sempurna kesuciannya, maka ditiupkanlah ke dalam rahimnya oleh Jibril sebagian roh ciptaan Allah, yang mewujudkan seorang nabi yaitu Isa bin Maryam binti Imran, membenarkan syariat Allah dan kitab-kitab yang diturunkan-Nya kepada nabi-Nya. Dia termasuk dan terbilang orang yang bertakwa, tekun beribadah, merendahkan diri, dan taat kepada Tuhan-Nya.\n\nAhmad meriwayatkan dalam Musnadnya bahwa penghulu wanita penghuni surga ialah Maryam lalu Fatimah menyusul Khadijah dan Asiyah.\n\nDi dalam kitab sahih diterangkan bahwa laki-laki yang sempurna banyak bilangannya, tetapi perempuan yang sempurna hanya empat yaitu Asiyah binti Muzahim (istri Fir'aun), Maryam binti 'Imran, Khadijah binti Khuwailid, dan Fathimah binti Muhammad. Sedangkan kelebihan Siti 'Aisyah atas wanita-wanita yang lain seperti kelebihan tsarid atas makanan-makanan yang lain.",
      "text_translation": "dan Maryam putri Imran yang memelihara kehormatannya, maka Kami tiupkan ke dalam rahimnya sebagian dari roh (ciptaan) Kami; dan dia membenarkan kalimat-kalimat Tuhannya dan kitab-kitab-Nya; dan dia termasuk orang-orang yang taat. ",
      "text": "وَمَرْيَمَ ابْنَتَ عِمْرٰنَ الَّتِيْٓ اَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيْهِ مِنْ رُّوْحِنَا وَصَدَّقَتْ بِكَلِمٰتِ رَبِّهَا وَكُتُبِهٖ وَكَانَتْ مِنَ الْقٰنِتِيْنَ ࣖ   ۔",
      "text_translation_en": "And [We have propounded yet another parable of God-consciousness in the story of] Mary, the daughter of Imran, who guarded her chastity, whereupon We breathed of Our spirit into that [which was in her womb], and who accepted the truth of her Sustainer’s words - and [thus,] of His revelations - and was one of the truly devout.",
      "juz_number": 28
    }
  },
  "name": "التحريم",
  "name_translation_en": "The Prohibition",
  "name_translation": "Pengharaman",
  "name_latin": "At-Tahrim"
}