{
  "number": 67,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 30,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse explains that the Most Holy God and His infinite mercy, is the ruler of all the kingdoms of this mortal world with all its contents, and the aftermath of the hereafter. Allah says: And to Allah belongs the dominion of the heavens and the earth and what is between them. He created what He wanted. And Allah is Almighty over all things. (al-Ma'idah \/ 5:17) Other words of Allah: Praise be to Allah, the Lord of the worlds, the Merciful, the Merciful, the Owner of the Day of Judgment. (al-Fatihah \/ 1: 2-4) God is the ruler of the kingdom of the world. This means that He created the whole universe and everything in it. He is the one who develops, maintains his existence, organizes, manages, dominates, and determines everything in it, as He pleases. In organizing, managing, developing, and maintaining the continuity of this nature, God sets laws and regulations. All are obliged to obey and abide by His laws and regulations without the slightest exception. Any and all who do not obey and obey, and break those laws and regulations will surely perish or suffer. There are two laws and rules of God in this world; first, circumcision, which is the law and provision of God in this universe, for both living and dead, both for man and for animals, plants, and inanimate objects, both for the earth and for all things and for all planets circulating in an infinite universe. Among the laws and regulations of God were the fire burning, the water flowing from high to low, Pascal's law, and, Archimedes' law. Living humans need oxygen, food and drink, both physical and spiritual food. Humans are individual beings and social beings. Every planet, including the earth, has its attractiveness and runs on its predetermined circuits; and many more laws and regulations of God, both known to man and unknown to him. Breaking God's laws and regulations means suffering and destruction for those who violate them. Such as putting a hand into the fire as a result of the burning of the hand, and destroying nature or cutting down forests beyond the limits of floods and human losses. Even stars and meteors that violate God's law will be destroyed. Second, the religion of God, which contains instructions for mankind. By following these guidelines, people will live happily ever after and in the hereafter. The religion that contains these instructions was passed down by God to the apostles whom He had sent, from Adam to Prophet Muhammad, as the last prophet and apostle of Allah, the covering of all prophets and prophets. People who live after the Prophet Muhammad, until the end of time, must follow the religion they bring if they want to live, be happy in this world and in the hereafter. Thus it is God who rules, governs, regulates, and preserves the continuity of the nature of the universe, sets forth laws and conditions, and thus appears to be all orderly, beautiful, and beneficial to man. If a citizen is obliged to be obedient to all the laws and conditions of his country, he must be more obliged to obey and obey the laws and regulations of God who created, favors, and protects. If a country imposes sanctions on every citizen who violates its laws and regulations, then God imposes sanctions and judges justly every creature who violates His laws and regulations. In addition to being the ruler of the kingdom of the world, God is also the ruler of the hereafter, which exists after the destruction of the entire kingdom. The afterlife is an eternal kingdom; beginning with the day of Judgment, the day of the destruction of the world and the resurrection of man from the grave. They were then gathered in the Field of Mahsyar to be judged and evaluated for their deeds and deeds. From that judgment it was decided; for those whose faith and righteous deeds are heavier than the wrongs they have done, they are rewarded with heaven, a place of delight and happiness. On the contrary, if the evil deeds that he has committed while living in the world are heavier than his faith and righteousness, then the reward they receive is hell, a place of endless misery. Life in the hereafter, in heaven and in hell, is eternal life. In heaven Allah bestows happiness and happiness on those who believe and do good, while in hell Allah inflicts heavy torments on unbelievers and evil doers. Allah says: Not so! Whoever does evil, and whose sins are covered, then they are the dwellers of hell. They dwell therein, And those who believe and do good, they are dwellers of heaven. They remain in it. (al-Baqarah \/ 2: 81-82) At the end of this verse it is stated that God is the ruler of the world and of the hereafter, the Almighty over all things. There is nothing that can match his power and nothing can escape his power.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah Yang Mahasuci dan yang tidak terhingga rahmat-Nya, adalah penguasa semua kerajaan dunia yang fana ini dengan segala macam isinya, dan kerajaan akhirat yang terjadi setelah lenyapnya kerajaan dunia. Allah berfirman:\n\nDan milik Allah-lah kerajaan langit dan bumi dan apa yang ada di antara keduanya. Dia menciptakan apa yang Dia kehendaki. Dan Allah Mahakuasa atas segala sesuatu. (al-Ma'idah\/5: 17)\n\nFirman Allah yang lain :\n\nSegala puji bagi Allah, Tuhan seluruh alam, Yang Maha Pengasih, Maha Penyayang, Pemilik hari pembalasan. (al-Fatihah\/1: 2-4)\n\nAllah adalah penguasa kerajaan dunia. Hal ini berarti bahwa Dialah yang menciptakan seluruh alam ini beserta segala yang terdapat di dalamnya. Dia pulalah yang mengembangkan, menjaga kelangsungan wujudnya, mengatur, mengurus, menguasai, dan menentukan segala sesuatu yang ada di dalamnya, sesuai yang dikehendaki-Nya. Dalam mengatur, mengurus, mengembangkan, dan menjaga kelangsungan wujud alam ini, Allah menetapkan hukum-hukum dan peraturan-peraturan. Semua wajib tunduk dan mengikuti hukum-hukum dan peraturan yang dibuat-Nya itu tanpa ada pengecualian sedikit pun. Apa dan siapa saja yang tidak mau tunduk dan patuh, serta mengingkari hukum-hukum dan peraturan-peraturan itu pasti akan binasa atau sengsara.\n\nHukum dan peraturan Allah yang berlaku di alam ini ada dua; pertama, sunatullah yang merupakan hukum dan ketentuan Allah yang berlaku di alam semesta ini, baik bagi makhluk hidup maupun benda mati, baik bagi manusia maupun bagi hewan, tumbuh-tumbuhan, dan benda yang tidak bernyawa, baik bagi bumi dengan segala isinya maupun bagi seluruh planet-planet yang beredar di jagat raya yang tiada terbatas luasnya. Di antara hukum dan peraturan Allah itu ialah api membakar, air mengalir dari tempat yang tinggi ke tempat yang rendah, hukum Pascal, dan, hukum Archimedes. Manusia hidup memerlukan oksigen, makan dan minum, baik berupa makanan dan minuman jasmani maupun rohani. Manusia adalah makhluk individu dan makhluk sosial. Tiap-tiap planet, termasuk bumi, mempunyai daya tarik-menarik dan berjalan pada garis edarnya yang telah ditentukan; dan banyak lagi hukum-hukum dan peraturan-peraturan Allah, baik yang telah diketahui manusia maupun yang belum diketahuinya.\n\nPelanggaran terhadap hukum dan peraturan Allah berarti kesengsaraan dan kebinasaan bagi yang melanggarnya. Seperti memasukkan tangan ke dalam api berakibat terbakarnya tangan tersebut, dan merusak alam atau menebang hutan yang melampaui batas berakibat banjir dan kerugian bagi manusia. Bahkan bintang-bintang dan meteor yang menyalahi hukum Allah akan mengalami kehancuran.\n\nKedua, agama Allah, yang berisi petunjuk-petunjuk bagi manusia. Dengan mengikuti petunjuk-petunjuk itu, manusia akan hidup bahagia di dunia dan di akhirat. Agama yang berisi petunjuk-petunjuk itu diturunkan Allah kepada para rasul yang telah diutus-Nya, sejak dari Nabi Adam sampai kepada Nabi Muhammad, sebagai nabi dan rasul Allah yang terakhir, penutup dari segala rasul dan nabi. Manusia yang hidup setelah diutusnya Nabi Muhammad, sampai akhir zaman, wajib mengikuti agama yang dibawanya jika mereka ingin hidup selamat, berbahagia di dunia dan di akhirat .\n\nDemikianlah Allah yang menguasai, mengurus, mengatur, dan menjaga kelangsungan wujud alam ini, menetapkan undang-undang dan ketentuan-ketentuan, sehingga dengan demikian terlihat semuanya teratur rapi, indah, dan bermanfaat bagi manusia. Apabila seorang warga negara wajib tunduk dan patuh kepada semua hukum dan ketentuan yang berlaku di negaranya, tentu ia harus lebih wajib lagi tunduk dan patuh kepada hukum dan peraturan Allah yang menciptakan, memberi nikmat, dan menjaganya. Jika suatu negara menetapkan sanksi bagi setiap warga negara yang melanggar hukum dan peraturan yang telah ditetapkannya, maka Allah lebih menetapkan sanksi dan mengadili dengan seadil-adilnya setiap makhluk yang mengingkari hukum dan peraturan yang telah dibuat-Nya.\n\nDi samping sebagai penguasa kerajaan dunia, Allah juga menguasai kerajaan akhirat, yang ada setelah kehancuran seluruh kerajaan dunia. Kerajaan akhirat merupakan kerajaan abadi; dimulai dari terjadinya hari Kiamat, hari kehancuran dunia dan pembangkitan manusia dari kubur. Kemudian mereka dikumpulkan di Padang Mahsyar untuk diadili dan ditimbang amal dan perbuatannya. Dari pengadilan itu diputuskan; bagi yang iman dan amal salehnya lebih berat dibandingkan dengan kesalahan yang telah diperbuatnya, maka ia diberi balasan dengan surga, tempat yang penuh kenikmatan dan kebahagiaan. Sebaliknya jika perbuatan jahat yang telah dikerjakannya selama hidup di dunia lebih berat dari iman dan amal saleh yang telah dilakukannya, maka balasan yang mereka peroleh adalah neraka, tempat yang penuh kesengsaraan yang tiada tara. Kehidupan di akhirat, baik di surga maupun di neraka, adalah kehidupan yang kekal. Di surga Allah melimpahkan kenikmatan dan kebahagiaan kepada orang-orang yang beriman dan beramal saleh, sedangkan di neraka Allah menimpakan siksaan yang sangat berat kepada orang-orang kafir dan berbuat jahat.\n\nAllah berfirman:\n\nBukan demikian! Barang siapa berbuat keburukan, dan dosanya telah menenggelamkannya, maka mereka itu penghuni neraka. Mereka kekal di dalamnya, Dan orang-orang yang beriman dan mengerjakan kebajikan, mereka itu penghuni surga. Mereka kekal di dalamnya. (al-Baqarah\/2: 81-82)\n\nPada akhir ayat ini ditegaskan bahwa Allah sebagai penguasa kerajaan dunia dan kerajaan akhirat, Mahakuasa atas segala sesuatu. Tidak ada suatu apa pun yang dapat menandingi kekuasaan-Nya dan tidak ada suatu apa pun yang dapat luput dari kekuasaan-Nya itu.",
      "text_translation": "Mahasuci Allah yang menguasai (segala) kerajaan, dan Dia Mahakuasa atas segala sesuatu.",
      "text": "تَبٰرَكَ الَّذِيْ بِيَدِهِ الْمُلْكُۖ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌۙ",
      "text_translation_en": "HALLOWED be He in whose hand all dominion rests, since He has the power to will anything:",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "In this verse it is explained that God who holds the power of the kingdom of the world and of the hereafter and who controls all things, is the God who created death and life. He alone determines the time of every creature's death. If by the time the death had arrived, nothing could speed up or slow down anything. In the same way, the state of things that will die, nothing can change it from what He has determined. Allah says: And Allah will not delay (death) when the time of his death has come. And Allah can see what you do. (al-Munafiqun \/ 63: 11) No man or any other living thing can keep from the death that God has decreed, as He says: Wherever you are, death will overtake you, though you are in a high fortress. and strong. (an-Nisa '\/ 4: 78) So it is said that it is God who creates life. The meaning is that He is the One who gives life to all living things in this world. It is He who provides all the necessities of life, and it is He who gives the possibility of survival of that kind of creature, so that it is not threatened by extinction. Then He also determines the life span of a creature and determines the condition of life of all beings. In the meantime, God also determines how long a creature will survive, so that when His appointed time is over, destroy the species as it was experienced by the ancient species. In this verse it is explained that Allah created death and life is to test the people, who among them believe and practice righteousness by following the guidance of the Prophet Muhammad and who denied it. From the above verse it is understood that by creating that life, God gives man a very wide opportunity to choose what is good for himself. Whether he will follow his lust, or will he follow God's instructions, laws, and provisions as the ruler of this universe. If human beings were to suffer a painful torment in the hereafter, then the torment would in fact be at their own will. Likewise, if they find happiness, then that happiness comes from their own will while living in the world. According to the test also the degree and dignity of a man is assigned to God. The stronger a person's faith is, the more righteous deeds he performs. The more submissive and obedient he is to the law and the rules of God, the higher the degree and dignity he receives from God. On the other hand, if a person does not believe in him, does not do good deeds and disobeys him, he will have the most despicable place in the hereafter. The earthly life is to test the human being, who among them is always using his mind and mind to understand the religion of God, and choosing which one is the best he can do, so that he is approved by God. Also to know who is strong and able to stop himself from doing the prohibitions of God and who obeys him most. This verse encourages and encourages people to be vigilant in their lives. They should always check in their hearts whether he really is a believer, and also examine everything they will do, whether or not they are commanded by God, and whether they will do it or not. If the act is in accordance with the command of God, even including the act which He approves, then do it immediately. On the contrary, if the act includes the prohibition of Allah, then never do it. At the end of this verse, God emphasizes that He is Almighty, and no creature can interfere with His will if He does something, such as to reward the believers and do good or to punish the wicked. He forgave His servants who would repent of Him by repenting of the sin they had committed, promising never to commit such sins again, and not to commit any other sins. In this verse, God mentions two types of attributes, namely, the Almighty and the Forgiving, as if these two are the opposite. The almighty nature of the Word gives the fearful news, while the Forgiving gives understanding to the hope of every one who commits sin if he repents. This shows that the God who is worthy of worship is truly capable of imposing His will on anyone, no one can hinder it. He knows everything, so that he can reward each of his servants, whether reward or torment. With that knowledge, He is able to distinguish between the obedient and the unjust, so that there is no possibility of a wicked person receiving a reward or an obedient and obedient one. Allah has never mistaken in giving vengeance. The other word of God that speaks in conjunction with this warning and hope is: Declare to my servants that I am the Forgiving, the Merciful, and verily my torment is a grievous torment. (al-hijr \/ 15: 49-50)",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa Tuhan yang memegang kekuasaan kerajaan dunia dan kerajaan akhirat serta menguasai segala sesuatunya itu, adalah Tuhan yang menciptakan kematian dan kehidupan. Hanya Dia yang menentukan saat kematian setiap makhluk. Jika saat kematian itu telah tiba, tidak ada suatu apa pun yang dapat mempercepat atau memperlambatnya barang sekejap pun. Demikian pula keadaan makhluk yang akan mati, tidak ada suatu apa pun yang dapat mengubahnya dari yang telah ditentukan-Nya. Allah berfirman:\n\nDan Allah tidak akan menunda (kematian) seseorang apabila waktu kematiannya telah datang. Dan Allah Mahateliti terhadap apa yang kamu kerjakan. (al-Munafiqun\/63: 11)\n\nTidak seorang pun manusia atau makhluk hidup lain yang dapat menghindarkan diri dari kematian yang telah ditetapkan Allah, sebagaimana firman-Nya:\n\nDimanapun kamu berada, kematian akan mendapatkan kamu, kendatipun kamu berada di dalam benteng yang tinggi dan kukuh. (an-Nisa'\/4: 78)\n\nDemikian pula dinyatakan bahwa Allah yang menciptakan kehidupan. Maksudnya ialah bahwa Dialah yang menghidupkan seluruh makhluk hidup yang ada di alam ini. Dialah yang menyediakan segala kebutuhan hidupnya dan Dia pula yang memberikan kemungkinan kelangsungan jenis makhluk hidup itu, sehingga tidak terancam kepunahan. Kemudian Dia pula yang menetapkan lama kehidupan suatu makhluk dan menetapkan keadaan kehidupan seluruh makhluk. Dalam pada itu, Allah pun menentukan sampai kapan kelangsungan hidup suatu makhluk, sehingga bila waktu yang ditentukan-Nya itu telah berakhir, musnahlah jenis makhluk itu sebagaimana yang dialami oleh jenis-jenis hewan purba.\n\nDalam ayat ini diterangkan bahwa Allah menciptakan kematian dan kehidupan adalah untuk menguji manusia, siapa di antara mereka yang beriman dan beramal saleh dengan mengikuti petunjuk-petunjuk yang dibawa Nabi Muhammad dan siapa pula yang mengingkarinya. Dari ayat di atas dipahami bahwa dengan menciptakan kehidupan itu, Allah memberi kesempatan yang sangat luas kepada manusia untuk memilih mana yang baik menurut dirinya. Apakah ia akan mengikuti hawa nafsunya, atau ia akan mengikuti petunjuk, hukum, dan ketentuan Allah sebagai penguasa alam semesta ini. Seandainya manusia ditimpa azab yang pedih di akhirat nanti, maka azab itu pada hakikatnya ditimpakan atas kehendak diri mereka sendiri. Begitu juga jika mereka memperoleh kebahagiaan, maka kebahagiaan itu datang karena kehendak diri mereka sendiri sewaktu hidup di dunia.\n\nBerdasarkan ujian itu pula ditetapkan derajat dan martabat seorang manusia di sisi Allah. Semakin kuat iman seseorang semakin banyak amal saleh yang dikerjakannya. Semakin ia tunduk dan patuh mengikuti hukum dan peraturan Allah, semakin tinggi pula derajat dan martabat yang diperolehnya di sisi Allah. Sebaliknya jika manusia tidak beriman kepada-Nya, tidak mengerjakan amal saleh dan tidak taat kepada-Nya, ia akan memperoleh tempat yang paling hina di akhirat.\n\nKehidupan duniawi adalah untuk menguji manusia, siapa di antara mereka yang selalu menggunakan akal dan pikirannya memahami agama Allah, dan memilih mana perbuatan yang paling baik dikerjakannya, sehingga perbuatannya itu diridai Allah. Juga untuk mengetahui siapa yang tabah dan tahan mengekang diri dari mengerjakan larangan-larangan Allah dan siapa pula yang paling taat kepada-Nya.\n\nAyat ini mendorong dan menganjurkan agar manusia selalu waspada dalam hidupnya. Hendaklah mereka selalu memeriksa hati mereka apakah ia benar-benar seorang yang beriman, dan juga memeriksa segala yang akan mereka perbuat, apakah telah sesuai dengan yang diperintahkan Allah atau tidak, dan apakah yang akan mereka perbuat itu larangan Allah atau bukan. Jika perbuatan itu telah sesuai dengan perintah Allah, bahkan termasuk perbuatan yang diridai-Nya, hendaklah segera mengerjakannya. Sebaliknya jika perbuatan itu termasuk larangan Allah, maka jangan sekali-kali melaksanakannya.\n\nPada akhir ayat ini, Allah menegaskan bahwa Dia Mahaperkasa, tidak ada satu makhluk pun yang dapat menghalangi kehendak-Nya jika Ia hendak melakukan sesuatu, seperti hendak memberi pahala orang-orang yang beriman dan beramal saleh atau hendak mengazab orang yang durhaka kepada-Nya. Dia Maha Pengampun kepada hamba-hamba-Nya yang mau bertobat kepada-Nya dengan menyesali perbuatan dosa yang telah dikerjakannya, berjanji tidak akan melakukan dosa itu lagi serta berjanji pula tidak akan melakukan dosa-dosa yang lain.\n\nPada ayat ini, Allah menyebut secara bergandengan dua macam di antara sifat-sifat-Nya, yaitu sifat Mahaperkasa dan Maha Pengampun, seakan-akan kedua sifat ini adalah sifat yang berlawanan. Sifat Mahaperkasa memberi pengertian memberi kabar yang menakut-nakuti, sedang sifat Maha Pengampun memberi pengertian adanya harapan bagi setiap orang yang mengerjakan perbuatan dosa, jika ia bertobat. Hal ini menunjukkan bahwa Allah yang berhak disembah itu benar-benar dapat memaksakan kehendak-Nya kepada siapa pun, tidak ada yang dapat menghalanginya. Dia mengetahui segala sesuatu, sehingga dapat memberikan balasan yang tepat kepada setiap hamba-Nya, baik berupa pahala maupun siksa. Dengan pengetahuan itu pula, Dia dapat membedakan antara orang yang taat dan durhaka kepada-Nya, sehingga tidak ada kemungkinan sedikit pun seorang yang durhaka memperoleh pahala atau seorang yang taat dan patuh memperoleh siksa. Allah tidak pernah keliru dalam memberikan pembalasan.\n\nFirman Allah lainnya yang menyebut secara bergandengan kabar peringatan dan pengharapan itu ialah:\n\nKabarkanlah kepada hamba-hamba-Ku, bahwa Akulah Yang Maha Pengampun, Maha Penyayang, dan sesungguhnya azab-Ku adalah azab yang sangat pedih. (al-hijr\/15: 49-50)",
      "text_translation": "Yang menciptakan mati dan hidup, untuk menguji kamu, siapa di antara kamu yang lebih baik amalnya. Dan Dia Mahaperkasa, Maha Pengampun.",
      "text": " ۨالَّذِيْ خَلَقَ الْمَوْتَ وَالْحَيٰوةَ لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًاۗ وَهُوَ الْعَزِيْزُ الْغَفُوْرُۙ",
      "text_translation_en": "He who has created death as well as life, so that He might put you to a test [and thus show] which of you is best in conduct, and [make you realize that] He alone is almighty, truly forgiving.",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "God explains that it is He who created the whole heaven in degrees in the universe. Every creature of nature seemed to float in the middle of the universe, with no pillars to hold and no ropes to fasten it. Each sky occupies a space designated for it in the center of the universe and each layer comprises so many countless planets. Each planet runs in the direction it is assigned. Allah says: He created the sky without a pillar as you see it, and He placed the mountains on the surface so that it could not shake you; and extends all kinds of living things to the living beings on earth. And We sent down rain from the sky, and planted in it all kinds of good plants. (Luqman \/ 31: 10) All the celestial bodies and the stars therein are subject to and obeying the decrees and laws which God has decreed for them. Everything was going that way until the time came for him. Allah says: He who ascends the heavens without a pillar (as you see), then He dwells on the 'Fire. He subdues the sun and the moon; each circulating at a given time. He regulates (his) affairs, and explains his signs, so that you may be confident of meeting your Lord. (ar-Ra'd \/ 13: 2) According to Astronomical science, in the infinite universe, there are galaxies or constellations of stars that contain billions of stars without number. The stars within each galaxy are as small as the earth and some as large as the sun, and even larger. Each galaxy has a neat system, which is independent of the space system as a whole. The attractiveness of each planet, causing the planets to fall apart and not collide with each other, so that they remain floating and circulating in their respective spheres in space. When the meaning of the verse is connected with that described in Astronomical science, then what is meant by the many celestial levels are galaxies. The seven numbers in Arabic are commonly used to denote a large number. Therefore, what is meant by the seven heavens is seven galaxies in the sky. Meanwhile, some interpreters argue that the \"seven layers of heaven\" are seven stars around the sun, and some interpreters do not want to interpret them. They turned it over to God because it was in His knowledge that man had never known. This is a general overview of the state of the galaxy system. About the condition of each of these countless planets, such as how they are and what they are, what they contain, how detailed they are, and so on, is very little known to man. It is only a small amount of knowledge of the galaxy. As for the creation of the seven-heaven \"heaven\" is found in some other verses, such as al-Baqarah \/ 2:29, al-An'am \/ 6: 125, Noah \/ 71: 15, and an-Naba '\/ 78: 12. According to scientists, the word heaven can be interpreted as the earth's sky as the atmosphere or the sky of the universe. When it was the earth's sky, it turned out that the atmosphere was divided into seven layers. And each layer has the task and function of protecting the earth. The subdivision of the atmosphere into seven layers is based on differences in chemical content and air temperature. The seven layers are named: Troposphere, Stratosphere, Mesosphere, Thermosphere, Exosfer, Ionosphere, and Magnetosphere. In Surah Fussilat \/ 41 verses 11-12 it is stated that each layer of heaven has its own affairs. It is scientifically proven, for example, that there are layers that work to create rain, prevent radiation damage, reflect radio waves, and even layers that prevent meteors from damaging the earth. However, with the existence of verse 5 in the same chapter (al-Mulk \/ 67: 5), it seems that heaven is not the atmospheric sky, but the universe. The sound of the verse is this: And verily We have made the heavens near, with the stars, and We have made them (the stars) a fiery thrower, and We have prepared for them the torment of hell. (al-Mulk \/ 67: 5) It is plainly stated that in the \"near heavens\" (possibly interpreted as the first sky) it is adorned by stars. The word used is not a star (a singular form that can refer to the sun as a star in the solar system), but stars (a plural form). Thus the \"near sky\" is the whole galaxy we know today. If this is the case, what the Qur'an says about this is beyond the reach of scientific findings. In that respect, it is a very arrogant thing for a person to admit that he knows everything. No matter how wide a person's knowledge is, it is very small compared to God's knowledge. If one describes himself as the earth, and then sees himself in the midst of the many planets, he will surely find that he is nothing compared to the creatures of God in countless shapes and patterns. God then commanded man to look at the heavens and the earth and their contents, and to study their nature. For example, look at the sun shining and the moon shining, to the fullest extent of the benefits of the light and light for the life of all beings. Look at the herds that are grazing on the grasslands, the greenery, the tall, rugged mountains that cool the eyes of those who look upon them; the vast expanse of the sea bends; the sky and everything in it. Everything grows, develops, stays in existence and forms, and continues and has very elaborate systems, laws, and regulations. The system does not fall apart from the greater system of laws and regulations than that which prevails in this mortal world. Think about and ponder, are there any defects or defects in the creatures that God created, as well as the systems, laws and regulations that apply to them? Great and Creator of God, God of the universe, there is no flaw or blemish in the creatures He creates. Then as if God were continuing his question to man were they still in doubt about His power and greatness? Do humans still doubt the systems, laws, and regulations made for His creatures, including their own? When in doubt, humans are commanded to observe, ponder, and re-learn. Do they still find in Allah's creation some imperfections? From the question posed by this verse, it can be understood that it is as if God challenged mankind, to seek (if any) the flaws and imperfections of His creation. If there is a defect, defect, and blemish in God's creation, then man is obliged to renounce his uniqueness and power. However, they admire and acknowledge the grandeur of God's creation, even acknowledging their weaknesses. If so, their disobedience was not caused by their lack of trust in God, but rather by their arrogance and arrogance.",
      "text_tafsir": "Allah menerangkan bahwa Dialah yang menciptakan seluruh langit secara bertingkat di alam semesta. Tiap-tiap benda alam itu seakan-akan terapung kokoh di tengah-tengah jagat raya, tanpa ada tiang-tiang yang menyangga dan tanpa ada tali-temali yang mengikatnya. Tiap-tiap langit itu menempati ruangan yang telah ditentukan baginya di tengah-tengah jagat raya dan masing-masing lapisan itu terdiri atas begitu banyak planet yang tidak terhitung jumlahnya. Tiap-tiap planet berjalan mengikuti garis edar yang telah ditentukan baginya. Allah berfirman:\n\nDia menciptakan langit tanpa tiang sebagaimana kamu melihatnya, dan Dia meletakkan gunung-gunung (di permukaan) bumi agar ia (bumi) tidak menggoyangkan kamu; dan memperkembangbiakkan segala macam jenis makhluk bergerak yang bernyawa di bumi. Dan Kami turunkan air hujan dari langit, lalu Kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik. (Luqman\/31: 10)\n\nSemua benda langit beserta bintang-bintang yang terdapat di dalamnya tunduk dan patuh mengikuti ketentuan dan hukum yang ditetapkan Allah baginya. Semuanya tetap seperti itu sampai pada waktu yang ditentukan baginya. Allah berfirman:\n\nAllah yang meninggikan langit tanpa tiang (sebagaimana) yang kamu lihat, kemudian Dia bersemayam di atas 'Arsy. Dia menundukkan matahari dan bulan; masing-masing beredar menurut waktu yang telah ditentukan. Dia mengatur urusan (makhluk-Nya), dan menjelaskan tanda-tanda (kebesaran-Nya), agar kamu yakin akan pertemuan dengan Tuhanmu. (ar-Ra'd\/13: 2)\n\nMenurut ilmu Astronomi, di jagat raya yang luasnya tiada terhingga itu, terdapat galaksi-galaksi atau gugusan-gugusan bintang yang di dalamnya terdapat miliaran bintang yang tiada terhitung jumlahnya. Bintang-bintang yang berada di dalam setiap galaksi itu ada yang kecil seperti bumi dan ada pula yang besar seperti matahari, dan bahkan banyak yang lebih besar lagi. Setiap galaksi mempunyai sistem yang teratur rapi, yang tidak terlepas dari sistem ruang angkasa seluruhnya. Adanya daya tarik-menarik yang terdapat pada setiap planet, menyebabkan planet-planet itu tidak jatuh dan tidak berbenturan antara yang satu dengan yang lain, sehingga ia tetap terapung dan beredar pada garis edarnya masing-masing di angkasa.\n\nBila dihubungkan pengertian ayat tersebut dengan yang dijelaskan ilmu Astronomi, maka yang dimaksud dengan tingkat-tingkat langit yang banyak itu ialah galaksi-galaksi. Sedang angka tujuh dalam bahasa Arab biasa digunakan untuk menunjukkan sesuatu yang jumlahnya banyak. Oleh karena itu, yang dimaksud dengan tingkat langit yang tujuh itu adalah galaksi-galaksi yang banyak terdapat di langit. Sementara itu, ada pula ahli tafsir yang berpendapat bahwa yang dimaksud dengan \"tujuh lapisan langit\" ialah tujuh bintang yang berada di sekitar matahari, dan ada pula ahli tafsir yang tidak mau menafsirkannya. Mereka menyerahkannya kepada Allah karena hal itu ada pada pengetahuan-Nya yang belum diketahui dengan pasti oleh manusia.\n\nDemikianlah gambaran umum keadaan sistem galaksi-galaksi. Mengenai keadaan setiap planet yang tidak terhitung banyaknya itu, seperti bagaimana sifat dan tabiatnya, apa yang terkandung di dalamnya, bagaimana bentuknya secara terperinci, dan sebagainya masih sangat sedikit yang diketahui manusia. Hal itu pun hanya sekelumit kecil dari pengetahuan tentang galaksi itu.\n\nSeperti mengenai penciptaan \"langit\" yang tujuh lapis terdapat pada beberapa ayat lainnya, seperti al-Baqarah\/2: 29, al-An'am\/6: 125, Nuh\/71: 15, dan an-Naba'\/78: 12. Menurut para saintis, kata langit dapat ditafsirkan sebagai langit bumi yang berupa atmosfer atau langit alam semesta. Apabila langit bumi, ternyata bahwa atmosfer dibagi dalam tujuh lapisan. Dan masing-masing lapisan mempunyai tugas dan fungsi melindungi bumi. \n\nPembagian atmosfer menjadi tujuh lapis didasarkan pada perbedaan kandungan kimia dan suhu udara. Ketujuh lapisan tersebut dinamakan: Troposfer, Stratosfer, lapisan-lapisan Mesosfer, Thermosfer, Exosfer, Ionosfer, dan Magnetosfer. Dalam Surah Fussilat\/41 ayat 11-12 dinyatakan bahwa tiap lapis langit mempunyai urusannya sendiri-sendiri. Hal ini dikonfirmasi ilmu pengetahuan, misal ada lapisan yang bertugas untuk membuat hujan, mencegah kerusakan akibat radiasi, memantulkan gelombang radio, sampai dengan lapisan yang mencegah agar meteor tidak merusak bumi.\n\nAkan tetapi, dengan adanya ayat 5 pada surah yang sama (al-Mulk\/67: 5), tampaknya yang dimaksudkan dengan langit bukanlah langit atmosfer, melainkan langit semesta. Bunyi ayat tersebut demikian:\n\nDan sungguh, telah Kami hiasi langit yang dekat, dengan bintang-bintang dan Kami jadikannya (bintang-bintang itu) sebagai alat pelempar setan, dan Kami sediakan bagi mereka azab neraka yang menyala-nyala. (al-Mulk\/67: 5)\n\nDinyatakan secara jelas bahwa pada \"langit yang dekat\" (mungkin dapat ditafsirkan sebagai lapis langit pertama) dihiasi oleh bintang-bintang. Kata yang digunakan bukan bintang (bentuk tunggal yang dapat menunjuk pada matahari sebagai bintang dalam tata surya), akan tetapi bintang-bintang (bentuk jamak). Dengan demikian \"langit yang dekat\" adalah seluruh galaksi yang kita ketahui saat ini.\n\nApabila demikian halnya, apa yang dinyatakan dalam Al-Qur'an mengenai hal ini, sama sekali belum dapat dijangkau oleh temuan ilmu pengetahuan. Berkaitan dengan itu, adalah suatu hal yang sangat sombong jika seorang manusia mengakui tahu segala sesuatu. Betapa pun luasnya pengetahuan seseorang, masih sangat sedikit bila dibandingkan dengan pengetahuan Allah. Apabila seseorang mengumpamakan dirinya sebagai bumi, kemudian melihat dirinya terletak di antara planet-planet yang banyak itu, tentu akan merasa bahwa dirinya sebenarnya tidak ada artinya jika dibandingkan dengan makhluk Allah yang beraneka ragam bentuk dan coraknya yang tiada terhitung jumlahnya.\n\nAllah lalu memerintahkan manusia memandang dan memperhatikan langit dan bumi beserta isinya, serta mempelajari sifat-sifatnya. Misalnya, perhatikanlah matahari bersinar dan bulan bercahaya, sampai di mana manfaat dan faedah sinar dan cahaya itu bagi kehidupan seluruh makhluk yang ada. Perhatikanlah binatang ternak yang digembalakan di padang rumput, tumbuh-tumbuhan yang menghijau, gunung-gunung yang tinggi kokoh menjulang yang menyejukkan mata orang yang memandangnya; laut yang terhampar luas membiru; langit dan segala isinya. Semuanya tumbuh, berkembang, tetap dalam kelangsungan hidup dan wujudnya, serta berkesinambungan dan mempunyai sistem, hukum, dan peraturan yang sangat rapi. Sistem itu tidak terlepas dari sistem hukum dan peraturan yang lebih besar daripadanya yaitu yang berlaku pada seluruh alam yang fana ini. Cobalah pikirkan dan renungkan, apakah ada cacat atau cela pada makhluk yang diciptakan Allah, demikian juga pada sistem, hukum dan peraturan yang berlaku padanya? Mahabesar dan Maha Pencipta Allah, Tuhan seru sekalian alam, tiada suatu cacat atau cela pun terdapat pada makhluk yang diciptakan-Nya.\n\nKemudian seolah-olah Allah melanjutkan pertanyaan-Nya kepada manusia apakah mereka masih ragu tentang kekuasaan dan kebesaran-Nya? Apakah manusia masih ragu tentang sistem, hukum, dan peraturan yang dibuat untuk makhluk-Nya, termasuk di dalamnya mereka sendiri? Jika masih ragu, manusia diperintahkan untuk memperhatikan, merenungkan, dan mempelajari kembali dengan sebenar-benarnya. Apakah mereka masih mendapatkan dalam ciptaan Allah itu sebagian yang tidak sempurna?\n\nDari pertanyaan yang dikemukakan ayat ini, dapat dipahami bahwa seakan-akan Allah menantang manusia, agar mencari (kalau ada) sedikit saja kekurangan dan ketidaksempurnaan pada ciptaan-Nya. Seandainya ada kekurangan, cacat, dan cela dalam ciptaan Allah, maka manusia pantas untuk mengingkari keesaan dan kekuasaan-Nya. Akan tetapi, mereka kagum dan mengakui kerapian ciptaan Allah itu, bahkan mereka mengakui kelemahan mereka. Jika demikian halnya, maka keingkaran mereka itu bukanlah ditimbulkan karena ketidakpercayaan mereka kepada Allah, tetapi semata-mata karena kesombongan dan keangkuhan mereka semata.",
      "text_translation": "Yang menciptakan tujuh langit berlapis-lapis. Tidak akan kamu lihat sesuatu yang tidak seimbang pada ciptaan Tuhan Yang Maha Pengasih. Maka lihatlah sekali lagi, adakah kamu lihat sesuatu yang cacat?",
      "text": "الَّذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ طِبَاقًاۗ مَا تَرٰى فِيْ خَلْقِ الرَّحْمٰنِ مِنْ تَفٰوُتٍۗ فَارْجِعِ الْبَصَرَۙ هَلْ تَرٰى مِنْ فُطُوْرٍ ",
      "text_translation_en": "[Hallowed be] He who has created seven heavens in full harmony with one another: no fault will thou see in the creation of the Most Gracious. And turn thy vision [upon it] once more: canst thou see any flaw?",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "God's question to humans in the above verse was answered by God himself in this verse by saying that even if humans repeatedly pay attention, study, and contemplate all of God's creation, surely he will not find flaws and defects, even in the slightest. If they continue to do so, even their entire life and lives are used to it, eventually he will only feel and will not find flaws, until he dies and returns to his Lord. From this verse, it can be understood that no human being can look for flaws in God's creation. If any of us is capable, this means that he knows all of Allah's knowledge. Until now no one knows about it and no one can have the whole knowledge of Allah. If there is among humans who are considered the most knowledgeable, then the knowledge he knows is only a small part of Allah's knowledge. However, many people do not want to be aware of their weaknesses and shortcomings, so they continue to deny Him.",
      "text_tafsir": "Pertanyaan Allah kepada manusia pada ayat di atas dijawab sendiri oleh Allah pada ayat ini dengan mengatakan bahwa sekali pun manusia berulang-ulang memperhatikan, mempelajari, dan merenungkan seluruh ciptaan Allah, pasti ia tidak akan menemukan kekurangan dan cacat, walau sedikit pun. Jika mereka terus-menerus melakukan yang demikian itu, bahkan seluruh hidup dan kehidupannya digunakan untuk itu, akhirnya ia hanya akan merasa dan tidak akan menemukan kekurangan, sampai ia mati dan kembali kepada Tuhannya.\n\nDari ayat ini, dapat dipahami bahwa tidak ada seorang pun di antara manusia yang sanggup mencari kekurangan pada ciptaan Allah. Jika ada di antara manusia yang sanggup, hal ini berarti bahwa dia mengetahui seluruh ilmu Allah. Sampai saat ini belum ada seorang pun yang mengetahuinya dan tidak akan ada seorang pun yang dapat memiliki seluruh ilmu Allah. Seandainya ada di antara manusia yang dianggap paling luas ilmunya, maka ilmu yang diketahuinya itu hanyalah merupakan sebahagian kecil dari ilmu Allah. Akan tetapi, banyak di antara manusia yang tidak mau menyadari kelemahan dan kekurangannya, sehingga mereka tetap ingkar kepada-Nya.",
      "text_translation": "Kemudian ulangi pandangan(mu) sekali lagi (dan) sekali lagi, niscaya pandanganmu akan kembali kepadamu tanpa menemukan cacat dan ia (pandanganmu) dalam keadaan letih.",
      "text": "ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ اِلَيْكَ الْبَصَرُ خَاسِئًا وَّهُوَ حَسِيْرٌ ",
      "text_translation_en": "Yea, turn thy vision [upon it] again and yet again: [and every time] thy vision will fall back upon thee, dazzled and truly defeated….",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "Having declared that there is no shortage in His creation, God affirms that He is the Almighty, the Almighty, saying that He has adorned the heavens which are near to the earth with the bright sunshine of the sun, moon and stars shining. at night, which is visible to man every day and night. The sun, moon, and shining stars were seen by men as if they were houses of glittering lights at night, so that they could see. The parable presented in the above verse is a beautiful and direct illustration of its purpose. That is, the universe is like home. Home is a place where people live, where they take shelter from the sun and shelter in the rain, where they have fun and rest, where they raise their children, and so on. Thus this nature was created by God for the benefit of mankind as a whole. The stars, in addition to decorating the sky, can also create flames that can be used to cast cursed demons that steal the talk of the inhabitants of the sky. Some scholars have interpreted this verse by saying that God created the stars as a decoration of the world and to provide sustenance for mankind, that is, day and night with all its benefits. The sustenance that man earns by day and by night, there is a cause for good and there is also a cause for evil which can incite evil. The Qatadah says that God created the stars for three purposes: first, for the decoration of the heavens; second, to cast a demon; and third, to serve as directions and addresses for travelers on the go, on land, at sea, or in this vast space. The Qatadah probably describes the purpose of Allah creating the stars as far as he knows, because there are many other purposes, both known and unknown to man. Allah is infinite in His knowledge and Wise. Thus God created the stars that adorn the countless universe. All of these can be used by humans according to their desires. If the desire to be fulfilled is a desire that is in accordance with God's will, then God will open the way for it to be fulfilled and give him abundant rewards. On the contrary, if the desire to be fulfilled is a desire contrary to the will of Allah, then there is a painful torment to them.",
      "text_tafsir": "Setelah menyatakan bahwa tidak terdapat kekurangan sedikit pun dalam ciptaan-Nya, Allah menegaskan bahwa Dialah Tuhan Yang Mahakuasa lagi Mahaagung, dengan mengatakan bahwa Dia telah menghias langit yang terdekat ke bumi dengan matahari yang bercahaya terang pada siang hari, bulan dan bintang-bintang yang bersinar pada malam hari, yang dapat dilihat oleh manusia setiap datangnya siang dan malam. Langit yang berhiaskan matahari, bulan, dan bintang-bintang yang bersinar itu terlihat oleh manusia seakan-akan rumah yang berhiaskan lampu-lampu yang gemerlapan di malam hari, sehingga menyenangkan hati orang yang memandangnya. \n\nPerumpamaan yang dikemukakan ayat di atas merupakan perumpamaan yang indah dan langsung mengenai sasarannya. Yaitu bahwa alam semesta ini diumpamakan seperti rumah. Rumah merupakan tempat tinggal manusia, tempat mereka berlindung dari terik matahari dan tempat berteduh di waktu hujan, tempat mereka bersenang-senang dan beristirahat, tempat mereka membesarkan anak-anak mereka, dan sebagainya. Demikianlah alam ini diciptakan Allah untuk kepentingan manusia seluruhnya.\n\nBintang-bintang itu di samping menghiasi langit, juga dapat menimbulkan nyala api yang dapat digunakan untuk melempari setan terkutuk yang mencuri dengar pembicaraan penduduk langit.\n\nSebagian ulama ada yang menafsirkan ayat ini dengan mengatakan bahwa Allah menciptakan bintang-bintang sebagai hiasan dunia dan untuk menimbulkan rezeki bagi manusia, yaitu dengan adanya siang dan malam dengan segala macam manfaatnya yang dapat diperoleh darinya. Rezeki yang diperoleh manusia karena adanya siang dan malam itu, ada yang menjadi sebab timbulnya kebaikan dan ada pula yang menjadi sebab timbulnya kejahatan yang dapat mengobarkan nafsu jahat.\n\nQatadah mengatakan bahwa Allah menciptakan bintang-bintang itu dengan tiga tujuan, yaitu: pertama, untuk hiasan langit; kedua, untuk melempar setan; dan ketiga, untuk menjadi petunjuk arah dan alamat bagi para musafir yang sedang dalam perjalanan, baik di darat, laut, maupun di ruang angkasa yang sangat luas ini. Barangkali Qatadah menerangkan di antara tujuan Allah menciptakan bintang-bintang sejauh yang ia ketahui, karena masih banyak tujuan yang lain, baik yang telah diketahui maupun yang belum diketahui oleh manusia. Allah Mahaluas ilmu-Nya lagi Mahabijaksana.\n\nDemikianlah Allah menciptakan bintang-bintang yang menghiasi alam raya yang tidak terhitung banyaknya. Semua itu dapat dimanfaatkan manusia sesuai dengan keinginan yang hendak dicapainya. Jika keinginan yang hendak dicapai itu adalah keinginan yang sesuai dengan keridaan Allah, tentu Allah akan melapangkan jalan bagi tercapainya keinginan itu dan memberinya pahala yang berlipat-ganda. Sebaliknya jika keinginan yang hendak dicapai itu adalah keinginan yang berlawanan dengan keridaan Allah, maka bagi mereka disediakan azab yang pedih.",
      "text_translation": "Dan sungguh, telah Kami hiasi langit yang dekat, dengan bintang-bintang dan Kami jadikannya (bintang-bintang itu) sebagai alat-alat pelempar setan, dan Kami sediakan bagi mereka azab neraka yang menyala-nyala.",
      "text": "وَلَقَدْ زَيَّنَّا السَّمَاۤءَ الدُّنْيَا بِمَصَابِيْحَ وَجَعَلْنٰهَا رُجُوْمًا لِّلشَّيٰطِيْنِ وَاَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيْرِ ",
      "text_translation_en": "And, indeed, We have adorned the skies nearest to the earth with lights, and have made them the object of futile guesses for the evil ones [from among men]: and for them have We readied suffering through a blazing flame –",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "It has become a rule and a precept that every one who associates with and rejects Allah, and rejects the apostles whom He has sent, will be cast into hell. Hell is the worst place for them. In it they will experience great pain and torment and pain. Then Allah described the attitude of hell when the infidels were put in it, that is: 1. When the infidels were cast into it, the sound of their roar was heard as a sign of rage. 2.The hell is boiling, like a big pot boiling the unbelievers with boiling water. 3. Hell is about to break when the heathen are thrown into it. 4. The hell is fierce and angry with everyone in it. 5. Whenever a company of infidels was included, the guardians of hell scoffed at them, \"Has no messenger ever come to you? Why do you not follow the orders of the apostles who were sent to you?\" 6. The people of hell admit that the apostles have come to them, but they deny it; even accusing the apostles of being in the wrong",
      "text_tafsir": "Telah menjadi ketetapan dan sunatullah bahwa setiap orang yang menyekutukan dan mengingkari Allah, serta mendustakan para rasul yang diutus-Nya, akan dimasukkan ke dalam neraka. Neraka itulah tempat yang paling buruk yang disediakan bagi mereka. Di dalamnya mereka akan merasakan penderitaan dan siksaan yang amat pedih dan menyengsarakan.\n\nKemudian Allah menerangkan sikap neraka pada waktu orang-orang kafir dimasukkan ke dalamnya, yaitu:\n\n1.Ketika orang-orang kafir dilemparkan ke dalamnya, terdengarlah suaranya yang gemuruh lagi dahsyat sebagai tanda kemarahannya.\n\n2.Neraka itu menggelegak, laksana periuk besar merebus orang-orang kafir dengan airnya yang mendidih.\n\n3.Neraka itu seakan-akan hampir pecah waktu orang-orang kafir dilemparkan ke dalamnya.\n\n4.Neraka itu sangat ganas dan marah kepada setiap orang yang berada di dalamnya.\n\n5.Setiap kali rombongan orang kafir dimasukkan ke dalamnya, penjaga-penjaga neraka itu mencerca mereka, \"Belum pernahkah seorang rasul datang kepada kamu. Kenapa kamu tidak mengikuti seruan para rasul yang disampaikan kepadamu?\"\n\n6.Penduduk neraka mengakui bahwa telah datang rasul-rasul kepada mereka, akan tetapi mereka mendustakannya; bahkan menuduh bahwa para rasul itulah yang berada dalam kesesatan",
      "text_translation": "Dan orang-orang yang ingkar kepada Tuhannya akan mendapat azab Jahanam. Dan itulah seburuk-buruk tempat kembali.",
      "text": "وَلِلَّذِيْنَ كَفَرُوْا بِرَبِّهِمْ عَذَابُ جَهَنَّمَۗ وَبِئْسَ الْمَصِيْرُ",
      "text_translation_en": "for, suffering in hell awaits all who are [thus] bent on blaspheming against their Sustainer: and how vile a journey's end!",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "In this verse, the state of hell is described as a place provided for unbelievers and their attitude when they are cast into it. As the heathen were thrown into it, they heard a very loud and terrifying roar. The hell sounded like it was like a big pot and the heathen boiled in it with boiling water and boiled over the heat.",
      "text_tafsir": "Dalam ayat ini, diterangkan keadaan neraka sebagai tempat yang disediakan bagi orang-orang kafir serta sikapnya ketika mereka dilemparkan ke dalamnya. Pada waktu orang-orang kafir dilemparkan ke dalamnya, terdengarlah oleh mereka suara gemuruh yang amat dahsyat dan menakutkan. Neraka itu terdengar menggelegak seakan-akan seperti periuk besar dan orang-orang kafir direbus di dalamnya dengan air yang mendidih dan menggelegak karena panasnya.",
      "text_translation": "Apabila mereka dilemparkan ke dalamnya mereka mendengar suara neraka yang mengerikan, sedang neraka itu membara,",
      "text": "اِذَآ اُلْقُوْا فِيْهَا سَمِعُوْا لَهَا شَهِيْقًا وَّهِيَ تَفُوْرُۙ",
      "text_translation_en": "When they are cast into that [hell], they will hear its breath indrawing as it boils up,",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "It is further explained that the hell received the unbelievers with great anger. They were so angry that they almost broke into pieces. In that case, the Zabaniyah's angels scoffed at them and said, \"Has not Allah sent you a messenger who warns you of the doom of the Day of Judgment which is upon you today?\" It also shows that God will not punish a people, only after He has sent an apostle and they do not heed the call. In another verse, God says: But we will not suffer until We send an apostle. (al-Isra '\/ 17: 15) It is understood from this verse that men are required to carry out the commands of God and abandon His prohibitions if they have been sent to them by the Messenger of God. This happens whether the call is delivered directly or indirectly, by the mediation of those who have believed in him.",
      "text_tafsir": "Selanjutnya diterangkan bahwa neraka itu menerima orang-orang kafir dengan kemarahan yang sangat. Demikian marahnya, sehingga hampir saja mereka itu pecah berkeping-keping. Dalam keadaan demikian, malaikat Zabaniyah pun mencela dan mencerca mereka, \"Tidak pernahkah datang kepada kamu seorang rasul yang diutus Allah yang memperingatkan kamu kepada azab hari Kiamat yang menimpamu pada saat ini?\" Hal ini juga menunjukkan bahwa Allah tidak akan mengazab suatu kaum, melainkan setelah Dia mengutus seorang rasul dan mereka tidak mengindahkan seruan itu. Dalam ayat yang lain, Allah berfirman:\n\n¦tetapi Kami tidak akan menyiksa sebelum Kami mengutus seorang rasul. (al-Isra'\/17: 15)\n\nDari ayat ini dapat dipahami bahwa manusia dituntut melaksanakan perintah-perintah Allah dan meninggalkan larangan-larangan-Nya jika telah disampaikan kepada mereka seruan rasul yang diutus kepada mereka. Hal ini berlaku baik seruan itu disampaikan secara langsung maupun tidak langsung, yaitu dengan perantaraan orang-orang yang telah beriman kepada-Nya.",
      "text_translation": "hampir meledak karena marah. Setiap kali ada sekumpulan (orang-orang kafir) dilemparkan ke dalamnya, penjaga-penjaga (neraka itu) bertanya kepada mereka, “Apakah belum pernah ada orang yang datang memberi peringatan kepadamu (di dunia)?”",
      "text": "تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِۗ كُلَّمَآ اُلْقِيَ فِيْهَا فَوْجٌ سَاَلَهُمْ خَزَنَتُهَآ اَلَمْ يَأْتِكُمْ نَذِيْرٌۙ",
      "text_translation_en": "well-nigh bursting with fury; [and] every time a host [of such sinners] is flung into it, its keepers will ask them, \"Has no warner ever come to you?\"",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "In this verse it is explained that the angels' questions were answered by the disbelievers who were confessing that a messenger had come to them. He read to them the verses of God and warned them of the consequences of those who would not respond to them. However, they denied and even ridiculed the apostles by saying; O people who have professed to receive revelation from Allah. Truly, Allah has not revealed any revelation to you because you are not a messenger sent to us. You are just a normal human being just like us, even though you are poorer and lesser than us. All of the words you have spoken to us are of no use at all, even though all of you admit that as apostles sent by God, they are the ones in great error. \"In another verse, God says: Those who disbelieved were dragged to Hell, so that when they came to it (the gates) were opened, and the watchmen said to them, \"Have there not come to you apostles from among you who read the words of your Lord?\" and warned you of this (day) meeting? \"They answered,\" Yes, there is, \"but the punishment of the disbelievers will surely be on the unbelievers.",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa pertanyaan para malaikat itu dijawab oleh orang-orang kafir yang sedang diazab itu dengan mengakui bahwa telah datang kepada mereka seorang rasul. Dia telah membacakan kepada mereka ayat-ayat Tuhan dan telah memperingatkan mereka akibat yang akan diterima oleh orang-orang yang tidak memperkenankan seruan itu. Akan tetapi, mereka mendustakan dan bahkan mengejek para rasul itu dengan mengatakan; Hai orang yang telah mengaku menerima wahyu dari Allah. Sebenarnya tidak ada sesuatu wahyu pun yang diturunkan Allah kepadamu karena engkau bukanlah seorang rasul yang diutus kepada kami. Engkau hanyalah manusia biasa seperti kami juga, bahkan engkau lebih miskin dan lebih rendah derajatnya daripada kami. Tidak ada guna dan faedahnya sedikit pun semua perkataan yang engkau ucapkan itu bagi kami, bahkan kamu seluruhnya yang mengaku bahwa sebagai rasul yang diutus oleh Tuhan, sebetulnya adalah orang-orang yang berada dalam kesesatan yang besar.\" Pada ayat yang lain, Allah berfirman:\n\nOrang-orang yang kafir digiring ke neraka Jahanam secara berombongan. Sehingga apabila mereka sampai kepadanya (neraka) pintu-pintunya dibukakan dan penjaga-penjaga berkata kepada mereka, \"Apakah belum pernah datang kepadamu rasul-rasul dari kalangan kamu yang membacakan ayat-ayat Tuhanmu dan memperingatkan kepadamu akan pertemuan (dengan) harimu ini?\" Mereka menjawab, \"Benar, ada,\" tetapi ketetapan azab pasti berlaku terhadap orang-orang kafir. (az-Zumar\/39: 71)",
      "text_translation": "Mereka menjawab, “Benar, sungguh, seorang pemberi peringatan telah datang kepada kami, tetapi kami mendustakan(nya) dan kami katakan, “Allah tidak menurunkan sesuatu apa pun, kamu sebenarnya di dalam kesesatan yang besar.”",
      "text": "قَالُوْا بَلٰى قَدْ جَاۤءَنَا نَذِيْرٌ ەۙ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ اللّٰهُ مِنْ شَيْءٍۖ اِنْ اَنْتُمْ اِلَّا فِيْ ضَلٰلٍ كَبِيْرٍ",
      "text_translation_en": "They will reply: \"Yea, a warner did indeed come unto us, but we gave him the lie and said, 'Never has God sent down anything [by way of revelation]! You [self-styled warners] are but lost in a great delusion!\"'",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "In this verse, God explains that the unbelievers who are being sanctified in hell regret their attitudes and actions throughout life, saying, \"If we would use our God-given intellect and mind, to evaluate and benefit from the apostle's call, so if we were to use our ears to hear the words of God that were sent down and communicated to us by the messenger he sent, we would not deny and deny the truth. and the influence of this mortal world will not be overpowered by the deception of the devil, and will not be subjected to this fiery hell for which we have no suffering. \"",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa orang-orang kafir yang sedang diazab di dalam neraka itu menyesali sikap dan tindakan mereka selama hidup di dunia dengan mengatakan, \"Sekiranya kami mau menggunakan akal dan pikiran kami yang telah dianugerahkan Allah, untuk menilai dan mengambil manfaat dari seruan rasul itu, demikian pula seandainya kami menggunakan telinga kami untuk mendengar ayat-ayat Allah yang telah diturunkan dan disampaikan kepada kami oleh rasul yang telah diutus-Nya, tentu kami tidak akan menyangkal dan mengingkari kebenaran yang disampaikan itu. Kami tidak akan tepedaya oleh kesenangan dan pengaruh dunia yang fana ini, tidak akan teperdaya oleh tipu daya setan, dan tidak akan dimasukkan ke dalam neraka yang menyala ini yang azabnya tidak tertanggungkan sedikit pun oleh kami.\"",
      "text_translation": "Dan mereka berkata, “Sekiranya (dahulu) kami mendengarkan atau memikirkan (peringatan itu) tentulah kami tidak termasuk penghuni neraka yang menyala-nyala.”",
      "text": "وَقَالُوْا لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِيْٓ اَصْحٰبِ السَّعِيْرِ",
      "text_translation_en": "And they will add: \"Had we but listened [to those warnings], or [at least] used our own reason, we would not [now] be among those who are destined for the blazing flame!\"",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "In this verse, God also explains that even the unbelievers who are being punished in hell confess their sinful acts while living in the world and declare their true repentance, but their confession and declaration are of no avail. . For this reason, the repentance which God accepts is the only remorse that a person commits during his life on earth, provided that: 1. Abandon sin immediately. 2. Repent of any sin that has been committed. 3. The Promise will not commit the sin that he has committed and any other acts which God has forbidden. In the Hereafter, those disbelievers have been kept away from the grace of God so that whatever His mercy, such as forgiveness of sins, happiness of life, etc., will never be recaptured. Only destruction will overtake them. From this verse it can be understood that the call to obey the religion of God and to follow the call of the apostle has reached almost everywhere in this world and to all mankind. In the meantime, the religious teachings conveyed by the apostles are easily accepted and practiced by any gifted and rational person, since the purpose of the religious teaching is to benefit humanity in life here and in the hereafter, not to burden and narrow it. In addition, religious teachings are easy to accept because they are easy to understand and in accordance with human reason. However, because of their lust, their position, their rank, their wealth, and their desire for sympathy, honor, and more so with the temptations of the devil whose sole purpose is to mislead mankind, they do not heed that call. As a result, they are rewarded for their disbelief and disobedience. How many people once believed and practiced Islam well but then under the influence of lust and the devil's temptations, they did not shy away from the beliefs and beliefs that had grown in their hearts, and they did not dare to destroy Islam. and Muslims. God himself reminds them by giving them trials of fun and suffering, but they only realize it until they are gone. After that, they returned to reject the teachings and call of the apostles. Therefore, it is proper that in the hereafter they will not receive help from God and will be kept away from His mercy.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan pula bahwa sekalipun orang-orang kafir yang sedang diazab di dalam neraka itu telah mengakui perbuatan dosa yang telah mereka lakukan selama hidup di dunia dan menyatakan tobat dengan sesungguhnya, namun pengakuan dan pernyataan tobat mereka itu tidak ada manfaatnya sedikit pun. Sebab, tobat yang diterima Allah hanyalah tobat yang dilakukan oleh seseorang pada waktu ia hidup di dunia, dengan syarat:\n\n1.Meninggalkan dosa yang dilakukan dengan segera.\n\n2.Menyesali perbuatan dosa yang telah dilakukan.\n\n3.Berjanji tidak akan melakukan perbuatan dosa yang telah dikerjakannya dan perbuatan-perbuatan yang lain yang dilarang oleh Allah.\n\nDi akhirat, orang-orang kafir itu telah dijauhkan dari rahmat Allah sehingga apa pun yang berupa rahmat-Nya, seperti pengampunan dosa, kebahagiaan hidup, dan lain-lain, tidak akan mereka dapatkan lagi. Hanya kebinasaan yang akan menimpa mereka.\n\nDari ayat ini dapat dipahami bahwa sebenarnya seruan agar menganut agama Allah dan mengikuti seruan rasul itu telah sampai kepada hampir seluruh tempat di dunia ini dan kepada seluruh manusia. Sementara itu, ajaran agama yang disampaikan rasul itu mudah diterima dan dilaksanakan oleh manusia mana pun yang telah balig dan berakal, karena tujuan ajaran agama itu ialah untuk kemaslahatan umat manusia dalam hidup di dunia dan di akhirat nanti, bukan untuk memberatkan dan menyempitkan. Di samping itu, ajaran agama itu mudah diterima akal yang sehat karena sifatnya yang mudah dimengerti dan sesuai dengan akal budi manusia. Akan tetapi, karena hawa nafsu, kedudukan, pangkat, harta, dan ingin mendapat simpati, kehormatan, dan ditambah lagi dengan godaan setan yang tujuannya hanyalah untuk menyesatkan manusia, mereka tidak mengindahkan seruan itu. Akibatnya, mereka mendapat balasan yang setimpal dengan kekafiran dan keingkaran mereka itu. Betapa banyak orang yang tadinya telah beriman dan melakukan ajaran agama Islam dengan baik tetapi kemudian karena pengaruh hawa nafsu dan godaan setan, mereka tidak segan-segan meninggalkan kepercayaan dan keyakinan yang telah tumbuh dengan subur dalam hati mereka, bahkan mereka tidak segan-segan menghancurkan Islam dan kaum Muslimin.\n\nAllah sendiri selalu mengingatkan mereka dengan memberikan cobaan-cobaan berupa kesenangan dan penderitaan, tetapi mereka hanya sadar sampai cobaan itu hilang dari mereka. Setelah itu, mereka kembali mengingkari ajaran dan seruan rasul. Oleh karena itu, sudah sepantasnya jika di akhirat nanti mereka tidak akan mendapat pertolongan dari Allah dan akan dijauhkan dari rahmat-Nya.",
      "text_translation": "Maka mereka mengakui dosanya. Tetapi jauhlah (dari rahmat Allah) bagi penghuni neraka yang menyala-nyala itu.",
      "text": "فَاعْتَرَفُوْا بِذَنْۢبِهِمْۚ فَسُحْقًا لِّاَصْحٰبِ السَّعِيْرِ ",
      "text_translation_en": "Thus will they come to realize their sins: but [by that time,] remote will have become all good from those who are destined for the blazing flame.",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "This verse describes the signs of those who are obedient and obedient to God, and believe that God knows everything they do, both visible and hidden. The signs are: 1.Always fearing the torment of Allah even though it is a supernatural, invisible and uncertain when it comes. 2. Fearing the coming of the Day of Judgment, remembering the calamity that would befall them if it were to disobey God, such as would happen on the day of reckoning, the day of vengeance, and the torment of the unseen hell. 3. Believe and believe that God always watches, watches, and knows where and how they are at every moment. In the hadith of the Prophet Muhammad, it is said: From Abu Hurairah he said, Allah's Messenger (may peace be upon him) said, \"There shall not be hell for anyone who cries for fear of Allah.\" Those who truly believe in Allah and do good deeds have no concern for themselves and they do not grieve over anything that is wrong with them, as Allah says: Indeed, those who believe, do good deeds, perform prayers , and in performing alms, they receive the reward of their Lord, and there is no fear of them and they do not grieve. They believe that He sees and cares for them, as the Prophet Muhammad said in the context of courtesy: You worship Allah as if you saw Him, then if you do not see Him, then indeed Allah sees you. (History of al-Bukhari, Muslim, and Abu Hurairah) Allah promises that such believers will be forgiven of their sins and will be rewarded with great reward in the hereafter.",
      "text_tafsir": "Ayat ini menerangkan tanda-tanda orang bertakwa yang tunduk dan patuh kepada Allah, dan yakin bahwa Allah mengetahui segala yang mereka lakukan baik yang tampak maupun yang tersembunyi.\n\nTanda-tanda itu ialah:\n\n1.Senantiasa takut kepada azab Allah walaupun azab itu merupakan suatu yang gaib, tidak tampak dan belum tentu kapan datangnya.\n\n2.Merasa takut akan kedatangan hari Kiamat, karena mengingat malapetaka yang akan terjadi pada diri mereka seandainya mengingkari Allah, seperti peristiwa yang akan terjadi pada hari perhitungan, hari pembalasan, dan azab neraka yang tiada terkirakan.\n\n3.Yakin dan percaya bahwa Allah selalu mengawasi, memperhatikan, dan mengetahui di mana dan dalam keadaan bagaimana mereka setiap saat.\n\nDalam hadis Nabi Muhammad disebutkan:\n\nDari Abu Hurairah ia berkata, Rasulullah saw bersabda, \"Tak akan masuk neraka seseorang yang menangis karena takut kepada Allah. (Riwayat at-Tirmidhi, an-Nasa'i, Ahmad, al-hakim, dan lainnya)\n\nOrang yang benar-benar beriman kepada Allah dan mengerjakan amal yang saleh, tidak ada kekhawatiran terhadap diri mereka dan mereka tidak bersedih hati terhadap segala sesuatu yang luput dari mereka, sebagaimana firman Allah:\n\nSungguh, orang-orang yang beriman, mengerjakan kebajikan, melaksanakan salat, dan menunaikan zakat, mereka mendapat pahala di sisi Tuhannya. Tidak ada rasa takut pada mereka dan mereka tidak bersedih hati. (al-Baqarah\/2: 277)\n\nOrang-orang yang beriman dan taat kepada Allah selalu merasa mendapat pengawasan dari-Nya. Mereka yakin bahwa Dia melihat dan memperhatikan mereka, sebagaimana yang diucapkan Nabi Muhammad dalam konteks ihsan:\n\nEngkau beribadah kepada Allah seakan-akan kamu melihat-Nya, maka jika kamu tidak melihat-Nya, maka sesungguhnya Allah melihatmu. (Riwayat al-Bukhari, Muslim, dan Abu Hurairah)\n\nAllah menjanjikan bahwa orang-orang mukmin yang bersifat demikian akan diampuni dosa-dosanya dan akan diberi pahala yang besar di akhirat kelak.",
      "text_translation": "Sesungguhnya orang-orang yang takut kepada Tuhannya yang tidak terlihat oleh mereka, mereka memperoleh ampunan dan pahala yang besar. ",
      "text": "اِنَّ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ كَبِيْرٌ ",
      "text_translation_en": "[As against this,] behold, for those who stand in awe of God although He is beyond the reach of their perception, there is forgiveness in store and a great reward.",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "According to Ibn 'Abbas' story, he said, \"At one time the Muslims used to mock the Prophet Muhammad and insult him, and Allah sent down to him all that they talked about. \"You did not hear it from God.\" Then this verse goes down, which explains that nothing is lost from the knowledge of God. In this verse, God again explains that He knows all the secrets and all that is born of the servants. -Yes, whether it be words, deeds, or whatever the heart and the senses feel, all of which do not escape the knowledge of God, because He is all-knowing. God, with a loud voice, whispering, gentle and with a heart attitude will be known to God.",
      "text_tafsir": "Menurut riwayat Ibnu 'Abbas, ia berkata, \"Pada suatu ketika orang-orang musyrikin mempergunjingkan Nabi Muhammad dan menjelek-jelekkannya, maka Allah menurunkan kepada beliau semua yang dibicarakan mereka itu. Lalu sebahagian mereka berkata kepada sebagian yang lain, \"Rendahkanlah suaramu agar kata-katamu tidak didengar oleh Tuhan Muhammad.\" Maka turunlah ayat ini yang antara lain menjelaskan bahwa tidak ada suatu apa pun yang luput dari pengetahuan Allah. \n\nPada ayat ini, Allah kembali menjelaskan bahwa Dia mengetahui segala yang dirahasiakan dan segala yang dilahirkan oleh hamba-hamba-Nya, baik berupa perkataan, perbuatan, dan segala yang dirasakan oleh hati dan panca indera. Semuanya itu tidak luput sedikit pun dari pengetahuan Allah, karena Dia Maha Mengetahui segala isi hati.\n\nDari ayat ini dapat pula diambil kesimpulan bahwa semua doa yang dipanjatkan kepada Allah, baik dengan suara keras, berbisik, lemah-lembut maupun dengan gerakan hati saja akan diketahui Allah.",
      "text_translation": "Dan rahasiakanlah perkataanmu atau nyatakanlah. Sungguh, Dia Maha Mengetahui segala isi hati. ",
      "text": "وَاَسِرُّوْا قَوْلَكُمْ اَوِ اجْهَرُوْا بِهٖۗ اِنَّهٗ عَلِيْمٌ ۢبِذَاتِ الصُّدُوْرِ ",
      "text_translation_en": "AND [know, O men, that] whether you keep your beliefs secret or state them openly, He has full knowledge indeed of all that is in [your] hearts.",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "This verse seems to warn the polytheists who do not believe in the vastness and detail of Allah's knowledge, that God knows all the contents of heaven and earth, no matter how small, no matter how far they are hidden, and knows the words that are kept secret. Truly Allah's knowledge can penetrate very thick and sturdy walls and even the most hidden things. If the disbelievers want to use their minds, surely he would argue that the one who created the entire universe, including the earth with all its contents, is God. The Creator must know the conditions and attributes of His creation, both small and large. Therefore, whatever happens to His creation, Allah knows in detail.",
      "text_tafsir": "Ayat ini seakan-akan memperingatkan orang-orang musyrik yang tidak percaya akan luas dan detilnya pengetahuan Allah, bahwa Tuhan Maha Mengetahui segala isi langit dan bumi betapa pun kecilnya, betapa pun jauh disembunyikan, serta mengetahui perkataan-perkataan yang dirahasiakan. Sesungguhnya pengetahuan Allah dapat menembus dinding yang sangat tebal dan kokoh dan sesuatu yang paling tersembunyi letaknya sekalipun.\n\nSeandainya orang-orang kafir mau menggunakan akalnya, tentu ia akan berpendapat bahwa yang menciptakan seluruh alam ini, termasuk di dalamnya bumi dengan segala isinya, adalah Allah. Pencipta itu pasti mengetahui keadaan dan sifat-sifat dari ciptaan-Nya, baik yang kecil maupun yang besar. Oleh karena itu, apa pun yang terjadi pada ciptaan-Nya, Allah mengetahuinya dengan rinci.",
      "text_translation": "Apakah (pantas) Allah yang menciptakan itu tidak mengetahui? Dan Dia Mahahalus, Maha Mengetahui.",
      "text": "اَلَا يَعْلَمُ مَنْ خَلَقَۗ وَهُوَ اللَّطِيْفُ الْخَبِيْرُ ࣖ ",
      "text_translation_en": "How could it be that He who has created [all] should not know [all]? Yea, He alone is unfathomable [in His wisdom], aware!",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "This verse describes the infinite favors of God that He has bestowed upon mankind, declaring that God created the earth and made it easy for them, that they may avail themselves of the infinite benefits of their lives. He created the earth and circled it in space. Humans live on it as if they are in a flat, quiet, unshaken place. With the rotation of the earth comes night and day, so that man can work day and night. The earth emits fountains, which supply water for human and their livestock. With that water, people irrigated their gardens and fields, as well as the ponds where they raised fish. With that water they bathe in cleansing their dirty bodies, so they feel refreshed and comfortable. He also created the hills, valleys, green mountains that enchanted the eyes of those who looked upon them. From the slopes of the hills flowed rivers and between the hills and valleys, man made paths connecting one country to another. How many favors God has bestowed upon mankind. If God had held back a human favor, such as not giving air to breathe, man would have suffered greatly. Who can deny the abundance of God's favor? According to scientists, the earth is surrounded by atmosphere. Geological processes that range from erosion, deposition, sea level rise, earthquakes, magma movement, to volcanic eruptions over a period of millions of years have allowed for mineral and energy explosion. On the other hand, the sea and the atmosphere are less dynamic. His interaction with the land and his journey with the moon around the sun shaped the climate and the seasons. These dynamic processes involving the inland sea and atmosphere allow for a hydrologic cycle which in turn reduces rainfall and causes soil fertility and formation of water reserves in the lake, river and inland. Oxygen and water, which are essential human needs, are abundant and easy to obtain. This verse states that in His mercy to all mankind, God has not only provided all the means and infrastructure for mankind. It has also made it easier for humans to live on the surface of the earth. Humans are commanded by God to walk the earth to know its place, its inhabitants, its people, its animals and its plants. Humans are not only provided with air, plants, animals, and the weather, but they are provided with the tools and conveniences to seek sustenance on the earth with all that is on it and within it. After God explained that nature was created for man and made it easy for their needs, He commanded them to walk the earth, to look at the beauty of nature, to strive for this simple nature, to trade, to breed, to cultivate and to seek halal sustenance. Therefore, all that God provides must be cultivated and put into action before it can be used for human life. By understanding this verse, it is possible to convey the following: 1. God commands that humans strive and cultivate nature for their benefit in order to obtain halal sustenance. This means that we are not trying to be lazy and contrary to God's commands. 2. Since striving for and seeking sustenance includes carrying out the orders of Allah, then those who seek and seek sustenance are those who obey Allah, and that includes worship. In other words, striving for and seeking sustenance does not reduce worship, but strengthens and multiplies the worship itself. Ahmad narrated from 'Umar bin al-Khaththab, when he heard the Messenger of Allah (may peace be upon him) say: If you are truly dependent on Allah, then you will be given the sustenance as Allah gives His sustenance to the birds. He goes to find sustenance on an empty stomach, and in the evening he returns to his den with a full belly. (History of at-Tirmidhi, Ahmad, al-Baihaqi, and Abu Dawud of 'Umar bin al-Khaththab) This hadith shows that time from dawn to dusk is the time to seek sustenance, as the birds have done. If man really wanted to work from morning till evening surely God would give him sustenance. They won't starve. From this hadith it is also understood that those who do not want to try will not be provided by Allah. Narrated by al-judge and at-Tirmidhi of Mu'awiyah bin Qurrah, he said, \"One day 'Umar bin Khaththab was passing through the village of a people, and he asked the people,\" Who are you? \" are those who trust in Allah. \"Umar said,\" You are not those who trust in Allah, but those who have been consumed. But those who depend on Allah are those who plant seeds in the soil, and they depend on Allah. \"In seeking the sustenance of the Islamic teachings, some guidelines are given: 1.To every man should seek to satisfy his own and his family's needs. from his house in the morning to seek sustenance, including those whom the Prophet Muhammad prayed for to be blessed by Allah. The Prophet Muhammad said, \"O Allah, bless my people who go forth in the morning.\" (At-Tirmidhi History of sakhr bin al-Gamidi ) 2. In the endeavor to seek the lawful means to seek sustenance in the ways that are lawful, not by stealing, cheating, corruption, etc. The sought-after provisions are lawful, not illegal, such as living room, carcass, carcass , and so on, according to the hadith: From Ali, the Messenger of Allah (may peace be upon him) said, \"Verily Allah Ta'ala is pleased to see his servant, in search of halal.\" brani) Another hadith explains: From Anas bin Malik that the Prophet said, \"Seeking the sustenance of the lawful for every Muslim.\" (At the end of the verse) Allah warns mankind that all beings will return to Him. on the Day of Judgment, and at that time all human deeds will be weighed. Good deeds are rewarded with double rewards, while bad deeds are rewarded with the torment of hell. Therefore, people should always be self-aware, try to perform as many good deeds as possible and evaluate and research the acts to be performed, seeking forgiveness from God for wrongdoing or unknowingly that such acts are prohibited by God. So every Muslim in his religion is looking for a justifiable sustenance, never eating the sustenance obtained in an illegal way or his own property being an illegal thing. Remember that all beings without exception will return to Him. Allah is All-Knowing.",
      "text_tafsir": "Ayat ini menerangkan nikmat Allah yang tiada terhingga yang telah dilimpahkan-Nya kepada manusia, dengan menyatakan bahwa Allah telah menciptakan bumi dan memudahkannya untuk mereka, sehingga mereka dapat mengambil manfaat yang tidak terhingga untuk kepentingan hidup mereka. Dia menciptakan bumi itu bundar dan melayang-layang di angkasa luas. Manusia tinggal di atasnya seperti berada di tempat yang datar terhampar, tenang, dan tidak bergoyang. Dengan perputaran bumi terjadilah malam dan siang, sehingga manusia dapat berusaha pada siang hari dan beristirahat pada malam hari. Bumi memancarkan sumber-sumber mata air, yang mengalirkan air untuk diminum manusia dan binatang ternak peliharaannya. \n\nDengan air itu pula manusia mengairi kebun-kebun dan sawah-sawah mereka, demikian pula kolam-kolam tempat mereka memelihara ikan. Dengan air itu pula mereka mandi membersihkan badan mereka yang telah kotor, sehingga mereka merasa segar dan nyaman. Diciptakan-Nya pula bukit-bukit, lembah-lembah, gunung-gunung yang menghijau yang menyejukkan hati orang yang memandangnya. Dari celah-celah bukit itu mengalirlah sungai-sungai dan di antara bukit-bukit dan lembah-lembah itu manusia membuat jalan-jalan yang menghubungkan suatu negeri dengan negeri yang lain. Alangkah banyaknya nikmat yang telah dilimpahkan Allah kepada manusia. Seandainya Allah menahan suatu nikmat saja kepada manusia, misalnya tidak memberikan udara yang akan dihirup, manusia akan mengalami penderitaan yang sangat. Siapakah yang dapat mengingkari nikmat Allah yang demikian banyaknya itu?\n\nMenurut para saintis, bumi yang diseliputi atmosfer sangat dinamis. Proses-proses geologi yang mencakup dari proses erosi, pengendapan, naik-turun muka laut, gempa bumi, pergerakan magma, sampai ke letusan gunung api dalam rentang waktu jutaan tahun telah memungkinkan terjadinya cebakan-cebakan mineral maupun energi. Di bagian lain, laut dan atmosfer pun tak kalah dinamisnya. Interaksinya dengan daratan dan perjalanannya bersama bulan mengitari matahari membentuk iklim dan musim. Proses-proses dinamis yang melibatkan daratan-laut dan atmosfer tersebut memungkinkan terjadinya siklus hidrologi yang pada gilirannya menurunkan hujan dan menyebabkan kesuburan tanah serta terbentuknya cadangan air baik di danau, sungai maupun dalam tanah. Oksigen dan air yang merupakan kebutuhan vital manusia tersedia melimpah dan amat mudah didapatkannya. \n\nAyat ini menyatakan bahwa dengan sifat rahman-Nya kepada seluruh umat manusia, maka Allah bukan saja telah menyediakan seluruh sarana dan prasarana bagi manusia. Ia juga telah memudahkan manusia untuk hidup di permukaan bumi. Manusia diperintahkan Allah untuk berjalan di permukaan bumi untuk mengenali baik tempatnya, penghuninya, manusianya, hewan dan tumbuhannya.\n\nManusia tidak saja diberi udara, tumbuhan, hewan, dan cuaca yang menyenangkan, tapi juga diberi perlengkapan dan kenyamanan untuk mencari rezeki di bumi dengan segala yang ada di atasnya maupun terkandung di dalamnya. \n\nSetelah Allah menerangkan bahwa alam ini diciptakan untuk manusia dan memudahkannya untuk keperluan mereka, maka Dia memerintahkan agar mereka berjalan di muka bumi, untuk memperhatikan keindahan alam, berusaha mengolah alam yang mudah ini, berdagang, beternak, bercocok tanam dan mencari rezeki yang halal. Sebab, semua yang disediakan Allah itu harus diolah dan diusahakan lebih dahulu sebelum dimanfaatkan bagi keperluan hidup manusia.\n\nDengan memahami ayat ini, dapat dikemukakan hal-hal yang berikut:\n\n1.Allah memerintahkan agar manusia berusaha dan mengolah alam untuk kepentingan mereka guna memperoleh rezeki yang halal. Hal ini berarti bahwa tidak mau berusaha dan bersifat pemalas bertentangan dengan perintah Allah.\n\n2.Karena berusaha dan mencari rezeki itu termasuk melaksanakan perintah Allah, maka orang yang berusaha dan mencari rezeki adalah orang yang menaati Allah, dan hal itu termasuk ibadah. Dengan perkataan lain bahwa berusaha dan mencari rezeki itu bukan mengurangi ibadah, tetapi memperkuat dan memperbanyak ibadah itu sendiri.\n\nDiriwayatkan oleh Ahmad dari 'Umar bin al-Khaththab, sesungguhnya ia mendengar Rasulullah bersabda:\n\nJika kalian benar-benar bertawakal kepada Allah, niscaya kalian akan diberi rezeki sebagaimana Allah memberikan rezeki-Nya kepada burung. Pergi mencari rezeki dengan perut yang kosong, dan petang hari ia kembali ke sarangnya dengan perut yang berisi penuh. (Riwayat at-Tirmidhi, Ahmad, al-Baihaqi, dan Abu Dawud dari 'Umar bin al-Khaththab) \n\nHadis ini menunjukkan bahwa waktu sejak pagi hari sampai petang adalah waktu untuk mencari rezeki, seperti yang telah dilakukan burung. Jika manusia benar-benar mau berusaha sejak pagi sampai petang pasti Allah memberinya rezeki. Mereka tidak akan kelaparan. Dari hadis ini juga dapat dipahami bahwa orang yang tidak mau berusaha tidak akan diberi rezeki oleh Allah.\n\nDiriwayatkan oleh al-hakim dan at-Tirmidhi dari Mu'awiyah bin Qurrah, ia berkata, \"Pada suatu hari 'Umar bin Khaththab lewat di perkampungan suatu kaum, lalu beliau bertanya kepada kaum itu, \"Siapakah kamu?\" Mereka menjawab, \"Kami adalah orang-orang yang bertawakal kepada Allah.\" Umar berkata, \"Kamu bukanlah orang-orang yang bertawakal kepada Allah, melainkan orang-orang yang telah dimakan karat. Adapun orang yang bertawakal kepada Allah ialah orang yang menanamkan benih ke dalam tanah, lalu ia bertawakal kepada Allah.\"\n\nDalam mencari rezeki ajaran Islam memberikan beberapa pedoman:\n\n1.Agar setiap manusia berusaha mencukupkan keperluan dirinya dan keluarganya. Oleh karena itu, orang yang berangkat dari rumahnya pagi hari untuk mencari rezeki, termasuk orang yang didoakan oleh Nabi Muhammad agar diberkahi Allah.\n\nBahwa Nabi Muhammad saw berkata, \"Wahai Allah, berkatilah umatku yang berangkat berusaha pagi-pagi.\" (Riwayat at-Tirmidhi dari sakhr bin al-Gamidi)\n\n2.Dalam berusaha itu hendaklah mencari yang halal. Maksudnya ialah mencari rezeki dengan cara-cara yang halal, tidak dengan mencuri, menipu, korupsi, dan sebagainya. Rezeki yang dicari itu adalah rezeki yang halal, bukan yang haram, seperti khamar, bangkai, dan sebagainya, sesuai dengan hadis: Dari Ali bahwa Rasulullah saw bersabda, \"Sesungguhnya Allah Ta'ala senang melihat hamba-Nya, dalam mencari yang halal.\" (Riwayat ath-thabrani)\n\nHadis yang lain menerangkan:\n\nDari Anas bin Malik bahwa Rasulullah bersabda, \"Mencari rezeki yang halal wajib bagi setiap orang muslim.\" (Riwayat ath-thabrani)\n\nPada akhir ayat, Allah memberi peringatan kepada manusia bahwa semua makhluk akan kembali kepada-Nya pada hari Kiamat, dan pada waktu itu akan ditimbang semua perbuatan manusia. Amal baik dibalas dengan pahala yang berlipat ganda, sedangkan perbuatan buruk akan dibalas dengan azab neraka. Oleh karena itu, hendaklah manusia selalu mawas diri, berusaha melaksanakan amal saleh sebanyak mungkin dan menilai serta meneliti perbuatan-perbuatan yang akan dikerjakan, berusaha memohon ampun kepada Allah atas kesalahan yang telanjur dilakukan atau yang tanpa disadari bahwa perbuatan itu termasuk perbuatan yang dilarang Allah. Maka setiap muslim seyogyanya mencari rezeki yang halal saja, jangan sekali-kali memakan rezeki yang diperoleh dengan cara yang haram atau bendanya sendiri adalah benda yang haram. Ingatlah bahwa semua makhluk tanpa ada kecualinya akan kembali kepada-Nya. Allah Maha Mengetahui segala sesuatu.",
      "text_translation": "Dialah yang menjadikan bumi untuk kamu yang mudah dijelajahi, maka jelajahilah di segala penjurunya dan makanlah sebagian dari rezeki-Nya. Dan hanya kepada-Nyalah kamu (kembali setelah) dibangkitkan. ",
      "text": "هُوَ الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ ذَلُوْلًا فَامْشُوْا فِيْ مَنَاكِبِهَا وَكُلُوْا مِنْ رِّزْقِهٖۗ وَاِلَيْهِ النُّشُوْرُ ",
      "text_translation_en": "He it is who has made the earth easy to live upon: go about, then, in all its regions, and partake the sustenance which He provides: but [always bear in mind that] unto Him you shall be resurrected.",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "In this verse, Allah warns unbelievers about the doom that will befall them, if it remains in disbelief. This warning was given by God because they seemed to feel they would avoid Allah's torment that would be inflicted on them, even they felt they had received a blessing that is the worldly pleasure they were feeling. Signs of disbelief can be seen in their attitudes, actions, and behavior. Therefore, Allah warns them by saying, \"O disbelievers, do you all feel safe and will avoid the punishment of Allah, even though the punishment will surely come upon you? Is the power and pleasure that you get it impossible to eliminate God when the power and the pleasure comes solely from His mercy? Is it not possible that it is a test from God to you? Remember, God has inflicted great doom on the ancients, like the punishment imposed on Karun and his followers. immersed into the earth. When God will immerse them in the earth, there will be a terrible earthquake that shakes the earth. \"",
      "text_tafsir": "Dalam ayat ini, Allah memperingatkan orang-orang kafir tentang azab yang akan menimpa mereka, apabila tetap dalam kekafiran. Peringatan ini diberikan Allah karena mereka seakan-akan merasa akan terhindar dari siksa Allah yang akan ditimpakan kepada mereka, bahkan mereka merasa telah mendapat rahmat yaitu kesenangan duniawi yang sedang mereka rasakan. Tanda-tanda kekafiran itu terlihat pada sikap, tindakan, dan tingkah laku mereka. Oleh karena itu, Allah memperingatkan mereka dengan mengatakan, \"Hai orang-orang kafir apakah kamu sekalian merasa aman dan akan terhindar dari azab Allah, padahal azab itu pasti akan menimpa kamu? Apakah kekuasaan dan kesenangan yang kamu peroleh itu tidak mungkin dilenyapkan Allah padahal kekuasaan dan kesenangan itu semata-mata berasal dari rahmat-Nya? Apakah tidak mungkin bahwa itu adalah ujian dari Allah kepadamu? Ingatlah, Allah telah menimpakan azab yang dahsyat kepada orang-orang dahulu, seperti azab yang ditimpakan kepada Karun dan pengikut-pengikutnya. Mereka telah dibenamkan ke dalam bumi. Pada saat Allah akan membenamkan mereka ke dalam bumi, maka terjadilah gempa yang dahsyat yang mengguncangkan bumi.\"",
      "text_translation": "Sudah merasa amankah kamu, bahwa Dia yang di langit tidak akan membuat kamu ditelan bumi ketika tiba-tiba ia terguncang?",
      "text": "ءَاَمِنْتُمْ مَّنْ فِى السَّمَاۤءِ اَنْ يَّخْسِفَ بِكُمُ الْاَرْضَ فَاِذَا هِيَ تَمُوْرُۙ",
      "text_translation_en": "Can you ever feel secure that He who is in heaven will not cause the earth to swallow you up when, lo and behold, it begins to quake?",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "In this verse, God continues His warning, \"Likewise, do you feel safe and will avoid the punishment of God who at times can blow wind with stones that can destroy you all at once? Remember, a punishment like this has happened to the people of Lut, for they have denied the Prophet Lut who was sent to them. At the time of the doom, you will all witness how terrible our Penalty, but your knowledge at that time was useless. \" In another verse, Allah says: Say (Muhammad), \"He is in charge of sending doom to you, from above or from under your feet or He mixes you in groups (which contradict each other) and feels to some of you the ferocity of others.\" Pay attention, how We explain repeatedly the signs (Our power) so that they understand (it). (al-An'am \/ 6: 65) Another word of God: Do you then feel secure that He will not immerse a portion of the land with you or will He blow (strong winds carrying) small stones? And you won't get a single patron. (al-Isra '\/ 17: 68)",
      "text_tafsir": "Pada ayat ini, Allah melanjutkan peringatan-Nya, \"Demikian pula apakah kamu merasa aman dan akan terhindar dari azab Allah yang sewaktu-waktu dapat mengembuskan angin bercampur batu yang dapat menghancurkan kamu sekalian seketika? Ingatlah, azab yang seperti ini telah menimpa kaum Lut, karena mereka telah mendustakan Nabi Lut yang diutus kepada mereka. Pada saat kedatangan azab itu, kamu semua akan menyaksikan betapa dahsyatnya azab Kami, tetapi pengetahuan kamu pada waktu itu tidak ada gunanya.\"\n\nPada ayat lain, Allah berfirman:\n\nKatakanlah (Muhammad), \"Dialah yang berkuasa mengirimkan azab kepadamu, dari atas atau dari bawah kakimu atau Dia mencampurkan kamu dalam golongan-golongan (yang saling bertentangan) dan merasakan kepada sebagian kamu keganasan sebagian yang lain.\" Perhatikanlah, bagaimana Kami menjelaskan berulang-ulang tanda-tanda (kekuasaan Kami) agar mereka memahami(nya). (al-An'am\/6: 65)\n\nFirman Allah yang lain:\n\nMaka apakah kamu merasa aman bahwa Dia tidak akan membenamkan sebagian daratan bersama kamu atau Dia meniupkan (angin kencang yang membawa) batu-batu kecil? Dan kamu tidak akan mendapat seorang pelindung pun. (al-Isra'\/17: 68)",
      "text_translation": "Atau sudah merasa amankah kamu, bahwa Dia yang di langit tidak akan mengirimkan badai yang berbatu kepadamu? Namun kelak kamu akan mengetahui bagaimana (akibat mendustakan) peringatan-Ku.",
      "text": "اَمْ اَمِنْتُمْ مَّنْ فِى السَّمَاۤءِ اَنْ يُّرْسِلَ عَلَيْكُمْ حَاصِبًاۗ فَسَتَعْلَمُوْنَ كَيْفَ نَذِيْرِ ",
      "text_translation_en": "Or can you ever feel secure that He who is in heaven will not let loose against you a deadly stormwind, whereupon you would come to know how [true] My warning was?",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "Then God commanded the unbelievers to pay attention to the sufferings of the ancient nations, for they had rejected the apostles whom they had sent. Among them were Noah's people who had been drowned by terrible floods, the Shuaibs who had been destroyed by lightning, and Pharaoh and his people were drowned in the Red Sea. They all just regretted what they were doing when the torment came. It can all be a lesson to ponder and to see how terrible the punishment of God is to those who are unfaithful to Him.",
      "text_tafsir": "Kemudian Allah memerintahkan agar orang-orang kafir memperhatikan penderitaan yang telah dialami umat-umat yang terdahulu, karena telah mendustakan para rasul yang telah diutus kepada mereka. Di antaranya seperti kaum Nuh yang telah ditenggelamkan banjir yang mahadahsyat, kaum Syuaib yang telah dibinasakan dengan petir, serta Fir'aun dan kaumnya telah ditenggelamkan di Laut Merah. Mereka semua baru menyesali perbuatan yang mereka lakukan pada saat azab itu datang menimpa. Semuanya bisa menjadi pelajaran untuk direnungkan dan diperhatikan betapa dahsyat siksa Allah yang ditimpakan kepada orang-orang yang durhaka kepada-Nya.",
      "text_translation": "Dan sungguh, orang-orang yang sebelum mereka pun telah mendustakan (rasul-rasul-Nya). Maka betapa hebatnya kemurkaan-Ku! ",
      "text": "وَلَقَدْ كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ فَكَيْفَ كَانَ نَكِيْرِ ",
      "text_translation_en": "And, indeed, [many of] those who lived aforetime did give the lie [to My warnings]: and how awesome was My rejection [of them]!",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "God explains that He is almighty, the All-knowing. As one of the proofs, His power holds birds in the sky, so they don't fall to earth. Birds that are in the sky sometimes fly by developing their wings. He flies upward or swoops down, as if he will crash to earth. Sometimes he closed his wings. Who kept the bird from falling when it developed and closed its wings? Isn't this against the law of nature that heavy objects will fall to earth due to the earth's gravitational attraction? The same thing can also be seen in the paragraph below. Did they not see the subdued birds fly in the air? There is no one but Allah. Verily in this are indeed signs for those who believe. (an-Nahl \/ 16: 79) It can be explained scientifically that birds can fly is unique. To be able to fly, birds must be very light. To be able to take off and continue to fly in the air, birds should be light enough. At the same time, he must also be very strong and tough. Strength is needed to be able to stay flying for a long time, and maneuver to catch prey or when they descend to their perch. The bird's neck bone must be strong and supple. The number of vertebrae varies, there are 11 there are more. Neck flexibility is obtained from a group of muscles that work very efficiently. Flexibility is needed for various purposes. As in seabirds that grab fish at very high speeds. Bird bones are generally hollow in the middle, and thin-walled. Bird's body weight is placed in the middle of the body. In the chest there is a large breastbone attached to the large chest muscles. This chest muscle moves the wings. Chest muscles cover about 25-30% of the total body weight of birds. The chest muscles that work hard to move the wings quite disturb the workings of the lungs. To overcome this, birds have a different respiratory system. The respiratory system used is the spread of air sacs in all parts of the body. This bag can also be found in the middle of the hollow bone. Air flowed into all parts of the bird's body and absorbed blood quickly. Absorption runs fast because the heart rate is very strong. Sharp vision is the main requirement. Birds are animals that rely most on vision in their lives. In some birds, even the size of the eyes exceeds the size of the brain. Birds can see at a distance eight times more clearly than humans. His eyes can adapt quickly to move from close look to far view, and vice versa. The most important thing so that birds can fly is the presence of wing and feather organs. The wing is a kind of hand that has a large and strong bullet joint on the shoulder. These joints are very special, and are used to carry out very complicated mobility. Its purpose is so that the bird can maneuver properly in the air. These bullet joints can position the wings so that the bird can spin rapidly, change direction, slow flying, fly back, swoop at high speed, and land gracefully. With the movement to develop and close their wings, the birds are actually flapping their wings to generate aerodynamic force (aerodynamic force), which is collecting enough air pressure under their wings, which will provide lift and thrust to the birds to be able to fly . This lifting force to fight the weight of birds, while the force to fight air resistance. Both of these forces are generated by the flapping motion of a bird's wings in a continuous, periodic upward and backward cycle. Really Most Gracious God. If He wanted to eliminate the air, surely the birds would not be able to fly. Wing feathers are a very beautiful creation of God. Light, but strong, flexible, versatile, easy to care for, functions as a heat insulator, waterproof and can be replaced. The color of the feathers is very important for birds. Some birds have colors that match their environment so they function as camouflage. Other types use color to attract the opposite sex. Many species of birds migrate and travel very far. In doing this, they have various ways to save energy on this long journey. Forms of formation in groups that resemble the shape of the V in most ducks or grouse when migrating, apparently has a specific purpose. This formation turns out to save energy for the whole group. This is because this V formation produces favorable airflow. At certain positions in this formation, individual birds can rest because they are supported by air flow patterns that allow them to rest. Who taught them? Now we know that birds disappear from one place because they move to another place. We know when they go, where they go, and which route they choose. Sometimes they travel very far, like a sandpiper. This bird migrates from Canada (in the north of the American continent) to Tierro del-Fuego (at the southern tip of the American continent). Some swiftlets fly 10,000 km from Alaska to Patagonia, Chile. Swifts in Scandinavia (northern Europe) fly to southern Africa in winter. A very small warbler, weighing less than an ounce, flies at night from Germany to Africa in the winter. Uniquely, these birds fly individually. Do not fly in groups like other types of birds. Artic tern is the champion of long-distance flying. They marry and raise their children at the North Pole during the summer, and spend the winter at the South Pole. Allah says: Do you not know that Allah: to Him glorify that which is in the heavens and the earth and (also) birds by expanding their wings. Each of them knows (the way) of their prayers and prayer beads, and Allah is All-Knowing what they do. (an-Nur \/ 24: 41) We know that birds can fly, because Allah 'holds them in the air. They migrated along mysterious paths because they carried out God's plan. They fly as part of the prayer beads to Allah the Creator. Kneeling birds do not want to be eagles. Crows don't care that the color of their feathers is not as beautiful as parrots. Honey-eating birds will not try to catch fish instead of honey. That is a lesson for all of us who can think. Who taught the bird to spread its wings? In fact, who created the bird with a certain shape, and was equipped with organs (tools) so that he was able to fly and not fall to earth? Why can't horses fly like birds? If people want to think about all that is mentioned, he will be convinced that indeed Allah is Creator, Almighty, Most Gracious, and All-Knowing everything He has created.",
      "text_tafsir": "Allah menerangkan bahwa Dia Mahakuasa lagi Maha Menentukan segala sesuatu. Sebagai salah satu buktinya ialah kekuasaan-Nya menahan burung yang sedang berada di angkasa, sehingga tidak jatuh ke bumi. Burung-burung yang sedang berada di angkasa kadang-kadang terbang melayang dengan mengembangkan sayapnya. Ia terbang meninggi atau menukik ke bawah, seakan-akan ia akan terhempas ke bumi. Kadang-kadang dia mengatupkan kedua sayapnya. Siapakah yang menahan burung itu dari kejatuhan pada waktu dia mengembangkan dan mengatupkan sayapnya? Bukankah ini bertentangan dengan hukum alam bahwa barang yang berat itu akan jatuh ke bumi disebabkan daya tarik (gravitasi) bumi?\n\nHal yang senada juga dapat dilihat pada ayat di bawah ini.\n\nTidakkah mereka melihat burung-burung yang ditundukkan terbang di angkasa bebas. Tidak ada yang menahannya selain Allah. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi orang-orang yang beriman. (an-Nahl\/16: 79)\n\nSecara saintifik dapat dijelaskan bahwa burung bisa terbang adalah keunikan. Untuk dapat terbang, burung seharusnya sangat ringan. Untuk dapat lepas landas dan terus terbang di udara, burung-burung semestinya harus cukup ringan. Pada saat yang sama, ia juga harus sangat kuat dan tangguh. Kekuatan diperlukan untuk dapat tetap terbang dalam waktu yang lama, dan bermanuver untuk menangkap mangsa atau saat turun ke tempat mereka hinggap. \n\nTulang leher burung harus kuat sekaligus lentur. Jumlah ruas tulang leher bervariasi, ada yang 11 ada yang lebih. Kelenturan leher diperoleh dari sekelompok otot yang bekerja dengan sangat efisien. Kelenturan diperlukan untuk berbagai keperluan. Seperti pada burung laut yang menyambar ikan dengan kecepatan sangat tinggi.\n\nTulang burung umumnya berlubang di tengahnya, dan berdinding tipis. Berat tubuh burung diletakkan di bagian tengah tubuh. Di bagian dada terdapat tulang dada yang besar yang melekat pada otot dada besar. Otot dada inilah yang menggerakkan sayap. Otot dada meliputi sekitar 25-30% dari keseluruhan berat badan burung.\n\nOtot dada yang bekerja keras untuk menggerakkan sayap cukup mengganggu kerja paru-paru. Untuk menanggulanginya, burung mempunyai sistem pernapasan yang berbeda. Sistem pernapasan yang digunakan adalah dengan tersebarnya kantung-kantung udara di seluruh bagian tubuhnya. Kantung demikian ini juga dapat ditemui di tulang bagian tengah yang berlubang. Udara dialirkan ke semua bagian tubuh burung dan diserap darah dengan cepat. Penyerapan berjalan cepat karena denyut jantung yang sangat kuat.\n\nPenglihatan yang tajam merupakan syarat utama. Burung merupakan binatang yang paling mengandalkan penglihatan dalam kehidupannya. Pada beberapa burung, bahkan besar matanya melebihi besar otaknya. Burung dapat melihat ke kejauhan delapan kali lebih jelas dari manusia. Matanya dapat beradaptasi dengan cepat untuk berpindah dari melihat dekat ke melihat jauh, begitu juga sebaliknya. \n\nHal terpenting agar burung dapat terbang adalah terdapatnya organ sayap dan bulu. Sayap adalah semacam tangan yang mempunyai sendi peluru yang besar dan kuat di bagian bahu. Sendi ini sangat khusus, dan digunakan untuk melakukan mobilitas yang sangat rumit. Kegunaannya adalah agar burung dapat bermanuver dengan baik di udara. Sendi peluru yang demikian ini dapat memposisikan sayap sehingga burung dapat berputar dengan cepat, berganti arah, memperlambat terbang, terbang ke belakang, menukik dengan kecepatan tinggi, dan mendarat dengan anggun.\n\nDengan gerakan mengembangkan dan mengatupkan sayapnya, maka sesungguhnya burung-burung itu sedang mengepakkan sayapnya untuk membangkitkan aerodynamic force (gaya aerodinamika), yaitu mengumpulkan tekanan udara yang cukup di bawah sayapnya, yang akan memberikan gaya angkat dan gaya dorong kepada burung-burung untuk dapat terbang. Gaya angkat ini untuk melawan berat burung, sedang gaya dorong untuk melawan hambatan udara. Kedua gaya ini dibangkitkan oleh gerakan kepakan sayap burung dengan siklus ke atas, ke bawah, dan ke belakang secara kontiniu dan periodik. Sungguh Maha Pemurah Allah. Jika Dia berkehendak menghilangkan udara, pasti burung-burung itu tidak mungkin dapat terbang.\n\nBulu sayap adalah ciptaan Tuhan yang sangat indah. Ringan, namun kuat, lentur, serba guna, mudah dirawat, berfungsi sebagai penyekat panas, kedap air, dan dapat diganti. Warna bulu sangat penting bagi burung. Beberapa burung mempunyai warna yang sesuai dengan lingkungannya sehingga berfungsi untuk kamuflase. Jenis lainnya menggunakan warnanya untuk menarik lawan jenisnya. \n\nBanyak jenis burung melakukan migrasi dan melakukan perjalanan yang sangat jauh. Dalam melakukan ini, mereka mempunyai berbagai cara untuk menyimpan tenaga dalam perjalanan jauh ini. Bentuk formasi terbang berkelompok yang menyerupai huruf V pada kebanyakan bebek atau belibis saat bermigrasi, ternyata mempunyai maksud tertentu. Formasi ini ternyata menghemat energi untuk seluruh kelompok. Hal ini disebabkan karena formasi V ini menghasilkan aliran udara yang menguntungkan. Pada posisi tertentu dalam formasi ini, individu burung dapat beristirahat karena ditopang oleh pola aliran udara yang memungkinkan untuk beristirahat. Siapakah yang mengajar mereka?\n\nSekarang kita tahu bahwa burung menghilang dari satu tempat karena mereka berpindah ke tempat lain. Kita tahu kapan mereka pergi, ke mana mereka menuju, dan rute mana yang mereka pilih. \n\nKadang-kadang perjalanan mereka sangat jauh, seperti burung sandpiper. Burung ini bermigrasi dari Canada (di utara benua Amerika) ke Tierro del-Fuego (di ujung selatan benua Amerika). Beberapa jenis walet terbang sejauh 10.000 km dari Alaska ke Patagonia, Cile. Burung-burung walet yang ada di Skandinavia (Eropa utara) terbang ke selatan Afrika di musim dingin. Burung warbler yang sangat kecil, beratnya kurang dari satu ons, terbang pada malam hari dari Jerman ke Afrika pada menjelang musim dingin. Uniknya, burung ini terbang secara individu. Tidak terbang berkelompok seperti jenis burung lainnya.\n\nBurung tern artic adalah juara terbang jarak jauh. Mereka kawin dan membesarkan anaknya di Kutub Utara pada saat musim panas, dan menghabiskan musim dingin di Kutub Selatan. Allah berfirman:\n\nTidakkah kamu tahu bahwasanya Allah: kepada-Nya bertasbih apa yang di langit dan di bumi dan (juga) burung dengan mengembangkan sayapnya. Masing-masing telah mengetahui (cara) sembahyang dan tasbihnya, dan Allah Maha Mengetahui apa yang mereka kerjakan. (an-Nur\/24: 41)\n\nKita tahu bahwa burung dapat terbang, karena Allah 'memegangnya di udara. Mereka melakukan migrasi sepanjang jalur yang misterius karena melaksanakan rencana Allah. Mereka terbang sebagai bagian dari tasbih kepada Allah Sang Pencipta. Burung perkutut tidak ingin menjadi burung elang. Burung gagak tidak peduli bahwa warna bulunya tidak seindah burung nuri. Burung pemakan madu tidak akan mencoba untuk menangkap ikan sebagai ganti madu. Itu adalah pelajaran bagi kita semua yang dapat berpikir. \n\nSiapakah yang mengajar burung itu terbang mengembangkan sayapnya? Bahkan, siapakah yang menciptakan burung itu dengan bentuk tertentu, serta dilengkapi dengan organ-organ (alat-alat) sehingga ia mampu terbang dan tidak jatuh ke bumi? Kenapa kuda tidak dapat terbang seperti burung? Bila manusia mau memikirkan semua yang disebutkan itu akan yakinlah ia bahwa sesungguhnya Allah Maha Pencipta, Mahakuasa, Maha Pemurah, dan Maha Mengetahui segala yang diciptakan-Nya.",
      "text_translation": "Tidakkah mereka memperhatikan burung-burung yang mengembangkan dan mengatupkan sayapnya di atas mereka? Tidak ada yang menahannya (di udara) selain Yang Maha Pengasih. Sungguh, Dia Maha Melihat segala sesuatu.  ",
      "text": "اَوَلَمْ يَرَوْا اِلَى الطَّيْرِ فَوْقَهُمْ صٰۤفّٰتٍ وَّيَقْبِضْنَۘ مَا يُمْسِكُهُنَّ اِلَّا الرَّحْمٰنُۗ اِنَّهٗ بِكُلِّ شَيْءٍۢ بَصِيْرٌ ",
      "text_translation_en": "Have they, then, never beheld the birds above them, spreading their wings and drawing them in? None but the Most Gracious upholds them: for, verily, He keeps all things in His sight.",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "Allah condemns the infidels who worship idols other than Allah with the question of saying that no one will come to their aid and deliver them from the torment of Allah. They have been deceived by the whisperings of the devil who instilled in them the belief that idols can help and grant their wishes. In fact, that's not the case. The idols themselves can do nothing at all, but rather are the man who determines everything for himself. Those infidels are deceived by the whisper of demons. Therefore, Allah says: And they worship besides Allah what does not benefit them and does not cause them harm. The disbelievers are the helpers (demons to do wrong) to their Lord. (al-Furqan \/ 25: 55) The word \"min dunir-rahman\" (other than Allah, the Beneficent) contains the sense that God's grace is bestowed on all beings in this world, both those who believe in God and those who disbelieve. So it is with animals, plants, and so on, so that everything can grow and flourish. However, in the Hereafter the grace will only be given to those who believe. Allah says: Say, \"Who forbid the jewelry of Allah that was provided for His servants and good provision? Say,\" All that is for the believers in the life of the world, and specifically (for) them) on the Day of Resurrection. \"Thus We interpreted those verses for those who know (al-A'raf \/ 7: 32)",
      "text_tafsir": "Allah mencela orang-orang kafir yang menyembah sembahan-sembahan selain Allah dengan bentuk pertanyaan yang menyatakan tak ada orang yang akan datang menolong mereka serta melepaskannya dari siksa Allah. Mereka telah tertipu oleh bisikan-bisikan setan yang menanamkan kepercayaan dalam hati mereka bahwa berhala-berhala itu dapat menolong dan mengabulkan permintaan mereka. Dalam kenyataannya tidaklah demikian. Berhala-berhala itu sendiri tidak dapat berbuat apa-apa sama sekali, malah sebaliknya manusialah yang menentukan segala sesuatu bagi dirinya. Orang-orang kafir itu tertipu oleh bisikan setan. Oleh karena itu, Allah berfirman:\n\nDan mereka menyembah selain Allah apa yang tidak memberi manfaat kepada mereka dan tidak (pula) mendatangkan bencana kepada mereka. Orang-orang kafir adalah penolong (setan untuk berbuat durhaka) terhadap Tuhannya. (al-Furqan\/25: 55)\n\nPerkataan \"min dunir-rahman\" (selain dari Allah Yang Maha Pemurah) mengandung pengertian bahwa rahmat Allah itu dilimpahkan kepada seluruh makhluk yang ada di alam ini, baik yang beriman kepada Allah maupun yang kafir. Demikian pula kepada hewan, tumbuh-tumbuhan, dan sebagainya, sehingga semuanya dapat hidup dan berkembang. Akan tetapi, di akhirat nanti rahmat itu hanya diberikan kepada orang-orang yang beriman saja. Allah berfirman:\n\nKatakanlah (Muhammad), \"Siapakah yang mengharamkan perhiasan dari Allah yang telah disediakan untuk hamba-hamba-Nya dan rezeki yang baik-baik? Katakanlah, \"Semua itu untuk orang-orang yang beriman dalam kehidupan dunia, dan khusus (untuk mereka saja) pada hari Kiamat.\" Demikianlah Kami menjelaskan ayat-ayat itu untuk orang-orang yang mengetahui. (al-A'raf\/7: 32)",
      "text_translation": "Atau siapakah yang akan menjadi bala tentara bagimu yang dapat membelamu selain (Allah) Yang Maha Pengasih? Orang-orang kafir itu hanyalah dalam (keadaan) tertipu. ",
      "text": "اَمَّنْ هٰذَا الَّذِيْ هُوَ جُنْدٌ لَّكُمْ يَنْصُرُكُمْ مِّنْ دُوْنِ الرَّحْمٰنِۗ اِنِ الْكٰفِرُوْنَ اِلَّا فِيْ غُرُوْرٍۚ ",
      "text_translation_en": "[And] is there any, besides the Most Gracious, that could be a shield for you, and could succour you [against danger]? They who deny this truth are but lost in self- delusion!",
      "juz_number": 29
    },
    "21": {
      "text_tafsir_en": "To the disbelievers who disregard God's provision, they are given statements in the form of questions that no one can provide, if Allah refuses to provide them. They were asked to ponder if God had not rained down, killed all the plants until the whole surface of the earth was dry and barren, killed all the animals that could be eaten, made the sun stop rising in the eastern horizon and made the day keep bright without changing the darkness. , how and where will they earn their living? It is then explained that the unbelievers believed in the oneness and power of God. They associate God only with pride and their unwillingness to accept the truth for fear of losing their position and influence in their society. Such arrogance and ignorance arises and is fueled by the deceit and temptations of the devil who always instills in their minds and fantasies that their evil deeds are good and praiseworthy. This is the purpose of the devil living in this world. Allah says: (Allah) said, \"Come down from it, for you ought not to boast in it. Come out! You are indeed a despicable being.\" (The devil) replied, \"Give me time, until the day they rise again.\" (Allah) says, \"Yes, you are one of those who are given time off.\" (al-A'raf \/ 7: 13-15)",
      "text_tafsir": "Kepada orang-orang kafir yang mengingkari rezeki Allah, disampaikan pernyataan dalam bentuk pertanyaan bahwa tak seorang pun dapat memberi rezeki, bila Allah menahan untuk tidak memberikan rezeki itu kepada mereka. Mereka diminta merenungkan seandainya Allah tidak lagi menurunkan hujan, mematikan segenap tumbuh-tumbuhan sehingga seluruh permukaan bumi kering dan tandus, mematikan semua hewan ternak yang dapat dimakan, menjadikan matahari berhenti terbit di ufuk timur dan menjadikan hari terus menerus terang-benderang tanpa berganti dengan gelap, bagaimana dan dari manakah mereka akan beroleh rezeki?\n\nKemudian diterangkan bahwa sebenarnya orang-orang kafir itu percaya akan keesaan dan kekuasaan Allah. Mereka mempersekutukan Allah hanya didorong oleh kesombongan serta keengganan mereka menerima kebenaran karena takut kehilangan kedudukan dan pengaruh di dalam masyarakatnya. Kesombongan dan keingkaran itu timbul dan disuburkan oleh tipu daya serta godaan setan yang selalu menumbuhkan perasaan dalam pikiran dan angan-angan mereka bahwa perbuatan mereka yang buruk itu adalah perbuatan baik dan terpuji. Memang demikianlah tujuan setan hidup di dunia ini.\n\nAllah berfirman:\n\n(Allah) berfirman, \"Maka turunlah kamu darinya (surga); karena kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah! Sesungguhnya kamu termasuk makhluk yang hina.\" (Iblis) menjawab, \"Berilah aku penangguhan waktu, sampai hari mereka dibangkitkan.\" (Allah) berfirman, \"Benar, kamu termasuk yang diberi penangguhan waktu.\" (al-A'raf\/7: 13-15)",
      "text_translation": "Atau siapakah yang dapat memberimu rezeki jika Dia menahan rezeki-Nya? Bahkan mereka terus-menerus dalam kesombongan dan menjauhkan diri (dari kebenaran).",
      "text": "اَمَّنْ هٰذَا الَّذِيْ يَرْزُقُكُمْ اِنْ اَمْسَكَ رِزْقَهٗ ۚ بَلْ لَّجُّوْا فِيْ عُتُوٍّ وَّنُفُوْرٍ ",
      "text_translation_en": "Or is there any that could provide you with sustenance if He should withhold His provision [from you]? Nay, but they [who are bent on denying the truth] stubbornly persist in their disdain [of God's messages] and in their headlong flight [from Him]!",
      "juz_number": 29
    },
    "22": {
      "text_tafsir_en": "In this verse, Allah gives a comparison to humans between the journey of life taken by unbelievers and those taken by believers. This comparison is given in the form of questions stating that people who always fall or fall when walking and their feet always stumble because through rocky roads and potholes, it is not possible to be safe and walk faster to reach the destination compared to people who walk in an atmosphere good and safe, on flat and smooth roads, and in good weather too. The comparison in the above verse is expressed in the form of a question sentence. The sentence question in this verse is not the intention to ask something unknown, but to state a purpose which is that the actions of unbelievers are wrong. It was stated that the journey of the lives of those who disbelieved was the journey of life towards extreme misery and suffering. As if this verse states that surely people who are lying face down with their faces sweeping the ground will easily get lost on their way to navigate the ocean of life in this mortal world, while in the hereafter they will be put into a fiery hell. Whereas those who walk in a good way, take a good and straight path, that is, a path that is acceptable to God, will not get lost in the course of their lives in this world and will surely arrive at the destination that he desires and pleases God. In the hereafter, they will occupy a paradise full of pleasure provided by Allah for those who fear Allah. Furthermore, it can also be understood from this verse that humans in carrying out their business, carrying out their work, and fulfilling their obligations must be based on the provisions of the Islamic religion, scientific instruction, sound reasoning and experience, as well as the results of the research of previous experts. It is intended that efforts and work will produce good results. Do not blind or work as you wish, because that will only invite failure and disaster, both for himself and others.",
      "text_tafsir": "Pada ayat ini, Allah memberikan perbandingan kepada manusia antara perjalanan hidup yang ditempuh oleh orang-orang kafir dengan yang ditempuh oleh orang-orang yang beriman. Perbandingan ini diberikan dalam bentuk pertanyaan yang menyatakan bahwa orang yang selalu terjerembab atau tersungkur ketika berjalan dan kakinya selalu tersandung karena melalui jalan yang berbatu-batu dan berlubang-lubang, tidak mungkin akan selamat dan berjalan lebih cepat mencapai tujuan dibandingkan dengan orang yang berjalan dalam suasana yang baik dan aman, di atas jalan yang datar dan mulus, serta dalam cuaca yang baik pula.\n\nPerbandingan dalam ayat di atas dikemukakan dalam bentuk kalimat pertanyaan. Kalimat pertanyaan dalam ayat ini bukanlah maksudnya untuk menanyakan sesuatu yang tidak diketahui, tetapi untuk menyatakan suatu maksud yaitu bahwa perbuatan orang-orang kafir itu adalah perbuatan yang tidak benar. Dinyatakan bahwa perjalanan hidup orang-orang kafir itu adalah perjalanan hidup menuju kesengsaraan dan penderitaan yang sangat. Seakan-akan ayat ini menyatakan bahwa tentu orang yang berjalan tertelungkup dengan muka menyapu tanah akan mudah tersesat dalam perjalanannya mengarungi samudera hidup di dunia yang fana ini, sedang di akhirat kelak mereka akan dimasukkan ke dalam neraka yang menyala-nyala. Sedangkan orang yang berjalan dengan cara yang baik, menempuh jalan yang baik dan lurus, yaitu jalan yang diridai Allah, tidak akan tersesat dalam perjalanan hidupnya di dunia ini dan pasti akan sampai kepada tujuan yang diinginkannya dan diridai Allah. Di akhirat nanti, mereka akan menempati surga yang penuh kenikmatan yang disediakan Allah bagi mereka yang bertakwa.\n\nSelanjutnya dapat pula diambil pengertian dari ayat ini bahwa manusia dalam menjalankan usahanya, melaksanakan pekerjaan, dan menunaikan kewajibannya haruslah berdasarkan kepada ketentuan agama Islam, petunjuk ilmu pengetahuan, akal pikiran yang sehat dan pengalaman, serta hasil penelitian para ahli sebelumnya. Ini bertujuan agar usaha dan pekerjaannya membuahkan hasil yang baik. Janganlah ia membabi-buta atau bekerja dengan semaunya saja, karena yang demikian itu hanyalah akan mengundang kegagalan dan bencana, baik untuk dirinya maupun orang lain.",
      "text_translation": "Apakah orang yang merangkak dengan wajah tertelungkup yang lebih terpimpin (dalam kebenaran) ataukah orang yang berjalan tegap di atas jalan yang lurus?",
      "text": "اَفَمَنْ يَّمْشِيْ مُكِبًّا عَلٰى وَجْهِهٖٓ اَهْدٰىٓ اَمَّنْ يَّمْشِيْ سَوِيًّا عَلٰى صِرَاطٍ مُّسْتَقِيْمٍ ",
      "text_translation_en": "But then, is he that goes along with his face close to the ground better guided than he that walks upright on a straight way?",
      "juz_number": 29
    },
    "23": {
      "text_tafsir_en": "Next in this verse, God tells people to pay attention to their own events. Allah commanded the Prophet Muhammad to tell the unbelievers that it was Allah who bestowed on the human ear so that they could listen to the teachings of His religion which were conveyed to them by the apostles. God also gives them eyes so that they can see, see, and observe the events of this universe. He gives them the heart, the mind, and the mind to think, ponder, weigh, and distinguish what is good for them and what is bad, what is useful and what is not. In fact, by the grace of God, man can accomplish all that is good for himself as his being. Indeed, hearing, sight, and heart are one thing. Hearing and seeing are the tools used by humans to understand the verses of Allah, sunatullah, which can be used (applied) in the development of science and technology, to meet human needs. The method of observation (observation) in the discoveries of science and technology depends greatly on the use of hearing and vision devices. However, if only hearing and vision devices are used, and neglect (al-af'idah) in their implementation decisions, then the results will be counter productive, which will produce more harm than good. In essence, the heart (al-af'idah) should serve as a guide in decision making for the application of science and technology, which is produced by this method of hearing and vision. From this al-af'idah can be developed science and technology ethics based on Islamic values. Very few people want to thank God for the gifts He has given. Very few people are aware of their reliance on it, but when it is delayed in giving it to them or being taken away by God, they find it very difficult. That's when they remembered him. However, when they received the favor and the difficulties passed, they returned to Allah.",
      "text_tafsir": "Selanjutnya dalam ayat ini, Allah menyuruh manusia memperhatikan kejadian diri mereka sendiri. Allah memerintahkan Nabi Muhammad mengatakan kepada orang-orang kafir bahwa sesungguhnya Allah-lah yang menganugerahkan kepada manusia telinga sehingga dapat mendengarkan ajaran-ajaran agama-Nya yang disampaikan kepada mereka oleh para rasul. Allah juga menganugerahkan kepada mereka mata sehingga mereka dapat melihat, memandang, dan memperhatikan kejadian alam semesta ini. Diberi-Nya mereka hati, akal, dan pikiran untuk memikirkan, merenungkan, menimbang, dan membedakan mana yang baik bagi mereka dan mana yang tidak baik, mana yang bermanfaat dan mana pula yang tidak bermanfaat. Sebenarnya dengan anugerah Allah itu, manusia dapat mencapai semua yang baik bagi diri mereka sebagai makhluk-Nya.\n\nSesungguhnya pendengaran, penglihatan, dan hati merupakan satu kesatuan. Pendengaran dan penglihatan adalah piranti yang digunakan oleh manusia untuk dapat memahami ayat-ayat Allah, sunatullah, yang dapat digunakan (diaplikasikan) dalam pengembangan ilmu pengetahuan dan teknologi, untuk dapat memenuhi kebutuhan manusia. Metode observasi (pengamatan) dalam penemuan-penemuan ilmu pengetahuan dan teknologi, sangat bergantung kepada penggunaan piranti pendengaran dan penglihatan. Namun apabila hanya piranti pendengaran dan penglihatan yang dipakai, dan mengabaikan hati (al-af'idah) dalam keputusan penerapannya, maka hasilnya akan counter productive, yaitu akan memberikan hasil yang lebih banyak mudaratnya dibanding manfaatnya. Pada hakikatnya, hati (al-af'idah) harus dijadikan panduan dalam pengambilan keputusan untuk penerapan ilmu pengetahuan dan teknologi, yang dihasilkan dengan metode pendengaran dan penglihatan tadi. Dari al-af'idah ini dapat dikembangkan etika ilmu pengetahuan dan teknologi (science ethics) yang didasarkan kepada nilai-nilai Islami.\n\nSedikit sekali manusia yang mau bersyukur kepada Allah atas nikmat-nikmat yang telah diberikan-Nya itu. Sangat sedikit manusia yang menyadari ketergantungan mereka kepada nikmat itu, padahal apabila sedikit saja nikmat itu ditangguhkan pemberiannya kepadanya atau dicabut oleh Tuhan, mereka merasa mendapat kesulitan yang sangat besar. Di saat itulah mereka ingat kepada-Nya. Akan tetapi, bila nikmat itu mereka peroleh kembali dan kesukaran itu telah berlalu, mereka kembali kafir kepada Allah.",
      "text_translation": "Katakanlah, “Dialah yang menciptakan kamu dan menjadikan pendengaran, penglihatan dan hati nurani bagi kamu. (Tetapi) sedikit sekali kamu bersyukur.”",
      "text": "قُلْ هُوَ الَّذِيْٓ اَنْشَاَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْاَبْصَارَ وَالْاَفْـِٕدَةَۗ قَلِيْلًا مَّا تَشْكُرُوْنَ ",
      "text_translation_en": "SAY: \"[God is] He who has brought you [all] into being, and has endowed you with hearing, and sight, and hearts: [yet] how seldom are you grateful!\"",
      "juz_number": 29
    },
    "24": {
      "text_tafsir_en": "Allah commanded the Prophet Muhammad to convey to the unbelievers that He created them all in different shapes and colors, providing them with a place on earth and spreading them all over the earth. It is God who makes it easy for them to control and manipulate the earth for their lives and their lives. Therefore, it is only to Allah that they return and take responsibility for all that they have done throughout their life on earth. In the hereafter God will give justice to all of them. Good deeds are rewarded with double rewards, while bad deeds are rewarded with the torment of hell fire equal to the evils of charity.",
      "text_tafsir": "Allah memerintahkan agar Nabi Muhammad menyampaikan kepada orang-orang kafir bahwa Dia telah menciptakan mereka semua dalam bentuk yang berbeda-beda dan warna kulit yang bermacam-macam, menyediakan tempat bagi mereka di bumi dan menyebarkan mereka semua ke setiap penjuru bumi. Allah pulalah yang memudahkan mereka menguasai dan mengolah bumi untuk hidup dan kehidupan mereka. Oleh karena itu, hanya kepada Allah-lah mereka kembali dan mempertanggungjawabkan segala perbuatan yang telah mereka kerjakan selama hidup di bumi. Di akhirat nanti Allah akan memberikan balasan dengan adil kepada mereka semua. Perbuatan baik dibalas dengan pahala yang berlipat ganda, sedangkan perbuatan buruk diganjar dengan siksaan api neraka setimpal dengan keburukan amalnya.",
      "text_translation": "Katakanlah, “Dialah yang menjadikan kamu berkembang biak di muka bumi, dan hanya kepada-Nya kamu akan dikumpulkan.” ",
      "text": "قُلْ هُوَ الَّذِيْ ذَرَاَكُمْ فِى الْاَرْضِ وَاِلَيْهِ تُحْشَرُوْنَ ",
      "text_translation_en": "Say: \"It is He who has multiplied you on earth; and it is unto Him that you shall be gathered [on resurrection].\"",
      "juz_number": 29
    },
    "25": {
      "text_tafsir_en": "The disbelievers asked the Messenger of Allah (may peace be upon him) with contempt and contempt about the time when the ruins of the land hit them, a strong wind blowing through the rocks that threw them and threw them, as the torment often invoked. When will the Resurrection come when all human life on earth will be held accountable, and will they, as wicked, go to hell? They demanded that everything be explained, if the Prophet was among those who could trust his word. From the question of these infidels it is understood that they are challenging the truth conveyed by the Messenger of Allah (may peace be upon him), since they are considered impossible. According to them, it was supposed that Muhammad and his followers would be punished, and in fact they were punished by Allah in the world, in the form of misery and torture inflicted on them such as the poverty, poverty, and punishment inflicted by the disbelievers of Mecca. The infidels say that what Muhammad and his followers will accept in the hereafter is far greater than the torture they receive in the world.",
      "text_tafsir": "Orang-orang kafir itu bertanya kepada Rasulullah saw dengan maksud mengejek dan menentang tentang kapan waktunya ditimpakan kepada mereka runtuhan tanah yang mengimpit, angin kencang yang bercampur batu yang mengembus dan melemparkan mereka, sebagai azab yang sering disebut-sebut akan menimpa orang kafir? Kapan pula datangnya hari Kiamat yang pada hari itu seluruh perbuatan manusia selama hidup di dunia akan dipertanggungjawabkan, dan mereka sebagai orang yang durhaka akan masuk ke dalam neraka? Mereka minta dijelaskan semuanya, jika Nabi termasuk orang yang dapat dipercaya perkataannya.\n\nDari pertanyaan orang-orang kafir ini dipahami bahwa mereka menantang kebenaran yang disampaikan Rasulullah saw, karena menurut mereka yang diancam itu tidak mungkin terjadi. Menurut mereka, mestinya Muhammad saw dan pengikut-pengikutnya yang akan diazab, dan kenyataannya mereka telah diazab Allah di dunia, berupa kesengsaraan dan siksaan yang ditimpakan kepada mereka seperti kemiskinan, kemelaratan, dan hukuman yang diberikan oleh orang-orang kafir Mekah kepada mereka. Orang-orang kafir itu mengatakan bahwa yang akan diterima Muhammad dan pengikut-pengikutnya di akhirat nanti lebih berat dari siksaan yang mereka terima di dunia.",
      "text_translation": "Dan mereka berkata, “Kapan (datangnya) ancaman itu jika kamu orang yang benar?”",
      "text": "وَيَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ ",
      "text_translation_en": "But they [only] ask, \"When is this promise to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!\"",
      "juz_number": 29
    },
    "26": {
      "text_tafsir_en": "In this verse, Allah commands the Messenger of Allah to answer the disbelievers by saying, \"O unbelievers, only Allah knows all that you ask. God is the only one who knows about me and none other than the apostles and messengers of God who have been entrusted with the message of his religion, so that you may be happy in this world and in the hereafter. In the next verse Allah says: Man asks you about the Day of Judgment. Say, \"The knowledge of the Day of Judgment is only with Allah.\" (Al-Ahzab \/ 33: 63) From that answer it can be understood that the Messenger of Allah is only a human being and possesses qualities and capacities. sounds like a normal human being. His advantage lies only in the task assigned to him. In addition to his human nature, he was given the task of conveying the religion of God. Therefore, he does not know the magic unless God informs him. His job is not to make a believer, but merely to convey the religion of God and to explain to humanity. In another verse, Allah says: We know best what they say, and you (Muhammad) are not a compulsor against them. Then warn the Qur'an to anyone who fears my threat. (Qaf \/ 50: 45) Other words of Allah: It is not your duty (Muhammad) to guide them, but it is Allah who guides whom He wills. (al-Baqarah \/ 2: 272)",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Rasulullah menjawab omongan orang kafir itu dengan mengatakan, \"Wahai orang-orang kafir, hanya Allah sajalah yang mengetahui semua yang kamu tanyakan itu. Sebab, tentang kapan datangnya azab, dan terjadinya hari Kiamat termasuk pengetahuan yang gaib, hanya Allah saja yang mengetahuinya. Mengenai diriku, tidak lain hanyalah rasul dan pesuruh Allah yang diberi tugas menyampaikan agama-Nya kepada kamu sekalian, agar kamu berbahagia hidup di dunia dan di akhirat nanti. Aku diperintahkan-Nya menyampaikan berita kepadamu bahwa azab itu pasti datang menimpa orang-orang kafir dan hari Kiamat itu pasti terjadi.\n\nPada ayat yang lain Allah berfirman:\n\nManusia bertanya kepadamu (Muhammad) tentang hari Kiamat. Katakanlah, \"Ilmu tentang hari Kiamat itu hanya di sisi Allah.\" Dan tahukah engkau, boleh jadi hari Kiamat itu sudah dekat waktunya. (al-Ahzab\/33: 63)\n\nDari jawaban itu dapat dipahami bahwa Rasulullah hanyalah manusia biasa dan mempunyai sifat-sifat dan kemampuan seperti manusia biasa pula. Kelebihannya hanyalah terletak pada tugas yang diberikan kepadanya. Di samping sifatnya seperti manusia biasa, ia diberi tugas menyampaikan agama Allah. Oleh karena itu, ia tidak mengetahui ilmu yang gaib kecuali jika Allah memberitahukan kepadanya. Tugasnya bukanlah menjadikan seseorang beriman, tetapi semata-mata menyampaikan agama Allah dan memberi penjelasan kepada manusia. Dalam ayat yang lain, Allah berfirman:\n\nKami lebih mengetahui tentang apa yang mereka katakan, dan engkau (Muhammad) bukanlah seorang pemaksa terhadap mereka. Maka berilah peringatan dengan Al-Qur'an kepada siapa pun yang takut kepada ancaman-Ku. (Qaf\/50: 45)\n\nFirman Allah lainnya:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah\/2: 272)",
      "text_translation": "Katakanlah (Muhammad), “Sesungguhnya ilmu (tentang hari Kiamat itu) hanya ada pada Allah. Dan aku hanyalah seorang pemberi peringatan yang menjelaskan.” ",
      "text": "قُلْ اِنَّمَا الْعِلْمُ عِنْدَ اللّٰهِ ۖوَاِنَّمَآ اَنَا۠ نَذِيْرٌ مُّبِيْنٌ ",
      "text_translation_en": "Say thou, [O Prophet:] \"Knowledge thereof rests with God alone; and I am only a plain warner.\"",
      "juz_number": 29
    },
    "27": {
      "text_tafsir_en": "This verse explains that the hearts of the disbelievers are shrinking and their faces change after believing that the coming of the promised doom on the Day of Judgment and the dread that will overtake them that day. They are in a state of constant fear and regret. At that time the angels said, \"This is the Day of Resurrection and the punishment of Allah which you denied when you lived in the world, and yet you are always begging for His coming.\" In another verse, Allah says: And it is clear to them what evil they have done and that they are covered by what they used to mock. (az-Zumar \/ 39: 48)",
      "text_tafsir": "Ayat ini menerangkan bahwa hati orang-orang kafir menjadi kecut dan warna muka mereka berubah setelah meyakini akan dekatnya kedatangan azab yang dijanjikan pada hari Kiamat dan kedahsyatan yang akan menimpa mereka pada hari itu. Mereka berada dalam keadaan penuh ketakutan dan penyesalan yang tidak henti-hentinya. Pada saat itu malaikat mengatakan, \"Inilah hari Kiamat dan azab Allah yang kamu dustakan sewaktu hidup di dunia dahulu, bahkan kamu selalu meminta-minta kedatangannya.\"\n\nPada ayat yang lain, Allah berfirman:\n\nDan jelaslah bagi mereka kejahatan apa yang telah mereka kerjakan dan mereka diliputi oleh apa yang dahulu mereka selalu memperolok-olokkannya. (az-Zumar\/39: 48)",
      "text_translation": "Maka ketika mereka melihat azab (pada hari Kiamat) sudah dekat, wajah orang-orang kafir itu menjadi muram. Dan dikatakan (kepada mereka), “Inilah (azab) yang dahulunya kamu minta.” ",
      "text": "فَلَمَّا رَاَوْهُ زُلْفَةً سِيْۤـَٔتْ وُجُوْهُ الَّذِيْنَ كَفَرُوْا وَقِيْلَ هٰذَا الَّذِيْ كُنْتُمْ بِهٖ تَدَّعُوْنَ ",
      "text_translation_en": "Yet in the end, when they shall see that [fulfilment] close at hand, the faces of those who were bent on denying the truth will be stricken with grief; and they will be told, \"This it is that you were [so derisively] calling for!\"",
      "juz_number": 29
    },
    "28": {
      "text_tafsir_en": "The Messenger of Allah (may peace be upon him) called upon the disbelievers to believe in the One True God and to explain that those who worship idols are ignorant, because they worship something that can bring no benefit and harm. In response to the Prophet's call, they said to his friends, \"Just wait until our god kills or destroys Muhammad and his followers. only then will we escape the disturbance and the seductions. \" Is not God sufficient for His servants? They scare you with something other than Him. Whoever is left astray by Allah then no one can guide him. (az-Zumar \/ 39: 36) Allah contradicted their words by ordering the Prophet Muhammad to say to them, \"O ye heathen! that you worship other than Allah, while I and all the believers perish and die? Do I and those who believe with me be freed from the torment of Allah whom you disobey? His decree that punishment will be given to those who disobey Him and do evil? Have you never thought about the consequences of your prayers, O unbelievers? the heaven which he promised us, will ye escape the punishment of Allah, and who will deliver you from the torment of God? \" The answer given by the Messenger of Allah above is a very accurate and influential answer to the hearts and minds of the Muslims, because those who speak the word to them are people they trust, believe, and acknowledge in their leadership. That person was the Prophet Muhammad whom they had resolved to resolve the dispute between them, and they acknowledged that it was the most appropriate and just solution. Although the teachings of Muhammad are different from the beliefs they hold, personally Muhammad is the answer that can be accepted by those who want to use their senses correctly.",
      "text_tafsir": "Rasulullah saw menyeru orang-orang kafir agar beriman kepada Allah Yang Maha Esa dan menerangkan bahwa orang-orang yang menyembah berhala itu adalah orang yang bodoh, karena mereka menyembah sesuatu yang tidak dapat mendatangkan manfaat dan mudarat. Sebagai reaksi terhadap seruan Rasulullah itu, mereka berkata kepada teman-temannya, \"Tunggu sajalah sampai saat tuhan kita membunuh atau mencelakakan Muhammad dan pengikut-pengikutnya. Jika mereka telah rusak binasa atau terbunuh semuanya, tentu mereka akan berhenti dengan sendirinya menyiarkan agama mereka. Pada waktu itu barulah kita terlepas dari gangguan dan hasutan-hasutannya.\"\n\nBukankah Allah yang mencukupi hamba-Nya? Mereka menakut-nakutimu dengan (sesembahan) yang selain Dia. Barang siapa dibiarkan sesat oleh Allah maka tidak seorang pun yang dapat memberi petunjuk kepadanya. (az-Zumar\/39: 36)\n\nAllah membantah perkataan mereka dengan memerintahkan Nabi Muhammad untuk mengatakan kepada mereka, \"Wahai orang-orang musyrik, cobalah terangkan kepadaku, apakah faedah dan manfaat yang akan kamu peroleh, jika doamu itu diperkenankan oleh berhala-berhala yang kamu sembah selain Allah, sementara aku dan semua orang-orang yang beriman rusak binasa dan mati semua? Apakah kebinasaan aku dan orang-orang yang beriman bersamaku itu dapat membebaskan kamu dari azab Allah yang kamu durhakai itu? Tidaklah kamu sekalian ingat bahwa telah menjadi ketetapan-Nya, bahwa azab itu tetap diberikan kepada setiap orang yang ingkar kepada-Nya dan selalu berbuat kejahatan? Apakah kamu tidak pernah memikirkan akibat doamu itu hai orang-orang kafir? Seandainya aku dan pengikut-pengikutku mati semua dan dimasukkan-Nya ke dalam surga yang dijanjikan-Nya kepada kami, apakah kamu akan lepas dari azab Allah, dan siapakah yang dapat melepaskan kamu dari azab Allah itu?\"\n\nJawaban yang disampaikan oleh Rasulullah saw di atas merupakan jawaban yang sangat tepat dan mempengaruhi hati dan pikiran kaum musyrikin, karena yang menyampaikan perkataan itu kepada mereka adalah orang yang mereka percayai, segani, dan akui kepemimpinannya. Orang itu adalah Nabi Muhammad yang pernah mereka serahi menyelesaikan perselisihan yang terjadi antar mereka, dan mereka mengakui penyelesaiannya itu adalah penyelesaian yang paling tepat dan adil. Walaupun ajaran yang disampaikan Muhammad itu berbeda dengan kepercayaan yang mereka anut, tetapi pribadi Muhammad itu adalah jawaban yang dapat diterima oleh orang yang mau mempergunakan akal pikirannya dengan benar.",
      "text_translation": "Katakanlah (Muhammad), “Tahukah kamu jika Allah mematikan aku dan orang-orang yang bersamaku atau memberi rahmat kepada kami, (maka kami akan masuk surga), lalu siapa yang dapat melindungi orang-orang kafir dari azab yang pedih?”",
      "text": "قُلْ اَرَءَيْتُمْ اِنْ اَهْلَكَنِيَ اللّٰهُ وَمَنْ مَّعِيَ اَوْ رَحِمَنَاۙ فَمَنْ يُّجِيْرُ الْكٰفِرِيْنَ مِنْ عَذَابٍ اَلِيْمٍ ",
      "text_translation_en": "SAY [O Prophet]: \"What do you think? Whether God destroys me and those who follow me, or graces us with His mercy - is there anyone that could protect [you] deniers of the truth from grievous suffering [in the life to come]?\"",
      "juz_number": 29
    },
    "29": {
      "text_tafsir_en": "Allah ordered the Prophet Muhammad to say to the disbelievers of Mecca, \"O unbelievers! My followers and I have believed in the Lord of the universe, the Beneficent and Merciful God of His servants, the Lord who appointed just to Him we give up and all our affairs, for it is He who determines our state, and only to Him we ask for help, for it is only He who helps and sustains us for the survival of our lives. Only He can save us from all the calamities and calamities that may come upon us. \" This verse seems to criticize the attitudes and actions of the pagans who worship their own statues that are of no avail and harm even to their own guardians. So is the attitude of the infidels who constantly boast of their wealth, power, and posterity, as God said: And they say, \"We have more wealth and children (than you) and we will not be punished.\" (Saba '\/ 34: 35) Because of this disbelief, they will not enjoy the happiness of the hereafter. They will soon find out who among them and the believers are on the right path and who are on the wrong path. Those who walk the right path to the good place are full of joy and those who go the wrong way will surely go to the wrong place, full of misery and suffering.",
      "text_tafsir": "Allah memerintahkan kepada Nabi Muhammad untuk mengatakan kepada orang-orang kafir Mekah, \"Hai orang-orang kafir; aku dan pengikut-pengikutku telah beriman kepada Tuhan semesta alam, Tuhan Yang Maha Pemurah dan Maha Penyayang kepada hamba-hamba-Nya, Tuhan yang menetapkan hukum dengan adil. Hanya kepada-Nya sajalah kami serahkan diri dan segala urusan kami, karena Dialah yang menentukan keadaan diri kami dan hanya kepada-Nya sajalah kami mohon pertolongan, karena hanya Dialah yang memberi pertolongan dan memberi kami rezeki untuk kelangsungan hidup dan kehidupan kami. Hanya Dialah yang dapat membebaskan kami dari semua bencana dan malapetaka yang mungkin menimpa kami.\" \n\nAyat ini seolah-olah mencela sikap dan tindakan orang-orang kafir yang menyembah patung-patung yang mereka buat sendiri yang tidak dapat memberi manfaat dan mudarat bahkan harus mereka sendiri yang memelihara dan merawatnya. Demikian pula sikap orang-orang kafir yang selalu membangga-banggakan kekayaan, kekuasaan, dan keturunan mereka, sebagaimana Allah berfirman:\n\nDan mereka berkata, \"Kami memiliki lebih banyak harta dan anak-anak (daripada kamu) dan kami tidak akan diazab.\" (Saba'\/34: 35)\n\nKarena kekafiran itu, mereka tidak akan memperoleh kesenangan hidup di akhirat nanti. Kelak mereka akan mengetahui, siapa di antara mereka dan orang-orang mukmin yang menempuh jalan yang benar dan siapa yang menempuh jalan yang sesat. Yang menempuh jalan yang benar sampai ke tempat yang baik penuh kenikmatan dan yang menempuh jalan yang sesat tentu akan sampai di tempat yang sesat pula, penuh kesengsaraan dan penderitaan.",
      "text_translation": "Katakanlah, “Dialah Yang Maha Pengasih, kami beriman kepada-Nya dan kepada-Nya kami bertawakal. Maka kelak kamu akan tahu siapa yang berada dalam kesesatan yang nyata.” ",
      "text": "قُلْ هُوَ الرَّحْمٰنُ اٰمَنَّا بِهٖ وَعَلَيْهِ تَوَكَّلْنَاۚ فَسَتَعْلَمُوْنَ مَنْ هُوَ فِيْ ضَلٰلٍ مُّبِيْنٍ ",
      "text_translation_en": "Say: \"He is the Most Gracious: we have attained to faith in Him, and in Him have we placed our trust; and in time you will come to know which of us was lost in manifest error.\"",
      "juz_number": 29
    },
    "30": {
      "text_tafsir_en": "In this verse, God again describes the signs of His greatness and power, after the last verse He commands to rely on Him. Allah ordered Muhammad to say to the disbelievers, \"O unbelievers, try to explain to me what you think, if it is the will of Allah that all the water that flows through the surface of the earth is absorbed into the soil, so that your sources of water and wells is it dry, your heaps cannot draw water? Can your god bring forth water, that you may drink, and your gardens may be restored, and your livestock may flourish? There is nothing that can bring forth the water. except Allah is the Beneficent and Merciful of His servants. Why do you still associate Him with something that is not worthy of Him? \" This verse asks the unbelievers to compare the basics of the divine according to their understanding with the nature of the divinity according to the religion that Muhammad saw. The God worshiped as taught by the Messenger of Allah is the Creator of all beings, and preserves the survival of all who live in this world. He is omnipotent and omnipotent, not needing anything to help him and so on. It is not God created by man or raised by man to be worshiped, as is the divine understanding of the Muslims. This verse reminds them that the God who is worshiped is the only God, childless, unborn, unified in anything, and does not need any other beings to assist him in carrying out all matters.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan lagi tanda-tanda kebesaran dan kekuasaan-Nya, setelah pada ayat yang lalu Dia memerintahkan agar bertawakal kepada-Nya. Allah memerintahkan Muhammad mengatakan kepada orang-orang kafir, \"Hai orang-orang kafir, cobalah terangkan kepadaku, apa yang terpikir olehmu, seandainya atas kehendak Allah seluruh air yang mengalir di permukaan bumi ini meresap ke dalam tanah, sehingga sumber-sumber air dan sumurmu menjadi kering, timba-timbamu tidak dapat menimba air lagi. Apakah tuhanmu yang lain dapat mendatangkan air itu, sehingga kamu dapat minum, kebun-kebunmu menjadi subur kembali dan binatang-binatang ternakmu dapat berkembang biak? Tidak ada sesuatu pun yang dapat mendatangkan air itu kecuali Allah Yang Maha Pemurah dan Penyayang kepada hamba-hamba-Nya. Kenapa kamu masih menyekutukan-Nya dengan sesuatu yang tidak layak bagi-Nya?\"\n\nAyat ini menyuruh orang-orang kafir membandingkan dasar ketuhanan menurut pengertian mereka dengan sifat pemahaman ketuhanan menurut agama yang disampaikan Muhammad saw. Tuhan yang disembah menurut yang diajarkan Rasulullah adalah Tuhan pencipta seluruh makhluk, dan menjaga kelangsungan hidup semua yang hidup di alam ini. Dia Mahakuasa dan Maha Menentukan segala sesuatu, tidak memerlukan sesuatu apa pun untuk menolong-Nya dan sebagainya. Bukan Tuhan yang dibuat manusia atau diangkat oleh manusia sendiri untuk disembah, seperti pemahaman ketuhanan orang-orang musyrik. Ayat ini seakan mengingatkan mereka bahwa Tuhan yang pantas disembah itu hanyalah Tuhan Yang Maha Esa, tidak beranak, tidak dilahirkan, tidak berserikat dengan suatu apa pun, dan tidak memerlukan makhluk-makhluk lain untuk membantu-Nya melaksanakan setiap urusan.",
      "text_translation": "Katakanlah (Muhammad), “Terangkanlah kepadaku jika sumber air kamu menjadi kering; maka siapa yang akan memberimu air yang mengalir?”",
      "text": "قُلْ اَرَءَيْتُمْ اِنْ اَصْبَحَ مَاۤؤُكُمْ غَوْرًا فَمَنْ يَّأْتِيْكُمْ بِمَاۤءٍ مَّعِيْنٍ ࣖ ",
      "text_translation_en": "Say [unto those who deny the truth]: \"What do you think? If of a sudden all your water were to vanish underground, who [but God] could provide you with water from [new] unsullied springs?\"",
      "juz_number": 29
    }
  },
  "name": "الملك",
  "name_translation_en": "The Sovereignty",
  "name_translation": "Kerajaan",
  "name_latin": "Al-Mulk"
}