{
  "number": 68,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 52,
  "ayat": {
    "1": {
      "text_tafsir_en": "The disbelievers disagree about the meaning of the letter \"nun\" in this verse. (See also volume I in the description of the letters of pilgrimage found at the beginning of the surah in the Koran). In this verse Allah swears by al-qalam (pen) and all that is written therein. An oath is made to convince the listener or person to speak that the utterance or words are true, no doubt. However, oaths sometimes have other meanings, namely to remind the speaker or the listener that the oath used is noble, valuable, useful, and valuable. Therefore, it is necessary to think and reflect in order to become a lesson and a lesson in the life of this mortal world. The oath in the second sense is the oaths of God found in the surahs of the Qur'an, such as wal-'asr (for time), was-sama '(for heaven), wal-fajr (for dawn), and etc. As with that oath, God reminds people to pay attention to time, sky, dawn, and so on. Everything related to the aforementioned is worth considering because it has to do with human life and life in achieving happiness in the world and in the hereafter. In this verse, Allah swears by the qalam (pen) and everything written on it. This is to say that the qalam is one of the great gifts that God bestows upon mankind, as well as the ability to speak and explain to others. Through qalam, one can record the teachings of the religion of God passed on to his apostles, and record the knowledge of God which he has just discovered. With a letter written by qalam, people can share the good news and the sad news to their family and friends. With qalam, people can enlighten and educate their people, and many more benefits are received by them. In the time of the Messenger of Allah, the Arabs were aware of their meaning and purpose, namely to write down everything that felt, thought, and passed on to others. However, not many of them are using it as many are illiterate and science is not yet developing. At that time, the use of qalam as a means of communicating the religion of God was felt. By qalam, the Qur'anic verses were written on palm fronds and on the bones of animals under the command of the Prophet. He especially values those who are good at writing and reading. This is reflected in the Prophet Muhammad's decision in the Badr War, that a Muslim infidel captive could be set free by paying ransom or teaching Muslims to write and read. In this verse, it is as if God is warning Muslims that His knowledge is infinite, infinite and infinite. Therefore, seek and claim His immense knowledge so that it can be used for worldly purposes. In order to record and pass on knowledge to others and not to be lost in memory or to those who have died, qalam is required as a tool to write it down. Therefore, qalam is closely linked and inseparable from the development of knowledge, well-being, and humanity. The passage of this verse is close to the Qur'anic verse that Allah first revealed to the Prophet Muhammad, the first five verses of Surah al-'Alaq. After the Prophet received verses 1-5 of Surah al-'Alaq, he returned to his home in trembling and fearful. After losing his fear and fear, the Prophet saw Khadijah, his wife, taken to the house of Waraqah bin Naufal, the son of his father's brother (cousin). Everything that happened to the Messenger of Allah in the cave of Hira was conveyed to Waraqah, and responding to it, he said, \"The one who came to Muhammad saw as it had been to the prophets before. Therefore, what the angel Gabriel conveyed was religion that really comes from God. \" Then Waraqah said that he would follow the religion that Muhammad brought.",
      "text_tafsir": "Para mufasir berbeda pendapat tentang arti huruf \"nun\" yang terdapat dalam ayat ini. (Selanjutnya lihat jilid I dalam keterangan tentang huruf-huruf hijaiah yang terdapat pada permulaan surah dalam Al-Qur'an). Dalam ayat ini Allah bersumpah dengan al-qalam (pena) dan segala macam yang ditulis dengannya.\n\nSuatu sumpah dilakukan adalah untuk meyakinkan pendengar atau orang yang diajak berbicara bahwa ucapan atau perkataan yang disampaikan itu adalah benar, tidak diragukan sedikit pun. Akan tetapi, sumpah itu kadang-kadang mempunyai arti yang lain, yaitu untuk mengingatkan orang yang diajak berbicara atau pendengar bahwa yang dipakai untuk bersumpah itu adalah suatu yang mulia, bernilai, bermanfaat, dan berharga. Oleh karena itu, perlu dipikirkan dan direnungkan agar dapat menjadi iktibar dan pengajaran dalam kehidupan dunia yang fana ini. \n\nSumpah dalam arti kedua ini adalah sumpah-sumpah Allah yang terdapat dalam surah-surah Al-Qur'an, seperti wal-'asr (demi masa), was-sama' (demi langit), wal-fajr (demi fajar), dan sebagainya. Seakan-akan dengan sumpah itu, Allah mengingatkan kepada manusia agar memperhatikan masa, langit, fajar, dan sebagainya. Segala sesuatu yang berhubungan dengan yang disebutkan itu perlu diperhatikan karena ada kaitannya dengan hidup dan kehidupan manusia dalam mencapai kebahagiaan di dunia dan di akhirat.\n\nDalam ayat ini, Allah bersumpah dengan qalam (pena) dan segala sesuatu yang ditulis dengannya. Hal itu untuk menyatakan bahwa qalam itu termasuk nikmat besar yang dianugerahkan Allah kepada manusia, di samping nikmat pandai berbicara dan menjelaskan sesuatu kepada orang lain. Dengan qalam, orang dapat mencatat ajaran agama Allah yang disampaikan kepada para rasul-Nya, dan mencatat pengetahuan-pengetahuan Allah yang baru ditemukannya. Dengan surat yang ditulis dengan qalam, orang dapat menyampaikan berita gembira dan berita duka kepada keluarga dan teman akrabnya. Dengan qalam, orang dapat mencerdaskan dan mendidik bangsanya, dan banyak lagi nikmat yang diperoleh manusia dengan qalam itu.\n\nPada masa Rasulullah saw, masyarakat Arab telah mengenal qalam dan kegunaannya, yaitu untuk menulis segala sesuatu yang terasa, yang terpikir, dan yang akan disampaikan kepada orang lain. Sekalipun demikian, belum banyak di antara mereka yang mempergunakannya karena masih banyak yang buta huruf dan ilmu pengetahuan belum berkembang. \n\nPada masa itu, kegunaan qalam sebagai sarana menyampaikan agama Allah sangat dirasakan. Dengan qalam, ayat-ayat Al-Qur'an ditulis di pelepah-pelepah kurma dan tulang-tulang binatang atas perintah Rasulullah. Beliau sendiri sangat menghargai orang-orang yang pandai menulis dan membaca. Hal ini tampak pada keputusan Nabi Muhammad saw pada Perang Badar, yaitu seorang kafir yang ditawan kaum Muslimin dapat dibebaskan dengan cara membayar uang tebusan atau mengajar kaum Muslimin menulis dan membaca.\n\nDengan ayat ini, seakan-akan Allah mengisyaratkan kepada kaum Muslimin bahwa ilmu-Nya sangat luas, tiada batas dan tiada terhingga. Oleh karena itu, cari dan tuntutlah ilmu-Nya yang sangat luas itu agar dapat dimanfaatkan untuk kepentingan duniawi. Untuk mencatat dan menyampaikan ilmu kepada orang lain dan agar tidak hilang karena lupa atau orang yang memilikinya meninggal dunia, diperlukan qalam sebagai alat untuk menuliskannya. Oleh karena itu, qalam erat hubungannya dan tidak dapat dipisahkan dengan perkembangan ilmu, kesejahteraan, dan kemaslahatan umat manusia.\n\nMasa turun ayat ini dekat dengan ayat Al-Qur'an yang pertama kali diturunkan Allah kepada Nabi Muhammad saw, yaitu lima ayat pertama Surah al-'Alaq. Setelah Nabi menerima ayat 1-5 Surah al-'Alaq itu, beliau pulang ke rumahnya dalam keadaan gemetar dan ketakutan. Setelah hilang rasa gentar dan takutnya, Nabi saw dibawa Khadijah, istri beliau, ke rumah Waraqah bin Naufal, anak dari saudara ayahnya (saudara sepupu). Semua yang terjadi atas diri Rasulullah di gua Hira itu disampaikan kepada Waraqah, dan menanggapi hal itu, ia berkata, \"Yang datang kepada Muhammad saw itu adalah seperti yang pernah datang kepada nabi-nabi sebelumnya. Oleh karena itu, yang disampaikan malaikat Jibril itu adalah agama yang benar-benar berasal dari Allah.\" Kemudian Waraqah mengatakan bahwa ia akan mengikuti agama yang dibawa Muhammad itu.",
      "text_translation": "Nun. Demi pena dan apa yang mereka tuliskan, ",
      "text": "نۤ ۚوَالْقَلَمِ وَمَا يَسْطُرُوْنَۙ",
      "text_translation_en": "Nun. CONSIDER the pen, and all that they write [therewith]!",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "In this verse, Allah explicitly tells the Prophet Muhammad that he does not need any favor from anyone other than the favor of Allah. Could it be that Muhammad is said to be a madman, having obtained so much favor and bounty from Allah? In another verse it is stated: And they say, \"O people to whom the Qur'an has been revealed, surely you (Muhammad) are indeed a madman.\" (al-hijr \/ 15: 6) After the Quraysh learned the statement of Waraqah bin Naufal and the Messenger of Allah conveyed to them Islam, they accused Muhammad of being a madman or a sorcerer who wanted to turn the Quraysh out of religion their ancestors. Therefore, they ordered his people to never listen to what Muhammad saw, and not to believe that what he received was truly the religion of God. Could it be that a human, a madman or a magician is believed by God to convey his religion? In connection with the attitude of the Quraysh, this verse is used to strengthen Muhammad's treatise, to strengthen his heart, and to commemorate the gift bestowed upon him. By this, God implies that the true religion which originates with Him is the religion that drives people to seek and seek His broad knowledge, and then leverages that knowledge for the benefit of humanity and humanity. Every knowledge of God acquired must be written in pen, so that it can be learned and read by others, so that knowledge grows. With that knowledge too, humans will be able to make progress. Therefore, learning to read and write with pens is the basis for a people's progress. If people want to move forward, then encourage them to learn to write and read. With the passage of this verse, the heart of the Messenger of Allah (may peace be upon him) grew steadily, calmly, and powerfully in carrying out his task of communicating the religion of Allah. He also had strong arguments in dealing with the attitude of the Quraysh. With this verse, God answers the accusations of the Quraysh by asking them to reconsider the history of the great Prophet Muhammad and grow up before their own eyes. Was it not before he was sent to the apostles, the people who said he was mad and respected him? Do they not remember that among them there was a dispute over who had the right to lift Aswad and put him in his place. The incident almost caused bloodshed, and no one could reconcile it. Then they asked Muhammad to be willing to be a peacemaker among them. They accept the decision Muhammad made on them, and they consider that the decision he makes is the most fair one. Is it possible that a good man, endowed with God of truth, of good manners, always helps and helps those in need, and is an example and example to the Quraysh, is suddenly insane as he executes the commands of the God of the universe, which is to convey the religion of Allah and migrated to Medinah. In view of the structure of this verse, there is an example that Muslims must emulate, even though the Quraysh people have been harsh and hurt their hearts and bodies, but the Messenger of Allah (may peace be upon him) denied their accusations in a good and educational way. He told them to use the right mindset and to use good norms.",
      "text_tafsir": "Dalam ayat ini, Allah menyatakan dengan tegas kepada Nabi Muhammad saw bahwa beliau tidak memerlukan suatu nikmat pun dari orang lain selain dari nikmat Allah. Mungkinkah Muhammad itu dikatakan seorang gila, karena memperoleh nikmat dan karunia yang sangat besar dari Allah? Pada ayat lain dinyatakan:\n\nDan mereka berkata, \"Wahai orang yang kepadanya diturunkan Al-Qur'an, sesungguhnya engkau (Muhammad) benar-benar orang gila.\" (al-hijr\/15: 6)\n\nSetelah orang-orang Quraisy mengetahui pernyataan Waraqah bin Naufal itu dan Rasulullah menyampaikan agama Islam kepada mereka, maka mereka menuduh bahwa Muhammad saw dihinggapi penyakit gila atau seorang tukang tenung yang ingin memalingkan orang-orang Quraisy dari agama nenek moyang mereka. Oleh karena itu, mereka memerintahkan kepada kaumnya agar jangan sekali-kali mendengarkan ucapan Muhammad saw, dan jangan mempercayai bahwa yang diterimanya benar-benar agama Allah. Mungkinkah seorang manusia, seorang gila atau seorang tukang tenung dipercaya Allah menyampaikan agama-Nya?\n\nSehubungan dengan sikap orang-orang Quraisy itu, turunlah ayat ini untuk menguatkan risalah Muhammad saw, menguatkan hati beliau, dan mengingatkan karunia yang telah dilimpahkan kepadanya. Dengan ini, Allah mengisyaratkan bahwa agama yang benar dan berasal dari-Nya ialah agama yang mendorong manusia mencari dan menuntut ilmu-Nya yang luas, kemudian memanfaatkan ilmu itu untuk kepentingan manusia dan kemanusiaan. \n\nSetiap ilmu Allah yang diperoleh itu harus ditulis dengan pena, agar dapat dipelajari dan dibaca oleh orang lain, sehingga ilmu itu berkembang. Dengan ilmu itu juga, manusia akan dapat mencapai kemajuan. Oleh karena itu, belajar membaca dan menulis dengan pena adalah pangkal kemajuan suatu umat. Apabila manusia ingin maju, maka galakkanlah belajar menulis dan membaca. Dengan turunnya ayat ini, hati Rasulullah saw bertambah mantap, tenang, dan kuat untuk melaksanakan tugasnya menyampaikan agama Allah. Beliau mempunyai argumentasi yang kuat pula dalam menghadapi sikap orang-orang Quraisy.\n\nDengan ayat ini, Allah menjawab tuduhan orang-orang Quraisy itu dengan menyuruh mereka mempelajari kembali sejarah hidup Nabi Muhammad yang besar dan tumbuh di hadapan mata kepala mereka sendiri. Bukankah sebelum ia diutus menjadi rasul, orang-orang yang mengatakannya gila itu menghormati dan menjadikannya sebagai orang yang paling mereka percayai? Apakah mereka tidak ingat lagi bahwa di antara mereka pernah terjadi perselisihan tentang siapa yang berhak mengangkat hajar Aswad dan meletakkannya pada tempatnya yang semula. Peristiwa itu hampir menimbulkan pertumpahan darah, dan tidak seorang pun yang dapat mendamaikannya. Lalu mereka minta kepada Muhammad untuk bersedia menjadi juru damai di antara mereka. Mereka menerima keputusan yang ditetapkan Muhammad atas mereka, dan mereka menganggap bahwa keputusan yang diberikannya itu adalah keputusan yang paling adil.\n\nMungkinkah seorang yang semula baik, dianugerahi Allah kejujuran, kehalusan budi pekerti, selalu menolong dan membantu siapa saja yang memerlukannya, dan menjadi contoh dan teladan bagi orang Quraisy, tiba-tiba menjadi gila karena ia melaksanakan perintah Tuhan semesta alam, yaitu menyampaikan agama Allah dan berhijrah ke Medinah.\n\nJika diperhatikan susunan ayat ini, ada suatu teladan yang harus ditiru oleh kaum Muslimin, yaitu walaupun orang-orang Quraisy telah bersikap kasar dan menyakiti hati dan jasmaninya, namun Rasulullah saw membantah tuduhan-tuduhan mereka dengan cara yang baik dan mendidik. Beliau menyuruh mereka menggunakan akal pikiran yang benar dan menggunakan norma-norma yang baik.",
      "text_translation": "dengan karunia Tuhanmu engkau (Muhammad) bukanlah orang gila. ",
      "text": "مَآ اَنْتَ بِنِعْمَةِ رَبِّكَ بِمَجْنُوْنٍ ",
      "text_translation_en": "Thou art not, by thy Sustainer's grace, a madman!",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "The previous verse depicts the accusations of Mecca infidels claiming that the Prophet Muhammad was crazy for daring against the teachings of their ancestors and constantly proclaiming new teachings contrary to their teachings, worshiping statues and idols, despite all that the Prophet had done. is at the command of God. It is Allah who gives the Prophet favor with great vigor and zeal in carrying out his preaching. In this verse, God emphasizes that the Prophet actually received a reward that was unbroken. This asserted that the Prophet Muhammad was not a madman because he was the rewarder of Allah This verse also included something that would happen in the future, as it signified that the Prophet Muhammad and the Muslims would be victorious Thanks to God's help and protection, his efforts and hard work resulted in the spread of Islam in the Arabian Peninsula, which then spread to the rest of the world. The Quraysh who have been in power and practiced Shiloh for 23 years are believers and defenders of Islam. This was a great victory for Muhammad and the Muslims, and in the hereafter they would receive a reward of eternal happiness in heaven. With such a statement of God and the gesture that the Prophet saw from his word, he increased his courage, determination, and patience in carrying out his preaching, ignoring the ridicule and pressure of the Quraysh.",
      "text_tafsir": "Pada ayat yang lalu digambarkan tuduhan orang-orang kafir Mekah yang menyatakan bahwa Nabi Muhammad itu gila karena berani melawan ajaran nenek moyang mereka dan terus menerus mendakwahkan ajaran baru yang bertentangan dengan ajaran mereka, yang menyembah patung-patung dan berhala, padahal semua yang dilakukan Nabi adalah atas perintah Allah. Allah yang memberikan nikmat kepada Nabi dengan ketabahan dan semangat yang besar dalam melaksanakan dakwah. Pada ayat ini, Allah menegaskan bahwa Nabi benar-benar memperoleh pahala yang terus menerus tiada terputus. Maka hal ini menegaskan bahwa Nabi Muhammad bukanlah orang yang gila karena beliau seorang yang memperoleh pahala dari Allah\n\nAyat ini juga termasuk yang menerangkan sesuatu yang akan terjadi pada masa yang akan datang, karena mengisyaratkan bahwa Nabi Muhammad dan kaum Muslimin akan memperoleh kemenangan besar. Berkat pertolongan dan perlindungan Allah, usaha dan jerih payahnya membawa hasil dengan tersebarnya agama Islam di Jazirah Arab, yang kemudian memancar ke seluruh penjuru dunia. Orang-orang Quraisy yang semula berkuasa dan menganut agama syirik dalam masa 23 tahun menjadi mukmin dan menjadi pembela-pembela agama Islam. Hal ini merupakan kemenangan yang besar bagi Muhammad saw dan kaum Muslimin, dan di akhirat nanti mereka akan memperoleh balasan kenikmatan yang kekal di dalam surga.\n\nDengan pernyataan Allah yang demikian dan isyarat yang dipahami Nabi saw dari firman-Nya itu, bertambahlah kekuatan hati, kebulatan tekad, dan kesabaran beliau dalam melaksanakan dakwah, dengan tidak menghiraukan ejekan dan tekanan tindakan orang-orang Quraisy.",
      "text_translation": "Dan sesungguhnya engkau pasti mendapat pahala yang besar yang tidak putus-putusnya. ",
      "text": "وَاِنَّ لَكَ لَاَجْرًا غَيْرَ مَمْنُوْنٍۚ",
      "text_translation_en": "And, verily, thine shall be a reward neverending –",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "This verse reinforces the reason given by the above verse stating that the unending reward was earned by the Messenger of Allah (may peace be upon him) as the fruit of his noble character. The statement that the Prophet Muhammad had a great moral character was a praise to God, which he rarely gave to his other servants. Indirectly, this verse also states that the accusations of the Muhammadans that the Prophet Muhammad was a lunatic is a nonsense, because the better it is for a person to get away from the disease. Instead, the worse a person behaves, the closer he or she gets to the madness. Prophet Muhammad was a man of great integrity, far from being a madman. This verse describes the duty of the Messenger of Allah (may peace be upon him) as a man of noble character. He was given the task of conveying the religion of God to the people so that by conforming to that religion they would have a noble character. He said: Indeed I was sent only to perfect the noble (of man). (Ahmad's History of Abu Hurairah)",
      "text_tafsir": "Ayat ini memperkuat alasan yang dikemukakan ayat di atas dengan menyatakan bahwa pahala yang tidak terputus itu diperoleh Rasulullah saw sebagai buah dari akhlak beliau yang mulia. Pernyataan bahwa Nabi Muhammad mempunyai akhlak yang agung merupakan pujian Allah kepada beliau, yang jarang diberikan-Nya kepada hamba-hamba-Nya yang lain. Secara tidak langsung, ayat ini juga menyatakan bahwa tuduhan-tuduhan orang musyrik bahwa Nabi Muhammad adalah orang gila merupakan tuduhan yang tidak beralasan sedikit pun, karena semakin baik budi pekerti seseorang semakin jauh ia dari penyakit gila. Sebaliknya semakin buruk budi pekerti seseorang, semakin dekat ia kepada penyakit gila. Nabi Muhammad adalah seorang yang berakhlak agung, sehingga jauh dari perbuatan gila.\n\nAyat ini menggambarkan tugas Rasulullah saw sebagai seorang yang berakhlak mulia. Beliau diberi tugas menyampaikan agama Allah kepada manusia agar dengan menganut agama itu mereka mempunyai akhlak yang mulia pula. Beliau bersabda:\n\nSesungguhnya aku diutus hanya untuk menyempurnakan akhlak mulia (dari manusia). (Riwayat Ahmad dari Abu Hurairah)",
      "text_translation": "Dan sesungguhnya engkau benar-benar berbudi pekerti yang luhur. ",
      "text": "وَاِنَّكَ لَعَلٰى خُلُقٍ عَظِيْمٍ ",
      "text_translation_en": "for, behold, thou keepest indeed to a sublime way of life;",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "These two verses are a warning to the Muslims and confidently state that they are indeed in the wrong, as they will soon be seen to be true to the religious teachings of the Prophet Muhammad. There will be the strength of Islam and the weakness of the Muslims. Muslims will defeat them, and Islam will be a widespread teaching. With this evidence it is clear that the Prophet Muhammad was not crazy, but the disbelievers who rejected the truth and continued to follow their passions were the ones who lost their senses. This is especially dangerous for them because this wrong attitude and stance will bring them ruin and humiliation. In the world they will lose the influence and power that occurred in many wars with the Muslims in the Badr War, the Uhud War, and the Khandaq War. In the hereafter they will surely regret their misdeeds as they will suffer a severe punishment for their rejection of the Prophet Muhammad's preaching. On the Day of Judgment, all human acts are absorbed, weighed, and shown to each other. At that time, the Muslims saw very clearly, which of them was right, was the Apostle whom they accused of being mad or were they themselves? Here it is clear that the Prophet Muhammad was right, while they were thrown into hell. The Word of God: They will soon find out who the real liar is. (al-Qamar \/ 54: 26)",
      "text_tafsir": "Kedua ayat ini merupakan peringatan kepada kaum musyrikin dan menyatakan dengan pasti bahwa mereka benar-benar dalam keadaan sesat, karena tidak berapa lama lagi akan kelihatan kebenaran ajaran agama yang dibawa Nabi Muhammad saw. Akan kelihatan kekuatan Islam dan kelemahan kaum musyrikin itu. Kaum Muslimin akan mengalahkan mereka, dan agama Islam menjadi ajaran yang tersebar luas.\n\nDengan keterangan ini jelaslah bahwa Nabi Muhammad saw tidak gila, tetapi orang-orang kafir yang menolak kebenaran dan terus menerus mengikuti hawa nafsu itulah yang kehilangan akal sehat. Hal ini justru berbahaya bagi mereka karena sikap dan pendirian yang salah ini akan membawa kehancuran dan kehinaan bagi mereka. Di dunia mereka akan kehilangan pengaruh dan kekuasaan seperti terjadi pada beberapa kali peperangan dengan orang Islam yaitu pada Perang Badar, Perang Uhud, dan Perang Khandaq. Di akhirat mereka pasti akan menyesali kesesatan mereka karena akan mendapat siksa yang pedih karena penolakan mereka pada dakwah Nabi Muhammad saw.\n\nPada hari Kiamat, semua perbuatan manusia dihisab, ditimbang, dan diperlihatkan kepada masing-masing mereka. Di saat itu, kaum musyrikin melihat dengan nyata, siapakah di antara mereka yang benar, apakah Rasul yang mereka tuduh gila ataukah mereka sendiri? Di sini tampak dengan jelas bahwa Nabi Muhammad saw adalah yang benar, sedangkan mereka dilemparkan ke dalam neraka Jahanam. Firman Allah:\n\nKelak mereka akan mengetahui siapa yang sebenarnya sangat pendusta (dan) sombong itu. (al-Qamar\/54: 26)",
      "text_translation": "Maka kelak engkau akan melihat dan mereka (orang-orang kafir) pun akan melihat, ",
      "text": "فَسَتُبْصِرُ وَيُبْصِرُوْنَۙ",
      "text_translation_en": "and [one day] thou shalt see, and they [who now deride thee] shall see,",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "These two verses are a warning to the Muslims and confidently state that they are indeed in the wrong, as they will soon be seen to be true to the religious teachings of the Prophet Muhammad. There will be the strength of Islam and the weakness of the Muslims. Muslims will defeat them, and Islam will be a widespread teaching. With this evidence it is clear that the Prophet Muhammad was not crazy, but the disbelievers who rejected the truth and continued to follow their passions were the ones who lost their senses. This is especially dangerous for them because this wrong attitude and stance will bring them ruin and humiliation. In the world they will lose the influence and power that occurred in many wars with the Muslims in the Badr War, the Uhud War, and the Khandaq War. In the hereafter they will surely regret their misdeeds as they will suffer a severe punishment for their rejection of the Prophet Muhammad's preaching. On the Day of Judgment, all human acts are absorbed, weighed, and shown to each other. At that time, the Muslims saw very clearly, which of them was right, was the Apostle whom they accused of being mad or were they themselves? Here it is clear that the Prophet Muhammad was right, while they were thrown into hell. The Word of God: They will soon find out who the real liar is. (al-Qamar \/ 54: 26)",
      "text_tafsir": "Kedua ayat ini merupakan peringatan kepada kaum musyrikin dan menyatakan dengan pasti bahwa mereka benar-benar dalam keadaan sesat, karena tidak berapa lama lagi akan kelihatan kebenaran ajaran agama yang dibawa Nabi Muhammad saw. Akan kelihatan kekuatan Islam dan kelemahan kaum musyrikin itu. Kaum Muslimin akan mengalahkan mereka, dan agama Islam menjadi ajaran yang tersebar luas.\n\nDengan keterangan ini jelaslah bahwa Nabi Muhammad saw tidak gila, tetapi orang-orang kafir yang menolak kebenaran dan terus menerus mengikuti hawa nafsu itulah yang kehilangan akal sehat. Hal ini justru berbahaya bagi mereka karena sikap dan pendirian yang salah ini akan membawa kehancuran dan kehinaan bagi mereka. Di dunia mereka akan kehilangan pengaruh dan kekuasaan seperti terjadi pada beberapa kali peperangan dengan orang Islam yaitu pada Perang Badar, Perang Uhud, dan Perang Khandaq. Di akhirat mereka pasti akan menyesali kesesatan mereka karena akan mendapat siksa yang pedih karena penolakan mereka pada dakwah Nabi Muhammad saw.\n\nPada hari Kiamat, semua perbuatan manusia dihisab, ditimbang, dan diperlihatkan kepada masing-masing mereka. Di saat itu, kaum musyrikin melihat dengan nyata, siapakah di antara mereka yang benar, apakah Rasul yang mereka tuduh gila ataukah mereka sendiri? Di sini tampak dengan jelas bahwa Nabi Muhammad saw adalah yang benar, sedangkan mereka dilemparkan ke dalam neraka Jahanam. Firman Allah:\n\nKelak mereka akan mengetahui siapa yang sebenarnya sangat pendusta (dan) sombong itu. (al-Qamar\/54: 26)",
      "text_translation": "siapa di antara kamu yang gila? ",
      "text": "بِاَيِّىكُمُ الْمَفْتُوْنُ ",
      "text_translation_en": "which of you was bereft of reason.",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "In this verse, Allah reaffirms his statement in the first verse by telling the Prophet Muhammad that the Muslims must know the real deeds he has performed. Allah and the Prophet Muhammad know best who deviate from the right path laid out for him so that they will experience misery in this world and in the hereafter. Allah also knows who follows the right path and obtains all that they desire, the happiness of living in the world and in the hereafter, the actions of those who deviate from the right path, therefore they will experience misery in the world, such as defeat in war and destruction their faith and in the hereafter they will have a painful torment.",
      "text_tafsir": "Pada ayat ini, Allah menegaskan lagi pernyataan-Nya pada ayat dahulu dengan mengatakan kepada Nabi Muhammad saw bahwa orang-orang musyrik itu pasti mengetahui perbuatan-perbuatan nyata yang telah dilaksanakannya. Allah dan Nabi Muhammad lebih mengetahui siapa yang menyimpang dari jalan yang benar yang telah dibentangkan untuknya sehingga mereka memperoleh kesengsaraan hidup di dunia dan di akhirat. Allah mengetahui pula siapa yang mengikuti jalan yang benar sehingga memperoleh segala yang mereka inginkan yaitu kebahagiaan hidup di dunia dan di akhirat, tindakan orang-orang yang menyimpang dari jalan yang benar, karena itu mereka akan merasakan kesengsaraan di dunia, seperti kekalahan dalam peperangan dan kehancuran kepercayaan mereka dan di akhirat mereka mendapat azab yang pedih.",
      "text_translation": "Sungguh, Tuhanmu, Dialah yang paling mengetahui siapa yang sesat dari jalan-Nya; dan Dialah yang paling mengetahui siapa orang yang mendapat petunjuk. ",
      "text": "اِنَّ رَبَّكَ هُوَ اَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيْلِهٖۖ وَهُوَ اَعْلَمُ بِالْمُهْتَدِيْنَ ",
      "text_translation_en": "Verily, thy Sustainer alone is fully aware as to who has strayed from His path, Just as He alone is fully aware of those who have found the right way.",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "This verse commands the Messenger of Allah (may peace be upon him) to reject all kinds of offers, demands, and desires of the Meccans who refuse to listen to the verses of Allah and even reject them. The Prophet was forbidden to follow them, because they were on the wrong path while he was on the straight path. In another verse, God says: And if you follow the majority of the people on this earth, they will mislead you from the way of Allah. What they are following is a mere speculation and they are just lying. (al-An'am \/ 6: 116)",
      "text_tafsir": "Ayat ini memerintahkan Rasulullah saw agar tetap menolak segala macam tawaran, ajakan, dan keinginan orang-orang musyrik Mekah yang tidak mau mendengarkan ayat-ayat Allah, bahkan mereka mendustakannya. Rasulullah dilarang mengikuti mereka, karena mereka berada di jalan yang sesat sedang beliau telah berada di jalan yang lurus.\n\nPada ayat lain, Allah berfirman:\n\nDan jika kamu mengikuti kebanyakan orang di bumi ini, niscaya mereka akan menyesatkanmu dari jalan Allah. Yang mereka ikuti hanya persangkaan belaka dan mereka hanyalah membuat kebohongan. (al-An'am\/6: 116)",
      "text_translation": "Maka janganlah engkau patuhi orang-orang yang mendustakan (ayat-ayat Allah).",
      "text": "فَلَا تُطِعِ الْمُكَذِّبِيْنَ ",
      "text_translation_en": "Hence, defer not to [the likes and dislikes of] those who give the lie to the truth:",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "This verse explains that the Muslims wanted the Prophet to follow and fulfill his request, and he accepted their call for the Prophet to be gentle towards them. If the Messenger of Allah and the Muslims will be gentle towards them, then they will be gentle towards him and the Muslims. According to one history, the Quraysh had once offered the Messenger to be willing to reduce his preaching activities, and to no longer criticize their idols. Even they were willing to follow the teachings of the Prophet for once, as long as the Prophet and his followers followed their teachings once in a while, so they took turns. This request was, of course, rejected by the Prophet for disobeying the preaching he had taken to abandon homosexuality and replace it with monotheism. This invocation began when the Messenger conveyed the religion of Allah to the Meccans openly and boldly, even at that time the Muslims were in a weak state and the enemy in power. All the reasons given by the Prophet in connection with the proof of the truth of his leaflet cannot be answered by the Muslims. Instead, their answers show the weakness of their beliefs. Therefore, they asked the Prophet to be abusive towards them and to stop his insults towards the idols they worshiped. If the Messenger of Allah (may peace be upon him) was willing to accept the offer, then they would be willing to fulfill his wishes, such as being gentle towards the Prophet and the Muslims. They are also willing to worship God while still being allowed to worship their gods and practice their ancestors' customs. They are also ready to find a wife whom the Prophet saw, or to collect the treasure they want. Inspired by the desire to alleviate the suffering of his friends as a result of the torture of the Muslims, it came to Muhammad's mind to be gentle towards the Muslims by accepting some of their offers. So this verse goes down which warns the Prophet (peace be upon him) not to be cruel to them, but to be as usual, to take a strong and firm attitude. This verse is in harmony with the word of Allah: And if We had not strengthened (our hearts), you would have leaned a little towards them. If so, surely We will taste of you twice in this world and twice in death, and you (Muhammad) will find no helper for Us. (al-Isra '\/ 17: 74-75) When it comes to the meaning of this verse, it will be known that there are certain purposes of the Muslims, which the Messenger cannot know, in making their offer to him. They wanted to deceive the Messenger of Allah with that request, which if accepted, then the newly introduced Islam would mix with the elements of shirk. There will be mutual influence between these two religions, so that Islam no longer has a pure monotheism. Allah's warning to the Messenger of Allah (may peace be upon him) is also a warning to all Muslims, so that they may be careful in matters of faith. Never incorporate into the Islamic creed a little shirk.",
      "text_tafsir": "Ayat ini menerangkan bahwa orang-orang musyrik ingin agar Rasulullah mengikuti dan memenuhi permintaan, dan memperkenankan ajakan mereka agar Rasulullah bersikap lunak terhadap mereka. Jika Rasulullah dan kaum Muslimin mau bersikap lunak terhadap mereka, maka mereka akan bersikap lunak pula terhadap beliau dan kaum Muslimin.\n\nMenurut suatu riwayat, orang-orang Quraisy pernah menawarkan kepada Rasulullah agar bersedia mengurangi kegiatan dakwahnya, dan tidak lagi mencela berhala-berhala mereka. Bahkan mereka bersedia mengikuti ajaran Nabi selama sekali waktu, asalkan setelah itu Nabi dan pengikutnya mengikuti ajaran mereka sekali waktu, begitu secara bergilir. Ajakan ini tentu saja ditolak oleh Nabi karena tidak sesuai dengan dakwah yang dibawanya untuk meninggalkan kemusyrikan dan mengganti dengan ajaran tauhid.\n\nAjakan ini bermula ketika Rasulullah menyampaikan agama Allah kepada orang-orang musyrik Mekah dengan terang-terangan dan penuh keberanian, walaupun pada waktu itu kaum Muslimin dalam keadaan lemah dan musuh dalam keadaan kuat. Seluruh alasan-alasan yang dikemukakan Rasulullah yang berhubungan dengan bukti kebenaran risalahnya tidak dapat dijawab oleh orang-orang musyrik. Bahkan sebaliknya, jawaban mereka itu menunjukkan kelemahan kepercayaan yang mereka anut. Oleh karena itu, mereka meminta Rasulullah agar bersikap lunak terhadap mereka dan menghentikan celaan-celaan beliau kepada berhala-berhala yang mereka sembah. Jika Rasulullah saw bersedia menerima tawaran itu, maka mereka bersedia pula memenuhi keinginan-keinginan beliau, seperti bersikap lunak terhadap Rasulullah saw dan kaum Muslimin. Mereka juga bersedia ikut menyembah Allah di samping tetap dibolehkan menyembah tuhan-tuhan mereka dan melaksanakan kebiasaan nenek moyang mereka. Mereka juga bersedia mencarikan istri yang disenangi Nabi saw atau mengumpulkan harta yang diinginkannya.\n\nDilandasi keinginan untuk meringankan penderitaan yang sedang dialami sahabat-sahabatnya akibat siksaan yang dilakukan orang-orang musyrik, maka terlintas dalam pikiran Nabi Muhammad untuk bersikap lunak terhadap orang-orang musyrik dengan menerima sebahagian tawaran mereka. Maka turunlah ayat ini yang memperingatkan Nabi saw agar jangan sekali-kali bersikap lunak terhadap mereka, tetapi tetap seperti biasa, yaitu mengambil sikap keras dan tegas.\n\nAyat ini senada dengan firman Allah:\n\nDan sekiranya Kami tidak memperteguh (hati)mu, niscaya engkau hampir saja condong sedikit kepada mereka. Jika demikian, tentu akan Kami rasakan kepadamu (siksaan) dua kali lipat di dunia ini dan dua kali lipat setelah mati, dan engkau (Muhammad) tidak akan mendapat seorang penolong pun terhadap Kami. (al-Isra'\/17: 74-75)\n\nJika dikaji maksud ayat ini, akan diketahui bahwa ada tujuan tertentu dari orang-orang musyrik, yang tidak boleh diketahui oleh Rasulullah, dalam mengemukakan tawaran mereka kepada beliau. Mereka ingin menipu Rasulullah saw dengan ajakan itu, dimana jika diterima, maka agama Islam yang baru disampaikan itu akan bercampur dengan unsur-unsur syirik. Akan terjadi saling mempengaruhi antara kedua macam kepercayaan itu, sehingga agama Islam tidak lagi mempunyai akidah tauhid yang murni.\n\nTeguran Allah kepada Rasulullah saw ini juga merupakan teguran kepada seluruh kaum Muslimin, agar mereka berhati-hati dalam soal akidah. Jangan sekali-kali memasukkan ke dalam akidah Islam unsur syirik walaupun sedikit.",
      "text_translation": "Mereka menginginkan agar engkau bersikap lunak maka mereka bersikap lunak (pula). ",
      "text": "وَدُّوْا لَوْ تُدْهِنُ فَيُدْهِنُوْنَۚ",
      "text_translation_en": "they would like thee to be soft [with them], so that they might be soft [with thee].",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "In these verses, Allah reminds and instructs the Prophet Muhammad to: 1. Not follow the wishes of those who are easily sworn, because the swearer is just a liar. While lying is the root of evil and the source of all kinds of evil deeds. Therefore, Islam says that lying is one of the signs of hypocrites. The Prophet Muhammad said, as reported by al-Bukhari: There are three signs of a hypocrite: when he speaks, he lies, if he believes, he is treacherous, and if he promises, he does not keep his promise. (History of al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah) People who swear by it are bad people. People who are unkind and mean to others think that others are to him. Therefore, in order to convince others of his truth, he swore. 1.Do not follow people who are despicable and misleading, such as being called upon to follow their religion in some way. 1.Do not follow someone who always criticizes others, and cite others' badness either directly or indirectly. 2. Not following slanderous people is like influencing people to dislike someone, and trying to cause trouble. Allah states that slander in the sense of chaos is greater as a result of murder. And kill them where you found them, and drive them out from where they have driven you. And that slander is more cruel than murder. (al-Baqarah \/ 2: 191) 1. He does not follow people who like to forbid good deeds and prevent others from doing good or he himself does not like to do good. 2.Do not follow people who are accustomed to doing things that go beyond their limits, such as those who love to break God's commandments and do not stop doing what He forbids. Allah says: And whoever disobeys Allah and His Messenger and transgresses His law, Allah will put him into the fire of hell, he will abide in it and he will receive a humiliating punishment. (an-Nisa '\/ 4: 14) 1. He does not follow those who practice sinful and evil deeds because he is a man of low self-esteem and good morals. The act of sin will eradicate self-esteem and be contrary to good morals. God does not like those who love sinful deeds. He said: And do not contend for those who betray him. Truly, God does not like people who are always treacherous and sinful. (an-Nisa '\/ 4: 107) 1. Do not follow those who are cruel and have no compassion. Allah is Most Gracious, Most Merciful to His servants. Therefore, the cruel and merciless nature is contrary to the attributes of God. One of the reasons Islam has spread so quickly in the Arabian Peninsula is because of the gentle attitude of the Prophet Muhammad. If he was rude and cruel, people would have avoided him. Allah said: By the grace of Allah you (Muhammad) have been gentle towards them. If you are hard-hearted and harsh-hearted, they will certainly stay away from you. So forgive them and beg their pardon, and consult with them in the matter. (Ali 'Imran \/ 3: 159) 1. Not following people whose origins are unknown, namely: 1. People with unknown circumstances, where they come from, what their work is, how they behave, and so on. 2. An unknown person whose origin is unclear and their purpose and purpose and the motive behind their request.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah mengingatkan dan memerintahkan Nabi Muhammad agar:\n\n1.Tidak mengikuti keinginan orang-orang yang mudah mengucapkan sumpah, karena yang suka bersumpah itu hanyalah seorang pendusta. Sedangkan dusta itu pangkal kejahatan dan sumber segala macam perbuatan maksiat. Oleh karena itu pula, agama Islam menyatakan bahwa dusta itu salah satu dari tanda-tanda orang munafik. Nabi Muhammad bersabda, sebagaimana diriwayatkan al-Bukhari:Tanda-tanda orang munafik itu ada tiga: jika berbicara, ia berdusta, jika dipercaya, ia khianat, dan jika berjanji, ia tidak menepati janjinya. (Riwayat al-Bukhari, Muslim, at-Tirmidhi, dan an-Nasa'i dari Abu Hurairah)\n\nOrang yang suka bersumpah adalah orang yang tidak baik. Orang yang tidak baik pikiran dan maksudnya kepada orang lain menyangka bahwa orang lain demikian pula kepadanya. Oleh karena itu, untuk meyakinkan orang lain akan kebenaran dirinya, ia pun bersumpah.\n\n1.Tidak mengikuti orang yang berpikiran hina dan menyesatkan, seperti ajakan mengikuti agama mereka dalam beberapa hal.\n\n1.Tidak mengikuti orang yang selalu mencela orang lain, dan menyebut-nyebut keburukan orang lain baik secara langsung atau tidak.\n\n2.Tidak mengikuti orang-orang yang suka memfitnah seperti mempengaruhi orang agar tidak senang kepada seseorang yang lain, dan berusaha menimbulkan kekacauan. Allah menyatakan bahwa fitnah dengan pengertian kekacauan itu lebih besar akibatnya dari pembunuhan.\n\nDan bunuhlah mereka di mana kamu temui mereka, dan usirlah mereka dari mana mereka telah mengusir kamu. Dan fitnah itu lebih kejam daripada pembunuhan. (al-Baqarah\/2: 191)\n\n1.Tidak mengikuti orang-orang yang suka melarang perbuatan baik dan menghalangi orang lain berbuat kebaikan atau dia sendiri tidak suka berbuat baik.\n\n2.Tidak mengikuti orang yang biasa mengerjakan perbuatan yang melampaui batas, seperti orang-orang yang suka melanggar perintah Allah dan tidak menghentikan perbuatan-perbuatan yang dilarang-Nya. Allah berfirman:\n\nDan barang siapa mendurhakai Allah dan Rasul-Nya dan melanggar batas-batas hukum-Nya, niscaya Allah memasukkannya ke dalam api neraka, dia kekal di dalamnya dan dia akan mendapat azab yang menghinakan. (an-Nisa'\/4: 14)\n\n1.Tidak mengikuti orang-orang yang biasa mengerjakan perbuatan-perbuatan dosa dan maksiat karena ia adalah orang yang tidak mempunyai harga diri dan akhlak yang baik. Perbuatan dosa itu akan menghilangkan harga diri dan bertentangan dengan akhlak yang mulia. Allah tidak menyukai orang-orang yang suka mengerjakan perbuatan-perbuatan dosa. Dia berfirman:\n\nDan janganlah kamu berdebat untuk (membela) orang-orang yang mengkhianati dirinya. Sungguh, Allah tidak menyukai orang-orang yang selalu berkhianat dan bergelimang dosa. (an-Nisa'\/4: 107)\n\n1.Tidak mengikuti orang-orang yang suka berbuat kejam dan tidak mempunyai sifat belas kasihan. Allah Maha Pemurah lagi Maha Penyayang kepada hamba-hamba-Nya. Oleh karena itu, sifat kejam dan tidak mempunyai rasa belas kasihan berlawanan dengan sifat-sifat Allah. Salah satu sebab agama Islam tersiar dengan cepat di Jazirah Arab ialah karena sikap Nabi Muhammad yang lemah-lembut. Seandainya ia bersikap kasar dan kejam, niscaya orang akan menghindarinya. Allah berfirman:\n\nMaka berkat rahmat Allah engkau (Muhammad) berlaku lemah lembut terhadap mereka. Sekiranya engkau bersikap keras dan berhati kasar, tentulah mereka menjauhkan diri dari sekitarmu. Karena itu maafkanlah mereka dan mohonkanlah ampunan untuk mereka, dan bermusyawarahlah dengan mereka dalam urusan itu. (Ali 'Imran\/3: 159)\n\n1.Tidak mengikuti orang-orang yang tidak diketahui asal-usulnya, yaitu:\n\n1.Orang-orang yang tidak diketahui keadaannya, dari mana asalnya, apa pekerjaannya, bagaimana budi pekertinya, dan sebagainya.\n\n2.Orang yang tidak diketahui asal usulnya dan tidak jelas maksud dan tujuannya serta apa motif yang ada di balik ajakannya.",
      "text_translation": "Dan janganlah engkau patuhi setiap orang yang suka bersumpah dan suka menghina,",
      "text": "وَلَا تُطِعْ كُلَّ حَلَّافٍ مَّهِيْنٍۙ",
      "text_translation_en": "Furthermore, defer not to the contemptible swearer of oaths,",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "In these verses, Allah reminds and instructs the Prophet Muhammad to: 1. Not follow the wishes of those who are easily sworn, because the swearer is just a liar. While lying is the root of evil and the source of all kinds of evil deeds. Therefore, Islam says that lying is one of the signs of hypocrites. The Prophet Muhammad said, as reported by al-Bukhari: There are three signs of a hypocrite: when he speaks, he lies, if he believes, he is treacherous, and if he promises, he does not keep his promise. (History of al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah) People who swear by it are bad people. People who are unkind and mean to others think that others are to him. Therefore, in order to convince others of his truth, he swore. 1.Do not follow people who are despicable and misleading, such as being called upon to follow their religion in some way. 1.Do not follow someone who always criticizes others, and cite others' badness either directly or indirectly. 2. Not following slanderous people is like influencing people to dislike someone, and trying to cause trouble. Allah states that slander in the sense of chaos is greater as a result of murder. And kill them where you found them, and drive them out from where they have driven you. And that slander is more cruel than murder. (al-Baqarah \/ 2: 191) 1. He does not follow people who like to forbid good deeds and prevent others from doing good or he himself does not like to do good. 2.Do not follow people who are accustomed to doing things that go beyond their limits, such as those who love to break God's commandments and do not stop doing what He forbids. Allah says: And whoever disobeys Allah and His Messenger and transgresses His law, Allah will put him into the fire of hell, he will abide in it and he will receive a humiliating punishment. (an-Nisa '\/ 4: 14) 1. He does not follow those who practice sinful and evil deeds because he is a man of low self-esteem and good morals. The act of sin will eradicate self-esteem and be contrary to good morals. God does not like those who love sinful deeds. He said: And do not contend for those who betray him. Truly, God does not like people who are always treacherous and sinful. (an-Nisa '\/ 4: 107) 1. Do not follow those who are cruel and have no compassion. Allah is Most Gracious, Most Merciful to His servants. Therefore, the cruel and merciless nature is contrary to the attributes of God. One of the reasons Islam has spread so quickly in the Arabian Peninsula is because of the gentle attitude of the Prophet Muhammad. If he was rude and cruel, people would have avoided him. Allah said: By the grace of Allah you (Muhammad) have been gentle towards them. If you are hard-hearted and harsh-hearted, they will certainly stay away from you. So forgive them and beg their pardon, and consult with them in the matter. (Ali 'Imran \/ 3: 159) 1. Not following people whose origins are unknown, namely: 1. People with unknown circumstances, where they come from, what their work is, how they behave, and so on. 2. An unknown person whose origin is unclear and their purpose and purpose and the motive behind their request.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah mengingatkan dan memerintahkan Nabi Muhammad agar:\n\n1.Tidak mengikuti keinginan orang-orang yang mudah mengucapkan sumpah, karena yang suka bersumpah itu hanyalah seorang pendusta. Sedangkan dusta itu pangkal kejahatan dan sumber segala macam perbuatan maksiat. Oleh karena itu pula, agama Islam menyatakan bahwa dusta itu salah satu dari tanda-tanda orang munafik. Nabi Muhammad bersabda, sebagaimana diriwayatkan al-Bukhari:Tanda-tanda orang munafik itu ada tiga: jika berbicara, ia berdusta, jika dipercaya, ia khianat, dan jika berjanji, ia tidak menepati janjinya. (Riwayat al-Bukhari, Muslim, at-Tirmidhi, dan an-Nasa'i dari Abu Hurairah)\n\nOrang yang suka bersumpah adalah orang yang tidak baik. Orang yang tidak baik pikiran dan maksudnya kepada orang lain menyangka bahwa orang lain demikian pula kepadanya. Oleh karena itu, untuk meyakinkan orang lain akan kebenaran dirinya, ia pun bersumpah.\n\n1.Tidak mengikuti orang yang berpikiran hina dan menyesatkan, seperti ajakan mengikuti agama mereka dalam beberapa hal.\n\n1.Tidak mengikuti orang yang selalu mencela orang lain, dan menyebut-nyebut keburukan orang lain baik secara langsung atau tidak.\n\n2.Tidak mengikuti orang-orang yang suka memfitnah seperti mempengaruhi orang agar tidak senang kepada seseorang yang lain, dan berusaha menimbulkan kekacauan. Allah menyatakan bahwa fitnah dengan pengertian kekacauan itu lebih besar akibatnya dari pembunuhan.\n\nDan bunuhlah mereka di mana kamu temui mereka, dan usirlah mereka dari mana mereka telah mengusir kamu. Dan fitnah itu lebih kejam daripada pembunuhan. (al-Baqarah\/2: 191)\n\n1.Tidak mengikuti orang-orang yang suka melarang perbuatan baik dan menghalangi orang lain berbuat kebaikan atau dia sendiri tidak suka berbuat baik.\n\n2.Tidak mengikuti orang yang biasa mengerjakan perbuatan yang melampaui batas, seperti orang-orang yang suka melanggar perintah Allah dan tidak menghentikan perbuatan-perbuatan yang dilarang-Nya. Allah berfirman:\n\nDan barang siapa mendurhakai Allah dan Rasul-Nya dan melanggar batas-batas hukum-Nya, niscaya Allah memasukkannya ke dalam api neraka, dia kekal di dalamnya dan dia akan mendapat azab yang menghinakan. (an-Nisa'\/4: 14)\n\n1.Tidak mengikuti orang-orang yang biasa mengerjakan perbuatan-perbuatan dosa dan maksiat karena ia adalah orang yang tidak mempunyai harga diri dan akhlak yang baik. Perbuatan dosa itu akan menghilangkan harga diri dan bertentangan dengan akhlak yang mulia. Allah tidak menyukai orang-orang yang suka mengerjakan perbuatan-perbuatan dosa. Dia berfirman:\n\nDan janganlah kamu berdebat untuk (membela) orang-orang yang mengkhianati dirinya. Sungguh, Allah tidak menyukai orang-orang yang selalu berkhianat dan bergelimang dosa. (an-Nisa'\/4: 107)\n\n1.Tidak mengikuti orang-orang yang suka berbuat kejam dan tidak mempunyai sifat belas kasihan. Allah Maha Pemurah lagi Maha Penyayang kepada hamba-hamba-Nya. Oleh karena itu, sifat kejam dan tidak mempunyai rasa belas kasihan berlawanan dengan sifat-sifat Allah. Salah satu sebab agama Islam tersiar dengan cepat di Jazirah Arab ialah karena sikap Nabi Muhammad yang lemah-lembut. Seandainya ia bersikap kasar dan kejam, niscaya orang akan menghindarinya. Allah berfirman:\n\nMaka berkat rahmat Allah engkau (Muhammad) berlaku lemah lembut terhadap mereka. Sekiranya engkau bersikap keras dan berhati kasar, tentulah mereka menjauhkan diri dari sekitarmu. Karena itu maafkanlah mereka dan mohonkanlah ampunan untuk mereka, dan bermusyawarahlah dengan mereka dalam urusan itu. (Ali 'Imran\/3: 159)\n\n1.Tidak mengikuti orang-orang yang tidak diketahui asal-usulnya, yaitu:\n\n1.Orang-orang yang tidak diketahui keadaannya, dari mana asalnya, apa pekerjaannya, bagaimana budi pekertinya, dan sebagainya.\n\n2.Orang yang tidak diketahui asal usulnya dan tidak jelas maksud dan tujuannya serta apa motif yang ada di balik ajakannya.",
      "text_translation": "suka mencela, yang kian ke mari menyebarkan fitnah, ",
      "text": "هَمَّازٍ مَّشَّاۤءٍۢ بِنَمِيْمٍۙ",
      "text_translation_en": "[or to] the slanderer that goes about with defaming tales,",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "In these verses, Allah reminds and instructs the Prophet Muhammad to: 1. Not follow the wishes of those who are easily sworn, because the swearer is just a liar. While lying is the root of evil and the source of all kinds of evil deeds. Therefore, Islam says that lying is one of the signs of hypocrites. The Prophet Muhammad said, as reported by al-Bukhari: There are three signs of a hypocrite: when he speaks, he lies, if he believes, he is treacherous, and if he promises, he does not keep his promise. (History of al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah) People who swear by it are bad people. People who are unkind and mean to others think that others are to him. Therefore, in order to convince others of his truth, he swore. 1.Do not follow people who are despicable and misleading, such as being called upon to follow their religion in some way. 1.Do not follow someone who always criticizes others, and cite others' badness either directly or indirectly. 2. Not following slanderous people is like influencing people to dislike someone, and trying to cause trouble. Allah states that slander in the sense of chaos is greater as a result of murder. And kill them where you found them, and drive them out from where they have driven you. And that slander is more cruel than murder. (al-Baqarah \/ 2: 191) 1. He does not follow people who like to forbid good deeds and prevent others from doing good or he himself does not like to do good. 2.Do not follow people who are accustomed to doing things that go beyond their limits, such as those who love to break God's commandments and do not stop doing what He forbids. Allah says: And whoever disobeys Allah and His Messenger and transgresses His law, Allah will put him into the fire of hell, he will abide in it and he will receive a humiliating punishment. (an-Nisa '\/ 4: 14) 1. He does not follow those who practice sinful and evil deeds because he is a man of low self-esteem and good morals. The act of sin will eradicate self-esteem and be contrary to good morals. God does not like those who love sinful deeds. He said: And do not contend for those who betray him. Truly, God does not like people who are always treacherous and sinful. (an-Nisa '\/ 4: 107) 1. Do not follow those who are cruel and have no compassion. Allah is Most Gracious, Most Merciful to His servants. Therefore, the cruel and merciless nature is contrary to the attributes of God. One of the reasons Islam has spread so quickly in the Arabian Peninsula is because of the gentle attitude of the Prophet Muhammad. If he was rude and cruel, people would have avoided him. Allah said: By the grace of Allah you (Muhammad) have been gentle towards them. If you are hard-hearted and harsh-hearted, they will certainly stay away from you. So forgive them and beg their pardon, and consult with them in the matter. (Ali 'Imran \/ 3: 159) 1. Not following people whose origins are unknown, namely: 1. People with unknown circumstances, where they come from, what their work is, how they behave, and so on. 2. An unknown person whose origin is unclear and their purpose and purpose and the motive behind their request.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah mengingatkan dan memerintahkan Nabi Muhammad agar:\n\n1.Tidak mengikuti keinginan orang-orang yang mudah mengucapkan sumpah, karena yang suka bersumpah itu hanyalah seorang pendusta. Sedangkan dusta itu pangkal kejahatan dan sumber segala macam perbuatan maksiat. Oleh karena itu pula, agama Islam menyatakan bahwa dusta itu salah satu dari tanda-tanda orang munafik. Nabi Muhammad bersabda, sebagaimana diriwayatkan al-Bukhari:Tanda-tanda orang munafik itu ada tiga: jika berbicara, ia berdusta, jika dipercaya, ia khianat, dan jika berjanji, ia tidak menepati janjinya. (Riwayat al-Bukhari, Muslim, at-Tirmidhi, dan an-Nasa'i dari Abu Hurairah)\n\nOrang yang suka bersumpah adalah orang yang tidak baik. Orang yang tidak baik pikiran dan maksudnya kepada orang lain menyangka bahwa orang lain demikian pula kepadanya. Oleh karena itu, untuk meyakinkan orang lain akan kebenaran dirinya, ia pun bersumpah.\n\n1.Tidak mengikuti orang yang berpikiran hina dan menyesatkan, seperti ajakan mengikuti agama mereka dalam beberapa hal.\n\n1.Tidak mengikuti orang yang selalu mencela orang lain, dan menyebut-nyebut keburukan orang lain baik secara langsung atau tidak.\n\n2.Tidak mengikuti orang-orang yang suka memfitnah seperti mempengaruhi orang agar tidak senang kepada seseorang yang lain, dan berusaha menimbulkan kekacauan. Allah menyatakan bahwa fitnah dengan pengertian kekacauan itu lebih besar akibatnya dari pembunuhan.\n\nDan bunuhlah mereka di mana kamu temui mereka, dan usirlah mereka dari mana mereka telah mengusir kamu. Dan fitnah itu lebih kejam daripada pembunuhan. (al-Baqarah\/2: 191)\n\n1.Tidak mengikuti orang-orang yang suka melarang perbuatan baik dan menghalangi orang lain berbuat kebaikan atau dia sendiri tidak suka berbuat baik.\n\n2.Tidak mengikuti orang yang biasa mengerjakan perbuatan yang melampaui batas, seperti orang-orang yang suka melanggar perintah Allah dan tidak menghentikan perbuatan-perbuatan yang dilarang-Nya. Allah berfirman:\n\nDan barang siapa mendurhakai Allah dan Rasul-Nya dan melanggar batas-batas hukum-Nya, niscaya Allah memasukkannya ke dalam api neraka, dia kekal di dalamnya dan dia akan mendapat azab yang menghinakan. (an-Nisa'\/4: 14)\n\n1.Tidak mengikuti orang-orang yang biasa mengerjakan perbuatan-perbuatan dosa dan maksiat karena ia adalah orang yang tidak mempunyai harga diri dan akhlak yang baik. Perbuatan dosa itu akan menghilangkan harga diri dan bertentangan dengan akhlak yang mulia. Allah tidak menyukai orang-orang yang suka mengerjakan perbuatan-perbuatan dosa. Dia berfirman:\n\nDan janganlah kamu berdebat untuk (membela) orang-orang yang mengkhianati dirinya. Sungguh, Allah tidak menyukai orang-orang yang selalu berkhianat dan bergelimang dosa. (an-Nisa'\/4: 107)\n\n1.Tidak mengikuti orang-orang yang suka berbuat kejam dan tidak mempunyai sifat belas kasihan. Allah Maha Pemurah lagi Maha Penyayang kepada hamba-hamba-Nya. Oleh karena itu, sifat kejam dan tidak mempunyai rasa belas kasihan berlawanan dengan sifat-sifat Allah. Salah satu sebab agama Islam tersiar dengan cepat di Jazirah Arab ialah karena sikap Nabi Muhammad yang lemah-lembut. Seandainya ia bersikap kasar dan kejam, niscaya orang akan menghindarinya. Allah berfirman:\n\nMaka berkat rahmat Allah engkau (Muhammad) berlaku lemah lembut terhadap mereka. Sekiranya engkau bersikap keras dan berhati kasar, tentulah mereka menjauhkan diri dari sekitarmu. Karena itu maafkanlah mereka dan mohonkanlah ampunan untuk mereka, dan bermusyawarahlah dengan mereka dalam urusan itu. (Ali 'Imran\/3: 159)\n\n1.Tidak mengikuti orang-orang yang tidak diketahui asal-usulnya, yaitu:\n\n1.Orang-orang yang tidak diketahui keadaannya, dari mana asalnya, apa pekerjaannya, bagaimana budi pekertinya, dan sebagainya.\n\n2.Orang yang tidak diketahui asal usulnya dan tidak jelas maksud dan tujuannya serta apa motif yang ada di balik ajakannya.",
      "text_translation": "yang merintangi segala yang baik, yang melampaui batas dan banyak dosa, ",
      "text": "مَّنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ اَثِيْمٍۙ",
      "text_translation_en": "[or] the withholder of good, [or] the sinful aggressor,",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "In these verses, Allah reminds and instructs the Prophet Muhammad to: 1. Not follow the wishes of those who are easily sworn, because the swearer is just a liar. While lying is the root of evil and the source of all kinds of evil deeds. Therefore, Islam says that lying is one of the signs of hypocrites. The Prophet Muhammad said, as reported by al-Bukhari: There are three signs of a hypocrite: when he speaks, he lies, if he believes, he is treacherous, and if he promises, he does not keep his promise. (History of al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah) People who swear by it are bad people. People who are unkind and mean to others think that others are to him. Therefore, in order to convince others of his truth, he swore. 1.Do not follow people who are despicable and misleading, such as being called upon to follow their religion in some way. 1.Do not follow someone who always criticizes others, and cite others' badness either directly or indirectly. 2. Not following slanderous people is like influencing people to dislike someone, and trying to cause trouble. Allah states that slander in the sense of chaos is greater as a result of murder. And kill them where you found them, and drive them out from where they have driven you. And that slander is more cruel than murder. (al-Baqarah \/ 2: 191) 1. He does not follow people who like to forbid good deeds and prevent others from doing good or he himself does not like to do good. 2.Do not follow people who are accustomed to doing things that go beyond their limits, such as those who love to break God's commandments and do not stop doing what He forbids. Allah says: And whoever disobeys Allah and His Messenger and transgresses His law, Allah will put him into the fire of hell, he will abide in it and he will receive a humiliating punishment. (an-Nisa '\/ 4: 14) 1. He does not follow those who practice sinful and evil deeds because he is a man of low self-esteem and good morals. The act of sin will eradicate self-esteem and be contrary to good morals. God does not like those who love sinful deeds. He said: And do not contend for those who betray him. Truly, God does not like people who are always treacherous and sinful. (an-Nisa '\/ 4: 107) 1. Do not follow those who are cruel and have no compassion. Allah is Most Gracious, Most Merciful to His servants. Therefore, the cruel and merciless nature is contrary to the attributes of God. One of the reasons Islam has spread so quickly in the Arabian Peninsula is because of the gentle attitude of the Prophet Muhammad. If he was rude and cruel, people would have avoided him. Allah said: By the grace of Allah you (Muhammad) have been gentle towards them. If you are hard-hearted and harsh-hearted, they will certainly stay away from you. So forgive them and beg their pardon, and consult with them in the matter. (Ali 'Imran \/ 3: 159) 1. Not following people whose origins are unknown, namely: 1. People with unknown circumstances, where they come from, what their work is, how they behave, and so on. 2. An unknown person whose origin is unclear and their purpose and purpose and the motive behind their request.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah mengingatkan dan memerintahkan Nabi Muhammad agar:\n\n1.Tidak mengikuti keinginan orang-orang yang mudah mengucapkan sumpah, karena yang suka bersumpah itu hanyalah seorang pendusta. Sedangkan dusta itu pangkal kejahatan dan sumber segala macam perbuatan maksiat. Oleh karena itu pula, agama Islam menyatakan bahwa dusta itu salah satu dari tanda-tanda orang munafik. Nabi Muhammad bersabda, sebagaimana diriwayatkan al-Bukhari:Tanda-tanda orang munafik itu ada tiga: jika berbicara, ia berdusta, jika dipercaya, ia khianat, dan jika berjanji, ia tidak menepati janjinya. (Riwayat al-Bukhari, Muslim, at-Tirmidhi, dan an-Nasa'i dari Abu Hurairah)\n\nOrang yang suka bersumpah adalah orang yang tidak baik. Orang yang tidak baik pikiran dan maksudnya kepada orang lain menyangka bahwa orang lain demikian pula kepadanya. Oleh karena itu, untuk meyakinkan orang lain akan kebenaran dirinya, ia pun bersumpah.\n\n1.Tidak mengikuti orang yang berpikiran hina dan menyesatkan, seperti ajakan mengikuti agama mereka dalam beberapa hal.\n\n1.Tidak mengikuti orang yang selalu mencela orang lain, dan menyebut-nyebut keburukan orang lain baik secara langsung atau tidak.\n\n2.Tidak mengikuti orang-orang yang suka memfitnah seperti mempengaruhi orang agar tidak senang kepada seseorang yang lain, dan berusaha menimbulkan kekacauan. Allah menyatakan bahwa fitnah dengan pengertian kekacauan itu lebih besar akibatnya dari pembunuhan.\n\nDan bunuhlah mereka di mana kamu temui mereka, dan usirlah mereka dari mana mereka telah mengusir kamu. Dan fitnah itu lebih kejam daripada pembunuhan. (al-Baqarah\/2: 191)\n\n1.Tidak mengikuti orang-orang yang suka melarang perbuatan baik dan menghalangi orang lain berbuat kebaikan atau dia sendiri tidak suka berbuat baik.\n\n2.Tidak mengikuti orang yang biasa mengerjakan perbuatan yang melampaui batas, seperti orang-orang yang suka melanggar perintah Allah dan tidak menghentikan perbuatan-perbuatan yang dilarang-Nya. Allah berfirman:\n\nDan barang siapa mendurhakai Allah dan Rasul-Nya dan melanggar batas-batas hukum-Nya, niscaya Allah memasukkannya ke dalam api neraka, dia kekal di dalamnya dan dia akan mendapat azab yang menghinakan. (an-Nisa'\/4: 14)\n\n1.Tidak mengikuti orang-orang yang biasa mengerjakan perbuatan-perbuatan dosa dan maksiat karena ia adalah orang yang tidak mempunyai harga diri dan akhlak yang baik. Perbuatan dosa itu akan menghilangkan harga diri dan bertentangan dengan akhlak yang mulia. Allah tidak menyukai orang-orang yang suka mengerjakan perbuatan-perbuatan dosa. Dia berfirman:\n\nDan janganlah kamu berdebat untuk (membela) orang-orang yang mengkhianati dirinya. Sungguh, Allah tidak menyukai orang-orang yang selalu berkhianat dan bergelimang dosa. (an-Nisa'\/4: 107)\n\n1.Tidak mengikuti orang-orang yang suka berbuat kejam dan tidak mempunyai sifat belas kasihan. Allah Maha Pemurah lagi Maha Penyayang kepada hamba-hamba-Nya. Oleh karena itu, sifat kejam dan tidak mempunyai rasa belas kasihan berlawanan dengan sifat-sifat Allah. Salah satu sebab agama Islam tersiar dengan cepat di Jazirah Arab ialah karena sikap Nabi Muhammad yang lemah-lembut. Seandainya ia bersikap kasar dan kejam, niscaya orang akan menghindarinya. Allah berfirman:\n\nMaka berkat rahmat Allah engkau (Muhammad) berlaku lemah lembut terhadap mereka. Sekiranya engkau bersikap keras dan berhati kasar, tentulah mereka menjauhkan diri dari sekitarmu. Karena itu maafkanlah mereka dan mohonkanlah ampunan untuk mereka, dan bermusyawarahlah dengan mereka dalam urusan itu. (Ali 'Imran\/3: 159)\n\n1.Tidak mengikuti orang-orang yang tidak diketahui asal-usulnya, yaitu:\n\n1.Orang-orang yang tidak diketahui keadaannya, dari mana asalnya, apa pekerjaannya, bagaimana budi pekertinya, dan sebagainya.\n\n2.Orang yang tidak diketahui asal usulnya dan tidak jelas maksud dan tujuannya serta apa motif yang ada di balik ajakannya.",
      "text_translation": "yang bertabiat kasar, selain itu juga terkenal kejahatannya,",
      "text": "عُتُلٍّۢ بَعْدَ ذٰلِكَ زَنِيْمٍۙ",
      "text_translation_en": "[or] one who is cruel, by greed possessed, and, in addition to all this, utterly useless [to his fellow-men].",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "In this verse, Allah warns the Prophet Muhammad and the Muslims not to follow those who have the above qualities, whether he has great wealth, high status, great power, or he feels pleasure and pleasure worldly nature is temporary. All of this will be of no use to Allah on the Day of Resurrection. Allah says: Leave Me to the people whom I have created, and I give them abundant wealth, and children with it, and I give it wide (life). Then he really wanted me to add it. You can't! Indeed, he has opposed Our Qur'an. I'm going to burden him with a nice climb. Indeed he has thought and fixed (what he has set), and woe unto him! How did he fix it ?, Again, woe to him! How did he decide? Then he (contemplates) contemplates, then looks sour and sullen, then turns away (from the truth) and boasts. (al-Muddatstsir \/ 74: 11-23)",
      "text_tafsir": "Dalam ayat ini, Allah memperingatkan Nabi Muhammad dan kaum Muslimin agar sekali-kali tidak mengikuti orang-orang yang mempunyai sifat-sifat di atas, sekalipun ia mempunyai harta yang banyak, kedudukan yang tinggi, kekuasaan yang besar, atau ia merasakan suatu kenikmatan dan kesenangan duniawi yang sifatnya sementara saja. Semua itu tidak akan ada manfaatnya di sisi Allah pada hari Kiamat. Allah berfirman:\n\nBiarkanlah Aku (yang bertindak) terhadap orang yang Aku sendiri telah menciptakannya, dan Aku beri kekayaan yang melimpah, dan anak-anak yang selalu bersamanya, dan Aku beri kelapangan (hidup) seluas-luasnya. Kemudian dia ingin sekali agar Aku menambahnya. Tidak bisa! Sesungguhnya dia telah menentang ayat-ayat Kami (Al-Qur'an). Aku akan membebaninya dengan pendakian yang memayahkan. Sesungguhnya dia telah memikirkan dan menetapkan (apa yang ditetapkannya), maka celakalah dia! Bagaimana dia menetapkan?, Sekali lagi, celakalah dia! Bagaimana dia menetapkan? Kemudian dia (merenung) memikirkan, lalu berwajah masam dan cemberut, kemudian berpaling (dari kebenaran) dan menyombongkan diri. (al-Muddatstsir\/74: 11-23)",
      "text_translation": "karena dia kaya dan banyak anak.",
      "text": "اَنْ كَانَ ذَا مَالٍ وَّبَنِيْنَۗ",
      "text_translation_en": "Is it because he is possessed of worldly goods and children",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "This verse explains that when the Meccan pagans listened to the verses of the Qur'an, they said the Qur'an was nothing but Muhammad's words and contained tales of the ancients, not at all a revelation conveyed God to him. In another verse, Allah says: Then he said, \"(The Qur'an) is only magic learned (from the ancients). This is only the words of men.\" (al-Muddatstsir \/ 74: 24-25) Besides, the polytheists also say that the Qur'an is a magic that is uttered by a sorcerer and so on. However, from all the accusations they made, it is understood that they did so solely because they had lost their mind looking for reasons that could be stated to refute the truth of the Qur'an. Every time they reflect on it, more confidence will arise in their hearts towards the Qur'an. However, their lust still overcame the truth that had arisen in their hearts.",
      "text_tafsir": "Ayat ini menerangkan bahwa bila orang-orang musyrik Mekah mendengarkan bacaan ayat-ayat Al-Qur'an, mereka mengatakan Al-Qur'an itu tidak lain adalah perkataan Muhammad saja dan berisi dongeng-dongeng orang dahulu kala, sama sekali bukan wahyu yang disampaikan Allah kepadanya. Dalam ayat lain, Allah berfirman:\n\nLalu dia berkata, \"(Al-Qur'an) ini hanyalah sihir yang dipelajari (dari orang-orang dahulu). Ini hanyalah perkataan manusia.\" (al-Muddatstsir\/74: 24-25)\n\nDi samping, orang-orang musyrik juga mengatakan bahwa Al-Qur'an itu adalah sihir yang dikemukakan seorang tukang sihir dan sebagainya. Akan tetapi, dari semua tuduhan yang mereka lontarkan itu, dapat dipahami bahwa mereka melakukan hal demikian semata-mata karena telah kehilangan akal mencari alasan yang dapat dikemukakan untuk membantah kebenaran Al-Qur'an. Setiap kali mereka merenungkannya, semakin timbul kepercayaan dalam hati mereka kepada Al-Qur'an. Namun demikian, nafsu mereka masih mengalahkan kebenaran yang telah timbul dalam lubuk hati mereka.",
      "text_translation": "Apabila ayat-ayat Kami dibacakan kepadanya, dia berkata, “(Ini adalah) dongeng-dongeng orang dahulu.” ",
      "text": "اِذَا تُتْلٰى عَلَيْهِ اٰيٰتُنَا قَالَ اَسَاطِيْرُ الْاَوَّلِيْنَۗ",
      "text_translation_en": "that, whenever Our messages are conveyed to him, such a one says, \"Fables of ancient times\"?",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "In this verse, God emphasizes that they are truly perverted people, and that He will make them despised in the world. To express their humiliation, God will mark on their nose like an elephant, so that everyone knows their true condition. The purpose of marking on their nose is for everyone to know that they are evil and have many sins, so they are easily recognizable.",
      "text_tafsir": "Dalam ayat ini, Allah menegaskan bahwa mereka adalah orang-orang yang benar-benar sesat, dan Ia akan menjadikan mereka hina di dunia. Untuk menyatakan kehinaan mereka itu, Allah akan memberi tanda di hidung mereka seperti belalai gajah, sehingga setiap orang mengetahui keadaan mereka yang sebenarnya. Maksud memberi tanda di hidung mereka ialah agar semua orang mengetahui bahwa mereka adalah orang jahat dan banyak dosa, sehingga mudah dikenali.",
      "text_translation": "Kelak dia akan Kami beri tanda pada belalai(nya). ",
      "text": "سَنَسِمُهٗ عَلَى الْخُرْطُوْمِ ",
      "text_translation_en": "[For this] We shall brand him with indelible disgrace!",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "This verse explains that God has given the Meccan monks a great deal of enjoyment in life and luxury. All of this is to find out whether they want to enjoy the greater favor given to the rights of the poor, to accept the call of the Prophet (peace be upon him) to follow the right path and to obey and obey Allah, or with this favor, they want to accumulate wealth, challenge their appeal Prophet, and deviate from the right path? Allah will inflict upon them a painful torment and destroy them if they refuse, as some garden owners do. The owner of the orchard is again a virtuous, obedient, obedient man who obeys God's command and abstains from all his restrictions. It has a garden as a source of livelihood. When quoting the produce of the orchard, he told the poor and needy people to come to his garden, and immediately gave them their rights as a result of the produce. After he died, the children inherited the orchard. At the time of picking the results, they also wondered if they would do as their father did or make a new plan. One of them proposes to keep doing what their father used to do, telling the poor poor people to come by during the day. However, this proposal was rejected by his other brothers. They do not want to give the poor as little as their father did. Although the brothers were warned of the danger they might face, they still decided to harvest the produce without first notifying the poor, and the whole produce would be their own without giving away the rights of others. is in it. The heirs of the owner of the garden defied the conditions that his father used to live, after seeing the fertility of the crop and the extent of the fruit to be harvested. They also believe that everything will be theirs. Therefore, they swore they would pick it up in the morning so that no one would know it. They also agreed not to give the produce to others in the least.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah memberi orang-orang musyrik Mekah nikmat yang banyak berupa kesenangan hidup di dunia dan kemewahan. Semua itu bertujuan untuk mengetahui apakah mereka mau mensyukuri nikmat lebih yang diberikan itu dengan mengeluarkan hak-hak orang miskin, memperkenankan seruan Nabi saw untuk mengikuti jalan yang benar serta tunduk dan taat kepada Allah, atau dengan nikmat ini, mereka ingin menumpuk harta, menantang seruan Nabi, dan menyimpang dari jalan yang benar? Allah akan menimpakan azab yang pedih kepada mereka dan melenyapkan nikmat-nikmat itu seandainya mereka tetap ingkar, sebagaimana yang menimpa beberapa pemilik kebun.\n\nPemilik kebun itu semula adalah seorang laki-laki saleh, taat, dan patuh melaksanakan perintah Allah dan menjauhi segala larangan-Nya. Ia mempunyai sebidang kebun sebagai sumber penghidupannya. Jika akan memetik hasil kebunnya, ia memberitahu orang-orang fakir dan miskin agar datang ke kebunnya, dan langsung memberikan hak-hak mereka yang terdapat dari hasil kebun itu. Setelah ia meninggal dunia, kebun itu diwarisi oleh anak-anak mereka. Pada waktu akan memetik hasilnya, mereka pun bermusyawarah apakah tetap melakukan seperti yang telah dilakukan ayah mereka atau membuat rencana baru. Salah seorang di antaranya mengusulkan agar tetap melakukan apa yang biasa dilakukan bapak mereka, yaitu memberitahu orang-orang fakir miskin agar datang pada waktu hari memetik.\n\nAkan tetapi, usulan ini ditolak oleh saudara-saudaranya yang lain. Mereka tidak mau memberikan hasil kebun itu sedikit pun kepada fakir-miskin sebagaimana yang telah dilakukan bapaknya. Sekalipun telah diingatkan oleh saudara yang seorang itu akan bahaya yang mungkin menimpa, tetapi mereka tetap dengan keputusan untuk memetik hasil kebun itu tanpa memberitahu lebih dahulu kepada fakir-miskin, dan seluruh hasil kebun itu akan mereka miliki sendiri tanpa mengeluarkan hak-hak orang lain yang ada di dalamnya. \n\nPara ahli waris pemilik kebun itu mengingkari ketentuan-ketentuan yang biasa dilakukan bapaknya ketika hidup, setelah melihat kesuburan tanamannya dan kelebatan buah yang akan dipetik. Mereka pun yakin bahwa semua itu pasti akan menjadi milik mereka. Oleh karena itu, mereka bersumpah akan memetiknya pagi-pagi benar agar tidak diketahui oleh seorang pun. Mereka juga sepakat untuk tidak akan memberikan hasil kebun itu kepada orang lain walaupun sedikit.",
      "text_translation": "Sungguh, Kami telah menguji mereka (orang musyrik Mekah) sebagaimana Kami telah menguji pemilik-pemilik kebun, ketika mereka bersumpah pasti akan memetik (hasil)nya pada pagi hari,",
      "text": "اِنَّا بَلَوْنٰهُمْ كَمَا بَلَوْنَآ اَصْحٰبَ الْجَنَّةِۚ اِذْ اَقْسَمُوْا لَيَصْرِمُنَّهَا مُصْبِحِيْنَۙ",
      "text_translation_en": "[As for such sinners,] behold, We [but] try them as We tried the owners of a certain garden who vowed that they would surely harvest its fruit on the morrow,",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "This verse explains that God has given the Meccan monks a great deal of enjoyment in life and luxury. All of this is to find out whether they want to enjoy the greater favor given to the rights of the poor, to accept the call of the Prophet (peace be upon him) to follow the right path and to obey and obey Allah, or with this favor, they want to accumulate wealth, challenge their appeal Prophet, and deviate from the right path? Allah will inflict upon them a painful torment and destroy them if they refuse, as some garden owners do. The owner of the orchard is again a virtuous, obedient, obedient man who obeys God's command and abstains from all his restrictions. It has a garden as a source of livelihood. When quoting the produce of the orchard, he told the poor and needy people to come to his garden, and immediately gave them their rights as a result of the produce. After he died, the children inherited the orchard. At the time of picking the results, they also wondered if they would do as their father did or make a new plan. One of them proposes to keep doing what their father used to do, telling the poor poor people to come by during the day. However, this proposal was rejected by his other brothers. They do not want to give the poor as little as their father did. Although the brothers were warned of the danger they might face, they still decided to harvest the produce without first notifying the poor, and the whole produce would be their own without giving away the rights of others. is in it. The heirs of the owner of the garden defied the conditions that his father used to live, after seeing the fertility of the crop and the extent of the fruit to be harvested. They also believe that everything will be theirs. Therefore, they swore they would pick it up in the morning so that no one would know it. They also agreed not to give the produce to others in the least.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah memberi orang-orang musyrik Mekah nikmat yang banyak berupa kesenangan hidup di dunia dan kemewahan. Semua itu bertujuan untuk mengetahui apakah mereka mau mensyukuri nikmat lebih yang diberikan itu dengan mengeluarkan hak-hak orang miskin, memperkenankan seruan Nabi saw untuk mengikuti jalan yang benar serta tunduk dan taat kepada Allah, atau dengan nikmat ini, mereka ingin menumpuk harta, menantang seruan Nabi, dan menyimpang dari jalan yang benar? Allah akan menimpakan azab yang pedih kepada mereka dan melenyapkan nikmat-nikmat itu seandainya mereka tetap ingkar, sebagaimana yang menimpa beberapa pemilik kebun.\n\nPemilik kebun itu semula adalah seorang laki-laki saleh, taat, dan patuh melaksanakan perintah Allah dan menjauhi segala larangan-Nya. Ia mempunyai sebidang kebun sebagai sumber penghidupannya. Jika akan memetik hasil kebunnya, ia memberitahu orang-orang fakir dan miskin agar datang ke kebunnya, dan langsung memberikan hak-hak mereka yang terdapat dari hasil kebun itu. Setelah ia meninggal dunia, kebun itu diwarisi oleh anak-anak mereka. Pada waktu akan memetik hasilnya, mereka pun bermusyawarah apakah tetap melakukan seperti yang telah dilakukan ayah mereka atau membuat rencana baru. Salah seorang di antaranya mengusulkan agar tetap melakukan apa yang biasa dilakukan bapak mereka, yaitu memberitahu orang-orang fakir miskin agar datang pada waktu hari memetik.\n\nAkan tetapi, usulan ini ditolak oleh saudara-saudaranya yang lain. Mereka tidak mau memberikan hasil kebun itu sedikit pun kepada fakir-miskin sebagaimana yang telah dilakukan bapaknya. Sekalipun telah diingatkan oleh saudara yang seorang itu akan bahaya yang mungkin menimpa, tetapi mereka tetap dengan keputusan untuk memetik hasil kebun itu tanpa memberitahu lebih dahulu kepada fakir-miskin, dan seluruh hasil kebun itu akan mereka miliki sendiri tanpa mengeluarkan hak-hak orang lain yang ada di dalamnya. \n\nPara ahli waris pemilik kebun itu mengingkari ketentuan-ketentuan yang biasa dilakukan bapaknya ketika hidup, setelah melihat kesuburan tanamannya dan kelebatan buah yang akan dipetik. Mereka pun yakin bahwa semua itu pasti akan menjadi milik mereka. Oleh karena itu, mereka bersumpah akan memetiknya pagi-pagi benar agar tidak diketahui oleh seorang pun. Mereka juga sepakat untuk tidak akan memberikan hasil kebun itu kepada orang lain walaupun sedikit.",
      "text_translation": "tetapi mereka tidak menyisihkan (dengan mengucapkan, “Insya Allah”).",
      "text": "وَلَا يَسْتَثْنُوْنَ ",
      "text_translation_en": "and made no allowance [for the will of God]:",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "God's requirements and will surely come to pass without anyone blocking it. At night, by the decree and will of God, there came lightning that consumed all their fields. No one was left alive, all burned to death. The incident occurred while the owners of the garden were sound asleep, so no one knew that the garden was completely burned. They neglected and did not remember God, the God who provided them.",
      "text_tafsir": "Ketentuan dan kehendak Allah pasti berlaku tanpa seorang pun yang dapat menghalanginya. Maka pada malam hari, dengan ketetapan dan kehendak Allah, datanglah petir yang membakar seluruh kebun mereka. Tidak ada satu pun yang tinggal, semua hangus terbakar. Kejadian tersebut terjadi ketika para pemilik kebun itu sedang tidur nyenyak, sehingga tidak seorang pun yang tahu bahwa kebunnya telah habis terbakar. Mereka lalai dan tidak ingat kepada Allah, Tuhan yang memberi rezeki kepada mereka.",
      "text_translation": "Lalu kebun itu ditimpa bencana (yang datang) dari Tuhanmu ketika mereka sedang tidur.",
      "text": "فَطَافَ عَلَيْهَا طَاۤىِٕفٌ مِّنْ رَّبِّكَ وَهُمْ نَاۤىِٕمُوْنَ ",
      "text_translation_en": "whereupon a visitation for thy Sustainer came upon that [garden] while they were asleep,",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "God's requirements and will surely come to pass without anyone blocking it. At night, by the decree and will of God, there came lightning that consumed all their fields. No one was left alive, all burned to death. The incident occurred while the owners of the garden were sound asleep, so no one knew that the garden was completely burned. They neglected and did not remember God, the God who provided them.",
      "text_tafsir": "Ketentuan dan kehendak Allah pasti berlaku tanpa seorang pun yang dapat menghalanginya. Maka pada malam hari, dengan ketetapan dan kehendak Allah, datanglah petir yang membakar seluruh kebun mereka. Tidak ada satu pun yang tinggal, semua hangus terbakar. Kejadian tersebut terjadi ketika para pemilik kebun itu sedang tidur nyenyak, sehingga tidak seorang pun yang tahu bahwa kebunnya telah habis terbakar. Mereka lalai dan tidak ingat kepada Allah, Tuhan yang memberi rezeki kepada mereka.",
      "text_translation": "Maka jadilah kebun itu hitam seperti malam yang gelap gulita,",
      "text": "فَاَصْبَحَتْ كَالصَّرِيْمِۙ",
      "text_translation_en": "so that by the morrow it became barren and bleak.",
      "juz_number": 29
    },
    "21": {
      "text_tafsir_en": "After waking up in the morning, they called each other and invited to go to the garden to reap the rewards. After gathering, they departed and walked furtively while whispering among themselves, \"Don't let any of the poor people come to our garden like they used to when father was still alive. We should be able to harvest the whole garden from us. use it for our own needs. \" They go to the garden early in the morning with the intention that poor people do not enter their gardens and they are very confident that they will be able to reap the rewards of the garden.",
      "text_tafsir": "Setelah bangun pada pagi harinya, mereka saling memanggil dan mengajak untuk pergi ke kebun guna memetik hasilnya. Setelah berkumpul, mereka pun berangkat dan berjalan dengan sembunyi-sembunyi sambil berbisik-bisik di antara mereka, \"Jangan biarkan seorang pun di antara orang-orang miskin itu datang ke kebun kita seperti dulu ketika ayah masih hidup. Hendaknya seluruh panen kebun ini dapat kita manfaatkan untuk keperluan kita sendiri.\" Mereka pergi ke kebun pagi-pagi sekali dengan maksud agar orang-orang miskin tidak masuk ke kebun mereka dan mereka sangat yakin akan dapat memetik seluruh hasil kebun itu.",
      "text_translation": "lalu pada pagi hari mereka saling memanggil.",
      "text": "فَتَنَادَوْا مُصْبِحِيْنَۙ",
      "text_translation_en": "Now when they rose at early morn, they called unto one another,",
      "juz_number": 29
    },
    "22": {
      "text_tafsir_en": "After waking up in the morning, they called each other and invited to go to the garden to reap the rewards. After gathering, they departed and walked furtively while whispering among themselves, \"Don't let any of the poor people come to our garden like they used to when father was still alive. We should be able to harvest the whole garden from us. use it for our own needs. \" They go to the garden early in the morning with the intention that poor people do not enter their gardens and they are very confident that they will be able to reap the rewards of the garden.",
      "text_tafsir": "Setelah bangun pada pagi harinya, mereka saling memanggil dan mengajak untuk pergi ke kebun guna memetik hasilnya. Setelah berkumpul, mereka pun berangkat dan berjalan dengan sembunyi-sembunyi sambil berbisik-bisik di antara mereka, \"Jangan biarkan seorang pun di antara orang-orang miskin itu datang ke kebun kita seperti dulu ketika ayah masih hidup. Hendaknya seluruh panen kebun ini dapat kita manfaatkan untuk keperluan kita sendiri.\" Mereka pergi ke kebun pagi-pagi sekali dengan maksud agar orang-orang miskin tidak masuk ke kebun mereka dan mereka sangat yakin akan dapat memetik seluruh hasil kebun itu.",
      "text_translation": "”Pergilah pagi-pagi ke kebunmu jika kamu hendak memetik hasil.” ",
      "text": "اَنِ اغْدُوْا عَلٰى حَرْثِكُمْ اِنْ كُنْتُمْ صَارِمِيْنَ ",
      "text_translation_en": "\"Go early to your tilth if you want to harvest the fruit!\"",
      "juz_number": 29
    },
    "23": {
      "text_tafsir_en": "After waking up in the morning, they called each other and invited to go to the garden to reap the rewards. After gathering, they departed and walked furtively while whispering among themselves, \"Don't let any of the poor people come to our garden like they used to when father was still alive. We should be able to harvest the whole garden from us. use it for our own needs. \" They go to the garden early in the morning with the intention that poor people do not enter their gardens and they are very confident that they will be able to reap the rewards of the garden.",
      "text_tafsir": "Setelah bangun pada pagi harinya, mereka saling memanggil dan mengajak untuk pergi ke kebun guna memetik hasilnya. Setelah berkumpul, mereka pun berangkat dan berjalan dengan sembunyi-sembunyi sambil berbisik-bisik di antara mereka, \"Jangan biarkan seorang pun di antara orang-orang miskin itu datang ke kebun kita seperti dulu ketika ayah masih hidup. Hendaknya seluruh panen kebun ini dapat kita manfaatkan untuk keperluan kita sendiri.\" Mereka pergi ke kebun pagi-pagi sekali dengan maksud agar orang-orang miskin tidak masuk ke kebun mereka dan mereka sangat yakin akan dapat memetik seluruh hasil kebun itu.",
      "text_translation": "Maka mereka pun berangkat sambil berbisik-bisik. ",
      "text": "فَانْطَلَقُوْا وَهُمْ يَتَخَافَتُوْنَۙ",
      "text_translation_en": "Thus they launched forth, whispering unto one another,",
      "juz_number": 29
    },
    "24": {
      "text_tafsir_en": "After waking up in the morning, they called each other and invited to go to the garden to reap the rewards. After gathering, they departed and walked furtively while whispering among themselves, \"Don't let any of the poor people come to our garden like they used to when father was still alive. We should be able to harvest the whole garden from us. use it for our own needs. \" They go to the garden early in the morning with the intention that poor people do not enter their gardens and they are very confident that they will be able to reap the rewards of the garden.",
      "text_tafsir": "Setelah bangun pada pagi harinya, mereka saling memanggil dan mengajak untuk pergi ke kebun guna memetik hasilnya. Setelah berkumpul, mereka pun berangkat dan berjalan dengan sembunyi-sembunyi sambil berbisik-bisik di antara mereka, \"Jangan biarkan seorang pun di antara orang-orang miskin itu datang ke kebun kita seperti dulu ketika ayah masih hidup. Hendaknya seluruh panen kebun ini dapat kita manfaatkan untuk keperluan kita sendiri.\" Mereka pergi ke kebun pagi-pagi sekali dengan maksud agar orang-orang miskin tidak masuk ke kebun mereka dan mereka sangat yakin akan dapat memetik seluruh hasil kebun itu.",
      "text_translation": "”Pada hari ini jangan sampai ada orang miskin masuk ke dalam kebunmu.” ",
      "text": "اَنْ لَّا يَدْخُلَنَّهَا الْيَوْمَ عَلَيْكُمْ مِّسْكِيْنٌۙ",
      "text_translation_en": "\"Indeed, no needy person shall enter it today [and come] upon you [unawares],\"",
      "juz_number": 29
    },
    "25": {
      "text_tafsir_en": "After waking up in the morning, they called each other and invited to go to the garden to reap the rewards. After gathering, they departed and walked furtively while whispering among themselves, \"Don't let any of the poor people come to our garden like they used to when father was still alive. We should be able to harvest the whole garden from us. use it for our own needs. \" They go to the garden early in the morning with the intention that poor people do not enter their gardens and they are very confident that they will be able to reap the rewards of the garden.",
      "text_tafsir": "Setelah bangun pada pagi harinya, mereka saling memanggil dan mengajak untuk pergi ke kebun guna memetik hasilnya. Setelah berkumpul, mereka pun berangkat dan berjalan dengan sembunyi-sembunyi sambil berbisik-bisik di antara mereka, \"Jangan biarkan seorang pun di antara orang-orang miskin itu datang ke kebun kita seperti dulu ketika ayah masih hidup. Hendaknya seluruh panen kebun ini dapat kita manfaatkan untuk keperluan kita sendiri.\" Mereka pergi ke kebun pagi-pagi sekali dengan maksud agar orang-orang miskin tidak masuk ke kebun mereka dan mereka sangat yakin akan dapat memetik seluruh hasil kebun itu.",
      "text_translation": "Dan berangkatlah mereka pada pagi hari dengan niat menghalangi (orang-orang miskin) padahal mereka mampu (menolongnya). ",
      "text": "وَّغَدَوْا عَلٰى حَرْدٍ قَادِرِيْنَ ",
      "text_translation_en": "– and early they went, strongly bent upon their purpose.",
      "juz_number": 29
    },
    "26": {
      "text_tafsir_en": "After arriving at the garden, they were astonished because the garden had been destroyed and burned down. They thought that what was burning was not their garden, because their garden which was full of fertile plants and dense fruit, it was time to be picked.",
      "text_tafsir": "Setelah sampai di kebun, mereka pun tercengang karena kebun itu telah musnah dan habis terbakar. Mereka mengira bahwa yang terbakar itu bukan kebun mereka, karena kebun mereka yang dipenuhi tanaman-tanaman yang subur dan buahnya lebat, telah waktunya untuk dipetik.",
      "text_translation": "Maka ketika mereka melihat kebun itu, mereka berkata, “Sungguh, kita ini benar-benar orang-orang yang sesat,",
      "text": "فَلَمَّا رَاَوْهَا قَالُوْٓا اِنَّا لَضَاۤلُّوْنَۙ",
      "text_translation_en": "But as soon as they beheld [the garden and could not recognize] it, they exclaimed, \"Surely we have lost our way!\"",
      "juz_number": 29
    },
    "27": {
      "text_tafsir_en": "Eventually they realized and were convinced that what was burning was indeed their garden, and said, \"We are not lost to another garden, this is indeed ours. Because we have sinned by not following what our fathers have outlined in each harvesting of the garden, then God destroys this garden. \"",
      "text_tafsir": "Akhirnya mereka sadar dan yakin bahwa yang terbakar itu memang kebun mereka, dan berkata, \"Kita tidak tersesat ke kebun yang lain, ini memang kepunyaan kita. Karena kita telah berdosa dengan tidak mengikuti apa yang telah digariskan oleh bapak kita pada setiap memetik hasil kebun, maka Allah memusnahkan kebun ini.\"",
      "text_translation": "bahkan kita tidak memperoleh apa pun,”",
      "text": "بَلْ نَحْنُ مَحْرُوْمُوْنَ ",
      "text_translation_en": "- [and then,] \"Nay, but we have been rendered destitute!\"",
      "juz_number": 29
    },
    "28": {
      "text_tafsir_en": "One of those who had warned them before said, \"Didn't I tell you before that we should all do what our father used to do, always thanking God and sanctifying him, always thankful for all the blessings He has bestowed on us?\" We give some of the proceeds to those who are entitled to it, and always pray to Him that we may always be richly blessed by His grace.",
      "text_tafsir": "Salah seorang di antara mereka yang pernah memperingatkan mereka sebelumnya berkata, \"Bukankah telah aku anjurkan sebelum ini agar kita semua melakukan yang biasa dilakukan bapak kita dahulu, yaitu selalu bertasbih kepada Tuhan dan mensucikan-Nya, selalu mensyukuri setiap nikmat yang telah dilimpahkan-Nya kepada kita dengan memberikan sebagian dari hasilnya kepada yang berhak menerima, dan selalu berdoa kepada-Nya agar kita selalu dilimpahi berkah dan karunia-Nya. Akan tetapi, kamu sekalian tidak mengacuhkan sedikit pun anjuranku itu.\"",
      "text_translation": "berkatalah seorang yang paling bijak di antara mereka, “Bukankah aku telah mengatakan kepadamu, mengapa kamu tidak bertasbih (kepada Tuhanmu).”",
      "text": "قَالَ اَوْسَطُهُمْ اَلَمْ اَقُلْ لَّكُمْ لَوْلَا تُسَبِّحُوْنَ ",
      "text_translation_en": "Said the most right-minded among them: \"Did I not tell you, 'Will you not extol God's limitless glory?’\"",
      "juz_number": 29
    },
    "29": {
      "text_tafsir_en": "They admit their mistakes and mistakes by stating that God destroyed the garden not because of His tyranny towards them, but because they themselves have mistreated themselves by not giving the poor and needy rights.",
      "text_tafsir": "Mereka mengakui kesalahan dan kekhilafan mereka dengan menyatakan bahwa Allah membinasakan kebun itu bukan karena kezaliman-Nya terhadap mereka, tetapi karena mereka sendiri yang telah menganiaya diri sendiri dengan tidak memberikan hak fakir dan miskin.",
      "text_translation": "Mereka mengucapkan, “Mahasuci Tuhan kami, sungguh, kami adalah orang-orang yang zalim.” ",
      "text": "قَالُوْا سُبْحٰنَ رَبِّنَآ اِنَّا كُنَّا ظٰلِمِيْنَ ",
      "text_translation_en": "They answered: \"Limitless in His glory is our Sustainer! Verily, we were doing wrong!\"",
      "juz_number": 29
    },
    "30": {
      "text_tafsir_en": "They then blamed each other for saying, \"You are the one who urged us not to give up the rights of the infidels and the poor that our father used to give.\"",
      "text_tafsir": "Mereka kemudian saling menyalahkan dengan mengatakan, \"Kamulah yang menganjurkan agar kita semua tidak lagi memberikan hak-hak orang kafir dan miskin yang biasa diberikan ayah kita dahulu.\"",
      "text_translation": "Lalu mereka saling berhadapan dan saling menyalahkan.",
      "text": "فَاَقْبَلَ بَعْضُهُمْ عَلٰى بَعْضٍ يَّتَلَاوَمُوْنَ ",
      "text_translation_en": "- and then they turned upon one another with mutual reproaches.",
      "juz_number": 29
    },
    "31": {
      "text_tafsir_en": "After blaming each other, they finally regret each other. They then realize that it is their actions and attitudes that invite such fate. They said, \"We are indeed guilty. We have violated the stipulations set by God by not granting the poor rights of our property. We will truly repent, submit, and obey His commands and abstain from all His prohibitions. May Allah bestow good and beneficial things in this life and the hereafter. \" According to the history of the Mujahids, after their repentance, Allah bestowed good gardens over their ruined gardens and granted their prayers.",
      "text_tafsir": "Setelah saling menyalahkan, akhirnya mereka menyesali diri masing-masing. Mereka lalu menyadari bahwa tindakan dan sikap merekalah yang mengundang nasib yang demikian. Mereka berkata, \"Sesungguhnya kamilah yang bersalah. Kami telah melanggar garis-garis yang telah ditetapkan Allah dengan tidak memberikan hak-hak fakir-miskin, yang ada pada harta kami. Mudah-mudahan Allah menganugerahkan kepada kami kebun yang lebih baik dari yang telah musnah ini. Kami benar-benar akan bertobat, tunduk, dan patuh menjalankan perintah-Nya serta menjauhi segala larangan-Nya. Semoga Allah menganugerahkan yang baik dan bermanfaat bagi kehidupan dunia dan kehidupan akhirat.\"\n\nMenurut riwayat dari Mujahid, setelah mereka bertobat, maka Allah menganugerahkan kebun yang lebih baik dari kebun mereka yang musnah dan mengabulkan doa-doa mereka.",
      "text_translation": "Mereka berkata, “Celaka kita! Sesungguhnya kita orang-orang yang melampaui batas. ",
      "text": "قَالُوْا يٰوَيْلَنَآ اِنَّا كُنَّا طٰغِيْنَ ",
      "text_translation_en": "[In the end] they said: \"Oh, woe unto us! Verily, we did behave outrageously!",
      "juz_number": 29
    },
    "32": {
      "text_tafsir_en": "After blaming each other, they finally regret each other. They then realize that it is their actions and attitudes that invite such fate. They said, \"We are indeed guilty. We have violated the stipulations set by God by not granting the poor rights of our property. We will truly repent, submit, and obey His commands and abstain from all His prohibitions. May Allah bestow good and beneficial things in this life and the hereafter. \" According to the history of the Mujahids, after their repentance, Allah bestowed good gardens over their ruined gardens and granted their prayers.",
      "text_tafsir": "Setelah saling menyalahkan, akhirnya mereka menyesali diri masing-masing. Mereka lalu menyadari bahwa tindakan dan sikap merekalah yang mengundang nasib yang demikian. Mereka berkata, \"Sesungguhnya kamilah yang bersalah. Kami telah melanggar garis-garis yang telah ditetapkan Allah dengan tidak memberikan hak-hak fakir-miskin, yang ada pada harta kami. Mudah-mudahan Allah menganugerahkan kepada kami kebun yang lebih baik dari yang telah musnah ini. Kami benar-benar akan bertobat, tunduk, dan patuh menjalankan perintah-Nya serta menjauhi segala larangan-Nya. Semoga Allah menganugerahkan yang baik dan bermanfaat bagi kehidupan dunia dan kehidupan akhirat.\"\n\nMenurut riwayat dari Mujahid, setelah mereka bertobat, maka Allah menganugerahkan kebun yang lebih baik dari kebun mereka yang musnah dan mengabulkan doa-doa mereka.",
      "text_translation": "Mudah-mudahan Tuhan memberikan ganti kepada kita dengan (kebun) yang lebih baik daripada yang ini, sungguh, kita mengharapkan ampunan dari Tuhan kita.” ",
      "text": "عَسٰى رَبُّنَآ اَنْ يُّبْدِلَنَا خَيْرًا مِّنْهَآ اِنَّآ اِلٰى رَبِّنَا رَاغِبُوْنَ ",
      "text_translation_en": "[But] it may be that our Sustainer will grant us something better instead: for, verily, unto our Sustainer do we turn with hope!\"",
      "juz_number": 29
    },
    "33": {
      "text_tafsir_en": "Such was the calamity that God inflicted on the owners of the garden as a trial for them. The trials were so rewarding that they repented and regretted what God had forbidden. They also promised never to do that again, and to obey God and not to do any other forbidden acts. Because they truly repent, God grants their prayers and gives them happiness in life and in the hereafter. What about the Meccans of the Mecca, will they continue to act and act as they did towards the Prophet Muhammad and the Muslims? If they obey the call of the prophet Muhammad, it is certain that Allah will grant them as it has been given to the owners of the garden. On the contrary, if they remain in their position, they will not only receive the world's punishment, but will also receive the Hereafter. Truly the torment of the hereafter is harder and heavier than the punishment of the world. If the torment of the world is just loss of wealth and pleasure, then the torment of the hereafter is even more terrible, the torment that causes misery and harm to the physical and spiritual to those who experience it.",
      "text_tafsir": "Demikianlah malapetaka yang ditimpakan Allah kepada para pemilik kebun itu sebagai cobaan bagi mereka. Cobaan itu sangat bermanfaat, sehingga mereka bertobat dan menyesali perbuatan-perbuatan yang dilarang Allah. Mereka juga berjanji tidak akan mengulangi perbuatan itu lagi, dan tetap taat kepada Allah serta tidak akan mengerjakan perbuatan-perbuatan terlarang lainnya. Karena mereka benar-benar bertobat, Allah mengabulkan doa-doa mereka dan memberikan kebahagiaan hidup di dunia dan akhirat.\n\nBagaimanakah halnya dengan orang-orang musyrik Mekah, apakah mereka akan tetap bersikap dan bertindak seperti yang telah mereka lakukan terhadap Nabi Muhammad dan kaum Muslimin? Jika mereka memperkenankan seruan Nabi Muhammad, niscaya Allah akan memberikan kepada mereka sebagaimana yang telah diberikan kepada para pemilik kebun itu. Sebaliknya jika mereka tetap pada pendirian mereka, mereka tidak saja akan memperoleh azab di dunia, tetapi juga akan menerima azab akhirat.\n\nSesungguhnya azab akhirat itu lebih keras dan lebih berat dari azab di dunia. Jika azab dunia hanya berupa kehilangan harta dan kesenangan saja, maka azab akhirat lebih dahsyat lagi dari itu, yaitu azab yang menimbulkan kesengsaraan dan malapetaka bagi jasmani dan rohani orang yang mengalaminya.",
      "text_translation": "Seperti itulah azab (di dunia). Dan sungguh, azab akhirat lebih besar se-kiranya mereka mengetahui.",
      "text": "كَذٰلِكَ الْعَذَابُۗ وَلَعَذَابُ الْاٰخِرَةِ اَكْبَرُۘ لَوْ كَانُوْا يَعْلَمُوْنَ ࣖ ",
      "text_translation_en": "SUCH is the suffering [with which We try some people in this world]; but greater by far will be the suffering [which sinners shall have to bear] in the life to come - if they but knew it!",
      "juz_number": 29
    },
    "34": {
      "text_tafsir_en": "This verse confirms that believers who obey God's commands, abstain from His prohibitions, and submit to and obey Him, will be placed in a paradise full of happiness in the hereafter. This is in return for their faith in God and their righteousness while living in the world.",
      "text_tafsir": "Ayat ini menegaskan bahwa orang-orang mukmin yang melaksanakan perintah-perintah Allah, menjauhi larangan-larangan-Nya, serta tunduk dan patuh kepada-Nya, akan ditempatkan di dalam surga yang penuh kenikmatan di akhirat. Hal ini sebagai balasan atas keimanan mereka kepada Allah dan amal saleh mereka ketika hidup di dunia.",
      "text_translation": "Sungguh, bagi orang-orang yang bertakwa (disediakan) surga yang penuh kenikmatan di sisi Tuhannya.",
      "text": "اِنَّ لِلْمُتَّقِيْنَ عِنْدَ رَبِّهِمْ جَنّٰتِ النَّعِيْمِ ",
      "text_translation_en": "For, behold, it is the God-conscious [alone] whom gardens of bliss await with their Sustainer:",
      "juz_number": 29
    },
    "35": {
      "text_tafsir_en": "According to Muqatil, when the 34th verse was quoted above, the disbelievers of Mecca said to the Muslims, \"Verily Allah has made us free from you in this life. Therefore, no doubt, He will bestow upon you in the hereafter, or at least, the same with you all. \" So Allah contradicts the disbelievers with this verse by saying, \"Will we break our promises by equating those who surrender, submit, and obey Us to those who commit sin and are always disobedient? to Us? \" The Word of God: Not the dwellers of hell are like the dwellers of heaven; the inhabitants of heaven are the ones who win. (al-hasyr \/ 59: 20) From the words of these infidels it can be understood that they consider life on this earth to be a reflection of the hereafter. If to someone in this life of the world be endowed with wealth, power, rank, pleasure, and luxury, surely in the hereafter they will. On the other hand, if a person's worldly life is to suffer and suffer, then in the future they will also suffer and suffer. The idea of such unbelievers is a misconception. Life on earth is the preparation of the afterlife. If a person is good at worship and charity, even if he is not given a lot of wealth, power, rank, etc., he will still receive double the reward of God. On the contrary, if they disobey and commit sinful sins, even though they gain a lot of wealth, prominence, and power, then there will be a place of misery and humiliation.",
      "text_tafsir": "Menurut Muqatil, tatkala turun ayat ke-34 di atas, orang-orang kafir Mekah berkata kepada kaum Muslimin, \"Sesungguhnya Allah telah melebihkan kami dari kamu dalam kehidupan dunia ini. Oleh karena itu, tidak boleh tidak, kami akan dilebihkan-Nya atas kamu di akhirat nanti, atau paling tidak, sama dengan kamu sekalian.\" Maka Allah membantah pernyataan orang-orang kafir itu dengan ayat ini dengan mengatakan, \"Apakah Kami akan menyalahi janji-janji Kami dengan menyamakan orang-orang yang berserah diri, tunduk, dan taat kepada Kami dengan orang-orang yang mengerjakan perbuatan dosa dan selalu ingkar kepada Kami?\"\n\nFirman Allah:\n\nTidak sama para penghuni neraka dengan para penghuni-penghuni surga; penghuni-penghuni surga itulah orang-orang yang memperoleh kemenangan. (al-hasyr\/59: 20)\n\nDari perkataan orang-orang kafir ini dapat dipahami bahwa menurut mereka kehidupan di dunia ini sebagai gambaran kehidupan di akhirat nanti. Jika kepada seseorang dalam kehidupan dunia ini dianugerahi harta yang banyak, kekuasaan, pangkat, kesenangan, dan kemewahan, tentu di akhirat nanti mereka akan demikian pula. Sebaliknya jika kehidupan dunia seseorang mengalami kesengsaraan dan penderitaan, tentu di akhirat mereka juga akan sengsara dan menderita.\n\nAnggapan orang-orang kafir yang demikian adalah anggapan yang keliru. Kehidupan di dunia adalah persiapan kehidupan di akhirat. Jika seseorang baik ibadah dan amalnya, sekalipun tidak dianugerahi harta yang banyak, kekuasaan, pangkat, dan sebagainya, maka ia tetap mendapat pahala yang berlipat ganda dari Allah. Sebaliknya, jika mereka ingkar dan mengerjakan perbuatan-perbuatan dosa, sekalipun ia memperoleh harta yang banyak, pangkat, dan kekuasaan, maka di akhirat akan disediakan tempat yang penuh kesengsaraan dan kehinaan.",
      "text_translation": "Apakah patut Kami memperlakukan orang-orang Islam itu seperti orang-orang yang berdosa (orang kafir)?",
      "text": "اَفَنَجْعَلُ الْمُسْلِمِيْنَ كَالْمُجْرِمِيْنَۗ",
      "text_translation_en": "or should We, perchance, treat those who surrender themselves unto Us as [We would treat] those who remain lost in sin?",
      "juz_number": 29
    },
    "36": {
      "text_tafsir_en": "In this verse, Allah reveals the strangeness of the way of thinking of the disbelievers so as to establish that. As if they did not use the right judgment, common sense, and a fair decision. Is it possible that people who are heretics are the same as those who are righteous, those who are pious with sinners, those who fear Allah with those who deny Him, and so on. This way of thinking as used by unbelievers is a way of thinking that is wrong and influenced by Satan who always misleads humans.",
      "text_tafsir": "Pada ayat ini, Allah menyatakan keanehan jalan berpikir orang-orang kafir sehingga menetapkan yang demikian. Seakan-akan mereka tidak menggunakan pertimbangan yang benar, akal yang sehat, dan keputusan yang adil. Mungkinkah orang yang sesat sama dengan orang yang benar, orang yang takwa dengan orang yang berdosa, orang yang bertakwa kepada Allah dengan orang yang ingkar kepada-Nya, dan sebagainya. Cara berpikir seperti yang digunakan orang-orang kafir itu adalah cara berpikir yang salah dan dipengaruhi oleh setan yang selalu menyesatkan manusia.",
      "text_translation": "Mengapa kamu (berbuat demikian)? Bagaimana kamu mengambil keputusan?",
      "text": "مَا لَكُمْۗ  كَيْفَ تَحْكُمُوْنَۚ",
      "text_translation_en": "What is amiss with you? On what do you base your judgment [of right and wrong]?",
      "juz_number": 29
    },
    "37": {
      "text_tafsir_en": "In this verse, it is stated that the opinions or thoughts of the unbelievers are not based on revelation from God. There is nothing in the book of God that describes such things. The expression was asked of them in the form of the question, \"Do you, O infidels, have a book from heaven, which you received from your fathers and then learned from generation to generation, containing such a condition as you say?\" Do you have that kind of book that allows you to choose what you want according to your own will? \" This verse is presented in the form of a sentence. Usually a question sentence is meant to ask for something unknown, but the question is here to refute and denounce the ugliness of an act. As if God had revealed to the unbelievers that none of His revelations had revealed it. Their words are the words they make and the way they do them is a compliment.",
      "text_tafsir": "Dalam ayat ini, dinyatakan bahwa pendapat atau jalan pikiran orang-orang kafir itu tidak berdasarkan wahyu dari Allah. Tidak ada satu pun dari kitab Allah yang menerangkan hal yang demikian itu. Ungkapan itu dilontarkan kepada mereka dalam bentuk pertanyaan, \"Apakah kamu, hai orang-orang kafir, mempunyai suatu kitab yang diturunkan dari langit, yang kamu terima dari nenek moyangmu kemudian kamu pelajari secara turun-temurun, yang mengandung suatu ketentuan seperti yang kamu katakan itu. Apakah kamu memiliki kitab yang semacam itu yang membolehkan kamu memilih apa yang kamu inginkan sesuai dengan kehendakmu.\"\n\nAyat ini dikemukakan dalam bentuk kalimat tanya. Biasanya kalimat tanya bermaksud untuk menanyakan sesuatu yang tidak diketahui, tetapi kalimat tanya di sini untuk mengingkari dan menyatakan kejelekan suatu perbuatan. Seakan-akan Allah menyatakan kepada orang-orang kafir bahwa tidak ada suatu pun wahyu-Nya yang menyatakan demikian. Ucapan mereka itu adalah ucapan yang mereka ada-adakan dan cara mengada-adakan yang demikian itu adalah cara yang tidak terpuji.",
      "text_translation": "Atau apakah kamu mempunyai kitab (yang diturunkan Allah) yang kamu pelajari?  ",
      "text": "اَمْ لَكُمْ كِتٰبٌ فِيْهِ تَدْرُسُوْنَۙ",
      "text_translation_en": "Or have you, perchance, a [special] divine writ which you study,",
      "juz_number": 29
    },
    "38": {
      "text_tafsir_en": "In this verse, it is stated that the opinions or thoughts of the unbelievers are not based on revelation from God. There is nothing in the book of God that describes such things. The expression was asked of them in the form of the question, \"Do you, O infidels, have a book from heaven, which you received from your fathers and then learned from generation to generation, containing such a condition as you say?\" Do you have that kind of book that allows you to choose what you want according to your own will? \" This verse is presented in the form of a sentence. Usually a question sentence is meant to ask for something unknown, but the question is here to refute and denounce the ugliness of an act. As if God had revealed to the unbelievers that none of His revelations had revealed it. Their words are the words they make and the way they do them is a compliment.",
      "text_tafsir": "Dalam ayat ini, dinyatakan bahwa pendapat atau jalan pikiran orang-orang kafir itu tidak berdasarkan wahyu dari Allah. Tidak ada satu pun dari kitab Allah yang menerangkan hal yang demikian itu. Ungkapan itu dilontarkan kepada mereka dalam bentuk pertanyaan, \"Apakah kamu, hai orang-orang kafir, mempunyai suatu kitab yang diturunkan dari langit, yang kamu terima dari nenek moyangmu kemudian kamu pelajari secara turun-temurun, yang mengandung suatu ketentuan seperti yang kamu katakan itu. Apakah kamu memiliki kitab yang semacam itu yang membolehkan kamu memilih apa yang kamu inginkan sesuai dengan kehendakmu.\"\n\nAyat ini dikemukakan dalam bentuk kalimat tanya. Biasanya kalimat tanya bermaksud untuk menanyakan sesuatu yang tidak diketahui, tetapi kalimat tanya di sini untuk mengingkari dan menyatakan kejelekan suatu perbuatan. Seakan-akan Allah menyatakan kepada orang-orang kafir bahwa tidak ada suatu pun wahyu-Nya yang menyatakan demikian. Ucapan mereka itu adalah ucapan yang mereka ada-adakan dan cara mengada-adakan yang demikian itu adalah cara yang tidak terpuji.",
      "text_translation": "sesungguhnya kamu dapat memilih apa saja yang ada di dalamnya.",
      "text": "اِنَّ لَكُمْ فِيْهِ لَمَا تَخَيَّرُوْنَۚ",
      "text_translation_en": "and in which you find all that you may wish to find?",
      "juz_number": 29
    },
    "39": {
      "text_tafsir_en": "In this verse, Allah once again mocked the disbelievers by saying the sentence, \"O disbelievers, have you ever received the promises from Us that We must keep as you said, that is, you will get everything you want, even though you deny us? \" From this question it can be understood that Allah has never established or promised His servants as they say it.",
      "text_tafsir": "Pada ayat ini, sekali lagi Allah mengejek orang-orang kafir dengan mengemukakan kalimat tanya, \"Hai orang-orang kafir, apakah kamu sekalian pernah menerima janji-janji dari Kami yang harus Kami tepati seperti yang kamu katakan itu, yaitu kamu akan memperoleh segala yang kamu ingini, padahal kamu mengingkari Kami?\" Dari pertanyaan ini dapat dipahami bahwa Allah sekali-kali tidak pernah menetapkan atau menjanjikan kepada hamba-hamba-Nya seperti yang mereka katakan itu.",
      "text_translation": "Atau apakah kamu memperoleh (janji-janji yang diperkuat dengan) sumpah dari Kami, yang tetap berlaku sampai hari Kiamat; bahwa kamu dapat mengambil keputusan (sekehendakmu)? ",
      "text": "اَمْ لَكُمْ اَيْمَانٌ عَلَيْنَا بَالِغَةٌ اِلٰى يَوْمِ الْقِيٰمَةِۙ اِنَّ لَكُمْ لَمَا تَحْكُمُوْنَۚ",
      "text_translation_en": "Or have you received a solemn promise, binding on Us till Resurrection Day, that yours will assuredly be whatever you judge [to be your rightful due]?",
      "juz_number": 29
    },
    "40": {
      "text_tafsir_en": "Then Allah commanded His Messenger to ask the disbelievers with the intention of condemning the way they did, \"O unbelievers, if you have a book that explains what you are saying, let us know. God has promised you the promise that you will get everything you want, try to prove it. If you have someone who can guarantee the truth of your words, show us his people. \" The Prophet's questions and requests to the disbelievers caused them to speak a thousand languages, because they would not be able to answer them. In fact they worship idols or statues. They created their own idols and idols, and they knew that they could not guarantee what they were saying, as if they were helpless to defend their ideas. The word za'im (something responsible) at the end of this verse means one who guarantees that something must be fulfilled and full of truth. When a person says something or promises something, then a za'im guarantees that the person's word is the truth, or that the promise he or she has made will be kept. The disbelievers of Mecca were asked to present who justified the truth of their words saying that Allah equated the recompense of the believers with the recompense they received, but Allah never said that.",
      "text_tafsir": "Kemudian Allah memerintahkan kepada Rasul-Nya agar menanyakan kepada orang-orang kafir dengan maksud mencela cara-cara yang mereka lakukan, \"Hai Orang-orang kafir, jika kamu mempunyai kitab yang menerangkan apa yang kamu katakan itu, perlihatkanlah kepada kami. Jika benar bahwa Allah telah berjanji kepadamu yang ditetapkan dengan sumpah bahwa kamu akan memperoleh semua yang kamu inginkan, cobalah buktikan sumpah itu. Jika kamu mempunyai seseorang yang dapat menjamin kebenaran perkataanmu itu cobalah tunjukkan kepada kami orangnya.\"\n\nPertanyaan dan permintaan Nabi kepada orang-orang kafir itu menyebabkan mereka bungkam seribu bahasa, karena mereka tidak akan sanggup menjawab dan memenuhi permintaan itu. Kenyataannya mereka menyembah berhala atau patung. Patung dan berhala itu mereka buat sendiri, dan mereka tahu bahwa patung dan berhala itu tidak akan dapat menjamin yang mereka katakan, seakan-akan mereka tidak berdaya lagi mempertahankan pendapat mereka.\n\nKata za'im (sesuatu yang bertanggung jawab) yang terdapat dalam akhir ayat ini maksudnya adalah orang yang menjamin bahwa sesuatu pasti terlaksana dan penuh kebenaran. Bila seorang mengatakan sesuatu atau menjanjikan sesuatu, maka seorang za'im menjamin bahwa perkataan orang itu adalah perkataan yang benar, atau janji yang telah dijanjikannya itu pasti ditepati. Orang-orang kafir Mekah diminta untuk mengemukakan siapa yang menjamin kebenaran perkataan mereka yang mengatakan bahwa Allah menyamakan balasan yang diterima orang-orang beriman dengan balasan yang mereka terima, padahal Allah tidak pernah mengatakan yang demikian itu.",
      "text_translation": "Tanyakanlah kepada mereka, “Siapakah di antara mereka yang bertanggung jawab terhadap (keputusan yang diambil itu)?”",
      "text": "سَلْهُمْ اَيُّهُمْ بِذٰلِكَ زَعِيْمٌۚ",
      "text_translation_en": "Ask them which of them is able to vouch for this!",
      "juz_number": 29
    },
    "41": {
      "text_tafsir_en": "In this verse, the Prophet Muhammad is returned to ask the unbelievers whether they have any associates who can guarantee the truth of the words they utter. If so, try submitting it or bringing it in to prove their warranty. The meaning of their \"allies\" in this verse is everything they worship other than God, such as the statue of Lata, 'Uzza, Manah, and so on. It also includes the people they respect, and their religious leaders. With this last question, the disbelievers of Mecca were silent and silent as it turned out that the gods they worshiped besides Allah, their famous literary scholars, such as al-Walid bin al-Mugirah, and others were unable to produce or bring them forth. .",
      "text_tafsir": "Dalam ayat ini, kembali Nabi Muhammad diperintahkan untuk menanyakan kepada orang-orang kafir itu apakah mereka mempunyai sekutu-sekutu yang dapat menjamin kebenaran perkataan yang mereka ucapkan. Jika ada, cobalah kemukakan atau mendatangkannya untuk membuktikan jaminan mereka.\n\nYang dimaksud dengan \"sekutu-sekutu\" mereka dalam ayat ini ialah semua yang mereka sembah selain Allah, seperti patung Lata, 'Uzza, Manah, dan sebagainya. Juga termasuk di dalamnya orang-orang yang mereka hormati, dan pemuka-pemuka agama mereka.\n\nDengan pertanyaan terakhir ini, orang-orang kafir Mekah bertambah diam dan bungkam karena ternyata tuhan-tuhan yang mereka sembah selain Allah, para ahli sastra mereka yang terkenal, seperti al-Walid bin al-Mugirah, dan lain-lain tidak sanggup mengemukakan atau mendatangkannya.",
      "text_translation": "Atau apakah mereka mempunyai sekutu-sekutu? Kalau begitu hendaklah mereka mendatangkan sekutu-sekutunya jika mereka orang-orang yang benar.",
      "text": "اَمْ لَهُمْ شُرَكَاۤءُۚ فَلْيَأْتُوْا بِشُرَكَاۤىِٕهِمْ اِنْ كَانُوْا صٰدِقِيْنَ ",
      "text_translation_en": "Or have they, perchance, any sages to support their views? Well, then, if they are sincere in this their claim, let them produce those supporters of theirs",
      "juz_number": 29
    },
    "42": {
      "text_tafsir_en": "This verse tells the disbelievers of Mecca that if they have the surety of their word that they will surely go to heaven like the believers in heaven, then try to bring that witness or the surety on the Day of Judgment. On that day, everyone was in a state of fear and was trying to escape that fear. On that day they were asked to bow down to test their faith when they could no longer bow, because their joints were weak, because the torment had covered them from above and below, and from the right and left. A day like that must come and chaos as it was meant to happen. At that time, there was no place for refuge except Allah, the Almighty.",
      "text_tafsir": "Ayat ini menyatakan kepada orang-orang kafir Mekah bahwa jika mereka mempunyai penjamin kebenaran perkataan mereka bahwa mereka pasti akan masuk surga seperti orang-orang mukmin masuk surga, maka cobalah datangkan saksi atau penjamin itu nanti pada hari Kiamat. Pada hari itu, semua orang dalam keadaan ketakutan dan sedang berusaha lari dari ketakutan itu. Pada hari itu mereka diminta sujud untuk menguji keimanan mereka padahal mereka tidak sanggup lagi sujud, karena persendian tulang-tulang mereka telah lemah, karena azab telah meliputi mereka dari atas dan bawah, serta dari samping kanan dan kiri. Hari yang seperti itu pasti datang dan huru-hara seperti yang dimaksudkan itu pasti terjadi. Pada saat itu, tiada satu pun tempat berlindung kecuali Allah, Tuhan Yang Mahakuasa.",
      "text_translation": "(Ingatlah) pada hari ketika betis disingkapkan dan mereka diseru untuk bersujud; maka mereka tidak mampu,",
      "text": "يَوْمَ يُكْشَفُ عَنْ سَاقٍ وَّيُدْعَوْنَ اِلَى السُّجُوْدِ فَلَا يَسْتَطِيْعُوْنَۙ",
      "text_translation_en": "on the Day when man's very being shall be bared to the bone, and when they [who now deny the truth] shall be called upon to prostrate themselves [before God], and shall be unable to do so:",
      "juz_number": 29
    },
    "43": {
      "text_tafsir_en": "In this verse it is explained that the unbelievers on the Day of Judgment are in a state of helplessness. No one gives them any help and they are in despair. They are only in a state of remorse, but they are all useless. When they lived in the world of old, they were in good health, of good standing, of power, and of stature, but they would not pray, bow down and worship God, and surrender themselves to Him. Later in the day, when the remorse came, they called upon the Lord, seeking to work for him in order to serve him, but they could not do it again. That's because besides their bones, the door of repentance has been closed. Only believers can bow down to the Hereafter when God reveals Himself to them",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa orang-orang kafir pada hari Kiamat berada dalam keadaan tidak berdaya sedikit pun. Tidak ada yang memberi mereka pertolongan dan mereka dalam keadaan hina-dina. Mereka hanya dalam keadaan penuh penyesalan, tetapi semua itu tidak berguna lagi.\n\nKetika hidup di dunia dahulu, mereka dalam keadaan sehat, berkecukupan, berkuasa, dan berpangkat, tetapi mereka tidak mau salat, sujud dan menyembah Allah, serta menyerahkan diri kepada-Nya. Setelah di akhirat, di waktu penyesalan itu tiba, mereka memanggil Tuhan, ingin mengerjakannya untuk menghambakan diri kepada-Nya, akan tetapi mereka tidak sanggup mengerjakannya lagi. Hal itu karena di samping tulang-tulang mereka telah lemah, pintu tobat juga telah ditutup. Hanya orang-orang beriman sajalah yang dapat bersujud di akhirat ketika Allah menampakkan diri-Nya kepada mereka",
      "text_translation": "pandangan mereka tertunduk ke bawah, diliputi kehinaan. Dan sungguh, dahulu (di dunia) mereka telah diseru untuk bersujud pada waktu mereka sehat (tetapi mereka tidak melakukan). ",
      "text": "خَاشِعَةً اَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ  ۗوَقَدْ كَانُوْا يُدْعَوْنَ اِلَى السُّجُوْدِ وَهُمْ سَالِمُوْنَ ",
      "text_translation_en": "downcast will be their eyes, with ignominy overwhelming them - seeing that they had been called upon [in vain] to prostrate themselves [before Him] while they were yet sound [and alive].",
      "juz_number": 29
    },
    "44": {
      "text_tafsir_en": "This verse is an antidote to the Prophet Muhammad and a great threat to the disbelievers. There are many attitudes and actions of the unbelievers towards the Prophet Muhammad and the Muslims in carrying out the work that Allah has imposed on them. Among them are some who prevent people from converting to Islam, torturing the companions of the Prophet who converted to Islam, hurting, mocking, boycotting, and exorcising (the Prophet), and so on. Therefore, it sometimes arises in the Prophet's heart to pray for Allah to punish and torment those who are disobedient as has been done to the people of the past. In this verse, God declares that He is aware of all the attitudes and actions of those infidels, and will punish them according to what they do. Furthermore, Allah declares that by rejecting the Qur'an and disobeying Allah, the unbelievers have the opportunity to commit sinful acts and to persecute so that the sin they commit is increasing. Thus, the punishment of their punishment was so severe that they could not bear it. They thought that with their rank, wealth, and power, God had bestowed on them unspeakable gifts, but that was not the case. In fact, with their rank, wealth, and power, their sin increased. In another verse, God says: Then leave them in error until the appointed time. Do they think We give them wealth and children (meaning that) We will soon give them good things? (No), but they didn't realize it. (al-Mu'minun \/ 23: 54-56) Other words of Allah: So when they forget the warnings that have been given to them, We have opened all their doors. So that when they were pleased with what they had been given, We suddenly punished them, and at that moment they fell into despair. (al-An'am \/ 6: 44)",
      "text_tafsir": "Ayat ini merupakan penawar hati dan hiburan kepada Nabi Muhammad dan ancaman keras bagi orang-orang kafir. Sangat banyak sikap dan tindakan orang-orang kafir terhadap Nabi Muhammad dan kaum Muslimin dalam melaksanakan tugas yang dibebankan Allah kepada mereka. Di antaranya ada yang menghalang-halangi orang untuk masuk Islam, menyiksa para sahabat Nabi yang telah masuk Islam, menyakiti, mengejek, memboikot, dan mengucilkan (mengisolir) Nabi, dan sebagainya. Oleh karena itu, kadang-kadang timbul dalam hati Nabi untuk berdoa agar Allah mengazab dan menyiksa mereka yang ingkar itu seperti yang pernah ditimpakan kepada umat-umat yang lalu. Dengan ayat ini, Allah menyatakan bahwa Dia mengetahui segala macam bentuk sikap dan tindakan orang-orang kafir itu, dan akan mengazab mereka sesuai dengan apa yang mereka lakukan. \n\nSelanjutnya Allah menyatakan bahwa karena mendustakan Al-Qur'an dan mengingkari Allah, maka orang-orang kafir itu mendapat kesempatan untuk melakukan perbuatan-perbuatan dosa dan melakukan penganiayaan sehingga perbuatan dosa yang mereka lakukan itu bertambah banyak. Dengan demikian, balasan azabnya pun bertambah berat, sehingga tidak tertanggungkan oleh mereka. Mereka menyangka bahwa dengan pangkat, harta, dan kekuasaan yang ada pada mereka, Allah telah melimpahkan karunia yang tiada taranya kepada mereka, padahal tidak demikian halnya. Bahkan, dengan pangkat, kekayaan, dan kekuasaan yang ada pada mereka itu, dosa mereka semakin bertambah besar. Dalam ayat yang lain, Allah berfirman:\n\nMaka biarkanlah mereka dalam kesesatannya sampai waktu yang ditentukan. Apakah mereka mengira bahwa Kami memberikan harta dan anak-anak kepada mereka itu (berarti bahwa) Kami segera memberikan kebaikan-kebaikan kepada mereka? (Tidak), tetapi mereka tidak menyadarinya. (al-Mu'minun\/23: 54-56)\n\nFirman Allah lainnya:\n\nMaka ketika mereka melupakan peringatan yang telah diberikan kepada mereka, Kami pun membukakan semua pintu (kesenangan) untuk mereka. Sehingga ketika mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka secara tiba-tiba, maka ketika itu mereka terdiam putus asa. (al-An'am\/6: 44)",
      "text_translation": "Maka serahkanlah kepada-Ku (urusannya) dan orang-orang yang mendustakan perkataan ini (Al-Qur'an). Kelak akan Kami hukum mereka berangsur-angsur dari arah yang tidak mereka ketahui, ",
      "text": "فَذَرْنِيْ وَمَنْ يُّكَذِّبُ بِهٰذَا الْحَدِيْثِۗ سَنَسْتَدْرِجُهُمْ مِّنْ حَيْثُ لَا يَعْلَمُوْنَۙ",
      "text_translation_en": "Hence, leave Me alone with such as give the lie to this tiding. We shall bring them low, step by step, without their perceiving how it has come about:",
      "juz_number": 29
    },
    "45": {
      "text_tafsir_en": "Allah declares that He tempts those infidels to the appointed time by allowing them to increase their infidelity and wickedness. God also states that His plan cannot be thwarted by anyone, and it must be fulfilled, that no one can thwart Him. Indeed, if the disbelievers want to know that they will come to a stand and see that they are used to thwart the Messenger of Allah and those who believe in Allah's religion, it is the blessings that Allah bestows upon them, such as wealth, rank , department, and more. They should use these gifts to seek His pleasure. Their sins are so great that they disobey and abuse the favor of God. Concerning the punishment inflicted on the disbelievers, it is described in the hadith of the Messenger of Allah (may peace be upon him) narrated by al-Bukhari and the Muslims: Verily Allah Ta'ala will suspend the punishment of the wrongdoers, until when He punishes them, no one will escape the punishment. . Then the Prophet (pbuh) read (Surah Hud \/ 11: 102): \"And such is the punishment of your Lord when He torments (the inhabitants of) the unjust land. Indeed, His torment is very painful, very heavy.\" (History of al-Bukhari, Muslim, Abu Ya'la, al-Baihaqi and an-Nasa'i of Abu Musa al-Ash'ari)",
      "text_tafsir": "Allah menyatakan bahwa Dia memberi tempo kepada orang-orang kafir itu sampai pada waktu yang ditentukan dengan membiarkan mereka bertambah-tambah kekafiran dan kezalimannya. Allah juga menyatakan bahwa rencana-Nya tidak dapat digagalkan oleh siapa pun, dan pasti terlaksana, tidak seorang pun yang dapat menghalang-halangi-Nya.\n\nSebenarnya jika orang-orang kafir mau menyadari tentu mereka akan sampai kepada suatu pendirian dan pandangan bahwa yang mereka gunakan untuk menghalang-halangi Rasulullah saw dan orang-orang beriman menegakkan agama Allah, adalah nikmat-nikmat yang dianugerahkan Allah kepada mereka, seperti kekayaan, pangkat, jabatan, dan sebagainya. Seharusnya nikmat-nikmat itu mereka gunakan untuk mencari keridaan-Nya. Sangat besar dosa mereka karena mengingkari dan menyalahgunakan nikmat Allah itu.\n\nMengenai azab yang ditimpakan kepada orang-orang kafir ini diterangkan dalam hadis Rasulullah saw yang diriwayatkan al-Bukhari dan Muslim:\n\nSesungguhnya Allah Ta'ala akan menangguhkan azab bagi orang-orang yang zalim, hingga apabila Dia mengazabnya, tidak ada yang luput dari azab itu. Kemudian Nabi saw membaca (Surah Hud\/11: 102): \"Dan begitulah siksa Tuhanmu apabila Dia menyiksa (penduduk) negeri-negeri yang berbuat zalim. Sungguh, siksa-Nya sangat pedih, sangat berat.\" (Riwayat al-Bukhari, Muslim, Abu Ya'la, al-Baihaqi dan an-Nasa'i dari Abu Musa al-Asy'ari)",
      "text_translation": "dan Aku memberi tenggang waktu kepada mereka. Sungguh, rencana-Ku sangat teguh. ",
      "text": "وَاُمْلِيْ لَهُمْۗ اِنَّ كَيْدِيْ مَتِيْنٌ ",
      "text_translation_en": "for, behold, though I may give them rein for a while, My subtle scheme is exceedingly firm!",
      "juz_number": 29
    },
    "46": {
      "text_tafsir_en": "In this verse, Allah asked the Prophet (peace be upon him) a question with a view to guessing the way of the unbelievers that someone is doing some work to expect some worldly reward, profit, or pleasure. According to them, no one wants to work and try solely because of God. Allah's question is: O Muhammad, are you asking for rewards from those who associate me with something else, because you give him advice, call them to the truth and follow my religion, so they must be burdened by debt because of your wages ask for that?",
      "text_tafsir": "Dalam ayat ini, Allah mengajukan kepada Rasul saw suatu pertanyaan dengan maksud untuk menerka jalan pikiran orang-orang kafir bahwa seseorang melakukan sesuatu pekerjaan untuk mengharapkan suatu upah, keuntungan, atau kesenangan duniawi. Menurut mereka, tidak ada orang yang mau bekerja dan berusaha semata-mata karena Allah. Pertanyaan Allah itu ialah: Wahai Muhammad, apakah engkau meminta upah kepada orang-orang yang mempersekutukan-Ku dengan sesuatu yang lain, karena engkau memberinya nasihat, menyeru mereka kepada kebenaran dan mengikuti agama-Ku, sehingga mereka harus dibebani oleh hutang karena upah yang kau minta itu?",
      "text_translation": "Ataukah engkau (Muhammad) meminta imbalan kepada mereka, sehingga mereka dibebani dengan utang?",
      "text": "اَمْ تَسْـَٔلُهُمْ اَجْرًا فَهُمْ مِّنْ مَّغْرَمٍ مُّثْقَلُوْنَۚ ",
      "text_translation_en": "Or is it that [they fear lest] thou ask them for a reward, [O Prophet,] so that they would be burdened with debt [if they listened to thee]?",
      "juz_number": 29
    },
    "47": {
      "text_tafsir_en": "In this verse the question continues: Do they have knowledge about the unseen, or have like the Lawh Mahfudh that records everything they want, that is proof of the truth of their opinions? The Meccan infidels assumed that the statues they worshiped could tell them everything that was going to happen and all that was unseen. However, their assumption has no evidence at all.",
      "text_tafsir": "Pada ayat ini pertanyaan tersebut masih dilanjutkan: Apakah mereka mempunyai pengetahuan tentang yang gaib, atau mempunyai seperti Lauh Mahfudh yang mencatat segala sesuatu dengan yang mereka kehendaki yaitu bukti kebenaran pendapat mereka?\n\nOrang-orang kafir Mekah beranggapan bahwa patung-patung yang mereka sembah dapat memberitahukan kepada mereka segala sesuatu yang akan terjadi dan segala sesuatu yang gaib. Akan tetapi, anggapan mereka itu tidak ada buktinya sama sekali.",
      "text_translation": "Ataukah mereka mengetahui yang gaib, lalu mereka menuliskannya?",
      "text": "اَمْ عِنْدَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُوْنَ ",
      "text_translation_en": "Or [do they think] that the hidden reality [of all that exists] is within their grasp, so that [in time] they can write it down?",
      "juz_number": 29
    },
    "48": {
      "text_tafsir_en": "Allah commanded the Prophet Muhammad to be patient in accepting his decrees, to carry out the duties imposed upon him, and to avoid anything that might hinder or interfere with his efforts. Then God warned him not to act and act like a man in the fish's belly, the prophet Jonah. Being angry with his people, Jonah left them and prayed to God that they would be punished with a devastating punishment. The story begins when Jonah was sent by God to the people of Nineveh. He calls on his people to worship God, the One True God, and there is no god but Him. But the people of Nineveh refused to accept the request, even though they opposed it and threatened it. Because of the attitude and actions of his people, he was angry and warned them that God would inflict a terrible disaster in return for their attitude and disobedience. Then he left his people. After the death of Jonah, his people realized and feared the threat of God, so they went out of their houses to the open fields with their wives, children, and livestock. In the open field, together they professed repentance to God, and humbled themselves with faith. They promised God would obey Jonah's call, obey his orders and put an end to his ban. Because the people of Jonah were truly converted, submissive, and surrendered to him, God answered their prayer by undoing the calamity that had come to them, as explained in the word of God: Then why (none) of the people of the land believed? , then his faith is worth it besides the people of Jonah? When they (the people of Jonah) believed, We removed from them the humiliating torment of the life of the world, and We gave them pleasure in due time. (Jonah \/ 10: 98) But Jonah, after giving this warning, left his people leaving the task that God had entrusted to him as His apostle. Without God's permission, he went aboard a loaded ship. Once the ship sailed and was in the middle of the ocean the captain was worried that the ship would sink, in case the load was not reduced. To reduce the cargo of the ship, they held a draw among the passengers. Whoever loses the ballot will be thrown into the sea. Thus, the ship will avoid danger of sinking. In the draw, Jonah lost, but the passengers of the ship felt heavy in their decision. It was repeated three times and the result was the same, Jonah still lost. But just like the first one, the passengers were also overwhelmed with the decision. Finally Jonah made his own decision, and he also dived into the sea. After Jonah plunged into the sea, God commanded a great shark to swallow it. The fish was told not to eat Jonah's flesh and bones, but rather to make his stomach a prison for Jonah, because it was not his food. Jonah was suffering and suffering in the dark fish belly. He repented, prayed, and turned himself over to God, may Allah forgive his sins and save him, as it is said in the other word of God: And (remember) dzun Nun (Jonah), when he went out in anger, he thought that We would not trouble her, so she prayed in a very dark state, \"There is no god but You, your Holy One. Truly, I am among the wrongdoers.\" So We granted him (our prayer) and saved him from grief. And so We saved the believers. (al-Anbiya '\/ 21: 87-88)",
      "text_tafsir": "Allah memerintahkan kepada Nabi Muhammad agar bersabar dalam menerima ketetapan-Nya, tetap melaksanakan tugas kerasulan yang telah dibebankan kepadanya, dan menghindari segala sesuatu yang dapat menghalangi atau mengganggu usaha-usaha dalam melaksanakan tugas itu. Kemudian Allah memperingatkan beliau agar tidak bersikap dan bertindak seperti seorang yang berada dalam perut ikan, yaitu Nabi Yunus. Karena marah kepada kaumnya, Nabi Yunus lalu meninggalkan mereka dan berdoa kepada Allah agar mereka ditimpa azab yang membinasakan.\n\nKisah ini bermula ketika Nabi Yunus diutus Allah kepada penduduk kota Niniveh. Ia menyeru kaumnya agar menyembah Allah, Tuhan Yang Maha Esa, tidak ada tuhan selain Dia. Tetapi penduduk kota Niniveh menolak ajakan itu, bahkan mereka mengingkari dan mengancamnya. Karena sikap dan tindakan kaumnya yang demikian itu, beliau pun marah serta memperingatkan mereka bahwa Allah akan menimpakan malapetaka yang sangat dahsyat sebagai balasan terhadap sikap dan keingkaran mereka. Beliau pun lalu meninggalkan kaumnya. \n\nSepeninggal Nabi Yunus, kaumnya sadar dan takut kepada ancaman Allah itu, maka mereka pun keluar dari rumah-rumah mereka menuju tanah lapang bersama istri, anak, dan binatang ternak mereka. Di tanah lapang itu, mereka bersama-sama menyatakan bertobat kepada Allah, dan merendahkan diri dengan penuh keimanan. Mereka berjanji kepada Allah akan mengikuti seruan Yunus, melaksanakan perintah dan menghentikan larangan-Nya. Karena kaum Yunus itu bertobat dengan sebenar-benarnya, tunduk, dan menyerahkan diri kepada-Nya, maka Allah mengabulkan doa mereka dengan mengurungkan datangnya malapetaka itu kepada mereka, sebagaimana diterangkan dalam firman Allah:\n\nMaka mengapa tidak ada (penduduk) suatu negeri pun yang beriman, lalu imannya itu bermanfaat kepadanya selain kaum Yunus? Ketika mereka (kaum Yunus itu) beriman, Kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia, dan Kami beri kesenangan kepada mereka sampai waktu tertentu. (Yunus\/10: 98)\n\nAdapun Nabi Yunus, setelah memberi peringatan itu, pergi dari kaumnya dengan meninggalkan tugas yang dipercayakan Allah kepadanya sebagai rasul-Nya. Tanpa mendapat izin dari Allah, beliau pergi dengan menumpang sebuah kapal yang sarat dengan muatan. Setelah kapal itu berlayar dan berada di tengah lautan timbullah kekhawatiran nakhodanya bahwa kapal itu bakal tenggelam, seandainya muatannya itu tidak dikurangi.\n\nUntuk mengurangi muatan kapal itu, mereka mengadakan undian di antara penumpang. Barang siapa yang kalah dalam undian itu, akan dilemparkan ke dalam laut. Dengan demikian, kapal itu akan terhindar dari bahaya tenggelam. Dalam undian itu, Nabi Yunus kalah, namun para penumpang kapal itu merasa berat melakukan keputusan tersebut. Hal itu diulangi hingga tiga kali dan hasilnya sama, Nabi Yunus tetap kalah. Namun sebagaimana yang pertama, para penumpang juga merasa berat melaksanakan keputusan itu. Akhirnya Nabi Yunus mengambil keputusan sendiri, dan ia pun terjun ke dalam laut. Setelah Yunus terjun ke dalam laut, Allah memerintahkan seekor ikan hiu yang besar menelannya. Kepada ikan itu diwahyukan agar jangan memakan daging dan tulang Yunus, tetapi cukup menjadikan perutnya sebagai penjara bagi Yunus, karena Yunus bukan makanannya.\n\nNabi Yunus merasa menderita dan sengsara dalam perut ikan yang gelap itu. Ia bertobat, berdoa, dan menyerahkan dirinya kepada Allah, semoga Allah mengampuni dosa-dosanya dan menyelamatkannya, sebagaimana diterangkan pada firman Allah yang lain:\n\nDan (ingatlah kisah) dzun Nun (Yunus), ketika dia pergi dalam keadaan marah, lalu dia menyangka bahwa Kami tidak akan menyulitkannya, maka dia berdoa dalam keadaan yang sangat gelap, \"Tidak ada tuhan selain Engkau, Mahasuci Engkau. Sungguh, aku termasuk orang-orang yang zalim.\" Maka Kami kabulkan (doa)nya dan Kami selamatkan dia dari kedukaan. Dan demikianlah Kami menyelamatkan orang-orang yang beriman. (al-Anbiya'\/21: 87-88)",
      "text_translation": "Maka bersabarlah engkau (Muhammad) terhadap ketetapan Tuhanmu, dan janganlah engkau seperti (Yunus) orang yang berada dalam (perut) ikan ketika dia berdoa dengan hati sedih.",
      "text": "فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تَكُنْ كَصَاحِبِ الْحُوْتِۘ اِذْ نَادٰى وَهُوَ مَكْظُوْمٌۗ",
      "text_translation_en": "BEAR THEN with patience thy Sustainer's will and be not like him of the great fish, who cried out [in distress] after having given in to anger.",
      "juz_number": 29
    },
    "49": {
      "text_tafsir_en": "After a few days in the belly of the fish, Jonah was blessed by God by begging the fish to throw him ashore. So the fish threw Jonah into the land. It falls on barren land, with no water, no vegetation, and trees around it. His body was in a very weak condition and sick, because of the suffering he suffered while in the belly of the fish, and because of his sadness over the attitude of his people who challenged his preaching. To protect it from the scorching heat of the sun and the cold of night, God planted beside it a kind of pumpkin (yaqthin). Thus, the prophet Jonah was protected and could also eat his fruit as a weakening of his body, as God had said: Then We cast him into the barren land, while he was in pain. Then for him We planted a tree of some kind. (as-saffat \/ 37: 145-146) If God had not shown mercy to Jonah, he would have drowned in the sea, or been consumed in the belly of a fish, or starved and drowned in the barren field. However, Allah is the Most Merciful of His servants who will truly repent, just as Jonah did. Therefore, Allah bestows mercy on him.",
      "text_tafsir": "Setelah beberapa hari berada dalam perut ikan, Nabi Yunus dilimpahi rahmat oleh Allah dengan mewahyukan kepada ikan itu agar melontarkan Yunus ke daratan. Maka ikan itu pun melontarkan Yunus ke daratan. Ia jatuh di daratan yang tandus, sepi tidak ada air, tumbuh-tumbuhan, dan kayu-kayuan di sekitarnya. Badannya pun dalam keadaan sangat lemah dan sakit, karena penderitaan yang dialaminya selama berada dalam perut ikan, dan karena kesedihannya akibat sikap kaumnya yang menantang dakwahnya. Untuk melindunginya dari terik panas matahari dan kedinginan malam, Allah menumbuhkan di sampingnya semacam pohon labu (yaqthin). Dengan demikian, Nabi Yunus terlindungi dan juga dapat memakan buahnya sebagai penguat tubuhnya yang lemah, sebagaimana firman Allah:\n\nKemudian Kami lemparkan dia ke daratan yang tandus, sedang dia dalam keadaan sakit. Kemudian untuk dia Kami tumbuhkan sebatang pohon dari jenis labu. (as-saffat\/37: 145-146)\n\nSeandainya Allah tidak melimpahkan rahmat-Nya kepada Yunus, tentu ia akan tenggelam di lautan, atau hancur lumat di dalam perut ikan, atau mati kelaparan dan kekeringan di tengah-tengah padang yang tandus. Akan tetapi, Allah Maha Pengasih kepada hamba-hamba-Nya yang mau bertobat dengan sebenar-benarnya, seperti yang dilakukan Nabi Yunus. Oleh karena itu, Allah melimpahkan rahmat kepadanya.",
      "text_translation": "Sekiranya dia tidak segera mendapat nikmat dari Tuhannya, pastilah dia dicampakkan ke tanah tandus dalam keadaan tercela. ",
      "text": "لَوْلَآ اَنْ تَدَارَكَهٗ نِعْمَةٌ مِّنْ رَّبِّهٖ لَنُبِذَ بِالْعَرَاۤءِ وَهُوَ مَذْمُوْمٌ ",
      "text_translation_en": "[And remember:] had not grace from his Sustainer reached him, he would indeed have been cast forth upon that barren shore in a state of disgrace:",
      "juz_number": 29
    },
    "50": {
      "text_tafsir_en": "After Jonah's health was restored, so did his body, and God sent him back to his people at that time a hundred thousand more, according to the word of God: And We sent him to a hundred thousand or so, that they might believe, therefore We give them the enjoyment of life up to a certain time. (as saffat \/ 37: 147-148) The arrival of Jonah welcomed his people with gladness and expressed faith in him, so that they were among the virtuous. With the above verses, God warned the Prophet Muhammad not to act and act as Jonah did, who was easily irritated and despondent, leaving behind his people and the sacred task that was imposed upon him, the task of apostasy. The Prophet Muhammad was commanded to be steadfast and patient in all circumstances because Allah loves those who are patient.",
      "text_tafsir": "Setelah kesehatan Yunus pulih kembali, demikian pula kekuatan badannya, maka Allah mengutusnya kembali kepada kaumnya yang pada waktu itu berjumlah seratus ribu orang lebih, sebagaimana firman Allah:\n\nDan Kami utus dia kepada seratus ribu (orang) atau lebih, sehingga mereka beriman, karena itu Kami anugerahkan kenikmatan hidup kepada mereka hingga waktu tertentu. (as saffat\/37: 147-148)\n\nKedatangan Yunus disambut kaumnya dengan gembira dan menyatakan keimanan kepadanya, sehingga mereka termasuk orang-orang yang saleh.\n\nDengan ayat-ayat di atas, Allah memperingatkan Nabi Muhammad agar jangan sekali-kali bersikap dan bertindak seperti yang dilakukan Nabi Yunus yang mudah marah dan mudah berputus asa, sehingga ia meninggalkan kaumnya dan tugas suci yang telah dibebankan kepadanya, yaitu tugas kerasulan. Nabi Muhammad diperintahkan untuk selalu tabah dan sabar dalam keadaan bagaimana pun karena Allah menyukai orang-orang yang sabar.",
      "text_translation": "Lalu Tuhannya memilihnya dan menjadikannya termasuk orang yang saleh. ",
      "text": "فَاجْتَبٰىهُ رَبُّهٗ فَجَعَلَهٗ مِنَ الصّٰلِحِيْنَ ",
      "text_translation_en": "but [as it was,] his Sustainer had elected him and placed him among the righteous.",
      "juz_number": 29
    },
    "51": {
      "text_tafsir_en": "Allah told Prophet Muhammad that because the Muslims were very angry and hated him, they looked at the Prophet with his eyes with a look of anger and hatred. This is especially so whenever they hear the Qur'anic verses. According to some interpreters, referring to the \"people who almost blinded the Prophet with his own eyes\" was Bani Asad, one of the tribes in the Arab world at that time. It is said that the people of Bani Asad have some kind of knowledge that can influence others by using the sharpness of their eyes. So some of them intend to try that knowledge on Prophet Muhammad, for they think that if Muhammad was truly an apostle sent by Allah, he would not be influenced by their knowledge. The fact that such knowledge is not true of the Messenger of Allah. From the history above this verse it is understood that any kind of supernatural science will not be able to affect or influence a person if he believes in God, except in accordance with the teachings of Sunatullah, such as hurting one person by affecting his soul according to the arguments and stipulations of the psychic , mistreating someone with an electric current, and so on. Such knowledge can influence a person. Because the Muslims could not influence the Prophet with the knowledge they had, such as the sharpness of the eyes, and because they could not match the verses of the Qur'an, they said that he (Muhammad) was What a crazy person.",
      "text_tafsir": "Allah menyatakan kepada Nabi Muhammad saw bahwa karena orang-orang musyrik sangat marah dan benci kepada beliau, mereka memandang Nabi dari sudut matanya dengan pandangan yang penuh kemarahan dan kebencian. Hal ini terutama setiap kali mereka mendengar bacaan ayat-ayat Al-Qur'an.\n\nMenurut sebagian ahli tafsir, yang dimaksudkan dengan \"orang-orang yang hampir-hampir menggelincirkan Nabi dengan pandangan matanya\" ialah Bani Asad, salah satu kabilah di negeri Arab waktu itu. Diriwayatkan bahwa orang-orang dari Bani Asad mempunyai semacam ilmu yang dapat mempengaruhi orang lain dengan menggunakan ketajaman sorotan matanya. Maka sebahagian mereka bermaksud mencobakan ilmunya itu kepada Nabi Muhammad, karena menurut mereka seandainya Muhammad itu benar-benar seorang rasul yang diutus Allah, tentu ia tidak akan terpengaruh oleh ilmu mereka itu. Kenyataannya bahwa ilmu itu memang tidak mempan terhadap Rasulullah saw.\n\nDari riwayat di atas ayat ini dipahami bahwa segala macam ilmu gaib apa pun tidak akan dapat mengenai atau mempengaruhi seseorang jika ia beriman kepada Allah, kecuali ilmu-ilmu yang sesuai dengan sunatullah, seperti menyakiti seseorang dengan cara mempengaruhi jiwanya sesuai dengan dalil dan ketetapan ilmu jiwa, menganiaya seseorang dengan aliran listrik, dan sebagainya. Ilmu-ilmu yang demikian itu dapat mempengaruhi seseorang.\n\nKarena orang-orang musyrik itu tidak dapat mempengaruhi Rasulullah dengan ilmu-ilmu yang ada pada mereka, seperti sorotan ketajaman mata, dan karena tidak dapat menandingi ayat-ayat Al-Qur'an, maka mereka mengatakan bahwa sesungguhnya ia (Muhammad) itu benar-benar orang yang gila.",
      "text_translation": "Dan sungguh, orang-orang kafir itu hampir-hampir menggelincirkanmu dengan pandangan mata mereka, ketika mereka mendengar Al-Qur'an dan mereka berkata, “Dia (Muhammad) itu benar-benar orang gila.”",
      "text": "وَاِنْ يَّكَادُ الَّذِيْنَ كَفَرُوْا لَيُزْلِقُوْنَكَ بِاَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُوْلُوْنَ اِنَّهٗ لَمَجْنُوْنٌ ۘ",
      "text_translation_en": "Hence, [be patient,] even though they who are bent on denying the truth would all but kill thee with their eyes whenever they hear this reminder, and [though] they say, \"[As for Muhammad,] behold, most surely he is a madman!\"",
      "juz_number": 29
    },
    "52": {
      "text_tafsir_en": "In this verse, God states that the Qur'an contains instructions and lessons for the happiness of human life in this world and the hereafter. It is intended for all people wherever they may be, for the people of the advanced states or for the people of the developing or the backward, both for the wise and for the foolish, both for the city and for the people, for both rich and poor, and so on. Therefore, each person can learn to understand and study the Qur'an, as long as he has the attitude to accept every truth conveyed to him. If one does not have such an attitude, even though his heart and mind have accepted the truth of the Qur'an, his conscience has ordered him to defy the Qur'an and to say that it is man-made or any other accusation. How many people continue to fight for truth and justice for following their passions, such as their desire for prominence, position, wealth, fear of being marginalized by their peers, fear of abandoning their ancestors, and so on. How many people are willing to kill friends, siblings, even their father and mother for following their passions. Muhammad was a prophet and apostle of Allah who had proven his honesty, a man who was respected and trusted by his people, justly minded, no one would deny it. After he was ordained by God as a prophet and an apostle, the hatred, because following Muhammad saw, left him with rank, wealth, pleasure, and authority.",
      "text_tafsir": "Dalam ayat ini, Allah mengatakan dengan tegas bahwa Al-Qur'an itu berisi petunjuk dan pelajaran untuk kebahagiaan hidup manusia di dunia dan akhirat. Ia diperuntukkan bagi seluruh manusia di mana pun mereka berada, baik bagi penduduk negeri-negeri yang telah maju ataupun bagi penduduk negeri yang sedang berkembang atau terbelakang, baik untuk orang yang pintar maupun untuk orang yang bodoh, baik penduduk kota maupun penduduk desa, baik bagi orang yang kaya maupun bagi orang-orang yang miskin, dan sebagainya. Oleh karena itu, setiap orang dapat belajar memahami dan mempelajari Al-Qur'an, asal ia mempunyai sikap akan menerima setiap kebenaran yang disampaikan kepadanya. Jika seseorang belum mempunyai sikap yang demikian, walaupun hati dan pikirannya telah menerima kebenaran Al-Qur'an, namun hawa nafsunya memerintahkan agar ia menentang Al-Qur'an itu dan mengatakannya sebagai buatan manusia atau tuduhan lainnya.\n\nBerapa banyak orang yang terus-menerus melawan kebenaran dan keadilan karena memperturutkan hawa nafsunya, seperti hawa nafsu ingin pangkat, kedudukan, harta yang banyak, takut dipencilkan oleh golongannya, takut meninggalkan kepercayaan nenek moyangnya, dan sebagainya. Betapa banyak orang yang bersedia membunuh teman, saudara kandung, bahkan ayah dan ibunya karena mengiuti hawa nafsunya.\n\nMuhammad saw adalah seorang nabi dan rasul Allah yang telah terbukti kejujurannya, seorang yang dihormati dan dipercayai oleh kaumnya, adil sempurna akal pikirannya, tidak seorang pun yang mengingkarinya. Setelah beliau diangkat Allah sebagai nabi dan rasul, timbullah rasa benci itu, karena mengikuti Muhammad saw berarti meninggalkan pangkat, harta, kesenangan, dan kesewenang-wenangan.",
      "text_translation": "Padahal (Al-Qur'an) itu tidak lain adalah peringatan bagi seluruh alam.",
      "text": "وَمَا هُوَ اِلَّا ذِكْرٌ لِّلْعٰلَمِيْنَ ࣖ ",
      "text_translation_en": "[Be patient:] for this is nought else but a reminder [from God] to all mankind.",
      "juz_number": 29
    }
  },
  "name": "القلم",
  "name_translation_en": "The Pen",
  "name_translation": "Pena",
  "name_latin": "Al-Qalam"
}