{
  "number": 69,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 52,
  "ayat": {
    "1": {
      "text_tafsir_en": "Al-haqqah by language means that it must happen. The Day of Judgment is called al-haqqah because it must happen. The nature and nature of it cannot be explained and explained by man, for the knowledge of the Resurrection includes supernatural knowledge. What people know about the Day of Judgment is limited to what the Qur'an says. In another verse, Allah says: They ask you about the Resurrection, \"When did this happen?\" Say, \"Verily the knowledge of the Resurrection is upon my Lord; there is no one who can explain the time of his existence other than He. except suddenly. \" They ask you as if you knew it. Say (Muhammad), \"Verily the knowledge of (the Day of Resurrection) is in Allah, but most men do not know.\" (al-A'raf \/ 7: 187) The Day of Judgment, like some other supernatural things, is known only to God. His Word: Verily the knowledge of the Day of Resurrection is only with Allah; and it is He Who sends down rain, and knows what is in the womb. And no one can know for sure what he will do tomorrow. And no one can know on earth where he will die. Indeed, Allah is All-Knowing, All-Knowing. (Luqman \/ 31: 34) What can be a source of knowledge to know the Day of Judgment? From this question it is understood that there are some things that can inform humanity of the process of events on the Day of Judgment, because the knowledge of Doomsday is knowledge that can be achieved by the beings with the help of various kinds of knowledge. Indeed, the events of the Day of Judgment are unthinkable. The events and events are better than anyone ever imagined. Due to the fact that the Day of Resurrection cannot be known to the creatures, the Muslims cannot ignore it. If they deny it, then they are denying something they cannot know or achieve.",
      "text_tafsir": "Al-haqqah menurut bahasa berarti yang pasti terjadi. Hari Kiamat dinamai al-haqqah karena hari itu pasti terjadi. Tentang keadaan dan sifatnya tidak dapat dijelaskan dan diterangkan oleh manusia, karena pengetahuan tentang hari Kiamat termasuk pengetahuan yang gaib. Apa yang diketahui manusia tentang hari Kiamat terbatas pada yang disampaikan Al-Qur'an. Dalam ayat yang lain, Allah berfirman:\n\nMereka menanyakan kepadamu (Muhammad) tentang Kiamat, \"Kapan terjadi?\" Katakanlah, \"Sesungguhnya pengetahuan tentang Kiamat itu ada pada Tuhanku; tidak ada (seorang pun) yang dapat menjelaskan waktu terjadinya selain Dia. (Kiamat) itu sangat berat (huru-haranya bagi makhluk) yang di langit dan di bumi, tidak akan datang kepadamu kecuali secara tiba-tiba.\" Mereka bertanya kepadamu seakan-akan engkau mengetahuinya. Katakanlah (Muhammad), \"Sesungguhnya pengetahuan tentang (hari Kiamat) ada pada Allah, tetapi kebanyakan manusia tidak mengetahui.\" (al-A'raf\/7: 187)\n\nHari Kiamat, sebagaimana beberapa perkara gaib lainnya, hanya diketahui Allah. Firman-Nya:\n\nSesungguhnya hanya di sisi Allah ilmu tentang hari Kiamat; dan Dia yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. Dan tidak ada seorang pun yang dapat mengetahui (dengan pasti) apa yang akan dikerjakannya besok. Dan tidak ada seorang pun yang dapat mengetahui di bumi mana dia akan mati. Sungguh, Allah Maha Mengetahui, Maha Mengenal. (Luqman\/31: 34)\n\nApa yang dapat dijadikan sumber pengetahuan untuk mengetahui terjadinya hari Kiamat itu? Dari pertanyaan ini dipahami bahwa ada beberapa hal yang dapat memberikan keterangan kepada manusia tentang proses kejadian yang terjadi pada hari Kiamat, karena pengetahuan tentang hari Kiamat itu adalah pengetahuan yang dapat dicapai oleh makhluk dengan bantuan berbagai macam pengetahuan. Memang kejadian hari Kiamat tidak dapat dikira-kirakan. Kejadian dan peristiwanya lebih hebat dari yang pernah digambarkan oleh siapa pun. Karena hakikat hari Kiamat tidak dapat diketahui makhluk, orang-orang musyrik tidak dapat mengingkarinya. Jika mereka mengingkarinya, berarti mereka mengingkari sesuatu yang tidak dapat diketahui atau dicapai oleh pikiran mereka.",
      "text_translation": "Hari Kiamat,",
      "text": "اَلْحَاۤقَّةُۙ",
      "text_translation_en": "OH, THE LAYING-BARE of the truth!",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "Al-haqqah by language means that it must happen. The Day of Judgment is called al-haqqah because it must happen. The nature and nature of it cannot be explained and explained by man, for the knowledge of the Resurrection includes supernatural knowledge. What people know about the Day of Judgment is limited to what the Qur'an says. In another verse, Allah says: They ask you about the Resurrection, \"When did this happen?\" Say, \"Verily the knowledge of the Resurrection is upon my Lord; there is no one who can explain the time of his existence other than He. except suddenly. \" They ask you as if you knew it. Say (Muhammad), \"Verily the knowledge of (the Day of Resurrection) is in Allah, but most men do not know.\" (al-A'raf \/ 7: 187) The Day of Judgment, like some other supernatural things, is known only to God. His Word: Verily the knowledge of the Day of Resurrection is only with Allah; and it is He Who sends down rain, and knows what is in the womb. And no one can know for sure what he will do tomorrow. And no one can know on earth where he will die. Indeed, Allah is All-Knowing, All-Knowing. (Luqman \/ 31: 34) What can be a source of knowledge to know the Day of Judgment? From this question it is understood that there are some things that can inform humanity of the process of events on the Day of Judgment, because the knowledge of Doomsday is knowledge that can be achieved by the beings with the help of various kinds of knowledge. Indeed, the events of the Day of Judgment are unthinkable. The events and events are better than anyone ever imagined. Due to the fact that the Day of Resurrection cannot be known to the creatures, the Muslims cannot ignore it. If they deny it, then they are denying something they cannot know or achieve.",
      "text_tafsir": "Al-haqqah menurut bahasa berarti yang pasti terjadi. Hari Kiamat dinamai al-haqqah karena hari itu pasti terjadi. Tentang keadaan dan sifatnya tidak dapat dijelaskan dan diterangkan oleh manusia, karena pengetahuan tentang hari Kiamat termasuk pengetahuan yang gaib. Apa yang diketahui manusia tentang hari Kiamat terbatas pada yang disampaikan Al-Qur'an. Dalam ayat yang lain, Allah berfirman:\n\nMereka menanyakan kepadamu (Muhammad) tentang Kiamat, \"Kapan terjadi?\" Katakanlah, \"Sesungguhnya pengetahuan tentang Kiamat itu ada pada Tuhanku; tidak ada (seorang pun) yang dapat menjelaskan waktu terjadinya selain Dia. (Kiamat) itu sangat berat (huru-haranya bagi makhluk) yang di langit dan di bumi, tidak akan datang kepadamu kecuali secara tiba-tiba.\" Mereka bertanya kepadamu seakan-akan engkau mengetahuinya. Katakanlah (Muhammad), \"Sesungguhnya pengetahuan tentang (hari Kiamat) ada pada Allah, tetapi kebanyakan manusia tidak mengetahui.\" (al-A'raf\/7: 187)\n\nHari Kiamat, sebagaimana beberapa perkara gaib lainnya, hanya diketahui Allah. Firman-Nya:\n\nSesungguhnya hanya di sisi Allah ilmu tentang hari Kiamat; dan Dia yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. Dan tidak ada seorang pun yang dapat mengetahui (dengan pasti) apa yang akan dikerjakannya besok. Dan tidak ada seorang pun yang dapat mengetahui di bumi mana dia akan mati. Sungguh, Allah Maha Mengetahui, Maha Mengenal. (Luqman\/31: 34)\n\nApa yang dapat dijadikan sumber pengetahuan untuk mengetahui terjadinya hari Kiamat itu? Dari pertanyaan ini dipahami bahwa ada beberapa hal yang dapat memberikan keterangan kepada manusia tentang proses kejadian yang terjadi pada hari Kiamat, karena pengetahuan tentang hari Kiamat itu adalah pengetahuan yang dapat dicapai oleh makhluk dengan bantuan berbagai macam pengetahuan. Memang kejadian hari Kiamat tidak dapat dikira-kirakan. Kejadian dan peristiwanya lebih hebat dari yang pernah digambarkan oleh siapa pun. Karena hakikat hari Kiamat tidak dapat diketahui makhluk, orang-orang musyrik tidak dapat mengingkarinya. Jika mereka mengingkarinya, berarti mereka mengingkari sesuatu yang tidak dapat diketahui atau dicapai oleh pikiran mereka.",
      "text_translation": "apakah hari Kiamat itu?",
      "text": "مَا الْحَاۤقَّةُ ۚ ",
      "text_translation_en": "How awesome that laying-bare of the truth!",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "Al-haqqah by language means that it must happen. The Day of Judgment is called al-haqqah because it must happen. The nature and nature of it cannot be explained and explained by man, for the knowledge of the Resurrection includes supernatural knowledge. What people know about the Day of Judgment is limited to what the Qur'an says. In another verse, Allah says: They ask you about the Resurrection, \"When did this happen?\" Say, \"Verily the knowledge of the Resurrection is upon my Lord; there is no one who can explain the time of his existence other than He. except suddenly. \" They ask you as if you knew it. Say (Muhammad), \"Verily the knowledge of (the Day of Resurrection) is in Allah, but most men do not know.\" (al-A'raf \/ 7: 187) The Day of Judgment, like some other supernatural things, is known only to God. His Word: Verily the knowledge of the Day of Resurrection is only with Allah; and it is He Who sends down rain, and knows what is in the womb. And no one can know for sure what he will do tomorrow. And no one can know on earth where he will die. Indeed, Allah is All-Knowing, All-Knowing. (Luqman \/ 31: 34) What can be a source of knowledge to know the Day of Judgment? From this question it is understood that there are some things that can inform humanity of the process of events on the Day of Judgment, because the knowledge of Doomsday is knowledge that can be achieved by the beings with the help of various kinds of knowledge. Indeed, the events of the Day of Judgment are unthinkable. The events and events are better than anyone ever imagined. Due to the fact that the Day of Resurrection cannot be known to the creatures, the Muslims cannot ignore it. If they deny it, then they are denying something they cannot know or achieve.",
      "text_tafsir": "Al-haqqah menurut bahasa berarti yang pasti terjadi. Hari Kiamat dinamai al-haqqah karena hari itu pasti terjadi. Tentang keadaan dan sifatnya tidak dapat dijelaskan dan diterangkan oleh manusia, karena pengetahuan tentang hari Kiamat termasuk pengetahuan yang gaib. Apa yang diketahui manusia tentang hari Kiamat terbatas pada yang disampaikan Al-Qur'an. Dalam ayat yang lain, Allah berfirman:\n\nMereka menanyakan kepadamu (Muhammad) tentang Kiamat, \"Kapan terjadi?\" Katakanlah, \"Sesungguhnya pengetahuan tentang Kiamat itu ada pada Tuhanku; tidak ada (seorang pun) yang dapat menjelaskan waktu terjadinya selain Dia. (Kiamat) itu sangat berat (huru-haranya bagi makhluk) yang di langit dan di bumi, tidak akan datang kepadamu kecuali secara tiba-tiba.\" Mereka bertanya kepadamu seakan-akan engkau mengetahuinya. Katakanlah (Muhammad), \"Sesungguhnya pengetahuan tentang (hari Kiamat) ada pada Allah, tetapi kebanyakan manusia tidak mengetahui.\" (al-A'raf\/7: 187)\n\nHari Kiamat, sebagaimana beberapa perkara gaib lainnya, hanya diketahui Allah. Firman-Nya:\n\nSesungguhnya hanya di sisi Allah ilmu tentang hari Kiamat; dan Dia yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. Dan tidak ada seorang pun yang dapat mengetahui (dengan pasti) apa yang akan dikerjakannya besok. Dan tidak ada seorang pun yang dapat mengetahui di bumi mana dia akan mati. Sungguh, Allah Maha Mengetahui, Maha Mengenal. (Luqman\/31: 34)\n\nApa yang dapat dijadikan sumber pengetahuan untuk mengetahui terjadinya hari Kiamat itu? Dari pertanyaan ini dipahami bahwa ada beberapa hal yang dapat memberikan keterangan kepada manusia tentang proses kejadian yang terjadi pada hari Kiamat, karena pengetahuan tentang hari Kiamat itu adalah pengetahuan yang dapat dicapai oleh makhluk dengan bantuan berbagai macam pengetahuan. Memang kejadian hari Kiamat tidak dapat dikira-kirakan. Kejadian dan peristiwanya lebih hebat dari yang pernah digambarkan oleh siapa pun. Karena hakikat hari Kiamat tidak dapat diketahui makhluk, orang-orang musyrik tidak dapat mengingkarinya. Jika mereka mengingkarinya, berarti mereka mengingkari sesuatu yang tidak dapat diketahui atau dicapai oleh pikiran mereka.",
      "text_translation": "Dan tahukah kamu apakah hari Kiamat itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا الْحَاۤقَّةُ ۗ ",
      "text_translation_en": "And what could make thee conceive what that laying-bare of the truth will be?",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "In this verse, it is explained that the Samudites and the 'Ad people did not believe in Judgment Day. They do not believe that there will be world destruction and terrible events that are beyond our control. It is also said of Allah: (The people) had rejected (their Messenger) because they had transgressed, when the worst of them rose, and the Messenger of Allah (Saleh) said to them, \"Let the camels of God is with the drink. \" But they rejected it and slaughtered it, so God destroyed them for their sin, and He made them (on the ground). (as-Shams \/ 91: 11-14)",
      "text_tafsir": "Dalam ayat ini, diterangkan bahwa kaum Samud dan kaum 'Ad tidak mempercayai adanya hari Kiamat. Mereka tidak percaya bahwa nanti akan terjadi kehancuran dunia dan peristiwa dahsyat yang huru-haranya tidak tertanggungkan. Hal ini juga difirmankan Allah:\n\n(Kaum) Samud telah mendustakan (rasulnya) karena mereka melampaui batas (zalim), ketika bangkit orang yang paling celaka di antara mereka, lalu Rasul Allah (Saleh) berkata kepada mereka, \"(Biarkanlah) unta betina dari Allah ini dengan minumannya.\" Namun mereka mendustakannya dan menyembelihnya, karena itu Tuhan membinasakan mereka karena dosanya, lalu diratakan-Nya (dengan tanah). (as-Syams\/91: 11-14)",
      "text_translation": "Kaum Samud, dan ‘Ad telah mendustakan hari Kiamat.",
      "text": "كَذَّبَتْ ثَمُوْدُ وَعَادٌ ۢبِالْقَارِعَةِ ",
      "text_translation_en": "THE LIE gave [the tribes of] Thamud and ‘Ad to [all tidings of] that sudden calamity!",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "The Samaritans were destroyed by God with thagiyah, the sound of lightning that flashed from the sky that destroyed everything on the surface of the earth. It's called thagiyah (something extraordinary) because it sounds amazing; unlike the sound of lightning that has ever happened. They were punished by God for acting beyond the limits prescribed by Prophet Saleh. They killed the female camel that Prophet Saleh had ordered to take good care of. In other words of Allah it is explained that the Samudites were destroyed by sa'iqah (lightning). And as for the Samaritans, We have given them guidance but they prefer blindness (error) than that, so they are struck by lightning as a humiliating punishment for what they have done. (Fussilat 41: 17)",
      "text_tafsir": "Kaum Samud telah dihancurkan Allah dengan thagiyah yaitu suara petir yang mengguntur dari langit yang membinasakan semua yang ada di permukaan bumi. Disebut thagiyah (sesuatu yang luar biasa) karena memang suara itu luar biasa; tidak seperti suara petir yang pernah terjadi. Mereka diazab oleh Tuhan karena telah bertindak melampaui batas yang telah ditetapkan Nabi Saleh terhadap mereka. Mereka membunuh unta betina yang diperintahkan Nabi Saleh untuk dijaga dengan baik.\n\nPada firman Allah yang lain diterangkan bahwa kaum Samud dibinasakan dengan sa'iqah (petir).\n\nDan adapun kaum Samud, mereka telah Kami beri petunjuk tetapi mereka lebih menyukai kebutaan (kesesatan) daripada petunjuk itu, maka mereka disambar petir sebagai azab yang menghinakan disebabkan apa yang telah mereka kerjakan. (Fussilat\/41: 17)",
      "text_translation": "Maka adapun kaum Samud, mereka telah dibinasakan dengan suara yang sangat keras,",
      "text": "فَاَمَّا ثَمُوْدُ فَاُهْلِكُوْا بِالطَّاغِيَةِ ",
      "text_translation_en": "Now as for the Thamud - they were destroyed by a violent upheaval [of the earth];",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "As for the people of 'Ad destroyed by the fierce winds (sarsar' atiyah). In another verse, God says: Then We will blow upon them a very strong wind in a few days, for We want them to experience the humiliating torment of life in the world. While the doom of the Hereafter must have been more humiliating and they were not helped. (Fussilat 41: 16)",
      "text_tafsir": "Adapun kaum 'Ad dibinasakan Allah dengan angin dingin yang sangat kencang (sarsar 'atiyah). Dalam ayat lain, Allah berfirman:\n\nMaka Kami tiupkan angin yang sangat bergemuruh kepada mereka dalam beberapa hari yang nahas, karena Kami ingin agar mereka itu merasakan siksaan yang menghinakan dalam kehidupan di dunia. Sedangkan azab akhirat pasti lebih menghinakan dan mereka tidak diberi pertolongan. (Fussilat\/41: 16)",
      "text_translation": "sedangkan kaum ‘Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin,",
      "text": "وَاَمَّا عَادٌ فَاُهْلِكُوْا بِرِيْحٍ صَرْصَرٍ عَاتِيَةٍۙ",
      "text_translation_en": "and as for the ‘Ad - they were destroyed by a storm wind furiously raging,",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "The fierce cold wind blew in their land unceasingly for seven nights and eight days, destroying homes, palaces, possessions, livestock, plants, and everything in their land. 'Ad or nation' Ad is a semitic racial nation, which lived around 5000-4000 years ago. These people live in the South Arabia region, in an area of the hills of al-Ahqaf (see Surah al-Ahqaf \/ 46: 21), or what is now known as Rab al-Khali, which stretches from southern Yemen to Oman . The majority of 'Ad has rejected the apostleship and mission of the Prophet Hud. They received punishment from God in the form of a very fierce, fierce wind that lasted continuously for seven nights and eight days. Paleogeological scientific data about the event have not been obtained. But maybe we can compare it with what happened in the United States, precisely in the State of New Orleans, when the region was hit by Hurricane Katrina (Katrina Hurricane) on August 23-31, 2005 ago. Katrina Hurricane has a storm speed of 280 km \/ h, a (minimum) pressure of 902 mbar (hPa: 26.65 inHg); the temperature of the storm is quite warm, around 28.4 oC, lasting for approximately 8 (eight) days, continuously. The area of impact includes the Bahamas, South Florida, Cuba, Louisiana (mainly Greater New Orleans), Mississippi, Alabama, the Florida Panhandle, and most of the east coast of North America. Katrina Hurricane's radius is about 160 km from the storm's central point. Human victims died 1,836 people. Property losses amounting to US $ 84 billion. Katrina Hurricane is listed as the sixth strongest type of Atlantic Storm in American history, or the third strongest, which occurred in the landfall season (fall) in the United States. As a comparison, the Galveston Hurricane that occurred in 1900 in the United States claimed the lives of between 6000-12,000 people. Thus, a very fierce cold wind or storm, which befell the 'Ad for seven nights and eight days continuously, may be similar or far greater than this Katrina Hurricane; because the temperature is very cold and able to destroy a people (people). The words \"seven nights and eight days\" gave a warning that the strong winds of the world were truly a punishment for them, and afflicted all that was in the land.",
      "text_tafsir": "Angin dingin yang sangat kencang itu bertiup di negeri mereka tidak henti-hentinya selama tujuh malam delapan hari, memusnahkan rumah-rumah, istana-istana, harta-benda, binatang ternak, tanaman-tanaman, dan semua yang ada di negeri mereka.\n\nKaum 'Ad atau bangsa 'Ad merupakan bangsa ras semitik, yang hidup sekitar 5000-4000 tahun yang lalu. Kaum ini hidup di wilayah Arabia Selatan, di suatu kawasan bukit-bukit al-Ahqaf (lihat Surah al-Ahqaf\/46: 21), atau yang sekarang dikenal dengan nama Rab al-Khali, yang membentang antara Yaman bagian selatan sampai ke wilayah Oman. Mayoritas kaum 'Ad telah menolak kerasulan dan misi Nabi Hud. Mereka mendapat azab dari Allah berupa angin yang sangat dingin lagi kencang yang berlangsung terus menerus selama tujuh malam delapan hari. Data ilmiah paleogeologik tentang peristiwa itu belum didapatkan. Namun mungkin kita dapat membandingkannya dengan apa yang terjadi di Amerika Serikat, tepatnya di Negara bagian New Orleans, ketika wilayah itu diterjang oleh Badai Katrina (Katrina Hurricane) pada tanggal 23-31 Agustus 2005 yang lalu. Katrina Hurricane ini mempunyai kecepatan badai 280 km\/jam, tekanan (minimal) 902 mbar (hPa: 26.65 inHg); suhu badai cukup hangat, sekitar 28,4 oC, berlangsung selama lebih kurang 8 (delapan) hari, terus menerus. Wilayah hantamannya meliputi Bahamas, Florida Selatan, Kuba, Louisiana (utamanya Greater New Orleans), Mississippi, Alabama, Florida Panhandle, dan sebagian besar pantai timur Amerika Utara. Radius Katrina Hurricane ini sekitar 160 km dari titik sentral badai itu. Korban manusia meninggal 1.836 jiwa. Korban harta sebesar US$ 84 Miliar. Katrina Hurricane ini tercatat sebagai jenis Badai Atlantik yang terkuat ke-enam dalam sejarah Amerika, atau terkuat ketiga, yang terjadi pada musim landfall (musim gugur) di Amerika Serikat. Sebagai perbandingan Galveston Hurricane yang terjadi pada tahun 1900 di Amerika Serikat menelan korban jiwa antara 6000-12.000 orang. Dengan demikian, angin atau badai yang sangat dingin lagi kencang, yang menimpa kaum 'Ad selama tujuh malam delapan hari terus menerus, mungkin mirip atau jauh lebih hebat dari Katrina Hurricane ini; karena suhunya sangat dingin dan mampu menghancurkan suatu kaum (umat).\n\nPerkataan \"tujuh malam delapan hari\" memberi peringatan bahwa angin kencang dunia itu benar-benar merupakan azab bagi mereka, dan menimpa seluruh yang ada di negeri itu.",
      "text_translation": "Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum ‘Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk).",
      "text": "سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَّثَمٰنِيَةَ اَيَّامٍۙ حُسُوْمًا فَتَرَى الْقَوْمَ فِيْهَا صَرْعٰىۙ  كَاَنَّهُمْ اَعْجَازُ نَخْلٍ خَاوِيَةٍۚ",
      "text_translation_en": "which He willed against them for seven nights and eight days without cease, so that in the end thou couldst see those people laid low [in death], as though they were so many [uprooted] trunks of hollow palm trees:",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "The fierce cold wind blew in their land unceasingly for seven nights and eight days, destroying homes, palaces, possessions, livestock, plants, and everything in their land. 'Ad or nation' Ad is a semitic racial nation, which lived around 5000-4000 years ago. These people live in the South Arabia region, in an area of the hills of al-Ahqaf (see Surah al-Ahqaf \/ 46: 21), or what is now known as Rab al-Khali, which stretches from southern Yemen to Oman . The majority of 'Ad has rejected the apostleship and mission of the Prophet Hud. They received punishment from God in the form of a very fierce, fierce wind that lasted continuously for seven nights and eight days. Paleogeological scientific data about the event have not been obtained. But maybe we can compare it with what happened in the United States, precisely in the State of New Orleans, when the region was hit by Hurricane Katrina (Katrina Hurricane) on August 23-31, 2005 ago. Katrina Hurricane has a storm speed of 280 km \/ h, a (minimum) pressure of 902 mbar (hPa: 26.65 inHg); the temperature of the storm is quite warm, around 28.4 oC, lasting for approximately 8 (eight) days, continuously. The area of impact includes the Bahamas, South Florida, Cuba, Louisiana (mainly Greater New Orleans), Mississippi, Alabama, the Florida Panhandle, and most of the east coast of North America. Katrina Hurricane's radius is about 160 km from the storm's central point. Human victims died 1,836 people. Property losses amounting to US $ 84 billion. Katrina Hurricane is listed as the sixth strongest type of Atlantic Storm in American history, or the third strongest, which occurred in the landfall season (fall) in the United States. As a comparison, the Galveston Hurricane that occurred in 1900 in the United States claimed the lives of between 6000-12,000 people. Thus, a very fierce cold wind or storm, which befell the 'Ad for seven nights and eight days continuously, may be similar or far greater than this Katrina Hurricane; because the temperature is very cold and able to destroy a people (people). The words \"seven nights and eight days\" gave a warning that the strong winds of the world were truly a punishment for them, and afflicted all that was in the land.",
      "text_tafsir": "Angin dingin yang sangat kencang itu bertiup di negeri mereka tidak henti-hentinya selama tujuh malam delapan hari, memusnahkan rumah-rumah, istana-istana, harta-benda, binatang ternak, tanaman-tanaman, dan semua yang ada di negeri mereka.\n\nKaum 'Ad atau bangsa 'Ad merupakan bangsa ras semitik, yang hidup sekitar 5000-4000 tahun yang lalu. Kaum ini hidup di wilayah Arabia Selatan, di suatu kawasan bukit-bukit al-Ahqaf (lihat Surah al-Ahqaf\/46: 21), atau yang sekarang dikenal dengan nama Rab al-Khali, yang membentang antara Yaman bagian selatan sampai ke wilayah Oman. Mayoritas kaum 'Ad telah menolak kerasulan dan misi Nabi Hud. Mereka mendapat azab dari Allah berupa angin yang sangat dingin lagi kencang yang berlangsung terus menerus selama tujuh malam delapan hari. Data ilmiah paleogeologik tentang peristiwa itu belum didapatkan. Namun mungkin kita dapat membandingkannya dengan apa yang terjadi di Amerika Serikat, tepatnya di Negara bagian New Orleans, ketika wilayah itu diterjang oleh Badai Katrina (Katrina Hurricane) pada tanggal 23-31 Agustus 2005 yang lalu. Katrina Hurricane ini mempunyai kecepatan badai 280 km\/jam, tekanan (minimal) 902 mbar (hPa: 26.65 inHg); suhu badai cukup hangat, sekitar 28,4 oC, berlangsung selama lebih kurang 8 (delapan) hari, terus menerus. Wilayah hantamannya meliputi Bahamas, Florida Selatan, Kuba, Louisiana (utamanya Greater New Orleans), Mississippi, Alabama, Florida Panhandle, dan sebagian besar pantai timur Amerika Utara. Radius Katrina Hurricane ini sekitar 160 km dari titik sentral badai itu. Korban manusia meninggal 1.836 jiwa. Korban harta sebesar US$ 84 Miliar. Katrina Hurricane ini tercatat sebagai jenis Badai Atlantik yang terkuat ke-enam dalam sejarah Amerika, atau terkuat ketiga, yang terjadi pada musim landfall (musim gugur) di Amerika Serikat. Sebagai perbandingan Galveston Hurricane yang terjadi pada tahun 1900 di Amerika Serikat menelan korban jiwa antara 6000-12.000 orang. Dengan demikian, angin atau badai yang sangat dingin lagi kencang, yang menimpa kaum 'Ad selama tujuh malam delapan hari terus menerus, mungkin mirip atau jauh lebih hebat dari Katrina Hurricane ini; karena suhunya sangat dingin dan mampu menghancurkan suatu kaum (umat).\n\nPerkataan \"tujuh malam delapan hari\" memberi peringatan bahwa angin kencang dunia itu benar-benar merupakan azab bagi mereka, dan menimpa seluruh yang ada di negeri itu.",
      "text_translation": "Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka?",
      "text": "فَهَلْ تَرٰى لَهُمْ مِّنْۢ بَاقِيَةٍ ",
      "text_translation_en": "and dost thou now see any remnant of them?",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "In these verses, it is explained that Pharaoh and Lot and his followers also did great harm in denying the apostles whom God had sent to them. Therefore, they are punished by God. In another verse, Allah says: They have denied the apostles, and My threat (against them) is fulfilled. (Qaf \/ 50: 14)",
      "text_tafsir": "Dalam ayat-ayat ini, diterangkan bahwa Fir'aun dan kaum Lut beserta pengikut-pengikutnya juga telah berbuat kerusakan yang besar yaitu mendustakan para rasul yang diutus Allah kepada mereka. Oleh karena itu, mereka diazab oleh Tuhan. Dalam ayat lain, Allah berfirman:\n\nSemuanya telah mendustakan rasul-rasul maka berlakulah ancaman-Ku (atas mereka). (Qaf\/50: 14)",
      "text_translation": "Kemudian datang Fir‘aun dan orang-orang yang sebelumnya dan (penduduk) negeri-negeri yang dijungkirbalikkan karena kesalahan yang besar.",
      "text": "وَجَاۤءَ فِرْعَوْنُ وَمَنْ قَبْلَهٗ وَالْمُؤْتَفِكٰتُ بِالْخَاطِئَةِۚ",
      "text_translation_en": "And there was Pharaoh, too, and [many of] those who lived before him, and the cities that were overthrown - [all of them] indulged in sin upon sin",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "In this verse Allah instructs the Muslims to do good deeds by saying, \"O you who believe in Allah and His Messenger, do you want me to show you a profitable business and will surely bring double profits and eternal fortune or deliver you from the fire of hell. \" The phrase above gives the meaning of good deeds of great merit, just as much as a business that never loses because it will enter heaven and be saved from the fire of hell. The Word of God: Verily Allah bought from the believers, both their own and their wealth by giving them a paradise. (at-Taubah \/ 9: 111) Then the following forms of trade are mentioned, which are: 1.While you believe in God, the angels, his books, his apostles, the Day of Resurrection, qadha 'and the qadar of Allah. 2. Doing good deeds solely for God is not because ria is an embodiment of one's faith. 3. Work in the way of Allah. Jihad is all the efforts and efforts made to uphold the religion of Allah. There are two types of jihad mentioned in this verse namely jihad with the soul and jihad with the treasure. Fighting with souls and bodies is a war against religious enemies who want to destroy Islam and Muslims. Jihad with property means spending property to uphold the word of God, such as for war costs, building mosques, houses of worship, schools, hospitals, and other public interests. In addition, there are other forms of jihad, such as jihad against lust, self-control, striving to develop good morals in oneself, eliminating envy, and so on. At the end of this verse it is asserted that faith and jihad are the best acts of consequence, for oneself, children, families, possessions, and society, if the person truly understands.",
      "text_tafsir": "Dalam ayat ini Allah memerintahkan kaum Muslimin agar melakukan amal saleh dengan mengatakan, \"Wahai orang-orang yang beriman kepada Allah dan rasul -Nya, apakah kamu sekalian mau Aku tunjukkan suatu perniagaan yang bermanfaat dan pasti mendatangkan keuntungan yang berlipat ganda dan keberuntungan yang kekal atau melepaskan kamu dari api neraka.\"\n\nUngkapan ayat di atas memberikan pengertian bahwa amal saleh dengan pahala yang besar, sama hebatnya dengan perniagaan yang tak pernah merugi karena ia akan masuk surga dan selamat dari api neraka. Firman Allah:\n\nSesungguhnya Allah membeli dari orang-orang mukmin, baik diri maupun harta mereka dengan memberikan surga untuk mereka. (at-Taubah\/9: 111)\n\nKemudian disebutkan bentuk-bentuk perdagangan yang memberikan keuntungan yang besar itu, yaitu:\n\n1.Senantiasa beriman kepada Allah, para malaikat, kitab-kitab-Nya, rasul-rasul-Nya, adanya hari Kiamat, qadha' dan qadar Allah.\n\n2.Mengerjakan amal saleh semata-mata karena Allah bukan karena ria adalah perwujudan iman seseorang.\n\n3.Berjihad di jalan Allah. Berjihad ialah segala macam upaya dan usaha yang dilakukan untuk menegakkan agama Allah. Ada dua macam jihad yang disebut dalam ayat ini yaitu berjihad dengan jiwa raga dan berjihad dengan harta. Berjihad dengan jiwa dan raga ialah berperang melawan musuh-musuh agama yang menginginkan kehancuran Islam dan kaum Muslimin. Berjihad dengan harta yaitu membelanjakan harta benda untuk menegakkan kalimat Allah, seperti untuk biaya berperang, mendirikan masjid, rumah ibadah, sekolah, rumah sakit, dan kepentingan umum lainnya.\n\nDi samping itu, ada bentuk-bentuk jihad yang lain, yaitu jihad menentang hawa nafsu, mengendalikan diri, berusaha membentuk budi pekerti yang baik pada diri sendiri, menghilangkan rasa iri, dan sebagainya. \n\nPada akhir ayat ini ditegaskan bahwa iman dan jihad itu adalah perbuatan yang paling baik akibatnya, baik untuk diri sendiri, anak-anak, keluarga, harta benda, dan masyarakat, jika manusia itu memahami dengan sebenar-benarnya.",
      "text_translation": "Maka mereka mendurhakai utusan Tuhannya, Allah menyiksa mereka dengan siksaan yang sangat keras. ",
      "text": "فَعَصَوْا رَسُوْلَ رَبِّهِمْ فَاَخَذَهُمْ اَخْذَةً رَّابِيَةً ",
      "text_translation_en": "and rebelled against their Sustainer's apostles: and so He took them to task with a punishing grasp exceedingly severe!",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "In this verse Allah instructs the Muslims to do good deeds by saying, \"O you who believe in Allah and His Messenger, do you want me to show you a profitable business and will surely bring double profits and eternal fortune or deliver you from the fire of hell. \" The phrase above gives the meaning of good deeds of great merit, just as much as a business that never loses because it will enter heaven and be saved from the fire of hell. The Word of God: Verily Allah bought from the believers, both their own and their wealth by giving them a paradise. (at-Taubah \/ 9: 111) Then the following forms of trade are mentioned, which are: 1.While you believe in God, the angels, his books, his apostles, the Day of Resurrection, qadha 'and the qadar of Allah. 2. Doing good deeds solely for God is not because ria is an embodiment of one's faith. 3. Work in the way of Allah. Jihad is all the efforts and efforts made to uphold the religion of Allah. There are two types of jihad mentioned in this verse namely jihad with the soul and jihad with the treasure. Fighting with souls and bodies is a war against religious enemies who want to destroy Islam and Muslims. Jihad with property means spending property to uphold the word of God, such as for war costs, building mosques, houses of worship, schools, hospitals, and other public interests. In addition, there are other forms of jihad, such as jihad against lust, self-control, striving to develop good morals in oneself, eliminating envy, and so on. At the end of this verse it is asserted that faith and jihad are the best acts of consequence, for oneself, children, families, possessions, and society, if the person truly understands.",
      "text_tafsir": "Dalam ayat ini Allah memerintahkan kaum Muslimin agar melakukan amal saleh dengan mengatakan, \"Wahai orang-orang yang beriman kepada Allah dan rasul -Nya, apakah kamu sekalian mau Aku tunjukkan suatu perniagaan yang bermanfaat dan pasti mendatangkan keuntungan yang berlipat ganda dan keberuntungan yang kekal atau melepaskan kamu dari api neraka.\"\n\nUngkapan ayat di atas memberikan pengertian bahwa amal saleh dengan pahala yang besar, sama hebatnya dengan perniagaan yang tak pernah merugi karena ia akan masuk surga dan selamat dari api neraka. Firman Allah:\n\nSesungguhnya Allah membeli dari orang-orang mukmin, baik diri maupun harta mereka dengan memberikan surga untuk mereka. (at-Taubah\/9: 111)\n\nKemudian disebutkan bentuk-bentuk perdagangan yang memberikan keuntungan yang besar itu, yaitu:\n\n1.Senantiasa beriman kepada Allah, para malaikat, kitab-kitab-Nya, rasul-rasul-Nya, adanya hari Kiamat, qadha' dan qadar Allah.\n\n2.Mengerjakan amal saleh semata-mata karena Allah bukan karena ria adalah perwujudan iman seseorang.\n\n3.Berjihad di jalan Allah. Berjihad ialah segala macam upaya dan usaha yang dilakukan untuk menegakkan agama Allah. Ada dua macam jihad yang disebut dalam ayat ini yaitu berjihad dengan jiwa raga dan berjihad dengan harta. Berjihad dengan jiwa dan raga ialah berperang melawan musuh-musuh agama yang menginginkan kehancuran Islam dan kaum Muslimin. Berjihad dengan harta yaitu membelanjakan harta benda untuk menegakkan kalimat Allah, seperti untuk biaya berperang, mendirikan masjid, rumah ibadah, sekolah, rumah sakit, dan kepentingan umum lainnya.\n\nDi samping itu, ada bentuk-bentuk jihad yang lain, yaitu jihad menentang hawa nafsu, mengendalikan diri, berusaha membentuk budi pekerti yang baik pada diri sendiri, menghilangkan rasa iri, dan sebagainya. \n\nPada akhir ayat ini ditegaskan bahwa iman dan jihad itu adalah perbuatan yang paling baik akibatnya, baik untuk diri sendiri, anak-anak, keluarga, harta benda, dan masyarakat, jika manusia itu memahami dengan sebenar-benarnya.",
      "text_translation": "Sesungguhnya ketika air naik (sampai ke gunung), Kami membawa (nenek moyang) kamu ke dalam kapal, ",
      "text": "اِنَّا لَمَّا طَغَا الْمَاۤءُ حَمَلْنٰكُمْ فِى الْجَارِيَةِۙ",
      "text_translation_en": "[And] behold: when the waters [of Noah's flood] burst beyond all limits, it was We who caused you to be borne [to safety] in that floating ark,",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "These verses describe the punishment that was inflicted upon the people of Noah, until they were destroyed. The only survivors were those who accompanied Noah on a ark or boat. It is said that after the waters had flooded the whole land with a violent gust of wind, God ordered that Noah and his fellow believers board the ark that had been provided, so that they would not be among those who drowned. Based on this statement, some of the disbelievers think that Noah was the second human father after Adam, since only he and his surviving associates were to bring down the whole human race today. God saved all the believers from the flood and the typhoon, and drowned and destroyed those who disobeyed Noah, so that the event would be taught and taught by those who would come later. Thus, God shows man his power and greatness. God tells the story also to help the ears of those who truly believe in Him to hear and benefit from the revelations He has revealed and to practice the messages he brings.",
      "text_tafsir": "Ayat-ayat ini menerangkan azab yang telah ditimpakan kepada kaum Nuh, sehingga mereka semua musnah. Yang tinggal hanya orang-orang yang ikut bersama Nabi Nuh menaiki bahtera atau kapal. Diterangkan bahwa setelah air menggenangi seluruh negeri disertai hembusan angin topan yang dahsyat, Allah memerintahkan agar Nabi Nuh dan orang-orang yang beriman bersamanya menaiki bahtera yang telah disediakan, agar mereka tidak termasuk orang-orang yang tenggelam.\n\nBerdasarkan keterangan ini, sebahagian mufasir berpendapat bahwa Nabi Nuh merupakan bapak manusia kedua setelah Adam, karena hanya beliau dan orang-orang yang bersamanya yang masih hidup, yang kemudian menurunkan seluruh manusia yang ada sekarang.\n\nAllah menyelamatkan semua orang-orang yang beriman dari banjir dan topan itu, serta menenggelamkan dan memusnahkan orang-orang yang ingkar kepada Nuh, agar peristiwa itu dijadikan iktibar dan pelajaran oleh orang-orang yang datang kemudian. Dengan demikian, Allah memperlihatkan kepada manusia kekuasaan dan kebesaran-Nya.\n\nAllah menceritakan kisah itu juga bertujuan agar telinga orang-orang yang benar-benar beriman kepada-Nya dapat mendengar dan mengambil manfaat dari wahyu-wahyu yang diturunkan-Nya serta mengamalkan pesan-pesan yang dibawanya.",
      "text_translation": "agar Kami jadikan (peristiwa itu) sebagai peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar. ",
      "text": "لِنَجْعَلَهَا لَكُمْ تَذْكِرَةً وَّتَعِيَهَآ اُذُنٌ وَّاعِيَةٌ ",
      "text_translation_en": "so that We might make all this a [lasting] reminder to you all, and that every wide-awake ear might consciously take it in.",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "In this verse it is explained that if God wanted to bring the Day of Judgment to pass, He had the Angel of Israel blow the first trumpet. The Word of God: And the trumpet sounded, and they went forth out of their graves, at the presence of their Lord. (Yasin \/ 36: 51)",
      "text_tafsir": "Dalam ayat ini diterangkan bahwa apabila Allah berkehendak mendatangkan hari Kiamat, maka Ia memerintahkan Malaikat Israfil meniup sangkakala pertama. Firman Allah:\n\nLalu ditiuplah sangkakala, maka seketika itu mereka keluar dari kuburnya (dalam keadaan hidup), menuju kepada Tuhannya. (Yasin\/36: 51)",
      "text_translation": "Maka apabila sangkakala ditiup sekali tiup,",
      "text": "فَاِذَا نُفِخَ فِى الصُّوْرِ نَفْخَةٌ وَّاحِدَةٌ ۙ",
      "text_translation_en": "Hence, [bethink yourselves of the Last Hour,] when the trumpet [of judgment] shall be sounded with a single blast,",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "At that moment the whole earth shook, and the mountains were lifted from their places and then collided with each other. The shaking of the earth and the moving of the mountain indicate that there has been a devastating earthquake that destroyed all that is on the surface of the earth, including humans who live on it. In another word of God explained: And (remember) on the day (when) we run the mountains and you will see that the earth is flat and We gather them (all men), and we will not leave any of them. (al-Kahf \/ 18: 47)",
      "text_tafsir": "Pada saat itu berguncanglah seluruh bumi, dan gunung-gunung terangkat dari tempat-tempatnya kemudian saling berbenturan. Berguncangnya bumi dan bergeraknya gunung menandakan bahwa telah terjadi gempa dahsyat yang menghancurkan seluruh yang ada di permukaan bumi, termasuk manusia yang berdiam di atasnya. Pada firman Allah yang lain diterangkan:\n\nDan (ingatlah) pada hari (ketika) Kami perjalankan gunung-gunung dan engkau akan melihat bumi itu rata dan Kami kumpulkan mereka (seluruh manusia), dan tidak Kami tinggalkan seorang pun dari mereka. (al-Kahf\/18: 47)",
      "text_translation": "dan diangkatlah bumi dan gunung-gunung, lalu dibenturkan keduanya sekali benturan.",
      "text": "وَّحُمِلَتِ الْاَرْضُ وَالْجِبَالُ فَدُكَّتَا دَكَّةً وَّاحِدَةًۙ",
      "text_translation_en": "and the earth and the mountains shall be lifted up and crushed with a single stroke!",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "At the time of Judgment Day, the sky was so weak that it split. If you pay attention to the laws of God that apply in space, then this verse stated in accordance with that law. Each planet in space has an attraction. With this power, all the planets always circulate on a fixed, non-falling and deviating path. If even one of the many planets shifts from their celestial sphere, then the balance of attraction is lost between the planets, so that small planets are attracted by large planets. There was a collision between the planets that destroyed the entire universe. Today's modern scientific studies state that the universe in its entirety begins with the formation of a singularity. Singularity is something where candidates \/ prospects of space, energy, matter, and time are still collected into one (one). Big Bang (Big Bang) blew up this singularity and developed like a spiral-cone that continuously expands widening and widening continuously. Since the Big Bang, time began to separate from space, so did energy, matter, and forces, and for billions of years the entire universe was formed that contained billions of galaxies. Space and time continue to experience widespread expansion. Bahiruddin S. Mahmud explained that the expansion of the universe was not infinite and continuous. The rate of expansion or development is gradually decreasing, because the gravitational force between galaxies (which they keep each other away from each other) begins to loosen, so that one day will stop the expansion of the universe. When the universe or the universe stops its expansionary activity (expansion), the shrinking period (compaction) begins. If expansion begins with the singularity, the Big Bang, and the expansion of the universe; then the shrinkage of the universe or compaction (contraction) of the universe begins with a universe that is slowly shrinking, where space, time, energy, matter, and forces will reunite into singularity. This shrinkage is getting faster and faster, from the time dimension of billions of years, millions of years, decades, annual, monthly, weekly, daily, continue to hours, minutes, seconds, micro-seconds and finally there is a great explosion called the Big Crunch ) becomes a singularity again. So the Big Crunch, is like the Big Bang in the reverse direction. The process of shrinking the universe to the Big Crunch, took place with a very long period of time, then getting faster, and super fast !! According to Paul Davies, when the universe has compacted to one-hundredth (1\/100) of its present extent, the effect of the pressure will result in temperatures that rise to the boiling point of liquid objects; and the earth becomes an uninhabitable place. Galaxies are indistinguishable from one another, because they have fused, and pressed against each other. Furthermore the motion of the density increases until it reaches the hot spot. It is at this time that space looks like an incandescent plasma fireball. It is this possibility that is mentioned in Surah al-Ma'arij \/ 70: 8, \"On the day when the sky will be like silver wreckage.\" When there is a process towards the Big Crunch, which is the process of compaction or contraction of the universe, then all matter breaks down into fundamental matter such as quarks, electrons, etc., forces such as the gravitational, electromagnetic, strong nuclear, and weak nuclear forces began to reunite. That's when the celestial bodies begin to lose their gravitational forces, and as a result there are massive collisions between planets, so the earth collides with other planets, mountains collide because of the loss of gravitational forces that support it so that it collides with each other. The celestial sky begins to weaken due to the absence of a gravitational support, and begins to shrink \/ contract and crack \/ split. This process caused a great roar, which was topped with a Big Crunch boom. Does the trumpet (sur) in question mean the start of a roar when this shrinkage process occurs? Allah knows best bis-sawab. Finally after the Big Crunch boom returns to the singularity again, everything is mortal, except God, as He says: Everything on earth will perish, but the face of your Lord who has greatness and glory remains eternal. (ar-Rahman \/ 55: 26-27)",
      "text_tafsir": "Pada saat terjadinya hari Kiamat itu, langit dalam keadaan lemah sehingga terbelah. Jika diperhatikan hukum-hukum Allah yang berlaku di ruang angkasa, maka yang dikemukakan ayat ini sesuai dengan hukum itu. Masing-masing planet di ruang angkasa itu mempunyai daya tarik-menarik. Dengan adanya daya tersebut, maka seluruh planet-planet menjadi selalu beredar pada garis edar yang tetap, tidak jatuh dan tidak menyimpang. Seandainya salah satu saja di antara planet yang banyak itu bergeser dari falaknya, maka hilanglah keseimbangan tarik-menarik yang ada antara planet-planet itu, sehingga planet yang kecil tertarik oleh planet yang besar. Terjadilah tabrakan antara planet-planet itu yang menghancurkan seluruh alam ini.\n\nKajian saintifik modern saat ini menyatakan bahwa jagad-raya seisinya ini diawali pembentukannya dari adanya singularity. Singularity adalah sesuatu dimana calon\/bakal ruang, energi, materi, dan waktu masih terkumpul menjadi satu (manunggal). Dentuman Besar (Big Bang) meledakkan singularity ini dan berkembanglah seperti spiral-kerucut yang terus menerus berekspansi melebar dan melebar terus. Sejak Big Bang itulah, waktu mulai memisahkan diri dari ruang, begitu pula energi, materi, dan gaya-gaya, dan selama bermiliar-miliar tahun terbentuklah seluruh jagad-raya yang berisi miliaran galaksi. Ruang dan waktu terus mengalami ekspansi meluas. Bahiruddin S. Mahmud menjelaskan bahwa ekspansi jagad raya bukannya tak terbatas dan terus menerus. Laju ekspansi atau perkembangan ini berangsur-angsur menurun, karena gaya gravitasi antar galaksi (yang mereka sesamanya terus saling menjauh) mulai mengendor, sehingga suatu saat akan berhentilah ekspansi jagad raya itu.\n\nKetika jagad raya atau alam semesta menghentikan aktivitas ekspansinya (perluasannya), masa penyusutannya (pemadatannya) pun dimulai. Jika ekspansi diawali dari singularity, Big Bang, dan ekspansi alam semesta; maka penyusutan alam semesta atau pemadatan (kontraksi) alam semesta diawali dengan alam semesta yang secara perlahan menyusut, di mana ruang, waktu, energi, materi, dan gaya-gaya akan bersatu kembali menjadi singularity. Penyusutan ini makin lama makin cepat, dari dimensi waktu miliaran tahun, jutaan tahun, puluhan tahun, tahunan, bulanan, mingguan, harian, terus ke jam, menit, detik, mikro-detik dan akhirnya terjadi ledakan hebat yang disebut Big Crunch (Kompresan Besar) menjadi singularity kembali. Jadi Big Crunch, adalah seperti Big Bang dalam arah yang berbalikkan. Proses penyusutan alam semesta menuju Big Crunch ini, berlangsung dengan periode waktu yang sangat lama, kemudian semakin cepat, dan super cepat!! Menurut Paul Davies, ketika alam semesta telah memadat sampai seper-seratus (1\/100) dari luasnya yang sekarang ini, maka efek tekanannya akan mengakibatkan suhu yang meninggi sampai mencapai titik didih benda cair; dan bumi menjadi tempat yang tidak layak huni lagi. Galaksi sudah tidak dapat dibedakan satu sama lainnya, karena mereka telah berfusi, dan merapat satu sama lainnya. Selanjutnya gerak kepadatan makin naik hingga mencapai titik api pijar. Pada saat inilah antariksa tampak bagaikan bola api plasma yang pijar. Kemungkinan inilah yang disebut dalam Surah al-Ma'arij\/70: 8, \"Pada hari ketika langit menjadi seperti luluhan perak.\" \n\nKetika terjadi proses ke arah Big Crunch itu, yaitu proses pemadatan atau penyusutan alam semesta, maka semua materi pecah kembali menjadi materi-materi fundamental seperti quark, elektron, dan sebagainya, gaya-gaya seperti gaya gravitasi, elektromagnetik, nuklir kuat, dan nuklir lemah mulai menyatu kembali. Saat itulah benda-benda langit mulai kehilangan gaya-gaya gravitasinya, dan akibatnya terjadilah tubrukan-tubrukan dahsyat antar planet, sehingga bumi berbenturan dengan planet-planet lainnya, gunung-gunung berbenturan karena hilangnya gaya gravitasi yang menopangnya sehingga berbenturan sesamanya. Langit antariksa mulai lemah karena ketiadaan topangan gaya gravitasi, dan mulai menyusut\/ mengerut dan retak\/terbelah. Proses ini menimbulkan suara gemuruh dahsyat, yang dipuncaki dengan dentuman Big Crunch. Apakah sangkakala (sur) yang dimaksud adalah mulainya suara gemuruh ketika terjadi proses penyusutan ini? Wallahu a'lam bis-sawab. Akhirnya setelah dentuman Big Crunch kembalilah ke singularity lagi, semua serba fana, kecuali Allah, sebagaimana firman-Nya: \n\nSemua yang ada di bumi itu akan binasa, tetapi wajah Tuhanmu yang memiliki kebesaran dan kemuliaan tetap kekal. (ar-Rahman\/55: 26-27)",
      "text_translation": "Maka pada hari itu terjadilah hari Kiamat, ",
      "text": "فَيَوْمَىِٕذٍ وَّقَعَتِ الْوَاقِعَةُۙ",
      "text_translation_en": "And so, that which must come to pass will on that day have come to pass;",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "At the time of Judgment Day, the sky was so weak that it split. If you pay attention to the laws of God that apply in space, then this verse stated in accordance with that law. Each planet in space has an attraction. With this power, all the planets always circulate on a fixed, non-falling and deviating path. If even one of the many planets shifts from their celestial sphere, then the balance of attraction is lost between the planets, so that small planets are attracted by large planets. There was a collision between the planets that destroyed the entire universe. Today's modern scientific studies state that the universe in its entirety begins with the formation of a singularity. Singularity is something where candidates \/ prospects of space, energy, matter, and time are still collected into one (one). Big Bang (Big Bang) blew up this singularity and developed like a spiral-cone that continuously expands widening and widening continuously. Since the Big Bang, time began to separate from space, so did energy, matter, and forces, and for billions of years the entire universe was formed that contained billions of galaxies. Space and time continue to experience widespread expansion. Bahiruddin S. Mahmud explained that the expansion of the universe was not infinite and continuous. The rate of expansion or development is gradually decreasing, because the gravitational force between galaxies (which they keep each other away from each other) begins to loosen, so that one day will stop the expansion of the universe. When the universe or the universe stops its expansionary activity (expansion), the shrinking period (compaction) begins. If expansion begins with the singularity, the Big Bang, and the expansion of the universe; then the shrinkage of the universe or compaction (contraction) of the universe begins with a universe that is slowly shrinking, where space, time, energy, matter, and forces will reunite into singularity. This shrinkage is getting faster and faster, from the time dimension of billions of years, millions of years, decades, annual, monthly, weekly, daily, continue to hours, minutes, seconds, micro-seconds and finally there is a great explosion called the Big Crunch ) becomes a singularity again. So the Big Crunch, is like the Big Bang in the reverse direction. The process of shrinking the universe to the Big Crunch, took place with a very long period of time, then getting faster, and super fast !! According to Paul Davies, when the universe has compacted to one-hundredth (1\/100) of its present extent, the effect of the pressure will result in temperatures that rise to the boiling point of liquid objects; and the earth becomes an uninhabitable place. Galaxies are indistinguishable from one another, because they have fused, and pressed against each other. Furthermore the motion of the density increases until it reaches the hot spot. It is at this time that space looks like an incandescent plasma fireball. It is this possibility that is mentioned in Surah al-Ma'arij \/ 70: 8, \"On the day when the sky will be like silver wreckage.\" When there is a process towards the Big Crunch, which is the process of compaction or contraction of the universe, then all matter breaks down into fundamental matter such as quarks, electrons, etc., forces such as the gravitational, electromagnetic, strong nuclear, and weak nuclear forces began to reunite. That's when the celestial bodies begin to lose their gravitational forces, and as a result there are massive collisions between planets, so the earth collides with other planets, mountains collide because of the loss of gravitational forces that support it so that it collides with each other. The celestial sky begins to weaken due to the absence of a gravitational support, and begins to shrink \/ contract and crack \/ split. This process caused a great roar, which was topped with a Big Crunch boom. Does the trumpet (sur) in question mean the start of a roar when this shrinkage process occurs? Allah knows best bis-sawab. Finally after the Big Crunch boom returns to the singularity again, everything is mortal, except God, as He says: Everything on earth will perish, but the face of your Lord who has greatness and glory remains eternal. (ar-Rahman \/ 55: 26-27)",
      "text_tafsir": "Pada saat terjadinya hari Kiamat itu, langit dalam keadaan lemah sehingga terbelah. Jika diperhatikan hukum-hukum Allah yang berlaku di ruang angkasa, maka yang dikemukakan ayat ini sesuai dengan hukum itu. Masing-masing planet di ruang angkasa itu mempunyai daya tarik-menarik. Dengan adanya daya tersebut, maka seluruh planet-planet menjadi selalu beredar pada garis edar yang tetap, tidak jatuh dan tidak menyimpang. Seandainya salah satu saja di antara planet yang banyak itu bergeser dari falaknya, maka hilanglah keseimbangan tarik-menarik yang ada antara planet-planet itu, sehingga planet yang kecil tertarik oleh planet yang besar. Terjadilah tabrakan antara planet-planet itu yang menghancurkan seluruh alam ini.\n\nKajian saintifik modern saat ini menyatakan bahwa jagad-raya seisinya ini diawali pembentukannya dari adanya singularity. Singularity adalah sesuatu dimana calon\/bakal ruang, energi, materi, dan waktu masih terkumpul menjadi satu (manunggal). Dentuman Besar (Big Bang) meledakkan singularity ini dan berkembanglah seperti spiral-kerucut yang terus menerus berekspansi melebar dan melebar terus. Sejak Big Bang itulah, waktu mulai memisahkan diri dari ruang, begitu pula energi, materi, dan gaya-gaya, dan selama bermiliar-miliar tahun terbentuklah seluruh jagad-raya yang berisi miliaran galaksi. Ruang dan waktu terus mengalami ekspansi meluas. Bahiruddin S. Mahmud menjelaskan bahwa ekspansi jagad raya bukannya tak terbatas dan terus menerus. Laju ekspansi atau perkembangan ini berangsur-angsur menurun, karena gaya gravitasi antar galaksi (yang mereka sesamanya terus saling menjauh) mulai mengendor, sehingga suatu saat akan berhentilah ekspansi jagad raya itu.\n\nKetika jagad raya atau alam semesta menghentikan aktivitas ekspansinya (perluasannya), masa penyusutannya (pemadatannya) pun dimulai. Jika ekspansi diawali dari singularity, Big Bang, dan ekspansi alam semesta; maka penyusutan alam semesta atau pemadatan (kontraksi) alam semesta diawali dengan alam semesta yang secara perlahan menyusut, di mana ruang, waktu, energi, materi, dan gaya-gaya akan bersatu kembali menjadi singularity. Penyusutan ini makin lama makin cepat, dari dimensi waktu miliaran tahun, jutaan tahun, puluhan tahun, tahunan, bulanan, mingguan, harian, terus ke jam, menit, detik, mikro-detik dan akhirnya terjadi ledakan hebat yang disebut Big Crunch (Kompresan Besar) menjadi singularity kembali. Jadi Big Crunch, adalah seperti Big Bang dalam arah yang berbalikkan. Proses penyusutan alam semesta menuju Big Crunch ini, berlangsung dengan periode waktu yang sangat lama, kemudian semakin cepat, dan super cepat!! Menurut Paul Davies, ketika alam semesta telah memadat sampai seper-seratus (1\/100) dari luasnya yang sekarang ini, maka efek tekanannya akan mengakibatkan suhu yang meninggi sampai mencapai titik didih benda cair; dan bumi menjadi tempat yang tidak layak huni lagi. Galaksi sudah tidak dapat dibedakan satu sama lainnya, karena mereka telah berfusi, dan merapat satu sama lainnya. Selanjutnya gerak kepadatan makin naik hingga mencapai titik api pijar. Pada saat inilah antariksa tampak bagaikan bola api plasma yang pijar. Kemungkinan inilah yang disebut dalam Surah al-Ma'arij\/70: 8, \"Pada hari ketika langit menjadi seperti luluhan perak.\" \n\nKetika terjadi proses ke arah Big Crunch itu, yaitu proses pemadatan atau penyusutan alam semesta, maka semua materi pecah kembali menjadi materi-materi fundamental seperti quark, elektron, dan sebagainya, gaya-gaya seperti gaya gravitasi, elektromagnetik, nuklir kuat, dan nuklir lemah mulai menyatu kembali. Saat itulah benda-benda langit mulai kehilangan gaya-gaya gravitasinya, dan akibatnya terjadilah tubrukan-tubrukan dahsyat antar planet, sehingga bumi berbenturan dengan planet-planet lainnya, gunung-gunung berbenturan karena hilangnya gaya gravitasi yang menopangnya sehingga berbenturan sesamanya. Langit antariksa mulai lemah karena ketiadaan topangan gaya gravitasi, dan mulai menyusut\/ mengerut dan retak\/terbelah. Proses ini menimbulkan suara gemuruh dahsyat, yang dipuncaki dengan dentuman Big Crunch. Apakah sangkakala (sur) yang dimaksud adalah mulainya suara gemuruh ketika terjadi proses penyusutan ini? Wallahu a'lam bis-sawab. Akhirnya setelah dentuman Big Crunch kembalilah ke singularity lagi, semua serba fana, kecuali Allah, sebagaimana firman-Nya: \n\nSemua yang ada di bumi itu akan binasa, tetapi wajah Tuhanmu yang memiliki kebesaran dan kemuliaan tetap kekal. (ar-Rahman\/55: 26-27)",
      "text_translation": "dan terbelahlah langit, karena pada hari itu langit menjadi rapuh.",
      "text": "وَانْشَقَّتِ السَّمَاۤءُ فَهِيَ يَوْمَىِٕذٍ وَّاهِيَةٌۙ",
      "text_translation_en": "and the sky will be rent asunder - for, frail will it have become on that Day -;",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "On the Day of Judgment, the angels are in every corner of the sky. Eight angels carry 'God's Throne over his head. The question of angels and 'This Throne is a supernatural question, no one knows. It does not explain the shape of the 'Throne that the angels took, and where they brought it. Therefore, we accept all of them based on our faith in God.",
      "text_tafsir": "Pada hari Kiamat, para malaikat berada di segenap penjuru langit. Delapan malaikat menjunjung 'Arasy Allah di atas kepalanya. Persoalan malaikat dan 'Arasy ini adalah persoalan yang gaib, tidak seorang pun yang mengetahuinya. Tidak dijelaskan bentuk 'Arasy yang dipikul para malaikat itu, dan ke mana mereka membawanya. Oleh karena itu, kita menerima semuanya itu berdasarkan iman kita kepada Allah.",
      "text_translation": "Dan para malaikat berada di berbagai penjuru langit. Pada hari itu delapan malaikat menjunjung ‘Arsy (singgasana) Tuhanmu di atas (kepala) mereka. ",
      "text": "وَّالْمَلَكُ عَلٰٓى اَرْجَاۤىِٕهَاۗ وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَىِٕذٍ ثَمٰنِيَةٌ  ۗ",
      "text_translation_en": "and the angels [will appear] at its ends, and, above them, eight will bear aloft on that Day the throne of thy Sustainer’s almightiness…",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "On the Day of Judgment all men are brought before God, to be glorified and to be considered for their deeds and deeds. No human act and charity has escaped the knowledge of God from the smallest to the greatest, from the hidden and the real, the subtle and the gross; everything is known to God. On that day the only one who can help is God alone. The help was given based on their charity for the rest of the world.",
      "text_tafsir": "Pada hari Kiamat itu seluruh manusia dihadapkan ke hadirat Allah, untuk dihisab dan ditimbang amal dan perbuatannya. Tidak ada satu pun perbuatan dan amal manusia yang luput dari pengetahuan Allah sejak dari yang sekecil-kecilnya sampai kepada yang sebesar-besarnya, sejak dari yang tersembunyi dan yang nyata, yang halus dan yang kasar; semuanya diketahui Allah.\n\nPada hari itu yang dapat menolong seseorang hanyalah Allah semata. Pertolongan itu diberikan berdasarkan amal mereka selama hidup di dunia.",
      "text_translation": "Pada hari itu kamu dihadapkan (kepada Tuhanmu), tidak ada sesuatu pun dari kamu yang tersembunyi (bagi Allah). ",
      "text": "يَوْمَىِٕذٍ تُعْرَضُوْنَ لَا تَخْفٰى مِنْكُمْ خَافِيَةٌ ",
      "text_translation_en": "On that Day you shall be brought to judgment: not [even] the most hidden of your deeds will remain hidden.",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "This verse describes the servant of God who believes and acts righteously on the Day of Resurrection. At that time, they were happy that the distance they would travel to reach their dream destination was closer to the place that God had provided for them. Such joy must have been felt since they parted from their bodies. At that time they saw signs of good fortune, as the word of God said: (That) when angels are in good health, they (the angels) say, \"Salam' alaikum, enter heaven because what you have done. \" (an-Nahl \/ 16:32) They always remember the promise of God in his word: Terrible surprises do not make them sad, and angels will greet them (by saying), \"This is the day you have been promised.\" (al-Anbiya '\/ 21: 103) Then the day that they had been waiting for came and the believers received their deeds of charity with their right hand propped up from their right, and they burst into joy. They also want the charity records to be read by their friends who are like them, saying, \"My friends who have received God's will, this is the record that we are. Take it and read it, of course you will know that we all get a notebook from the right and we all get the reward from God. \" So they were happy together.",
      "text_tafsir": "Ayat ini menggambarkan hamba Allah yang beriman dan beramal saleh pada hari Kiamat. Ketika itu, mereka merasa gembira karena jarak perjalanan yang akan ditempuhnya untuk mencapai tujuan yang dicita-citakan semakin dekat dengan tempat yang disediakan Allah baginya.\n\nPerasaan gembira yang demikian sebenarnya telah mereka rasakan sejak roh mereka berpisah dengan jasad. Ketika itu, mereka telah melihat tanda-tanda keberuntungan, sebagaimana firman Allah:\n\n(Yaitu) orang yang ketika diwafatkan oleh para malaikat dalam keadaan baik, mereka (para malaikat) mengatakan (kepada mereka), \"Salamun 'alaikum, masuklah ke dalam surga karena apa yang telah kamu kerjakan.\" (an-Nahl\/16: 32)\n\nMereka selalu ingat janji Allah dalam firman-Nya:\n\nKejutan yang dahsyat tidak membuat mereka merasa sedih, dan para malaikat akan menyambut mereka (dengan ucapan), \"Inilah harimu yang telah dijanjikan kepadamu.\" (al-Anbiya'\/21: 103)\n\nMaka hari yang mereka tunggu-tunggu itu tiba dan orang-orang mukmin menerima catatan amalnya dengan tangan kanan yang disodorkan dari sebelah kanannya, maka meledaklah kegembiraan dalam hati mereka. Mereka pun ingin agar catatan amal itu dibaca oleh teman-temannya yang sama keadaannya dengan mereka, dengan mengatakan, \"Hai teman-temanku yang sama-sama memperoleh keridaan Allah, inilah catatan bahwa kita sama. Ambillah dan bacalah isinya, tentu kamu akan mengetahui bahwa kita semua mendapatkan buku catatan dari sebelah kanan dan sama-sama akan mendapat pahala dari Allah.\" Maka mereka pun bersama-sama bergembira.",
      "text_translation": "Adapun orang yang kitabnya  diberikan di tangan kanannya, maka dia berkata, “Ambillah, bacalah kitabku (ini).” ",
      "text": "فَاَمَّا مَنْ اُوْتِيَ كِتٰبَهٗ بِيَمِيْنِهٖ فَيَقُوْلُ هَاۤؤُمُ اقْرَءُوْا كِتٰبِيَهْۚ ",
      "text_translation_en": "Now as for him whose record shall be placed in his right hand, he will exclaim: \"Come you all!\" Read this my record!",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "With great pride and satisfaction the believers said, \"I have confidence that God will deliver me and will take responsibility for all that I do today. Therefore, throughout my life I believed in God and obeyed His commands and abstained from His prohibitions. Muhammad, I believe that my Lord will burn and consider my deeds. \" According to adh-ahhak, every word of dhann (allegory) in relation to believers, which is found in the Qur'an means belief, and in relation to unbelievers it is doubtful. Al-hasan says, \"Indeed, believers have the utmost confidence in their best faith, and they increase their deeds for the Hereafter, while the hypocrites have their worst doubts in their Lord.\" ; then he has a bad charity for the hereafter. \" So it is in this verse. The word auspicious means \"I'm sure\" not \"I doubt\", or \"I suspect\". The meaning behind this is also in the word of God: Why do believers and believers not think of themselves when you hear the false news and say, \"This is a true lie?\" (an-Nur \/ 24: 12)",
      "text_tafsir": "Dengan bangga dan penuh kepuasan orang-orang mukmin berkata, \"Aku telah yakin bahwa Tuhan akan menghisabku dan aku akan mempertanggungjawabkan seluruh perbuatanku hari ini. Karena itulah, selama hidup di dunia aku beriman kepada Allah serta melaksanakan perintah dan menjauhi larangan-Nya yang disampaikan Nabi Muhammad. Aku pun yakin bahwa Tuhanku akan menghisab dan menimbang amal perbuatanku.\"\n\nMenurut adh-ahhak, setiap perkataan dhann (dugaan) yang berhubungan dengan orang-orang yang beriman, yang terdapat dalam Al-Qur'an berarti yakin, dan kalau berhubungan dengan orang-orang kafir berarti ragu-ragu.\n\nAl-hasan berkata, \"Sesungguhnya orang-orang yang beriman mempunyai dugaan yang mendekati keyakinan (dhann) yang paling baik kepada Tuhannya, lalu mereka meningkatkan amalnya untuk akhirat, sedangkan orang-orang munafik mempunyai keragu-raguan (dhann) yang paling buruk terhadap Tuhannya; maka ia mempunyai amal yang buruk pula untuk akhirat.\"\n\nDemikian pula dalam ayat ini. Perkataan dhanantu berarti \"aku yakin\" bukan \"aku ragu\", atau \"aku menduga\". Arti yang semakna dengan ini terdapat pula pada firman Allah:\n\nMengapa orang-orang mukmin dan mukminat tidak berbaik sangka terhadap diri mereka sendiri, ketika kamu mendengar berita bohong itu dan berkata, \"Ini adalah (suatu berita) bohong yang nyata.\" (an-Nur\/24: 12)",
      "text_translation": "Sesungguhnya aku yakin, bahwa (suatu saat) aku akan menerima perhitungan terhadap diriku. ",
      "text": "اِنِّيْ ظَنَنْتُ اَنِّيْ مُلٰقٍ حِسَابِيَهْۚ",
      "text_translation_en": "Behold, I did know that [one day] I would have to face my account!",
      "juz_number": 29
    },
    "21": {
      "text_tafsir_en": "In this verse, it is explained that the reward received by those who receive the right hand note of their charity is in the life of the court. The life that is governed is the life that every believer aspires to, that is, the life of God, of all men, and of all beings. No one is jealous, envious, resentful, and hates her, so that everything she encounters is good and good for her. There is nothing that hurts his heart and no act or attitude that offends him, everything is good to hear and feel. In the last word of God it is explained that a quiet soul is a living soul that is governed and includes a group of servants of God: O quiet soul! Return to your Lord with a free and open heart. Then enter into my servants, and enter into my heaven. (al-Fajr \/ 89: 27-30)",
      "text_tafsir": "Pada ayat ini, diterangkan bahwa balasan yang diterima orang-orang yang menerima catatan amalnya dengan tangan kanan adalah berada dalam kehidupan yang diridai. Hidup yang diridai itu adalah hidup yang dicita-citakan oleh setiap orang yang beriman, yaitu hidup yang diridai Allah, seluruh manusia, bahkan seluruh makhluk Allah. Tidak ada satu pun yang menaruh iri, dengki, dendam, dan benci kepadanya, sehingga segala sesuatu yang dihadapinya adalah baik dan menimbulkan kebaikan kepada dirinya. Tidak ada sesuatu yang menyakitkan hatinya dan tidak ada perbuatan atau sikap yang menyinggung perasaannya, semuanya enak didengar dan dirasakan.\n\nDalam firman Allah yang lalu diterangkan bahwa jiwa yang tenang adalah jiwa yang hidup dalam kehidupan yang diridai dan termasuk kelompok hamba-hamba Allah:\n\nWahai jiwa yang tenang! Kembalilah kepada Tuhanmu dengan hati yang rida dan diridai-Nya. Maka masuklah ke dalam golongan hamba-hamba-Ku, dan masuklah ke dalam surga-Ku. (al-Fajr\/89: 27-30)",
      "text_translation": "Maka orang itu berada dalam kehidupan yang diridai,",
      "text": "فَهُوَ فِيْ عِيْشَةٍ رَّاضِيَةٍۚ",
      "text_translation_en": "And so he will find himself in a happy state of life,",
      "juz_number": 29
    },
    "22": {
      "text_tafsir_en": "This verse describes the place provided for believers in the hereafter, a beautiful place, and comfortable with gardens and gardens pleasing to the eye, and low-fruiting trees, easy to pick up. by anyone who wants it, whether it is standing, sitting or lying down. In another verse, God says: There they sit on the couch, there they see not the sun nor the cold. And his shade (tree) is close to them and made it as easy as possible to pluck it (fruit). (al-Insan \/ 76: 13-14)",
      "text_tafsir": "Ayat ini menerangkan keadaan tempat yang disediakan bagi orang-orang yang beriman di akhirat nanti, yakni suatu tempat yang indah, dan nyaman dengan kebun-kebun dan taman-taman yang menyenangkan hati orang yang memandangnya, dan pohon-pohon yang berbuah rendah, mudah dipetik oleh siapa saja yang menghendakinya, baik sambil berdiri, sambil duduk maupun sambil berbaring.\n\nDalam ayat yang lain, Allah berfirman:\n\nDi sana mereka duduk bersandar di atas dipan, di sana mereka tidak melihat (merasakan teriknya) matahari dan tidak pula dingin yang berlebihan. Dan naungan (pepohonan)nya dekat di atas mereka dan dimudahkan semudah-mudahnya untuk memetik (buah)nya. (al-Insan\/76: 13-14)",
      "text_translation": "dalam surga yang tinggi, ",
      "text": "فِيْ جَنَّةٍ عَالِيَةٍۙ",
      "text_translation_en": "in a lofty paradise,",
      "juz_number": 29
    },
    "23": {
      "text_tafsir_en": "This verse describes the place provided for believers in the hereafter, a beautiful place, and comfortable with gardens and gardens pleasing to the eye, and low-fruiting trees, easy to pick up. by anyone who wants it, whether it is standing, sitting or lying down. In another verse, God says: There they sit on the couch, there they see not the sun nor the cold. And his shade (tree) is close to them and made it as easy as possible to pluck it (fruit). (al-Insan \/ 76: 13-14)",
      "text_tafsir": "Ayat ini menerangkan keadaan tempat yang disediakan bagi orang-orang yang beriman di akhirat nanti, yakni suatu tempat yang indah, dan nyaman dengan kebun-kebun dan taman-taman yang menyenangkan hati orang yang memandangnya, dan pohon-pohon yang berbuah rendah, mudah dipetik oleh siapa saja yang menghendakinya, baik sambil berdiri, sambil duduk maupun sambil berbaring.\n\nDalam ayat yang lain, Allah berfirman:\n\nDi sana mereka duduk bersandar di atas dipan, di sana mereka tidak melihat (merasakan teriknya) matahari dan tidak pula dingin yang berlebihan. Dan naungan (pepohonan)nya dekat di atas mereka dan dimudahkan semudah-mudahnya untuk memetik (buah)nya. (al-Insan\/76: 13-14)",
      "text_translation": "buah-buahannya dekat,",
      "text": "قُطُوْفُهَا دَانِيَةٌ ",
      "text_translation_en": "with its fruits within easy reach.",
      "juz_number": 29
    },
    "24": {
      "text_tafsir_en": "The angels say to those who receive their charity records with their right hand in heaven, \"Eat all kinds of fruits and all kinds of food found in this heaven, and drink to your heart's content as well as refreshing drinks. There is no one that can forbid you to take it, all of it is provided for you all. All of that is provided because you all have faith in God, do righteous deeds and submit and surrender to Him while you lived in the former world. \" From the words \"bima aslaftum\" (because of the deeds that you have done) it can be understood that the reward received in the hereafter will be a reward from the results of faith and deeds done during life in the world. This means that it is impossible for a servant to get merit from Allah if he does not have faith and do good. From the words of hani'an (savory) it can be understood that the food and drink provided in heaven is food and drink that is extraordinarily delicious, and there is never anything as good as it tastes in the world.",
      "text_tafsir": "Para malaikat berkata kepada orang-orang yang menerima catatan amalnya dengan tangan kanan di dalam surga, \"Makanlah segala macam jenis buah-buahan dan segala rupa makanan yang ditemukan di dalam surga ini, dan minum pulalah sepuas hati minuman-minuman yang enak dan menyegarkan. Tidak ada satu pun yang dapat melarang kamu mengambilnya, semuanya itu disediakan untuk kamu sekalian. Semuanya itu disediakan karena kamu sekalian telah beriman kepada Allah, mengerjakan amal yang saleh serta tunduk dan menyerahkan diri kepada-Nya selama kamu hidup di dunia dahulu.\"\n\nDari perkataan \"bima aslaftum\" (karena amal yang telah kamu kerjakan) dapat dipahami bahwa pahala yang diterima di akhirat nanti adalah balasan dari hasil iman dan amal perbuatan yang dilakukan selama hidup di dunia. Hal ini berarti bahwa mustahil seorang hamba memperoleh pahala dari Allah jika ia tidak beriman dan beramal.\n\nDari perkataan hani'an (dengan sedap) dapat dipahami bahwa makanan dan minuman yang diberikan di dalam surga adalah makanan dan minuman yang luar biasa enaknya, dan tidak pernah ada yang seenak itu rasanya di dunia.",
      "text_translation": "(kepada mereka dikatakan), “Makan dan minumlah dengan nikmat karena amal yang telah kamu kerjakan pada hari-hari yang telah lalu.” ",
      "text": "كُلُوْا وَاشْرَبُوْا هَنِيْۤـًٔا ۢبِمَآ اَسْلَفْتُمْ فِى الْاَيَّامِ الْخَالِيَةِ ",
      "text_translation_en": "[And all who are thus blest will be told:] \"Eat and drink with good cheer in return for all [the good deeds] that you have sent ahead in days gone by!\"",
      "juz_number": 29
    },
    "25": {
      "text_tafsir_en": "In this verse is described the condition of the unbelievers in the hereafter when they receive a record of the deeds they perform throughout their life on earth. To them were handed a note of charity from the left and received it with the left hand. After reading the note, he was terrified in his heart because according to that note, he must have been put into hell. He said, \"What a terrible thing I would have done and how happy I would have been if this kind of charity had not been granted to me. The infidels were in a terrible state of dread when they received their deeds, as if by a terrible punishment. But they have not yet been punished. This makes sense that the spiritual torment is heavier than the physical torment.",
      "text_tafsir": "Dalam ayat ini diterangkan keadaan orang kafir di akhirat ketika menerima catatan amal perbuatan yang mereka kerjakan selama hidup di dunia. Kepada mereka disampaikan catatan amal perbuatannya dari sebelah kiri dan menerimanya dengan tangan kiri. Setelah membaca catatan itu, timbullah ketakutan dalam hatinya karena berdasarkan catatan itu, ia pasti dimasukkan ke dalam neraka. Ia berkata, \"Alangkah jeleknya perbuatanku dan alangkah bahagianya aku seandainya amalku yang berisi seperti ini tidak diberikan kepadaku, aku tidak menyangka bahwa semua perbuatanku di dunia tercatat dalam kitab ini.\"\n\nOrang kafir berada dalam ketakutan yang luar biasa ketika menerima catatan amalnya, seakan-akan telah ditimpa azab yang dahsyat. Padahal mereka belum ditimpa azab tersebut. Hal ini memberi pengertian bahwa azab rohani itu lebih berat dari azab jasmani.",
      "text_translation": "Dan adapun orang yang kitabnya diberikan di tangan kirinya, maka dia berkata, “Alangkah baiknya jika kitabku (ini) tidak diberikan kepadaku.",
      "text": "وَاَمَّا مَنْ اُوْتِيَ كِتٰبَهٗ بِشِمَالِهٖ ەۙ فَيَقُوْلُ يٰلَيْتَنِيْ لَمْ اُوْتَ كِتٰبِيَهْۚ",
      "text_translation_en": "But as for him whose record shall be placed in his left hand, he will exclaim: \"Oh, would that I had never been shown this my record,",
      "juz_number": 29
    },
    "26": {
      "text_tafsir_en": "The statement that the spiritual torment was felt more than the physical torment was reinforced by the words of those infidels, \"How blessed would I be if I did not know my deeds, so that I would not know what torment would befall me in hell!\"",
      "text_tafsir": "Pernyataan bahwa azab rohani lebih berat dirasakan dari azab jasmani diperkuat oleh perkataan orang-orang kafir itu, \"Alangkah bahagianya aku, jika aku tidak mengetahui catatan amalku, sehingga aku tidak mengetahui azab yang akan ditimpakan kepadaku nanti di dalam neraka.\"",
      "text_translation": "Sehingga aku tidak mengetahui bagaimana perhitunganku. ",
      "text": "وَلَمْ اَدْرِ مَا حِسَابِيَهْۚ",
      "text_translation_en": "and neither known this my account!",
      "juz_number": 29
    },
    "27": {
      "text_tafsir_en": "This verse seems to imply that the infidel did not know at all that the Day of Judgment would occur, that there would be life after death, which at that time was good deeds in return for the double reward of evil deeds being inflicted with painful torment. Therefore, they say, \"It would have been better if death had touched me in the world before, it was the end of my whole life, never to be resurrected as it is now, so that I would not have to suffer so much.\" But in fact the unbelievers knew for sure as long as they lived in the world that this day would come. This is the nature of the unbelievers who always reject their beliefs. And (remember) when your Lord brought forth the offspring (spine) of Adam's grandsons of their offspring and God took testimony of their souls (saying), \"Am I not your God?\" They replied, \"Yes, you are our witness.\" So that on the Day of Judgment you will not say, \"Surely we are watching over this.\" (al-A'raf \/ 7: 172) They expect their affairs to end with death, only for fear of being tortured, not for not knowing that there will be a Day of Resurrection and a day of mourning.",
      "text_tafsir": "Ayat ini seakan-akan memberi pengertian bahwa orang kafir itu tidak mengetahui sedikit pun bahwa akan terjadi hari Kiamat, akan terjadi kehidupan setelah mati, yang waktu itu amal baik dibalas pahala yang berlipat ganda sedang perbuatan jahat dibalasi dengan siksa yang pedih. Oleh karena itu, mereka berkata, \"Alangkah baiknya seandainya mati yang telah menimpa diriku di dunia dahulu, merupakan akhir seluruh kehidupanku, tidak dibangkitkan lagi seperti sekarang, sehingga aku tidak menemui penderitaan yang berat.\"\n\nTetapi sebenarnya orang kafir itu telah mengetahui dengan yakin selama mereka hidup di dunia akan adanya hari seperti ini. Memang demikianlah sifat-sifat orang kafir yang selalu mengingkari keyakinan mereka. \n\nDan (ingatlah) ketika Tuhanmu mengeluarkan dari sulbi (tulang belakang) anak cucu Adam keturunan mereka dan Allah mengambil kesaksian terhadap roh mereka (seraya berfirman), \"Bukankah Aku ini Tuhanmu?\" Mereka menjawab, \"Betul (Engkau Tuhan kami), kami bersaksi.\" (Kami lakukan yang demikian itu) agar di hari Kiamat kamu tidak mengatakan, \"Sesungguhnya ketika itu kami lengah terhadap ini.\" (al-A'raf\/7: 172)\n\nMereka mengharapkan urusan mereka selesai semua dengan kematian, semata-mata karena takut disiksa, bukan karena tidak mengetahui bahwa akan ada hari Kiamat dan hari penghisaban.",
      "text_translation": "Wahai, kiranya (kematian) itulah yang menyudahi segala sesuatu. ",
      "text": "يٰلَيْتَهَا كَانَتِ الْقَاضِيَةَۚ",
      "text_translation_en": "Oh, would that this [death of mine] had been the end of me!",
      "juz_number": 29
    },
    "28": {
      "text_tafsir_en": "This verse explains the way the unbelievers think about living in the world. According to them, what determines a person's circumstances and degrees is their rank, power, and wealth. With wealth, they will be able to get everything they want, and with rank and power, they can satisfy their passions. After being in the hereafter, it was clear to them that such a way of thinking was wrong, so that they also spoke in their mouths by saying, \"The treasure that I had in the past cannot help and save me from the torment of God. I have had it in the world at the present time, and I have no helper. \" The notion of the unbelievers of the time of the world that determines these things is wealth and power is described in the word of God: And having great wealth, he said to his friend (who believed) when he spoke with him, \"I mean more than your wealth and my followers are stronger. \" (al-Kahf \/ 18: 34) And they said, \"We have more wealth and children (than you) and we will not be punished.\" (Saba '\/ 34: 35)",
      "text_tafsir": "Ayat ini menerangkan tentang jalan pikiran orang kafir sewaktu hidup di dunia. Menurut mereka, yang menentukan keadaan dan derajat seseorang ialah pangkat, kekuasaan, dan harta. Dengan harta, mereka akan dapat memperoleh segala yang diinginkan, dan dengan pangkat dan kekuasaan, mereka dapat memuaskan hawa nafsu. Setelah berada di akhirat, jelaslah bagi mereka kekeliruan jalan pikiran semacam itu, sehingga terucap juga di mulut mereka perasaan hati waktu itu dengan mengatakan, \"Harta yang aku miliki waktu berada di dunia dahulu tidak dapat menolong dan menghindarkanku dari siksa Allah. Demikian pula kekuasaan yang telah aku miliki di dunia telah lenyap pada saat ini, sehingga aku tidak mempunyai seorang penolong pun.\"\n\nAnggapan orang kafir waktu di dunia bahwa yang menentukan segala sesuatu itu adalah harta dan kekuasaan diterangkan dalam firman Allah: \n\nDan dia memiliki kekayaan besar, maka dia berkata kepada kawannya (yang beriman) ketika bercakap-cakap dengan dia, \"Hartaku lebih banyak daripada hartamu dan pengikutku lebih kuat.\" (al-Kahf\/18: 34)\n\nDan mereka berkata, \"Kami memiliki lebih banyak harta dan anak-anak (daripada kamu) dan kami tidak akan diazab.\" (Saba'\/34: 35)",
      "text_translation": "Hartaku sama sekali tidak berguna bagiku. ",
      "text": "مَآ اَغْنٰى عَنِّيْ مَالِيَهْۚ ",
      "text_translation_en": "Of no avail to me is all that I have [ever] possessed,",
      "juz_number": 29
    },
    "29": {
      "text_tafsir_en": "This verse explains the way the unbelievers think about living in the world. According to them, what determines a person's circumstances and degrees is their rank, power, and wealth. With wealth, they will be able to get everything they want, and with rank and power, they can satisfy their passions. After being in the hereafter, it was clear to them that such a way of thinking was wrong, so that they also spoke in their mouths by saying, \"The treasure that I had in the past cannot help and save me from the torment of God. I have had it in the world at the present time, and I have no helper. \" The notion of the unbelievers of the time of the world that determines these things is wealth and power is described in the word of God: And having great wealth, he said to his friend (who believed) when he spoke with him, \"I mean more than your wealth and my followers are stronger. \" (al-Kahf \/ 18: 34) And they said, \"We have more wealth and children (than you) and we will not be punished.\" (Saba '\/ 34: 35)",
      "text_tafsir": "Ayat ini menerangkan tentang jalan pikiran orang kafir sewaktu hidup di dunia. Menurut mereka, yang menentukan keadaan dan derajat seseorang ialah pangkat, kekuasaan, dan harta. Dengan harta, mereka akan dapat memperoleh segala yang diinginkan, dan dengan pangkat dan kekuasaan, mereka dapat memuaskan hawa nafsu. Setelah berada di akhirat, jelaslah bagi mereka kekeliruan jalan pikiran semacam itu, sehingga terucap juga di mulut mereka perasaan hati waktu itu dengan mengatakan, \"Harta yang aku miliki waktu berada di dunia dahulu tidak dapat menolong dan menghindarkanku dari siksa Allah. Demikian pula kekuasaan yang telah aku miliki di dunia telah lenyap pada saat ini, sehingga aku tidak mempunyai seorang penolong pun.\"\n\nAnggapan orang kafir waktu di dunia bahwa yang menentukan segala sesuatu itu adalah harta dan kekuasaan diterangkan dalam firman Allah: \n\nDan dia memiliki kekayaan besar, maka dia berkata kepada kawannya (yang beriman) ketika bercakap-cakap dengan dia, \"Hartaku lebih banyak daripada hartamu dan pengikutku lebih kuat.\" (al-Kahf\/18: 34)\n\nDan mereka berkata, \"Kami memiliki lebih banyak harta dan anak-anak (daripada kamu) dan kami tidak akan diazab.\" (Saba'\/34: 35)",
      "text_translation": "Kekuasaanku telah hilang dariku.”",
      "text": "هَلَكَ عَنِّيْ سُلْطٰنِيَهْۚ",
      "text_translation_en": "[and] all my power of argument has died away from me!\"",
      "juz_number": 29
    },
    "30": {
      "text_tafsir_en": "Because of the attitude of the unbelievers and according to the record of their deeds, God ordered the angels to execute the punishment on the unbelievers. At the time of the Resurrection, they were in a state of suffering, humiliation, and could not escape any such situation. In fact, the torment was further enhanced by their imprisonment. It makes sense that the infidels in hell have no way of alleviating and alleviating that painful torment.",
      "text_tafsir": "Karena sikap orang kafir yang demikian dan berdasarkan catatan amalnya, maka Allah memerintahkan malaikat untuk melaksanakan hukuman kepada orang kafir itu. Pada waktu Kiamat, mereka dalam keadaan menderita, terhina, dan tidak dapat melepaskan diri sedikit pun dari keadaan yang demikian. Bahkan, azab itu ditambah lagi dengan membelenggu mereka. Hal ini memberi pengertian bahwa orang kafir di dalam neraka tidak mempunyai satu cara pun untuk mengurangi dan meringankan rasa azab yang pedih itu.",
      "text_translation": "(Allah berfirman), “Tangkaplah dia lalu belenggulah tangannya ke lehernya.” ",
      "text": "خُذُوْهُ فَغُلُّوْهُۙ",
      "text_translation_en": "Thereupon the command will go forth:] \"Lay hold of him, and shackle him,",
      "juz_number": 29
    },
    "31": {
      "text_tafsir_en": "Because of the attitude of the unbelievers and according to the record of their deeds, God ordered the angels to execute the punishment on the unbelievers. At the time of the Resurrection, they were in a state of suffering, humiliation, and could not escape any such situation. In fact, the torment was further enhanced by their imprisonment. It makes sense that the infidels in hell have no way of alleviating and alleviating that painful torment.",
      "text_tafsir": "Karena sikap orang kafir yang demikian dan berdasarkan catatan amalnya, maka Allah memerintahkan malaikat untuk melaksanakan hukuman kepada orang kafir itu. Pada waktu Kiamat, mereka dalam keadaan menderita, terhina, dan tidak dapat melepaskan diri sedikit pun dari keadaan yang demikian. Bahkan, azab itu ditambah lagi dengan membelenggu mereka. Hal ini memberi pengertian bahwa orang kafir di dalam neraka tidak mempunyai satu cara pun untuk mengurangi dan meringankan rasa azab yang pedih itu.",
      "text_translation": "Kemudian masukkanlah dia ke dalam api neraka yang menyala-nyala. ",
      "text": "ثُمَّ الْجَحِيْمَ صَلُّوْهُۙ",
      "text_translation_en": "and then let him enter hell,",
      "juz_number": 29
    },
    "32": {
      "text_tafsir_en": "Because of the attitude of the unbelievers and according to the record of their deeds, God ordered the angels to execute the punishment on the unbelievers. At the time of the Resurrection, they were in a state of suffering, humiliation, and could not escape any such situation. In fact, the torment was further enhanced by their imprisonment. It makes sense that the infidels in hell have no way of alleviating and alleviating that painful torment.",
      "text_tafsir": "Karena sikap orang kafir yang demikian dan berdasarkan catatan amalnya, maka Allah memerintahkan malaikat untuk melaksanakan hukuman kepada orang kafir itu. Pada waktu Kiamat, mereka dalam keadaan menderita, terhina, dan tidak dapat melepaskan diri sedikit pun dari keadaan yang demikian. Bahkan, azab itu ditambah lagi dengan membelenggu mereka. Hal ini memberi pengertian bahwa orang kafir di dalam neraka tidak mempunyai satu cara pun untuk mengurangi dan meringankan rasa azab yang pedih itu.",
      "text_translation": "Kemudian belitlah dia dengan rantai yang panjangnya tujuh puluh hasta. ",
      "text": "ثُمَّ فِيْ سِلْسِلَةٍ ذَرْعُهَا سَبْعُوْنَ ذِرَاعًا فَاسْلُكُوْهُۗ",
      "text_translation_en": "and then thrust him into a chain [of other sinners like him - a chain] the length whereof is seventy cubits:",
      "juz_number": 29
    },
    "33": {
      "text_tafsir_en": "The cause of the infidels was met with a very painful torment was that besides associating with Allah, they were the leaders of the infidels who were leading the disbelievers, and did not encourage themselves and others to feed the poor. It is also mentioned in this verse the need to feed the poor after believing in God. This shows how high the value of the act of feeding the poor is before God, so in his other words it is stated that the one who does not feed the poor is the one who rejects religion. Do you know (people) who reject religion? So it is he who rebukes the orphan, and does not encourage the feeding of the poor. (al-Ma'un \/ 107: 1-3) In other words, it can be said that the mark of those who truly believe in God is to help the poor, because it is an improvement of their faith.",
      "text_tafsir": "Penyebab orang kafir ditimpa azab yang sangat pedih adalah karena selain mempersekutukan Allah, mereka adalah para pemuka dari kaum kafir yang mempelopori kekafiran, dan tidak mendorong dirinya dan orang lain untuk memberi makan fakir miskin.\n\nDisebutkan juga dalam ayat ini keharusan memberi makan fakir-miskin setelah beriman kepada Allah. Hal ini menunjukkan betapa tingginya nilai perbuatan memberi makan fakir-miskin di sisi Allah, sehingga dalam firman-Nya yang lain dinyatakan bahwa orang yang tidak memberi makan fakir-miskin adalah orang yang mendustakan agama.\n\nTahukah kamu (orang) yang mendustakan agama? Maka itulah orang yang menghardik anak yatim, dan tidak mendorong memberi makan orang miskin. (al-Ma'un\/107: 1-3)\n\nDengan perkataan lain dapat dikatakan bahwa tanda orang yang benar-benar beriman kepada Allah ialah senang membantu orang-orang fakir-miskin, karena usaha itu merupakan peningkatan dari imannya.",
      "text_translation": "Sesungguhnya dialah orang yang tidak beriman kepada Allah Yang Mahabesar. ",
      "text": "اِنَّهٗ كَانَ لَا يُؤْمِنُ بِاللّٰهِ الْعَظِيْمِۙ",
      "text_translation_en": "for, behold, he did not believe in God, the Tremendous,",
      "juz_number": 29
    },
    "34": {
      "text_tafsir_en": "The cause of the infidels was met with a very painful torment was that besides associating with Allah, they were the leaders of the infidels who were leading the disbelievers, and did not encourage themselves and others to feed the poor. It is also mentioned in this verse the need to feed the poor after believing in God. This shows how high the value of the act of feeding the poor is before God, so in his other words it is stated that the one who does not feed the poor is the one who rejects religion. Do you know (people) who reject religion? So it is he who rebukes the orphan, and does not encourage the feeding of the poor. (al-Ma'un \/ 107: 1-3) In other words, it can be said that the mark of those who truly believe in God is to help the poor, because it is an improvement of their faith.",
      "text_tafsir": "Penyebab orang kafir ditimpa azab yang sangat pedih adalah karena selain mempersekutukan Allah, mereka adalah para pemuka dari kaum kafir yang mempelopori kekafiran, dan tidak mendorong dirinya dan orang lain untuk memberi makan fakir miskin.\n\nDisebutkan juga dalam ayat ini keharusan memberi makan fakir-miskin setelah beriman kepada Allah. Hal ini menunjukkan betapa tingginya nilai perbuatan memberi makan fakir-miskin di sisi Allah, sehingga dalam firman-Nya yang lain dinyatakan bahwa orang yang tidak memberi makan fakir-miskin adalah orang yang mendustakan agama.\n\nTahukah kamu (orang) yang mendustakan agama? Maka itulah orang yang menghardik anak yatim, dan tidak mendorong memberi makan orang miskin. (al-Ma'un\/107: 1-3)\n\nDengan perkataan lain dapat dikatakan bahwa tanda orang yang benar-benar beriman kepada Allah ialah senang membantu orang-orang fakir-miskin, karena usaha itu merupakan peningkatan dari imannya.",
      "text_translation": "Dan juga dia tidak mendorong (orang lain) untuk memberi makan orang miskin. ",
      "text": "وَلَا يَحُضُّ عَلٰى طَعَامِ الْمِسْكِيْنِۗ",
      "text_translation_en": "and did not feel any urge to feed the needy:",
      "juz_number": 29
    },
    "35": {
      "text_tafsir_en": "In this verse it describes the state of the unbelievers in hell: 1. They have no friend or helper. As it is known that man is a social being. A happy human life is when they are able to meet their personal interests and the importance of living in a community. If in the natural world, humans are in danger of living alone, then in the hereafter they will suffer more. 2. Their food is blood and pus, a food that people do not eat while living in the world.",
      "text_tafsir": "Dalam ayat ini diterangkan keadaan orang musyrik di dalam neraka:\n\n1.Mereka tidak mempunyai seorang pun teman atau penolong. Sebagaimana diketahui bahwa manusia itu adalah makhluk sosial. Hidup manusia yang berbahagia adalah jika mereka dapat memenuhi kepentingan pribadinya dan kepentingan hidup dalam pergaulan bermasyarakat. Jika di dunia dalam keadaan biasa, manusia merasa tersiksa hidup sendirian, tentu di akhirat akan lebih tersiksa lagi.\n\n2.Makanan mereka adalah darah dan nanah, suatu makanan yang tidak termakan oleh orang ketika hidup di dunia.",
      "text_translation": "Maka pada hari ini di sini tidak ada seorang teman pun baginya. ",
      "text": "فَلَيْسَ لَهُ الْيَوْمَ هٰهُنَا حَمِيْمٌۙ",
      "text_translation_en": "and so, no friend has here today,",
      "juz_number": 29
    },
    "36": {
      "text_tafsir_en": "In this verse it describes the state of the unbelievers in hell: 1. They have no friend or helper. As it is known that man is a social being. A happy human life is when they are able to meet their personal interests and the importance of living in a community. If in the natural world, humans are in danger of living alone, then in the hereafter they will suffer more. 2. Their food is blood and pus, a food that people do not eat while living in the world.",
      "text_tafsir": "Dalam ayat ini diterangkan keadaan orang musyrik di dalam neraka:\n\n1.Mereka tidak mempunyai seorang pun teman atau penolong. Sebagaimana diketahui bahwa manusia itu adalah makhluk sosial. Hidup manusia yang berbahagia adalah jika mereka dapat memenuhi kepentingan pribadinya dan kepentingan hidup dalam pergaulan bermasyarakat. Jika di dunia dalam keadaan biasa, manusia merasa tersiksa hidup sendirian, tentu di akhirat akan lebih tersiksa lagi.\n\n2.Makanan mereka adalah darah dan nanah, suatu makanan yang tidak termakan oleh orang ketika hidup di dunia.",
      "text_translation": "Dan tidak ada makanan (baginya) kecuali dari darah dan nanah. ",
      "text": "وَّلَا طَعَامٌ اِلَّا مِنْ غِسْلِيْنٍۙ",
      "text_translation_en": "nor any food save the filth",
      "juz_number": 29
    },
    "37": {
      "text_tafsir_en": "The food that the infidel ate, consisting of blood and pus, was a very disgusting food and was not eaten by anyone. This shows the depiction of a hellish life.",
      "text_tafsir": "Makanan yang dimakan oleh orang kafir itu, yang terdiri dari darah dan nanah, adalah makanan yang sangat jijik dan tiada termakan oleh siapa pun. Hal ini menunjukkan gambaran kehidupan neraka yang penuh kehinaan.",
      "text_translation": "Tidak ada yang memakannya kecuali orang-orang yang berdosa. ",
      "text": "لَّا يَأْكُلُهٗٓ اِلَّا الْخَاطِـُٔوْنَ ࣖ ",
      "text_translation_en": "which none but the sinners eat!\"",
      "juz_number": 29
    },
    "38": {
      "text_tafsir_en": "According to the Muqatil that these verses were revealed in connection with the attitude of the Quraysh listeners when they read the Qur'anic verses, such as al-Walid bin al-Mugirah's saying that Muhammad was a sorcerer, Abu Jahal said that Muhammad was a poet, and the words' Say that Muhammad was a sorcerer. This verse contradicts those words. Allah affirms to the Meccan monks by swearing with His creatures, whether they are visible, known, and sensible or not, that the Qur'an revealed to Muhammad is a revelation from Him. The Qur'an is not the word of Muhammad or the word that Muhammad invented then is the word of God. From the word bimusunun (all that you see) it can be understood that indeed the Meccans must be able to convince them that the Qur'an is from God, not Muhammad's. This is based on their knowledge, such as knowledge of Muhammad, knowledge of the language and beauty of the Arabic language contained in the Qur'an, and the content of the Qur'an itself. Then from the words \"wama la tubsirun\" (and what you do not see) it is understood that many things are unknown to Mecca. If they had known this, they would have increased their confidence and confidence in Muhammad.",
      "text_tafsir": "Menurut Muqatil bahwa ayat-ayat ini diturunkan berhubungan dengan sikap para pemuka Quraisy ketika mendengar bacaan ayat-ayat Al-Qur'an, seperti perkataan al-Walid bin al-Mugirah bahwa sesungguhnya Muhammad seorang pesihir, perkataan Abu Jahal bahwa Muhammad seorang penyair, dan perkataan 'Uqbah bahwa Muhammad seorang tukang tenung. Ayat ini membantah perkataan-perkataan itu.\n\nAllah menegaskan kepada orang musyrik Mekah dengan bersumpah dengan makhluk-Nya, baik yang dapat dilihat, diketahui, dan dirasakan dengan pancaindra maupun tidak, bahwa Al-Qur'an yang diturunkan kepada Muhammad itu benar-benar wahyu dari-Nya. Al-Qur'an bukan perkataan Muhammad atau perkataan yang diada-adakan Muhammad kemudian dikatakan sebagai firman Allah.\n\nDari perkataan bima tubsirun (segala yang dapat kamu lihat) dapat dipahami bahwa sebenarnya orang musyrik Mekah seharusnya dapat meyakinkan bahwa Al-Qur'an itu berasal dari Allah, bukan buatan Muhammad. Hal ini berdasarkan pada pengetahuan yang ada pada mereka, seperti pengetahuan tentang Muhammad, pengetahuan tentang gaya bahasa dan keindahan bahasa Arab yang terdapat dalam Al-Qur'an, dan isi Al-Qur'an itu sendiri. Kemudian dari perkataan \"wama la tubsirun\" (dan apa yang tidak kamu lihat) dipahami bahwa banyak hal yang tidak diketahui oleh orang musyrik Mekah. Jika mereka mengetahui yang demikian itu, tentu akan dapat menambah keyakinan dan kepercayaan mereka kepada Muhammad.",
      "text_translation": "Maka Aku bersumpah demi apa yang kamu lihat, ",
      "text": "فَلَآ اُقْسِمُ بِمَا تُبْصِرُوْنَۙ",
      "text_translation_en": "BUT NAY! I call to witness an that you can see,",
      "juz_number": 29
    },
    "39": {
      "text_tafsir_en": "According to the Muqatil that these verses were revealed in connection with the attitude of the Quraysh listeners when they read the Qur'anic verses, such as al-Walid bin al-Mugirah's saying that Muhammad was a sorcerer, Abu Jahal said that Muhammad was a poet, and the words' Say that Muhammad was a sorcerer. This verse contradicts those words. Allah affirms to the Meccan monks by swearing with His creatures, whether they are visible, known, and sensible or not, that the Qur'an revealed to Muhammad is a revelation from Him. The Qur'an is not the word of Muhammad or the word that Muhammad invented then is the word of God. From the word bimusunun (all that you see) it can be understood that indeed the Meccans must be able to convince them that the Qur'an is from God, not Muhammad's. This is based on their knowledge, such as knowledge of Muhammad, knowledge of the language and beauty of the Arabic language contained in the Qur'an, and the content of the Qur'an itself. Then from the words \"wama la tubsirun\" (and what you do not see) it is understood that many things are unknown to Mecca. If they had known this, they would have increased their confidence and confidence in Muhammad.",
      "text_tafsir": "Menurut Muqatil bahwa ayat-ayat ini diturunkan berhubungan dengan sikap para pemuka Quraisy ketika mendengar bacaan ayat-ayat Al-Qur'an, seperti perkataan al-Walid bin al-Mugirah bahwa sesungguhnya Muhammad seorang pesihir, perkataan Abu Jahal bahwa Muhammad seorang penyair, dan perkataan 'Uqbah bahwa Muhammad seorang tukang tenung. Ayat ini membantah perkataan-perkataan itu.\n\nAllah menegaskan kepada orang musyrik Mekah dengan bersumpah dengan makhluk-Nya, baik yang dapat dilihat, diketahui, dan dirasakan dengan pancaindra maupun tidak, bahwa Al-Qur'an yang diturunkan kepada Muhammad itu benar-benar wahyu dari-Nya. Al-Qur'an bukan perkataan Muhammad atau perkataan yang diada-adakan Muhammad kemudian dikatakan sebagai firman Allah.\n\nDari perkataan bima tubsirun (segala yang dapat kamu lihat) dapat dipahami bahwa sebenarnya orang musyrik Mekah seharusnya dapat meyakinkan bahwa Al-Qur'an itu berasal dari Allah, bukan buatan Muhammad. Hal ini berdasarkan pada pengetahuan yang ada pada mereka, seperti pengetahuan tentang Muhammad, pengetahuan tentang gaya bahasa dan keindahan bahasa Arab yang terdapat dalam Al-Qur'an, dan isi Al-Qur'an itu sendiri. Kemudian dari perkataan \"wama la tubsirun\" (dan apa yang tidak kamu lihat) dipahami bahwa banyak hal yang tidak diketahui oleh orang musyrik Mekah. Jika mereka mengetahui yang demikian itu, tentu akan dapat menambah keyakinan dan kepercayaan mereka kepada Muhammad.",
      "text_translation": "dan demi apa yang tidak kamu lihat.",
      "text": "وَمَا لَا تُبْصِرُوْنَۙ",
      "text_translation_en": "as well as all that you cannot see!",
      "juz_number": 29
    },
    "40": {
      "text_tafsir_en": "According to the Muqatil that these verses were revealed in connection with the attitude of the Quraysh listeners when they read the Qur'anic verses, such as al-Walid bin al-Mugirah's saying that Muhammad was a sorcerer, Abu Jahal said that Muhammad was a poet, and the words' Say that Muhammad was a sorcerer. This verse contradicts those words. Allah affirms to the Meccan monks by swearing with His creatures, whether they are visible, known, and sensible or not, that the Qur'an revealed to Muhammad is a revelation from Him. The Qur'an is not the word of Muhammad or the word that Muhammad invented then is the word of God. From the word bimusunun (all that you see) it can be understood that indeed the Meccans must be able to convince them that the Qur'an is from God, not Muhammad's. This is based on their knowledge, such as knowledge of Muhammad, knowledge of the language and beauty of the Arabic language contained in the Qur'an, and the content of the Qur'an itself. Then from the words \"wama la tubsirun\" (and what you do not see) it is understood that many things are unknown to Mecca. If they had known this, they would have increased their confidence and confidence in Muhammad.",
      "text_tafsir": "Menurut Muqatil bahwa ayat-ayat ini diturunkan berhubungan dengan sikap para pemuka Quraisy ketika mendengar bacaan ayat-ayat Al-Qur'an, seperti perkataan al-Walid bin al-Mugirah bahwa sesungguhnya Muhammad seorang pesihir, perkataan Abu Jahal bahwa Muhammad seorang penyair, dan perkataan 'Uqbah bahwa Muhammad seorang tukang tenung. Ayat ini membantah perkataan-perkataan itu.\n\nAllah menegaskan kepada orang musyrik Mekah dengan bersumpah dengan makhluk-Nya, baik yang dapat dilihat, diketahui, dan dirasakan dengan pancaindra maupun tidak, bahwa Al-Qur'an yang diturunkan kepada Muhammad itu benar-benar wahyu dari-Nya. Al-Qur'an bukan perkataan Muhammad atau perkataan yang diada-adakan Muhammad kemudian dikatakan sebagai firman Allah.\n\nDari perkataan bima tubsirun (segala yang dapat kamu lihat) dapat dipahami bahwa sebenarnya orang musyrik Mekah seharusnya dapat meyakinkan bahwa Al-Qur'an itu berasal dari Allah, bukan buatan Muhammad. Hal ini berdasarkan pada pengetahuan yang ada pada mereka, seperti pengetahuan tentang Muhammad, pengetahuan tentang gaya bahasa dan keindahan bahasa Arab yang terdapat dalam Al-Qur'an, dan isi Al-Qur'an itu sendiri. Kemudian dari perkataan \"wama la tubsirun\" (dan apa yang tidak kamu lihat) dipahami bahwa banyak hal yang tidak diketahui oleh orang musyrik Mekah. Jika mereka mengetahui yang demikian itu, tentu akan dapat menambah keyakinan dan kepercayaan mereka kepada Muhammad.",
      "text_translation": "Sesungguhnya ia (Al-Qur'an) itu benar-benar wahyu (yang diturunkan kepada) Rasul yang mulia,",
      "text": "اِنَّهٗ لَقَوْلُ رَسُوْلٍ كَرِيْمٍۙ",
      "text_translation_en": "Behold, this [Qur’an] is indeed the [inspired] word of a noble apostle,",
      "juz_number": 29
    },
    "41": {
      "text_tafsir_en": "The Qur'an is not as poetic as their poets often say, because the Qur'an in addition to its beautifully structured language also has deep content. The poems spoken by their poets do not have the language style as beautiful as the Quranic style and have no high meaning. There are many verses in the Qur'an that challenge Muslims to make similar or comparable to the Qur'an, but they are not able to do so. And if you doubt (the Qur'an) that We have sent down to Our servants, then make a surah with him and invite your helpers other than Allah if you are righteous. If you cannot afford it, and (surely) cannot, then fear the fire of fire which is the fuel of man and of stone, provided for the disbelievers. (al-Baqarah \/ 2: 23-24) It is further emphasized that the Qur'an is also not a word of magic. Usually a sorcerer is a devil's friend because they stare at it in the form of a demon whisper. Although the Qur'an condemns the demon's actions, thus, it is not a demon whisper nor a sorcerer. Accordingly, this verse encourages the unbelievers not to rush to conclude that the Qur'an is magic just because they do not know or understand the Qur'an. Very few of them would believe in the Qur'an at that time, and would learn a lesson from its contents. The miracle of the Qur'an lies in content. The higher a person's knowledge, the easier it is to digest his meaning, in addition to his language value. Indonesian Muslims generally find it difficult to prove and know the place of the miracle of the Qur'an in terms of language, because to know the height of the order of words must be able to feel the beauty of the style and language itself. Therefore, to know the height of the Qur'an, it is enough to know the opinions and attitudes of the Arab writers who challenge Islam against the Qur'an. Among them was Abu al-Walid, a prominent Arab leader and writer at the time. He once sent his people to the Prophet to ask him to stop his preaching. Hearing the request of Abu al-Walid, the Prophet recited Surah Fussilat \/ 41 from the first verse to the end of verse 14. Abu al-Walid was intrigued to hear the verses, so that he reflected on the beauty of his language. Then he returned to his people immediately. When asked about the outcome of the meeting, he told his people, \"I have never heard such beautiful words. What they read is not poetry, magic, or magic words. Hearing Abu al-Walid's answer, they claimed that he was exposed to the magic of Muhammad and betrayed the religion of their ancestors, among the leaders and elders of the Quraysh was al-Walid bin al-Mugirah, who had heard the Qur'anic verses that the Prophet had read (Children of Makhzum), \"I recently heard from Muhammad a saying that I do not mean by the words of man or of the spirits. The words are good to hear, good to hear, like a tree, whose fruit is good and whose ground is firm on the ground. He's really good and can't be beat. In addition to these two, many Arab writers of the time were trying to make similar Qur'anic verses, but no one was able to do so. From these two verses it is understood that very few of the Meccans have acknowledged that the Qur'an is a book that Allah sent to Muhammad, as well as a lesson from its contents. This is because: 1. They fear being excommunicated by their people by studying the Qur'an, even though their hearts and minds acknowledge it, as in Abu al-Walid and al-Walid bin al-Mugirah. 2. Some people do not know the content because they do not want to study it very hard. They first denied it.",
      "text_tafsir": "Al-Qur'an bukan syair seperti yang biasa diucapkan penyair-penyair mereka, karena Al-Qur'an di samping indah susunan gaya bahasanya juga mempunyai isi yang dalam. Syair-syair yang diucapkan para penyair mereka tidak memiliki susunan gaya bahasa seindah susunan dan gaya bahasa Al-Qur'an dan tidak mempunyai arti yang tinggi. Banyak terdapat ayat Al-Qur'an yang menantang orang musyrik agar membuat yang serupa atau sebanding dengan Al-Qur'an, tetapi mereka tidak sanggup melakukannya. \n\nDan jika kamu meragukan (Al-Qur'an) yang Kami turunkan kepada hamba Kami (Muhammad), maka buatlah satu surah semisal dengannya dan ajaklah penolong-penolongmu selain Allah, jika kamu orang-orang yang benar. Jika kamu tidak mampu membuatnya, dan (pasti) tidak akan mampu, maka takutlah kamu akan api neraka yang bahan bakarnya manusia dan batu, yang disediakan bagi orang-orang kafir. (al-Baqarah\/2: 23-24)\n\nDitegaskan pula bahwa Al-Qur'an itu juga bukan berasal dari perkataan tukang tenung. Biasanya tukang tenung teman setan karena mereka menenung itu semata-mata mencari-cari bisikan setan. Padahal Al-Qur'an mencela perbuatan setan, sehingga dengan demikian, ia bukan bisikan setan dan bukan pula hasil tukang tenung. Sehubungan dengan itu, ayat ini menyanggah orang-orang musyrik agar tidak buru-buru berkesimpulan bahwa Al-Qur'an itu adalah tenung hanya karena belum atau tidak mengetahui isi Al-Qur'an. Sangat sedikit di antara mereka yang mau beriman kepada Al-Qur'an ketika itu, dan mau mengambil pelajaran dari isinya. Mukjizat Qur'an terletak pada isi. Makin tinggi ilmu pengetahuan seseorang, akan makin mudah mencerna maksudnya, di samping nilai bahasanya.\n\nUmat Islam Indonesia pada umumnya kesulitan membuktikan dan mengetahui letak kemukjizatan Al-Qur'an dari segi bahasa, karena untuk mengetahui ketinggian susunan kata-kata haruslah dapat merasakan keindahan gaya dan bahasa itu sendiri. Oleh karena itu, untuk mengetahui ketinggian Al-Qur'an, cukup dengan mengetahui pendapat dan sikap para sastrawan Arab penantang Islam terhadap Al-Qur'an itu. Di antaranya adalah Abu al-Walid, yaitu seorang pemimpin dan sastrawan Arab yang terkenal pada masa itu. Ia pernah diutus kaumnya kepada Nabi saw untuk meminta beliau menghentikan dakwahnya. Mendengar permintaan Abu al-Walid itu, Nabi saw membaca Surah Fussilat\/41 dari ayat pertama hingga akhir ayat 14. Abu al-Walid terpesona mendengar ayat-ayat itu, sehingga ia termenung memikirkan keindahan gaya bahasanya. Lalu ia langsung kembali kepada kaumnya. Ketika ditanya tentang hasil pertemuan itu, ia mengatakan kepada kaumnya, \"Aku belum pernah mendengar kata-kata yang seindah itu. Apa yang dibaca itu bukanlah syair, sihir, atau kata-kata ahli tenung. Mendengar jawaban Abu al-Walid, mereka menuduh bahwa ia telah terkena sihir oleh Muhammad dan berkhianat kepada agama nenek moyang mereka. Di antara pemuka dan sesepuh Quraisy adalah al-Walid bin al-Mugirah. Orang ini pernah mendengar ayat-ayat Al-Qur'an yang dibacakan Nabi. Maka ia berkata kepada kaumnya (Bani Makhzum), \"Baru-baru ini aku mendengar dari Muhammad suatu ucapan yang menurutku bukanlah perkataan manusia atau jin. Ucapan itu enak didengar, bagus disimak, laksana sebatang pohon, yang atasnya berbuah, dan bawahnya terhunjam ke tanah. Dia benar-benar unggul dan tidak akan dapat diungguli. Di samping dua orang tersebut, banyak juga sastrawan Arab pada waktu itu yang mencoba membuat yang serupa ayat-ayat Al-Qur'an , tetapi tidak seorang pun yang sanggup melakukannya.\n\nDari kedua ayat ini dapat dipahami bahwa sangat sedikit di antara kaum musyrik Mekah yang mengakui bahwa Al-Qur'an adalah kitab yang diturunkan Allah kepada Muhammad, begitu juga yang mengambil pelajaran dari isinya. Yang demikian itu adalah karena:\n\n1.Mereka takut dikucilkan oleh kaumnya dengan mempelajari Al-Qur'an, walaupun hati dan pikiran mereka telah mengakuinya, seperti halnya pada Abu al-Walid dan al-Walid bin al-Mugirah.\n\n2.Sebahagian mereka tidak mengetahui isinya karena tidak mau mempelajarinya dengan sungguh-sungguh. Mereka lebih dahulu mendustakannya.",
      "text_translation": "dan ia (Al-Qur'an) bukanlah perkataan seorang penyair. Sedikit sekali kamu beriman kepadanya. ",
      "text": "وَّمَا هُوَ بِقَوْلِ شَاعِرٍۗ قَلِيْلًا مَّا تُؤْمِنُوْنَۙ",
      "text_translation_en": "and is not – however little you may [be prepared to] believe it - the word of a poet;",
      "juz_number": 29
    },
    "42": {
      "text_tafsir_en": "The Qur'an is not as poetic as their poets often say, because the Qur'an in addition to its beautifully structured language also has deep content. The poems spoken by their poets do not have the language style as beautiful as the Quranic style and have no high meaning. There are many verses in the Qur'an that challenge Muslims to make similar or comparable to the Qur'an, but they are not able to do so. And if you doubt (the Qur'an) that We have sent down to Our servants, then make a surah with him and invite your helpers other than Allah if you are righteous. If you cannot afford it, and (surely) cannot, then fear the fire of fire which is the fuel of man and of stone, provided for the disbelievers. (al-Baqarah \/ 2: 23-24) It is further emphasized that the Qur'an is also not a word of magic. Usually a sorcerer is a devil's friend because they stare at it in the form of a demon whisper. Although the Qur'an condemns the demon's actions, thus, it is not a demon whisper nor a sorcerer. Accordingly, this verse encourages the unbelievers not to rush to conclude that the Qur'an is magic just because they do not know or understand the Qur'an. Very few of them would believe in the Qur'an at that time, and would learn a lesson from its contents. The miracle of the Qur'an lies in content. The higher a person's knowledge, the easier it is to digest his meaning, in addition to his language value. Indonesian Muslims generally find it difficult to prove and know the place of the miracle of the Qur'an in terms of language, because to know the height of the order of words must be able to feel the beauty of the style and language itself. Therefore, to know the height of the Qur'an, it is enough to know the opinions and attitudes of the Arab writers who challenge Islam against the Qur'an. Among them was Abu al-Walid, a prominent Arab leader and writer at the time. He once sent his people to the Prophet to ask him to stop his preaching. Hearing the request of Abu al-Walid, the Prophet recited Surah Fussilat \/ 41 from the first verse to the end of verse 14. Abu al-Walid was intrigued to hear the verses, so that he reflected on the beauty of his language. Then he returned to his people immediately. When asked about the outcome of the meeting, he told his people, \"I have never heard such beautiful words. What they read is not poetry, magic, or magic words. Hearing Abu al-Walid's answer, they claimed that he was exposed to the magic of Muhammad and betrayed the religion of their ancestors, among the leaders and elders of the Quraysh was al-Walid bin al-Mugirah, who had heard the Qur'anic verses that the Prophet had read (Children of Makhzum), \"I recently heard from Muhammad a saying that I do not mean by the words of man or of the spirits. The words are good to hear, good to hear, like a tree, whose fruit is good and whose ground is firm on the ground. He's really good and can't be beat. In addition to these two, many Arab writers of the time were trying to make similar Qur'anic verses, but no one was able to do so. From these two verses it is understood that very few of the Meccans have acknowledged that the Qur'an is a book that Allah sent to Muhammad, as well as a lesson from its contents. This is because: 1. They fear being excommunicated by their people by studying the Qur'an, even though their hearts and minds acknowledge it, as in Abu al-Walid and al-Walid bin al-Mugirah. 2. Some people do not know the content because they do not want to study it very hard. They first denied it.",
      "text_tafsir": "Al-Qur'an bukan syair seperti yang biasa diucapkan penyair-penyair mereka, karena Al-Qur'an di samping indah susunan gaya bahasanya juga mempunyai isi yang dalam. Syair-syair yang diucapkan para penyair mereka tidak memiliki susunan gaya bahasa seindah susunan dan gaya bahasa Al-Qur'an dan tidak mempunyai arti yang tinggi. Banyak terdapat ayat Al-Qur'an yang menantang orang musyrik agar membuat yang serupa atau sebanding dengan Al-Qur'an, tetapi mereka tidak sanggup melakukannya. \n\nDan jika kamu meragukan (Al-Qur'an) yang Kami turunkan kepada hamba Kami (Muhammad), maka buatlah satu surah semisal dengannya dan ajaklah penolong-penolongmu selain Allah, jika kamu orang-orang yang benar. Jika kamu tidak mampu membuatnya, dan (pasti) tidak akan mampu, maka takutlah kamu akan api neraka yang bahan bakarnya manusia dan batu, yang disediakan bagi orang-orang kafir. (al-Baqarah\/2: 23-24)\n\nDitegaskan pula bahwa Al-Qur'an itu juga bukan berasal dari perkataan tukang tenung. Biasanya tukang tenung teman setan karena mereka menenung itu semata-mata mencari-cari bisikan setan. Padahal Al-Qur'an mencela perbuatan setan, sehingga dengan demikian, ia bukan bisikan setan dan bukan pula hasil tukang tenung. Sehubungan dengan itu, ayat ini menyanggah orang-orang musyrik agar tidak buru-buru berkesimpulan bahwa Al-Qur'an itu adalah tenung hanya karena belum atau tidak mengetahui isi Al-Qur'an. Sangat sedikit di antara mereka yang mau beriman kepada Al-Qur'an ketika itu, dan mau mengambil pelajaran dari isinya. Mukjizat Qur'an terletak pada isi. Makin tinggi ilmu pengetahuan seseorang, akan makin mudah mencerna maksudnya, di samping nilai bahasanya.\n\nUmat Islam Indonesia pada umumnya kesulitan membuktikan dan mengetahui letak kemukjizatan Al-Qur'an dari segi bahasa, karena untuk mengetahui ketinggian susunan kata-kata haruslah dapat merasakan keindahan gaya dan bahasa itu sendiri. Oleh karena itu, untuk mengetahui ketinggian Al-Qur'an, cukup dengan mengetahui pendapat dan sikap para sastrawan Arab penantang Islam terhadap Al-Qur'an itu. Di antaranya adalah Abu al-Walid, yaitu seorang pemimpin dan sastrawan Arab yang terkenal pada masa itu. Ia pernah diutus kaumnya kepada Nabi saw untuk meminta beliau menghentikan dakwahnya. Mendengar permintaan Abu al-Walid itu, Nabi saw membaca Surah Fussilat\/41 dari ayat pertama hingga akhir ayat 14. Abu al-Walid terpesona mendengar ayat-ayat itu, sehingga ia termenung memikirkan keindahan gaya bahasanya. Lalu ia langsung kembali kepada kaumnya. Ketika ditanya tentang hasil pertemuan itu, ia mengatakan kepada kaumnya, \"Aku belum pernah mendengar kata-kata yang seindah itu. Apa yang dibaca itu bukanlah syair, sihir, atau kata-kata ahli tenung. Mendengar jawaban Abu al-Walid, mereka menuduh bahwa ia telah terkena sihir oleh Muhammad dan berkhianat kepada agama nenek moyang mereka. Di antara pemuka dan sesepuh Quraisy adalah al-Walid bin al-Mugirah. Orang ini pernah mendengar ayat-ayat Al-Qur'an yang dibacakan Nabi. Maka ia berkata kepada kaumnya (Bani Makhzum), \"Baru-baru ini aku mendengar dari Muhammad suatu ucapan yang menurutku bukanlah perkataan manusia atau jin. Ucapan itu enak didengar, bagus disimak, laksana sebatang pohon, yang atasnya berbuah, dan bawahnya terhunjam ke tanah. Dia benar-benar unggul dan tidak akan dapat diungguli. Di samping dua orang tersebut, banyak juga sastrawan Arab pada waktu itu yang mencoba membuat yang serupa ayat-ayat Al-Qur'an , tetapi tidak seorang pun yang sanggup melakukannya.\n\nDari kedua ayat ini dapat dipahami bahwa sangat sedikit di antara kaum musyrik Mekah yang mengakui bahwa Al-Qur'an adalah kitab yang diturunkan Allah kepada Muhammad, begitu juga yang mengambil pelajaran dari isinya. Yang demikian itu adalah karena:\n\n1.Mereka takut dikucilkan oleh kaumnya dengan mempelajari Al-Qur'an, walaupun hati dan pikiran mereka telah mengakuinya, seperti halnya pada Abu al-Walid dan al-Walid bin al-Mugirah.\n\n2.Sebahagian mereka tidak mengetahui isinya karena tidak mau mempelajarinya dengan sungguh-sungguh. Mereka lebih dahulu mendustakannya.",
      "text_translation": "Dan bukan pula perkataan tukang tenung. Sedikit sekali kamu mengambil pelajaran darinya. ",
      "text": "وَلَا بِقَوْلِ كَاهِنٍۗ قَلِيْلًا مَّا تَذَكَّرُوْنَۗ",
      "text_translation_en": "and neither is it - however little you may [be prepared to] take it to heart - the word of a soothsayer:",
      "juz_number": 29
    },
    "43": {
      "text_tafsir_en": "The Qur'an really comes from God the Creator, the Provider, the Guardian and the Master of the universe.",
      "text_tafsir": "Al-Qur'an benar-benar berasal dari Tuhan Maha Pencipta, Maha Pengatur, Maha Penjaga dan Maha Menguasai seluruh alam.",
      "text_translation": "Ia (Al-Qur'an) adalah wahyu yang diturunkan dari Tuhan seluruh alam. ",
      "text": "تَنْزِيْلٌ مِّنْ رَّبِّ الْعٰلَمِيْنَ ",
      "text_translation_en": "[it is] a revelation from the Sustainer of all the worlds.",
      "juz_number": 29
    },
    "44": {
      "text_tafsir_en": "Both of these verses affirm that the Qur'an is actually from God, not made by Muhammad, a poet, or a sorcerer, because no human being can make such verses. Allah asserted that if Prophet Muhammad had said something about him and had spoken the word he had spoken from him, even though he had never said or said it, Allah would have held his right hand to receive his punishment. For Allah is not heavy and difficult to punish with a very great punishment, for He is Almighty over all things. The phrase \"hold the right hand\" (al-akhdhu bil yamin) in this verse is an expression for an act committed against a person who is under one's control, with the intent of punishing that person. Like a king who punishes a rebel. In this verse, the phrase is used to state that for Allah there is no objection to take action against Muhammad, if he does something wrong to him. It was a punishment for the Prophet, no matter how severe the punishment. This verse also implies that if the Qur'an was made by Muhammad, it would be rejected by man and he would fail in carrying out his preaching. The fact is, on the contrary, Muhammad was accepted by the believers because they believed the truth of the Qur'an. And it turns out that Islam is growing more and more.",
      "text_tafsir": "Kedua ayat ini menegaskan bahwa Al-Qur'an itu benar-benar berasal dari Allah, bukan buatan Muhammad, syair, atau khayalan tukang tenung, karena tidak seorang makhluk pun yang sanggup membuat seperti ayat-ayat Al-Qur'an itu. Allah menegaskan bahwa seandainya Nabi Muhammad mengatakan sesuatu tentang-Nya dan mengucapkan perkataan yang dikatakannya berasal dari-Nya, padahal Ia tidak pernah menyatakan atau mengatakannya, Allah pasti pegang tangan kanannya untuk menerima hukuman dari-Nya. Bagi Allah tidaklah berat dan sukar menghukumnya dengan hukuman yang sangat besar sekalipun, karena Ia Mahakuasa atas segala sesuatu.\n\nUngkapan \"memegang tangan kanan\" (al-akhdhu bil yamin) dalam ayat ini merupakan ungkapan untuk suatu tindakan yang dilakukan terhadap orang yang berada di bawah kekuasaan seseorang, dengan maksud memberi hukuman kepada orang itu. Contohnya seperti seorang raja yang memberikan hukuman kepada seorang pemberontak.\n\nDalam ayat ini, ungkapan tersebut dipakai untuk menyatakan bahwa bagi Allah tidak ada suatu keberatan pun untuk melakukan suatu tindakan terhadap Muhammad, kalau ia mengadakan sesuatu yang tidak benar terhadap-Nya. Hal itu sebagai hukuman bagi Nabi saw, bagaimana pun beratnya hukuman itu.\n\nAyat ini juga mengisyaratkan bahwa seandainya Al-Qur'an itu buatan Muhammad, pasti akan ditolak oleh manusia dan beliau akan gagal dalam melaksanakan dakwahnya. Kenyataan yang terjadi adalah sebaliknya, Muhammad diterima oleh orang-orang beriman karena mereka percaya akan kebenaran Al-Qur'an. Dan ternyata pula bahwa agama Islam makin hari makin berkembang.",
      "text_translation": "Dan sekiranya dia (Muhammad) mengada-adakan sebagian perkataan atas (nama) Kami, ",
      "text": "وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْاَقَاوِيْلِۙ",
      "text_translation_en": "Now if he [whom We have entrusted with it] had dared to attribute some [of his own] sayings unto Us,",
      "juz_number": 29
    },
    "45": {
      "text_tafsir_en": "Both of these verses affirm that the Qur'an is actually from God, not made by Muhammad, a poet, or a sorcerer, because no human being can make such verses. Allah asserted that if Prophet Muhammad had said something about him and had spoken the word he had spoken from him, even though he had never said or said it, Allah would have held his right hand to receive his punishment. For Allah is not heavy and difficult to punish with a very great punishment, for He is Almighty over all things. The phrase \"hold the right hand\" (al-akhdhu bil yamin) in this verse is an expression for an act committed against a person who is under one's control, with the intent of punishing that person. Like a king who punishes a rebel. In this verse, the phrase is used to state that for Allah there is no objection to take action against Muhammad, if he does something wrong to him. It was a punishment for the Prophet, no matter how severe the punishment. This verse also implies that if the Qur'an was made by Muhammad, it would be rejected by man and he would fail in carrying out his preaching. The fact is, on the contrary, Muhammad was accepted by the believers because they believed the truth of the Qur'an. And it turns out that Islam is growing more and more.",
      "text_tafsir": "Kedua ayat ini menegaskan bahwa Al-Qur'an itu benar-benar berasal dari Allah, bukan buatan Muhammad, syair, atau khayalan tukang tenung, karena tidak seorang makhluk pun yang sanggup membuat seperti ayat-ayat Al-Qur'an itu. Allah menegaskan bahwa seandainya Nabi Muhammad mengatakan sesuatu tentang-Nya dan mengucapkan perkataan yang dikatakannya berasal dari-Nya, padahal Ia tidak pernah menyatakan atau mengatakannya, Allah pasti pegang tangan kanannya untuk menerima hukuman dari-Nya. Bagi Allah tidaklah berat dan sukar menghukumnya dengan hukuman yang sangat besar sekalipun, karena Ia Mahakuasa atas segala sesuatu.\n\nUngkapan \"memegang tangan kanan\" (al-akhdhu bil yamin) dalam ayat ini merupakan ungkapan untuk suatu tindakan yang dilakukan terhadap orang yang berada di bawah kekuasaan seseorang, dengan maksud memberi hukuman kepada orang itu. Contohnya seperti seorang raja yang memberikan hukuman kepada seorang pemberontak.\n\nDalam ayat ini, ungkapan tersebut dipakai untuk menyatakan bahwa bagi Allah tidak ada suatu keberatan pun untuk melakukan suatu tindakan terhadap Muhammad, kalau ia mengadakan sesuatu yang tidak benar terhadap-Nya. Hal itu sebagai hukuman bagi Nabi saw, bagaimana pun beratnya hukuman itu.\n\nAyat ini juga mengisyaratkan bahwa seandainya Al-Qur'an itu buatan Muhammad, pasti akan ditolak oleh manusia dan beliau akan gagal dalam melaksanakan dakwahnya. Kenyataan yang terjadi adalah sebaliknya, Muhammad diterima oleh orang-orang beriman karena mereka percaya akan kebenaran Al-Qur'an. Dan ternyata pula bahwa agama Islam makin hari makin berkembang.",
      "text_translation": "pasti Kami pegang dia pada tangan kanannya. ",
      "text": "لَاَخَذْنَا مِنْهُ بِالْيَمِيْنِۙ",
      "text_translation_en": "We would indeed have seized him by his right hand,",
      "juz_number": 29
    },
    "46": {
      "text_tafsir_en": "In these two verses, the authority of God over His creatures is reaffirmed. Unless God wants to do something for His servants, no one can stop it, even if it is an act that determines one's life, such as the deciding of the heartbeat, which results in his death. The same goes for Muhammad. If he had lied to God, God would have angered him and sentenced him to death, by cutting his blood vessels. No one can prevent him from executing that sentence.",
      "text_tafsir": "Pada kedua ayat ini ditegaskan lagi kekuasaan Allah terhadap makhluk-Nya. Seandainya Allah ingin melakukan sesuatu kepada hamba-hamba-Nya, tidak seorang pun yang dapat menghalanginya, sekalipun tindakan itu adalah tindakan yang menentukan hidup-matinya seseorang, seperti tindakan memutuskan urat nadi jantungnya, yang berakibat kematiannya. Demikian pula kepada Muhammad. Seandainya dia berdusta terhadap Allah, tentu Allah akan marah kepadanya dan menghukumnya dengan hukuman mati, yaitu dengan memutus pembuluh darahnya. Tidak ada seorang pun yang dapat menghalangi-Nya dari melaksanakan hukuman itu.",
      "text_translation": "Kemudian Kami potong pembuluh jantungnya. ",
      "text": "ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِيْنَۖ",
      "text_translation_en": "and would indeed have cut his life-vein.",
      "juz_number": 29
    },
    "47": {
      "text_tafsir_en": "In these two verses, the authority of God over His creatures is reaffirmed. Unless God wants to do something for His servants, no one can stop it, even if it is an act that determines one's life, such as the deciding of the heartbeat, which results in his death. The same goes for Muhammad. If he had lied to God, God would have angered him and sentenced him to death, by cutting his blood vessels. No one can prevent him from executing that sentence.",
      "text_tafsir": "Pada kedua ayat ini ditegaskan lagi kekuasaan Allah terhadap makhluk-Nya. Seandainya Allah ingin melakukan sesuatu kepada hamba-hamba-Nya, tidak seorang pun yang dapat menghalanginya, sekalipun tindakan itu adalah tindakan yang menentukan hidup-matinya seseorang, seperti tindakan memutuskan urat nadi jantungnya, yang berakibat kematiannya. Demikian pula kepada Muhammad. Seandainya dia berdusta terhadap Allah, tentu Allah akan marah kepadanya dan menghukumnya dengan hukuman mati, yaitu dengan memutus pembuluh darahnya. Tidak ada seorang pun yang dapat menghalangi-Nya dari melaksanakan hukuman itu.",
      "text_translation": "Maka tidak seorang pun dari kamu yang dapat menghalangi (Kami untuk menghukumnya). ",
      "text": "فَمَا مِنْكُمْ مِّنْ اَحَدٍ عَنْهُ حَاجِزِيْنَۙ",
      "text_translation_en": "and none of you could have saved him!",
      "juz_number": 29
    },
    "48": {
      "text_tafsir_en": "The Qur'an is not the words of the poet, not the result of divination, nor is the words of Muhammad, but it is the word of God that He revealed to the Prophet Muhammad to be conveyed to mankind. With the Qur'an, people will have faith and will be guided in the ark of their lives to the island they aspire to, namely the happiness of living in the world and the hereafter. From this verse it is understood that humans in achieving the happiness of living in this world and the hereafter, need guidance. There are instructions that can be achieved by the mind, and some are not. What can be achieved by the mind is like how they live, make a living, grow rice, raise livestock, how to protect themselves from rain and heat, and so on. There are also clues that cannot be reached by the human mind, so there must be someone who shows them. Only God, as the creator, owner and ruler of all creatures, can give that guidance. All the instructions of Allah are contained in the Qur'an and explained by the sunnah of the Prophet, and given to people thinking. Do infidels think of that?",
      "text_tafsir": "Al-Qur'an bukanlah perkataan penyair, bukan hasil tenung tukang tenung, dan bukan pula perkataan Muhammad, tetapi adalah kalam Allah yang diturunkan-Nya kepada Nabi Muhammad saw untuk disampaikan kepada umat manusia. Dengan Al-Qur'an itu, manusia akan beriman dan akan mendapat petunjuk dalam mengayuh bahtera kehidupannya ke pulau yang dicita-citakannya, yaitu kebahagiaan hidup di dunia dan di akhirat.\n\nDari ayat ini dipahami bahwa manusia dalam mencapai kebahagiaan hidup di dunia dan di akhirat, memerlukan petunjuk-petunjuk. Petunjuk itu ada yang dapat dicapai oleh akal pikiran, dan ada yang tidak. Yang dapat dicapai oleh akal pikiran ialah seperti bagaimana cara mereka hidup, mencari nafkah, menanam padi, memelihara binatang ternak, bagaimana melindungi diri dari kehujanan dan kepanasan, dan sebagainya. Ada pula petunjuk yang tidak dapat dicapai oleh akal pikiran manusia, sehingga harus ada yang menunjukkannya. Hanya Allah, sebagai pencipta, pemilik dan penguasa seluruh makhluk, yang bisa memberikan petunjuk itu. Semua petunjuk Allah itu termuat dalam Al-Qur'an dan dijelaskan oleh sunah Nabi saw, serta diberikan kepada orang berpikir. Apakah orang kafir memikirkan yang demikian itu?",
      "text_translation": "Dan sungguh, (Al-Qur'an) itu pelajaran bagi orang-orang yang bertakwa. ",
      "text": "وَاِنَّهٗ لَتَذْكِرَةٌ لِّلْمُتَّقِيْنَ ",
      "text_translation_en": "And, verily, this [Qur’an] is a reminder to all the God-conscious!",
      "juz_number": 29
    },
    "49": {
      "text_tafsir_en": "This verse is a harsh reminder to the Muslims. It is explained that Allah is All-Knowing in everything in this world, from the small to the great, the fine to the rough, and the invisible to the visible. Therefore, Allah is aware of every person who rejects the Qur'an, rejects the apostle, and performs forbidden acts. Then God will act and justly punish people, according to their deeds. From the word \"minkum\" (some of you) in this verse it can be understood that there are some unbelievers who believe in the truth of the Qur'an and the Prophet. However, because of lust, fear of being marginalized, afraid of losing their rank and wealth, they rejected it. Allah says: Indeed he has thought and decreed, and woe unto him! How did he decide? Again, woe to her! How did he decide? Then he (contemplates) thinking, then his face is sour and sullen, then he turns away (from the truth) and boasts himself, and he says, \"(The Qur'an) is only a learned magic (from ancient times). human words. \" (al-Muddatstsir \/ 74: 18-25)",
      "text_tafsir": "Ayat ini merupakan peringatan keras kepada kaum musyrik. Dijelaskan bahwa Allah Maha Mengetahui segala sesuatu yang terdapat di alam ini, sejak dari yang kecil sampai yang besar, yang halus sampai yang kasar, serta yang tidak tampak sampai yang tampak. Oleh karena itu, Allah mengetahui setiap orang yang mendustakan Al-Qur'an, mengingkari rasul, dan melakukan perbuatan-perbuatan yang terlarang. Maka Allah akan melakukan tindakan dan menghukum dengan seadil-adilnya di antara manusia, sesuai dengan perbuatannya.\n\nDari perkataan \"minkum\" (sebahagian kamu) yang terdapat dalam ayat ini dapat dipahami bahwa ada di antara orang musyrik itu yang mempercayai kebenaran Al-Qur'an dan Rasulullah. Akan tetapi, karena hawa nafsu, takut dipencilkan kaumnya, takut kehilangan pangkat dan harta, mereka mendustakannya. Allah berfirman:\n\nSesungguhnya dia telah memikirkan dan menetapkan (apa yang ditetapkannya), maka celakalah dia! Bagaimana dia menetapkan? Sekali lagi, celakalah dia! Bagaimana dia menetapkan? Kemudian dia (merenung) memikirkan, lalu berwajah masam dan cemberut, kemudian berpaling (dari kebenaran) dan menyombongkan diri, lalu dia berkata, \"(Al-Qur'an) ini hanyalah sihir yang dipelajari (dari orang-orang dahulu). Ini hanyalah perkataan manusia.\" (al-Muddatstsir\/74: 18-25)",
      "text_translation": "Dan sungguh, Kami mengetahui bahwa di antara kamu ada orang yang mendustakan.",
      "text": "وَاِنَّا لَنَعْلَمُ اَنَّ مِنْكُمْ مُّكَذِّبِيْنَۗ",
      "text_translation_en": "And, behold, well do We know that among you are such as will give the lie to it:",
      "juz_number": 29
    },
    "50": {
      "text_tafsir_en": "In this verse it is explained that the Qur'an causes disappointment for unbelievers, both in life and in the hereafter. In the world they are frustrated that the influence of Islam is so strong that the influence of shirk is gradually diminishing, and even disappearing completely without a trace. The Qur'an expresses their false beliefs, such as the worship of statues that can do no harm. In the hereafter after suffering a terrible torment, they regret not obeying the Prophet Muhammad, as did the believers. However, their regrets are of no use since the door of repentance is closed.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa Al-Qur'an menimbulkan kekecewaan bagi orang kafir, baik selama hidup di dunia maupun di akhirat. Di dunia mereka kecewa karena pengaruh agama Islam bertambah kuat sehingga pengaruh kepercayaan syirik makin berkurang, bahkan akhirnya hilang seluruhnya tanpa bekas sedikit pun. Al-Qur'an menyatakan kebatilan kepercayaan mereka, seperti menyembah patung yang tidak dapat menimbulkan mudarat dan manfaat.\n\nDi akhirat nanti setelah mengalami azab yang dahsyat, mereka menyesal kenapa tidak mengikuti seruan Nabi Muhammad, seperti yang dilakukan orang-orang yang beriman. Akan tetapi, penyesalan mereka itu tidak ada gunanya lagi karena pintu tobat telah tertutup.",
      "text_translation": "Dan sungguh, (Al-Qur'an) itu akan menimbulkan penyesalan bagi orang-orang kafir (di akhirat).",
      "text": "وَاِنَّهٗ لَحَسْرَةٌ عَلَى الْكٰفِرِيْنَۚ",
      "text_translation_en": "yet, behold, this [rejection] will indeed become a source of bitter regret for all who deny the truth [of God's revelation] –",
      "juz_number": 29
    },
    "51": {
      "text_tafsir_en": "In this verse, it is reiterated that the Qur'an is the truth and the truth. It really comes from the God of the universe, not the words Muhammad invented.",
      "text_tafsir": "Dalam ayat ini, ditegaskan lagi bahwa Al-Qur'an adalah suatu yang benar dan nyata kebenarannya. Ia benar-benar berasal dari Tuhan semesta alam, bukan perkataan yang diada-adakan Muhammad.",
      "text_translation": "Dan Sungguh, (Al-Qur'an) itu kebenaran yang meyakinkan. ",
      "text": "وَاِنَّهٗ لَحَقُّ الْيَقِيْنِ ",
      "text_translation_en": "for, verily, it is truth absolute!",
      "juz_number": 29
    },
    "52": {
      "text_tafsir_en": "Therefore, the Prophet Muhammad was commanded to praise the name of Allah and be grateful to Him because He had bestowed infinite mercy on him and on all mankind, the Qur'an, as a guide to achieving happiness in life here and in the hereafter. Surely the God who has given mercy is the Most High God.",
      "text_tafsir": "Oleh karena itu, Nabi Muhammad diperintahkan untuk bertasbih dengan menyebut nama Allah dan bersyukur kepada-Nya karena Dia telah melimpahkan rahmat yang tidak terhingga kepadanya dan kepada seluruh manusia berupa Al-Qur'an, sebagai petunjuk dalam mencapai kebahagiaan hidup di dunia dan di akhirat. Sesungguhnya Tuhan yang telah memberi rahmat itu adalah Tuhan Yang Mahaagung.",
      "text_translation": "Maka bertasbihlah dengan (menyebut) nama Tuhanmu Yang Mahaagung. ",
      "text": "فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيْمِ ࣖ",
      "text_translation_en": "Extol, then the limitless glory of thy Sustainer's mighty name!",
      "juz_number": 29
    }
  },
  "name": "الحاۤقّة",
  "name_translation_en": "The Reality",
  "name_translation": "Hari Kiamat",
  "name_latin": "Al-Haqqah"
}