{
  "number": 70,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 44,
  "ayat": {
    "1": {
      "text_tafsir_en": "These verses explain that the Meccans of the Mecca such as Nadhr bin al-Harits asked the Prophet Muhammad to immediately carry out their promised doom, if the threat really came from Allah, and if Muhammad was truly one the messenger whom God sent. That request is answered by this verse saying that the promised torment must be upon the unbelievers, whether requested or not. For, it has become a circumcision that the punishment must be applied to every unbeliever.",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa orang musyrik Mekah seperti an-Nadhr bin al-Harits meminta kepada Nabi Muhammad agar segera menimpakan azab yang telah dijanjikan itu kepada mereka, seandainya ancaman itu benar-benar berasal dari Allah, dan jika Muhammad itu benar-benar seorang rasul yang diutus Allah. Permintaan itu dijawab oleh ayat ini dengan mengatakan bahwa azab yang dijanjikan itu pasti menimpa orang-orang kafir, baik diminta atau tidak. Sebab, telah menjadi sunatullah bahwa azab itu pasti ditimpakan kepada setiap orang kafir.",
      "text_translation": "Seseorang bertanya tentang azab yang pasti terjadi, ",
      "text": "سَاَلَ سَاۤىِٕلٌۢ بِعَذَابٍ وَّاقِعٍۙ",
      "text_translation_en": "ONE who is minded to ask might ask about the suffering which [in the hereafter] is bound to befall",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "These verses explain that the Meccans of the Mecca such as Nadhr bin al-Harits asked the Prophet Muhammad to immediately carry out their promised doom, if the threat really came from Allah, and if Muhammad was truly one the messenger whom God sent. That request is answered by this verse saying that the promised torment must be upon the unbelievers, whether requested or not. For, it has become a circumcision that the punishment must be applied to every unbeliever.",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa orang musyrik Mekah seperti an-Nadhr bin al-Harits meminta kepada Nabi Muhammad agar segera menimpakan azab yang telah dijanjikan itu kepada mereka, seandainya ancaman itu benar-benar berasal dari Allah, dan jika Muhammad itu benar-benar seorang rasul yang diutus Allah. Permintaan itu dijawab oleh ayat ini dengan mengatakan bahwa azab yang dijanjikan itu pasti menimpa orang-orang kafir, baik diminta atau tidak. Sebab, telah menjadi sunatullah bahwa azab itu pasti ditimpakan kepada setiap orang kafir.",
      "text_translation": "bagi orang-orang kafir, yang tidak seorang pun dapat menolaknya,",
      "text": "لِّلْكٰفِرِيْنَ لَيْسَ لَهٗ دَافِعٌۙ",
      "text_translation_en": "those who deny the truth. [Know, then, that] nothing can ward it off,",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "It comes from Allah at the appointed time, and when it comes, no one can reject it. The meaning of the word \"al-ma'arij\" (having a ladder) in this verse is that the torment comes from the Most High and the Perfect. There is no shortcoming of Allah, and the coming of the torment is solely by His will and decision, not by the request of the creature, as did the Nadhr bin al-Harits. From this verse it is understood that it is as if the unbelievers do not know the glory and the greatness of God. As if to Allah, all their wishes and desires could be asked, just as they did to idols.",
      "text_tafsir": "Azab itu datang dari Allah pada waktu yang telah ditentukan, dan jika datang, tidak seorang pun yang dapat menolaknya. Maksud perkataan “al-ma‘arij” (mempunyai tangga) yang terdapat dalam ayat ini adalah bahwa azab datang dari Allah Yang Mahatinggi dan Mahasempurna. Tidak ada sifat kekurangan sedikit pun pada Allah, dan kedatangan azab itu semata-mata atas kehendak dan keputusan-Nya, bukan berdasarkan permintaan makhluk, seperti yang dilakukan oleh an-Nadhr bin al-Harits itu.\n\nDari ayat ini dipahami bahwa seakan-akan orang musyrik tidak mengetahui kemuliaan dan kebesaran Allah. Seakan-akan kepada Allah, dapat dimintakan seluruh kehendak dan keinginan mereka, sebagaimana yang mereka lakukan terhadap berhala-berhala.",
      "text_translation": "(Azab) dari Allah, yang memiliki tempat-tempat naik.",
      "text": "مِّنَ اللّٰهِ ذِى الْمَعَارِجِۗ",
      "text_translation_en": "[since it will come] from God, unto whom there are many ways of ascent:",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "The angels and Gabriel facing God take a very short time and if done mankind will take fifty thousand years. The 50,000 year number mentioned in this verse is not an actual number, but to explain that the Throne of God is very far and high, cannot be reached by any of His servants. Here are some other creatures of God who have different levels and abilities. In another word of God, it is explained that He arranges affairs from heaven to earth in a time whose level is equal to a thousand years according to human calculations: He arranges all matters from heaven to earth, then (affairs) rise to Him in one day which the level (duration) is a thousand years according to your calculations. (As-Sajdah \/ 32: 5) Actually the issue is how long the world is, and how long it will take for the angels to ascend to Allah and then return to this world to carry out His commands, including occult matters. Only God knows for certain. For us as servants of God, it is enough to believe that there is a punishment from God that will be inflicted on those who deny the Day of Judgment. In Surah Az-Zariyat \/ 51: 7, Allah swears by the heavens that have ways. These roads can be interpreted scientifically as a wormhole, a shortcut that connects one place to another in the universe. Then Allah confirmed in Surah Al-Ma \\\\ arij \/ 70: 4 that He had ma'arij, where angels and Gabriel rose (facing) to God in a day which was fifty thousand years old. As explained in the interpretation of Surah Az-Zariyat \/ 51: 7 that in physics theory of general relativity, it is known about the mechanism of shortening the great distance to just a few meters which scientists now call a wormhole. These paths may be ma'arij, where Allah further details that the angels and Gabriel ascended to face God through these paths and are described as ascending in a day of fifty thousand years. Even though none of the physicists use it, in wormholes we move without the need for energy. Once we enter into it, the force field pulls us and suddenly we are thrown somewhere else. In wormholes, our watches move slower and the sticks we happen to carry also shorten. However, once it came out everything returned to normal, including the clock and the stick that we brought. Anyone who goes through this ma'arij will experience a dilation of time, which is a day of fifty thousand years on earth. This does not mean how long we go through ma'arij, but if we go this way we will get older by this comparison. The journey of the Prophet in the events of Isra 'Mi'raj, may pass through the mechanism of shortening the distance so that the distance traveled by the Prophet only in hours. When the Messenger of Allah relates the events that he experienced, the disbelievers clearly did not believe it. Though it is a sign of God's greatness. It is interesting to note in Surah Al-Hijr \/ 15: 13-15: They do not believe in him (Al-Qur'an) even though the Sunatullah has passed on the former people. And if We open them one of the doors of heaven, then they continue to rise above it, surely they say, \"Indeed, our views are obscured, even we are people who are exposed to magic.\" (Al-Hijr \/ 15: 13-15) Thus, Allah states that for those who do not believe, until if the door of heaven is opened and they pass through it, they will continue to argue that it is an illusion. Sub ¥ anallah, Allah gives an idea of how to arrange His creatures. The angels wandered from place to place using a special road called ma'arij, and the Messenger of Allah, the Beloved of Allah, had the opportunity to go through these special roads on one very shocking night, that is Isra 'Mi'raj .",
      "text_tafsir": "Malaikat-malaikat dan Jibril menghadap Allah memakan waktu yang sangat singkat dan jika dilakukan manusia akan memakan waktu lima puluh ribu tahun. Angka 50.000 tahun yang disebutkan dalam ayat ini bukanlah bilangan yang sebenarnya, tetapi untuk menerangkan bahwa Arasy Allah itu sangat jauh dan tinggi, tidak akan dapat dicapai oleh hamba-hamba-Nya yang mana pun. Di sini ada beberapa makhluk Tuhan yang lain yang berbeda-beda tingkat dan kemampuannya.\n\nDalam firman Allah yang lain, diterangkan bahwa Dia mengatur urusan dari langit ke bumi dalam suatu saat yang kadarnya sama dengan seribu tahun menurut perhitungan manusia:\n\nDia mengatur segala urusan dari langit ke bumi, kemudian (urusan) itu naik kepada-Nya dalam satu hari yang kadarnya (lamanya) adalah seribu tahun menurut perhitunganmu. (As-Sajdah\/32: 5)\n\nSebenarnya persoalan berapa lama umur dunia ini, dan berapa lama waktu yang diperlukan malaikat naik kepada Allah kemudian turun kembali ke dunia ini melaksanakan perintah-perintah-Nya, termasuk perkara gaib. Hanya Allah yang mengetahuinya dengan pasti. Bagi kita sebagai hamba Allah, cukup percaya bahwa ada azab Allah yang akan ditimpakan kepada yang mereka yang mengingkari hari Kiamat.\n\nDalam Surah Az-Zariyat\/51: 7, Allah bersumpah demi langit yang mem­punyai jalan-jalan. Jalan-jalan ini secara ilmiah, dapat ditafsirkan sebagai wormhole, yakni jalan pintas yang menghubungkan satu tempat dengan tempat lain di jagad raya ini. Kemudian Allah menegaskan dalam Surah Al-Ma\\\\\\'arij\/70: 4 bahwa Ia memiliki ma‘arij, di mana malaikat-malaikat dan Jibril naik (menghadap) kepada Tuhan dalam sehari yang kadarnya lima puluh ribu tahun. \n\nSeperti telah dijelaskan dalam penafsiran Surah Az-Zariyat\/51: 7 bahwa dalam teori fisika relativitas umum, dikenal mengenai mekanisme pemendekan jarak yang sangat jauh menjadi hanya beberapa meter saja yang saat ini oleh para ilmuwan disebut sebagai wormhole (lubang cacing). Jalan-jalan itu boleh jadi adalah ma‘arij, di mana Allah memperinci lebih jauh bahwa para malaikat dan Jibril naik menghadap Allah melalui jalan tersebut dan digambarkan bahwa mereka naik dalam sehari yang kadarnya lima puluh ribu tahun. \n\nMeski belum satu pun para ahli fisika menggunakannya, dalam wormhole kita bergerak tanpa membutuhkan energi. Begitu kita masuk ke dalamnya, medan gaya berat menarik kita dan tahu-tahu kita telah terlempar ke suatu tempat yang lain. Dalam wormhole, arloji kita bergerak lebih lambat dan tongkat yang kebetulan kita bawa juga memendek. Namun, begitu keluar semua kembali seperti sediakala termasuk jam dan tongkat yang kita bawa. Siapa saja melewati ma‘arij ini akan mengalami pemanjangan (dilation) waktu yakni sehari yang kadarnya lima puluh ribu tahun di bumi. Hal ini bukan berarti berapa lama kita melalui ma‘arij, tetapi jika kita melalui jalan ini kita akan menjadi lebih tua dengan perbandingan tersebut.\n\nPerjalanan Rasulullah dalam peristiwa Isra‘ Mi‘raj, boleh jadi melewati mekanisme pemendekan jarak sehingga jarak yang demikian jauhnya ditempuh Rasulullah hanya dalam bilangan jam. Ketika Rasulullah menceritakan peristiwa yang dialaminya, orang-orang kafir jelas tidak mempercayainya. Padahal itu adalah tanda-tanda kebesaran Allah. Menarik disimak dalam Surah Al-Hijr\/15: 13-15:\n\nMereka tidak beriman kepadanya (Al-Qur‘an) padahal telah berlalu sunatullah terhadap orang-orang terdahulu. Dan kalau Kami bukakan kepada mereka salah satu pintu langit, lalu mereka terus menerus naik ke atasnya, tentulah mereka berkata, “Sesungguhnya pandangan kamilah yang dikaburkan, bahkan kami adalah orang yang terkena sihir.” (Al-Hijr\/15: 13-15)\n\nDengan demikian, Allah menyatakan bahwa bagi mereka yang tidak beriman, sampai seandainya pintu langit dibuka dan mereka melaluinya, mereka akan tetap berdalih bahwa itu sebuah ilusi.\n\nSub¥anallah, Allah memberikan gambaran bagaimana mengatur makhluk-Nya. Para malaikat lalu lalang dari satu tempat ke tempat dengan menggunakan jalan khusus yang disebut ma‘arij, dan Rasulullah, Sang Kekasih Allah, mendapat kesempatan melalui ma‘arij-jalan istimewa- tersebut pada suatu malam yang sangat mengguncangkan, yakni Isra‘ Mi‘raj.",
      "text_translation": "Para malaikat dan Jibril naik (menghadap) kepada Tuhan, dalam sehari setara dengan lima puluh ribu tahun.",
      "text": "تَعْرُجُ الْمَلٰۤىِٕكَةُ وَالرُّوْحُ اِلَيْهِ فِيْ يَوْمٍ كَانَ مِقْدَارُهٗ خَمْسِيْنَ اَلْفَ سَنَةٍۚ",
      "text_translation_en": "all the angels and all the inspiration [ever granted to man] ascend unto Him [daily,] in a day the length whereof is [like] fifty thousand years…",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "The Messenger of Allah (may peace be upon him) was told to persevere in the attitude of the polytheists. He was also asked not to feel uneasy by their attitude, because the matter of torment was the business of God. Only Allah knows when the punishment will befall them.",
      "text_tafsir": "Rasulullah saw disuruh bersabar terhadap sikap orang musyrik yang selalu memperolok-olokkannya. Beliau juga diminta untuk tidak merasa gelisah oleh sikap mereka, karena urusan azab adalah urusan Allah. Hanya Allah yang mengetahui kapan azab itu akan ditimpakan kepada mereka.",
      "text_translation": "Maka bersabarlah engkau (Muhammad) dengan kesabaran yang baik.",
      "text": "فَاصْبِرْ صَبْرًا جَمِيْلًا",
      "text_translation_en": "Therefore, [O believer,] endure all adversity with goodly patience:",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "The polytheists considered that the punishment was impossible, because it was tricked by the temporary pleasures of the world. Also because they have very little knowledge and do not heed Allah's instructions.",
      "text_tafsir": "Kaum musyrik memandang bahwa azab itu mustahil terjadi, karena teperdaya oleh kesenangan dunia yang sifatnya sementara. Juga karena ilmu mereka sangat sedikit dan tidak mengindahkan petunjuk Allah.",
      "text_translation": "Mereka memandang (azab) itu jauh (mustahil). ",
      "text": "اِنَّهُمْ يَرَوْنَهٗ بَعِيْدًاۙ",
      "text_translation_en": "behold, men look upon that [reckoning] as something far away –",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "However, the doom is sure to occur because it is Allah who determines everything. Nothing is difficult for Him. If He wants something to happen, it will happen at the time He wants. Nothing can go against his will.",
      "text_tafsir": "Namun demikian, azab itu pasti terjadi karena Allah-lah yang menentukan segala sesuatu. Tidak ada satu pun yang sukar bagi-Nya. Jika Dia menghendaki terjadinya sesuatu, maka akan terjadi pada saat yang dikehendaki-Nya. Tidak ada suatu pun yang dapat melawan kehendaknya.",
      "text_translation": "Sedangkan Kami memandangnya dekat (pasti terjadi). ",
      "text": "وَّنَرٰىهُ قَرِيْبًاۗ",
      "text_translation_en": "but, We see it as near!",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "In this verse, Allah explains the time of the coming of doom and the human condition at that time. The doom came to the disbelievers when the sky was broken, like silver melting from heat, and when the mountains were scattered, as if the feathers of a bird were flying in the wind. Confusion and suffering faced by humans at that time. Each can not help others, no intimate friend who asks his friend, while they see and know the suffering of his friend.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan saat-saat kedatangan azab serta keadaan manusia waktu itu. Azab datang kepada orang kafir pada waktu langit hancur luluh, seperti perak yang mencair karena dipanaskan, dan pada saat gunung-gunung hancur bertaburan, seakan-akan bulu-bulu burung yang sedang beterbangan karena hembusan angin. Kebingungan dan penderitaan dihadapi manusia pada waktu itu. Masing-masing tidak dapat menolong orang lain, tidak seorang pun teman akrab yang menanyakan temannya, sedangkan mereka melihat dan mengetahui penderitaan temannya itu.",
      "text_translation": "(Ingatlah) pada hari ketika langit men-jadi bagaikan cairan tembaga, ",
      "text": "يَوْمَ تَكُوْنُ السَّمَاۤءُ كَالْمُهْلِۙ",
      "text_translation_en": "[It will take place] on a Day when the sky will be like molten lead,",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "In this verse, Allah explains the time of the coming of doom and the human condition at that time. The doom came to the disbelievers when the sky was broken, like silver melting from heat, and when the mountains were scattered, as if the feathers of a bird were flying in the wind. Confusion and suffering faced by humans at that time. Each can not help others, no intimate friend who asks his friend, while they see and know the suffering of his friend.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan saat-saat kedatangan azab serta keadaan manusia waktu itu. Azab datang kepada orang kafir pada waktu langit hancur luluh, seperti perak yang mencair karena dipanaskan, dan pada saat gunung-gunung hancur bertaburan, seakan-akan bulu-bulu burung yang sedang beterbangan karena hembusan angin. Kebingungan dan penderitaan dihadapi manusia pada waktu itu. Masing-masing tidak dapat menolong orang lain, tidak seorang pun teman akrab yang menanyakan temannya, sedangkan mereka melihat dan mengetahui penderitaan temannya itu.",
      "text_translation": "dan gunung-gunung bagaikan bulu (yang beterbangan), ",
      "text": "وَتَكُوْنُ الْجِبَالُ كَالْعِهْنِۙ",
      "text_translation_en": "and the mountains will be like tufts of wool,",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "In this verse, Allah explains the time of the coming of doom and the human condition at that time. The doom came to the disbelievers when the sky was broken, like silver melting from heat, and when the mountains were scattered, as if the feathers of a bird were flying in the wind. Confusion and suffering faced by humans at that time. Each can not help others, no intimate friend who asks his friend, while they see and know the suffering of his friend.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan saat-saat kedatangan azab serta keadaan manusia waktu itu. Azab datang kepada orang kafir pada waktu langit hancur luluh, seperti perak yang mencair karena dipanaskan, dan pada saat gunung-gunung hancur bertaburan, seakan-akan bulu-bulu burung yang sedang beterbangan karena hembusan angin. Kebingungan dan penderitaan dihadapi manusia pada waktu itu. Masing-masing tidak dapat menolong orang lain, tidak seorang pun teman akrab yang menanyakan temannya, sedangkan mereka melihat dan mengetahui penderitaan temannya itu.",
      "text_translation": "dan tidak ada seorang teman karib pun menanyakan temannya,",
      "text": "وَلَا يَسْـَٔلُ حَمِيْمٌ حَمِيْمًاۚ ",
      "text_translation_en": "and [when] no friend will ask about his friend,",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "On that day, infidels expect to be released from the doom they suffer, by redeeming themselves with their proud children, their beloved wives, brothers who used to help them while living in the world, people who always help and protect them , and all humans on earth. Because that is what they usually do in the world; helping their friends, family, and children, even though those helped do evil and wrongdoing.",
      "text_tafsir": "Pada hari itu, orang kafir mengharapkan agar terlepas dari azab yang mereka derita, dengan menebus diri dengan anak-anak yang mereka banggakan, istri yang mereka cintai, saudara-saudara yang biasa membantu mereka selama hidup di dunia, kaum yang selalu membantu dan melindungi mereka, dan semua manusia yang ada di muka bumi. Karena demikianlah yang biasa mereka lakukan di dunia; menolong teman, keluarga, dan anak-anak mereka, walaupun yang ditolong itu melakukan perbuatan jahat dan zalim.",
      "text_translation": "sedang mereka saling melihat. Pada hari itu, orang yang berdosa ingin sekiranya dia dapat menebus (dirinya) dari azab dengan anak-anaknya, ",
      "text": "يُبَصَّرُوْنَهُمْۗ يَوَدُّ الْمُجْرِمُ لَوْ يَفْتَدِيْ مِنْ عَذَابِ يَوْمِىِٕذٍۢ بِبَنِيْهِۙ",
      "text_translation_en": "though they may be in one another's sight: [for,] everyone who was lost in sin will on that Day but desire to ransom himself from suffering at the price of his own children,",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "On that day, infidels expect to be released from the doom they suffer, by redeeming themselves with their proud children, their beloved wives, brothers who used to help them while living in the world, people who always help and protect them , and all humans on earth. Because that is what they usually do in the world; helping their friends, family, and children, even though those helped do evil and wrongdoing.",
      "text_tafsir": "Pada hari itu, orang kafir mengharapkan agar terlepas dari azab yang mereka derita, dengan menebus diri dengan anak-anak yang mereka banggakan, istri yang mereka cintai, saudara-saudara yang biasa membantu mereka selama hidup di dunia, kaum yang selalu membantu dan melindungi mereka, dan semua manusia yang ada di muka bumi. Karena demikianlah yang biasa mereka lakukan di dunia; menolong teman, keluarga, dan anak-anak mereka, walaupun yang ditolong itu melakukan perbuatan jahat dan zalim.",
      "text_translation": "dan istrinya dan saudaranya, ",
      "text": "وَصَاحِبَتِهٖ وَاَخِيْهِۙ",
      "text_translation_en": "and of his spouse, and of his brother,",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "On that day, infidels expect to be released from the doom they suffer, by redeeming themselves with their proud children, their beloved wives, brothers who used to help them while living in the world, people who always help and protect them , and all humans on earth. Because that is what they usually do in the world; helping their friends, family, and children, even though those helped do evil and wrongdoing.",
      "text_tafsir": "Pada hari itu, orang kafir mengharapkan agar terlepas dari azab yang mereka derita, dengan menebus diri dengan anak-anak yang mereka banggakan, istri yang mereka cintai, saudara-saudara yang biasa membantu mereka selama hidup di dunia, kaum yang selalu membantu dan melindungi mereka, dan semua manusia yang ada di muka bumi. Karena demikianlah yang biasa mereka lakukan di dunia; menolong teman, keluarga, dan anak-anak mereka, walaupun yang ditolong itu melakukan perbuatan jahat dan zalim.",
      "text_translation": "dan keluarga yang melindunginya (di dunia),",
      "text": "وَفَصِيْلَتِهِ الَّتِيْ تُـْٔوِيْهِۙ",
      "text_translation_en": "and of all the kinsfolk who ever sheltered him,",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "On that day, infidels expect to be released from the doom they suffer, by redeeming themselves with their proud children, their beloved wives, brothers who used to help them while living in the world, people who always help and protect them , and all humans on earth. Because that is what they usually do in the world; helping their friends, family, and children, even though those helped do evil and wrongdoing.",
      "text_tafsir": "Pada hari itu, orang kafir mengharapkan agar terlepas dari azab yang mereka derita, dengan menebus diri dengan anak-anak yang mereka banggakan, istri yang mereka cintai, saudara-saudara yang biasa membantu mereka selama hidup di dunia, kaum yang selalu membantu dan melindungi mereka, dan semua manusia yang ada di muka bumi. Karena demikianlah yang biasa mereka lakukan di dunia; menolong teman, keluarga, dan anak-anak mereka, walaupun yang ditolong itu melakukan perbuatan jahat dan zalim.",
      "text_translation": "dan orang-orang di bumi seluruhnya, kemudian mengharapkan (tebusan) itu dapat menyelamatkannya.",
      "text": "وَمَنْ فِى الْاَرْضِ جَمِيْعًاۙ ثُمَّ يُنْجِيْهِۙ",
      "text_translation_en": "and of whoever [else] lives on earth, all of them - so that he could but save himself.",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "No ransom will be accepted for any sin that the unbelievers commit. God does not need a ransom, He is powerful and does not need anything. Indeed, those who disbelieve and die in disbelief, will not receive (ransom) any of them even (in the form of) gold of the whole earth, if they will redeem it. They are the ones who get the painful punishment and do not get help. (Ali Imran \/ 3: 91) The torment provided for unbelievers is hell. No one is safe and can escape his doom. It calls on the unbelievers to be punished, as well as those who turn away from the truth, cheat or evil, and accumulate wealth, but refuse to give alms and the rights of God, as He has decreed. This verse is not intended to prohibit Muslims from accumulating property. This verse simply prohibits the accumulation of property without depriving the rights of God contained in the accumulated property.",
      "text_tafsir": "Tidak akan diterima tebusan apa pun dari perbuatan dosa yang telah dikerjakan orang kafir. Allah tidak memerlukan tebusan, Dia Mahakaya dan tidak memerlukan sesuatu apa pun.\n\nSungguh, orang-orang yang kafir dan mati dalam kekafiran, tidak akan diterima (tebusan) dari seseorang di antara mereka sekalipun (berupa) emas sepenuh bumi, sekiranya dia hendak menebus diri dengannya. Mereka itulah orang-orang yang mendapat azab yang pedih dan tidak memperoleh penolong. (Ali Imran\/3: 91)\n\nAzab yang disediakan bagi orang kafir ialah neraka. Tidak seorang pun yang selamat dan dapat melepaskan diri dari azabnya. Neraka itu memanggil orang kafir untuk diazab, begitu juga orang-orang yang membelakang dan lari dari kebenaran, suka berbuat curang atau jahat, dan suka mengumpulkan harta, tetapi tidak mau mengeluarkan sedekah dan hak-hak Allah, seperti yang telah ditetapkan-Nya.\n\nAyat ini tidak bertujuan untuk melarang kaum Muslimin mengumpulkan harta. Ayat ini hanya melarang mengumpulkan harta tanpa mengeluarkan hak-hak Allah yang ada dalam harta yang telah dikumpulkan itu.",
      "text_translation": "Sama sekali tidak! Sungguh, neraka itu api yang bergejolak,",
      "text": "كَلَّاۗ اِنَّهَا لَظٰىۙ",
      "text_translation_en": "But nay! Verily, all [that awaits him] is a raging flame,",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "No ransom will be accepted for any sin that the unbelievers commit. God does not need a ransom, He is powerful and does not need anything. Indeed, those who disbelieve and die in disbelief, will not receive (ransom) any of them even (in the form of) gold of the whole earth, if they will redeem it. They are the ones who get the painful punishment and do not get help. (Ali Imran \/ 3: 91) The torment provided for unbelievers is hell. No one is safe and can escape his doom. It calls on the unbelievers to be punished, as well as those who turn away from the truth, cheat or evil, and accumulate wealth, but refuse to give alms and the rights of God, as He has decreed. This verse is not intended to prohibit Muslims from accumulating property. This verse simply prohibits the accumulation of property without depriving the rights of God contained in the accumulated property.",
      "text_tafsir": "Tidak akan diterima tebusan apa pun dari perbuatan dosa yang telah dikerjakan orang kafir. Allah tidak memerlukan tebusan, Dia Mahakaya dan tidak memerlukan sesuatu apa pun.\n\nSungguh, orang-orang yang kafir dan mati dalam kekafiran, tidak akan diterima (tebusan) dari seseorang di antara mereka sekalipun (berupa) emas sepenuh bumi, sekiranya dia hendak menebus diri dengannya. Mereka itulah orang-orang yang mendapat azab yang pedih dan tidak memperoleh penolong. (Ali Imran\/3: 91)\n\nAzab yang disediakan bagi orang kafir ialah neraka. Tidak seorang pun yang selamat dan dapat melepaskan diri dari azabnya. Neraka itu memanggil orang kafir untuk diazab, begitu juga orang-orang yang membelakang dan lari dari kebenaran, suka berbuat curang atau jahat, dan suka mengumpulkan harta, tetapi tidak mau mengeluarkan sedekah dan hak-hak Allah, seperti yang telah ditetapkan-Nya.\n\nAyat ini tidak bertujuan untuk melarang kaum Muslimin mengumpulkan harta. Ayat ini hanya melarang mengumpulkan harta tanpa mengeluarkan hak-hak Allah yang ada dalam harta yang telah dikumpulkan itu.",
      "text_translation": "yang mengelupaskan kulit kepala. ",
      "text": "نَزَّاعَةً لِّلشَّوٰىۚ",
      "text_translation_en": "tearing away his skin!",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "No ransom will be accepted for any sin that the unbelievers commit. God does not need a ransom, He is powerful and does not need anything. Indeed, those who disbelieve and die in disbelief, will not receive (ransom) any of them even (in the form of) gold of the whole earth, if they will redeem it. They are the ones who get the painful punishment and do not get help. (Ali Imran \/ 3: 91) The torment provided for unbelievers is hell. No one is safe and can escape his doom. It calls on the unbelievers to be punished, as well as those who turn away from the truth, cheat or evil, and accumulate wealth, but refuse to give alms and the rights of God, as He has decreed. This verse is not intended to prohibit Muslims from accumulating property. This verse simply prohibits the accumulation of property without depriving the rights of God contained in the accumulated property.",
      "text_tafsir": "Tidak akan diterima tebusan apa pun dari perbuatan dosa yang telah dikerjakan orang kafir. Allah tidak memerlukan tebusan, Dia Mahakaya dan tidak memerlukan sesuatu apa pun.\n\nSungguh, orang-orang yang kafir dan mati dalam kekafiran, tidak akan diterima (tebusan) dari seseorang di antara mereka sekalipun (berupa) emas sepenuh bumi, sekiranya dia hendak menebus diri dengannya. Mereka itulah orang-orang yang mendapat azab yang pedih dan tidak memperoleh penolong. (Ali Imran\/3: 91)\n\nAzab yang disediakan bagi orang kafir ialah neraka. Tidak seorang pun yang selamat dan dapat melepaskan diri dari azabnya. Neraka itu memanggil orang kafir untuk diazab, begitu juga orang-orang yang membelakang dan lari dari kebenaran, suka berbuat curang atau jahat, dan suka mengumpulkan harta, tetapi tidak mau mengeluarkan sedekah dan hak-hak Allah, seperti yang telah ditetapkan-Nya.\n\nAyat ini tidak bertujuan untuk melarang kaum Muslimin mengumpulkan harta. Ayat ini hanya melarang mengumpulkan harta tanpa mengeluarkan hak-hak Allah yang ada dalam harta yang telah dikumpulkan itu.",
      "text_translation": "Yang memanggil orang yang membelakangi dan yang berpaling (dari agama),",
      "text": "تَدْعُوْا مَنْ اَدْبَرَ وَتَوَلّٰىۙ",
      "text_translation_en": "It will claim all such as turn their backs [on what is right], and turn away [from the truth],",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "No ransom will be accepted for any sin that the unbelievers commit. God does not need a ransom, He is powerful and does not need anything. Indeed, those who disbelieve and die in disbelief, will not receive (ransom) any of them even (in the form of) gold of the whole earth, if they will redeem it. They are the ones who get the painful punishment and do not get help. (Ali Imran \/ 3: 91) The torment provided for unbelievers is hell. No one is safe and can escape his doom. It calls on the unbelievers to be punished, as well as those who turn away from the truth, cheat or evil, and accumulate wealth, but refuse to give alms and the rights of God, as He has decreed. This verse is not intended to prohibit Muslims from accumulating property. This verse simply prohibits the accumulation of property without depriving the rights of God contained in the accumulated property.",
      "text_tafsir": "Tidak akan diterima tebusan apa pun dari perbuatan dosa yang telah dikerjakan orang kafir. Allah tidak memerlukan tebusan, Dia Mahakaya dan tidak memerlukan sesuatu apa pun.\n\nSungguh, orang-orang yang kafir dan mati dalam kekafiran, tidak akan diterima (tebusan) dari seseorang di antara mereka sekalipun (berupa) emas sepenuh bumi, sekiranya dia hendak menebus diri dengannya. Mereka itulah orang-orang yang mendapat azab yang pedih dan tidak memperoleh penolong. (Ali Imran\/3: 91)\n\nAzab yang disediakan bagi orang kafir ialah neraka. Tidak seorang pun yang selamat dan dapat melepaskan diri dari azabnya. Neraka itu memanggil orang kafir untuk diazab, begitu juga orang-orang yang membelakang dan lari dari kebenaran, suka berbuat curang atau jahat, dan suka mengumpulkan harta, tetapi tidak mau mengeluarkan sedekah dan hak-hak Allah, seperti yang telah ditetapkan-Nya.\n\nAyat ini tidak bertujuan untuk melarang kaum Muslimin mengumpulkan harta. Ayat ini hanya melarang mengumpulkan harta tanpa mengeluarkan hak-hak Allah yang ada dalam harta yang telah dikumpulkan itu.",
      "text_translation": "dan orang yang mengumpulkan (harta benda) lalu menyimpannya. ",
      "text": "وَجَمَعَ فَاَوْعٰى ",
      "text_translation_en": "and amass [wealth] and thereupon withhold [it from their fellow-men].",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "In this verse it is explained that humans have a tendency to complain and think. However, this attitude can be changed by following God's instructions in verses 22 to 24 of this chapter. People who disregard God's guidance and call to the apostles are misguided people. The Word of God: And most people will not believe even when you want it so much. (Joseph \/ 12: 103) Man can be led astray from God's way because of his hasty, anxious, and stubborn nature. This is not a provision from Allah to them, but they become believers or infidels because of their own efforts and choices. It is He Who created you, and there is among you disbelievers and among you (believers). And Allah is well-aware of what you do. (At-Tagabun \/ 64: 2) To mankind is laid the straight path to God's will and the happiness of life on earth and in the hereafter as the Messenger of Allah says, as contained in the Qur'an and hadith. In addition, there is a perilous path, a path that Allah has envied and leads to a place of suffering and misery in the hereafter. Humans can choose either way; which path to take, whether straight or stray. They were then rewarded according to their choice.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa manusia memiliki sifat suka berkeluh kesah dan kikir. Namun, sifat ini dapat diubah jika menuruti petunjuk Tuhan yang dinyatakan-Nya dalam ayat 22 sampai 24 surah ini. Manusia yang tidak mempedulikan petunjuk Tuhan dan seruan rasul adalah orang yang sesat. Firman Allah:\n\nDan kebanyakan manusia tidak akan beriman walaupun engkau sangat menginginkannya. (Yusuf\/12: 103)\n\nManusia bisa sesat dari jalan Allah karena sifatnya yang tergesa-gesa, gelisah, dan kikir. Hal ini bukanlah ketentuan dari Allah terhadapnya, tetapi mereka menjadi mukmin atau menjadi kafir karena usaha dan pilihan mereka sendiri. \n\nDialah yang menciptakan kamu, lalu di antara kamu ada yang kafir dan di antara kamu (juga) ada yang mukmin. Dan Allah Maha Melihat apa yang kamu kerjakan. (At-Tagabun\/64: 2)\n\nKepada manusia dibentangkan jalan lurus menuju keridaan Allah dan kebahagiaan hidup di dunia dan di akhirat seperti yang disampaikan Rasulullah, sebagaimana yang termuat dalam Al-Qur'an dan hadis. Di samping itu, terbentang pula jalan yang sesat, jalan yang dimurkai Allah dan menuju ke tempat yang penuh derita dan sengsara di akhirat. Manusia boleh memilih salah satu dari kedua jalan itu; jalan mana yang akan ditempuhnya, apakah jalan yang lurus atau jalan yang sesat. Kemudian mereka diberi balasan sesuai dengan pilihan mereka.",
      "text_translation": "Sungguh, manusia diciptakan bersifat suka mengeluh. ",
      "text": "۞ اِنَّ الْاِنْسَانَ خُلِقَ هَلُوْعًاۙ",
      "text_translation_en": "VERILY, man is born with a restless disposition.",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "When people are in distress, they are impatient and persistent, sometimes giving up. However, if he receives a lot of sustenance and gifts from God, he becomes stingy. Anxiety and anxiety arise in people because they do not believe in God. She felt as though she was isolated, there was nothing that could help her with that difficulty. But when it comes to sustenance, he feels that it is earned solely by his own efforts, without the assistance of others. They think that the sustenance and gift they receive is not the gift of God. Therefore, the attitude is stubborn. It's more about the believers. He believed that everything that came to him was a test and trial of God, whether it was suffering or pleasure. The trial was given to him to test and strengthen his faith. Therefore, he remained steadfast and steadfast in accepting all trials, and repented to Allah with true repentance if he had done wrong. Instead, when he receives grace and grace from God, he is grateful to him and feels himself bound to that grace. Then he took away the rights of others or the rights of God in his possession, as did the Prophet Job: And (remember) Job, when he prayed to his Lord, \"(My Lord), indeed, I have been afflicted, but You The Merciful God of all mercies. \"So We granted him a prayer, then We removed his sickness and We returned his family to him, and (We increased their number) as a mercy from Us, and as a memorial for Us all who worship us. (Al-Anbiya '\/ 21: 83-84) The believer will not despair and despair of the affairs of the world, and will not affect his soul, because he believes in the Qada and the Qadar of Allah. Not that what is considered bad is bad in God's eyes, and that is good in His sight. On the contrary, what is considered bad is good in God's eyes and what is good in God's eyes is bad. He believes this to be true, for God declares in his Word: If you do not like them, be patient, for it is possible for you to dislike something, but Allah has done him much good. (an-Nisa \\\\\\ '\/ 4: 19) But unbelievers do not have such belief. They do not believe that the love and sorrow that God brings to a person is a trial of God to him. They thought it was a disaster for him. When they are happy and happy, they only see themselves as they are, while others are not, as the word of God says: Humans are not tired of asking for good, and when disaster strikes, they give up and lose hope. And if We had bestowed on him a favor from Us after the tribulation, he would have said, \"This is my right, and I do not believe that the Day of Judgment will come. And if I am returned to my Lord, surely I shall have good on his side. \"Verily, We will inform the disbelievers of what they have done, and verily, We shall bear upon them a severe punishment. (Fussilat \/ 41: 49-50)",
      "text_tafsir": "Jika manusia ditimpa kesusahan, mereka tidak sabar dan tabah, kadang-kadang berputus asa. Akan tetapi, jika memperoleh rezeki dan karunia yang banyak dari Allah, ia menjadi kikir. Kegelisahan dan kekikiran itu timbul pada diri manusia lantaran mereka tidak beriman dengan sungguh-sungguh kepada Allah. Ia merasa seakan-akan dirinya terpencil, tidak ada sesuatu pun yang dapat menolongnya dalam kesukaran itu. Namun apabila mendapat rezeki, ia merasa bahwa rezeki itu diperolehnya semata-mata karena usahanya sendiri, tanpa pertolongan dari orang lain. Mereka beranggapan bahwa rezeki dan karunia yang diperolehnya itu bukan karunia dari Allah. Oleh karena itu, timbullah sifat kikir. \n\nLain halnya dengan orang yang beriman. Ia percaya bahwa segala yang datang kepadanya merupakan ujian dan cobaan dari Allah, baik yang datang itu berupa penderitaan maupun kesenangan. Cobaan itu diberikan kepadanya untuk menguji dan menambah kuat imannya. Oleh karena itu, ia tetap tabah dan sabar dalam menerima semua cobaan, serta bertobat kepada Allah dengan tobat yang sesungguhnya jika ada kesalahan yang telah dilakukannya. Sebaliknya jika ia menerima rahmat dan karunia dari Allah, ia bersyukur kepada-Nya dan merasa dirinya terikat dengan rahmat itu. Kemudian ia mengeluarkan hak orang lain atau hak Allah yang ada dalam hartanya itu, sebagaimana yang telah dilakukan Nabi Ayub:\n\nDan (ingatlah kisah) Ayub, ketika dia berdoa kepada Tuhannya, “(Ya Tuhanku), sungguh, aku telah ditimpa penyakit, padahal Engkau Tuhan Yang Maha Penyayang dari semua yang penyayang.” Maka Kami kabulkan (doa)nya, lalu Kami lenyapkan penyakit yang ada padanya dan Kami kembalikan keluarganya kepadanya, dan (Kami lipat gandakan jumlah mereka) sebagai suatu rahmat dari Kami, dan untuk menjadi peringatan bagi semua yang menyembah Kami. (Al-Anbiya‘\/21: 83-84)\n\nOrang yang beriman tidak akan bersedih hati dan putus asa terhadap urusan dunia yang luput darinya, dan tidak akan berpengaruh pada jiwanya, karena ia yakin kepada Qada dan Qadar Allah. Belum tentu yang dikira buruk itu, buruk pula di sisi Allah, dan yang dikira baik itu, baik pula di sisi-Nya. Mungkin sebaliknya, yang dikira buruk itu, baik di sisi Allah dan yang kelihatannya baik itu adalah buruk di sisi Allah. Ia yakin benar hal yang demikian, karena dinyatakan Allah dalam firman-Nya:\n\nJika kamu tidak menyukai mereka, (maka bersabarlah) karena boleh jadi kamu tidak menyukai sesuatu, padahal Allah menjadikan kebaikan yang banyak padanya. (an-Nisa\\\\\\'\/4: 19)\n\nAdapun orang kafir tidak mempunyai kepercayaan yang demikian. Mereka tidak percaya bahwa suka dan duka yang didatangkan Allah kepada seseorang merupakan cobaan Allah kepadanya. Mereka beranggapan bahwa hal itu merupakan malapetaka baginya. Ketika dalam keadaan senang dan gembira, mereka hanya melihat seakan-akan diri mereka sajalah yang ada, sedangkan yang lain tidak ada, sebagaimana firman Allah:\n\nManusia tidak jemu memohon kebaikan, dan jika ditimpa malapetaka, mereka berputus asa dan hilang harapannya. Dan jika Kami berikan kepadanya suatu rahmat dari Kami setelah ditimpa kesusahan, pastilah dia berkata, “Ini adalah hakku, dan aku tidak yakin bahwa hari Kiamat itu akan terjadi. Dan jika aku dikembalikan kepada Tuhanku, sesungguhnya aku akan memperoleh kebaikan di sisi-Nya.” Maka sungguh, akan Kami beritahukan kepada orang-orang kafir tentang apa yang telah mereka kerjakan, dan sungguh, akan Kami timpakan kepada mereka azab yang berat. (Fussilat\/41: 49-50)",
      "text_translation": "Apabila dia ditimpa kesusahan dia berkeluh kesah, ",
      "text": "اِذَا مَسَّهُ الشَّرُّ جَزُوْعًاۙ",
      "text_translation_en": "[As a rule,] whenever misfortune touches him, he is filled with self-pity;",
      "juz_number": 29
    },
    "21": {
      "text_tafsir_en": "When people are in distress, they are impatient and persistent, sometimes giving up. However, if he receives a lot of sustenance and gifts from God, he becomes stingy. Anxiety and anxiety arise in people because they do not believe in God. She felt as though she was isolated, there was nothing that could help her with that difficulty. But when it comes to sustenance, he feels that it is earned solely by his own efforts, without the assistance of others. They think that the sustenance and gift they receive is not the gift of God. Therefore, the attitude is stubborn. It's more about the believers. He believed that everything that came to him was a test and trial of God, whether it was suffering or pleasure. The trial was given to him to test and strengthen his faith. Therefore, he remained steadfast and steadfast in accepting all trials, and repented to Allah with true repentance if he had done wrong. Instead, when he receives grace and grace from God, he is grateful to him and feels himself bound to that grace. Then he took away the rights of others or the rights of God in his possession, as did the Prophet Job: And (remember) Job, when he prayed to his Lord, \"(My Lord), indeed, I have been afflicted, but You The Merciful God of all mercies. \"So We granted him a prayer, then We removed his sickness and We returned his family to him, and (We increased their number) as a mercy from Us, and as a memorial for Us all who worship us. (Al-Anbiya \\ '\/ 21: 83-84) The believer will not despair and despair over the affairs of the world, and will not affect his soul, because he believes in the Qada and the Qadar of Allah. Not that what is considered bad is bad in God's eyes, and that is good in His sight. On the contrary, what is considered bad is good in God's eyes and what is good in God's eyes is bad. He believes this to be true, for God declares in his Word: If you do not like them, be patient, for it is possible for you to dislike something, but Allah has done him much good. (an-Nisa \\ '\/ 4: 19) But unbelievers do not have such belief. They do not believe that the love and sorrow that God brings to a person is a trial of God to him. They thought it was a disaster for him. When they are happy and happy, they only see themselves as they are, while others are not, as the word of God says: Humans are not tired of asking for good, and when disaster strikes, they give up and lose hope. And if We had bestowed on him a favor from Us after the tribulation, he would have said, \"This is my right, and I do not believe that the Day of Judgment will come. And if I am returned to my Lord, surely I shall have good on his side. \"Verily, We will inform the disbelievers of what they have done, and verily, We shall bear upon them a severe punishment. (Fussilat \/ 41: 49-50)",
      "text_tafsir": "Jika manusia ditimpa kesusahan, mereka tidak sabar dan tabah, kadang-kadang berputus asa. Akan tetapi, jika memperoleh rezeki dan karunia yang banyak dari Allah, ia menjadi kikir. Kegelisahan dan kekikiran itu timbul pada diri manusia lantaran mereka tidak beriman dengan sungguh-sungguh kepada Allah. Ia merasa seakan-akan dirinya terpencil, tidak ada sesuatu pun yang dapat menolongnya dalam kesukaran itu. Namun apabila mendapat rezeki, ia merasa bahwa rezeki itu diperolehnya semata-mata karena usahanya sendiri, tanpa pertolongan dari orang lain. Mereka beranggapan bahwa rezeki dan karunia yang diperolehnya itu bukan karunia dari Allah. Oleh karena itu, timbullah sifat kikir. \n\nLain halnya dengan orang yang beriman. Ia percaya bahwa segala yang datang kepadanya merupakan ujian dan cobaan dari Allah, baik yang datang itu berupa penderitaan maupun kesenangan. Cobaan itu diberikan kepadanya untuk menguji dan menambah kuat imannya. Oleh karena itu, ia tetap tabah dan sabar dalam menerima semua cobaan, serta bertobat kepada Allah dengan tobat yang sesungguhnya jika ada kesalahan yang telah dilakukannya. Sebaliknya jika ia menerima rahmat dan karunia dari Allah, ia bersyukur kepada-Nya dan merasa dirinya terikat dengan rahmat itu. Kemudian ia mengeluarkan hak orang lain atau hak Allah yang ada dalam hartanya itu, sebagaimana yang telah dilakukan Nabi Ayub:\n\nDan (ingatlah kisah) Ayub, ketika dia berdoa kepada Tuhannya, “(Ya Tuhanku), sungguh, aku telah ditimpa penyakit, padahal Engkau Tuhan Yang Maha Penyayang dari semua yang penyayang.” Maka Kami kabulkan (doa)nya, lalu Kami lenyapkan penyakit yang ada padanya dan Kami kembalikan keluarganya kepadanya, dan (Kami lipat gandakan jumlah mereka) sebagai suatu rahmat dari Kami, dan untuk menjadi peringatan bagi semua yang menyembah Kami. (Al-Anbiya\\'\/21: 83-84)\n\nOrang yang beriman tidak akan bersedih hati dan putus asa terhadap urusan dunia yang luput darinya, dan tidak akan berpengaruh pada jiwanya, karena ia yakin kepada Qada dan Qadar Allah. Belum tentu yang dikira buruk itu, buruk pula di sisi Allah, dan yang dikira baik itu, baik pula di sisi-Nya. Mungkin sebaliknya, yang dikira buruk itu, baik di sisi Allah dan yang kelihatannya baik itu adalah buruk di sisi Allah. Ia yakin benar hal yang demikian, karena dinyatakan Allah dalam firman-Nya:\n\nJika kamu tidak menyukai mereka, (maka bersabarlah) karena boleh jadi kamu tidak menyukai sesuatu, padahal Allah menjadikan kebaikan yang banyak padanya. (an-Nisa\\'\/4: 19)\n\nAdapun orang kafir tidak mempunyai kepercayaan yang demikian. Mereka tidak percaya bahwa suka dan duka yang didatangkan Allah kepada seseorang merupakan cobaan Allah kepadanya. Mereka beranggapan bahwa hal itu merupakan malapetaka baginya. Ketika dalam keadaan senang dan gembira, mereka hanya melihat seakan-akan diri mereka sajalah yang ada, sedangkan yang lain tidak ada, sebagaimana firman Allah:\n\nManusia tidak jemu memohon kebaikan, dan jika ditimpa malapetaka, mereka berputus asa dan hilang harapannya. Dan jika Kami berikan kepadanya suatu rahmat dari Kami setelah ditimpa kesusahan, pastilah dia berkata, “Ini adalah hakku, dan aku tidak yakin bahwa hari Kiamat itu akan terjadi. Dan jika aku dikembalikan kepada Tuhanku, sesungguhnya aku akan memperoleh kebaikan di sisi-Nya.” Maka sungguh, akan Kami beritahukan kepada orang-orang kafir tentang apa yang telah mereka kerjakan, dan sungguh, akan Kami timpakan kepada mereka azab yang berat. (Fussilat\/41: 49-50)",
      "text_translation": "dan apabila mendapat kebaikan (harta) dia jadi kikir, ",
      "text": "وَّاِذَا مَسَّهُ الْخَيْرُ مَنُوْعًاۙ",
      "text_translation_en": "and whenever good fortune comes to him, he selfishly withholds it [from others].",
      "juz_number": 29
    },
    "22": {
      "text_tafsir_en": "Such are the qualities of men in general, except those who perform the prayers. Salat is the second pillar of Islam; a sign that distinguishes between believers and unbelievers. If a person prays, he has a relationship with his Lord. He will always remember his Lord. On the contrary, if he does not pray, he will forget his Lord until his relationship is cut off. Verily, I am God, and there is no god but me; therefore worship me and perform my prayer in remembrance of me. (° aha \/ 20: 14) If a person is truly devoted to his prayers, then his heart and mind are directed to God alone. He felt face to face with God in his prayers. His heart was filled with fear because of the sins he had committed beside his hope of his abundance, grace, and grace. Therefore, he promised in his heart that he would abstain and put an end to his prohibitions. His heart was yielding and calmly surrendered to him. Those who do so will avoid evil and evil deeds. Read the Book (Qur'an) that was revealed to you (Muhammad) and perform the Prayer. Verily, that prayer prevents evil (evil) and evil. And remember that Allah is greater than his worship. Allah knows what you do. (Al-'Ankabµt \/ 29: 45) In this verse is mentioned the prayer in the general sense, including the obligatory prayer of five times and the prayers of the sun. This means that all the prayers that God has commanded to do can remove anxiety, calm the heart, and increase the faith of those who do it. However, of course, the most important prayer to do this is the five-hour prayer. Then it is said that the prayer is always performed at any given time, continually, no one is spared to perform even one prayer. This is a condition for performing prayers that can remove anxiety and anxiety.",
      "text_tafsir": "Demikian sifat-sifat manusia pada umumnya, kecuali orang-orang yang mengerjakan salat. Salat merupakan rukun Islam kedua; tanda yang membedakan antara orang yang beriman dengan orang kafir. Jika seseorang salat, berarti ia mempunyai hubungan dengan Tuhannya. Dia akan selalu teringat kepada Tuhannya. Sebaliknya jika ia tidak salat, ia akan lupa kepada Tuhannya sehingga hubungannya terputus.\n\nSungguh, Aku ini Allah, tidak ada tuhan selain Aku, maka sembahlah Aku dan laksanakanlah salat untuk mengingat Aku. (°aha\/20: 14)\n\nJika orang benar-benar khusyuk dalam salatnya, berarti hati dan pikirannya tertuju kepada Allah semata. Dia merasa berhadapan langsung dengan Allah dalam salatnya. Timbul dalam hatinya takut karena dosa-dosa yang telah diperbuatnya di samping penuh harap akan limpahan pahala, rahmat, dan karunia-Nya. Oleh karena itu, ia berjanji dalam hatinya akan menjauhi dan menghentikan larangan-larangan-Nya. Hatinya pasrah dan tenteram menyerahkan diri kepada-Nya. Orang yang salat secara demikian, akan terhindar dari perbuatan keji dan perbuatan mungkar.\n\nBacalah Kitab (Al-Qur'an) yang telah diwahyukan kepadamu (Muhammad) dan laksanakanlah salat. Sesungguhnya salat itu mencegah dari (perbuatan) keji dan mungkar. Dan (ketahuilah) mengingat Allah (salat) itu lebih besar (keutamaannya dari ibadah yang lain). Allah mengetahui apa yang kamu kerjakan. (Al-‘Ankabµt\/29: 45)\n\nDalam ayat ini disebutkan salat dalam arti yang umum, termasuk di dalamnya salat wajib yang lima waktu dan salat-salat sunah. Hal ini berarti bahwa semua salat yang diperintahkan Allah untuk dikerjakan dapat menghilangkan kegelisahan, menenteramkan hati, dan menambah kekuatan iman orang yang mengerjakannya. Sekalipun demikian, tentu salat yang paling diutamakan mengerjakannya ialah salat yang lima waktu.\n\nKemudian diteruskan bahwa salat itu selalu dikerjakan pada setiap waktu yang ditentukan, terus-menerus, tidak ada yang luput dikerjakan walaupun satu salat. Inilah syarat mengerjakan salat yang dapat menghilangkan kegelisahan hati dan kekikiran.",
      "text_translation": "kecuali orang-orang yang melaksanakan salat, ",
      "text": "اِلَّا الْمُصَلِّيْنَۙ",
      "text_translation_en": "Not so, however, those who consciously turn towards God in prayer.",
      "juz_number": 29
    },
    "23": {
      "text_tafsir_en": "Such are the qualities of men in general, except those who perform the prayers. Salat is the second pillar of Islam; a sign that distinguishes between believers and unbelievers. If a person prays, he has a relationship with his Lord. He will always remember his Lord. On the contrary, if he does not pray, he will forget his Lord until his relationship is cut off. Verily, I am God, and there is no god but me; therefore worship me and perform my prayer in remembrance of me. (Thaha \/ 20: 14) If a person is truly devoted to his prayers, then his heart and mind are directed to God alone. He felt face to face with God in his prayers. His heart was filled with fear because of the sins he had committed beside his hope of his abundance, grace, and grace. Therefore, he promised in his heart that he would abstain and put an end to his prohibitions. His heart was yielding and calmly surrendered to him. Those who do so will avoid evil and evil deeds. Read the Book (Qur'an) that was revealed to you (Muhammad) and perform the Prayer. Verily, that prayer prevents evil (evil) and evil. And remember that Allah is greater than his worship. Allah knows what you do. (Al-'Ankabµt \/ 29: 45) In this verse is mentioned the prayer in the general sense, including the obligatory prayer of five times and the prayers of the sun. This means that all the prayers that God has commanded to do can remove anxiety, calm the heart, and increase the faith of those who do it. However, of course, the most important prayer to do this is the five-hour prayer. Then it is said that the prayer is always performed at any given time, continually, no one is spared to perform even one prayer. This is a condition for performing prayers that can remove anxiety and anxiety.",
      "text_tafsir": "Demikian sifat-sifat manusia pada umumnya, kecuali orang-orang yang mengerjakan salat. Salat merupakan rukun Islam kedua; tanda yang membedakan antara orang yang beriman dengan orang kafir. Jika seseorang salat, berarti ia mempunyai hubungan dengan Tuhannya. Dia akan selalu teringat kepada Tuhannya. Sebaliknya jika ia tidak salat, ia akan lupa kepada Tuhannya sehingga hubungannya terputus.\n\nSungguh, Aku ini Allah, tidak ada tuhan selain Aku, maka sembahlah Aku dan laksanakanlah salat untuk mengingat Aku. (Thaha\/20: 14)\n\nJika orang benar-benar khusyuk dalam salatnya, berarti hati dan pikirannya tertuju kepada Allah semata. Dia merasa berhadapan langsung dengan Allah dalam salatnya. Timbul dalam hatinya takut karena dosa-dosa yang telah diperbuatnya di samping penuh harap akan limpahan pahala, rahmat, dan karunia-Nya. Oleh karena itu, ia berjanji dalam hatinya akan menjauhi dan menghentikan larangan-larangan-Nya. Hatinya pasrah dan tenteram menyerahkan diri kepada-Nya. Orang yang salat secara demikian, akan terhindar dari perbuatan keji dan perbuatan mungkar.\n\nBacalah Kitab (Al-Qur‘an) yang telah diwahyukan kepadamu (Muhammad) dan laksanakanlah salat. Sesungguhnya salat itu mencegah dari (perbuatan) keji dan mungkar. Dan (ketahuilah) mengingat Allah (salat) itu lebih besar (keutamaannya dari ibadah yang lain). Allah mengetahui apa yang kamu kerjakan. (Al-‘Ankabµt\/29: 45)\n\nDalam ayat ini disebutkan salat dalam arti yang umum, termasuk di dalamnya salat wajib yang lima waktu dan salat-salat sunah. Hal ini berarti bahwa semua salat yang diperintahkan Allah untuk dikerjakan dapat menghilangkan kegelisahan, menenteramkan hati, dan menambah kekuatan iman orang yang mengerjakannya. Sekalipun demikian, tentu salat yang paling diutamakan mengerjakannya ialah salat yang lima waktu.\n\nKemudian diteruskan bahwa salat itu selalu dikerjakan pada setiap waktu yang ditentukan, terus-menerus, tidak ada yang luput dikerjakan walaupun satu salat. Inilah syarat mengerjakan salat yang dapat menghilangkan kegelisahan hati dan kekikiran.",
      "text_translation": "mereka yang tetap setia melaksanakan salatnya, ",
      "text": "الَّذِيْنَ هُمْ عَلٰى صَلَاتِهِمْ دَاۤىِٕمُوْنَۖ",
      "text_translation_en": "[and] who incessantly persevere in their prayer",
      "juz_number": 29
    },
    "24": {
      "text_tafsir_en": "In addition to performing prayers to commemorate and dedicate themselves to God, humans are commanded to constantly search for the treasure that God has given them; whether in the property there was or was not the right of the poor begging, and the poor having nothing. If they had their rights, he immediately released them because he believed that as long as someone else had the rights to his property, his property had not been consecrated. Take zakat from their property, to purify and purify them, and pray for them. (at-Taubah \/ 9: 103) From the word ¥ aqq ma'lµm (certain section) it is understood that what is meant by this verse is a compulsory charity, namely charity. This is reinforced by the mention of this verse followed by the mention of prayer. In the Qur'an there are twenty-seven places that mention the order of prayer and the order of zakat. This indicates that the two are closely related. With prayer, one can purify himself from all shirk and prohibition, and submit and sacrifice to God only. Whereas with charity, one can purify his property from another and instill in him the belief that the gift of God should be used and utilized for the way he pleases. It is only a means of finding His will, not a purpose of life. In other words, zakat is the result and embodiment of the success of one's prayers.",
      "text_tafsir": "Di samping mengerjakan salat untuk mengingat dan menghambakan diri kepada Allah, manusia diperintahkan agar selalu meneliti harta yang telah dianugerahkan Allah kepadanya; apakah dalam harta itu telah atau belum ada hak orang miskin yang meminta-minta, dan orang miskin yang tidak mempunyai sesuatu apa pun. Jika ada hak mereka, ia segera mengeluarkannya karena dia percaya bahwa selama ada hak orang lain dalam hartanya itu, berarti hartanya belum suci.\n\nAmbillah zakat dari harta mereka, guna membersihkan dan menyucikan mereka, dan berdoalah untuk mereka. (at-Taubah\/9: 103)\n\nDari perkataan ¥aqq ma‘lµm (bagian tertentu) dipahami bahwa yang dimaksud dalam ayat ini ialah sedekah wajib, yaitu zakat. Hal ini diperkuat dengan penyebutannya dalam ayat ini diiringi dengan penyebutan salat. Di dalam Al-Qur‘an terdapat dua puluh tujuh tempat yang menyebutkan secara beriringan perintah mengerjakan salat dengan perintah mengerjakan zakat. Hal ini menunjukkan bahwa keduanya mempunyai hubungan yang erat. Dengan salat, seorang dapat menyucikan dirinya dari segala perbuatan syirik dan terlarang, serta menyerahkan dan menghambakan diri hanya kepada Allah. Sedangkan dengan zakat, seseorang dapat menyucikan hartanya dari milik orang lain serta menanamkan keyakinan dalam dirinya bahwa harta yang dikaruniakan Allah itu harus digunakan dan dimanfaatkan untuk jalan yang diridai-Nya. Harta itu hanya sebagai alat untuk mencari keridaan-Nya, bukan sebagai tujuan hidup. Dengan perkataan lain bahwa zakat adalah hasil dan perwujudan dari berhasilnya salat yang dikerjakan seseorang.",
      "text_translation": "dan orang-orang yang dalam hartanya disiapkan bagian tertentu, ",
      "text": "وَالَّذِيْنَ فِيْٓ اَمْوَالِهِمْ حَقٌّ مَّعْلُوْمٌۖ",
      "text_translation_en": "and in whose possessions there is a due share, acknowledged [by them],",
      "juz_number": 29
    },
    "25": {
      "text_tafsir_en": "In addition to performing prayers to commemorate and dedicate themselves to God, humans are commanded to constantly search for the treasure that God has given them; whether in the property there was or was not the right of the poor begging, and the poor having nothing. If they had their rights, he immediately released them because he believed that as long as someone else had the rights to his property, his property had not been consecrated. Take zakat from their property, to purify and purify them, and pray for them. (at-Taubah \/ 9: 103) From the word ¥ aqq ma'lµm (certain section) it is understood that what is meant by this verse is a compulsory charity, namely charity. This is reinforced by the mention of this verse followed by the mention of prayer. In the Qur'an there are twenty-seven places that mention the order of prayer and the order of zakat. This indicates that the two are closely related. With prayer, one can purify himself from all shirk and prohibition, and submit and sacrifice to God only. Whereas with charity, one can purify his property from another and instill in him the belief that the gift of God should be used and utilized for the way he pleases. It is only a means of finding His will, not a purpose of life. In other words, zakat is the result and embodiment of the success of one's prayers.",
      "text_tafsir": "Di samping mengerjakan salat untuk mengingat dan menghambakan diri kepada Allah, manusia diperintahkan agar selalu meneliti harta yang telah dianugerahkan Allah kepadanya; apakah dalam harta itu telah atau belum ada hak orang miskin yang meminta-minta, dan orang miskin yang tidak mempunyai sesuatu apa pun. Jika ada hak mereka, ia segera mengeluarkannya karena dia percaya bahwa selama ada hak orang lain dalam hartanya itu, berarti hartanya belum suci.\n\nAmbillah zakat dari harta mereka, guna membersihkan dan menyucikan mereka, dan berdoalah untuk mereka. (at-Taubah\/9: 103)\n\nDari perkataan ¥aqq ma‘lµm (bagian tertentu) dipahami bahwa yang dimaksud dalam ayat ini ialah sedekah wajib, yaitu zakat. Hal ini diperkuat dengan penyebutannya dalam ayat ini diiringi dengan penyebutan salat. Di dalam Al-Qur‘an terdapat dua puluh tujuh tempat yang menyebutkan secara beriringan perintah mengerjakan salat dengan perintah mengerjakan zakat. Hal ini menunjukkan bahwa keduanya mempunyai hubungan yang erat. Dengan salat, seorang dapat menyucikan dirinya dari segala perbuatan syirik dan terlarang, serta menyerahkan dan menghambakan diri hanya kepada Allah. Sedangkan dengan zakat, seseorang dapat menyucikan hartanya dari milik orang lain serta menanamkan keyakinan dalam dirinya bahwa harta yang dikaruniakan Allah itu harus digunakan dan dimanfaatkan untuk jalan yang diridai-Nya. Harta itu hanya sebagai alat untuk mencari keridaan-Nya, bukan sebagai tujuan hidup. Dengan perkataan lain bahwa zakat adalah hasil dan perwujudan dari berhasilnya salat yang dikerjakan seseorang.",
      "text_translation": "bagi orang (miskin) yang meminta dan yang tidak meminta, ",
      "text": "لِّلسَّاۤىِٕلِ وَالْمَحْرُوْمِۖ",
      "text_translation_en": "for such as ask [for help] and such as are deprived [of what is good in life];",
      "juz_number": 29
    },
    "26": {
      "text_tafsir_en": "People who do not like to cry are those who perform their prayers and perform charity. They are the ones who believe in the Day of Judgment, the living after death, and the time weighed down by all the deeds they have done throughout life. Good deeds are rewarded in heaven, while evil deeds, which God does not approve, will be rewarded with hell. Those who believe in the hereafter are very confident that they will have the reward of faith and charity that they have practiced throughout their lives on earth. They believe that living in the hereafter is the real life; while living in the world is only temporary, to prepare for the hereafter. Therefore, all kinds of trials that come to them throughout the world are faced with perseverance and patience. They never complained, no matter how hard they tried. They will never think of helping their loved ones in pain and suffering. It has been the basis for the happiness of human life that his efforts to avoid danger and harm are always greater and more important than his efforts to obtain happiness and benefit. However, people in their daily lives sometimes forget or ignore this policy. She is sometimes quickly seduced by something that seems to bring her benefit or benefit her. Then do something without considering or considering the harm it will cause. As a result, he suffered and suffered. That is the punishment and punishment of God for that negligence. There is a Code of Proposal that reads: Preventing harm is first of all taken away.",
      "text_tafsir": "Orang yang tidak suka berkeluh kesah adalah orang yang menjalankan salat dan menunaikan zakat. Merekalah yang percaya adanya hari kiamat, adanya hidup setelah mati, dan waktu ditimbang semua amal perbuatan yang telah dikerjakan selama hidup di dunia. Amal baik dibalas dengan surga, sedangkan perbuatan jahat, yang tidak diridai Allah akan dibalas dengan neraka.\n\nOrang yang percaya akan adanya hari akhirat sangat yakin bahwa mereka pada hari itu akan mendapat pahala iman dan amal yang telah mereka lakukan selama hidup di dunia. Mereka percaya bahwa hidup di akhiratlah hidup yang sebenarnya; sedangkan hidup di dunia hanyalah hidup sementara, untuk mempersiapkan diri bagi hidup di akhirat itu. Oleh karena itu, segala macam cobaan yang datang kepada mereka selama di dunia, dihadapi dengan tabah dan sabar. Mereka tidak pernah berkeluh-kesah, bagaimana pun cobaan yang diderita. Mereka tidak pula akan kikir untuk menolong sesamanya yang hidup dalam kepapaan dan penderitaan.\n\nTelah menjadi dasar bagi kebahagiaan hidup manusia ialah bahwa usahanya menghindarkan diri dari bahaya dan kemudaratan selalu lebih besar dan lebih didahulukan daripada usahanya untuk memperoleh kebahagiaan dan kemanfaatan. Akan tetapi, manusia dalam kehidupannya sehari-hari kadang-kadang lupa atau lalai terhadap dasar ini. Dia kadang-kadang cepat terpukau oleh sesuatu yang kelihatannya akan mendatangkan kebaikan atau memberi manfaat baginya. Maka dikerjakanlah sesuatu itu dengan tidak memperhitungkan atau mempertimbangkan kemudaratan yang akan ditimbulkannya. Akibatnya ia menderita dan sengsara. Itulah hukuman dan azab dari Tuhan atas kelalaian itu.\n\nAda kaidah Usul Fikih yang berbunyi:\n\nMenolak kemudaratan itu didahulukan daripada mengambil maslahat.",
      "text_translation": "dan orang-orang yang mempercayai hari pembalasan, ",
      "text": "وَالَّذِيْنَ يُصَدِّقُوْنَ بِيَوْمِ الدِّيْنِۖ",
      "text_translation_en": "and who accept as true the [coming of the] Day of Judgment;",
      "juz_number": 29
    },
    "27": {
      "text_tafsir_en": "People who do not like to cry are those who perform their prayers and perform charity. They are the ones who believe in the Day of Judgment, the living after death, and the time weighed down by all the deeds they have done throughout life. Good deeds are rewarded in heaven, while evil deeds, which God does not approve, will be rewarded with hell. Those who believe in the hereafter are very confident that they will have the reward of faith and charity that they have practiced throughout their lives on earth. They believe that living in the hereafter is the real life; while living in the world is only temporary, to prepare for the hereafter. Therefore, all kinds of trials that come to them throughout the world are faced with perseverance and patience. They never complained, no matter how hard they tried. They will never think of helping their loved ones in pain and suffering. It has been the basis for the happiness of human life that his efforts to avoid danger and harm are always greater and more important than his efforts to obtain happiness and benefit. However, people in their daily lives sometimes forget or ignore this policy. She is sometimes quickly seduced by something that seems to bring her benefit or benefit her. Then do something without considering or considering the harm it will cause. As a result, he suffered and suffered. That is the punishment and punishment of God for that negligence. There is a Code of Proposal that reads: Preventing harm is first of all taken away.",
      "text_tafsir": "Orang yang tidak suka berkeluh kesah adalah orang yang menjalankan salat dan menunaikan zakat. Merekalah yang percaya adanya hari kiamat, adanya hidup setelah mati, dan waktu ditimbang semua amal perbuatan yang telah dikerjakan selama hidup di dunia. Amal baik dibalas dengan surga, sedangkan perbuatan jahat, yang tidak diridai Allah akan dibalas dengan neraka.\n\nOrang yang percaya akan adanya hari akhirat sangat yakin bahwa mereka pada hari itu akan mendapat pahala iman dan amal yang telah mereka lakukan selama hidup di dunia. Mereka percaya bahwa hidup di akhiratlah hidup yang sebenarnya; sedangkan hidup di dunia hanyalah hidup sementara, untuk mempersiapkan diri bagi hidup di akhirat itu. Oleh karena itu, segala macam cobaan yang datang kepada mereka selama di dunia, dihadapi dengan tabah dan sabar. Mereka tidak pernah berkeluh-kesah, bagaimana pun cobaan yang diderita. Mereka tidak pula akan kikir untuk menolong sesamanya yang hidup dalam kepapaan dan penderitaan.\n\nTelah menjadi dasar bagi kebahagiaan hidup manusia ialah bahwa usahanya menghindarkan diri dari bahaya dan kemudaratan selalu lebih besar dan lebih didahulukan daripada usahanya untuk memperoleh kebahagiaan dan kemanfaatan. Akan tetapi, manusia dalam kehidupannya sehari-hari kadang-kadang lupa atau lalai terhadap dasar ini. Dia kadang-kadang cepat terpukau oleh sesuatu yang kelihatannya akan mendatangkan kebaikan atau memberi manfaat baginya. Maka dikerjakanlah sesuatu itu dengan tidak memperhitungkan atau mempertimbangkan kemudaratan yang akan ditimbulkannya. Akibatnya ia menderita dan sengsara. Itulah hukuman dan azab dari Tuhan atas kelalaian itu.\n\nAda kaidah Usul Fikih yang berbunyi:\n\nMenolak kemudaratan itu didahulukan daripada mengambil maslahat.",
      "text_translation": "dan orang-orang yang takut terhadap azab Tuhannya, ",
      "text": "وَالَّذِيْنَ هُمْ مِّنْ عَذَابِ رَبِّهِمْ مُّشْفِقُوْنَۚ",
      "text_translation_en": "and who stand in dread of their Sustainer's chastisement –",
      "juz_number": 29
    },
    "28": {
      "text_tafsir_en": "There is no one among men who feels secure from the coming of the doom of his Lord. Therefore, he sought to keep himself far from the punishment by fearing him. The punishment of the Lord will only apply to those who do not fear Him. All who truly believe, establish compulsory prayers, perform charity, and believe in the hereafter, the day when true justice will be fulfilled, will not be at peace and will not worry about the coming of the torment of Allah, though they cannot yet determine whether they belong heaven or hell dwellers. What sets the believers at heart is the faith and charity they have worked for. The Word of God: Whoever believes in Allah, in the future, and does good, then they have no fear and they do not grieve. (al-Ma'idah \/ 5: 69) And his word: No! Whoever devotes himself completely to God, and does good, he has the reward of his Lord and there is no fear of them and they are not sorrowful. (al-Baqarah \/ 2: 112)",
      "text_tafsir": "Tidak satu pun di antara manusia yang merasa dirinya aman dari kedatangan azab Tuhannya. Oleh karena itu, ia berusaha agar dia terjauh dari azab itu dengan bertakwa kepada-Nya. Azab Tuhan hanya akan ditimpakan kepada orang yang tidak bertakwa kepada-Nya. Semua orang yang beriman dengan sebenar-benarnya, mendirikan salat wajib, menunaikan zakat, dan percaya kepada adanya hari akhirat, hari dilaksanakan keadilan yang sesungguhnya, akan tenteram hatinya dan tidak merasa khawatir akan kedatangan azab Allah, sekalipun mereka belum dapat memastikan apakah mereka termasuk penghuni surga atau penghuni neraka. Yang menenteramkan hati orang yang beriman itu ialah iman dan amal saleh yang telah dikerjakan. Firman Allah:\n\nBarang siapa beriman kepada Allah, kepada hari kemudian, dan berbuat kebajikan, maka tidak ada rasa khawatir padanya dan mereka tidak bersedih hati. (al-Ma'idah\/5: 69)\n\nDan firman-Nya:\n\nTidak! Barang siapa menyerahkan diri sepenuhnya kepada Allah, dan dia berbuat baik, dia mendapat pahala di sisi Tuhannya dan tidak ada rasa takut pada mereka dan mereka tidak bersedih hati. (al-Baqarah\/2: 112)",
      "text_translation": "sesungguhnya terhadap azab Tuhan mereka, tidak ada seseorang yang merasa aman (dari kedatangannya), ",
      "text": "اِنَّ عَذَابَ رَبِّهِمْ غَيْرُ مَأْمُوْنٍۖ",
      "text_translation_en": "for, behold, of their Sustainer's chastisement none may ever feel [wholly] secure;",
      "juz_number": 29
    },
    "29": {
      "text_tafsir_en": "In these two verses is described the human nature of his peaceful, unkempt and unreasonable man, the one who kept his honor and did not commit adultery. They only do what they are allowed to do, only with their wives or with the girls they have. The word fa innahum malufmµn (therefore they are not blasphemous) gives the sense that the right to interfere with a wife or children in possession is not an indefinite right, but must be in accordance with the terms of the religion. According to Islam, the relationship of husband and wife is a holy relationship, a relationship that is governed by God, a relationship of love, a relationship that is grounded in the desire to follow the Messenger of Allah, and want to have a family. The husband-wife relationship has elements of worship. This relationship is outlined in the Word of God: It is lawful for you to fast at night with your wife. They are your clothing, and you are their clothing. (Al-Baqarah \/ 2: 187) The Messenger of Allah (may peace be upon him) says: From 'Abdullah bin' Amr, the Messenger of Allah (may peace be upon him) said, \"The world is a pleasant thing, for the best of all life is a virtuous wife.\" (Muslim History) This verse instructs husbands that in conducting relations with wives or husbands, masters with girls, it should be done in such a way that in the relationship there are elements of worship, good morals, good manners, etc., so that can maintain his glory and dignity as a Muslim. Not just to satisfy their passions, their biological needs, or their animals, but for a great purpose. Surah Al-Ma'arij is Makkiyyah, so at that time there was no provision of marriage as set forth in Surah an-Nisa '\/ 4: 24-25. The words au ma malakat aimanuhum contained in several surahs, often translated “or the girls they have” This verse needs an explanation, as some commentators have pointed out, that the malad aimanuhum is a divorced woman , which now belonged to him (usually a prisoner of war), and had to be interpreted as a captive in a jihadist war, under the command of a righteous and just priest in the face of opposition to oppress the believers. The female prisoner may be repatriated, but must be married first, and the marriage is not motivated by lust, but to preserve the purity of the woman, in which case the husband avoids the act of adultery and at the same time elevates the dignity of the female from the ex-slave state to war. (which was quite common at the time) became their woman, no longer a slave. This kind of prisoner of war is now out of date. If a Muslim has been able to have relations with his wife or with his slave in accordance with the demands of Islam, then he has been able to control his appetite, since the peak of lust lies in such relationships between men and women. If they have been able to do so, they will be better able to do other lower level things.",
      "text_tafsir": "Dalam dua ayat ini diterangkan sifat manusia yang hatinya tenteram, tidak berkeluh kesah dan tidak kikir, yaitu orang yang menjaga kehormatannya dan tidak melakukan perbuatan zina. Mereka hanya melakukan apa yang telah dihalalkan, hanya menggauli istri-istri mereka atau dengan budak-budak perempuan yang telah mereka miliki.\n\nPerkataan fa innahum gairu malµm³n (maka sesungguhnya mereka tidak tercela) memberi pengertian bahwa hak mencampuri istri atau budak-budak yang dimiliki, bukanlah hak tanpa batas, melainkan harus disesuaikan dengan ketentuan-ketentuan agama. Menurut agama Islam, hubungan suami istri adalah hubungan yang suci, hubungan yang diridai Allah, hubungan cinta kasih, hubungan yang dilatarbelakangi oleh keinginan mengikuti sunah Rasulullah, dan ingin memperoleh keturunan. Hubungan suami-istri mempunyai unsur-unsur ibadah. Hubungan ini dilukiskan dalam firman Allah:\n\nDihalalkan bagimu pada malam hari puasa bercampur dengan istrimu. Mereka adalah pakaian bagimu, dan kamu adalah pakaian bagi mereka. (Al-Baqarah\/2: 187)\n\nRasulullah saw bersabda:\n\nDari ‘Abdullah bin ‘Amr bahwa Rasulullah saw bersabda, “Dunia itu adalah sesuatu yang menyenangkan, sebaik-baik harta benda kehidupan dunia itu ialah istri yang saleh.” (Riwayat Muslim)\n\nAyat ini memberikan petunjuk kepada suami-istri bahwa dalam melakukan hubungan dengan istri atau suami, tuan dengan budak perempuan, hendaklah dilakukan sedemikian rupa, sehingga dalam hubungan itu terdapat unsur-unsur ibadah, akhlak yang mulia, tata cara yang baik, dan sebagainya, sehingga dapat menjaga kemuliaan dan martabatnya sebagai seorang muslim. Tidak sekadar memenuhi hawa nafsu, keperluan biologis, atau seperti yang dilakukan oleh binatang, melainkan untuk tujuan yang agung.\n\nSurah Al-Ma‘arij ini Makkiyyah, jadi waktu itu belum ada ketentuan pernikahan seperti yang kemudian diatur dalam Surah an-Nisa‘\/4: 24-25. Kata-kata au ma malakat aimanuhum yang terdapat dalam beberapa surah, sering diterjemahkan “atau budak-budak perempuan yang mereka miliki” Ayat ini memerlukan penjelasan, seperti dikemukakan oleh beberapa mufasir secara lebih mendalam, bahwa ma malakat aimanuhum ialah perempuan yang sudah bercerai dengan suaminya, yang sekarang menjadi miliknya (biasanya dari tawanan perang), dan harus dalam arti tawanan dalam perang jihad, di bawah perintah imam yang saleh dan adil dalam menghadapi lawan yang hendak menindas orang beriman. Tawanan perempuan itu boleh digauli, tetapi harus dengan dinikahi terlebih dulu, dan perkawinan itu bukan karena didorong oleh nafsu, melainkan untuk memelihara kesucian pihak perempuan, yang dalam hal ini berarti pihak suami menghindari perbuatan zina dan sekaligus mengangkat martabat perempuan dari status budak bekas tawanan perang (yang memang sudah berlaku umum waktu itu) menjadi perempuan mereka, tidak lagi berstatus budak. Kebiasaan tawanan perang semacam ini sekarang sudah tidak berlaku lagi\n\nJika seorang muslim telah dapat melakukan hubungan dengan istrinya atau dengan budaknya sesuai dengan tuntutan agama Islam, berarti ia telah dapat menguasai puncak hawa nafsunya, karena puncak hawa nafsu itu terletak dalam hubungan seperti antara laki-laki dan wanita. Jika mereka telah dapat melakukan yang demikian, maka mereka akan lebih dapat melakukan hal-hal yang lain yang lebih rendah tingkatnya.",
      "text_translation": "dan orang-orang yang memelihara kemaluannya, ",
      "text": "وَّالَّذِيْنَ هُمْ لِفُرُوْجِهِمْ حٰفِظُوْنَۙ",
      "text_translation_en": "and who are mindful of their chastity,",
      "juz_number": 29
    },
    "30": {
      "text_tafsir_en": "In these two verses is described the human nature of his peaceful, unkempt and unreasonable man, the one who kept his honor and did not commit adultery. They only do what they are allowed to do, only with their wives or with the girls they have. The word fa innahum malufmµn (therefore they are not blasphemous) gives the sense that the right to interfere with a wife or children in possession is not an indefinite right, but must be in accordance with the terms of the religion. According to Islam, the relationship of husband and wife is a holy relationship, a relationship that is governed by God, a relationship of love, a relationship that is grounded in the desire to follow the Messenger of Allah, and want to have a family. The husband-wife relationship has elements of worship. This relationship is outlined in the Word of God: It is lawful for you to fast at night with your wife. They are your clothing, and you are their clothing. (Al-Baqarah \/ 2: 187) The Messenger of Allah (may peace be upon him) says: From 'Abdullah bin' Amr, the Messenger of Allah (may peace be upon him) said, \"The world is a pleasant thing, for the best of all life is a virtuous wife.\" (Muslim History) This verse instructs husbands that in conducting relations with wives or husbands, masters with girls, it should be done in such a way that in the relationship there are elements of worship, good morals, good manners, etc., so that can maintain his glory and dignity as a Muslim. Not just to satisfy their passions, their biological needs, or their animals, but for a great purpose. Surah Al-Ma'arij is Makkiyyah, so at that time there was no provision of marriage as set forth in Surah an-Nisa '\/ 4: 24-25. The words au ma malakat aimanuhum contained in several surahs, often translated “or the girls they have” This verse needs an explanation, as some commentators have pointed out, that the malad aimanuhum is a divorced woman , which now belonged to him (usually a prisoner of war), and had to be interpreted as a captive in a jihadist war, under the command of a righteous and just priest in the face of opposition to oppress the believers. The female prisoner may be repatriated, but must be married first, and the marriage is not motivated by lust, but to preserve the purity of the woman, in which case the husband avoids the act of adultery and at the same time elevates the dignity of the female from the ex-slave state to war. (which was quite common at the time) became their woman, no longer a slave. This kind of prisoner of war is now out of date. If a Muslim has been able to have relations with his wife or with his slave in accordance with the demands of Islam, then he has been able to control his appetite, since the peak of lust lies in such relationships between men and women. If they have been able to do so, they will be better able to do other lower level things.",
      "text_tafsir": "Dalam dua ayat ini diterangkan sifat manusia yang hatinya tenteram, tidak berkeluh kesah dan tidak kikir, yaitu orang yang menjaga kehormatannya dan tidak melakukan perbuatan zina. Mereka hanya melakukan apa yang telah dihalalkan, hanya menggauli istri-istri mereka atau dengan budak-budak perempuan yang telah mereka miliki.\n\nPerkataan fa innahum gairu malµm³n (maka sesungguhnya mereka tidak tercela) memberi pengertian bahwa hak mencampuri istri atau budak-budak yang dimiliki, bukanlah hak tanpa batas, melainkan harus disesuaikan dengan ketentuan-ketentuan agama. Menurut agama Islam, hubungan suami istri adalah hubungan yang suci, hubungan yang diridai Allah, hubungan cinta kasih, hubungan yang dilatarbelakangi oleh keinginan mengikuti sunah Rasulullah, dan ingin memperoleh keturunan. Hubungan suami-istri mempunyai unsur-unsur ibadah. Hubungan ini dilukiskan dalam firman Allah:\n\nDihalalkan bagimu pada malam hari puasa bercampur dengan istrimu. Mereka adalah pakaian bagimu, dan kamu adalah pakaian bagi mereka. (Al-Baqarah\/2: 187)\n\nRasulullah saw bersabda:\n\nDari ‘Abdullah bin ‘Amr bahwa Rasulullah saw bersabda, “Dunia itu adalah sesuatu yang menyenangkan, sebaik-baik harta benda kehidupan dunia itu ialah istri yang saleh.” (Riwayat Muslim)\n\nAyat ini memberikan petunjuk kepada suami-istri bahwa dalam melakukan hubungan dengan istri atau suami, tuan dengan budak perempuan, hendaklah dilakukan sedemikian rupa, sehingga dalam hubungan itu terdapat unsur-unsur ibadah, akhlak yang mulia, tata cara yang baik, dan sebagainya, sehingga dapat menjaga kemuliaan dan martabatnya sebagai seorang muslim. Tidak sekadar memenuhi hawa nafsu, keperluan biologis, atau seperti yang dilakukan oleh binatang, melainkan untuk tujuan yang agung.\n\nSurah Al-Ma‘arij ini Makkiyyah, jadi waktu itu belum ada ketentuan pernikahan seperti yang kemudian diatur dalam Surah an-Nisa‘\/4: 24-25. Kata-kata au ma malakat aimanuhum yang terdapat dalam beberapa surah, sering diterjemahkan “atau budak-budak perempuan yang mereka miliki” Ayat ini memerlukan penjelasan, seperti dikemukakan oleh beberapa mufasir secara lebih mendalam, bahwa ma malakat aimanuhum ialah perempuan yang sudah bercerai dengan suaminya, yang sekarang menjadi miliknya (biasanya dari tawanan perang), dan harus dalam arti tawanan dalam perang jihad, di bawah perintah imam yang saleh dan adil dalam menghadapi lawan yang hendak menindas orang beriman. Tawanan perempuan itu boleh digauli, tetapi harus dengan dinikahi terlebih dulu, dan perkawinan itu bukan karena didorong oleh nafsu, melainkan untuk memelihara kesucian pihak perempuan, yang dalam hal ini berarti pihak suami menghindari perbuatan zina dan sekaligus mengangkat martabat perempuan dari status budak bekas tawanan perang (yang memang sudah berlaku umum waktu itu) menjadi perempuan mereka, tidak lagi berstatus budak. Kebiasaan tawanan perang semacam ini sekarang sudah tidak berlaku lagi\n\nJika seorang muslim telah dapat melakukan hubungan dengan istrinya atau dengan budaknya sesuai dengan tuntutan agama Islam, berarti ia telah dapat menguasai puncak hawa nafsunya, karena puncak hawa nafsu itu terletak dalam hubungan seperti antara laki-laki dan wanita. Jika mereka telah dapat melakukan yang demikian, maka mereka akan lebih dapat melakukan hal-hal yang lain yang lebih rendah tingkatnya.",
      "text_translation": "kecuali terhadap istri-istri mereka atau hamba sahaya yang mereka miliki maka sesungguhnya mereka tidak tercela. ",
      "text": "اِلَّا عَلٰٓى اَزْوَاجِهِمْ اَوْ مَا مَلَكَتْ اَيْمَانُهُمْ فَاِنَّهُمْ غَيْرُ مَلُوْمِيْنَۚ",
      "text_translation_en": "[not giving way to their desires] with any but their spouses - that is, those whom they rightfully possess [through wedlock] -: for then, behold, they are free of all blame,",
      "juz_number": 29
    },
    "31": {
      "text_tafsir_en": "Whoever acts outside of these provisions, such as adultery, homosexual or lesbian, they are the ones who go beyond the limits. In the preceding verse, it is explained that among the conditions of the elimination of hardships and stubbornness is the preservation of honor and dignity, which is only by interfering with the wife or the slave possessed. Moreover, by abstaining from acts that could induce or accelerate men to do such prohibited acts, such as free association between men and women, and so forth. Therefore, Allah declares in His Word: Speak to believing men, that they may guard His views, and preserve their chastity; that is, more holy to them. Indeed, Allah knows best what they do. (an-Nµr \/ 24: 30) In this verse it is understood that God commanded the Muslims to keep their views in order to protect themselves from committing adultery.",
      "text_tafsir": "Barang siapa yang berbuat di luar ketentuan-ketentuan tersebut, misalnya berzina, melakukan homoseksual atau lesbian, mereka adalah orang-orang yang melampaui batas.\n\nDalam ayat yang sebelum ini, diterangkan bahwa di antara syarat menghilangkan suka berkeluh kesah dan sifat kikir ialah menjaga kehormatan dan kemuliaan diri, yaitu hanya dengan mencampuri istri atau budak yang dimiliki. Selain dari itu, dengan menjauhi perbuatan-perbuatan yang dapat mendorong atau mempercepat orang melakukan perbuatan yang terlarang itu, seperti pergaulan bebas antara laki-laki dan wanita, dan sebagainya. Oleh karena itu, Allah menegaskan dalam firman-Nya:\n\nKatakanlah kepada laki-laki yang beriman, agar mereka menjaga pandangannya, dan memelihara kemaluannya; yang demikian itu, lebih suci bagi mereka. Sungguh, Allah Maha Mengetahui apa yang mereka perbuat. (an-Nµr\/24: 30)\n\nDalam ayat ini dapat dipahami bahwa Allah memerintahkan agar kaum Muslimin memelihara pandangannya adalah untuk menjaga diri dari perbuatan zina.",
      "text_translation": "Maka barangsiapa mencari di luar itu (seperti zina, homoseks dan lesbian), mereka itulah orang-orang yang melampaui batas. ",
      "text": "فَمَنِ ابْتَغٰى وَرَاۤءَ ذٰلِكَ فَاُولٰۤىِٕكَ هُمُ الْعٰدُوْنَۚ",
      "text_translation_en": "whereas such as seek to go beyond that [limit] are truly transgressors;",
      "juz_number": 29
    },
    "32": {
      "text_tafsir_en": "In this verse, God describes other conditions that can eliminate the impulsiveness and stubbornness, which is to keep the mandate entrusted to him, whether it be the mandate of God, such as compulsory faith, performing prayers, performing charity, pilgrimage, jihad, etc. , as well as the human mandate to him, such as maintaining his genitals, keeping promises, and so on. A mandate is a covenant to preserve something that a servant does to his Lord, himself, and others. Being able to maintain a mandate includes one of the characteristics of a Muslim, and it is this trait that distinguishes believers from hypocrites. The Prophet Muhammad said: \"The signs of the hypocrites are threefold: that is, when he says, he lies, when he promises, he refuses (and blames him), and when he is trusted, he is betrayed.\" (Abu Hurairah's Lords and Muslims)",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan syarat-syarat lain yang dapat menghilangkan sifat suka berkeluh-kesah dan kikir, yaitu memelihara amanat yang dipercayakan kepadanya, baik berupa amanat Allah, seperti wajib beriman, mengerjakan salat, menunaikan zakat, mengerjakan haji, berjihad, dan sebagainya, maupun amanat manusia terhadap dirinya, seperti memelihara kemaluan, memenuhi janji, dan sebagainya. Amanat ialah suatu perjanjian untuk memelihara sesuatu yang dilakukan oleh hamba kepada Tuhannya, dirinya sendiri, dan orang lain.\n\nSanggup memelihara amanat termasuk salah satu dari sifat orang muslim, dan sifat ini pulalah yang membedakan orang mukmin dari orang munafik. Nabi Muhammad bersabda:\n\nNabi Muhammad bersabda, “Tanda-tanda orang munafik itu ada tiga, yaitu: apabila ia berkata, ia berdusta, apabila ia berjanji, ia ingkar (menyalahinya), dan apabila ia diberi amanat, ia berkhianat.” (Riwayat al-Bukhari dan Muslim dari Abu Hurairah)",
      "text_translation": "Dan orang-orang yang memelihara amanat dan janjinya, ",
      "text": "وَالَّذِيْنَ هُمْ لِاَمٰنٰتِهِمْ وَعَهْدِهِمْ رَاعُوْنَۖ",
      "text_translation_en": "and who are faithful to their trusts and to their pledges:",
      "juz_number": 29
    },
    "33": {
      "text_tafsir_en": "The meaning of the phrase \"one who holds fast to his testimony\" contained in this verse is that of a man who gives testimony when it is needed and when he is a witness, he does it rightly, does not lie, does not change or conceal anything in his testimony. The Word of God: And do not conceal the testimony, for whoever conceals it, indeed, his heart is unclean (sinful). Allah knows best what you do. (al-Baqarah \/ 2: 283) Humans are also commanded to act as witnesses to uphold justice with the purpose of seeking God's will, not for a purpose contrary to His teaching. Testify with two eyewitnesses among you and stand firm in the testimony of God. (Al-Alaq \/ 65: 2)",
      "text_tafsir": "Maksud kalimat “orang yang berpegang teguh dengan kesaksiannya” yang terdapat dalam ayat ini ialah orang yang mau melaksanakan kesaksian bila diperlukan dan bila menjadi saksi, ia melakukannya dengan benar, tidak berbohong, tidak mengubah atau menyembunyikan sesuatu dalam kesaksiannya itu. Firman Allah:\n\nDan janganlah kamu menyembunyikan kesaksian, karena barang siapa menyembunyikannya, sungguh, hatinya kotor (berdosa). Allah Maha Mengetahui apa yang kamu kerjakan. (al-Baqarah\/2: 283)\n\nManusia juga diperintahkan untuk melaksanakan kesaksian guna menegakkan keadilan dengan tujuan mencari keridaan Allah, bukan untuk suatu maksud yang berlawanan dengan ajaran-Nya. \n\nPersaksikanlah dengan dua orang saksi yang adil di antara kamu dan hendaklah kamu tegakkan kesaksian itu karena Allah. (Al-Alaq\/65: 2)",
      "text_translation": "dan orang-orang yang berpegang teguh pada kesaksiannya, ",
      "text": "وَالَّذِيْنَ هُمْ بِشَهٰدٰتِهِمْ قَاۤىِٕمُوْنَۖ",
      "text_translation_en": "and who stand firm whenever they bear witness;",
      "juz_number": 29
    },
    "34": {
      "text_tafsir_en": "In addition to the above, there is one more thing that can take away the stubbornness and stubbornness, which is always the preservation of prayer. The meaning of keeping the prayers in this verse is: 1. Trying to complete the requirements of the prayer well and thoroughly, such as examining the clothes worn so that there are no impurities, good wiping, and eliminating anything that can eliminate or reduce the stigma. 2. Strive to perform all the precepts well and perfectly. 3. Do your best. 4. Try to perform a mandatory five-hour prayer. 5. Try to perform the prayer at the beginning of time.",
      "text_tafsir": "Selain yang telah disebutkan di atas, masih ada satu hal lagi yang dapat menghilangkan sifat suka berkeluh kesah dan sifat kikir, yaitu selalu memelihara salat. Pengertian memelihara salat dalam ayat ini ialah:\n\n1. Berusaha melengkapi syarat-syarat salat dengan baik dan sempurna, seperti meneliti pakaian yang dipakai sehingga tidak terdapat najis, berwudu dengan baik, dan mengenyampingkan segala sesuatu yang dapat menghilangkan atau mengurangi kekhusyukan.\n\n2. Berusaha melaksanakan semua rukun salat dengan baik dan sempurna.\n\n3. Berusaha khusyuk.\n\n4. Berusaha melaksanakan salat wajib yang lima waktu.\n\n5. Berusaha melaksanakan salat pada awal waktunya.",
      "text_translation": "dan orang-orang yang memelihara salatnya.",
      "text": "وَالَّذِيْنَ هُمْ عَلٰى صَلَاتِهِمْ يُحَافِظُوْنَۖ",
      "text_translation_en": "and who guard their prayers [from all worldly intent].",
      "juz_number": 29
    },
    "35": {
      "text_tafsir_en": "Humans with the above qualities will have the reward of heaven in the hereafter, and those who do so will be able to eradicate their sorrows and stubbornness from their hearts.",
      "text_tafsir": "Manusia yang mempunyai sifat-sifat di atas akan mendapat balasan surga di akhirat dan orang yang bersifat demikian akan dapat mengikis sifat suka berkeluh kesah dan sifat kikir dari hatinya.",
      "text_translation": "Mereka itu dimuliakan di dalam surga. ",
      "text": "اُولٰۤىِٕكَ فِيْ جَنّٰتٍ مُّكْرَمُوْنَ ۗ ࣖ",
      "text_translation_en": "These it is who in the gardens [of paradise] shall be honoured!",
      "juz_number": 29
    },
    "36": {
      "text_tafsir_en": "According to some interpreters, this verse is related to the events of the Prophet's Messenger (may peace be upon him) and reciting the Qur'an near the Ka'bah. Then the Muslims gathered in groups nearby and mocked them and said that they were better in heaven than Muslims, because they were more honorable. The Meccan monks who came to the Prophet rushed to his right and to his left to hear and observe the verses he was reading, as if they believed him. When they heard the Prophet (s) reciting the Qur'an, they gazed into the eyes like frightened people. They sat to the right of the Messenger in groups and seemed to pay attention to the verses that were read. They were also nodding their heads, but they meant to insult Muhammad.",
      "text_tafsir": "Menurut sebahagian ahli tafsir, ayat ini berhubungan dengan peristiwa ketika Rasulullah saw salat dan membaca Al-Qur‘an di dekat Ka‘bah. Lalu orang-orang musyrik berkumpul berkelompok-kelompok di dekatnya sambil mengejek dan mengatakan bahwa mereka lebih pantas masuk surga daripada kaum Muslimin, karena mereka lebih mulia.\n\nOrang-orang musyrik Mekah yang datang kepada Nabi bergegas duduk di kanan dan di kiri beliau untuk mendengar dan memperhatikan ayat-ayat yang beliau baca, seakan-akan mereka mengimaninya. Bila mendengar Nabi saw membaca Al-Qur‘an, mereka memelototkan mata seperti orang ketakutan. Mereka duduk di kanan-kiri Rasulullah berkelompok-kelompok dan seakan-akan memperhatikan ayat-ayat yang dibacakan itu. Mereka juga mengangguk-anggukkan kepala, tetapi maksud mereka sesungguhnya untuk menghina Nabi Muhammad.",
      "text_translation": "Maka mengapa orang-orang kafir itu datang bergegas ke hadapanmu (Muhammad), ",
      "text": "فَمَالِ الَّذِيْنَ كَفَرُوْا قِبَلَكَ مُهْطِعِيْنَۙ",
      "text_translation_en": "WHAT, THEN, is amiss with such as are bent on denying the truth, that they run about confusedly to and fro before thee,",
      "juz_number": 29
    },
    "37": {
      "text_tafsir_en": "According to some interpreters, this verse is related to the events of the Prophet's Messenger (may peace be upon him) and reciting the Qur'an near the Ka'bah. Then the Muslims gathered in groups nearby and mocked them and said that they were better in heaven than Muslims, because they were more honorable. The Meccan monks who came to the Prophet rushed to his right and to his left to hear and observe the verses he was reading, as if they believed him. When they heard the Prophet (s) reciting the Qur'an, they gazed into the eyes like frightened people. They sat to the right of the Messenger in groups and seemed to pay attention to the verses that were read. They were also nodding their heads, but they meant to insult Muhammad.",
      "text_tafsir": "Menurut sebahagian ahli tafsir, ayat ini berhubungan dengan peristiwa ketika Rasulullah saw salat dan membaca Al-Qur‘an di dekat Ka‘bah. Lalu orang-orang musyrik berkumpul berkelompok-kelompok di dekatnya sambil mengejek dan mengatakan bahwa mereka lebih pantas masuk surga daripada kaum Muslimin, karena mereka lebih mulia.\n\nOrang-orang musyrik Mekah yang datang kepada Nabi bergegas duduk di kanan dan di kiri beliau untuk mendengar dan memperhatikan ayat-ayat yang beliau baca, seakan-akan mereka mengimaninya. Bila mendengar Nabi saw membaca Al-Qur‘an, mereka memelototkan mata seperti orang ketakutan. Mereka duduk di kanan-kiri Rasulullah berkelompok-kelompok dan seakan-akan memperhatikan ayat-ayat yang dibacakan itu. Mereka juga mengangguk-anggukkan kepala, tetapi maksud mereka sesungguhnya untuk menghina Nabi Muhammad.",
      "text_translation": "dari kanan dan dari kiri dengan berkelompok-kelompok?",
      "text": "عَنِ الْيَمِيْنِ وَعَنِ الشِّمَالِ عِزِيْنَ ",
      "text_translation_en": "[coming upon thee] from the right and from the left, in crowds?",
      "juz_number": 29
    },
    "38": {
      "text_tafsir_en": "Allah says that the actions of the polytheists were very surprising. Do they do this because they want to go to heaven? That is not possible because they deny the verses of the Qur'an. Allah provides paradise only for those who believe and do good deeds, not for unbelievers like them.",
      "text_tafsir": "Allah mengatakan bahwa perbuatan orang-orang musyrik itu sangat mengherankan. Apakah mereka berbuat demikian karena ingin masuk surga? Hal itu tidak mungkin karena mereka mengingkari ayat-ayat Al-Qur'an itu. Allah menyediakan surga hanya bagi orang-orang yang beriman dan beramal saleh, bukan untuk orang-orang kafir seperti mereka.",
      "text_translation": "Apakah setiap orang dari orang-orang kafir itu ingin masuk surga yang penuh kenikmatan?",
      "text": "اَيَطْمَعُ كُلُّ امْرِئٍ مِّنْهُمْ اَنْ يُّدْخَلَ جَنَّةَ نَعِيْمٍۙ",
      "text_translation_en": "Does every one of them hope to enter [by this means] a garden of bliss?",
      "juz_number": 29
    },
    "39": {
      "text_tafsir_en": "They think they will go to heaven, because they feel more noble and higher in rank than those who believe. However, their assumption is wrong because they are made from semen as well as all humans, it makes no difference. There is no one person's privilege over another and God does not discriminate. Only what distinguishes the degree of a human being with other human beings is only faith and charity. That is the law of God and no one can change it.",
      "text_tafsir": "Mereka beranggapan akan masuk surga, karena merasa lebih mulia dan lebih tinggi derajatnya daripada orang-orang yang beriman. Akan tetapi, anggapan mereka itu salah karena mereka dijadikan dari air mani seperti juga halnya seluruh manusia, tak ada bedanya. Tidak ada keistimewaan seseorang atas yang lain dan Allah tidak membeda-bedakannya. Hanya yang membedakan derajat seorang manusia dengan manusia yang lain hanya iman dan amal. Hal demikian itu adalah hukum Allah dan tidak seorang pun yang dapat mengubahnya.",
      "text_translation": "Tidak mungkin! Sesungguhnya Kami menciptakan mereka dari apa yang mereka ketahui.",
      "text": "كَلَّاۗ اِنَّا خَلَقْنٰهُمْ مِّمَّا يَعْلَمُوْنَ ",
      "text_translation_en": "Never! For, behold, We have created them out of something that they know [only too well]!",
      "juz_number": 29
    },
    "40": {
      "text_tafsir_en": "God swore by himself as the sovereign Lord and owner of the universe and all its contents, to affirm that He had the power to destroy them immediately and replace them with other people better than themselves. No one can reject His will or refrain from the punishment that will come upon him. In another verse, Allah says: Do you not see that Allah has created the heavens and the earth by right? If He wills, He will destroy you and bring forth new beings (in your place), and that is not difficult for Allah. (Abraham \/ 14: 19-20) At the end of this verse, it is stated that God cannot be defeated by anyone who has been punished for it. They will not be able to avoid it as He explained in His other words: Or do those who commit such evil think that they will escape Our punishment? What a terrible thing they set out to do! (al-'Ankµt \/ 29: 4)",
      "text_tafsir": "Allah bersumpah dengan diri-Nya sebagai Tuhan penguasa dan pemilik alam semesta beserta seluruh isinya, untuk menegaskan bahwa Dia kuasa menghancurkan mereka seketika dan menggantinya dengan umat lain yang lebih baik dari mereka. Tidak seorang pun yang dapat menolak kehendak-Nya atau menghindarkan diri dari azab yang akan ditimpakan itu. Dalam ayat lain, Allah berfirman:\n\nTidakkah kamu memperhatikan bahwa sesungguhnya Allah telah mencipta­kan langit dan bumi dengan hak (benar)? Jika Dia menghendaki, niscaya Dia membinasakan kamu dan mendatangkan makhluk yang baru (untuk menggantikan kamu), dan yang demikian itu tidak sukar bagi Allah. (Ibrahim\/14: 19-20) \n\nPada akhir ayat ini, ditegaskan bahwa Allah tidak dapat dikalahkan oleh siapa pun yang telah ditetapkan azab baginya. Mereka tidak akan dapat menghindarinya sebagaimana diterangkan-Nya dalam firman-Nya yang lain:\n\nAtaukah orang-orang yang mengerjakan kejahatan itu mengira bahwa mereka akan luput dari (azab) Kami? Sangatlah buruk apa yang mereka tetapkan itu! (al-‘Ankabµt\/29: 4)",
      "text_translation": "Maka Aku bersumpah demi Tuhan yang mengatur tempat-tempat terbit dan terbenamnya  (matahari, bulan dan bintang), sungguh, Kami pasti mampu, ",
      "text": "فَلَآ اُقْسِمُ بِرَبِّ الْمَشَارِقِ وَالْمَغٰرِبِ اِنَّا لَقٰدِرُوْنَۙ",
      "text_translation_en": "But nay! I call to witness [Our being] the Sustainer of all the points of sunrise and sunset: verily, well able are We",
      "juz_number": 29
    },
    "41": {
      "text_tafsir_en": "God swore by himself as the sovereign Lord and owner of the universe and all its contents, to affirm that He had the power to destroy them immediately and replace them with other people better than themselves. No one can reject His will or refrain from the punishment that will come upon him. In another verse, Allah says: Do you not see that Allah has created the heavens and the earth by right? If He wills, He will destroy you and bring forth new beings (in your place), and that is not difficult for Allah. (Abraham \/ 14: 19-20) At the end of this verse, it is stated that God cannot be defeated by anyone who has been punished for it. They will not be able to avoid it as He explained in His other words: Or do those who commit such evil think that they will escape Our punishment? What a terrible thing they set out to do! (al-'Ankµt \/ 29: 4)",
      "text_tafsir": "Allah bersumpah dengan diri-Nya sebagai Tuhan penguasa dan pemilik alam semesta beserta seluruh isinya, untuk menegaskan bahwa Dia kuasa menghancurkan mereka seketika dan menggantinya dengan umat lain yang lebih baik dari mereka. Tidak seorang pun yang dapat menolak kehendak-Nya atau menghindarkan diri dari azab yang akan ditimpakan itu. Dalam ayat lain, Allah berfirman:\n\nTidakkah kamu memperhatikan bahwa sesungguhnya Allah telah mencipta­kan langit dan bumi dengan hak (benar)? Jika Dia menghendaki, niscaya Dia membinasakan kamu dan mendatangkan makhluk yang baru (untuk menggantikan kamu), dan yang demikian itu tidak sukar bagi Allah. (Ibrahim\/14: 19-20) \n\nPada akhir ayat ini, ditegaskan bahwa Allah tidak dapat dikalahkan oleh siapa pun yang telah ditetapkan azab baginya. Mereka tidak akan dapat menghindarinya sebagaimana diterangkan-Nya dalam firman-Nya yang lain:\n\nAtaukah orang-orang yang mengerjakan kejahatan itu mengira bahwa mereka akan luput dari (azab) Kami? Sangatlah buruk apa yang mereka tetapkan itu! (al-‘Ankabµt\/29: 4)",
      "text_translation": "untuk mengganti (mereka) dengan kaum yang lebih baik dari mereka, dan Kami tidak dapat dikalahkan. ",
      "text": "عَلٰٓى اَنْ نُّبَدِّلَ خَيْرًا مِّنْهُمْۙ وَمَا نَحْنُ بِمَسْبُوْقِيْنَ ",
      "text_translation_en": "to replace them with [people] better than they are; for there is nothing to prevent Us [from doing what We will].",
      "juz_number": 29
    },
    "42": {
      "text_tafsir_en": "This verse is a strong warning to the Muslims who constantly oppose and reject Muhammad's call. Various ways have been done to raise awareness, but they still refuse. Therefore, Allah ordered the Prophet Muhammad to let the unbelievers reject his call, that they might be drowned in error and neglected by the pleasures of life they enjoyed. They will surely die and be resurrected on the Day of Resurrection. On that day, they only knew the truth of the pamphlet that the Prophet (peace be upon him) had conveyed to them, that is, when they were asked to take responsibility for all their actions in the world.",
      "text_tafsir": "Ayat ini merupakan peringatan keras kepada kaum musyrikin yang selalu menentang dan mengingkari seruan Nabi Muhammad. Berbagai macam cara telah dilakukan untuk menyadarkan, namun mereka tetap ingkar. Oleh karena itu, Allah memerintahkan kepada Nabi Muhammad untuk membiarkan orang-orang musyrik itu mengingkari seruannya, agar mereka tenggelam dalam kesesatan dan lalai oleh kesenangan hidup yang mereka nikmati. Mereka pasti mati dan kemudian dibangkitkan pada hari Kiamat. Pada hari itu, barulah mereka mengetahui kebenaran risalah yang telah disampaikan Nabi saw kepada mereka, yaitu ketika mereka diminta mempertanggungjawabkan semua perbuatan mereka di dunia.",
      "text_translation": "Maka biarkanlah mereka tenggelam dan bermain-main (dalam kesesatan) sampai mereka menjumpai hari yang diancamkan kepada mereka, ",
      "text": "فَذَرْهُمْ يَخُوْضُوْا وَيَلْعَبُوْا حَتّٰى يُلٰقُوْا يَوْمَهُمُ الَّذِيْ يُوْعَدُوْنَۙ",
      "text_translation_en": "Hence, leave them to indulge in idle talk and play [with words] until they face that [Judgment] Day of theirs which they have been promised –",
      "juz_number": 29
    },
    "43": {
      "text_tafsir_en": "On the Day of Judgment, they were resurrected and raised from the grave. They came in a hurry to answer the call that was calling them at the time, hoping it would be something fun. They come in a rush just as they came to worship their idols once in the world.",
      "text_tafsir": "Pada hari Kiamat itu, mereka dihidupkan kembali dan dibangkitkan dari kubur. Mereka datang dengan tergesa-gesa untuk memenuhi panggilan yang memanggil mereka waktu itu dengan harapan panggilan itu berisi sesuatu yang menyenangkan. Mereka datang tergesa-gesa sebagaimana ketika mereka datang untuk menyembah berhala mereka dulu waktu di dunia.",
      "text_translation": "(yaitu) pada hari ketika mereka keluar dari kubur dengan cepat seakan-akan mereka pergi dengan segera kepada berhala-berhala (sewaktu di dunia),",
      "text": "يَوْمَ يَخْرُجُوْنَ مِنَ الْاَجْدَاثِ سِرَاعًا كَاَنَّهُمْ اِلٰى نُصُبٍ يُّوْفِضُوْنَۙ",
      "text_translation_en": "the Day when they shall come forth in haste from their graves, as if racing towards a goal-post,",
      "juz_number": 29
    },
    "44": {
      "text_tafsir_en": "On that promised day, the Muslims ran with their heads bowed to the judgment of God. That was the day Allah had warned them. It was a day of misery and suffering. On that day no one can help but Allah.",
      "text_tafsir": "Pada hari yang dijanjikan itu, orang-orang musyrik berlarian dengan kepala tertunduk menuju pengadilan Allah. Itulah hari yang pernah diperingatkan Allah kepada mereka. Hari itu adalah hari yang penuh kesengsaraan dan penderitaan. Pada hari itu tidak ada suatu pun yang dapat memberi pertolongan selain Allah.",
      "text_translation": "pandangan mereka tertunduk ke bawah diliputi kehinaan. Itulah hari yang diancamkan kepada mereka.",
      "text": "خَاشِعَةً اَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ  ۗذٰلِكَ الْيَوْمُ الَّذِيْ كَانُوْا يُوْعَدُوْنَ ࣖ ",
      "text_translation_en": "with downcast eyes, with ignominy overwhelming them: that Day which they were promised again and…",
      "juz_number": 29
    }
  },
  "name": "المعارج",
  "name_translation_en": "The Ascending Stairways",
  "name_translation": "Tempat Naik",
  "name_latin": "Al-Ma'arij"
}