{
  "number": 71,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 28,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse explains that God sent Noah to his people to convey his religion, that they might fear his terrible torment before his time, and believe and follow his teachings. Noah was the third prophet and apostle of God after Adam and Idris. He was sent to his people who worshiped idols. God told Noah to preach to his people so that they would believe in him and stop idolatry. God threatened that if they did not heed the warning, they would be punished with a terrible punishment as a result of their disobedience.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah mengutus Nabi Nuh kepada kaumnya untuk menyampaikan agama-Nya, supaya mereka takut kepada azab-Nya yang dahsyat sebelum saatnya tiba, serta beriman dan mengikuti ajarannya.\n\nNabi Nuh adalah nabi dan rasul Allah yang ketiga setelah Adam dan Idris. Beliau diutus kepada kaumnya yang menyembah berhala. Allah memerintahkan Nuh agar berdakwah kepada kaumnya itu supaya mereka beriman kepada-Nya dan menghentikan penyembahan berhala. Allah mengancam bahwa jika mereka tidak mengindahkan peringatan itu, mereka akan ditimpa azab yang dahsyat sebagai akibat keingkaran mereka.",
      "text_translation": "Sesungguhnya Kami telah mengutus Nuh kepada kaumnya (dengan perintah), “Berilah kaummu peringatan sebelum datang kepadanya azab yang pedih.” ",
      "text": "اِنَّآ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖٓ اَنْ اَنْذِرْ قَوْمَكَ مِنْ قَبْلِ اَنْ يَّأْتِيَهُمْ عَذَابٌ اَلِيْمٌ ",
      "text_translation_en": "BEHOLD. We sent Noah unto his people. [saying:] \"Warn thy people ere grievous suffering befall them!",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "Noah immediately preached to carry out his mission. He said that he was really an apostle of Allah to invite them to believe and to abandon idolatry.",
      "text_tafsir": "Nuh segera berdakwah untuk melaksanakan tugas kerasulannya. Ia mengatakan bahwa ia benar-benar rasul Allah untuk mengajak mereka beriman dan meninggalkan penyembahan berhala.",
      "text_translation": "Dia (Nuh) berkata, “Wahai kaumku! Sesungguhnya aku ini seorang pemberi peringatan yang menjelaskan kepada kamu, ",
      "text": "قَالَ يٰقَوْمِ اِنِّيْ لَكُمْ نَذِيْرٌ مُّبِيْنٌۙ",
      "text_translation_en": "[And Noah] said: \"O my people! I am but a plain warner to you, [sent to tell you]",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "In this verse, the content of the call of Noah is explained: In the order of worship of the God that Noah delivered, there was a signal that they should do all that was required, and put an end to all that was forbidden. From the command of Allah to worship only, it can be understood that the religion that Noah embraced was a shirk religion. 2.Let them not be afraid of Allah, that is, to do all that He commands and to abstain from what He prohibits. 3. Obey everything He commands and prohibits, because what He commands and prohibits comes from Allah. To obey Noah means to obey God. In order to worship God well and fear Him, the people of Noah need to follow the explanation and example given by Noah.",
      "text_tafsir": "Dalam ayat ini, diterangkan isi seruan Nabi Nuh, yaitu:\n\n1.Hendaklah mereka menyembah Allah saja, Tuhan Yang Maha Esa, tidak ada Tuhan selain Dia. Dalam perintah menyembah Allah yang disampaikan Nuh itu, terkandung isyarat agar mereka mengerjakan segala yang wajib, dan menghentikan segala yang diharamkan. Dari perintah Allah untuk hanya menyembah-Nya, dapat dipahami bahwa agama yang dianut kaum Nuh itu adalah agama syirik.\n\n2.Hendaklah mereka bertakwa kepada Allah, yaitu melaksanakan semua yang diperintahkan dan menjauhi segala yang dilarang-Nya.\n\n3.Menaati segala yang diperintahkan dan dilarangnya, karena apa yang ia perintahkan dan larang itu berasal dari Allah. Menaati Nuh berarti menaati Allah. Untuk dapat beribadah dengan baik kepada Allah dan bertakwa kepada-Nya, kaum Nuh perlu mengikuti penjelasan dan contoh yang diberikan Nabi Nuh.",
      "text_translation": "(yaitu) sembahlah Allah, bertakwalah kepada-Nya dan taatlah kepadaku, ",
      "text": "اَنِ اعْبُدُوا اللّٰهَ وَاتَّقُوْهُ وَاَطِيْعُوْنِۙ ",
      "text_translation_en": "that you should worship God [alone] and be conscious of Him. \"Now do pay heed unto me,",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "In this verse, God's promise to the people of Noah is explained when they obey His call: 1. God will forgive their sins. Their sins of worshiping idols will be erased by their faith. 1. God will extend their life. Although their age is determined, but if they believe, God will prolong their life and stop the torment that will befall them. Doing so is an easy thing for God, for He is the Almighty and the All-Provider. With regard to the issue of delaying the coming of the end, namely the extension of the age mentioned in this verse, some scholars have stated that God will change His destiny, if He wills it. Therefore, obeying God, doing acts of piety, and connecting your relationship can extend human life. The Prophet Muhammad said: From Anas bin Malik, the Messenger of Allah (may peace be upon him) said: Whoever wants to expand his life and extend his life, then he should be friendly. (History of al-Bukhari) This will be much clearer when it comes to psychology. According to psychology, there is a reciprocal relationship between one's physical and spiritual body. Spiritual health greatly affects physical health, and vice versa. Therefore, people are said to be healthy if they are physically and spiritually healthy. Generally the person who is diligent in doing good deeds and communicating friendship is a spiritually healthy person. In other words, fear of God can eliminate spiritual illnesses. If you are spiritually healthy, you will be physically fit and your life will be long. At the end of this verse, God emphasizes that if He decreed the death of a person or of all mankind, after his intention, then his presence could not be delayed nor could it be expedited for a moment.",
      "text_tafsir": "Dalam ayat ini, diterangkan janji Allah kepada kaum Nuh bila mereka mematuhi seruannya, yaitu:\n\n1.Allah akan mengampuni dosa-dosa mereka. Dosa-dosa mereka karena menyembah berhala-berhala itu akan terhapus oleh keimanan mereka. \n\n1.Allah akan memanjangkan umur mereka. Sekalipun umur mereka telah ditentukan, namun jika mereka beriman, Allah akan memanjangkan umur mereka dan menghentikan azab yang akan dijatuhkan kepada mereka. Melakukan yang demikian itu merupakan perkara yang mudah bagi Allah, karena Dia Mahakuasa dan Maha Menentukan segala sesuatu yang dikehendaki-Nya.\n\nSehubungan dengan masalah menangguhkan kedatangan ajal, yakni memanjang umur yang disebut dalam ayat ini, sebagian ahli tafsir menyatakan bahwa Allah akan mengubah takdir yang telah ditentukan-Nya, jika Dia menghendakinya. Oleh karena itu, taat kepada Allah, melakukan perbuatan-perbuatan takwa, dan menghubungkan silaturrahim dapat memanjangkan umur manusia. Nabi Muhammad bersabda:\n\nDari Anas bin Malik, Rasulullah saw bersabda: Barang siapa menghendaki diluaskan rezekinya dan dipanjangkan umurnya maka hendaknya ia menjalin silaturrahim. (Riwayat al-Bukhari)\n\nHal ini akan lebih jelas maksudnya jika dihubungkan dengan ilmu jiwa. Menurut ilmu jiwa, ada hubungan timbal-balik antara jasmani seseorang dengan rohaninya. Kesehatan rohani besar pengaruhnya terhadap kesehatan jasmani, begitu pula sebaliknya. Oleh karena itu, orang dikatakan sehat jika jasmani dan rohaninya sehat. Pada umumnya orang yang tekun mengerjakan amal saleh dan menghubungkan silaturrahim adalah orang yang sehat rohaninya. Dengan perkataan lain, takwa kepada Allah dapat menghilangkan penyakit-penyakit rohani. Jika rohani sehat, tentulah jasmani sehat pula dan umur pun akan panjang.\n\nPada akhir ayat ini, Allah menegaskan bahwa apabila Ia telah menetapkan ajal seseorang atau semua manusia, setelah ikhtiarnya, maka kedatangannya itu tidak dapat ditangguhkan atau tidak pula dapat dipercepat sesaat pun.",
      "text_translation": "niscaya Dia mengampuni sebagian dosa-dosamu dan menangguhkan kamu (memanjangkan umurmu) sampai pada batas waktu yang ditentukan. Sungguh, ketetapan Allah itu apabila telah datang tidak dapat ditunda, seandainya kamu mengetahui.” ",
      "text": "يَغْفِرْ لَكُمْ مِّنْ ذُنُوْبِكُمْ وَيُؤَخِّرْكُمْ اِلٰٓى اَجَلٍ مُّسَمًّىۗ اِنَّ اَجَلَ اللّٰهِ اِذَا جَاۤءَ لَا يُؤَخَّرُۘ لَوْ كُنْتُمْ تَعْلَمُوْنَ ",
      "text_translation_en": "so that He may forgive you some of your sins, and grant you respite until a term known [to Him alone]: but, behold, when the term appointed by God does come, it can never be put back - if you but knew it!\"",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "Noah complained to the people that God had called his people day and night, but they would not listen. In fact, they were being yelled at, getting away and running away from it.",
      "text_tafsir": "Nabi Nuh mengeluhkan sikap kaumnya kepada Allah bahwa sekalipun ia sudah menyeru umatnya siang dan malam, tetapi mereka tetap tidak menghiraukannya. Bahkan, mereka semakin diseru, semakin menjauh dan lari dari seruan itu.",
      "text_translation": "Dia (Nuh) berkata, “Ya Tuhanku, sesungguhnya aku telah menyeru kaumku siang dan malam,",
      "text": "قَالَ رَبِّ اِنِّيْ دَعَوْتُ قَوْمِيْ لَيْلًا وَّنَهَارًاۙ",
      "text_translation_en": "[And after a time, Noah] said: \"O my Sustainer! Verily, I have been calling unto my people night and day",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "Noah complained to the people that God had called his people day and night, but they would not listen. In fact, they were being yelled at, getting away and running away from it.",
      "text_tafsir": "Nabi Nuh mengeluhkan sikap kaumnya kepada Allah bahwa sekalipun ia sudah menyeru umatnya siang dan malam, tetapi mereka tetap tidak menghiraukannya. Bahkan, mereka semakin diseru, semakin menjauh dan lari dari seruan itu.",
      "text_translation": "tetapi seruanku itu tidak menambah (iman) mereka, justru mereka lari (dari kebenaran).",
      "text": "فَلَمْ يَزِدْهُمْ دُعَاۤءِيْٓ اِلَّا فِرَارًا ",
      "text_translation_en": "but my call has only caused them to flee farther and farther away [from Thee].",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "Noah also complained that every time he called upon them to believe and instead of worshiping idols to forgive their sins, they pressed their fingers into the abyss to not hear his cry. They even cover each other's faces so they can't see. This is driven by their hatred for her. More than that, they are also defiant and arrogant.",
      "text_tafsir": "Nabi Nuh juga mengeluhkan bahwa setiap kali ia menyeru mereka agar beriman dan tidak lagi menyembah berhala-berhala agar dosa-dosa mereka diampuni, mereka menyumbatkan jari-jari mereka ke lubang telinga agar tidak mendengar seruannya. Mereka bahkan menutupi muka masing-masing supaya tidak melihatnya. Hal ini didorong oleh kebencian mereka terhadapnya. Lebih dari itu, mereka juga semakin ingkar dan sombong.",
      "text_translation": "Dan sesungguhnya aku setiap kali menyeru mereka (untuk beriman) agar Engkau mengampuni mereka, mereka memasukkan anak jarinya ke telinganya dan menutupkan bajunya (ke wajahnya) dan mereka tetap (mengingkari) dan sangat menyombongkan diri.",
      "text": "وَاِنِّيْ كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوْٓا اَصَابِعَهُمْ فِيْٓ اٰذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَاَصَرُّوْا وَاسْتَكْبَرُوا اسْتِكْبَارًاۚ ",
      "text_translation_en": "And behold, whenever I called unto them with a view to Thy granting them forgiveness, they put their fingers into their ears, and wrapped themselves up in their garments [of sin]; and grew obstinate, and became [yet more] arrogant in their false pride.",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "Noah told God that he had made every effort to make them believe. He addressed them publicly and publicly, sometimes in two ways, by inviting them together in public, and approaching them privately. However, they still reject and reject the call. From this verse it can be understood that Noah performed his duty without regard for the dangers that threatened his soul. Noah loved his people very much, and he wanted them to believe in the punishment of Allah. And he fulfilled his duty with devotion to God.",
      "text_tafsir": "Nabi Nuh mengadukan kepada Allah bahwa segala upaya telah ia lakukan supaya mereka beriman. Ia telah menyeru mereka secara terang-terangan di hadapan umum, dan adakalanya dengan dua cara sekaligus, yaitu mengajak mereka secara bersama di depan umum, dan mendekati mereka seorang demi seorang secara pribadi. Akan tetapi, mereka tetap menampik dan menolak seruan itu.\n\nDari ayat ini dapat dipahami bahwa Nabi Nuh telah melaksanakan tugas tanpa menghiraukan bahaya yang dapat mengancam jiwanya. Nuh sangat cinta kepada kaumnya, dan beliau ingin mereka beriman supaya terhindar dari azab Allah. Dan ia telah melaksanakan tugasnya dengan penuh pengabdian kepada Allah.",
      "text_translation": "Lalu sesungguhnya aku menyeru mereka dengan cara terang-terangan.",
      "text": "ثُمَّ اِنِّيْ دَعَوْتُهُمْ جِهَارًاۙ",
      "text_translation_en": "\"And behold I called unto them openly;",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "Noah told God that he had made every effort to make them believe. He addressed them publicly and publicly, sometimes in two ways, by inviting them together in public, and approaching them privately. However, they still reject and reject the call. From this verse it can be understood that Noah performed his duty without regard for the dangers that threatened his soul. Noah loved his people very much, and he wanted them to believe in the punishment of Allah. And he fulfilled his duty with devotion to God.",
      "text_tafsir": "Nabi Nuh mengadukan kepada Allah bahwa segala upaya telah ia lakukan supaya mereka beriman. Ia telah menyeru mereka secara terang-terangan di hadapan umum, dan adakalanya dengan dua cara sekaligus, yaitu mengajak mereka secara bersama di depan umum, dan mendekati mereka seorang demi seorang secara pribadi. Akan tetapi, mereka tetap menampik dan menolak seruan itu.\n\nDari ayat ini dapat dipahami bahwa Nabi Nuh telah melaksanakan tugas tanpa menghiraukan bahaya yang dapat mengancam jiwanya. Nuh sangat cinta kepada kaumnya, dan beliau ingin mereka beriman supaya terhindar dari azab Allah. Dan ia telah melaksanakan tugasnya dengan penuh pengabdian kepada Allah.",
      "text_translation": "Kemudian aku menyeru mereka secara terbuka dan dengan diam-diam,",
      "text": "ثُمَّ اِنِّيْٓ اَعْلَنْتُ لَهُمْ وَاَسْرَرْتُ لَهُمْ اِسْرَارًاۙ",
      "text_translation_en": "and, behold I preached to them in public; and I spoke to them secretly, in private;",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "Noah called on his people to ask God for their sins of idolatry. If they seek forgiveness, then Allah will surely grant it, for He is Oft-forgiving. Their faith will erase the sin of shirk they have committed.",
      "text_tafsir": "Nuh menyeru kaumnya agar memohon ampun kepada Allah atas dosa-dosa mereka menyembah berhala. Bila mereka memohon ampunan, maka Allah pasti akan mengabulkannya, karena Ia Maha Pengampun. Keimanan mereka akan menghapus dosa-dosa syirik yang telah mereka lakukan.",
      "text_translation": "maka aku berkata (kepada mereka), “Mohonlah ampunan kepada Tuhanmu, Sungguh, Dia Maha Pengampun, ",
      "text": "فَقُلْتُ اسْتَغْفِرُوْا رَبَّكُمْ اِنَّهٗ كَانَ غَفَّارًاۙ",
      "text_translation_en": "and I said: \"'Ask your Sustainer to forgive you your sins - for, verily, He is all-forgiving!",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "Noah conveyed to his people the promise of Allah when they believed in him: 1. He will send down showers that will water their land and produce abundant produce so that they will prosper. 2. Allah will bestow upon them abundant wealth. 3. God will reward many children to continue their descendants, so that they will not perish. 4.He will nourish their gardens, giving them abundant produce. 5.Allah will give them rivers and irrigation to irrigate their gardens, so that they are fertile and green. God's promise to the people of Noah fit in well with the people of that time. The people of Noah are the ancestors of mankind today. Their culture is still at the beginning of human culture. However, the promise of God did not impress them at all. This shows their great disobedience. The promise of God contains a signal that He tells them to use their senses. They seemed to be told to think of rain for them. Rain will fertilize the soil where they live, producing the crops and fruits they need. Some of the produce they can eat and others sell it, thus increasing their wealth. Rain will turn water into rivers that benefit them. If they were to use such a mind, they would have come to the conclusion that it was raining and fertilizing the earth to produce the necessities of life. In the end, they would have come to a conclusion just as the call had been given to them by Noah, to believe in the One True God and to create all their needs.",
      "text_tafsir": "Nabi Nuh menyampaikan kepada kaumnya janji Allah bila mereka beriman kepada-Nya, yaitu:\n\n1.Allah akan menurunkan hujan lebat yang akan menyuburkan tanah mereka dan memberikan hasil yang berlimpah sehingga mereka akan makmur.\n\n2.Allah akan menganugerahkan kepada mereka kekayaan yang berlimpah.\n\n3.Allah akan menganugerahkan anak-anak yang banyak untuk melanjutkan keturunan mereka, sehingga tidak punah.\n\n4.Allah akan menyuburkan kebun-kebun mereka, sehingga memberi hasil yang berlimpah.\n\n5.Allah akan memberi mereka sungai-sungai dan irigasi untuk mengairi kebun-kebun mereka, sehingga subur dan hijau.\n\nJanji Allah kepada umat Nuh sangat cocok dengan masyarakat waktu itu. Umat Nabi Nuh adalah nenek moyang umat manusia sekarang. Kebudayaan mereka masih dalam taraf permulaan kebudayaan manusia. Akan tetapi, janji Allah itu tidak menarik hati mereka sedikit pun. Hal ini menunjukkan keingkaran mereka yang sangat hebat. \n\nJanji Allah itu mengandung isyarat bahwa Ia menyuruh mereka mempergunakan akal pikiran. Mereka seakan-akan disuruh memikirkan kegunaan hujan bagi mereka. Hujan akan menyuburkan bumi tempat mereka berdiam, menghasilkan tanam-tanaman dan buah-buahan yang mereka perlukan. Sebagian hasil pertanian itu bisa mereka makan dan sebagian lainnya dijual, sehingga menambah kekayaan mereka. Hujan akan mengalirkan air menjadi sungai-sungai yang bermanfaat bagi mereka. Jika mereka mau menggunakan pikiran seperti itu, mereka tentu akan sampai kepada kesimpulan tentang siapa yang menurunkan hujan dan menyuburkan bumi sehingga menghasilkan keperluan-keperluan hidup mereka. Akhirnya, mereka tentu akan sampai kepada suatu kesimpulan sebagaimana seruan yang disampaikan Nuh kepada mereka, yaitu beriman kepada Tuhan Yang Maha Esa dan yang menciptakan semua keperluan mereka.",
      "text_translation": "niscaya Dia akan menurunkan hujan yang lebat dari langit kepadamu, ",
      "text": "يُّرْسِلِ السَّمَاۤءَ عَلَيْكُمْ مِّدْرَارًاۙ",
      "text_translation_en": "He will shower upon you heavenly blessings abundant,",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "Noah conveyed to his people the promise of Allah when they believed in him: 1. He will send down showers that will water their land and produce abundant produce so that they will prosper. 2. Allah will bestow upon them abundant wealth. 3. God will reward many children to continue their descendants, so that they will not perish. 4.He will nourish their gardens, giving them abundant produce. 5.Allah will give them rivers and irrigation to irrigate their gardens, so that they are fertile and green. God's promise to the people of Noah fit in well with the people of that time. The people of Noah are the ancestors of mankind today. Their culture is still at the beginning of human culture. However, the promise of God did not impress them at all. This shows their great disobedience. The promise of God contains a signal that He tells them to use their senses. They seemed to be told to think of rain for them. Rain will fertilize the soil where they live, producing the crops and fruits they need. Some of the produce they can eat and others sell it, thus increasing their wealth. Rain will turn water into rivers that benefit them. If they were to use such a mind, they would have come to the conclusion that it was raining and fertilizing the earth to produce the necessities of life. In the end, they would have come to a conclusion just as the call had been given to them by Noah, to believe in the One True God and to create all their needs.",
      "text_tafsir": "Nabi Nuh menyampaikan kepada kaumnya janji Allah bila mereka beriman kepada-Nya, yaitu:\n\n1.Allah akan menurunkan hujan lebat yang akan menyuburkan tanah mereka dan memberikan hasil yang berlimpah sehingga mereka akan makmur.\n\n2.Allah akan menganugerahkan kepada mereka kekayaan yang berlimpah.\n\n3.Allah akan menganugerahkan anak-anak yang banyak untuk melanjutkan keturunan mereka, sehingga tidak punah.\n\n4.Allah akan menyuburkan kebun-kebun mereka, sehingga memberi hasil yang berlimpah.\n\n5.Allah akan memberi mereka sungai-sungai dan irigasi untuk mengairi kebun-kebun mereka, sehingga subur dan hijau.\n\nJanji Allah kepada umat Nuh sangat cocok dengan masyarakat waktu itu. Umat Nabi Nuh adalah nenek moyang umat manusia sekarang. Kebudayaan mereka masih dalam taraf permulaan kebudayaan manusia. Akan tetapi, janji Allah itu tidak menarik hati mereka sedikit pun. Hal ini menunjukkan keingkaran mereka yang sangat hebat. \n\nJanji Allah itu mengandung isyarat bahwa Ia menyuruh mereka mempergunakan akal pikiran. Mereka seakan-akan disuruh memikirkan kegunaan hujan bagi mereka. Hujan akan menyuburkan bumi tempat mereka berdiam, menghasilkan tanam-tanaman dan buah-buahan yang mereka perlukan. Sebagian hasil pertanian itu bisa mereka makan dan sebagian lainnya dijual, sehingga menambah kekayaan mereka. Hujan akan mengalirkan air menjadi sungai-sungai yang bermanfaat bagi mereka. Jika mereka mau menggunakan pikiran seperti itu, mereka tentu akan sampai kepada kesimpulan tentang siapa yang menurunkan hujan dan menyuburkan bumi sehingga menghasilkan keperluan-keperluan hidup mereka. Akhirnya, mereka tentu akan sampai kepada suatu kesimpulan sebagaimana seruan yang disampaikan Nuh kepada mereka, yaitu beriman kepada Tuhan Yang Maha Esa dan yang menciptakan semua keperluan mereka.",
      "text_translation": "dan Dia memperbanyak harta dan anak-anakmu, dan mengadakan kebun-kebun untukmu dan mengadakan sungai-sungai untukmu.” ",
      "text": "وَّيُمْدِدْكُمْ بِاَمْوَالٍ وَّبَنِيْنَ وَيَجْعَلْ لَّكُمْ جَنّٰتٍ وَّيَجْعَلْ لَّكُمْ اَنْهٰرًاۗ",
      "text_translation_en": "and will aid you with worldly goods and children, and will bestow upon you gardens, and bestow upon you running waters.",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "Noah advised his people that they should acknowledge the power of Almighty God. They should also expect the glory of God by believing in him. However, they still do not.",
      "text_tafsir": "Nabi Nuh menasihati kaumnya bahwa mereka seharusnya mengakui kekuasaan Allah yang Mahabesar. Mereka juga seharusnya berharap agar dimuliakan Allah dengan beriman kepada-Nya. Akan tetapi, hal itu tetap tidak mereka lakukan.",
      "text_translation": "Mengapa kamu tidak takut akan kebesaran Allah? ",
      "text": "مَا لَكُمْ لَا تَرْجُوْنَ لِلّٰهِ وَقَارًاۚ",
      "text_translation_en": "\"'What is amiss with you that you cannot look forward to God's majesty,",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "Noah recalls the greatness and power of God that is in them, that He created them gradually. From a drop of semen, then into zygote, blood, a small plate of flesh and bone, a fetus, and then a baby. From infants who do not know anything, they become adults, descendants, and eventually die. By the power of God they should believe in him. The stages of human creation that demonstrate the power of God are also stated in other verses: He created you from the ground, then from the drop of a semen, then from a lump of blood, then you were born as a child, then you were left to adulthood, then you grew old . But some of you were killed before that. So that you may reach the appointed time, that you may understand. (al-Mu'min \/ 40: 67) In another verse, Allah says: And verily, We have created man from the earth. Then We made it a semen (stored) in a strong place (uterus). Then, we make the semen, and then we attach it to a piece of flesh, and we make a lump of flesh, and we wrap it with the flesh. Then, We created it (another) being. Holiness to God, the best Creator. (al-Mu'minun \/ 23: 12-14) Scientifically, the stages of human creation can be described as follows: 1. The level of soil extract, when humans have not yet been described as anything. Please refer again to the explanation of \"soil extract in the scientific text Surah al-hijr \/ 15 verses 26, 28, and 33. 2.Nuthfah level. When all the soil extract, it enters our body, it is used by the body as' starting materials in the process of metabolism of the formation of nuthfah in reproductive cells Nuthfah is translated as semen or drop of semen. as a nuthfatun amsyaj or a drop of mixed semen. once that only one drop of semen (one sperm) was mixed (fertilized) the ovaries, and this was in accordance with embryology. Nuthfah is also referred to as infamous water (ma'in mamas, al-Mursalat \/ 77: 20) or u of water that is emitted (ma'in dafiq, ath-thariq \/ 86: 6). The first is to infer the fact that semen is passed through the genitalia, which is a daily remedy for urination. The latter shows the entry of the sperm into the uterus. 3.Enjoy 'alqah. 'Alaqah is a form of pre-embryonic development, which occurs after mixing of seminal cells (sperm) and egg cells. Moore and Azzindani (1982) explain that 'alaqah in Arabic means leech or a suspended thing or a clot of blood. Leeches are low level animals, shaped like pear, and live by sucking blood. So 'alaqah is an embryonic level (stadium), shaped like a pear, in which the cardiovascular system (cardiac system) begins to appear, and its life depends on its mother's blood, similar to leeches. 'Alaqah is formed about 24-25 days after fertilization. If this pre-embryonic tissue of 'alaqah is taken out (aborted), it does look like a blood clot. 4.Remove Levels. The 'Alaqah formed about 24-25 days after fertilization, then grew to maturity on the 26-27 day, and ended before the 42nd day. The rapid change from 'alaqah to mudhgah is evident in the use of the word fa in surah 23:14. In Arabic the word fa indicates a series of rapid changes. In general, it is translated as' a piece of meat. Mudhgah is an embryonic level shaped like 'chewing gum, which shows irregular surfaces. Mudhgah or 'a piece of meat consists of cells or tissues that have undergone differentiation or have not yet been differentiated. as can be seen in the explanation of Surah al-hajj \/ 22: 5 above by Moore and Azzadani. In verse 5, surah al-hajj \/ 22, is explained: \"...., then from a single piece of flesh (mudhgah) the creation and the imperfect, so that We may explain to you and establish in the womb,\" \"Moore and Azzindani (1982), translating with the phrase \"...., then from a single batch of infected (uninfected) flesh, that We may explain it to you and establish it in the womb, ...\". It is a fact of infancy, consisting of cells or tissues \/ organs that have undergone differentiation. 5.Interior bone formation. Once this level is down, it starts to form bones. This is especially relevant to modern adult embryology. 6.Increase in bone packing by flesh, the fetus begins to form. 7. The fetal level of the womb, is an extension of the 6th Level above. Then proceed with the perfection of human formation. Wallahu a'lam bi as-sawab Such is the journey of human life which shows that human creation is through a complex and vulnerable process. Therefore, their existence in this world should be praised by believing in Allah.",
      "text_tafsir": "Nabi Nuh mengingatkan lagi kebesaran dan kekuasaan Allah yang terdapat di dalam diri mereka, yaitu bahwa mereka diciptakan-Nya secara bertahap. Dari setetes air mani, kemudian menjadi zigot, darah, seberkas lempeng daging dan tulang, janin, dan kemudian dilahirkan. Dari bayi yang tidak tahu suatu apa pun, mereka menjadi manusia dewasa, berketurunan, dan akhirnya meninggal dunia. Berdasarkan kekuasaan Allah itu, mereka seharusnya beriman kepada-Nya.\n\nTahap-tahap kejadian manusia yang menunjukkan kekuasaan Allah itu dinyatakan pula dalam ayat-ayat lain:\n\nDialah yang menciptakanmu dari tanah, kemudian dari setetes mani, lalu dari segumpal darah, kemudian kamu dilahirkan sebagai seorang anak, kemudian dibiarkan kamu sampai dewasa, lalu menjadi tua. Tetapi di antara kamu ada yang dimatikan sebelum itu. (Kami perbuat demikian) agar kamu sampai kepada kurun waktu yang ditentukan, agar kamu mengerti. (al-Mu'min\/40: 67)\n\nDalam ayat lain, Allah berfirman:\n\nDan sungguh, Kami telah menciptakan manusia dari saripati (berasal) dari tanah. Kemudian Kami menjadikannya air mani (yang disimpan) dalam tempat yang kokoh (rahim). Kemudian, air mani itu Kami jadikan sesuatu yang melekat, lalu sesuatu yang melekat itu Kami jadikan segumpal daging, dan segumpal daging itu Kami jadikan tulang belulang, lalu tulang belulang itu Kami bungkus dengan daging. Kemudian, Kami menjadikannya makhluk yang (berbentuk) lain. Mahasuci Allah, Pencipta yang paling baik. (al-Mu'minun\/23: 12-14)\n\nSecara ilmiah, tahapan penciptaan manusia itu dapat dijelaskan sebagai berikut: \n\n1.Tingkat sari pati tanah, ketika manusia belum bisa disebut sebagai apa-apa. Mohon dilihat kembali penjelasan tentang \"sari pati tanah pada telaah ilmiah Surah al-hijr\/15 ayat 26, 28, dan 33.\n\n2.Tingkat nuthfah. Ketika semua sari pati tanah, masuk ke dalam tubuh kita, kemudian digunakan oleh tubuh sebagai 'starting materials dalam proses metabolisme pembentukan nuthfah di dalam sel-sel reproduksi. Nuthfah diterjemahkan sebagai air mani atau setetes mani. Pengertian harfiahnya adalah tetes atau bagian kecil dari fluida (cairan kental, konsentrat). Dalam dunia sains, merupakan konsentrasi fluida yang mengandung sperma. Disebut pula sebagai nuthfatun amsyaj atau setetes mani yang bercampur. Ini mengandung arti percampuran dua nuthfah atau benih, yaitu dari pihak laki-laki (sperma) dan dari pihak wanita (sel telur, ovarium). Dalam Surah al-Insan\/76:2, tampak sekali bahwa hanya satu tetes mani (satu sperma) yang bercampur (membuahi) ovarium. Ini sangat bersesuaian dengan ilmu embryology. Nuthfah disebut pula sebagai air yang hina (ma'in mahin, al-Mursalat\/77: 20) atau air yang terpancar (ma'in dafiq, ath-thariq\/86: 6). Yang pertama, menyiratkan tentang hakikat keluarnya air mani melalui alat genetalia, yang kesehariannya untuk membuang kotoran (urine). Yang terakhir ini menunjukkan proses masuknya nutfah (sperma) ke dalam rahim.\n\n3.Tingkat 'alaqah. 'Alaqah merupakan bentuk perkembangan pra-embrionik, yang terjadi setelah percampuran sel mani (sperma) dan sel telur. Moore dan Azzindani (1982) menjelaskan bahwa 'alaqah dalam Bahasa Arab berarti lintah (leech) atau suatu suspensi (suspended thing) atau segumpal darah (a clot of blood). Lintah merupakan binatang tingkat rendah, berbentuk seperti buah pir, dan hidup dengan cara menghisap darah. Jadi 'alaqah merupakan tingkatan (stadium) embrionik, yang berbentuk seperti buah pir, di mana sistem kardiovaskuler (sistem pembuluh-jantung) sudah mulai tampak, dan hidupnya tergantung dari darah ibunya, mirip dengan lintah. 'Alaqah terbentuk sekitar 24-25 hari sejak pembuahan. Jika jaringan pra-embrionik 'alaqah ini diambil keluar (digugurkan), memang tampak seperti segumpal darah (a blood clot like).\n\n4.Tingkat Mudhgah. 'Alaqah yang terbentuk sekitar 24-25 hari setelah pembuahan, kemudian berkembang menjadi mudhgah pada hari ke 26-27, dan berakhir sebelum hari ke-42. Cepatnya perubahan dari 'alaqah ke mudhgah terlihat dalam penggunaan kata fa pada surah 23:14. Dalam bahasa Arab kata fa menunjukkan rangkaian perubahan yang cepat. Secara umum, mudhgah diterjemahkan sebagai 'segumpal daging. Mudhgah merupakan tingkatan embrionik yang berbentuk seperti 'kunyahan permen karet, yang menunjukkan permukaan yang tidak teratur. Mudhgah atau 'segumpal daging terdiri dari sel-sel atau jaringan-jaringan yang telah mengalami diferensiasi maupun yang belum mengalami diferensiasi. sebagaimana dapat dilihat pada penjelasan pada Surah al-hajj\/22: 5 di atas oleh Moore dan Azzadani. Pada ayat 5, surah al-hajj\/22, dijelaskan: \"....,kemudian dari segumpal daging (mudhgah) yang sempurna kejadiannya dan yang tidak sempurna, agar Kami jelaskan kepada kamu dan Kami tetapkan dalam rahim,...\" Moore dan Azzindani (1982), menerjemahkan dengan kalimat \"....,kemudian dari segumpal daging (mudhgah) yang telah terdiferensiasi dan yang belum terdiferensiasi, agar Kami jelaskan kepada kamu dan Kami tetapkan dalam rahim,...\" . Memang hakikat dari mudhgah, terdiri dari sel-sel atau jaringan\/organ yang telah mengalami diferensiasi maupun yang belum.\n\n5.Tingkat pembentukkan tulang. Setelah tingkat mudhgah inilah, mulai dibentuk tulang. Ini sangat bersesuaian sekali dengan embryology modern dewasa ini.\n\n6.Tingkat pembungkusan tulang oleh daging, Janin mulai terbentuk.\n\n7.Tingkat bayi dalam kandungan, merupakan perkembangan lanjutan dari Tingkat ke-6 di atas. Kemudian dilanjutkan dengan penyempurnaan pembentukan manusia. Wallahu a'lam bi as-sawab\n\nDemikianlah perjalanan hidup manusia yang menunjukkan bahwa kejadian manusia itu melalui proses yang rumit dan rentan. Oleh karena itu, terwujudnya mereka di alam ini hendaknya disyukuri dengan beriman kepada Allah.",
      "text_translation": "Dan sungguh, Dia telah menciptakan kamu dalam beberapa tingkatan (kejadian). ",
      "text": "وَقَدْ خَلَقَكُمْ اَطْوَارًا ",
      "text_translation_en": "seeing that He has created [every one of] you in successive stages?",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "In this verse, Noah asked his people to pay attention to the sky which consists of seven levels. This verse can mean specifically to the people of Noah and can also mean general (for all humans) because this verse uses the words tarau nature (do not you pay attention). To pay attention here means to use the mind. Therefore, the way to pay attention to what is ordered is the way that is commonly used by the scientific world. This verse means specifically for the people of Noah, the intention is that they should use the senses and reason in observing nature. With this observation, they can also find out how great and great nature is. That the sky is vast and terraced can also be understood according to their simple understanding. They should recognize the greatness of God by believing in Him. This verse also applies generally, which is addressed to the people of the Prophet Muhammad until now and in the future. Until now, commentators have not been able to confirm the \"sky\" which consists of seven levels. But about the \"sky\" is not impossible to be found by generations to come. Regarding the heavens, another verse informs: And whether the disbelievers do not know that the heavens and the earth were both fused together, then We separated between the two; and We make everything that lives comes from water; then why don't they believe? (al-Anbiya '\/ 21: 30) What new scientists can now understand is that the universe came from a very dense mass, then exploded, and gave rise to galaxies, the solar system, planets, etc. . However, even that is still a theory called the big bang theory. From this verse it can be understood that the command to think and meditate on the power and greatness of God is directed to all humans, both high levels of knowledge and those that are still low. All human beings are capable and able to do it, thus increasing their faith in God, the Almighty God. This verse also teaches humans about how to recognize and seek His religion, namely by contemplating this natural event. With that reflection, humans will arrive at their Creator. The creator of this nature is surely the Omniscient and Omnipotent, not something that knows nothing and is completely helpless. He is the one who determines all things, the Almighty, does not associate with anything. Therefore, true religion is a religion that recognizes the oneness of God and true worship is worship that is directed directly to Him, does not use intermediaries and so on.",
      "text_tafsir": "Dalam ayat ini, Nuh meminta kaumnya agar memperhatikan langit yang terdiri atas tujuh tingkat. Ayat ini dapat berarti khusus untuk kaum Nuh dan dapat pula berarti umum (untuk seluruh manusia) karena ayat ini menggunakan kata-kata alam tarau (tidakkah kamu memperhatikan). Memperhatikan di sini artinya dengan mempergunakan pikiran. Oleh karena itu, cara memperhatikan yang diperintahkan adalah dengan cara yang lazim digunakan dunia ilmu pengetahuan.\n\nAyat ini berarti khusus untuk umat Nabi Nuh maksudnya adalah mereka seharusnya mempergunakan pancaindra dan akal dalam mengamati alam ini. Dengan pengamatan demikian, mereka juga bisa mengetahui betapa besar dan hebat alam ini. Bahwa langit itu begitu luas dan bertingkat-tingkat juga dapat mereka pahami menurut pemahaman mereka yang sederhana. Mereka seharusnya mengakui kebesaran Allah dengan beriman kepada-Nya.\n\nAyat ini juga berlaku secara umum, yaitu ditujukan kepada umat Nabi Muhammad sampai sekarang dan masa yang akan datang. Sampai sekarang pun para ahli tafsir belum dapat memastikan \"langit\" yang terdiri atas tujuh tingkat itu. Tapi tentang \"langit\" itu tidak mustahil akan ditemukan oleh generasi yang akan datang. Mengenai langit, ayat lain menginformasikan:\n\nDan apakah orang-orang kafir tidak mengetahui bahwa langit dan bumi keduanya dahulunya menyatu, kemudian Kami pisahkan antara keduanya; dan Kami jadikan segala sesuatu yang hidup berasal dari air; maka mengapa mereka tidak beriman? (al-Anbiya'\/21: 30)\n\nApa yang baru dapat dipahami oleh para ilmuwan sekarang adalah bahwa alam semesta ini terjadi dari satu massa yang amat padat, kemudian meledak, dan memunculkan galaksi-galaksi, tata surya, planet-planet, dan sebagainya. Akan tetapi, itu pun masih merupakan teori yang disebut teori big bang (ledakan besar).\n\nDari ayat ini dapat dipahami bahwa perintah memikirkan dan merenungkan kekuasaan dan kebesaran Allah itu tertuju kepada seluruh manusia, baik yang tinggi tingkat pengetahuannya maupun yang masih rendah. Seluruh manusia sanggup dan mampu melakukannya, sehingga menambah kuat imannya kepada Allah, Tuhan Yang Maha Esa.\n\nAyat ini juga mengajarkan kepada manusia mengenai cara mengenal dan mencari agama-Nya, yaitu dengan merenungkan kejadian alam ini. Dengan perenungan itu, manusia akan sampai kepada Penciptanya. Pencipta alam ini tentulah Yang Mahatahu dan Mahakuasa, bukan sesuatu yang tidak tahu apa-apa dan tidak berdaya sama sekali. Dialah yang menentukan segala sesuatu, Yang Maha Esa, tidak berserikat dengan sesuatu apa pun. Oleh karena itu, agama yang benar adalah agama yang mengakui keesaan Tuhan dan ibadah yang benar ialah ibadah yang langsung ditujukan kepada-Nya, tidak menggunakan perantara dan sebagainya.",
      "text_translation": "Tidakkah kamu memperhatikan bagai-mana Allah telah menciptakan tujuh langit berlapis-lapis?",
      "text": "اَلَمْ تَرَوْا كَيْفَ خَلَقَ اللّٰهُ سَبْعَ سَمٰوٰتٍ طِبَاقًاۙ",
      "text_translation_en": "\"'Do you not see how God has created seven heavens in full harmony with one another,",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "Noah explained to his people that the God who was worshiped created a glowing moon and the sun was shining. From that verse it can be understood that: 1. The sun emits its own light, while the moon gets light from the sun. The light emitted by the moon comes from the sun's rays that are reflected on the earth. Therefore, sunlight is harder and brighter than moonlight. 2. Light and light are useful for humans, but different forms of use. The verse that distinguishes light and light from two celestial bodies, the sun and the moon has been repeatedly stated. Stars have a source of light, whereas planets don't. An explanation of this can be seen in Surah Yunus \/ 10: 5. The description of this scientifically is this: In discussing celestial bodies, the Qur'an has also distinguished stars and planets. Stars are celestial bodies that emit light, whereas planets only reflect light received from stars. He is the one who made the sun shine and the moon shine, and He is the one who determines the places of its orbit, so that you know the number of years, and the calculation of time. God did not create it that way but it is true. He explained the signs (His greatness) to those who knew. (Jonah \/ 10: 5) The sun is the largest celestial body in our solar system. It is a glowing gas mass, with a diameter of about 1.4 million km. The average distance between the center point of the earth and the sun is around 150 million km. In the center of the sun, the temperature reaches around 20.0000C. In astronomy, the sun is a celestial body that is classified into types of stars. In this universe there are billions, even trillions of stars. The sun is one of them. The star is a celestial body that emits light because on the surface and inside the star is still going on powerful nuclear nuclear reactions. The results of this reaction that causes light rays. Whereas 10 celestial bodies orbiting the sun, including the earth (and the moon orbiting the earth), are classified into types of planets. The number of stars is estimated at more than 6 billion, and may even reach 100 billion. However, only around 6,000 stars can be observed with the naked eye. The temperature, color, size and density of stars varies. The hottest stars are generally bluish white. Its surface temperature can reach 20.0000C. While the less hot yellow, as the sun. There are sizes that exceed thousands or millions of times the size of the Sun. The closest star to the solar system is 4,000 light years. If the speed of light is 186,000 miles per second, the distance of the nearest star reaches 104 x 109 miles. The closest star light to the solar system, Alpha Centauri, takes 4 years to reach Earth. Being the \"farthest\" star, Riga, the light only reached the earth more than 1,000 years later. Compare with sunlight that reaches the earth in just 4 minutes. Planets can be categorized as dead stars. Its surface has cooled, and turned into solids. Planet does not emit light. However, if it is illuminated by a source of light (for example the sun), then it will reflect it, so it looks like it is glowing. Thus, the word 'luminous can be interpreted as being visible to the eye because it reflects the light received from the source of light. The moon shines because it reflects the light it receives from the sun.",
      "text_tafsir": "Nabi Nuh menerangkan kepada kaumnya bahwa Allah yang disembah itu menciptakan bulan bercahaya dan matahari bersinar. Dari ayat itu dapat dipahami bahwa:\n\n1.Matahari memancarkan sinar sendiri, sedang bulan mendapat cahaya dari matahari. Cahaya yang dipancarkan bulan berasal dari sinar matahari yang dipantulkannya ke bumi. Oleh karena itu, sinar matahari lebih keras dan terang dari cahaya bulan.\n\n2.Sinar dan cahaya itu berguna bagi manusia, tetapi bentuk kegunaannya berbeda-beda.\n\nAyat yang membedakan cahaya dan sinar dari dua benda langit, matahari dan bulan telah berkali-kali dikemukakan. Bintang mempunyai sumber sinar, sedangkan planet tidak. Penjelasan mengenai hal ini dapat dilihat pada Surah Yunus\/10: 5. Uraian mengenai hal ini secara ilmiah adalah demikian:\n\nDalam membicarakan benda-benda angkasa, Al-Qur'an juga sudah membedakan bintang dan planet. Bintang adalah benda langit yang memancarkan sinar, sedangkan planet hanya memantulkan sinar yang diterima dari bintang. \n\nDialah yang menjadikan matahari bersinar dan bulan bercahaya, dan Dialah yang menetapkan tempat-tempat orbitnya, agar kamu mengetahui bilangan tahun, dan perhitungan waktu. Allah tidak menciptakan demikian itu melainkan dengan benar. Dia menjelaskan tanda-tanda (kebesaran-Nya) kepada orang-orang yang mengetahui. (Yunus\/10: 5)\n\nMatahari adalah benda angkasa terbesar dalam tata surya kita. Ia merupakan gumpalan gas yang berpijar, dengan garis tengah sekitar 1,4 juta km. Jarak rata-rata antara titik pusat bumi dan matahari sekitar 150 juta km. Di pusat matahari, suhu mencapai sekitar 20.0000C.\n\nDalam ilmu astronomi, matahari merupakan benda langit yang digolongkan ke dalam jenis bintang. Di jagad raya ini terdapat miliaran, bahkan triliunan bintang. Matahari adalah salah satunya. Bintang merupakan benda langit yang memancarkan sinar karena di permukaan maupun bagian dalam bintang masih berlangsung reaksi-reaksi nuklir hidrogen yang dahsyat. Hasil reaksi inilah yang menimbulkan pancaran sinar. Sedangkan 10 benda langit yang mengorbit matahari, termasuk di dalamnya bumi (dan bulan yang mengorbit bumi), digolongkan ke dalam jenis planet.\n\nJumlah bintang diperkirakan lebih dari 6 miliar, bahkan boleh jadi mencapai 100 miliar. Akan tetapi, hanya sekitar 6.000 bintang yang dapat diamati dengan mata telanjang. Suhu, warna, ukuran, dan kepadatan bintang bervariasi. Bintang yang terpanas umumnya berwarna putih kebiruan. Suhu permukaannya dapat mencapai 20.0000C. Sedangkan yang kurang panas berwarna kuning, sebagaimana matahari. Ukurannya ada yang melebihi ribuan atau jutaan kali ukuran Matahari. Adapun jarak bintang terdekat dari tata surya adalah 4.000 tahun cahaya. Apabila kecepatan cahaya 186.000 mil per detik, maka jarak bintang terdekat tersebut mencapai 104 x 109 mil. Cahaya bintang terdekat ke tata surya, Alpha Centauri, memerlukan waktu 4 tahun untuk mencapai bumi. Sedang bintang \"terjauh\", Riga, cahayanya baru mencapai bumi lebih dari 1.000 tahun kemudian. Bandingkan dengan cahaya matahari yang mencapai bumi dalam hanya 4 menit saja.\n\nPlanet dapat dikategorikan sebagai bintang yang telah 'mati. Permukaannya telah mendingin, dan berubah menjadi padatan. Planet tidak memancarkan sinar. Akan tetapi, apabila ia disinari oleh satu sumber sinar (misal matahari), maka ia akan memantulkannya, sehingga tampak seperti bercahaya. Dengan demikian, kata 'bercahaya dapat diartikan sebagai dapat dilihat oleh mata karena memantulkan sinar yang diterima dari sumber sinar. Bulan bercahaya karena memantulkan sinar yang diterimanya dari matahari.",
      "text_translation": "Dan di sana Dia menciptakan bulan yang bercahaya dan menjadikan matahari sebagai pelita (yang cemerlang)?",
      "text": "وَّجَعَلَ الْقَمَرَ فِيْهِنَّ نُوْرًا وَّجَعَلَ الشَّمْسَ سِرَاجًا ",
      "text_translation_en": "and has set up within them the moon as a light [reflected] and set up the sun as a [radiant] lamp?",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "Noah further explained to his people that God Almighty and must be worshiped was God who made humans grow with nutrients derived from the soil. In addition, humans are also created from the soil, which is from sperm and ova which are formed from food that comes from the soil. From the sperm and ovum formed from nutrients that come from the soil fertilization occurs, then they grow into humans like the growth of plants. Plants in their life experience various processes, humans too. The people of Noah did not learn from the process of human creation. They still deny God and do not believe in His greatness. This is what Noah reminded them of in this verse.",
      "text_tafsir": "Nabi Nuh selanjutnya menerangkan kepada kaumnya bahwa Allah Yang Maha Esa dan wajib disembah itu adalah Tuhan yang membuat manusia tumbuh dengan nutrisi yang berasal dari tanah. Di samping itu, manusia juga diciptakan dari tanah yaitu dari mani dan ovum yang terbentuk dari makanan yang berasal dari tanah. \n\nDari mani dan ovum yang terbentuk dari nutrisi yang berasal dari tanah itu terjadi pembuahan, kemudian mereka tumbuh menjadi manusia seperti tumbuhnya tanaman. Tanaman dalam perjalanan hidupnya mengalami berbagai macam proses, manusia juga demikian. Umat kaum Nuh tidak mengambil pelajaran dari proses penciptaan manusia itu. Mereka tetap mengingkari Tuhan dan tidak mempercayai kebesaran-Nya. Inilah yang diingatkan oleh Nabi Nuh kepada mereka dalam ayat ini.",
      "text_translation": "Dan Allah menumbuhkan kamu dari tanah, tumbuh (berangsur-angsur), ",
      "text": "وَاللّٰهُ اَنْۢبَتَكُمْ مِّنَ الْاَرْضِ نَبَاتًاۙ",
      "text_translation_en": "\"'And God has caused you to grow out of the earth in [gradual] growth; and thereafter He will return you to it [in death]:",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "Noah also explained to his people that they would die and would be returned to the ground or buried. Then they will be removed from the land on the Day of Judgment to be held accountable. Because of that accountability, they should have faith and do good in life in this world.",
      "text_tafsir": "Nabi Nuh juga menerangkan kepada kaumnya bahwa mereka akan mati dan akan dikembalikan ke dalam tanah atau dikuburkan. Selanjutnya mereka akan dikeluarkan dari tanah itu pada hari Kiamat untuk diminta pertanggungjawabannya. Karena adanya pertanggungjawaban itu, mereka seharusnya beriman dan berbuat baik dalam kehidupan di dunia ini.",
      "text_translation": "kemudian Dia akan mengembalikan kamu ke dalamnya (tanah) dan mengeluarkan kamu (pada hari Kiamat) dengan pasti. ",
      "text": "ثُمَّ يُعِيْدُكُمْ فِيْهَا وَيُخْرِجُكُمْ اِخْرَاجًا ",
      "text_translation_en": "and [then] He will bring you forth [from It] in resurrection.",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "Allah reiterates the blessings He has bestowed on humans, that He has created a wide and flat earth so that they can carry out life easily. With the flatness of the surface of the earth, humans can make a path so they can explore the earth to places far away. These verses illustrate that the earth has been made relatively flat (plane) of God, apart from the fact that on earth many mountains are used as piles of the earth's surface, and the fact that 70% of the earth's surface is sea level. However, the surface profile of the earth is relatively flat and smooth compared to planets or other heavenly bodies in the universe. According to experts, the condition of the earth including its surface is very much in accordance with the conditions of life and the comfort of humans who inhabit it. God with His grace has conditioned the surface of the earth so that humans enjoy the comfort of life on earth. Why did God make the surface of the earth flat (as a stretch)? The reason is so that humans can explore the streets. This means that God expects humans to study and explore the entire surface and content of the bowels of the earth. What is meant by \"walking the streets\" is not only physically exploring the surface of the earth, but also scientifically. To achieve or produce knowledge, humans need to wander, explore while observing all the ins and outs and all corners of the earth, in order to carry out its function as the caliph of God on the surface of the earth. The accumulation of human knowledge about the earth is called earth science, and in further development humans need to study earth science as well as earth science as well as relevant science and technology to be able to manage this earth.",
      "text_tafsir": "Allah menegaskan lagi nikmat yang telah dilimpahkan-Nya kepada manusia, yaitu Dia telah menciptakan bumi luas dan datar sehingga mereka dapat menjalankan kehidupan dengan mudah. Dengan datarnya permukaan bumi, manusia dapat membuat jalan sehingga mereka dapat menjelajahi bumi sampai ke tempat-tempat yang jauh letaknya.\n\nAyat-ayat ini menggambarkan bahwa bumi telah dijadikan Allah relatif datar (plane), terlepas dari fakta bahwa di bumi banyak gunung yang dijadikan sebagai tiang pancang permukaan bumi, dan fakta bahwa 70% dari permukaan bumi berupa permukaan laut. Namun demikian, profil permukaan bumi relatif lebih rata dan mulus dibandingkan dengan planet atau benda-benda langit lainnya di alam semesta. Menurut para ahli, kondisi bumi termasuk permukaannya sangat sesuai dengan kondisi kehidupan dan kenyamanan manusia yang menghuninya. Allah dengan kerahmanan-Nya telah mengkondisikan permukaan bumi sehingga manusia menikmati kenyamanan kehidupan di dunia. Mengapa Allah menjadikan permukaan bumi datar (sebagai hamparan)? Sebabnya ialah supaya manusia dapat menjelajahi jalan-jalannya. Ini berarti bahwa Allah mengharapkan manusia agar mempelajari dan mengeksplorasi seluruh permukaan maupun kandungan perut bumi. Yang dimaksud dengan \"menjalani jalan-jalan\" ini ialah bukan hanya secara fisik menjelajahi permukaan bumi, tapi juga secara ilmiah. Untuk mencapai atau menghasilkan pengetahuan manusia perlu mengembara, menjelajahi seraya mengamati seluruh seluk beluk dan semua pelosok bumi, agar bisa menjalankan fungsinya sebagai khalifah Allah di permukaan bumi. Akumulasi pengetahuan manusia mengenai bumi disebut ilmu bumi, dan pada perkembangan lebih lanjut manusia perlu mempelajari ilmu bumi dan juga ilmu-ilmu kebumian serta ilmu pengetahuan dan teknologi yang relevan untuk dapat mengelola bumi ini.",
      "text_translation": "Dan Allah menjadikan bumi untukmu sebagai hamparan, ",
      "text": "وَاللّٰهُ جَعَلَ لَكُمُ الْاَرْضَ بِسَاطًاۙ",
      "text_translation_en": "\"'And God has made the earth a wide expanse for you,",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "Allah reiterates the blessings He has bestowed on humans, that He has created a wide and flat earth so that they can carry out life easily. With the flatness of the surface of the earth, humans can make a path so they can explore the earth to places far away. These verses illustrate that the earth has been made relatively flat (plane) of God, apart from the fact that on earth many mountains are used as piles of the earth's surface, and the fact that 70% of the earth's surface is sea level. However, the surface profile of the earth is relatively flat and smooth compared to planets or other heavenly bodies in the universe. According to experts, the condition of the earth including its surface is very much in accordance with the conditions of life and the comfort of humans who inhabit it. God with His grace has conditioned the surface of the earth so that humans enjoy the comfort of life on earth. Why did God make the surface of the earth flat (as a stretch)? The reason is so that humans can explore the streets. This means that God expects humans to study and explore the entire surface and content of the bowels of the earth. What is meant by \"walking the streets\" is not only physically exploring the surface of the earth, but also scientifically. To achieve or produce knowledge, humans need to wander, explore while observing all the ins and outs and all corners of the earth, in order to carry out its function as the caliph of God on the surface of the earth. The accumulation of human knowledge about the earth is called earth science, and in further development humans need to study earth science as well as earth science as well as relevant science and technology to be able to manage this earth.",
      "text_tafsir": "Allah menegaskan lagi nikmat yang telah dilimpahkan-Nya kepada manusia, yaitu Dia telah menciptakan bumi luas dan datar sehingga mereka dapat menjalankan kehidupan dengan mudah. Dengan datarnya permukaan bumi, manusia dapat membuat jalan sehingga mereka dapat menjelajahi bumi sampai ke tempat-tempat yang jauh letaknya.\n\nAyat-ayat ini menggambarkan bahwa bumi telah dijadikan Allah relatif datar (plane), terlepas dari fakta bahwa di bumi banyak gunung yang dijadikan sebagai tiang pancang permukaan bumi, dan fakta bahwa 70% dari permukaan bumi berupa permukaan laut. Namun demikian, profil permukaan bumi relatif lebih rata dan mulus dibandingkan dengan planet atau benda-benda langit lainnya di alam semesta. Menurut para ahli, kondisi bumi termasuk permukaannya sangat sesuai dengan kondisi kehidupan dan kenyamanan manusia yang menghuninya. Allah dengan kerahmanan-Nya telah mengkondisikan permukaan bumi sehingga manusia menikmati kenyamanan kehidupan di dunia. Mengapa Allah menjadikan permukaan bumi datar (sebagai hamparan)? Sebabnya ialah supaya manusia dapat menjelajahi jalan-jalannya. Ini berarti bahwa Allah mengharapkan manusia agar mempelajari dan mengeksplorasi seluruh permukaan maupun kandungan perut bumi. Yang dimaksud dengan \"menjalani jalan-jalan\" ini ialah bukan hanya secara fisik menjelajahi permukaan bumi, tapi juga secara ilmiah. Untuk mencapai atau menghasilkan pengetahuan manusia perlu mengembara, menjelajahi seraya mengamati seluruh seluk beluk dan semua pelosok bumi, agar bisa menjalankan fungsinya sebagai khalifah Allah di permukaan bumi. Akumulasi pengetahuan manusia mengenai bumi disebut ilmu bumi, dan pada perkembangan lebih lanjut manusia perlu mempelajari ilmu bumi dan juga ilmu-ilmu kebumian serta ilmu pengetahuan dan teknologi yang relevan untuk dapat mengelola bumi ini.",
      "text_translation": "agar kamu dapat pergi kian kemari di jalan-jalan yang luas. ",
      "text": "لِّتَسْلُكُوْا مِنْهَا سُبُلًا فِجَاجًا ࣖ ",
      "text_translation_en": "so that you might walk thereon on spacious paths.’\"",
      "juz_number": 29
    },
    "21": {
      "text_tafsir_en": "Noah complained to God that his people were still wicked to him. They would not listen to his voice, and they would follow their leaders, who were rich men, who had wealth and children. However, the property is only for use. Their children are also not well educated, so as they grow older, they become perverted and evil",
      "text_tafsir": "Nuh mengadu kepada Allah bahwa umatnya tetap durhaka kepadanya. Mereka tidak mau mengikuti seruannya, dan tetap mengikuti pemimpin-pemimpin mereka yang terdiri dari orang-orang kaya, yang mempunyai harta dan anak-anak yang banyak. Akan tetapi, harta itu hanya digunakan untuk berfoya-foya. Anak-anak mereka juga tidak dididik dengan baik, sehingga bila dewasa nanti, mereka menjadi sesat dan jahat",
      "text_translation": "Nuh berkata, “Ya Tuhanku, sesungguhnya mereka durhaka kepadaku, dan mereka mengikuti orang-orang yang harta dan anak-anaknya hanya menambah kerugian baginya, ",
      "text": "قَالَ نُوْحٌ رَّبِّ اِنَّهُمْ عَصَوْنِيْ وَاتَّبَعُوْا مَنْ لَّمْ يَزِدْهُ مَالُهٗ وَوَلَدُهٗٓ اِلَّا خَسَارًاۚ ",
      "text_translation_en": "[And] Noah continued: \"O my Sustainer! Behold, they have opposed me [throughout], for they follow people whose wealth and children lead them increasingly into ruin,",
      "juz_number": 29
    },
    "22": {
      "text_tafsir_en": "This verse explains that the leaders and leaders of the people of Noah did all kinds of trickery to thwart and destroy the religion that Noah carried. These include obstructing and threatening those who seek to obey Noah, strengthen the position of idols, and even incite the people to persecute Noah.",
      "text_tafsir": "Ayat ini menerangkan bahwa para pembesar dan pemimpin umat Nabi Nuh, melakukan segala macam tipu muslihat untuk menghambat dan menghancurkan agama yang dibawa Nabi Nuh. Di antaranya adalah dengan menghalangi dan mengancam orang-orang yang hendak mengikuti seruan Nuh, memperkuat kedudukan berhala, dan bahkan menghasut masyarakat untuk menganiaya Nabi Nuh.",
      "text_translation": "dan mereka melakukan tipu daya yang sangat besar.” ",
      "text": "وَمَكَرُوْا مَكْرًا كُبَّارًاۚ",
      "text_translation_en": "and who have devised a most awesome blasphemy [against Thee],",
      "juz_number": 29
    },
    "23": {
      "text_tafsir_en": "The leaders of the people of Noah asked his people not to abandon the gods their ancestors worshiped. They were told to worship their idols, wadd, suwa ', yuguts, ya'uq and nasr. These five idols are the most revered idols among the many idols of the tribe of Noah. Each tribe also has its own idols that are different from one another. This is where scholars think that shirk religion began to flourish in the days of Noah. Previously, in the days of Adam and Idris, there was no belief in shirk or idolatry. The worship of many idols came down to the Arabs. Therefore, the Arabs also have idols named after the people of Noah. According to the history of al-Bukhari, Ibn al-Mundhir, and Ibn Mardawaih of Ibn 'Abbas, he said, \"Then the idols moved to the Arabs, then Wadd became the idol of the Calb tribe, Suwa\" became the idol of the Hudhail tribe, the Yaguts become idols The Murad family later moved to the Guthaif tribe; Ya'uq became the idol of the Hamdan tribe, and Nasr became the idol of the Himyar tribe. \" In addition, there are idols other than those mentioned in the above verses worshiped by the people of Noah, who later transferred to the Arabs, such as al-Lat, the idol-worshipers of tha'if; al-'Uzza, the idol of the tribes of Solomon, Gathfan, and Jushi; The heart, the idol of the Khuza'ah tribe in Qudaid; Asaf, Na'ilah, and Hubal, idols worshiped by the people of Mecca. Hubal was the largest and most important idol, according to them, placed on the Kaaba. They made idols for themselves to worship. The transfer of idols from other nations to the Arabs as indicated by the history above shows that the teachings of monotheism brought by the Prophet Muhammad were universal or universal. That teaching is not only for the Arabs, but also for the Gentiles.",
      "text_tafsir": "Pembesar-pembesar umat Nabi Nuh meminta kaumnya agar tidak meninggalkan tuhan-tuhan yang telah disembah nenek moyang mereka dahulu. Mereka disuruh untuk tetap menyembah berhala-berhala mereka yaitu, wadd, suwa', yuguts, ya'uq dan nasr.\n\nKelima berhala tersebut merupakan berhala yang paling dihormati di antara sekian banyak berhala kabilah-kabilah kaum Nuh. Masing-masing kabilah juga mempunyai berhala-berhala sendiri yang berbeda-beda satu sama lain. Dari sinilah para ulama berpendapat bahwa agama syirik mulai berkembang pada zaman Nabi Nuh. Sebelumnya, yaitu pada masa Nabi Adam dan Idris, belum ada keyakinan syirik ataupun penyembahan berhala.\n\nPenyembahan kepada banyak berhala itu kemudian turun kepada bangsa Arab. Oleh karena itu, bangsa Arab juga memiliki berhala-berhala yang dinamai dengan nama-nama yang pernah dipakai oleh umat Nuh.\n\nMenurut riwayat al-Bukhari, Ibnu al-Mundhir, dan Ibnu Mardawaih dari Ibnu 'Abbas bahwa ia berkata, \"Kemudian berhala-berhala itu pindah kepada bangsa Arab, maka Wadd menjadi berhala kabilah Kalb, Suwa' menjadi berhala kabilah Hudhail, Yaguts menjadi berhala kabilah Murad yang kemudian berpindah kepada kabilah Guthaif; Ya'uq menjadi berhala kabilah Hamdan, dan Nasr menjadi adalah nama berhala kabilah Himyar.\"\n\nDi samping itu, juga terdapat berhala-berhala selain tersebut dalam ayat di atas yang disembah oleh umat Nuh, yang kemudian berpindah pula kepada bangsa Arab, seperti al-Lat, berhala kaum tsaqif di tha'if; al-'Uzza, berhala kabilah Sulaim, Gathfan, dan Jusyam; Manah, berhala kabilah Khuza'ah di Qudaid; Asaf, Na'ilah, dan Hubal, berhala-berhala yang disembah penduduk Mekah. Hubal adalah berhala yang terbesar dan teragung, menurut mereka, yang diletakkan di atas Ka'bah. Berhala-berhala itu mereka buat sendiri untuk disembah.\n\nPerpindahan berhala-berhala itu dari bangsa-bangsa lain ke bangsa Arab seperti diisyaratkan oleh riwayat di atas menunjukkan bahwa ajaran monoteisme yang dibawa oleh Nabi Muhammad berlaku atau bersifat universal. Ajaran itu tidak hanya untuk bangsa Arab, tetapi juga untuk bangsa-bangsa lain.",
      "text_translation": "Dan mereka berkata, “Jangan sekali-kali kamu meninggalkan (penyembahan) tuhan-tuhan kamu dan jangan pula sekali-kali kamu meninggalkan (penyembahan) Wadd, dan jangan pula Suwa‘, Yagus, Ya‘uq dan Nasr.” ",
      "text": "وَقَالُوْا لَا تَذَرُنَّ اٰلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَّلَا سُوَاعًا ەۙ وَّلَا يَغُوْثَ وَيَعُوْقَ وَنَسْرًاۚ",
      "text_translation_en": "inasmuch as they said [to their followers], 'Do not ever abandon your gods: abandon neither Wadd nor Suwa', and neither Yaghuth nor Ya’uq nor Nasr!'",
      "juz_number": 29
    },
    "24": {
      "text_tafsir_en": "The leaders and leaders of the people of Noah had misled their people from the way of God and influenced them with all kinds of deceit, and they followed him. Thus, those who came after them followed in their footsteps, to the Arabs of ignorance. The following prayer of Abraham indicates that the worship of the idol continued until his time. Therefore, he prayed to Allah that his grandchildren should avoid the idolatry. The word of Allah: And (remember) when Abraham prayed, \"O Lord, make this land a safe haven, and keep me and my children from worshiping idols. Whoever obeys me, then he is my companion, and whoever disobeys me, you are Forgiving, Merciful. \" (Abraham \/ 14: 35-36) At the end of this verse, Noah prays that God may increase the error of his people. He did so because they had been wronged, that is, to refuse and to refuse when advised. That prayer was supplicated by Noah after seeing that his people could no longer be counseled in any way.",
      "text_tafsir": "Para pembesar dan pemimpin umat Nabi Nuh telah menyesatkan masyarakatnya dari jalan Allah dan mempengaruhi mereka dengan berbagai macam tipu muslihat, sehingga mereka mengikutinya. Dengan demikian, orang-orang yang datang sesudah mereka kemudian mengikuti jejak mereka, sampai kepada orang-orang Arab Jahiliah.\n\nDoa Nabi Ibrahim berikut mengindikasikan bahwa penyembahan berhala itu terus berlangsung sampai ke zamannya. Oleh karena itulah, ia berdoa kepada Allah agar anak cucunya terhindar dari meyembah berhala tersebut. Firman Allah:\n\nDan (ingatlah), ketika Ibrahim berdoa, \"Ya Tuhan, jadikanlah negeri ini (Mekah), negeri yang aman, dan jauhkanlah aku beserta anak cucuku agar tidak menyembah berhala. Ya Tuhan, berhala-berhala itu telah menyesatkan banyak dari manusia. Barang siapa mengikutiku, maka orang itu termasuk golonganku, dan barang siapa mendurhakaiku, maka Engkau Maha Pengampun, Maha Penyayang.\" (Ibrahim\/14: 35-36)\n\nPada akhir ayat ini, Nuh berdoa agar Allah menambah kesesatan kaumnya itu. Hal itu ia lakukan karena mereka sudah zalim, yaitu ingkar dan semakin ingkar ketika dinasihati. Doa itu dimohonkan Nabi Nuh setelah melihat bahwa kaumnya tidak mungkin lagi dinasihati dengan cara apa pun.",
      "text_translation": "Dan sungguh, mereka telah menyesatkan banyak orang; dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kesesatan. ",
      "text": "وَقَدْ اَضَلُّوْا كَثِيْرًا ەۚ وَلَا تَزِدِ الظّٰلِمِيْنَ اِلَّا ضَلٰلًا",
      "text_translation_en": "\"And so they have led many a one astray: hence, ordain Thou that these evildoers stray but farther and farther away [from all that they may desire]!\"",
      "juz_number": 29
    },
    "25": {
      "text_tafsir_en": "This verse explains that God drowned the wicked people of Noah with a great flood. All this is due to their disobedience and sin to God. In such a situation, no one can escape them from the torment of Allah. Even the idol they worship cannot save themselves from ruin, let alone help others. In the hereafter, they will be cast into Hell. In earlier verses, as in Surah Hud, it is explained that after Noah thought that his people could not answer his cry, then by the revelation of God, he began to build the ship. When the ship was finished, the flood came, and Noah and his family and those who believed in it could be saved.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menenggelamkan umat Nabi Nuh yang zalim itu dengan banjir yang luar biasa besarnya. Semua itu disebabkan keingkaran dan dosa mereka kepada Allah. Dalam keadaan demikian, tidak seorang pun yang dapat menghindarkan mereka dari azab Allah. Bahkan berhala yang mereka sembah itu tidak dapat menolong diri dari kehancuran, apalagi menolong orang lain. Di akhirat nanti, mereka akan dijebloskan ke dalam neraka Jahanam.\n\nDalam ayat-ayat yang sebelumnya, seperti dalam Surah Hud, telah diterangkan bahwa setelah Nabi Nuh berpendapat bahwa kaumnya tidak mungkin memperkenankan seruannya, maka atas wahyu Allah, beliau mulai membuat kapal. Setelah kapal selesai, banjir pun datang, sehingga Nuh dan keluarganya beserta orang-orang yang beriman dengannya dapat diselamatkan dengan kapal itu",
      "text_translation": "Disebabkan kesalahan-kesalahan mereka, mereka ditenggelamkan lalu dimasukkan ke neraka, maka mereka tidak mendapat penolong selain Allah.",
      "text": "مِمَّا خَطِيْۤـٰٔتِهِمْ اُغْرِقُوْا فَاُدْخِلُوْا نَارًا ەۙ فَلَمْ يَجِدُوْا لَهُمْ مِّنْ دُوْنِ اللّٰهِ اَنْصَارًا",
      "text_translation_en": "And so, because of their sins, they were drowned [in the great flood], and were doomed to suffer the fire [of the hereafter]; and they found none who could succour them against God.",
      "juz_number": 29
    },
    "26": {
      "text_tafsir_en": "At the time of the flood, Noah prayed to God that He would destroy all the unbelievers by drowning them. This request of Noah was granted by God. The reason Noah prayed to God to destroy all the unbelievers was: 1. If any of them were left alive, they would still try to mislead mankind. 2.If some of them are left alive, they will bring down infidels and try to make others unbelievers. Noah concluded that the unbelievers in his day would no longer believe. This conclusion is based on his experience calling them 950 years. Therefore, he prayed to the Lord that all unbelievers should be drowned without leaving any one among them. In another verse, Allah says: And We save them from those who deny Our Signs. Indeed, they are the wicked, so We drowned them all. (al-Anbiya '\/ 21: 77)",
      "text_tafsir": "Pada waktu terjadinya banjir itu, Nabi Nuh berdoa kepada Allah agar Dia memusnahkan seluruh orang-orang kafir dengan menenggelamkan mereka. Permohonan Nuh ini dikabulkan Allah.\n\nAlasan Nabi Nuh berdoa kepada Allah agar memusnahkan seluruh orang-orang kafir adalah:\n\n1.Jika di antara mereka ada yang dibiarkan hidup, mereka tetap akan berusaha menyesatkan manusia.\n\n2.Jika di antara mereka ada yang dibiarkan hidup, mereka akan menurunkan anak-anak yang kafir pula dan akan berusaha menjadikan orang-orang lain menjadi kafir.\n\nNabi Nuh berkesimpulan bahwa orang-orang kafir yang berada di zamannya itu tidak mungkin lagi akan beriman. Kesimpulannya ini didasarkan pada pengalamannya menyeru mereka selama 950 tahun. Oleh karena itulah, dia berdoa kepada Tuhan agar seluruh orang kafir itu ditenggelamkan tanpa meninggalkan seorang pun di antara mereka.\n\nPada ayat yang lain, Allah berfirman:\n\nDan Kami menolongnya dari orang-orang yang telah mendustakan ayat-ayat Kami. Sesungguhnya mereka adalah orang-orang yang jahat, maka Kami tenggelamkan mereka semuanya. (al-Anbiya'\/21: 77)",
      "text_translation": "Dan Nuh berkata, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.",
      "text": "وَقَالَ نُوْحٌ رَّبِّ لَا تَذَرْ عَلَى الْاَرْضِ مِنَ الْكٰفِرِيْنَ دَيَّارًا ",
      "text_translation_en": "And Noah prayed: \"O my Sustainer! Leave not on earth any of those who deny the truth:",
      "juz_number": 29
    },
    "27": {
      "text_tafsir_en": "At the time of the flood, Noah prayed to God that He would destroy all the unbelievers by drowning them. This request of Noah was granted by God. The reason Noah prayed to God to destroy all the unbelievers was: 1. If any of them were left alive, they would still try to mislead mankind. 2.If some of them are left alive, they will bring down infidels and try to make others unbelievers. Noah concluded that the unbelievers in his day would no longer believe. This conclusion is based on his experience calling them 950 years. Therefore, he prayed to the Lord that all unbelievers should be drowned without leaving any one among them. In another verse, Allah says: And We save them from those who deny Our Signs. Indeed, they are the wicked, so We drowned them all. (al-Anbiya '\/ 21: 77)",
      "text_tafsir": "Pada waktu terjadinya banjir itu, Nabi Nuh berdoa kepada Allah agar Dia memusnahkan seluruh orang-orang kafir dengan menenggelamkan mereka. Permohonan Nuh ini dikabulkan Allah.\n\nAlasan Nabi Nuh berdoa kepada Allah agar memusnahkan seluruh orang-orang kafir adalah:\n\n1.Jika di antara mereka ada yang dibiarkan hidup, mereka tetap akan berusaha menyesatkan manusia.\n\n2.Jika di antara mereka ada yang dibiarkan hidup, mereka akan menurunkan anak-anak yang kafir pula dan akan berusaha menjadikan orang-orang lain menjadi kafir.\n\nNabi Nuh berkesimpulan bahwa orang-orang kafir yang berada di zamannya itu tidak mungkin lagi akan beriman. Kesimpulannya ini didasarkan pada pengalamannya menyeru mereka selama 950 tahun. Oleh karena itulah, dia berdoa kepada Tuhan agar seluruh orang kafir itu ditenggelamkan tanpa meninggalkan seorang pun di antara mereka.\n\nPada ayat yang lain, Allah berfirman:\n\nDan Kami menolongnya dari orang-orang yang telah mendustakan ayat-ayat Kami. Sesungguhnya mereka adalah orang-orang yang jahat, maka Kami tenggelamkan mereka semuanya. (al-Anbiya'\/21: 77)",
      "text_translation": "Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka hanya akan melahirkan anak-anak yang jahat dan tidak tahu bersyukur. ",
      "text": "اِنَّكَ اِنْ تَذَرْهُمْ يُضِلُّوْا عِبَادَكَ وَلَا يَلِدُوْٓا اِلَّا فَاجِرًا كَفَّارًا ",
      "text_translation_en": "for, behold, If Thou dost leave them, they will [always try to] lead astray those who worship Thee, and will give birth to nothing but wickedness and stubborn ingratitude.",
      "juz_number": 29
    },
    "28": {
      "text_tafsir_en": "After Noah prayed to God to destroy the unbelievers, he prayed for the safety of himself and his parents and all the believers. At the end of the verse, Noah begs God again to increase the disbelief of the unbelievers, so that they will finally experience the unspeakable doom on the Day of Judgment.",
      "text_tafsir": "Setelah Nuh berdoa kepada Allah agar membinasakan orang-orang kafir, beliau berdoa untuk keselamatan diri dan kedua orang tuanya serta seluruh orang-orang yang beriman. \n\nPada akhir ayat, Nuh memohon lagi kepada Allah agar menambah kesesatan orang-orang kafir, sehingga mereka akhirnya akan merasakan azab yang tidak terkirakan di hari Kiamat.",
      "text_translation": "Ya Tuhanku, ampunilah aku, ibu bapakku, dan siapa pun yang memasuki rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan. Dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kehancuran.”",
      "text": "رَبِّ اغْفِرْ لِيْ وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَّلِلْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِۗ وَلَا تَزِدِ الظّٰلِمِيْنَ اِلَّا تَبَارًا ࣖ",
      "text_translation_en": "\"O my Sustainer! Grant Thy forgiveness unto me and unto my parents, and unto everyone who enters my house as a believer, and unto all believing men and believing women [of later times]; and grant Thou that the doers of evil shall increasingly meet with destruction!\"'",
      "juz_number": 29
    }
  },
  "name": "نوح",
  "name_translation_en": "Noah",
  "name_translation": "Nuh",
  "name_latin": "Nuh"
}