{
  "number": 73,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 20,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad, who is enveloped in prayer, to perform the prayer at night. God's call to the Prophet Muhammad was preceded by the words \"O blanket",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad yang sedang berselimut supaya mendirikan salat pada sebagian malam. Seruan Allah kepada Nabi Muhammad ini didahului dengan kata-kata \"Hai orang yang berselimut",
      "text_translation": "Wahai orang yang berselimut (Muhammad)!",
      "text": "يٰٓاَيُّهَا الْمُزَّمِّلُۙ",
      "text_translation_en": "O THOU enwrapped one!",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad, who is enveloped in prayer, to perform the prayer at night. God's call to the Prophet Muhammad was preceded by the words \"O blanket",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad yang sedang berselimut supaya mendirikan salat pada sebagian malam. Seruan Allah kepada Nabi Muhammad ini didahului dengan kata-kata \"Hai orang yang berselimut",
      "text_translation": "Bangunlah (untuk salat) pada malam hari, kecuali sebagian kecil,",
      "text": "قُمِ الَّيْلَ اِلَّا قَلِيْلًاۙ",
      "text_translation_en": "Keep awake [in prayer] at night, all but a small part",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "God explained the meaning of the word in the preceding verse, half or more. Allah gave it to the Prophet Muhammad to choose the time of night prayer. It can choose between one third, one or two third nights. Allah gave Prophet Muhammad the freedom to choose such times. One third of the nights according to Indonesian time is between 10 and 11 pm, two nights is between 12 and 1 pm and two-thirds of the time is between 2 and 3 hours before dawn.",
      "text_tafsir": "Allah menerangkan maksud perkataan sebagian yang terdapat dalam ayat sebelumnya, yaitu separuh atau lebih. Allah menyerahkan kepada Nabi Muhammad untuk memilih waktu melakukan salat malam. Ia dapat memilih antara sepertiga, seperdua, atau dua pertiga malam. Allah memberi kebebasan kepada Nabi Muhammad untuk memilih waktu-waktu tersebut. \n\nSepertiga malam menurut waktu Indonesia ialah kira-kira antara jam 10 dan jam 11 malam, seperdua malam ialah waktu antara jam 12 dan 1 malam dan dua pertiga malam ialah waktu antara jam 2 dan 3 sampai sebelum fajar.",
      "text_translation": "(yaitu) separuhnya atau kurang sedikit dari itu,",
      "text": "نِّصْفَهٗٓ اَوِ انْقُصْ مِنْهُ قَلِيْلًاۙ",
      "text_translation_en": "of one-half thereof - or make it a little less than that,",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "In this verse, Allah ordered Prophet Muhammad to read the Qur'an carefully (tartil). The point is to read the Qur'an slowly, read fluently, and feel the meaning and purpose of the verses that are read, so that it is memorable in the heart. This command was carried out by the Prophet. 'Aisha narrated that Rasulullah SAW read the Qur'an with tartil, so that the surah that he read became longer than he read normally. In connection with this verse, al-Bukhari and Muslim narrated from 'Abdullah bin Mugaffal, that he said: I saw the Messenger of Allah on the day of the conquest of the city of Mecca, riding a camel he read the Surah al-Fath where he read tarji' (reading) slow reading by repeating). (History of al-Bukhari and Muslim from 'Abdullah bin Mugaffal) Author of the book Fathul Bayan said, \"What is meant by tartil is the presence of the heart when reading, not just making sounds from the throat by tilting the face and mouth with the strains of songs, as is the custom done by readers of the Qur'an today. Reading like that is a reading done by people who do not understand religion. \" Reading the Qur'an in tartil contains wisdom, that is the opportunity to pay attention to the contents of the verses that are read and when chanting the name of Allah, the reader will feel His majesty. When it arrives at a verse that contains a promise, the reader will arise expectations, likewise when reading the threat verse, the reader will feel anxious. Instead of reading the Qur'an in a hurry or with a good song, but not understanding the meaning is an indication that the reader does not pay attention to the content contained in the verse he is reading.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad supaya membaca Al-Qur'an secara seksama (tartil). Maksudnya ialah membaca Al-Qur'an dengan pelan-pelan, bacaan yang fasih, dan merasakan arti dan maksud dari ayat-ayat yang dibaca itu, sehingga berkesan di hati. Perintah ini dilaksanakan oleh Nabi saw. 'Aisyah meriwayatkan bahwa Rasulullah saw membaca Al-Qur'an dengan tartil, sehingga surah yang dibacanya menjadi lebih lama dari ia membaca biasa.\n\nDalam hubungan ayat ini, al-Bukhari dan Muslim meriwayatkan dari 'Abdullah bin Mugaffal, bahwa ia berkata:\n\nAku melihat Rasulullah saw pada hari penaklukan kota Mekah, sedang menunggang unta beliau membaca Surah al-Fath di mana dalam bacaan itu beliau melakukan tarji' (bacaan lambat dengan mengulang-ulang). (Riwayat al-Bukhari dan Muslim dari 'Abdullah bin Mugaffal)\n\nPengarang buku Fathul Bayan berkata, \"Yang dimaksud dengan tartil ialah kehadiran hati ketika membaca, bukan asal mengeluarkan bunyi dari tenggorokan dengan memoncong-moncongkan muka dan mulut dengan alunan lagu, sebagaimana kebiasaan yang dilakukan pembaca-pembaca Al-Qur'an zaman sekarang. Membaca yang seperti itu adalah suatu bacaan yang dilakukan orang-orang yang tidak mengerti agama.\"\n\nMembaca Al-Qur'an secara tartil mengandung hikmah, yaitu terbukanya kesempatan untuk memperhatikan isi ayat-ayat yang dibaca dan di waktu menyebut nama Allah, si pembaca akan merasakan kemahaagungan-Nya. Ketika tiba pada ayat yang mengandung janji, pembaca akan timbul harapan-harapan, demikian juga ketika membaca ayat ancaman, pembaca akan merasa cemas.\n\nSebaliknya membaca Al-Qur'an secara tergesa-gesa atau dengan lagu yang baik, tetapi tidak memahami artinya adalah suatu indikasi bahwa si pembaca tidak memperhatikan isi yang terkandung dalam ayat yang dibacanya.",
      "text_translation": "atau lebih dari (seperdua) itu, dan bacalah Al-Qur'an itu dengan perlahan-lahan.",
      "text": "اَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْاٰنَ تَرْتِيْلًاۗ",
      "text_translation_en": "or add to it [at will]; and [during that time] recite the Qur’an calmly and distinctly, with thy mind attuned to its meaning.",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "This verse explains that Allah will send the Qur'an to Muhammad (peace be upon him) which contains His command and prohibition. This is a heavy burden for both Muhammad and his followers. No one wants to carry such a heavy burden except one who has the guidance of Allah.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah akan menurunkan Al-Qur'an kepada Muhammad saw yang di dalamnya terdapat perintah dan larangan-Nya. Hal ini merupakan beban yang berat, baik terhadap Muhammad saw maupun pengikutnya. Tidak ada yang mau memikul beban yang berat itu kecuali orang yang mendapatkan petunjuk dari Allah.",
      "text_translation": "Sesungguhnya Kami akan menurunkan perkataan yang berat kepadamu.",
      "text": "اِنَّا سَنُلْقِيْ عَلَيْكَ قَوْلًا ثَقِيْلًا",
      "text_translation_en": "Behold, We shall bestow upon thee a weighty message –",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "This verse emphasizes that the worship performed at night feels more effective and sound, both in the heart and in the tongue, because the reading of these verses is clearer than the daytime reading of the day when men are distracted by the affairs of worldly life.",
      "text_tafsir": "Ayat ini menegaskan bahwa ibadah yang dilakukan pada malam hari terasa lebih berkesan dan mantap, baik di hati maupun di lidah, sebab bacaan ayat-ayat itu lebih jelas dibandingkan bacaan pada siang hari di saat manusia sedang disibukkan oleh urusan-urusan kehidupan duniawi.",
      "text_translation": "Sungguh, bangun malam itu lebih kuat (mengisi jiwa); dan (bacaan pada waktu itu) lebih berkesan. ",
      "text": "اِنَّ نَاشِئَةَ الَّيْلِ هِيَ اَشَدُّ وَطْـًٔا وَّاَقْوَمُ قِيْلًاۗ",
      "text_translation_en": "[and,] verily, the hours of night the mind most strongly and speak with the clearest voice,",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "This verse commands the Prophet Muhammad to distinguish between day and night worship, when the serenity of the soul is in the service of God, seeking the freedom of the mind. The hustle and bustle of daylight kept her from focusing on the busyness of God's brochure.",
      "text_tafsir": "Ayat ini memerintahkan supaya Nabi Muhammad dapat membedakan antara suasana melakukan ibadah pada siang hari dan malamnya, saat ketenangan jiwa bermunajat kepada Tuhan, menghendaki kebebasan pikiran. Kesibukan yang terdapat pada siang hari membuat perhatian beliau tidak terfokus kepada kesibukan menjalankan risalah Tuhan.",
      "text_translation": "Sesungguhnya pada siang hari engkau sangat sibuk dengan urusan-urusan yang panjang.",
      "text": "اِنَّ لَكَ فِى النَّهَارِ سَبْحًا طَوِيْلًاۗ",
      "text_translation_en": "whereas by day a long chain of doings is thy portion.",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "In this verse, Allah commands the Prophet Muhammad to always remember Him, day and night, by praising, blessing, reciting, praying, and reciting the Qur'an. Thus, he can remove from his heart everything that disobeys God's commandments.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad supaya senantiasa mengingat-Nya, baik siang maupun malam, dengan bertasbih, bertahmid, bertakbir, salat, dan membaca Al-Qur'an. Dengan demikian, ia dapat melenyapkan dari hatinya segala sesuatu yang melalaikan perintah-perintah Allah.",
      "text_translation": "Dan sebutlah nama Tuhanmu, dan beribadahlah kepada-Nya dengan sepenuh hati.",
      "text": "وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ اِلَيْهِ تَبْتِيْلًاۗ",
      "text_translation_en": "But [whether by night or by day,] remember thy Sustainer's name, and devote thyself unto Him with utter devotion.",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "It is further explained that God is the owner of the east and the west. There is no God but Him. Therefore, let Muhammad (peace be upon him) entrust his affairs to him. The Word of God: Then worship Him and trust in Him. (Hud \/ 11: 123)",
      "text_tafsir": "Selanjutnya dijelaskan bahwa Allah adalah pemilik timur dan barat. Tidak ada Tuhan selain Dia. Oleh karena itu, hendaklah Muhammad saw menyerahkan segala urusan kepada-Nya. Firman Allah:\n\nMaka sembahlah Dia dan bertawakallah kepada-Nya. (Hud\/11: 123)",
      "text_translation": "(Dialah) Tuhan timur dan barat, tidak ada tuhan selain Dia, maka jadikanlah Dia sebagai pelindung.",
      "text": "رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَآ اِلٰهَ اِلَّا هُوَ فَاتَّخِذْهُ وَكِيْلًا",
      "text_translation_en": "The Sustainer of the east and the west [is He]: there is no deity save Him: hence, ascribe to Him alone the power to determine thy fate,",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad to be patient and to refrain from facing the unbelievers who utter insulting words against himself and his Lord, because patience leads to his achievement. Allah also ordered that Muhammad (peace be upon him) decide to associate with such people wisely without casting any blame on them. In another verse, Allah says: If you (Muhammad) see people mocking Our Signs, then leave them until they turn to another. (al-An'am \/ 6: 68) And His saying: Leave behind those who turn away from Our warnings, and they desire only the life of the world. (an-Najm \/ 53: 29) God also said: Therefore turn away from them, and give them counsel, and speak to them the words of his soul. (Nisa '\/ 4: 63)",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan kepada Nabi Muhammad supaya sabar dan menahan diri menghadapi orang-orang musyrik yang melontarkan kata-kata yang tidak senonoh terhadap dirinya dan Tuhannya, karena kesabaran membawa kepada tercapainya cita-cita. Allah juga memerintahkan supaya Muhammad saw memutuskan pergaulan dengan orang-orang yang seperti itu dengan bijaksana tanpa melontarkan cercaan terhadap mereka. Dalam ayat lain, Allah berfirman:\n\nApabila engkau (Muhammad) melihat orang-orang memperolok-olokkan ayat-ayat Kami, maka tinggalkanlah mereka hingga mereka beralih ke pembicaraan lain. (al-An'am\/6: 68)\n\nDan firman-Nya:\n\nMaka tinggalkanlah (Muhammad) orang yang berpaling dari peringatan Kami, dan dia hanya menginginkan kehidupan dunia. (an-Najm\/53: 29)\n\nAllah juga berfirman:\n\nKarena itu berpalinglah kamu dari mereka, dan berilah mereka nasihat, dan katakanlah kepada mereka perkataan yang membekas pada jiwanya. (an-Nisa'\/4: 63)",
      "text_translation": "Dan bersabarlah (Muhammad) terhadap apa yang mereka katakan dan tinggalkanlah mereka dengan cara yang baik.",
      "text": "وَاصْبِرْ عَلٰى مَا يَقُوْلُوْنَ وَاهْجُرْهُمْ هَجْرًا جَمِيْلًا ",
      "text_translation_en": "and endure with patience whatever people may say [against thee], and avoid them with a comely avoidance.",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "This verse commands that Muhammad (peace be upon him) return his affair to Allah in the face of rich religious liars and boast of his wealth. It is Allah who will torment them with the torment He has prepared for them. Therefore, let Muhammad (peace and blessings be upon him) allow them to boast of their wealth for a time, for Allah will surely fulfill His promise of revealing them as He had revealed to the believers on the day of the Battle of Badr. Here. Allah said: We let them have a good time, and then We forced them into a severe torment. (Luqman \/ 31: 24)",
      "text_tafsir": "Ayat ini memerintahkan supaya Muhammad saw mengembalikan urusannya kepada Allah dalam menghadapi pendusta-pendusta agama yang kaya raya dan bermegah-megahan dengan kekayaan itu. Allah-lah yang akan menyiksa mereka dengan azab yang telah disiapkan-Nya untuk mereka. Oleh karenanya, hendaklah Muhammad saw membiarkan mereka bermegah-megahan dengan kekayaan mereka dalam waktu sementara, karena Allah pasti akan memenuhi janji-Nya mengazab mereka sebagaimana telah diperlihatkan-Nya kepada orang-orang mukmin pada hari peperangan Badar yang peristiwanya terjadi tidak lama setelah turun ayat ini. Allah berfirman:\n\nKami biarkan mereka bersenang-senang sebentar, kemudian Kami paksa mereka (masuk) ke dalam azab yang keras. (Luqman\/31: 24)",
      "text_translation": "Dan biarkanlah Aku (yang bertindak) terhadap orang-orang yang mendustakan, yang memiliki segala kenikmatan hidup, dan berilah mereka penangguhan sebentar.",
      "text": "وَذَرْنِيْ وَالْمُكَذِّبِيْنَ اُولِى النَّعْمَةِ وَمَهِّلْهُمْ قَلِيْلًا ",
      "text_translation_en": "And leave Me alone [to deal] with those who give the lie to the truth - those who enjoy the blessings of life [without any thought of God] - and bear thou with them for a little while:",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "This verse describes the various kinds of torments of God in the hereafter against these liars. God has the power to punish them because He has the shackles to bind their feet in contempt of them and there is no worry if they flee. God has a fiery hell that can burn and damage the skin and body and weaken their joints. Allah has food in the flames of hell which naturally chokes the esophagus that cannot be extracted and cannot be swallowed. It is the doom of the Lord that torments their whole body.",
      "text_tafsir": "Ayat ini menggambarkan tentang berbagai macam azab Tuhan di akhirat nanti terhadap pendusta-pendusta tersebut. Allah berkuasa mengazab mereka karena Dia mempunyai belenggu untuk mengikat kaki mereka sebagai penghinaan terhadap mereka dan tidak ada kekhawatiran kalau-kalau mereka melarikan diri. Allah mempunyai api neraka yang menyala-nyala dan dapat menghanguskan serta merusak kulit muka dan badan serta melemahkan sendi-sendi tulang mereka. Allah mempunyai makanan-makanan dalam api neraka yang sifatnya mencekik kerongkongan yang tidak dapat dikeluarkan dan tidak dapat pula ditelan. Hal ini merupakan azab Tuhan yang memedihkan seluruh bagian tubuh mereka.",
      "text_translation": "Sungguh, di sisi Kami ada belenggu-belenggu (yang berat) dan neraka yang menyala-nyala,",
      "text": "اِنَّ لَدَيْنَآ اَنْكَالًا وَّجَحِيْمًاۙ",
      "text_translation_en": "for, behold, heavy fetters [await them] with Us, and a blazing fire,",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "This verse describes the various kinds of torments of God in the hereafter against these liars. God has the power to punish them because He has the shackles to bind their feet in contempt of them and there is no worry if they flee. God has a fiery hell that can burn and damage the skin and body and weaken their joints. Allah has food in the flames of hell which naturally chokes the esophagus that cannot be extracted and cannot be swallowed. It is the doom of the Lord that torments their whole body.",
      "text_tafsir": "Ayat ini menggambarkan tentang berbagai macam azab Tuhan di akhirat nanti terhadap pendusta-pendusta tersebut. Allah berkuasa mengazab mereka karena Dia mempunyai belenggu untuk mengikat kaki mereka sebagai penghinaan terhadap mereka dan tidak ada kekhawatiran kalau-kalau mereka melarikan diri. Allah mempunyai api neraka yang menyala-nyala dan dapat menghanguskan serta merusak kulit muka dan badan serta melemahkan sendi-sendi tulang mereka. Allah mempunyai makanan-makanan dalam api neraka yang sifatnya mencekik kerongkongan yang tidak dapat dikeluarkan dan tidak dapat pula ditelan. Hal ini merupakan azab Tuhan yang memedihkan seluruh bagian tubuh mereka.",
      "text_translation": "dan (ada) makanan yang menyumbat di kerongkongan dan azab yang pedih.",
      "text": "وَّطَعَامًا ذَا غُصَّةٍ وَّعَذَابًا اَلِيْمًا ",
      "text_translation_en": "and food that chokes, and grievous suffering",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "This verse explains that the torment took place on a day when the earth and the mountains shook so violently that the mountains and hills became scattered, scattered like a pile of sand. God's word in another verse: And the mountains were as a feather of sparks. (al-Qari'ah \/ 101: 5)",
      "text_tafsir": "Ayat ini menerangkan bahwa azab tersebut terjadi pada hari di mana bumi dan gunung berguncang sekeras-kerasnya sehingga gunung dan bukit menjadi berserakan, bercerai-berai seperti tumpukan pasir yang beterbangan. Firman Allah dalam ayat lain:\n\nDan gunung-gunung seperti bulu yang dihambur-hamburkan. (al-Qari'ah\/101: 5)",
      "text_translation": "(Ingatlah) pada hari (ketika) bumi dan gunung-gunung berguncang keras, dan menjadilah gunung-gunung itu seperti onggokan pasir yang dicurahkan.",
      "text": "يَوْمَ تَرْجُفُ الْاَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيْبًا مَّهِيْلًا ",
      "text_translation_en": "on the Day when the earth and the mountains will be convulsed and the mountains will [crumble and] become like a sand-dune on the move!",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "This verse explains that Allah has sent the people of Mecca to the Messenger of Muhammad (peace be upon him) to guide them to the right path and to be a witness to them on the Day of Judgment about their attitude towards the Messenger's request, whether they accept or reject it, as Allah sent an apostle to his people and his people. However, Pharaoh resisted the apostasy of Moses until God destroyed him and his followers by drowning them in the sea. Therefore, the people of Mecca should learn a lesson from this event.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah mengutus kepada penduduk Mekah seorang rasul yaitu Muhammad saw untuk membawa mereka ke jalan yang benar dan menjadi saksi bagi mereka pada hari Kiamat tentang sikap mereka terhadap ajakan Rasul, apakah mereka menerima atau menolaknya, sebagaimana Allah mengutus seorang rasul kepada Fir'aun dan kaumnya. Akan tetapi, Fir'aun menentang kerasulan Musa sehingga Allah membinasakannya beserta pengikut-pengikutnya dengan menenggelamkan mereka ke dalam lautan. Oleh sebab itu, hendaklah penduduk Mekah mengambil pelajaran dari peristiwa ini.",
      "text_translation": "Sesungguhnya Kami telah mengutus seorang Rasul (Muhammad) kepada kamu, yang menjadi saksi terhadapmu, sebagaimana Kami telah mengutus seorang Rasul kepada Fir‘aun.",
      "text": "اِنَّآ اَرْسَلْنَآ اِلَيْكُمْ رَسُوْلًا ەۙ شَاهِدًا عَلَيْكُمْ كَمَآ اَرْسَلْنَآ اِلٰى فِرْعَوْنَ رَسُوْلًا ۗ",
      "text_translation_en": "BEHOLD, [O men,] We have sent unto you an apostle who shall bear witness to the truth before you, even as We sent an apostle unto Pharaoh:",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "This verse explains that Allah has sent the people of Mecca to the Messenger of Muhammad (peace be upon him) to guide them to the right path and to be a witness to them on the Day of Judgment about their attitude towards the Messenger's request, whether they accept or reject it, as Allah sent an apostle to his people and his people. However, Pharaoh resisted the apostasy of Moses until God destroyed him and his followers by drowning them in the sea. Therefore, the people of Mecca should learn a lesson from this event.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah telah mengutus kepada penduduk Mekah seorang rasul yaitu Muhammad saw untuk membawa mereka ke jalan yang benar dan menjadi saksi bagi mereka pada hari Kiamat tentang sikap mereka terhadap ajakan Rasul, apakah mereka menerima atau menolaknya, sebagaimana Allah mengutus seorang rasul kepada Fir'aun dan kaumnya. Akan tetapi, Fir'aun menentang kerasulan Musa sehingga Allah membinasakannya beserta pengikut-pengikutnya dengan menenggelamkan mereka ke dalam lautan. Oleh sebab itu, hendaklah penduduk Mekah mengambil pelajaran dari peristiwa ini.",
      "text_translation": "Namun Fir‘aun mendurhakai Rasul itu, maka Kami siksa dia dengan siksaan yang berat.",
      "text": "فَعَصٰى فِرْعَوْنُ الرَّسُوْلَ فَاَخَذْنٰهُ اَخْذًا وَّبِيْلًاۚ",
      "text_translation_en": "and Pharaoh rebelled against the apostle, whereupon We took him to task with a crushing grip.",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "This verse confirms that the unbelievers do not fear the coming of the Day of Judgment. On that day, they will not feel safe because of their innocence. They couldn't resist the torment of God on a very terrible day that made the young people blush. Even the sky that day was broken. It showed how terrible that day was. The coming of the day, the downfall of the Lord's torment on the unbelievers, and the reward of the Lord in favor of the believers, is the promise of God that is sure to be fulfilled. God will not break His promise.",
      "text_tafsir": "Ayat ini menegaskan bahwa orang-orang kafir tidak takut kepada datangnya hari Kiamat. Padahal pada hari itu, mereka tidak akan merasa aman karena kekufuran mereka. Mereka tidak sanggup menolak azab Tuhan pada hari yang sangat dahsyat yang menjadikan anak-anak muda beruban. Langit pun pada hari itu terpecah-belah. Hal itu menunjukkan sangat dahsyatnya hari tersebut. Kedatangan hari tersebut, yaitu turunnya azab Tuhan kepada orang kafir dan pahala Tuhan berupa nikmat kepada orang mukmin, adalah janji Tuhan yang pasti dipenuhi-Nya. Allah tidak akan memungkiri janji-Nya.",
      "text_translation": "Lalu bagaimanakah kamu akan dapat menjaga dirimu jika kamu tetap kafir kepada hari yang menjadikan anak-anak beruban.",
      "text": "فَكَيْفَ تَتَّقُوْنَ اِنْ كَفَرْتُمْ يَوْمًا يَّجْعَلُ الْوِلْدَانَ شِيْبًاۖ",
      "text_translation_en": "How, then, if you refuse to acknowledge the truth, will you protect yourselves on that Day which shall turn the hair of children grey,",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "This verse confirms that the unbelievers do not fear the coming of the Day of Judgment. On that day, they will not feel safe because of their innocence. They couldn't resist the torment of God on a very terrible day that made the young people blush. Even the sky that day was broken. It showed how terrible that day was. The coming of the day, the downfall of the Lord's torment on the unbelievers, and the reward of the Lord in favor of the believers, is the promise of God that is sure to be fulfilled. God will not break His promise.",
      "text_tafsir": "Ayat ini menegaskan bahwa orang-orang kafir tidak takut kepada datangnya hari Kiamat. Padahal pada hari itu, mereka tidak akan merasa aman karena kekufuran mereka. Mereka tidak sanggup menolak azab Tuhan pada hari yang sangat dahsyat yang menjadikan anak-anak muda beruban. Langit pun pada hari itu terpecah-belah. Hal itu menunjukkan sangat dahsyatnya hari tersebut. Kedatangan hari tersebut, yaitu turunnya azab Tuhan kepada orang kafir dan pahala Tuhan berupa nikmat kepada orang mukmin, adalah janji Tuhan yang pasti dipenuhi-Nya. Allah tidak akan memungkiri janji-Nya.",
      "text_translation": "Langit terbelah pada hari itu. Janji Allah pasti terlaksana.",
      "text": " ۨالسَّمَاۤءُ مُنْفَطِرٌۢ بِهٖۗ كَانَ وَعْدُهٗ مَفْعُوْلًا",
      "text_translation_en": "[the Day] on which the skies shall be rent asunder, [and] His promise [of resurrection] fulfilled?",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "Allah affirms that the things of the past which reveal the things about the torment that Allah has provided for those who deny Him, and that man cannot save himself from His torment, are a lesson or warning, especially to those who wish to return to the way. God. Stepping into the path of God means believing in Him, doing the works that obey Him, and submitting to Him. That is the effort of a person to achieve the gift of Allah. That's a straight and solid way of life.",
      "text_tafsir": "Allah menegaskan bahwa sesungguhnya hal-hal yang lalu yang mengungkapkan berbagai hal tentang siksaan yang disediakan Allah bagi orang yang mendustakan-Nya, dan bahwa manusia tidak dapat menyelamatkan diri dari azab-Nya, merupakan pengajaran atau peringatan, khususnya bagi orang yang ingin kembali kepada jalan Tuhannya.\n\nMenempuh jalan kepada Tuhan berarti mengimani-Nya, mengerjakan perbuatan yang bersifat menaati-Nya, serta menundukkan diri kepada-Nya. Itulah upaya seseorang untuk mencapai mardhatillah (keridaan Allah). Itulah jalan hidup yang lurus dan kokoh.",
      "text_translation": "Sungguh, ini adalah peringatan. Barangsiapa menghendaki, niscaya dia mengambil jalan (yang lurus) kepada Tuhannya.",
      "text": "اِنَّ هٰذِهٖ تَذْكِرَةٌ ۚ فَمَنْ شَاۤءَ اتَّخَذَ اِلٰى رَبِّهٖ سَبِيْلًا ࣖ ",
      "text_translation_en": "This, verily, is a reminder: let him who wills, then set out on a way to his Sustainer!",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "In the previous verses, Allah commanded the Prophet Muhammad to pray for the night, so in this verse, Allah shows His mercy to His servants. He gives relief to his servants by not complying with Tahajud prayers every night. God asserts that He knew some of the Muslims and the Prophet performed the prayer on that night for 2\/3 nights, or 1\/2 or 1\/3. At that time it was still a compulsory command which of course sometimes felt heavy. When the first verse of Surah al-Muzzammil came down, the companions performed the prayers in accordance with the instructions in verses 2 to 4. It was sometimes burdensome, though the Tahajud prayer was specifically referred to or obligated to the Messenger of Allah (may peace be upon him), and was performed for his people. Many of the companions did not know exactly what size 1\/2 or 1\/3 that night, until they were afraid to escape the night time orders, so some of them were on watch all night. This is very tiring for their bodies, because they wake up until dawn. Of course waking up and just being physically exhausted. To alleviate this, God decreed this verse: \"Know that you cannot set the limits of time, so He gives you light\" (al-Muzzammil \/ 73: 20) From this verse 20 can also be learned that obeying the command of fardu it must not exceed the size limit set to be non-burdensome. Therefore, God commands for the ordinary night prayers when it feels a little burdensome to be reduced in time, so that it is not done under compulsion. That is why Allah makes things difficult to lighten, so that one can always do that. Similarly, in the evening prayer recitations (including Maghrib and Isha), it should be read in short verses, as recounted by al-Baihaqi and ad-Daruquthni of Qais bin hazim that it was a pilgrimage performed by Ibn 'Abbas. Qais says that Ibn 'Abbas read some verses from the beginning of Surah al-Baqarah after al-Fatihah. At the end of the prayer, Ibn 'Abbas taught those who followed him: At the end of the prayer, Ibn' Abbas came to us and said, Allah says \"Read to you what is easy from (the Qur'anic verses)\" (al-Baihaqi history and ad -Daruquthni) The size of these simple verses is not explained further, nor is it for fardu or Tahajud and other prayers. It may be easy to read which of the Qur'anic verses applies to certain obligatory prayers and some sunnah prayers (such as Tahajud prayers). Then mentioned the second sickness (obstruction), which was due to illness, thus alleviating the demands of performing night prayers. The third Uzur is because he is busy looking for sustenance during the day. Fourth because he was fighting with (physical) weapons to defend and defend the religion of God from enemy attacks. Factors that hurt him, he was busy trying to make a living, and he was struggling in the way of God making it difficult for him to get up at night to perform the Tahajud prayers. Likewise, this verse does not distinguish jihadist efforts to raise arms against the enemy in the pursuit of sustenance, since both are of benefit to the Muslims, while acting in accordance with Allah's command. Fighting means defending religion, trading or trying to fund family and religious activities (with charity, charity, etc.). After mentioning three reasons that bring rukhsah (lightness) to worship at night which means the abolition of the night prayer (mansukh), this verse also mentions what they did after receiving the purification, which is to read the Qur'an in which prayer that's easy. Next, Allah commanded the enforcement of the prayers and the giving of alms. It is also recommended to lend to Allah, in the form of providing livelihood (aid) for the benefit of the individual, both individually and collectively. With this qiradh (loan) this religion can be upheld, and social affairs of the community can be upheld. In another verse it is said: Whoever lends to God with a good loan then Allah multiply to him much. Allah restrains and extends (to Him), and to Him you are returned. (al-Baqarah \/ 2: 245) Then the Lord proposes to give alms (giving wealth to those who need it outside of compulsory charity) and multiplying charity. What is donated and sacrificed by giving in the way of God is better than what is spent on earthly interests, and thus one is intensifying his preparation for eternal and eternal village. This verse concludes with the suggestion that we multiply the stigma (for the forgiveness of Allah), because of the sins and mistakes we commit. It is the decree that God accepts that will cover one's disgrace as human calculations and responsibilities are laid before him. Allah is the Forgiving; He is the one who covers someone's sin or reduces it. He is the Most Merciful, one who will not be harmed when his repentance is received.",
      "text_tafsir": "Dalam ayat-ayat yang lalu, Allah memerintahkan kepada Nabi Muhammad untuk salat malam, maka dalam ayat ini, Allah menunjukkan kemahapengasihan-Nya kepada hamba-hamba-Nya. Dia memberikan keringanan pada hamba-Nya dengan tidak mewajibkan salat Tahajud setiap malam.\n\nTuhan menegaskan bahwa Dia mengetahui sebagian kaum muslimin bersama Nabi mengerjakan salat malam itu sepanjang 2\/3 malam, atau 1\/2-nya atau 1\/3-nya. Waktu itu masih merupakan perintah wajib yang tentu saja terkadang-kadang terasa berat.\n\nKetika ayat pertama Surah al-Muzzammil turun, para sahabat mengerjakan salat sesuai dengan petunjuk dalam ayat 2 sampai dengan 4. Hal itu kadang-kadang memberatkan, sekalipun salat Tahajud itu khusus difardukan atau diwajibkan kepada Rasulullah saw, dan disunatkan bagi umatnya. Banyak di antara para sahabat tidak mengetahui dengan pasti berapa ukuran 1\/2 atau 1\/3 malam itu, hingga karena takut luput dari waktu salat malam yang diperintahkan itu, sehingga ada di antara mereka yang berjaga-jaga sepanjang malam. Hal ini sangat melelahkan badan mereka, sebab mereka bangun sampai fajar. Tentu saja bangun dan berjaga-jaga demikian melemahkan fisik. Untuk meringankan itu, Allah menurunkan ayat ini:\n\n¦Allah mengetahui bahwa kamu tidak dapat menentukan batas-batas waktu itu, maka Dia memberi keringanan kepadamu¦ (al-Muzzammil\/73: 20)\n\nDari ayat 20 ini dapat pula diambil pelajaran bahwa mengerjakan perintah fardu itu tidak boleh melebihi batas ukuran yang ditentukan agar tidak memberatkan diri sendiri. Oleh karena itu, Allah memerintahkan bagi yang biasa salat malam apabila terasa agak memberatkan boleh dikurangi waktunya, sehingga dikerjakan tidak dalam keadaan terpaksa. Begitulah Allah memudahkan sesuatu yang berat menjadi ringan, agar seseorang selalu mengerjakan yang mudah itu.\n\nBegitu pula dalam bacaan salat malam (termasuk Magrib dan Isya), hendaklah dibaca ayat-ayat yang pendek-pendek, sebagaimana yang diriwayatkan oleh al-Baihaqi dan ad-Daruquthni dari Qais bin hazim bahwa ia salat berjamaah yang diimami oleh Ibnu 'Abbas. Qais mengatakan bahwa Ibnu 'Abbas membaca beberapa ayat dari permulaan Surah al-Baqarah setelah al-Fatihah. Selesai salat, Ibnu 'Abbas mengajarkan kepada yang mengikutinya:\n\nSelesai salat, Ibnu 'Abbas menghampiri kami seraya berkata, Allah berfirman \"Bacalah olehmu mana yang mudah dari (ayat-ayat Al-Qur'an itu)\" (Riwayat al-Baihaqi dan ad-Daruquthni)\n\nBerapa ukuran ayat-ayat yang mudah itu tidak dijelaskan lebih lanjut, demikian pula apakah untuk salat fardu atau salat Tahajud dan sunah-sunah lainnya. Boleh jadi membaca mana yang mudah dari ayat-ayat Al-Qur'an berlaku untuk beberapa salat wajib dan beberapa salat sunah (seperti salat Tahajud).\n\nKemudian disebutkan pula uzur (halangan) yang kedua yakni karena sakit, sehingga diringankan tuntutan mengerjakan salat malam. Uzur yang ketiga adalah karena sibuk mencari rezeki di siang hari. Keempat karena sedang berjuang dengan senjata (fisik) membela dan mempertahankan agama Allah dari serangan musuh.\n\nFaktor sakit, sibuk mencari rezeki, dan sedang berjihad di jalan Allah menyebabkan seseorang sulit baginya untuk bangun pada malam hari mengerjakan salat Tahajud. Demikianlah pula ternyata ayat ini tidak membeda-bedakan usaha berjihad mengangkat senjata melawan musuh dengan berusaha mencari rezeki, sebab keduanya bermanfaat bagi kaum muslimin, asal dikerjakan menurut perintah Allah. Berjuang berarti mempertahankan agama, sedang berdagang atau berusaha dapat membiayai keluarga dan kegiatan agama (dengan zakat, sedekah, dan lain-lain).\n\nSetelah menyebutkan tiga sebab yang mendatangkan rukhsah (keringanan) dalam beribadah pada malam hari yang berarti pula terhapusnya kewajiban salat malam (mansukh), maka ayat ini menyebutkan pula apa yang mereka kerjakan setelah mendapat keringanan tersebut yakni hendaklah membaca Al-Qur'an dalam salat mana yang mudah-mudah saja.\n\nSelanjutnya Allah memerintahkan untuk menegakkan salat dan mengeluarkan zakat. Selain itu dianjurkan pula untuk memberikan pinjaman kepada Allah, dalam bentuk memberikan nafkah (bantuan) bagi kepentingan sabilillah, baik sendiri-sendiri maupun secara bersama-sama. Dengan qiradh (pinjaman) itulah agama ini bisa ditegakkan, dan urusan sosial kemasyarakatan dapat ditegakkan. Dalam ayat lain dinyatakan:\n\nBarang siapa meminjami Allah dengan pinjaman yang baik maka Allah melipatgandakan ganti kepadanya dengan banyak. Allah menahan dan melapangkan (rezeki) dan kepada-Nyalah kamu dikembalikan. (al-Baqarah\/2: 245)\n\nKemudian Tuhan menganjurkan supaya memperbanyak sedekah (memberikan harta kepada yang memerlukannya di luar zakat yang wajib) dan memperbanyak amal saleh. Apa yang dinafkahkan dan dikorbankan dengan bersedekah di jalan Allah, adalah lebih baik dibandingkan dengan apa yang dihabiskan untuk kepentingan duniawi, dan dengan demikian seseorang semakin memperbesar persiapannya untuk menuju kampung yang kekal dan abadi. \n\nAyat ini diakhiri dengan anjuran agar kita memperbanyak istigfar (mohon ampun kepada Allah), karena dosa dan kesalahan yang kita kerjakan terlalu banyak. Istigfar yang diterima Allah itulah yang akan menutup aib seseorang tatkala diadakan perhitungan dan pertanggungjawaban amal manusia di hadapan-Nya kelak. Allah-lah Yang Maha Pengampun; Dialah yang menutupi dosa seseorang atau menguranginya. Dialah yang Maha Pengasih, yang seseorang tidak akan disiksa bilamana tobatnya telah diterima.",
      "text_translation": "Sesungguhnya Tuhanmu mengetahui bahwa engkau (Muhammad) berdiri (salat) kurang dari dua pertiga malam, atau seperdua malam atau sepertiganya dan (demikian pula) segolongan dari orang-orang yang bersamamu. Allah menetapkan ukuran malam dan siang. Allah mengetahui bahwa kamu tidak dapat menentukan batas-batas waktu itu, maka Dia memberi keringanan kepadamu, karena itu bacalah apa yang mudah (bagimu) dari Al-Qur'an; Dia mengetahui bahwa akan ada di antara kamu orang-orang yang sakit, dan yang lain berjalan di bumi mencari sebagian karunia Allah; dan yang lain berperang di jalan Allah, maka bacalah apa yang mudah (bagimu) dari Al-Qur'an dan laksanakanlah salat, tunaikanlah zakat dan berikanlah pinjaman kepada Allah pinjaman yang baik. Kebaikan apa saja yang kamu perbuat untuk dirimu niscaya kamu memperoleh (balasan)nya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya. Dan mohonlah ampunan kepada Allah; sungguh, Allah Maha Pengampun, Maha Penyayang.",
      "text": "۞ اِنَّ رَبَّكَ يَعْلَمُ اَنَّكَ تَقُوْمُ اَدْنٰى مِنْ ثُلُثَيِ الَّيْلِ وَنِصْفَهٗ وَثُلُثَهٗ وَطَاۤىِٕفَةٌ مِّنَ الَّذِيْنَ مَعَكَۗ وَاللّٰهُ يُقَدِّرُ الَّيْلَ وَالنَّهَارَۗ عَلِمَ اَنْ لَّنْ تُحْصُوْهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوْا مَا تَيَسَّرَ مِنَ الْقُرْاٰنِۗ عَلِمَ اَنْ سَيَكُوْنُ مِنْكُمْ مَّرْضٰىۙ وَاٰخَرُوْنَ يَضْرِبُوْنَ فِى الْاَرْضِ يَبْتَغُوْنَ مِنْ فَضْلِ اللّٰهِ ۙوَاٰخَرُوْنَ يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ ۖفَاقْرَءُوْا مَا تَيَسَّرَ مِنْهُۙ وَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَقْرِضُوا اللّٰهَ قَرْضًا حَسَنًاۗ وَمَا تُقَدِّمُوْا لِاَنْفُسِكُمْ مِّنْ خَيْرٍ تَجِدُوْهُ عِنْدَ اللّٰهِ ۙهُوَ خَيْرًا وَّاَعْظَمَ اَجْرًاۗ وَاسْتَغْفِرُوا اللّٰهَ ۗاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ ࣖ ",
      "text_translation_en": "BEHOLD, [O Prophet,] thy Sustainer knows that thou keepest awake [in prayer] nearly two-thirds of the night, or one-half of it, or a third of it, together with some of those who follow thee. And God who determines the measure of night and day, is aware that you would never grudge it: and therefore He turns towards you in His grace. Recite, then, as much of the Qur’an as you may do with ease. He knows that in time there will be among you sick people, and others who will go about the land in search of God's bounty, and others who will fight in God’s cause. Recite, then, [only] as much of it as you may do with ease, and be constant in prayer, and spend in charity, and [thus] lend unto God a goodly loan: for whatever good deed you may offer up in your own behalf, you shall truly find it with God - yea, better, and richer in reward. And [always] seek God's forgiveness: behold, God is much-forgiving, a dispenser of grace!",
      "juz_number": 29
    }
  },
  "name": "المزّمّل",
  "name_translation_en": "The Enshrouded One",
  "name_translation": "Orang Yang Berselimut",
  "name_latin": "Al-Muzzammil"
}