{
  "number": 74,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 56,
  "ayat": {
    "1": {
      "text_tafsir_en": "In verse 1-2 it is said that the Prophet Muhammad was hiding in a blanket because of fear of seeing the face of the angel Gabriel, and then came a revelation that ordered the people to rise up early and warn the remaining astray to know the right way. The word \"qum\" (wake up) indicates that an apostle must be diligent, tenacious, and hopeless because of the ridicule of those who do not respond well to his call. The Apostle should not be lazy and stubborn. Since this verse, the Prophet Muhammad never ceased to perform the task of preaching. His whole life was filled with various activities that were useful for the benefit of the people and the broadcasting of Islam. The warnings he gave to the people of Mecca who were still religious at the time, was a terrible torment of Allah on the Day of Judgment. In order to escape from that torment, people must know God and obey the Messenger of Allah.",
      "text_tafsir": "Dalam ayat 1-2 disebutkan bahwa Nabi Muhammad sedang berselubung dengan selimut karena diliputi perasaan takut melihat rupa Malaikat Jibril, lalu turunlah wahyu yang memerintahkan agar segera bangun dan memperingatkan umat yang masih sesat itu supaya mereka mengenal jalan yang benar.\n\nPerkataan \"qum\" (bangunlah) menunjukkan bahwa seorang rasul harus rajin, ulet, dan tidak mengenal putus asa karena ejekan orang yang tidak senang menerima seruannya. Rasul tidak boleh malas dan berpangku tangan. Semenjak ayat ini turun, Nabi Muhammad tidak pernah berhenti melaksanakan tugas dakwah. Sepanjang hidupnya diisi dengan berbagai macam kegiatan yang berguna bagi kepentingan umat dan penyiaran agama Islam.\n\nPeringatan-peringatan yang beliau sampaikan kepada penduduk Mekah yang masih musyrik pada waktu itu, berupa kedahsyatan siksaan Allah di hari Kiamat kelak. Untuk menyelamatkan diri dari azab tersebut, manusia hendaknya mengenal Allah dan patuh mengikuti perintah Rasul saw.",
      "text_translation": "Wahai orang yang berkemul (berselimut)!",
      "text": "يٰٓاَيُّهَا الْمُدَّثِّرُۙ",
      "text_translation_en": "O THOU [in thy solitude] enfolded!",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "In verse 1-2 it is said that the Prophet Muhammad was hiding in a blanket because of fear of seeing the face of the angel Gabriel, and then came a revelation that ordered the people to rise up early and warn the remaining astray to know the right way. The word \"qum\" (wake up) indicates that an apostle must be diligent, tenacious, and hopeless because of the ridicule of those who do not respond well to his call. The Apostle should not be lazy and stubborn. Since this verse, the Prophet Muhammad never ceased to perform the task of preaching. His whole life was filled with various activities that were useful for the benefit of the people and the broadcasting of Islam. The warnings he gave to the people of Mecca who were still religious at the time, was a terrible torment of Allah on the Day of Judgment. In order to escape from that torment, people must know God and obey the Messenger of Allah.",
      "text_tafsir": "Dalam ayat 1-2 disebutkan bahwa Nabi Muhammad sedang berselubung dengan selimut karena diliputi perasaan takut melihat rupa Malaikat Jibril, lalu turunlah wahyu yang memerintahkan agar segera bangun dan memperingatkan umat yang masih sesat itu supaya mereka mengenal jalan yang benar.\n\nPerkataan \"qum\" (bangunlah) menunjukkan bahwa seorang rasul harus rajin, ulet, dan tidak mengenal putus asa karena ejekan orang yang tidak senang menerima seruannya. Rasul tidak boleh malas dan berpangku tangan. Semenjak ayat ini turun, Nabi Muhammad tidak pernah berhenti melaksanakan tugas dakwah. Sepanjang hidupnya diisi dengan berbagai macam kegiatan yang berguna bagi kepentingan umat dan penyiaran agama Islam.\n\nPeringatan-peringatan yang beliau sampaikan kepada penduduk Mekah yang masih musyrik pada waktu itu, berupa kedahsyatan siksaan Allah di hari Kiamat kelak. Untuk menyelamatkan diri dari azab tersebut, manusia hendaknya mengenal Allah dan patuh mengikuti perintah Rasul saw.",
      "text_translation": "bangunlah, lalu berilah peringatan!",
      "text": "قُمْ فَاَنْذِرْۖ",
      "text_translation_en": "Arise and warn!",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "This verse commands the Prophet Muhammad to glorify Allah in his judgment and submit all matters to His will. He is forbidden to seek help other than him. Glorifying God with all the soul and body certainly develops a strong and unwavering personality. Because, believers believe that there is nothing to fear except God. This attitude needs to be appreciated by a layman whose daily task is to lead people to God's way. This verse also means that the Prophet Muhammad was commanded to make the purpose of extending the name of his God, above all else. For since a man knows the Creator of the universe and himself and believes that he exists, then he must purify himself from all his acts. Otherwise, even the monks honor their god's name, but the majesty unites with other substances. Raising God means glorifying Him in speech and deed, handing over all things to Him, worshiping and purifying His substance from all that is associated with Him, and relying on Him alone. If such elements are fulfilled in raising God, then the faith of a believer is perfect.",
      "text_tafsir": "Ayat ini memerintahkan agar Nabi Muhammad mengagungkan Allah dengan bertakbir dan menyerahkan segala urusan kepada kehendak-Nya. Beliau dilarang mencari pertolongan selain kepada-Nya.\n\nMengagungkan Allah dengan segenap jiwa dan raga tentu menumbuhkan kepribadian yang tangguh dan tidak mudah goyah. Sebab, manusia yang beriman memandang bahwa tidak ada yang ditakuti selain Allah. Sikap ini perlu dihayati oleh seorang dai (juru dakwah) yang tugasnya sehari-hari mengajak manusia ke jalan Allah.\n\nAyat ini juga mengandung arti bahwa Nabi Muhammad diperintahkan supaya bertakbir yaitu membesarkan nama Tuhan-Nya, melebihi dari segala sesuatu yang ada. Sebab setelah manusia mengenal pencipta alam dan dirinya sendiri serta yakin bahwa pencipta itu memang ada, maka hendaklah dia membersihkan zat-Nya dari segala tandingan-Nya. Bila tidak demikian, orang musyrik pun mengagungkan nama tuhan mereka, akan tetapi keagungan yang berserikat dengan zat-zat lain.\n\nMembesarkan Allah berarti mengagungkan-Nya dalam ucapan dan perbuatan, menyerahkan segala urusan hanya kepada-Nya, beribadah dan membersihkan zat-Nya dari segala yang dipersekutukan dengan-Nya, dan menggantungkan harapan kepada-Nya saja. Kalau unsur-unsur yang demikian dipenuhi dalam membesarkan Allah, barulah sempurna penghayatan iman bagi seorang mukmin.",
      "text_translation": "dan agungkanlah Tuhanmu,",
      "text": "وَرَبَّكَ فَكَبِّرْۖ",
      "text_translation_en": "And thy Sustainer's greatness glorify!",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "In this verse, Allah tells the Prophet Muhammad to clean his clothes. The meaning of cleaning clothes according to some interpreters is to: 1. Clean the clothes of all impurities and impurities, because they are purified for the purpose of worshiping the law, and besides worshiping the law. Cleaning here also includes how to obtain it, which is why the clothing used should be obtained in a lawful way. When Ibn 'Abbas asked people about the meaning of this verse, he replied that the word of God meant the prohibition of wearing clothes for sin and deception. So purifying clothes is purifying them from impurities and dirt. The broader sense is to cleanse the living and living environment of all kinds of dirt, waste, and so forth, because in so many clothes, bodies, and environments, there is so much sin. Instead, cleansing your body, your home, etc. means trying to keep yourself from sin. Thus the Shiafi'iyah scholars were obliged to clean the clothes of the impure for the praying. That is why Islam requires its followers to keep themselves clean, because physical cleanliness elevates people to noble morals. 2. Cleaning clothes means cleansing the spiritual of all despicable characters and attributes. Specifically for the Prophet Muhammad, this verse commands him to purify the values of the nubuwwah (prophecies) he receives from all those who profane them (envy, revenge, anger, etc.). This second sense is figurative (majazi), and in Arabic sometimes insults people who do not keep the promise by using the words, \"He likes to dirty his clothes,\" whereas the person who keeps the promise is always praised in his speech , \"She likes to clean her clothes.\" In short, this verse commands the cleansing, clothing, and environment of all impurities, impurities, waste, and more. It also means that the order preserves the purity and personal honor of all despicable attitudes.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad supaya membersihkan pakaian. Makna membersihkan pakaian menurut sebagian ahli tafsir adalah:\n\n1.Membersihkan pakaian dari segala najis dan kotoran, karena bersuci dengan maksud beribadah hukumnya wajib, dan selain beribadah hukumnya sunah. Membersihkan di sini juga termasuk cara memperolehnya, yaitu pakaian yang digunakan harus diperoleh dengan cara yang halal. Ketika Ibnu 'Abbas ditanya orang tentang maksud ayat ini, beliau menjawab bahwa firman Allah tersebut berarti larangan memakai pakaian untuk perbuatan dosa dan penipuan. Jadi menyucikan pakaian adalah membersihkannya dari najis dan kotoran. Pengertian yang lebih luas lagi, yakni membersihkan tempat tinggal dan lingkungan hidup dari segala bentuk kotoran, sampah, dan lain-lain, sebab dalam pakaian, tubuh, dan lingkungan yang kotor banyak terdapat dosa. Sebaliknya dengan membersihkan badan, tempat tinggal, dan lain-lain berarti berusaha menjauhkan diri dari dosa. Demikianlah para ulama Syafi'iyah mewajibkan membersihkan pakaian dari najis bagi orang yang hendak salat. Begitulah Islam mengharuskan para pengikutnya untuk selalu hidup bersih, karena kebersihan jasmani mengangkat manusia kepada akhlak yang mulia.\n\n2.Membersihkan pakaian berarti membersihkan rohani dari segala watak dan sifat-sifat tercela. Khusus buat Nabi Muhammad, ayat ini memerintahkan beliau menyucikan nilai-nilai nubuwwah (kenabian) yang dipikulnya dari segala yang mengotorinya (dengki, dendam, pemarah, dan lain-lain). Pengertian kedua ini bersifat kiasan (majazi), dan memang dalam bahasa Arab kadang-kadang menyindir orang yang tidak menepati janji dengan memakai perkataan, \"Dia suka mengotori baju (pakaian)-nya,\" Sedangkan kalau orang yang suka menepati janji selalu dipuji dengan ucapan, \"Dia suka membersihkan baju (pakaian)-nya.\"\n\nSecara singkat, ayat ini memerintahkan agar membersihkan diri, pakaian, dan lingkungan dari segala najis, kotoran, sampah, dan lain-lain. Di samping itu juga berarti perintah memelihara kesucian dan kehormatan pribadi dari segala perangai yang tercela.",
      "text_translation": "dan bersihkanlah pakaianmu,",
      "text": "وَثِيَابَكَ فَطَهِّرْۖ",
      "text_translation_en": "And thine inner self purify!",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "Then the Prophet Muhammad was ordered to abstain from sinful acts such as worshiping idols or statues. The word ar-rujz contained in this verse means torture, and in this sense it is a command to abstain from all causes of torture, the act of evil. Included in this verse is prohibition of doing all kinds of acts that cause evil acts. Clearing yourself from sin, especially for a single person, is an obligation. Because if the person himself was known to be defamatory and disgraced by the people, his words and advice would be hard to accept. Even well-educated people must face two challenges, namely: 1. Being able to be called and called into the way of God will clap their hands, show their pride, and feel no need for advice. With his wealth, knowledge, or high position, he feels no need to be called to the way of God. 2. It is possible that the ruler was not abused by the authorities and that he did not like them. Sang dai will be expelled, tortured, deprived of his rights, intimidated, prohibited, or barred from delivering preaching and upholding rights. All of these are the consequences that must be faced by anyone fighting in the way of Allah. Protecting ourselves from all actions and words that are hurting people in the eyes of others is part of our quest for success in preaching.",
      "text_tafsir": "Selanjutnya Nabi Muhammad diperintahkan supaya meninggalkan perbuatan dosa seperti menyembah berhala atau patung. Kata ar-rujz yang terdapat dalam ayat ini berarti siksaan, dan dalam hal ini yang dimaksudkan ialah perintah menjauhkan segala sebab yang mendatangkan siksaan, yakni perbuatan maksiat. Termasuk yang dilarang oleh ayat ini ialah mengerjakan segala macam perbuatan yang menyebabkan perbuatan maksiat.\n\nMembersihkan diri dari dosa apalagi bagi seorang dai adalah suatu kewajiban. Sebab, kalau pada diri sang dai sendiri diketahui ada cela dan aib oleh masyarakat, tentu perkataan dan nasihatnya sulit diterima orang. Bahkan mubalig yang pandai memelihara diri sekali pun pasti menghadapi dua bentuk tantangan, yakni:\n\n1.Boleh jadi orang yang diajak dan diseru ke jalan Allah akan menepuk dada, memperlihatkan kesombongannya, sehingga merasa tidak lagi membutuhkan nasihat. Dengan kekayaan, ilmu pengetahuan, atau kedudukan tinggi yang dimilikinya, ia merasa tidak perlu lagi diajak ke jalan Allah.\n\n2.Mungkin pula sang dai dimusuhi oleh penguasa dan yang tidak senang kepadanya. Sang dai akan diusir, disiksa, dikurangi hak-haknya, diintimidasi, dilarang, atau dihalang-halangi menyampaikan dakwah dan menegakkan yang hak. Semuanya itu merupakan akibat yang harus dihadapi bagi siapa saja yang berjihad di jalan Allah. Memelihara diri dari segala tindakan dan perkataan yang melunturkan nama baik di mata masyarakat adalah sebagian dari ikhtiar dalam rangka mencapai kesuksesan dalam berdakwah.",
      "text_translation": "dan tinggalkanlah segala (perbuatan) yang keji,",
      "text": "وَالرُّجْزَ فَاهْجُرْۖ ",
      "text_translation_en": "And all defilement shun!",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "In this verse, the Prophet Muhammad was forbidden to give with the intention of gaining more. This means that with the effort and the desire to bring people into the path of God, as well as the knowledge and pamphlets they give, he is forbidden to expect greater rewards or wages from those he appeals to. The emphasis is not to make preaching as a business object that brings worldly benefits. For a prophet it is further emphasized that he should not expect any wage in his preaching, in order to preserve the dignity of his prophetic glory.",
      "text_tafsir": "Dalam ayat ini, Nabi Muhammad dilarang memberi dengan maksud memperoleh yang lebih banyak. Artinya dengan usaha dan ikhtiar mengajak manusia ke jalan Allah, serta dengan ilmu dan risalah yang disampaikan, beliau dilarang mengharapkan ganjaran atau upah yang lebih besar dari orang-orang yang diserunya. Tegasnya jangan menjadikan dakwah sebagai objek bisnis yang mendatangkan keuntungan duniawi. Bagi seorang nabi lebih ditekankan lagi agar tidak mengharapkan upah sama sekali dalam dakwah, guna memelihara keluhuran martabat kenabian yang dipikulnya.",
      "text_translation": "dan janganlah engkau (Muhammad) memberi (dengan maksud) memperoleh (balasan) yang lebih banyak.",
      "text": "وَلَا تَمْنُنْ تَسْتَكْثِرُۖ ",
      "text_translation_en": "And do not through giving seek thyself to gain,",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "This verse commands the Prophet Muhammad to be patient, for in doing so there must be many obstacles and trials. Especially in jihad to deliver Islamic leaflets. Patience in this verse also means enduring suffering from being tortured or hurt because what is being said is not liked by people. For a man, this verse means that he should be able to hold back and suppress his feelings when his mission is unacceptable, and when the truth he calls for is ignored. Do not despair, for no struggle can succeed without sacrifice, just as the prophets and apostles have endured. There are several forms of patience that are interpreted from the above verse, including: (1) patience in the act of obedience, so as not to suffer boredom, (2) patience in avoidance of evil and in the face of adversity, (3) patience in the face of trial and resolution (qadar) Allah, and (4) patiently facing the luxury of living in the world. It is with patience and perseverance that a struggle is guaranteed to succeed, as our visit shows, Prophet Muhammad.",
      "text_tafsir": "Ayat ini memerintahkan supaya Nabi Muhammad bersikap sabar, karena dalam berbuat taat itu pasti banyak rintangan dan cobaan yang dihadapi. Apalagi dalam berjihad untuk menyampaikan risalah Islam. Sabar dalam ayat ini juga berarti tabah menderita karena disiksa atau disakiti karena apa yang disampaikan itu tidak disenangi orang. Bagi seorang dai, ayat ini berarti bahwa ia harus dapat menahan diri dan menekan perasaan ketika misinya tidak diterima orang, dan ketika kebenaran yang diserukannya tidak dipedulikan orang. Janganlah putus asa, sebab tidak ada perjuangan yang berhasil tanpa pengorbanan, sebagaimana perjuangan yang telah dialami para nabi dan rasul.\n\nAda beberapa bentuk sabar yang ditafsirkan dari ayat di atas, di antaranya: (1) sabar dalam melakukan perbuatan taat, sehingga tidak dihinggapi kebosanan, (2) sabar menjauhkan diri dari perbuatan maksiat dan menghadapi musuh, (3) sabar ketika menghadapi cobaan dan ketetapan (qadar) Allah, dan (4) sabar menghadapi kemewahan hidup di dunia. Dengan sikap sabar dan tabah itulah sesuatu perjuangan dijamin akan berhasil, seperti yang diperlihatkan oleh junjungan kita, Nabi Muhammad saw.",
      "text_translation": "Dan karena Tuhanmu, bersabarlah.",
      "text": "وَلِرَبِّكَ فَاصْبِرْۗ ",
      "text_translation_en": "but unto thy Sustainer turn in patience.",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "After giving special guidance to Prophet Muhammad (who is also the mirror of teaching for his people) starting from verse 1 to verse 7 above, in this verse, God also explains the atmosphere of the Day of Judgment. On that promised day, those who had hurt the hearts of the apostles and preachers for preaching the teachings of God, would have a great difficulty. They were shocked to hear the Doomsday call for the Angel of Israel. They immediately realized how great a struggle it must be. Therefore, Allah ordered the Prophet Muhammad to be patient with the distractions of the enemy. On the Day of Judgment, all will receive what they have practiced: the eternal joy of believers and the jihad to uphold the true faith, as well as the misery and misery of those who disobey and live by it.",
      "text_tafsir": "Setelah memberikan pengarahan khusus kepada Nabi Muhammad (yang juga menjadi cermin pengajaran bagi umat beliau) yang dimulai dari ayat 1 sampai dengan ayat 7 di atas, maka pada ayat ini, Allah menjelaskan pula tentang suasana kedatangan hari Kiamat. Di hari yang dijanjikan itu, orang-orang yang telah menyakiti hati para rasul dan juru dakwah karena menyampaikan ajaran Allah, akan mengalami suatu kesulitan yang luar biasa. Mereka tersentak mendengar seruan Kiamat ditiup Malaikat Israfil. Mereka langsung merasakan betapa hebatnya kesulitan yang harus ditempuh. Oleh karena itu, Allah memerintahkan Nabi Muhammad supaya bersabar menghadapi gangguan-gangguan musuh tersebut.\n\nPada hari Kiamat, semua orang mendapatkan apa yang telah mereka amalkan: kesenangan yang abadi bagi orang yang beriman dan berjihad menegakkan keimanan yang benar, serta kecelakaan dan kesengsaraan bagi siapa yang ingkar dan hidup di atas keingkaran itu.",
      "text_translation": "Maka apabila sangkakala ditiup,",
      "text": "فَاِذَا نُقِرَ فِى النَّاقُوْرِۙ ",
      "text_translation_en": "And [warn all men that] when the trumpet-call [of resurrection] is sounded,",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "After giving special guidance to Prophet Muhammad (who is also the mirror of teaching for his people) starting from verse 1 to verse 7 above, in this verse, God also explains the atmosphere of the Day of Judgment. On that promised day, those who had hurt the hearts of the apostles and preachers for preaching the teachings of God, would have a great difficulty. They were shocked to hear the Doomsday call for the Angel of Israel. They immediately realized how great a struggle it must be. Therefore, Allah ordered the Prophet Muhammad to be patient with the distractions of the enemy. On the Day of Judgment, all will receive what they have practiced: the eternal joy of believers and the jihad to uphold the true faith, as well as the misery and misery of those who disobey and live by it.",
      "text_tafsir": "Setelah memberikan pengarahan khusus kepada Nabi Muhammad (yang juga menjadi cermin pengajaran bagi umat beliau) yang dimulai dari ayat 1 sampai dengan ayat 7 di atas, maka pada ayat ini, Allah menjelaskan pula tentang suasana kedatangan hari Kiamat. Di hari yang dijanjikan itu, orang-orang yang telah menyakiti hati para rasul dan juru dakwah karena menyampaikan ajaran Allah, akan mengalami suatu kesulitan yang luar biasa. Mereka tersentak mendengar seruan Kiamat ditiup Malaikat Israfil. Mereka langsung merasakan betapa hebatnya kesulitan yang harus ditempuh. Oleh karena itu, Allah memerintahkan Nabi Muhammad supaya bersabar menghadapi gangguan-gangguan musuh tersebut.\n\nPada hari Kiamat, semua orang mendapatkan apa yang telah mereka amalkan: kesenangan yang abadi bagi orang yang beriman dan berjihad menegakkan keimanan yang benar, serta kecelakaan dan kesengsaraan bagi siapa yang ingkar dan hidup di atas keingkaran itu.",
      "text_translation": "maka itulah hari yang serba sulit,",
      "text": "فَذٰلِكَ يَوْمَىِٕذٍ يَّوْمٌ عَسِيْرٌۙ ",
      "text_translation_en": "that very Day shall be a day of anguish,",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "In this verse it is reiterated that it is not easy for unbelievers to cope with the dread and doomsday. For that day they will receive all the fruits of their labor in the book of practice from the left as a sign of hell. There was no happiness for the unbelievers on that day. It's all kind of hard and painful, unlike the fun they've had in the world before. Why are they having a hard time? In addition to receiving the book on the left, they must also take responsibility for their deeds before the Supreme Court of God, which no one can avoid and no one who is harmed. For on that day all the members of the body spoke with one another in their testimony of what they had done, while the mouths of those who were conversant in that day were locked in silence in a thousand languages. All mankind on the Day of Judgment bowed their heads before God, acknowledging their past mistakes and errors, but the door of regret was closed. As for the believers who have used their best time to fight in the way of Allah, they face the end with a bright feeling, without the slightest fear. They will not be complicit in the calculations of their deeds, and will march in line and take refuge in the Divine Court with a bright face.",
      "text_tafsir": "Dalam ayat ini ditegaskan lagi bahwa tidak mudah bagi orang-orang kafir menghadapi suasana hari Kiamat yang dahsyat dan menakutkan itu. Sebab, pada hari itulah mereka menerima segala hasil perbuatan mereka dalam buku amalan dari sebelah kiri sebagai tanda masuk neraka. Tidak ada lagi kebahagiaan bagi orang kafir pada hari tersebut. Semuanya serba susah dan pedih, tidak seperti kesenangan yang pernah mereka nikmati di dunia dahulu.\n\nKenapa mereka mengalami kesulitan? Selain pernah menerima buku di sebelah kiri, mereka juga harus mempertanggungjawabkan segala amal perbuatan mereka di hadapan Mahkamah Allah Yang Mahaadil, yang tidak seorang pun dapat mengelak dan tidak seorang pun yang merasa dirugikan. Sebab, di hari itu pula segala anggota tubuh ikut berbicara mengajukan kesaksian dengan sendirinya terhadap yang pernah dikerjakan, padahal mulut yang di dunia pandai bicara, pada hari itu terkunci rapat diam membisu seribu bahasa. Semua manusia pada hari Kiamat menundukkan kepala di hadapan Allah, mengakui kesalahan dan kekhilafan masa lalu, tetapi pintu penyesalan sudah ditutup. Adapun orang mukmin yang telah menggunakan waktu sebaik-baiknya untuk berjihad di jalan Allah, menghadapi kiamat dengan perasaan cerah, tanpa diliputi ketakutan sedikit pun. Mereka tidak akan dipersulit perhitungan amalnya, dan berjalan berbaris serta bersaf-saf menuju Mahkamah Ilahi dengan wajah cerah.",
      "text_translation": "bagi orang-orang kafir tidak mudah.",
      "text": "عَلَى الْكٰفِرِيْنَ غَيْرُ يَسِيْرٍ ",
      "text_translation_en": "not of ease, for all who [now] deny the truth!",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "In this verse, God reveals that He will do something to the man He has created. He created and brought it out of his mother's womb, without any treasure and without children. Then He gave him sustenance, and wisdom led his people. However, he rebelled against him. This verse mentions the word \"wahid\" (the only one), as an insult to al-Walid who is called wahid, because he is the most prominent among his people because of his wealth, rank, and wealth. Al-Walid owns a large ranch as well as a large ranch between Mecca and tha'if. It has camels, horses, goats, and slaves. Has seven powerful children (three of whom are converts to Islam, namely Khalid, Hisham, and 'Imarah). According to Mujahid, his son was 10. Moreover, God bestowed longevity on al-Walid (died at the age of 90), respected and respected by his people.",
      "text_tafsir": "Dalam ayat ini, Allah mengungkapkan bahwa Dialah yang akan berbuat sesuatu terhadap orang yang telah diciptakan-Nya sendiri. Dia telah menciptakan dan mengeluarkannya dari perut ibunya, tanpa harta bahkan tanpa anak. Lalu Dia menganugerahkan rezeki kepadanya, dan kepandaian memimpin kaumnya. Akan tetapi, dia membangkang kepada-Nya.\n\nAyat ini menyebutkan kata-kata \"wahid\" (satu-satunya), sebagai sindiran kepada al-Walid yang bergelar wahid, sebab dialah yang paling menonjol di kalangan kaumnya karena kekayaan, pangkat, dan harta yang dimilikinya. Al-Walid memiliki kebun ladang serta areal peternakan yang luas antara Mekah dan tha'if. Ia mempunyai unta, kuda, kambing, dan budak belian. Mempunyai tujuh orang anak yang perkasa (tiga di antaranya masuk Islam, yaitu Khalid, Hisyam, dan 'Imarah). Menurut Mujahid, putranya 10 orang. Lebih dari itu, Allah telah menganugerahkan usia panjang dengan kekayaan yang cukup kepada al-Walid itu (wafat dalam usia 90 tahun), dihormati dan disegani kaumnya.",
      "text_translation": "Biarkanlah Aku (yang bertindak) terhadap orang yang Aku sendiri telah menciptakannya,",
      "text": "ذَرْنِيْ وَمَنْ خَلَقْتُ وَحِيْدًاۙ ",
      "text_translation_en": "LEAVE Me alone [to deal] with him whom I have created alone,",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "God revealed that He gave al-Walid a great deal of wealth. Allah has bestowed on him a wealth of riches, making him the only rich man among his people. It is not surprising to hear the words of al-Walid's words say: I am the only child of this country, no one among the Arabs like me or my father, al-Mugirah. (History of the Qurthubi)",
      "text_tafsir": "Allah mengungkapkan bahwa Dia memberikan kepada al-Walid harta yang banyak. Allah telah menganugerahinya berbagai macam harta, sehingga menjadi satu-satunya orang terkaya di kalangan kaumnya. Tidaklah mengherankan kalau sampai terlontar ucapan dari mulut al-Walid perkataan:\n\nSayalah satu-satunya anak dari satu-satunya di negeri ini, tiada seorang pun di kalangan Arab yang sepertiku atau seperti ayahku, al-Mugirah. (Riwayat al-Qurthubi)",
      "text_translation": "dan Aku beri kekayaan yang melimpah,",
      "text": "وَّجَعَلْتُ لَهٗ مَالًا مَّمْدُوْدًاۙ ",
      "text_translation_en": "and to whom I have granted resources vast,",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "This verse reveals that God also bestowed upon the wealthy and noble of this Quraysh a son who always accompanied him. Because he is a rich man and does not need the help of others to take care of his son, his son does not have to travel to another country to earn a living because everything should be close to his own father. It is also said that the children of al-Walid always accompany him when he attends meetings or festivals, resulting in his greatness and glory. The proud children were 7 (al-Walid, Khalid, 'Imarah Hisyam,' As, Qais, and 'Abdussyam). Three of them (Khalid, Hisham, and 'Imarah) had converted to Islam, fulfilling the call of Muhammad.",
      "text_tafsir": "Ayat ini mengungkapkan bahwa Allah pun menganugerahkan kepada hartawan dan bangsawan Quraisy ini putra yang selalu ikut serta bersamanya. Sebab dia orang kaya dan tidak memerlukan bantuan orang lain mengurus anaknya, maka anaknya tidak perlu mengembara ke negeri lain untuk mencari rezeki karena semuanya harus berdekatan dengan ayahnya sendiri. Ada pula yang mengartikan bahwa anak-anak al-Walid selalu mendampinginya apabila ia menghadiri pertemuan atau perayaan-perayaan, sehingga menimbulkan kesan akan kebesaran dan kemuliaannya. Putra-putra yang dibanggakan itu ada 7 orang (al-Walid, Khalid, 'Imarah Hisyam, 'As, Qais, dan 'Abdussyam). Tiga orang di antaranya (Khalid, Hisyam, dan 'Imarah) telah masuk Islam, memenuhi seruan Nabi Muhammad.",
      "text_translation": "dan anak-anak yang selalu bersamanya,",
      "text": "وَّبَنِيْنَ شُهُوْدًاۙ ",
      "text_translation_en": "and children as [love's] witnesses,",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "This verse tells us that God gave al-Walid a lot of sustenance in terms of wealth, children, and longevity. In addition, the gift of the Quraysh was high, giving him the honorable title of \"Raihanah Quraysh\". Al-Walid should be grateful to Allah for all the blessings and pleasures he received. Instead, he turned from the truth and was stubborn. Such a character is mentioned in the Qur'an: All praise is to Allah who created the heavens and the earth, and makes it dark and light, yet the disbelievers still associate their Lord with something. (al-An'am \/ 6: 1)",
      "text_tafsir": "Ayat ini mengutarakan bahwa Allah mencurahkan rezeki sebanyak-banyaknya kepada al-Walid berupa harta, anak, dan umur panjang. Ditambah lagi karunia berupa kedudukan yang tinggi di kalangan Quraisy, sehingga mendapat gelar terhormat sebagai \"Raihanah Quraisy\".\n\nSeharusnya al-Walid bersyukur kepada Allah atas segenap nikmat dan kesenangan yang diterimanya. Akan tetapi, justru sebaliknya dia berpaling dari kebenaran dan bersikap keras kepala. Sifat seperti ini disebutkan dalam Al-Qur'an:\n\nSegala puji bagi Allah yang telah menciptakan langit dan bumi, dan menjadikan gelap dan terang, namun demikian orang-orang kafir masih mempersekutukan Tuhan mereka dengan sesuatu. (al-An'am\/6: 1)",
      "text_translation": "dan Aku beri kelapangan (hidup) seluas-luasnya.",
      "text": "وَّمَهَّدْتُّ لَهٗ تَمْهِيْدًاۙ ",
      "text_translation_en": "and to whose life I gave so wide a scope:",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "This verse states that al-Walid longs for Allah to increase his wealth, though he is rich in everything. He still expects more from what he has. Thus the dissatisfied human character is never bound by his wishes and desires. This character will always appear throughout the ages. The Messenger of Allah (may peace be upon him) warned in his words: If the son of Adam (man) had one valley of wealth, he would have wanted the second and if he had two valleys he would have wanted the third. (History of al-Bukhari, Muslim, at-Tirmidhi, and Ahmad from Anas) In another hadith, the Messenger of Allah (may peace be upon him) said: Ø¹Ø¨Ù'Ø§Ø³ . (Ibn 'Abbas's ad-Darimi history). Al-Walid's arrogance is too much. Al-Qurthubi says that al-hasan and others say, \"Al-Walid once made a statement: If Muhammad was the right one, surely heaven would not have been created except for me. (History of the Qurthubi and al-Alusi)",
      "text_tafsir": "Ayat ini menyatakan bahwa al-Walid ingin sekali supaya Allah menambah kekayaannya, walaupun sudah demikian kaya dalam segala-galanya. Dia masih mengharapkan tambahan dari apa yang sudah ada. Begitulah watak manusia yang tidak kenal puas, tidak pernah terbatas angan-angan dan keinginannya. Watak ini akan selalu muncul sepanjang zaman. Rasulullah saw telah memperingatkan dalam sabdanya yang berbunyi:\n\nAndaikata anak Adam (manusia) mempunyai satu lembah dari harta, pastilah ia menginginkan yang kedua dan jika ia memiliki dua lembah, pastilah ia menginginkan yang ketiga. (Riwayat al-Bukhari, Muslim, at-Tirmidhi, dan Ahmad dari Anas)\n\nDalam hadis lain, Rasulullah bersabda: Ø¹Ø¨Ù‘Ø§Ø³)\n\nDua orang yang banyak makan yang tidak pernah kenyang (yakni) penuntut ilmu dan pencari harta benda. (Riwayat ad-Darimi dari Ibnu 'Abbas). \n\nKesombongan al-Walid memang keterlaluan sekali. Al-Qurthubi mengatakan bahwa al-hasan dan lainnya berkata, \"Al-Walid pernah melontarkan ucapan:\n\nKalau memang Muhammad itu seorang yang benar, tentulah surga itu tidak diciptakan melainkan untuk saya. (Riwayat al-Qurthubi dan al-Alusi)",
      "text_translation": "Kemudian dia ingin sekali agar Aku menambahnya.",
      "text": "ثُمَّ يَطْمَعُ اَنْ اَزِيْدَۙ    ",
      "text_translation_en": "and yet, he greedily desires that I give yet more!",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "God insisted that al-Walid's attitude would not be what he wanted, because he was in fact opposed to his verses. Allah will never grant His will. Even historically, since the declaration of this God, al-Walid's wealth and wealth have diminished. Even so, the children died one by one and ended. Finally al-Walid lived in a caravan. Al-Walid has always been openly opposed to what Muhammad said, in terms of the oneness and power of God, explanations of the day of resurrection, the details of the pamphlets and prophecies he brought, and more. Al-Walid strongly opposed the revelation of Allah revealed through Muhammad. Therefore, he also sought to speak in imitation of the Qur'anic style. He considered that God was going to send an apostle among the Arabs, so no one would be more qualified to accept the sacred task than himself. Such arrogance and stubbornness dispel all the pleasures of his world. The other point we take from this verse is that al-Walid's disobedience to Allah is categorized as disbelief, meaning he knows very well and acknowledges with a small heart that what Muhammad said is true, but his tongue (speech) still defies it. This is the worst kind of infidelity. Like many there are today. Small hearts acknowledge that the teachings of the religion are true and profitable, but the tongue persists for many reasons.",
      "text_tafsir": "Allah menegaskan bahwa sikap al-Walid itu tidak akan menambah apa yang diinginkannya, karena sesungguhnya ia menentang ayat-ayat-Nya. Allah sekali-kali tidak akan mengabulkan kehendaknya. Bahkan menurut riwayat, semenjak turunnya pernyataan Allah ini, harta dan kekayaan al-Walid semakin berkurang. Anak pun begitu, meninggal satu persatu sehingga habis semua. Akhirnya al-Walid tinggal sebatang kara.\n\nAl-Walid selalu menunjukkan secara terang-terangan sikap menentang terhadap apa yang disampaikan Nabi Muhammad, berupa dalil-dalil tentang keesaan dan kekuasaan Allah, penjelasan tentang adanya hari kebangkitan, keterangan tentang risalah dan nubuat yang beliau bawa, dan lain-lain. Al-Walid menentang dengan keras wahyu Allah yang diturunkan melalui Muhammad saw. Oleh karena itu, ia berusaha pula hendak berbicara meniru gaya Al-Qur'an. Dia menganggap kalau Allah tetap hendak mengutus seorang rasul di kalangan bangsa Arab, maka tidak ada yang lebih pantas untuk menerima tugas suci itu melainkan dia sendiri. Begitulah kesombongan dan sikap keras kepala menghilangkan segala kesenangan duniawinya.\n\nSegi lain yang kita ambil dari ayat ini adalah keingkaran al-Walid terhadap Allah dikategorikan kufur 'inad, maksudnya dia tahu betul dan mengakui dengan hati kecilnya bahwa apa yang disampaikan Nabi Muhammad adalah benar, namun lidah (ucapan) tetap mengingkarinya. Inilah jenis kekafiran yang paling kotor dan keji. Seperti banyak terdapat pada masa sekarang. Hati kecil mengakui ajaran agama itu benar dan menguntungkan, namun lidah tetap menentang karena berbagai faktor.",
      "text_translation": "Tidak bisa! Sesungguhnya dia telah menentang ayat-ayat Kami (Al-Qur'an).",
      "text": "كَلَّاۗ اِنَّهٗ كَانَ لِاٰيٰتِنَا عَنِيْدًاۗ ",
      "text_translation_en": "Nay, verily, it is against Our messages that he knowingly, stubbornly sets himself",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "In this verse, God declares that He will bring al-Walid the ascendant. The meaning is that God threw him into a terrible hell that no one could bear. It is said of God that the difficulty that will be felt on the Day of Judgment will be like a mountain climber being asked to bear a heavy burden. In a hadith it is stated that the meaning of kamud (ascent) in this verse is as follows: Sa'ud is a volcano (which is hell) to be climbed by unbelievers for 70 years and then they (who climb it) fall back to down. That's the same thing over and over again. (History of Ahmad and at-Tirmidhi from Abu Sa'id) Some interpret the term with a torment that if one has encountered it, it will never stop.",
      "text_tafsir": "Dalam ayat ini, Allah menegaskan bahwa Dia akan memikulkan kepada al-Walid pendakian yang memayahkan. Maksudnya adalah Tuhan melemparkannya ke dalam neraka yang sangat dahsyat yang tidak ada sanggup ditahan sakitnya. Diibaratkan Allah bahwa kesukaran yang kelak dirasakan pada hari Kiamat diibaratkan seperti pendaki gunung yang disuruh memikul beban yang berat.\n\nDalam sebuah hadis diriwayatkan bahwa arti sa'ud (pendakian) dalam ayat ini adalah sebagai berikut:\n\nSa'ud adalah gunung api (di neraka) yang akan didaki oleh orang-orang kafir selama 70 tahun dan kemudian mereka (yang mendakinya) jatuh lagi ke bawah. Begitulah berulang-ulang untuk selama-lamanya. (Riwayat Ahmad dan at-Tirmidhi dari Abu Sa'id)\n\nAda yang mengartikan sa'ud itu dengan suatu azab yang kalau sudah menimpa seseorang, tidak akan pernah berhenti.",
      "text_translation": "Aku akan membebaninya dengan pendakian yang memayahkan.",
      "text": "سَاُرْهِقُهٗ صَعُوْدًاۗ ",
      "text_translation_en": "[and so] I shall constrain him to endure a painful uphill climb!",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "This verse explains that in fact al-Walid was thinking and understanding the revelations of God he had heard. However, he also tried to arrange his own words with the intention of denouncing what is in the Qur'an. He invented other words that were against the Qur'an, so that the Quraysh were happy with it, felt they wanted to be al-Walid.",
      "text_tafsir": "Ayat ini menerangkan bahwa sesungguhnya al-Walid memikirkan dan memahami wahyu Allah yang telah didengarnya. Akan tetapi, dia berusaha pula hendak menyusun kata-kata sendiri dengan maksud hendak mencela apa yang ada dalam Al-Qur'an. Dia mereka-reka perkataan lain yang bersifat menentang Al-Qur'an, sehingga orang Quraisy merasa senang dengannya, merasa cocok keinginan mereka dengan al-Walid.",
      "text_translation": "Sesungguhnya dia telah memikirkan dan menetapkan (apa yang ditetapkannya),",
      "text": "اِنَّهٗ فَكَّرَ وَقَدَّرَۙ ",
      "text_translation_en": "Behold, [when Our messages are conveyed to one who is bent on denying the truth,] he reflects and meditates [as to how to disprove them] –",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "God cursed al-Walid with the words \"woe to him, how is he determined?\" Cursed al-Walid and the Quraysh did so. In this regard, God said: And the Jews said, \"Uzair the son of God,\" and the Germans said, \"Christ the son of God.\" That's the word that comes out of their mouths. They imitate the words of the former infidels. God cursed them; how did they turn away? (at-9\/30: 30)",
      "text_tafsir": "Allah mengutuk al-Walid dengan kata-kata \"celakalah dia, bagaimana dia menetapkan?\" Terkutuklah al-Walid dan orang Quraisy yang berbuat seperti itu. Sehubungan dengan hal ini, Allah berfirman:\n\nDan orang-orang Yahudi berkata, \"Uzair putra Allah,\" dan orang-orang Nasrani berkata, \"Al-Masih putra Allah.\" Itulah ucapan yang keluar dari mulut mereka. Mereka meniru ucapan orang-orang kafir yang terdahulu. Allah melaknat mereka; bagaimana mereka sampai berpaling? (at-Taubah\/9: 30)",
      "text_translation": "maka celakalah dia! Bagaimana dia menetapkan?",
      "text": "فَقُتِلَ كَيْفَ قَدَّرَۙ ",
      "text_translation_en": "and thus he destroys himself, the way he meditates:",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "Then wail al-Walid how he decides. These words are repeated by God. God's curse on al-Walid was so severe, for he had just established that what Muhammad said was magic and accused him of being a sorcerer, as mentioned in the 24th verse before.",
      "text_tafsir": "Maka celakalah al-Walid bagaimana dia menetapkan. Kata-kata ini diulang lagi oleh Allah. Begitu kerasnya kutukan Allah kepada al-Walid, karena dia telah menetapkan begitu saja bahwa apa yang diucapkan oleh Nabi Muhammad adalah sihir dan menuduh beliau sebagai tukang sihir, seperti disebutkan dalam ayat ke-24 di depan.",
      "text_translation": "Sekali lagi, celakalah dia! Bagaimana dia menetapkan?",
      "text": "ثُمَّ قُتِلَ كَيْفَ قَدَّرَۙ ",
      "text_translation_en": "yea, he destroys himself, the way he meditates!",
      "juz_number": 29
    },
    "21": {
      "text_tafsir_en": "Then al-Walid thought over and over again that there was something wrong with the Qur'anic verses. He also wished that there was a verse of the Qur'an to suit his desire. Then he carefully returns there may be a weak point in the verse that can be used as a weapon to criticize and criticize the Prophet Muhammad.",
      "text_tafsir": "Kemudian al-Walid memikirkan berulang-ulang kalau-kalau ada suatu kesalahan dalam ayat-ayat Al-Qur'an. Ia juga berharap kalau-kalau ada ayat Al-Qur'an yang sesuai dengan keinginannya. Lalu dia teliti kembali boleh jadi ada titik kelemahan ayat yang dapat dijadikan senjata untuk mengkritik dan mencela Nabi Muhammad.",
      "text_translation": "Kemudian dia (merenung) memikirkan,",
      "text": "ثُمَّ نَظَرَۙ ",
      "text_translation_en": "and then he looks [around for new arguments],",
      "juz_number": 29
    },
    "22": {
      "text_tafsir_en": "This verse reveals that al-Walid suffered from facial and body aches as a result of failing to find the Qur'an's weaknesses, and did not know what to say to him. It is a signal that al-Walid and other scholars like him actually in his heart have recognized the truth of the Prophet Muhammad. It was only his stubbornness (disbelief inad) that led him to insult and insult the Prophet. Assuming he is firm in his conviction of the truth, he will surely get what he wants. It is impossible for her to have a pouty face that symbolizes dissatisfaction.",
      "text_tafsir": "Ayat ini mengungkapkan bahwa al-Walid bermasam muka dan cemberut karena gagal mencari kelemahan Al-Qur'an, dan tidak tahu lagi apa yang harus diucapkan untuk mencelanya. Hal ini merupakan isyarat bahwa al-Walid dan orang-orang yang ahli seperti dia sebenarnya dalam hati kecilnya telah mengakui kebenaran Nabi Muhammad. Hanya saja sikap keras kepalanya (kufur 'inad) mendorongnya untuk mencaci dan mencela Nabi. Andaikata ia mantap pada keyakinannya akan kebenaran tersebut, tentu dia mendapat yang ia inginkan. Tidak mungkin dia berwajah cemberut yang melambangkan perasaan yang tidak puas.",
      "text_translation": "lalu berwajah masam dan cemberut,",
      "text": "ثُمَّ عَبَسَ وَبَسَرَۙ ",
      "text_translation_en": "and then he frowns and glares,",
      "juz_number": 29
    },
    "23": {
      "text_tafsir_en": "This verse reveals that al-Walid turned away from the truth and made himself proud by turning his face away from the truth. While showing his arrogance, he was never willing to submit to the truth brought by Muhammad.",
      "text_tafsir": "Ayat ini mengungkapkan bahwa al-Walid berpaling dari kebenaran dan menyombongkan diri dengan memalingkan muka dari menatap kebenaran tersebut. Sambil menunjukkan keangkuhannya, ia sama sekali tidak mau tunduk dan patuh kepada kebenaran yang dibawa Nabi Muhammad.",
      "text_translation": "kemudian berpaling (dari kebenaran) dan menyombongkan diri,",
      "text": "ثُمَّ اَدْبَرَ وَاسْتَكْبَرَۙ ",
      "text_translation_en": "and in the end he turns his back [on Our message], and glories in his arrogance,",
      "juz_number": 29
    },
    "24": {
      "text_tafsir_en": "This verse argues that al-Walid then says that this Qur'an is nothing more than magic learned (from ancient times). According to him, the Qur'an is a speech that Muhammad copied from others before him, received from those who told him. Al-Walid also says that this Qur'an is nothing more than human words. This means in addition to accusing the Qur'an of being a learned magic, it is also the word of the common man and Muhammad steals it from the words of others. In short, he says that the Qur'an is not the Quran as revealed by Muhammad. Assuming that al-Walid's accusation is true, that the Qur'an is the word of the common man, of course other than Muhammad saw could have arranged it or created a better challenge. Whereas in the Arab world there are many literary figures whose tongues speak well and speak. Among them, there is also a deep mastery of all kinds of science. However, no one could match the words that came out of Muhammad's mouth.",
      "text_tafsir": "Ayat ini menegaskan bahwa al-Walid lalu mengatakan bahwa Al-Qur'an ini tidak lain hanyalah sihir yang dipelajari (dari orang-orang dahulu). Menurut dugaannya, Al-Qur'an adalah suatu ucapan yang disalin Muhammad dari orang lain yang lebih dahulu daripadanya, diterima dari orang yang bercerita kepadanya. \n\nAl-Walid juga mengatakan bahwa Al-Qur'an ini tidak lain hanyalah perkataan manusia. Maksudnya selain menuduh Al-Qur'an sebagai sihir yang bisa dipelajari, juga perkataan manusia biasa dan Muhammad mencurinya dari ucapan-ucapan orang lain. Secara ringkas, ia mengatakan bahwa Al-Qur'an bukan kalamullah seperti yang didakwahkan oleh Muhammad.\n\nAndaikata tuduhan al-Walid itu benar, bahwa Al-Qur'an itu perkataan manusia biasa, tentu orang lain selain Muhammad saw sanggup pula menyusun seperti itu atau membuat tantangan yang lebih bagus lagi. Padahal di kalangan bangsa Arab banyak sekali terdapat tokoh-tokoh sastrawan yang lidahnya fasih bersyair dan berpidato. Di antara mereka, juga ada yang mendalam penguasaannya tentang berbagai macam ilmu pengetahuan. Namun demikian, tidak ada seorang pun yang sanggup menandingi ucapan yang keluar dari mulut Muhammad itu.",
      "text_translation": "lalu dia berkata, “(Al-Qur'an) ini hanyalah sihir yang dipelajari (dari orang-orang dahulu).",
      "text": "فَقَالَ اِنْ هٰذَآ اِلَّا سِحْرٌ يُّؤْثَرُۙ ",
      "text_translation_en": "and says, \"All this is mere spellbinding eloquence handed down [from olden times]!",
      "juz_number": 29
    },
    "25": {
      "text_tafsir_en": "This verse argues that al-Walid then says that this Qur'an is nothing more than magic learned (from ancient times). According to him, the Qur'an is a speech that Muhammad copied from others before him, received from those who told him. Al-Walid also says that this Qur'an is nothing more than human words. This means in addition to accusing the Qur'an of being a learned magic, it is also the word of the common man and Muhammad steals it from the words of others. In short, he says that the Qur'an is not the Quran as revealed by Muhammad. Assuming that al-Walid's accusation is true, that the Qur'an is the word of the common man, of course other than Muhammad saw could have arranged it or created a better challenge. Whereas in the Arab world there are many literary figures whose tongues speak well and speak. Among them, there is also a deep mastery of all kinds of science. However, no one could match the words that came out of Muhammad's mouth.",
      "text_tafsir": "Ayat ini menegaskan bahwa al-Walid lalu mengatakan bahwa Al-Qur'an ini tidak lain hanyalah sihir yang dipelajari (dari orang-orang dahulu). Menurut dugaannya, Al-Qur'an adalah suatu ucapan yang disalin Muhammad dari orang lain yang lebih dahulu daripadanya, diterima dari orang yang bercerita kepadanya. \n\nAl-Walid juga mengatakan bahwa Al-Qur'an ini tidak lain hanyalah perkataan manusia. Maksudnya selain menuduh Al-Qur'an sebagai sihir yang bisa dipelajari, juga perkataan manusia biasa dan Muhammad mencurinya dari ucapan-ucapan orang lain. Secara ringkas, ia mengatakan bahwa Al-Qur'an bukan kalamullah seperti yang didakwahkan oleh Muhammad.\n\nAndaikata tuduhan al-Walid itu benar, bahwa Al-Qur'an itu perkataan manusia biasa, tentu orang lain selain Muhammad saw sanggup pula menyusun seperti itu atau membuat tantangan yang lebih bagus lagi. Padahal di kalangan bangsa Arab banyak sekali terdapat tokoh-tokoh sastrawan yang lidahnya fasih bersyair dan berpidato. Di antara mereka, juga ada yang mendalam penguasaannya tentang berbagai macam ilmu pengetahuan. Namun demikian, tidak ada seorang pun yang sanggup menandingi ucapan yang keluar dari mulut Muhammad itu.",
      "text_translation": "Ini hanyalah perkataan manusia.”",
      "text": "اِنْ هٰذَآ اِلَّا قَوْلُ الْبَشَرِۗ ",
      "text_translation_en": "This is nothing but the word of mortal man!\"",
      "juz_number": 29
    },
    "26": {
      "text_tafsir_en": "In this verse, God describes the exact response of those who are so bold in accusing the Qur'an as human speech. Allah will bring al-Walid into the Fire of Saqar. Saqar is one of the names of hell.",
      "text_tafsir": "Dalam ayat ini, Allah menggambarkan balasan yang setimpal bagi orang yang begitu lancang menuduh Al-Qur'an sebagai ucapan manusia. Allah akan memasukkan al-Walid ke dalam neraka Saqar. Saqar adalah salah satu nama neraka.",
      "text_translation": "Kelak, Aku akan memasukkannya ke dalam (neraka) Saqar,",
      "text": "سَاُصْلِيْهِ سَقَرَ",
      "text_translation_en": "[Hence,] I shall cause him to endure hell-fire [in the life to come]!",
      "juz_number": 29
    },
    "27": {
      "text_tafsir_en": "This verse describes the nature of Saqar's hell. The word wa ma adra ka (and you know it) in Arabic indicates a very serious and very serious problem in question. What do you know about Saqar? And surely no one knows it and reaches its truth except with the revelation given by revelation. The Saqar did not leave and did not return. This means that every human body that is burned, nothing is left of the flesh or bones. Then the dead body was restored to freshness and fresh, but burned again until the second time. Such evidence we find from another verse reads: Whenever their skin is shriveled, We change to another, that they may feel the torment. (Nisa '\/ 4: 56)",
      "text_tafsir": "Ayat ini menggambarkan sifat neraka Saqar. Perkataan wa ma adra ka (dan tahukah engkau) dalam bahasa Arab menunjukkan besar dan sangat dahsyatnya masalah yang dipertanyakan. Apakah yang engkau ketahui tentang Saqar? Dan pasti tidak seorang pun mengetahuinya dan mencapai hakikatnya kecuali dengan keterangan yang diberikan oleh wahyu.\n\nSaqar itu tidak meninggalkan dan tidak mengembalikan. Artinya setiap tubuh manusia yang di bakarnya, tidak satu pun yang tersisa dari daging maupun tulang. Kemudian tubuh yang telah hangus itu dikembalikan lagi menjadi baru dan segar, tetapi dibakar lagi sampai hangus untuk kedua kali dan seterusnya. Keterangan seperti itu kita peroleh dari ayat yang lain berbunyi:\n\nSetiap kali kulit mereka hangus, Kami ganti dengan kulit yang lain, agar mereka merasakan azab. (an-Nisa'\/4: 56)",
      "text_translation": "dan tahukah kamu apa (neraka) Saqar itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا سَقَرُۗ ",
      "text_translation_en": "And what could make thee conceive what hell-fire is?",
      "juz_number": 29
    },
    "28": {
      "text_tafsir_en": "This verse describes the nature of Saqar's hell. The word wa ma adra ka (and you know it) in Arabic indicates a very serious and very serious problem in question. What do you know about Saqar? And surely no one knows it and reaches its truth except with the revelation given by revelation. The Saqar did not leave and did not return. This means that every human body that is burned, nothing is left of the flesh or bones. Then the dead body was restored to freshness and fresh, but burned again until the second time. Such evidence we find from another verse reads: Whenever their skin is shriveled, We change to another, that they may feel the torment. (Nisa '\/ 4: 56)",
      "text_tafsir": "Ayat ini menggambarkan sifat neraka Saqar. Perkataan wa ma adra ka (dan tahukah engkau) dalam bahasa Arab menunjukkan besar dan sangat dahsyatnya masalah yang dipertanyakan. Apakah yang engkau ketahui tentang Saqar? Dan pasti tidak seorang pun mengetahuinya dan mencapai hakikatnya kecuali dengan keterangan yang diberikan oleh wahyu.\n\nSaqar itu tidak meninggalkan dan tidak mengembalikan. Artinya setiap tubuh manusia yang di bakarnya, tidak satu pun yang tersisa dari daging maupun tulang. Kemudian tubuh yang telah hangus itu dikembalikan lagi menjadi baru dan segar, tetapi dibakar lagi sampai hangus untuk kedua kali dan seterusnya. Keterangan seperti itu kita peroleh dari ayat yang lain berbunyi:\n\nSetiap kali kulit mereka hangus, Kami ganti dengan kulit yang lain, agar mereka merasakan azab. (an-Nisa'\/4: 56)",
      "text_translation": "Ia (Saqar itu) tidak meninggalkan dan tidak membiarkan,",
      "text": "لَا تُبْقِيْ وَلَا تَذَرُۚ ",
      "text_translation_en": "It does not allow to live, and neither leaves [to die],",
      "juz_number": 29
    },
    "29": {
      "text_tafsir_en": "This verse confirms that the Hell Saqar is the burner of human skin. In other words, the Saqar burns human skin in black. The meaning of the word lawwahah in this verse is \"that turns skin to black\". It's darker than the darkness of night.",
      "text_tafsir": "Ayat ini menegaskan bahwa neraka Saqar itu pembakar kulit manusia. Maksudnya, Saqar itu membakar hangus kulit manusia sampai hitam warnanya. Makna kata lawwahah dalam ayat ini sebenarnya adalah \"yang mengubah kulit menjadi hitam\". Lebih hitam dari kegelapan malam.",
      "text_translation": "yang menghanguskan kulit manusia.",
      "text": "لَوَّاحَةٌ لِّلْبَشَرِۚ ",
      "text_translation_en": "making [all truth] visible to mortal man.",
      "juz_number": 29
    },
    "30": {
      "text_tafsir_en": "This verse confirms that the Saqar was guarded by 19 angels led by Malik. It is narrated by al-Baihaqi and Ibn Mardawaih of al-Bara 'that a group of Jews once asked some of the Prophet's companions about the keepers of Hell. They answered, \"Allah and His Messenger know best.\" Then Gabriel came down to the Prophet to explain what they were asking, as in this 30th verse.",
      "text_tafsir": "Ayat ini menegaskan bahwa Saqar itu dijaga oleh 19 malaikat yang dikepalai oleh Malik. Diriwayatkan oleh al-Baihaqi dan Ibnu Mardawaih dari al-Bara' bahwa serombongan orang Yahudi pernah bertanya kepada sebagian sahabat Nabi tentang penjaga-penjaga neraka Jahanam. Mereka menjawab, \"Allah dan Rasul-Nya yang lebih mengetahui.\" Kemudian turunlah Jibril kepada Rasulullah menerangkan tentang apa yang mereka tanyakan itu, seperti dalam ayat ke-30 ini.",
      "text_translation": "Di atasnya ada sembilan belas (malaikat penjaga).",
      "text": "عَلَيْهَا تِسْعَةَ عَشَرَۗ ",
      "text_translation_en": "Over it are nineteen [powers].",
      "juz_number": 29
    },
    "31": {
      "text_tafsir_en": "At the beginning of this verse, Allah confirmed that the officers appointed by God to take care of the affairs of hell and torture its inhabitants were angels. They are given the trust to regulate and monitor him. They are great and mighty creatures of God and act on His orders. They are neither human nor jinn, because they are tortured there. Suppose the guardians of hell are of human type or jinn, of course they will be sorry for and gentle to creatures who are similar to them. As for the small number of them (19 angels) compared to the vast endless hell that must be watched and the tens of billions of jinns and humans who fill it, it is only a test and trial for unbelievers. So they say as they wish that they are able to fight with angels, as said by Ibnu Kaladah above. Allah deliberately mentioned the small amount so that the disbelievers became more arrogant, so that the retribution they had to suffer was multiplied. The slander (ordeal) intended here must be due to the fact that they are too few. That for unbelievers will cause a question mark, \"How can angels who are not up to 20 are able to control millions and even thousands of millions of jinns and humans who inhabit hell? Even if they realize, in fact angels are only mere instruments (attributes) that work on the orders and authority of God, even if only two or three angels, but if the Almighty Substance is behind him, the work will definitely go smoothly. of the truth that was spoken by the Prophet Muhammad, because the number 19 corresponds to the information they obtained in their holy books (the Torah and the Gospels), Allah also emphasized that between the sacred books that He had revealed could not exist opposition to one another: Believers will surely be more confident in their faith, because they see t how the people of the book justify and acknowledge the verses of the Qur'an, because it matches their contents with the Torah and the Gospel. Thus, the faithful and the class of people of the book (Jews and Christians) who are honest do not doubt the understanding of the sentence 19 angels. They (the experts of the book) also have no doubt about the nature of the faith of a Muslim, in fact they are also expected to be able to explain this to people who are still in doubt, such as the hypocrites and others. Here it is mentioned about the scribes and hypocrites, even though the verses were revealed in Mecca, and the people of the Book and hypocrites only appeared after the Prophet was in Medina. Therefore, this verse must be seen as a supernatural message that is sure to occur that is conveyed by Allah to the Prophet Muhammad. Telling that which is still unseen or has not yet been realized is one of the forms of the Prophet's miracles as mentioned in the books of hadith. Those who do not believe in the truth brought by the Holy Prophet will question the question of the angel who is 19. What exactly does God want by mentioning these too few numbers, and why not just mention 20? Because the prevailing custom of saying examples \/ for example always uses even numbers, then this parable of God is seen as odd. Then Allah explained, \"Thus Allah deceives who He wants from the hypocrites and polytheists who always question the number of angels. However, He also gives instructions to the right path for the people He wants so that they understand the purpose of the verse From this statement it is clear to us that differences of opinion among humans even between Muslims are natural, and that is the sunatullah.Only a person who gets guidance will get the true nature of the problem in question. Allah reiterates His power that only He who knows the nature of angels who are ordered to watch over unbelievers in hell. Only He understands how the angel actually is in charge. No human being who understands the wisdom of making the number 19. Some explain that this verse came down in response to Abu Jahl said when he heard the verse about the guard Hell 19 people, \"Do you know that Lord Muhammad is only 19 angels only His helper?\" What is clear 19 angels were assisted by other soldiers of God who many did not know but only Him. This verse confirms that the Saqar Hell, which is accompanied by a description as revealed in the above verse, is a warning to all humans.",
      "text_tafsir": "Pada permulaan ayat ini, Allah menegaskan bahwa petugas yang diangkat oleh Allah untuk mengurus urusan neraka dan memberikan siksaan kepada penghuninya adalah para malaikat. Mereka diberi kepercayaan mengatur dan mengawasinya. Mereka adalah makhluk Allah yang hebat dan perkasa serta bertindak atas perintah-Nya. Mereka bukan manusia dan bukan pula jin, sebab yang disiksa di sana adalah kedua makhluk itu. Andaikata penjaga neraka itu dari jenis manusia atau jin, tentu mereka akan kasihan dan lemah lembut kepada makhluk yang sejenis dengan mereka.\n\nAdapun jumlah mereka yang sedikit itu (19 malaikat) dibandingkan dengan begitu luas neraka yang tiada bertepi yang harus diawasi serta puluhan miliar jin dan manusia yang mengisinya, hanyalah sekadar ujian dan cobaan bagi golongan yang tidak percaya. Sehingga mereka berkata seenaknya bahwa mereka sanggup berkelahi dengan malaikat, seperti ucapan Ibnu Kaladah di atas. Allah dengan sengaja menyebutkan jumlah yang sedikit itu agar orang kafir itu semakin congkak, sehingga berlipat-ganda pula pembalasan yang harus mereka derita.\n\nFitnah (cobaan) yang dimaksudkan di sini tentulah karena jumlah mereka yang terlalu sedikit. Hal itu bagi orang yang tidak percaya akan menimbulkan tanda tanya, \"Bagaimana pula malaikat yang tidak sampai 20 itu sanggup mengendalikan jutaan bahkan ribuan juta jin dan manusia yang menghuni neraka? Padahal kalau mereka menyadari, sesungguhnya malaikat itu hanyalah sekadar alat belaka (atribut) yang bekerja atas perintah dan kekuasaan Allah. Biar pun hanya dua atau tiga malaikat, akan tetapi kalau Zat Yang Mahakuasa di belakangnya, pasti pekerjaan itu berjalan lancar.\n\nSebaliknya untuk orang yang telah diturunkan kitab (kaum Yahudi dan Nasrani) keterangan ayat ini seharusnya menambahkan keyakinan mereka akan kebenaran yang diucapkan oleh Nabi Muhammad. Sebab, jumlah yang 19 itu sesuai dengan keterangan yang mereka peroleh dalam kitab-kitab suci mereka (Taurat dan Injil). Allah sekaligus menegaskan bahwa antara kitab-kitab suci yang telah diturunkan-Nya itu tidak mungkin ada pertentangan satu sama lain. Orang beriman pasti akan bertambah yakin dengan keimanannya, sebab mereka melihat bagaimana orang ahli kitab membenarkan dan mengakui ayat Al-Qur'an, karena sesuai isinya dengan Taurat dan Injil.\n\nDengan demikian, orang-orang beriman dan golongan ahli kitab (Yahudi dan Nasrani) yang bersifat jujur tidak meragukan lagi pengertian kalimat 19 malaikat itu. Mereka (ahli kitab) juga tidak ragu lagi bagaimana hakikat iman seorang muslim, bahkan mereka diharapkan pula dapat menjelaskan hal demikian kepada orang yang masih ragu-ragu, seperti kepada golongan munafik dan lain-lain.\n\nDi sini disebutkan tentang ahli kitab dan munafik, padahal ayatnya diturunkan di Mekah, dan orang ahli Kitab dan munafik baru muncul setelah Rasulullah saw berada di Medinah. Oleh karena itu, ayat ini harus dipandang sebagai berita gaib yang pasti akan terjadi yang disampaikan Allah kepada Nabi Muhammad. Menceritakan yang masih gaib atau belum terwujud termasuk salah satu bentuk mukjizat Nabi seperti disebutkan dalam kitab-kitab hadis.\n\nBagi orang-orang yang tidak percaya kepada kebenaran yang dibawa Nabi saw akan mempertanyakan kembali soal malaikat yang 19 itu. Apa sesungguhnya yang dikehendaki Allah dengan menyebutkan bilangan terlalu sedikit ini, dan kenapa tidak disebutkan 20 saja? Karena kebiasaan yang berlaku menyebut contoh\/misal selalu menggunakan bilangan genap, maka perumpamaan Allah ini dipandang ganjil.\n\nLalu Allah menjelaskan, \"Demikianlah Allah menyesatkan siapa yang dikehendaki-Nya dari golongan munafik dan musyrik yang selalu mempersoalkan jumlah bilangan malaikat itu. Akan tetapi, Dia pula yang memberikan petunjuk ke jalan yang benar bagi orang yang dikehendaki-Nya sehingga mereka paham dengan maksud ayat ini.\n\nDari keterangan ini jelaslah bagi kita bahwa perbedaan pendapat di kalangan manusia bahkan antara orang muslim adalah wajar, dan itu merupakan sunatullah. Hanya orang yang mendapat bimbingan akan memperoleh hakikat yang sebenarnya dari masalah yang dipersoalkan.\n\nAllah kembali menegaskan kekuasaan-Nya bahwa hanya Dia yang tahu hakikat malaikat yang diperintahkan untuk mengawasi orang-orang kafir di neraka. Hanya Dia saja yang mengerti bagaimana sesungguhnya malaikat yang bertugas itu. Tidak ada seorang pun manusia yang mengerti hikmah menjadikan jumlah 19 itu. Ada yang menerangkan bahwa ayat ini turun sebagai jawaban dari ucapan Abu Jahal ketika mendengar ayat tentang penjaga neraka 19 orang itu, \"Tahukah engkau bahwa Tuhan Muhammad itu cuma 19 malaikat saja penolong-Nya?\" Yang jelas 19 malaikat itu dibantu oleh tentara Allah yang lain yang banyaknya tiada yang tahu melainkan Dia saja.\n\nAyat ini menegaskan bahwa neraka Saqar yang disertai dengan gambaran seperti diturunkan ayat di atas, merupakan peringatan bagi sekalian manusia.",
      "text_translation": "Dan yang Kami jadikan penjaga neraka itu hanya dari malaikat; dan Kami menentukan bilangan mereka itu hanya sebagai cobaan bagi orang-orang kafir, agar orang-orang yang diberi kitab menjadi yakin, agar orang yang beriman bertambah imannya, agar orang-orang yang diberi kitab dan orang-orang mukmin itu tidak ragu-ragu; dan agar orang-orang yang di dalam hatinya ada penyakit dan orang-orang kafir (berkata), “Apakah yang dikehendaki Allah dengan (bilangan) ini sebagai suatu perumpamaan?” Demikianlah Allah membiarkan sesat orang-orang yang Dia kehendaki dan memberi petunjuk kepada orang-orang yang Dia kehendaki. Dan tidak ada yang mengetahui bala tentara Tuhanmu kecuali Dia sendiri. Dan Saqar itu tidak lain hanyalah peringatan bagi manusia.",
      "text": "وَمَا جَعَلْنَآ اَصْحٰبَ النَّارِ اِلَّا مَلٰۤىِٕكَةً ۖوَّمَا جَعَلْنَا عِدَّتَهُمْ اِلَّا فِتْنَةً لِّلَّذِيْنَ كَفَرُوْاۙ لِيَسْتَيْقِنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ وَيَزْدَادَ الَّذِيْنَ اٰمَنُوْٓا اِيْمَانًا وَّلَا يَرْتَابَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ وَالْمُؤْمِنُوْنَۙ وَلِيَقُوْلَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ وَّالْكٰفِرُوْنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًاۗ  كَذٰلِكَ يُضِلُّ اللّٰهُ مَنْ يَّشَاۤءُ وَيَهْدِيْ مَنْ يَّشَاۤءُۗ وَمَا يَعْلَمُ جُنُوْدَ رَبِّكَ اِلَّا هُوَۗ وَمَا هِيَ اِلَّا ذِكْرٰى لِلْبَشَرِ ࣖ",
      "text_translation_en": "For We have caused none but angelic powers to lord over the fire [of hell]; and We have not caused their number to be aught but a trial for those who are bent on denying the truth - to the end that they who have been granted revelation aforetime might be convinced [of the truth of this divine writ]; and that they who have attained to faith [in it] might grow yet more firm in their faith; and that [both] they who have been granted the earlier revelation and they who believe [in this one] might be freed of all doubt; and that they in whose hearts is disease and the who deny the truth outright might ask, \"What does [your] God mean by this parable?\" In this way God lets go astray him that wills [to go astray], and guides aright him that wills [to be guided]. And none can comprehend thy Sustainers forces save Him alone: and all this is but a reminder to mortal man.",
      "juz_number": 29
    },
    "32": {
      "text_tafsir_en": "In these verses, God warns that there is no way for humans to deny His sovereignty that they can witness on their own. The words \"kalla\" (not at all) are also objections to the words of the above monks. To reinforce that, God swore by the moon, the night when it passed, and the dawn began to shine. With that month, night, and dawn God insisted that Saqar hell was a terrible disaster for mankind. Some explain that the meaning of al-kubar (one of the great disasters) is one of the seven terrible hell. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. It is a threat to humanity. The existence of the seven Hell (one of them Saqar) is a threat to those who still do not submit to the will of God. Some interpret the nadhir (threatening) as the nature of Allah, so the meaning of this verse is: \"I am threatening you, therefore fear the threat\". Some interpret it as the nature of Prophet Muhammad as mentioned in the second verse above.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah memperingatkan bahwa tidak ada jalan bagi manusia untuk mengingkari kekuasaan-Nya yang nyata-nyata dapat mereka saksikan sendiri.\n\nKata-kata \"kalla\" (sekali-kali tidak) juga merupakan bantahan terhadap ucapan-ucapan orang musyrik di atas. Untuk menguatkan hal itu, Allah bersumpah dengan bulan, malam bila ia telah berlalu, dan bila subuh mulai bersinar. Dengan bulan, malam, dan subuh itu Allah menegaskan bahwa neraka Saqar itu merupakan suatu bencana yang amat dahsyat bagi umat manusia.\n\nAda yang menerangkan bahwa maksud ihda al-kubar (salah satu bencana yang sangat besar) adalah salah satu dari tujuh neraka yang dahsyat. Ketujuh lembah neraka (seperti yang disebutkan dalam ayat-ayat lain) itu adalah: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, dan Hawiyah.\n\nHal tersebut adalah sebagai ancaman bagi manusia. Adanya tujuh neraka itu (satu di antaranya Saqar) merupakan ancaman bagi yang masih tidak mau tunduk kepada kehendak Allah.\n\nAda yang mengartikan nadhir (yang memberi ancaman) itu adalah sifat Allah, sehingga arti ayat ini adalah: \"Aku ini memberikan ancaman kepadamu, karena itu hendaklah kamu takut kepada ancaman itu\". Ada yang mengartikan nadhir sebagai sifat Nabi Muhammad seperti disebutkan dalam ayat kedua di atas tadi.",
      "text_translation": "Tidak! Demi bulan,",
      "text": "كَلَّا وَالْقَمَرِۙ",
      "text_translation_en": "NAY, but consider the moon!",
      "juz_number": 29
    },
    "33": {
      "text_tafsir_en": "In these verses, God warns that there is no way for humans to deny His sovereignty that they can witness on their own. The words \"kalla\" (not at all) are also objections to the words of the above monks. To reinforce that, God swore by the moon, the night when it passed, and the dawn began to shine. With that month, night, and dawn God insisted that Saqar hell was a terrible disaster for mankind. Some explain that the meaning of al-kubar (one of the great disasters) is one of the seven terrible hell. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. It is a threat to humanity. The existence of the seven Hell (one of them Saqar) is a threat to those who still do not submit to the will of God. Some interpret the nadhir (threatening) as the nature of Allah, so the meaning of this verse is: \"I am threatening you, therefore fear the threat\". Some interpret it as the nature of Prophet Muhammad as mentioned in the second verse above.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah memperingatkan bahwa tidak ada jalan bagi manusia untuk mengingkari kekuasaan-Nya yang nyata-nyata dapat mereka saksikan sendiri.\n\nKata-kata \"kalla\" (sekali-kali tidak) juga merupakan bantahan terhadap ucapan-ucapan orang musyrik di atas. Untuk menguatkan hal itu, Allah bersumpah dengan bulan, malam bila ia telah berlalu, dan bila subuh mulai bersinar. Dengan bulan, malam, dan subuh itu Allah menegaskan bahwa neraka Saqar itu merupakan suatu bencana yang amat dahsyat bagi umat manusia.\n\nAda yang menerangkan bahwa maksud ihda al-kubar (salah satu bencana yang sangat besar) adalah salah satu dari tujuh neraka yang dahsyat. Ketujuh lembah neraka (seperti yang disebutkan dalam ayat-ayat lain) itu adalah: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, dan Hawiyah.\n\nHal tersebut adalah sebagai ancaman bagi manusia. Adanya tujuh neraka itu (satu di antaranya Saqar) merupakan ancaman bagi yang masih tidak mau tunduk kepada kehendak Allah.\n\nAda yang mengartikan nadhir (yang memberi ancaman) itu adalah sifat Allah, sehingga arti ayat ini adalah: \"Aku ini memberikan ancaman kepadamu, karena itu hendaklah kamu takut kepada ancaman itu\". Ada yang mengartikan nadhir sebagai sifat Nabi Muhammad seperti disebutkan dalam ayat kedua di atas tadi.",
      "text_translation": "dan demi malam ketika telah berlalu,",
      "text": "وَالَّيْلِ اِذْ اَدْبَرَۙ",
      "text_translation_en": "Consider the night when it departs,",
      "juz_number": 29
    },
    "34": {
      "text_tafsir_en": "In these verses, God warns that there is no way for humans to deny His sovereignty that they can witness on their own. The words \"kalla\" (not at all) are also objections to the words of the above monks. To reinforce that, God swore by the moon, the night when it passed, and the dawn began to shine. With that month, night, and dawn God insisted that Saqar hell was a terrible disaster for mankind. Some explain that the meaning of al-kubar (one of the great disasters) is one of the seven terrible hell. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. It is a threat to humanity. The existence of the seven Hell (one of them Saqar) is a threat to those who still do not submit to the will of God. Some interpret the nadhir (threatening) as the nature of Allah, so the meaning of this verse is: \"I am threatening you, therefore fear the threat\". Some interpret it as the nature of Prophet Muhammad as mentioned in the second verse above.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah memperingatkan bahwa tidak ada jalan bagi manusia untuk mengingkari kekuasaan-Nya yang nyata-nyata dapat mereka saksikan sendiri.\n\nKata-kata \"kalla\" (sekali-kali tidak) juga merupakan bantahan terhadap ucapan-ucapan orang musyrik di atas. Untuk menguatkan hal itu, Allah bersumpah dengan bulan, malam bila ia telah berlalu, dan bila subuh mulai bersinar. Dengan bulan, malam, dan subuh itu Allah menegaskan bahwa neraka Saqar itu merupakan suatu bencana yang amat dahsyat bagi umat manusia.\n\nAda yang menerangkan bahwa maksud ihda al-kubar (salah satu bencana yang sangat besar) adalah salah satu dari tujuh neraka yang dahsyat. Ketujuh lembah neraka (seperti yang disebutkan dalam ayat-ayat lain) itu adalah: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, dan Hawiyah.\n\nHal tersebut adalah sebagai ancaman bagi manusia. Adanya tujuh neraka itu (satu di antaranya Saqar) merupakan ancaman bagi yang masih tidak mau tunduk kepada kehendak Allah.\n\nAda yang mengartikan nadhir (yang memberi ancaman) itu adalah sifat Allah, sehingga arti ayat ini adalah: \"Aku ini memberikan ancaman kepadamu, karena itu hendaklah kamu takut kepada ancaman itu\". Ada yang mengartikan nadhir sebagai sifat Nabi Muhammad seperti disebutkan dalam ayat kedua di atas tadi.",
      "text_translation": "dan demi subuh apabila mulai terang, ",
      "text": "وَالصُّبْحِ اِذَآ اَسْفَرَۙ",
      "text_translation_en": "and the morn when it dawns!",
      "juz_number": 29
    },
    "35": {
      "text_tafsir_en": "In these verses, God warns that there is no way for humans to deny His sovereignty that they can witness on their own. The words \"kalla\" (not at all) are also objections to the words of the above monks. To reinforce that, God swore by the moon, the night when it passed, and the dawn began to shine. With that month, night, and dawn God insisted that Saqar hell was a terrible disaster for mankind. Some explain that the meaning of al-kubar (one of the great disasters) is one of the seven terrible hell. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. It is a threat to humanity. The existence of the seven Hell (one of them Saqar) is a threat to those who still do not submit to the will of God. Some interpret the nadhir (threatening) as the nature of Allah, so the meaning of this verse is: \"I am threatening you, therefore fear the threat\". Some interpret it as the nature of Prophet Muhammad as mentioned in the second verse above.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah memperingatkan bahwa tidak ada jalan bagi manusia untuk mengingkari kekuasaan-Nya yang nyata-nyata dapat mereka saksikan sendiri.\n\nKata-kata \"kalla\" (sekali-kali tidak) juga merupakan bantahan terhadap ucapan-ucapan orang musyrik di atas. Untuk menguatkan hal itu, Allah bersumpah dengan bulan, malam bila ia telah berlalu, dan bila subuh mulai bersinar. Dengan bulan, malam, dan subuh itu Allah menegaskan bahwa neraka Saqar itu merupakan suatu bencana yang amat dahsyat bagi umat manusia.\n\nAda yang menerangkan bahwa maksud ihda al-kubar (salah satu bencana yang sangat besar) adalah salah satu dari tujuh neraka yang dahsyat. Ketujuh lembah neraka (seperti yang disebutkan dalam ayat-ayat lain) itu adalah: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, dan Hawiyah.\n\nHal tersebut adalah sebagai ancaman bagi manusia. Adanya tujuh neraka itu (satu di antaranya Saqar) merupakan ancaman bagi yang masih tidak mau tunduk kepada kehendak Allah.\n\nAda yang mengartikan nadhir (yang memberi ancaman) itu adalah sifat Allah, sehingga arti ayat ini adalah: \"Aku ini memberikan ancaman kepadamu, karena itu hendaklah kamu takut kepada ancaman itu\". Ada yang mengartikan nadhir sebagai sifat Nabi Muhammad seperti disebutkan dalam ayat kedua di atas tadi.",
      "text_translation": "sesunggunya (Saqar itu) adalah salah satu (bencana) yang sangat besar,",
      "text": "اِنَّهَا لَاِحْدَى الْكُبَرِۙ",
      "text_translation_en": "Verily, that [hell-fire) is Indeed one of the great [forewarnings] –",
      "juz_number": 29
    },
    "36": {
      "text_tafsir_en": "In these verses, God warns that there is no way for humans to deny His sovereignty that they can witness on their own. The words \"kalla\" (not at all) are also objections to the words of the above monks. To reinforce that, God swore by the moon, the night when it passed, and the dawn began to shine. With that month, night, and dawn God insisted that Saqar hell was a terrible disaster for mankind. Some explain that the meaning of al-kubar (one of the great disasters) is one of the seven terrible hell. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. It is a threat to humanity. The existence of the seven Hell (one of them Saqar) is a threat to those who still do not submit to the will of God. Some interpret the nadhir (threatening) as the nature of Allah, so the meaning of this verse is: \"I am threatening you, therefore fear the threat\". Some interpret it as the nature of Prophet Muhammad as mentioned in the second verse above.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah memperingatkan bahwa tidak ada jalan bagi manusia untuk mengingkari kekuasaan-Nya yang nyata-nyata dapat mereka saksikan sendiri.\n\nKata-kata \"kalla\" (sekali-kali tidak) juga merupakan bantahan terhadap ucapan-ucapan orang musyrik di atas. Untuk menguatkan hal itu, Allah bersumpah dengan bulan, malam bila ia telah berlalu, dan bila subuh mulai bersinar. Dengan bulan, malam, dan subuh itu Allah menegaskan bahwa neraka Saqar itu merupakan suatu bencana yang amat dahsyat bagi umat manusia.\n\nAda yang menerangkan bahwa maksud ihda al-kubar (salah satu bencana yang sangat besar) adalah salah satu dari tujuh neraka yang dahsyat. Ketujuh lembah neraka (seperti yang disebutkan dalam ayat-ayat lain) itu adalah: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, dan Hawiyah.\n\nHal tersebut adalah sebagai ancaman bagi manusia. Adanya tujuh neraka itu (satu di antaranya Saqar) merupakan ancaman bagi yang masih tidak mau tunduk kepada kehendak Allah.\n\nAda yang mengartikan nadhir (yang memberi ancaman) itu adalah sifat Allah, sehingga arti ayat ini adalah: \"Aku ini memberikan ancaman kepadamu, karena itu hendaklah kamu takut kepada ancaman itu\". Ada yang mengartikan nadhir sebagai sifat Nabi Muhammad seperti disebutkan dalam ayat kedua di atas tadi.",
      "text_translation": "sebagai peringatan bagi manusia, ",
      "text": "نَذِيْرًا لِّلْبَشَرِۙ",
      "text_translation_en": "a warning to mortal man –",
      "juz_number": 29
    },
    "37": {
      "text_tafsir_en": "God insists that the threat is directed at anyone who wants to accept or reject it. It is possible that the threat was rejected, but it will feel the consequences, as al-Walid mentioned in the previous verse. The one who wants to go forward or backward in this verse means \"to those who want to achieve the most good and obedient deeds or to abstain from those virtues and obedience into the valley of sin and evil\". In short it can be explained that the infidels understood the existence of Saqar hell, its torture, and its guardian angels. It is up to them whether to abstain immediately by pursuing as many acts of righteousness and obedience as possible, or refusing and rejecting them, so that at the promised time, they will see for themselves. From this 37th verse, Ibn 'Abbas concludes that in addition to his words of threat (tahdid), it is also an information that those who believe and obey the Prophet Muhammad must be rewarded with unending reward, but who reject Muhammad's truth and his lies will be tormented with endless torment.",
      "text_tafsir": "Allah menegaskan bahwa ancaman tersebut ditujukan kepada siapa saja yang mau menerima atau menolaknya. Boleh saja ancaman itu ditolak, namun akan merasakan akibatnya, seperti halnya al-Walid yang disebut dalam ayat yang lalu. Yang berkehendak maju atau mundur dalam ayat ini berarti \"bagi siapa yang ingin mencapai kebaikan dan perbuatan taat sebanyak-banyaknya atau menjauhi kebaikan dan ketaatan itu sehingga terjatuh ke dalam lembah dosa dan maksiat\".\n\nSecara singkat dapat dijelaskan bahwa orang-orang kafir itu telah memahami tentang adanya neraka Saqar, siksaannya, dan para malaikat penjaganya. Terserah kepada mereka apakah akan segera menghindarinya dengan mengejar sebanyak mungkin perbuatan amal saleh dan taat, ataukah tetap menolak dan mengingkarinya, sehingga pada saat yang dijanjikan, mereka akan melihat sendiri buktinya.\n\nDari ayat ke-37 ini, Ibnu 'Abbas menyimpulkan bahwa selain kalimat-kalimatnya bersifat ancaman (tahdid), juga merupakan suatu maklumat bahwa siapa yang beriman dan taat kepada Nabi Muhammad pasti dibalasi dengan pahala yang tiada putusnya, sebaliknya yang menolak kebenaran Muhammad saw serta mendustainya akan disiksa dengan azab yang tiada henti-hentinya.",
      "text_translation": "(yaitu) bagi siapa di antara kamu yang ingin maju atau mundur.",
      "text": "لِمَنْ شَاۤءَ مِنْكُمْ اَنْ يَّتَقَدَّمَ اَوْ يَتَاَخَّرَۗ",
      "text_translation_en": "to everyone of you, whether he chooses to come forward or to hang back!",
      "juz_number": 29
    },
    "38": {
      "text_tafsir_en": "In this verse God emphasizes that every human soul is placed in God's presence. Both the Muslims and the infidels, the disobedient or the obedient, all depend on Allah. Every soul is bound by a charity which is practiced until the Day of Judgment, except the right-hand people. This means that they can release their bond with God through the good deeds they do, just as one can break free from their pawn status for paying their obligations. The right-wing people are sincere believers, who receive their practice books on the right on the Day of Judgment. However, some say the right-handers in this verse are children who have not yet been accounted for their sins and crimes. There are even those who think that the right people are angels.",
      "text_tafsir": "Dalam ayat ini Allah menegaskan bahwa setiap jiwa manusia tergadai di sisi Allah. Baik yang muslim maupun yang kafir, yang ingkar atau pun yang taat, semuanya tergantung kepada Allah. Tiap jiwa terikat dengan amal yang dikerjakan sampai hari Kiamat, kecuali golongan kanan. Artinya mereka dapat melepaskan keterikatan mereka di sisi Allah dengan amal-amal baik yang mereka kerjakan, sebagaimana halnya seorang dapat melepaskan diri dari status gadai karena telah membayarkan kewajibannya.\n\nGolongan kanan yang dimaksudkan adalah orang-orang mukmin yang ikhlas, yang menerima buku amalan mereka di sebelah kanan di hari Kiamat. Akan tetapi, ada pula yang mengatakan golongan kanan dalam ayat ini adalah anak-anak yang memang belum diperhitungkan dosa dan kejahatannya. Bahkan ada yang berpendapat golongan kanan itu adalah para malaikat.",
      "text_translation": "Setiap orang bertanggung jawab atas apa yang telah dilakukannya,",
      "text": "كُلُّ نَفْسٍۢ بِمَا كَسَبَتْ رَهِيْنَةٌۙ",
      "text_translation_en": "[On the Day of Judgment,] every human being will be held in pledge for whatever [evil] he has wrought –",
      "juz_number": 29
    },
    "39": {
      "text_tafsir_en": "In this verse God emphasizes that every human soul is placed in God's presence. Both the Muslims and the infidels, the disobedient or the obedient, all depend on Allah. Every soul is bound by a charity which is practiced until the Day of Judgment, except the right-hand people. This means that they can release their bond with God through the good deeds they do, just as one can break free from their pawn status for paying their obligations. The right-wing people are sincere believers, who receive their practice books on the right on the Day of Judgment. However, some say the right-handers in this verse are children who have not yet been accounted for their sins and crimes. There are even those who think that the right people are angels.",
      "text_tafsir": "Dalam ayat ini Allah menegaskan bahwa setiap jiwa manusia tergadai di sisi Allah. Baik yang muslim maupun yang kafir, yang ingkar atau pun yang taat, semuanya tergantung kepada Allah. Tiap jiwa terikat dengan amal yang dikerjakan sampai hari Kiamat, kecuali golongan kanan. Artinya mereka dapat melepaskan keterikatan mereka di sisi Allah dengan amal-amal baik yang mereka kerjakan, sebagaimana halnya seorang dapat melepaskan diri dari status gadai karena telah membayarkan kewajibannya.\n\nGolongan kanan yang dimaksudkan adalah orang-orang mukmin yang ikhlas, yang menerima buku amalan mereka di sebelah kanan di hari Kiamat. Akan tetapi, ada pula yang mengatakan golongan kanan dalam ayat ini adalah anak-anak yang memang belum diperhitungkan dosa dan kejahatannya. Bahkan ada yang berpendapat golongan kanan itu adalah para malaikat.",
      "text_translation": "kecuali golongan kanan,",
      "text": "اِلَّآ اَصْحٰبَ الْيَمِيْنِ ۛ ",
      "text_translation_en": "save those who shall have attained to righteousness:",
      "juz_number": 29
    },
    "40": {
      "text_tafsir_en": "This verse further explains that the right people are their place in heaven, they ask each other what the fate of the wicked is. They were greeted by angels with the salutations of the word of God: \"Greetings to you, O right hand!\" (welcome to the angels). (al-Waqi'ah \/ 56: 91) And the word of Allah: ¦ His guardians say to them, \"Peace be upon you, blessed are you! (az-Zumar \/ 39: 73)",
      "text_tafsir": "Ayat ini menjelaskan lebih lanjut bahwa golongan kanan itu tempatnya di surga, mereka saling bertanya bagaimana nasib golongan yang durhaka. Mereka disambut oleh malaikat dengan ucapan salam sebagaimana firman Allah:\n\nMaka,\"Salam bagimu (wahai) dari golongan kanan!\" (sambut malaikat). (al-Waqi'ah\/56: 91)\n\nDan firman Allah:\n\n¦Penjaga-penjaganya berkata kepada mereka, \"Kesejahteraan (dilimpahkan) atasmu, berbahagialah kamu! Maka masuklah, kamu kekal di dalamnya.\" (az-Zumar\/39: 73)",
      "text_translation": "berada di dalam surga, mereka saling menanyakan,",
      "text": "فِيْ جَنّٰتٍ ۛ يَتَسَاۤءَلُوْنَۙ",
      "text_translation_en": "[dwelling] In gardens [of paradise], they will inquire",
      "juz_number": 29
    },
    "41": {
      "text_tafsir_en": "This verse further explains that the right people are their place in heaven, they ask each other what the fate of the wicked is. They were greeted by angels with the salutations of the word of God: \"Greetings to you, O right hand!\" (welcome to the angels). (al-Waqi'ah \/ 56: 91) And the word of Allah: ¦ His guardians say to them, \"Peace be upon you, blessed are you! (az-Zumar \/ 39: 73)",
      "text_tafsir": "Ayat ini menjelaskan lebih lanjut bahwa golongan kanan itu tempatnya di surga, mereka saling bertanya bagaimana nasib golongan yang durhaka. Mereka disambut oleh malaikat dengan ucapan salam sebagaimana firman Allah:\n\nMaka,\"Salam bagimu (wahai) dari golongan kanan!\" (sambut malaikat). (al-Waqi'ah\/56: 91)\n\nDan firman Allah:\n\n¦Penjaga-penjaganya berkata kepada mereka, \"Kesejahteraan (dilimpahkan) atasmu, berbahagialah kamu! Maka masuklah, kamu kekal di dalamnya.\" (az-Zumar\/39: 73)",
      "text_translation": "tentang (keadaan) orang-orang yang berdosa, ",
      "text": "عَنِ الْمُجْرِمِيْنَۙ",
      "text_translation_en": "of those who were lost in sin:",
      "juz_number": 29
    },
    "42": {
      "text_tafsir_en": "This verse explains that the right is in a heavenly room full of pleasure, while the sinful are wandering in the punishment of hell. However, they could ask each other questions, \"Why were you thrown into hell?\" They answered honestly and frankly that they did not perform prayers above the former world, in contrast to the believers who continued to perform prayers. Because at that time they were not convinced in the slightest that it was actually ordered by God.",
      "text_tafsir": "Ayat ini menjelaskan bahwa golongan kanan berada dalam kamar surga yang penuh kenikmatan, sementara golongan yang berdosa bergelimang dalam azab neraka. Namun demikian, mereka saling dapat tanya bertanya, \"Kenapa engkau sampai dimasukkan ke dalam neraka itu?\"\n\nMereka menjawab dengan jujur dan terus terang bahwa mereka tidak mengerjakan salat di atas dunia dahulu, berbeda dengan orang-orang mukmin yang tetap melaksanakan salat. Sebab waktu itu mereka tidak yakin sedikit pun bahwa hal itu memang sebenarnya diperintahkan Allah.",
      "text_translation": "”Apa yang menyebabkan kamu masuk ke dalam (neraka) Saqar?”",
      "text": "مَا سَلَكَكُمْ فِيْ سَقَرَ ",
      "text_translation_en": "\"What has brought you into hell-fire?\"",
      "juz_number": 29
    },
    "43": {
      "text_tafsir_en": "This verse explains that the right is in a heavenly room full of pleasure, while the sinful are wandering in the punishment of hell. However, they could ask each other questions, \"Why were you thrown into hell?\" They answered honestly and frankly that they did not perform prayers above the former world, in contrast to the believers who continued to perform prayers. Because at that time they were not convinced in the slightest that it was actually ordered by God.",
      "text_tafsir": "Ayat ini menjelaskan bahwa golongan kanan berada dalam kamar surga yang penuh kenikmatan, sementara golongan yang berdosa bergelimang dalam azab neraka. Namun demikian, mereka saling dapat tanya bertanya, \"Kenapa engkau sampai dimasukkan ke dalam neraka itu?\"\n\nMereka menjawab dengan jujur dan terus terang bahwa mereka tidak mengerjakan salat di atas dunia dahulu, berbeda dengan orang-orang mukmin yang tetap melaksanakan salat. Sebab waktu itu mereka tidak yakin sedikit pun bahwa hal itu memang sebenarnya diperintahkan Allah.",
      "text_translation": "Mereka menjawab, “Dahulu kami tidak termasuk orang-orang yang me-laksanakan salat, ",
      "text": "قَالُوْا لَمْ نَكُ مِنَ الْمُصَلِّيْنَۙ",
      "text_translation_en": "They will answer: \"We were not among those who prayed;",
      "juz_number": 29
    },
    "44": {
      "text_tafsir_en": "This verse explains that they are not included in the group that is always doing good to the poor and needy. Though they can do so because of the excess of the blessings and sustenance of God that they get. They do not want to alleviate the difficulties of the poor with alms that they should spend.",
      "text_tafsir": "Ayat ini menjelaskan bahwa mereka tidak termasuk golongan yang senantiasa berbuat baik kepada kaum fakir miskin dan duafa. Padahal mereka dapat berbuat demikian karena berlebihnya nikmat dan rezeki Allah yang mereka peroleh. Mereka tidak mau meringankan kesulitan fakir-miskin dengan sedekah yang seharusnya mereka keluarkan.",
      "text_translation": "dan kami (juga) tidak memberi makan orang miskin, ",
      "text": "وَلَمْ نَكُ نُطْعِمُ الْمِسْكِيْنَۙ",
      "text_translation_en": "and neither did we feed the needy;",
      "juz_number": 29
    },
    "45": {
      "text_tafsir_en": "This verse explains that they were involved in the actions of the most despised, dissatisfied with Islam and the Prophet Muhammad by accusing him of being a liar or a sorcerer. Regarding the Qur'an they consider it merely magic, poetry, or magic spell. Anyway they got involved in the act of perversion.",
      "text_tafsir": "Ayat ini menjelaskan bahwa mereka ikut terlibat dalam perbuatan orang yang tercela, yang tidak senang kepada Islam dan Nabi Muhammad dengan menuduh beliau pendusta atau tukang sihir yang gila. Mengenai Al-Qur'an mereka menganggapnya hanyalah sihir, syair, atau mantra untuk tenung. Pokoknya mereka terlibat dalam perbuatan kebatilan.",
      "text_translation": "bahkan kami biasa berbincang (untuk tujuan yang batil), bersama orang-orang yang membicarakannya, ",
      "text": "وَكُنَّا نَخُوْضُ مَعَ الْخَاۤىِٕضِيْنَۙ",
      "text_translation_en": "and we were wont to indulge in sinning together with all [the others] who indulged in it;",
      "juz_number": 29
    },
    "46": {
      "text_tafsir_en": "This verse speaks of their subsequent confession that they deny the day after. This means that they deny the existence of hisab and the vengeance of all human acts, until they come to their conviction, that is, death. They affirm that they have seen with their own eyes that all will be returned to God in the hereafter. So it is no use for them intercession from those who intercede. It means that one has the character as mentioned in the above verse (do not perform prayer, do not care for the poor of the poor, engage in acts of dishonor, deny the coming of the hereafter) any intercession (help) save them from the torment of hell fire. Because intercession is only useful to those who are entitled to it.",
      "text_tafsir": "Ayat ini mengutarakan pengakuan mereka selanjutnya bahwa mereka mendustakan hari kemudian. Artinya mereka mendustakan adanya hari hisab dan pembalasan atas segala perbuatan manusia, sampai datang kepada mereka keyakinan, yakni mati. Tegasnya mereka yakin dan melihat dengan mata kepala sendiri bahwa semuanya akan kembali kepada Allah di negeri akhirat.\n\nMaka tidak berguna lagi bagi mereka syafaat dari orang-orang yang memberi syafaat. Artinya kalau seseorang telah memiliki watak-watak seperti yang disebutkan dalam ayat di atas (tidak mengerjakan salat, tidak mau menghiraukan nafkah fakir-miskin, terlibat dalam perbuatan orang yang senang mencela, mendustakan kedatangan hari akhirat) syafaat (pertolongan) apa pun tidak berguna untuk menyelamatkan mereka dari siksaan api neraka. Sebab syafaat hanyalah berguna bagi yang berhak menerimanya.",
      "text_translation": "dan kami mendustakan hari pembalasan, ",
      "text": "وَكُنَّا نُكَذِّبُ بِيَوْمِ الدِّيْنِۙ",
      "text_translation_en": "and the Day of Judgment we were wont to call a lie –",
      "juz_number": 29
    },
    "47": {
      "text_tafsir_en": "This verse speaks of their subsequent confession that they deny the day after. This means that they deny the existence of hisab and the vengeance of all human acts, until they come to their conviction, that is, death. They affirm that they have seen with their own eyes that all will be returned to God in the hereafter. So it is no use for them intercession from those who intercede. It means that one has the character as mentioned in the above verse (do not perform prayer, do not care for the poor of the poor, engage in acts of dishonor, deny the coming of the hereafter) any intercession (help) save them from the torment of hell fire. Because intercession is only useful to those who are entitled to it.",
      "text_tafsir": "Ayat ini mengutarakan pengakuan mereka selanjutnya bahwa mereka mendustakan hari kemudian. Artinya mereka mendustakan adanya hari hisab dan pembalasan atas segala perbuatan manusia, sampai datang kepada mereka keyakinan, yakni mati. Tegasnya mereka yakin dan melihat dengan mata kepala sendiri bahwa semuanya akan kembali kepada Allah di negeri akhirat.\n\nMaka tidak berguna lagi bagi mereka syafaat dari orang-orang yang memberi syafaat. Artinya kalau seseorang telah memiliki watak-watak seperti yang disebutkan dalam ayat di atas (tidak mengerjakan salat, tidak mau menghiraukan nafkah fakir-miskin, terlibat dalam perbuatan orang yang senang mencela, mendustakan kedatangan hari akhirat) syafaat (pertolongan) apa pun tidak berguna untuk menyelamatkan mereka dari siksaan api neraka. Sebab syafaat hanyalah berguna bagi yang berhak menerimanya.",
      "text_translation": "sampai datang kepada kami kematian.” ",
      "text": "حَتّٰىٓ اَتٰىنَا الْيَقِيْنُۗ",
      "text_translation_en": "until certainty came upon us [in death].\"",
      "juz_number": 29
    },
    "48": {
      "text_tafsir_en": "This verse speaks of their subsequent confession that they deny the day after. This means that they deny the existence of hisab and the vengeance of all human acts, until they come to their conviction, that is, death. They affirm that they have seen with their own eyes that all will be returned to God in the hereafter. So it is no use for them intercession from those who intercede. It means that one has the character as mentioned in the above verse (do not perform prayer, do not care for the poor of the poor, engage in acts of dishonor, deny the coming of the hereafter) any intercession (help) save them from the torment of hell fire. Because intercession is only useful to those who are entitled to it.",
      "text_tafsir": "Ayat ini mengutarakan pengakuan mereka selanjutnya bahwa mereka mendustakan hari kemudian. Artinya mereka mendustakan adanya hari hisab dan pembalasan atas segala perbuatan manusia, sampai datang kepada mereka keyakinan, yakni mati. Tegasnya mereka yakin dan melihat dengan mata kepala sendiri bahwa semuanya akan kembali kepada Allah di negeri akhirat.\n\nMaka tidak berguna lagi bagi mereka syafaat dari orang-orang yang memberi syafaat. Artinya kalau seseorang telah memiliki watak-watak seperti yang disebutkan dalam ayat di atas (tidak mengerjakan salat, tidak mau menghiraukan nafkah fakir-miskin, terlibat dalam perbuatan orang yang senang mencela, mendustakan kedatangan hari akhirat) syafaat (pertolongan) apa pun tidak berguna untuk menyelamatkan mereka dari siksaan api neraka. Sebab syafaat hanyalah berguna bagi yang berhak menerimanya.",
      "text_translation": "Maka tidak berguna lagi bagi mereka syafaat (pertolongan) dari orang-orang yang memberikan syafaat. ",
      "text": "فَمَا تَنْفَعُهُمْ شَفَاعَةُ الشَّافِعِيْنَۗ",
      "text_translation_en": "And so, of no benefit to them could be the intercession of any that would intercede for them.",
      "juz_number": 29
    },
    "49": {
      "text_tafsir_en": "In this verse, in a mocking tone, God asks, \"Why are the disbelievers turned away from my warning?\" The point is why the Meccans and people like them are against the truth of the Qur'an which has given them so great and terrible warnings? The way of turning away from Allah (from the Qur'an) is of two kinds: first, stubborn and never admit it (deny it); second, abandon the charity of his cause. This is the opinion of Muqatil, one of the saints.",
      "text_tafsir": "Pada ayat ini, dalam nada cercaan, Allah bertanya, \"Mengapa orang-orang kafir itu berpaling dari peringatan-Ku?\" Maksudnya adalah kenapa orang-orang Mekah dan orang-orang seperti mereka menentang kebenaran Al-Qur'an yang telah memberikan peringatan-peringatan begitu hebat dan dahsyat kepada mereka?\n\nCara berpaling dari Allah (dari Al-Qur'an itu) ada dua macam, yaitu: pertama, bersifat keras kepala dan sama sekali tidak mengakuinya (mengingkarinya); kedua, meninggalkan amal perbuatan yang disuruh-Nya. Demikian pendapat Muqatil, salah seorang tabi'in.",
      "text_translation": "Lalu mengapa mereka (orang-orang kafir) berpaling dari peringatan (Allah)?",
      "text": "فَمَا لَهُمْ عَنِ التَّذْكِرَةِ مُعْرِضِيْنَۙ",
      "text_translation_en": "WHAT, THEN, is amiss with them that they turn away from all admonition",
      "juz_number": 29
    },
    "50": {
      "text_tafsir_en": "Then the attitude of the heathen and the infidels was further removed from religious warnings. They are like wild donkeys running away from lions. This means that the Muslims fled from Muhammad or those who disbelieved from Islam, such as donkeys, ran away in pursuit of lions, or fled in fear of being hunted by humans (hunters). This verse also implies that those who should have accepted the call of Islam and taken lessons from the warnings given by God, instead opposed it without any logical reason. Here we compare how a donkey runs in fear without direction. Similarly, people run away from religion for no good reason. The nature of the attempt to abstain from such religious obligations as we see now, has been described in the Qur'an for centuries.",
      "text_tafsir": "Kemudian digambarkan pula sikap orang-orang musyrik dan kafir itu menghindarkan diri dari peringatan agama. Mereka diibaratkan seperti keledai liar yang lari terkejut menjauh dari singa. Artinya mereka orang-orang musyrik itu lari dari Muhammad saw atau mereka yang kafir itu lari dari agama Islam, seperti keledai ketakutan lari dikejar singa, atau lari ketakutan karena diburu manusia (pemburu).\n\nAyat ini mengisyaratkan pula bahwa orang-orang yang seharusnya telah menerima seruan Islam dan mengambil pelajaran dari peringatan-peringatan yang diberikan Allah, malah justru menentangnya tanpa sebab-sebab yang logis. Di sini pula kita perbandingkan bagaimana seekor keledai lari ketakutan tanpa arah. Demikian pula manusia lari dari agama tanpa alasan yang tepat. Sifat berusaha menghindarkan diri dari kewajiban-kewajiban agama seperti itu kita lihat sekarang, memang sejak dari dulu telah digambarkan oleh Al-Qur'an.",
      "text_translation": "seakan-akan mereka keledai liar yang lari terkejut,",
      "text": "كَاَنَّهُمْ حُمُرٌ مُّسْتَنْفِرَةٌۙ",
      "text_translation_en": "as though they were terrified asses",
      "juz_number": 29
    },
    "51": {
      "text_tafsir_en": "Then the attitude of the heathen and the infidels was further removed from religious warnings. They are like wild donkeys running away from lions. This means that the Muslims fled from Muhammad or those who disbelieved from Islam, such as donkeys, ran away in pursuit of lions, or fled in fear of being hunted by humans (hunters). This verse also implies that those who should have accepted the call of Islam and taken lessons from the warnings given by God, instead opposed it without any logical reason. Here we compare how a donkey runs in fear without direction. Similarly, people run away from religion for no good reason. The nature of the attempt to abstain from such religious obligations as we see now, has been described in the Qur'an for centuries.",
      "text_tafsir": "Kemudian digambarkan pula sikap orang-orang musyrik dan kafir itu menghindarkan diri dari peringatan agama. Mereka diibaratkan seperti keledai liar yang lari terkejut menjauh dari singa. Artinya mereka orang-orang musyrik itu lari dari Muhammad saw atau mereka yang kafir itu lari dari agama Islam, seperti keledai ketakutan lari dikejar singa, atau lari ketakutan karena diburu manusia (pemburu).\n\nAyat ini mengisyaratkan pula bahwa orang-orang yang seharusnya telah menerima seruan Islam dan mengambil pelajaran dari peringatan-peringatan yang diberikan Allah, malah justru menentangnya tanpa sebab-sebab yang logis. Di sini pula kita perbandingkan bagaimana seekor keledai lari ketakutan tanpa arah. Demikian pula manusia lari dari agama tanpa alasan yang tepat. Sifat berusaha menghindarkan diri dari kewajiban-kewajiban agama seperti itu kita lihat sekarang, memang sejak dari dulu telah digambarkan oleh Al-Qur'an.",
      "text_translation": "lari dari singa. ",
      "text": "فَرَّتْ مِنْ قَسْوَرَةٍۗ",
      "text_translation_en": "fleeing from a lion?",
      "juz_number": 29
    },
    "52": {
      "text_tafsir_en": "In this verse, God cites examples of their stubborn behavior that is unacceptable or heartbreaking. Each of them wanted to give him the pages of the open book (the book). Each of them wanted a revelation revealed just as the Prophet Muhammad had received. Plus the book is quite special to them, with open sheets coming down from the sky. Interpreters narrate that a group of Quraysh came to the Messenger and said, \"It is a good idea that each of our leaders has a book in the open sheet that came down from Allah. In that book we can read the statement that says you, Muhammad, It is also the sheet that asks us to believe in you and follow your religion. \" From the Qatadah it is evident that the purpose of the above verse is that they desire to be free from all sins without doing any good. It is narrated that Abu Jahal and his entourage consisting of the Quraysh rulers said to the Prophet, \"O Muhammad, we will not believe in you unless you give each of us a book of its own originating from God and it is found in there is an order ordering us to follow your religion. \" The same expression is found in one of the verses of the Qur'an: And we will not believe in your increase until you send us a book for us to read. \"Say (Muhammad),\" My Holy Lord, am I not the only man who has become \"(al-Isra '\/ 17: 93)",
      "text_tafsir": "Dalam ayat ini, Allah menyebutkan contoh sikap mereka yang keras kepala yang tidak dapat diterima akal sehat atau oleh hati yang berperasaan. Masing-masing mereka berkehendak supaya diberikan kepadanya lembaran-lembaran catatan yang terbuka (kitab). Setiap mereka menginginkan pula diturunkan wahyu seperti yang telah diterima Nabi Muhammad. Ditambah lagi kitab itu agak istimewa buat mereka, yakni dengan lembaran-lembaran terbuka yang turun dari langit.\n\nDiriwayatkan oleh ahli-ahli tafsir bahwa serombongan kaum Quraisy datang kepada Rasulullah dan mengatakan, \"Alangkah baiknya kalau setiap pemimpin kami mempunyai kitab dalam lembaran terbuka yang turun dari Allah. Dalam kitab itu dapat kami baca keterangan yang menyebutkan engkau, hai Muhammad, adalah rasul-Nya. Lembaran itu pula yang menyuruh kami mengimani engkau dan mengikuti agama engkau.\"\n\nDari Qatadah diterima keterangan bahwa maksud ayat di atas ialah mereka menghendaki bebas dari segala dosa-dosa tanpa bekerja dan berbuat kebaikan sedikit pun.\n\nDiriwayatkan pula bahwa Abu Jahal bersama rombongannya yang terdiri dari pemuka-pemuka Quraisy mengatakan kepada Nabi, \"Hai Muhammad, kami tidak akan beriman kepada engkau melainkan bila engkau beri masing-masing kami kitab itu alamatnya masing-masing yang berasal dari Tuhan dan terdapat pula di sana suruhan yang memerintahkan kami mengikuti agama engkau.\" Ungkapan demikian juga terdapat dalam salah satu ayat Al-Qur'an:\n\nDan kami tidak akan mempercayai kenaikanmu itu sebelum engkau turunkan kepada kami sebuah kitab untuk kami baca.\" Katakanlah (Muhammad), \"Mahasuci Tuhanku, bukankah aku ini hanya seorang manusia yang menjadi rasul?\" (al-Isra'\/17: 93)",
      "text_translation": "Bahkan setiap orang dari mereka ingin agar diberikan kepadanya lembaran-lembaran (kitab) yang terbuka. ",
      "text": "بَلْ يُرِيْدُ كُلُّ امْرِئٍ مِّنْهُمْ اَنْ يُّؤْتٰى صُحُفًا مُّنَشَّرَةًۙ",
      "text_translation_en": "Yea, everyone of them claims that he [himself] ought to have been given revelations unfolded!",
      "juz_number": 29
    },
    "53": {
      "text_tafsir_en": "With a tone of scorn, God firmly refused that request, because in fact they were not afraid of the hereafter. This means that God will not fulfill their demands. Allah will not send a book from heaven specifically for them. Allah says emphatically that what really makes their souls rude, their morals are evil, their eyesight is blocked, and their hearing is blocked from the truth, is because they do not believe in the hereafter with all its awesomeness. If their requests were granted, of course there were still many other requests that followed, just to show their ill will towards Islam. Because there are enough proofs and proofs of the truth of the Prophet Muhammad for them. Then they asked for the truth of the Prophet Muhammad for them and asked for additional additions that were not worth asking for, requests that were meaningless at all.",
      "text_tafsir": "Dengan nada cemooh, Allah menolak dengan tegas permintaan itu, sebab sebenarnya mereka tidak takut kepada hari akhirat. Artinya Allah tidak akan mengabulkan tuntutan mereka. Allah tidak akan menurunkan kitab dari langit khusus buat mereka.\n\nAllah mengatakan dengan tegas bahwa sesungguhnya yang membuat jiwa mereka kasar, akhlak mereka jahat, penglihatan mereka tertutup, dan pendengaran mereka tersumbat dari kebenaran, adalah karena tidak percaya kepada hari akhirat dengan segala kedahsyatannya.\n\nAndaikata permintaan mereka itu dikabulkan, tentu masih banyak permintaan-permintaan lain menyusul, sekadar menunjukkan iktikad mereka yang tidak baik kepada Islam. Sebab sudah cukup banyak dalil dan bukti-bukti kebenaran Nabi Muhammad untuk mereka. Lalu mereka minta kebenaran Nabi Muhammad buat mereka dan meminta lagi tambahan lain yang tidak pantas diminta, permintaan yang tidak berarti sama sekali.",
      "text_translation": "Tidak! Sebenarnya mereka tidak takut kepada akhirat.",
      "text": "كَلَّاۗ بَلْ لَّا يَخَافُوْنَ الْاٰخِرَةَۗ",
      "text_translation_en": "Nay, but they do not [believe in and, hence, do not] fear the life to come.",
      "juz_number": 29
    },
    "54": {
      "text_tafsir_en": "Further in this verse, God reiterates, \"This is not always the case, for the Qur'an is a warning.\" The Qur'an is not what they claim. The Qur'an is not magic that can be learned, it is a direct warning from Allah, so that no one can escape responsibility for God in the future.",
      "text_tafsir": "Selanjutnya dalam ayat ini, Allah menegaskan lagi, \"Sekali-kali tidak demikian halnya, sesungguhnya Al-Qur'an itu adalah peringatan.\" Al-Qur'an bukan sebagaimana yang mereka tuduhkan. Al-Qur'an bukan sihir yang dapat dipelajari, melainkan peringatan langsung dari Allah, sehingga tiada seorang pun yang dapat melepaskan diri dari pertanggungjawaban kepada Allah pada hari kemudian nanti.",
      "text_translation": "Tidak! Sesungguhnya (Al-Qur'an) itu benar-benar suatu peringatan. ",
      "text": "كَلَّآ اِنَّهٗ تَذْكِرَةٌ ۚ",
      "text_translation_en": "Nay, verily, this is an admonition –",
      "juz_number": 29
    },
    "55": {
      "text_tafsir_en": "Allah says that whoever wants the Qur'an as a guide, he can learn from it. Whoever remembers the Qur'an, never forgets it, and makes it his life guide, then the benefit is to himself. In the Qur'an there is happiness in the world and the hereafter.",
      "text_tafsir": "Allah mengatakan bahwa barang siapa menghendaki Al-Qur'an sebagai petunjuk, niscaya dia mendapatkan pelajaran darinya. Siapa saja yang selalu ingat kepada Al-Qur'an, tidak melupakannya, dan menjadikan sebagai pedoman hidupnya, maka manfaatnya adalah untuk dirinya sendiri. Dalam Al-Qur'an terdapat kebahagiaan dunia dan akhirat.",
      "text_translation": "Maka barangsiapa menghendaki, tentu dia mengambil pelajaran darinya. ",
      "text": "فَمَنْ شَاۤءَ ذَكَرَهٗۗ",
      "text_translation_en": "and whoever wills may take it to heart.",
      "juz_number": 29
    },
    "56": {
      "text_tafsir_en": "This verse states that they will not learn the lessons of the Qur'an unless Allah wills it. Only He has the right to forgive. He emphasized that no one receives the warning and instruction from the Qur'an except Allah desires. No one can do that except by the power given by God. That's how God does His will without interrupting anyone. Therefore, it is only in Allah that man should be afraid, only He is to be feared and He alone is to be feared. He gives forgiveness to his faithful servant. In a hadith it is said: That the Messenger of Allah (may peace be upon him), reciting this verse \"huwa ahlut-takwa wa ahlul-magfirah\" and saying, \"Your Lord said, 'I am the one to be feared, so do not associate with other gods. to me and he never made another God with me, so I have the right to forgive him. \" (History of Ahmad, ad-Darimi, at-Tirmizi, an-Nasa'i, and Ibn Majah of Anas bin Malik)",
      "text_tafsir": "Ayat ini menegaskan bahwa mereka tidak akan mengambil pelajaran dari Al-Qur'an kecuali jika Allah menghendakinya. Hanya Dia yang berhak memberi ampunan.\n\nTegasnya tidak ada yang memperoleh peringatan dan pengajaran dari Al-Qur'an melainkan siapa yang dikehendaki Allah. Tidak seorang pun yang sanggup berbuat demikian kecuali berdasarkan kekuasaan yang diberikan Allah. Begitulah Allah berbuat sekehendak-Nya tanpa terhalang oleh siapa pun. Oleh karena itulah kepada Allah saja manusia patut bertakwa, hanya Dia saja yang harus ditakuti dan Dia saja yang harus ditaati. Dialah memberikan ampunan kepada hamba-Nya yang beriman.\n\nDalam sebuah hadis disebutkan:\n\nBahwasanya Rasulullah saw, membaca ayat ini \"huwa ahlut-takwa wa ahlul-magfirah\" dan bersabda, \"Tuhanmu berfirman, 'Sayalah yang paling patut ditakuti, maka janganlah dijadikan bersama-Ku Tuhan yang lain. Barang siapa yang takwa kepada-Ku dan sekali-kali ia tidak menjadikan bersama-Ku Tuhan yang lain, maka Aku-lah yang berhak untuk mengampuninya.\" (Riwayat Ahmad, ad-Darimi, at-Tirmizi, an-Nasa'i, dan Ibnu Majah dari Anas bin Malik)",
      "text_translation": "Dan mereka tidak akan mengambil pelajaran darinya (Al-Qur'an) kecuali (jika) Allah menghendakinya. Dialah Tuhan yang patut (kita) bertakwa kepada-Nya dan yang berhak memberi ampunan. ",
      "text": "وَمَا يَذْكُرُوْنَ اِلَّآ اَنْ يَّشَاۤءَ اللّٰهُ ۗهُوَ اَهْلُ التَّقْوٰى وَاَهْلُ الْمَغْفِرَةِ ࣖ",
      "text_translation_en": "But they [who do not believe in the life to come] will not take it to heart unless God so wills: [for] He is the Fount of all God-consciousness, and the Fount of all forgiveness.",
      "juz_number": 29
    }
  },
  "name": "المدّثّر",
  "name_translation_en": "The Cloaked One",
  "name_translation": "Orang Yang Berkemul",
  "name_latin": "Al-Muddassir"
}