{
  "number": 75,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 40,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, Allah swears by the Day of Judgment. The point is that God stated firmly that the Day of Judgment must come. Therefore, people should get ready to face it with faith and do righteous deeds, because Judgment Day is a day of vengeance for charity.",
      "text_tafsir": "Dalam ayat ini, Allah bersumpah dengan hari Kiamat. Maksudnya ialah Allah menyatakan dengan tegas bahwa hari Kiamat itu pasti datang. Oleh karena itu, manusia hendaknya bersiap-siap menghadapinya dengan beriman dan mengerjakan amal saleh, karena hari Kiamat merupakan hari pembalasan amal.",
      "text_translation": "Aku bersumpah dengan hari Kiamat,",
      "text": "لَآ اُقْسِمُ بِيَوْمِ الْقِيٰمَةِۙ",
      "text_translation_en": "NAY! I call to witness the Day of Resurrection!",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "God also swears by the soul who regrets himself (an-nafs al-lawwamah) of his past attitude and behavior which is no longer filled with good deeds. An-Nafs al-lawwamah also means the soul who regrets himself for committing a crime, why can't he be stopped? For the sake of the benefits realized why not multiply or multiply it? That is what an-nafs al-lawwamah says and regrets himself. That feeling of regret is always present even though he has worked hard in his efforts to do good deeds. But everything will be taken into account in the future. An-Nafs al-lawwamah also means that the soul cannot be controlled in happy or difficult times. Happy times are wasteful and royal, in times of difficulty regretting their fate and staying away from religion. An-Nafs al-lawwamah is actually the soul of a believer who has not reached a more perfect level. Regret is the fortress of a soul like this because it has passed the life of the world with imperfect goodness. It should be noted here that the relationship between the Day of Resurrection and the an-nafs of al-lawwamah, which God used to swear in the beginning of this surah. The Day of Resurrection will reveal the soul of a person, whether he has happiness or an accident. So the soul or an-nafs of al-law may be the happy or the wretched. On the other hand, God purposely refers to the soul that regrets it because of the great question of the soul from the point of view of the Qur'an. The letter \"la\" found in verses 1 and 2 above is \"la zaidah\" which reinforces the meaning of the word after it, namely the Day of Resurrection and the an-nafs of al-law. God himself answered His oath even though the text of the verse is not mentioned. So after swearing on the Day of Resurrection and the an-nafs of al-law, Allah declares, \"Surely ye shall be raised up, and shall be asked of you.\" This meaning is known from the next verse.",
      "text_tafsir": "Allah juga bersumpah dengan jiwa yang amat menyesali dirinya sendiri (an-nafs al-lawwamah) terhadap sikap dan tingkah lakunya pada masa lalu yang tidak sempat lagi diisi dengan perbuatan baik. An-Nafs al-lawwamah juga berarti jiwa yang menyesali dirinya karena berbuat kejahatan, kenapa masih saja tidak sanggup dihentikan? Pada kebaikan yang disadari manfaatnya kenapa tidak diperbanyak atau dilipatgandakan saja? Begitulah an-nafs al-lawwamah berkata dan menyesali dirinya sendiri.\n\nPerasaan menyesal itu senantiasa ada walaupun ia sudah berusaha keras dengan segenap upaya untuk mengerjakan amal saleh. Padahal semuanya pasti akan diperhitungkan kelak. An-Nafs al-lawwamah juga berarti jiwa yang tidak bisa dikendalikan pada waktu senang maupun susah. Waktu senang bersikap boros dan royal, sedang di masa susah menyesali nasibnya dan menjauhi agama.\n\nAn-Nafs al-lawwamah sebenarnya adalah jiwa seorang mukmin yang belum mencapai tingkat yang lebih sempurna. Penyesalan adalah benteng utama dari jiwa seperti ini karena telah melewati hidup di atas dunia dengan kebaikan yang tidak sempurna.\n\nPerlu dijelaskan di sini hubungan antara hari Kiamat dengan an-nafs al-lawwamah, yang sama-sama digunakan Allah untuk bersumpah dalam awal surah ini. Hari Kiamat itu kelak akan membeberkan tentang jiwa seseorang, apakah ia memperoleh kebahagiaan atau kecelakaan. Maka jiwa atau an-nafs al-lawwamah boleh jadi termasuk golongan yang bahagia atau termasuk golongan yang celaka. Dari segi lain, Allah sengaja menyebutkan jiwa yang menyesali dirinya ini karena begitu besarnya persoalan jiwa dari sudut pandangan Al-Qur'an.\n\nHuruf \"la\" yang terdapat pada ayat 1 dan 2 di atas adalah \"la zaidah\" yang menguatkan arti perkataan sesudahnya, yaitu adanya hari Kiamat dan an-nafs al-lawwamah.\n\nAllah sendiri menjawab sumpah-Nya walaupun dalam teks ayat tidak disebutkan. Jadi setelah bersumpah dengan hari Kiamat dan an-nafs al-lawwamah, Allah menegaskan, \"Sungguh kamu akan dibangkitkan dan akan dimintai pertanggungjawabanmu.\" Pengertian ini diketahui dari ayat berikutnya.",
      "text_translation": "dan aku bersumpah demi jiwa yang selalu menyesali (dirinya sendiri).",
      "text": "وَلَآ اُقْسِمُ بِالنَّفْسِ اللَّوَّامَةِ ",
      "text_translation_en": "But nay! I call to witness the accusing voice of man's own conscience!",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "Does man think that God will not reassemble his bones? Does man think that his broken bones in the tomb, after being scattered in separate places, cannot be re-gathered by God? The verse expressed in the tone of this question implies that people think about the issue of death and the day of the resurrection seriously.",
      "text_tafsir": "Apakah manusia mengira bahwa Allah tidak akan mengumpulkan kembali tulang-belulangnya? Apakah manusia mengira bahwa tulangnya yang telah hancur di dalam kubur, setelah berserakan di tempat yang terpisah-pisah tidak dapat dikumpulkan Allah kembali? Ayat yang diungkapkan dengan nada pertanyaan ini mengandung makna agar manusia memikirkan persoalan mati dan adanya hari kebangkitan itu secara serius.",
      "text_translation": "Apakah manusia mengira bahwa Kami tidak akan mengumpulkan (kembali) tulang-belulangnya?",
      "text": "اَيَحْسَبُ الْاِنْسَانُ اَلَّنْ نَّجْمَعَ عِظَامَهٗ ۗ",
      "text_translation_en": "Does man think that We cannot [resurrect him and] bring his bones together again?",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "It is narrated that verses 3 and 4 were revealed because of two persons named 'Adiyy bin Abi Rabi'ah along with Akhnasy bin Syuraiq. 'Adiyy had met the Messenger by asking, \"Muhammad, please tell me when the Day of Judgment will come and what will happen to mankind at that time?\" The Messenger of Allah (may peace be upon him) recounts his existence. 'Adiyy replied, \"By Allah, if I saw with my own eyes that day, I would not justify your words, nor do I believe in you and on the Day of Judgment. human bones? \" Then come down to verse 4 which confirms the power of God in answer to the questions of 'Adiyy bin Abi Rabi'ah and those who act like him. To dispel such doubts, God affirmed that He has the power to rearrange (re) the fingers of man perfectly. Even God is able to gather and reestablish the broken parts of the body even though the smallest part is like so many fingers and limbs. Even though God does not have the perfect knowledge and power, it is impossible for God to reorganize it. In short as the bones and fingers are perfectly arranged, God is able to restore them as they were.",
      "text_tafsir": "Diriwayatkan bahwa ayat ke 3 dan ke 4 ini diturunkan karena ulah dua orang yang bernama 'Adiyy bin Abi Rabi'ah bersama Akhnasy bin Syuraiq. 'Adiyy pernah menjumpai Rasulullah dengan bertanya, \"Hai Muhammad, tolong ceritakan kepadaku kapan datang hari Kiamat dan bagaimana keadaan manusia pada waktu itu?\" Rasulullah saw menceritakan apa adanya. 'Adiyy menjawab pula, \"Demi Allah, andaikata aku melihat dengan mata kepalaku sendiri akan hari itu, aku juga tidak akan membenarkan ucapanmu itu dan aku juga tidak percaya kepadamu dan kepada hari Kiamat itu. Apakah mungkin hai Muhammad, Allah sanggup mengumpulkan kembali tulang-belulang manusia?\" Kemudian turunlah ayat ke 4 di atas yang menegaskan kekuasaan Allah sebagai jawaban terhadap pertanyaan 'Adiyy bin Abi Rabi'ah dan orang-orang yang bersikap seperti dia.\n\nUntuk menghilangkan keragu-raguan itu, Allah menegaskan sebenarnya Dia berkuasa menyusun (kembali) jari-jemari manusia dengan sempurna. Bahkan Allah sanggup mengumpulkan dan menyusun kembali bagian-bagian tubuh yang hancur sekalipun itu adalah bagian terkecil seperti jari-jemari yang begitu banyak ruas dan bukunya. Andaikata Allah tidak mempunyai ilmu pengetahuan dan kekuasaan yang sempurna, tentu tidak mungkin Allah bisa menyusunnya kembali. Ringkasnya sebagaimana tulang-belulang dan jari-jemari itu tersusun dengan sempurna, maka Allah sanggup mengembalikannya lagi seperti semula.",
      "text_translation": "(Bahkan) Kami mampu menyusun (kembali) jari-jemarinya dengan sempurna. ",
      "text": "بَلٰى قَادِرِيْنَ عَلٰٓى اَنْ نُّسَوِّيَ بَنَانَهٗ ",
      "text_translation_en": "Yea indeed, We are able to make whole his very finger-tips!",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "In this verse it is pointed out that the human being with the development of his mind realizes that God is capable of doing so, but the will of his desires influences his mind. Even that man wants to do evil continually. There is no man who does not know the power of his Lord, to revive and regulate the bones of the dead. However, they still want to intervene in various acts of wickedness, and then postpone repentance or refrain from it. Surely such a man, according to Sa'id bin Jubair, likes to quickly follow his will and do whatever he wants. Lust always teases her, \"I'll just repent; I'll do good later.\" Unfortunately he did not have the time to repent and do good, the death angel had already taken his life. But at the time, he was busy doing evil things. What this verse may mean is that one always imagines how rewarding it would be to have this and that, to have a luxury car and home or office, and so on, but forgetting death, forgetting the day of resurrection, the day of checked all his work. Other words mean to tend to the wrong, or to deviate from the truth. People like this want to live free like animals. He does not want to be hindered in doing anything by reprimands or religious prohibitions that restrict his desire.",
      "text_tafsir": "Dalam ayat ini ditegaskan bahwa sebenarnya manusia dengan perkembangan pikirannya menyadari bahwa Allah sanggup berbuat begitu, namun kehendak nafsu mempengaruhi pikirannya. Bahkan manusia itu hendak berbuat maksiat terus-menerus. Sesungguhnya tidak ada manusia yang tidak mengenal kekuasaan Tuhannya, untuk menghidupkan dan menyusun tulang-belulang orang yang sudah mati. Akan tetapi, mereka masih ingin bergelimang dengan berbagai perbuatan maksiat, kemudian menunda-nunda tobat atau menghindarkan diri daripadanya.\n\nSesungguhnya manusia yang seperti ini, menurut Sa'id bin Jubair, suka cepat-cepat memperturutkan kehendak hati dan berbuat apa saja yang diinginkan. Nafsu selalu menggodanya, \"Nanti sajalah aku bertobat; nanti sajalah aku mengerjakan kebaikan.\" Celakanya dia belum sempat tobat dan beramal baik, malaikat maut sudah lebih dahulu mencabut nyawanya. Padahal pada saat itu, ia sedang asyik dalam perbuatan maksiat.\n\nBoleh jadi juga maksud ayat ini adalah bahwa seseorang selalu berangan-angan tentang betapa nikmatnya kalau ia mendapat ini dan itu, mendapat mobil dan rumah mewah atau jabatan yang empuk, dan seterusnya, namun lupa mengingat mati, lupa dengan akan datangnya hari kebangkitan, hari saat diperiksa segala pekerjaannya.\n\nKata-kata liyafjura berarti cenderung kepada yang batil, atau suka menyimpang dari kebenaran. Orang seperti ini ingin hidup bebas seperti binatang. Ia tidak mau dihalangi untuk mengerjakan apa saja dengan teguran akal sehat atau larangan agama yang mengekang keinginannya.",
      "text_translation": "Tetapi manusia hendak membuat maksiat terus-menerus. ",
      "text": "بَلْ يُرِيْدُ الْاِنْسَانُ لِيَفْجُرَ اَمَامَهٗۚ",
      "text_translation_en": "None the less man chooses to deny what lies ahead of him,",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "Next, Allah described the attitude of the stubborn person who asked, \"When is the Day of Judgment?\" This question arises as a sign that the doomsday is too far in the mind of the questioner and shows distrust of its occurrence. This has to do with the previous verse, which is: \"Why does he keep wanting to do evil?\" Because they deny the existence of the Day of Resurrection, so they do not feel the need to think of all the consequences of the crimes committed. In another verse, Allah says: Away! Very far (from the truth) what is threatened to you, (that life) is nothing but our life in this world, (there) we die and live and will not be resurrected (again). (Al-Mu'minun \/ 23: 36-37) If concluded, there are two reasons for human distrust of the Day of Judgment, namely: 1. Because of doubt about the power of God. For example the mind that holds that parts of the body that have been destroyed, scattered, and mixed with the ground, in the east and in the west, could it be possible to be reorganized and revived? How can such a human body return to its original state? As verses 3 and 4 read: Do humans think that We will not gather (return) their bones? (In fact) We are able to rearrange (the fingers) perfectly. (al-Qiyamah \/ 75: 3-4) 1. Because of the continuing desire to enjoy worldly pleasures, and the coming of Doomsday (the day of gathering and reckoning) of course decides all forms of pleasure, as mentioned in verse 5: But humans want to make immoral continual. (al-Qiyamah \/ 75: 5)",
      "text_tafsir": "Selanjutnya, Allah menggambarkan sikap orang keras kepala yang bertanya, \"Bilakah hari Kiamat itu?\" Pertanyaan ini muncul sebagai tanda terlalu jauhnya jangkauan hari Kiamat itu dalam pikiran si penanya dan menunjukkan ketidakpercayaan akan terjadinya. Hal ini ada hubungannya dengan ayat sebelumnya, yakni: \"Kenapa ia terus-menerus ingin mengerjakan kejahatan?\" Karena mereka mengingkari adanya hari kebangkitan, sehingga tidak merasa perlu memikirkan segala akibat dari kejahatan yang dilakukan. Dalam ayat lain, Allah berfirman:\n\nJauh! Jauh sekali (dari kebenaran) apa yang diancamkan kepada kamu, (kehidupan itu) tidak lain hanyalah kehidupan kita di dunia ini, (di sanalah) kita mati dan hidup dan tidak akan dibangkitkan (lagi). (al-Mu'minun\/23: 36-37)\n\nKalau disimpulkan, ada dua sebab ketidakpercayaan manusia kepada hari Kiamat, yaitu:\n\n1.Karena ragu-ragu dengan kekuasaan Allah. Misalnya pikiran yang berpendapat bahwa bagian tubuh yang sudah hancur, berserakan, dan bercampur aduk dengan tanah, di timur maupun di barat, mungkinkah dapat disusun dan dihidupkan kembali? Bagaimana bisa tubuh manusia yang demikian kembali kepada keadaan semula?\n\nSeperti bunyi ayat 3 dan 4:\n\nApakah manusia mengira bahwa Kami tidak akan mengumpulkan (kembali) tulang-belulangnya? (Bahkan) Kami mampu menyusun (kembali) jari-jemarinya dengan sempurna. (al-Qiyamah\/75: 3-4)\n\n1.Karena keinginan yang terus-menerus untuk menikmati kesenangan duniawi, dan kedatangan Kiamat (hari berkumpul dan berhisab) tentu saja memutuskan segala bentuk kesenangan itu, seperti disebutkan dalam ayat ke-5:\n\nTetapi manusia hendak membuat maksiat terus-menerus. (al-Qiyamah\/75: 5)",
      "text_translation": "Dia bertanya, “Kapankah hari Kiamat itu?”",
      "text": "يَسْـَٔلُ اَيَّانَ يَوْمُ الْقِيٰمَةِۗ",
      "text_translation_en": "asking [derisively], \"When is that Resurrection Day to be?\"",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "In these verses, Allah explains the three signs of the coming of Judgment, namely: 1. If the eyes are wide (because of fear). At that time, the eye was unable to witness something very powerful. In another verse the same meaning is stated, namely: They came in a hurry (fulfilling the call) by raising their heads, while their eyes did not flicker and their hearts were blank. (Ibrahim \/ 14: 43) 1.If the moon has been permanently eclipsed, it is not like the lunar eclipse of the moon. 1. The sun and month are collected. This means that the sun and moon meet each other, both rising and setting in the same place, causing the dark atmosphere of the universe. Even though such a situation has never happened, each is in a predetermined position. Allah says: It is not possible for the sun to chase the moon and the night cannot precede the day. Each circulates on the path. (Yasin \/ 36: 40) It was then that disbelievers realized how God's promise came true. Everyone is trying to save themselves. According to scientific studies, doomsday scenarios vary, some are in the form of large scenarios (Grand Scenarios), there are also \"local\" scenarios, although the impact can be universal and affect the entire universe. In the Grand Scenario the system of the universe undergoes a system change that worsens even drastically so that the universe as a system collapses and the end comes. The second type of scenario is \"local\", meaning that it only occurs in one of the galaxies or solar system. It is likely that this event took place in the Milky Way galaxy or even in our solar system, where humans are. One possible scenario is that black holes lead to our solar system. If members of our solar system, including planet Earth, are subjected to black holes, which means that gravity will be sucked very strongly, then everything on the surface of the earth including humans will be lifted up then legs will be released and eventually the human body will be scattered up to six fifty four parts. Meanwhile, at the same time, the sun will be sucked up, including its nuclear energy until it runs out, while the planets of all members of our solar system and the sun will also be sucked together, so they will come together because of a very strong gravitational straw. It is clear that the light of the moon and of course the source of light which is the sun will disappear. Then our entire solar system will dissolve so that it disrupts the balance of our galaxy, and as a result of its universality, the balance of the Milky Way will have an impact on the balance of the position and energy of the universe, so that doomsday is only a matter of time.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menerangkan tiga hal tanda kedatangan hari Kiamat, yakni:\n\n1.Apabila mata terbelalak (karena ketakutan). Pada waktu itu, mata tidak sanggup menyaksikan sesuatu hal yang sangat dahsyat. Dalam ayat lain tercantum makna yang sama, yakni:\n\nMereka datang tergesa-gesa (memenuhi panggilan) dengan mengangkat kepalanya, sedang mata mereka tidak berkedip-kedip dan hati mereka kosong. (Ibrahim\/14: 43)\n\n1.Apabila bulan telah hilang cahayanya untuk selama-lamanya, bukan seperti keadaan waktu gerhana bulan yang hanya berlangsung sebentar saja.\n\n1.Matahari dan bulan dikumpulkan. Artinya matahari dan bulan saling bertemu, keduanya terbit dan terbenam pada tempat yang sama, menyebabkan gelapnya suasana alam semesta ini. Padahal keadaan begitu tidak pernah terjadi, masing-masing berada dalam posisi yang telah ditentukan. Allah berfirman:\n\nTidaklah mungkin bagi matahari mengejar bulan dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya. (Yasin\/36: 40)\n\nPada saat itulah manusia yang kafir menyadari betapa janji Allah menjadi kenyataan. Semua orang berusaha hendak menyelamatkan diri.\n\nMenurut kajian ilmiah, skenario kiamat ada bermacam-macam, ada yang berupa skenario besar (Grand Scenario), ada pula skenario \"lokal\" walaupun dampaknya bisa universal dan berpengaruh kepada seluruh alam semesta. Pada Grand Scenario sistem alam semesta mengalami suatu perubahan sistem yang memburuk bahkan bisa secara drastis sehingga alam semesta sebagai sistem menjadi ambruk dan kiamat datang. \n\nSkenario jenis kedua bersifat \"lokal\", artinya hanya terjadi di salah satu galaksi atau tata surya. Besar kemungkinan bahwa kejadian ini berlangsung di galaksi Bima Sakti atau bahkan di tata surya kita, di mana manusia berada. Salah satu skenario yang mungkin adalah mengarahnya lubang hitam (black hole) ke tata surya kita. Bila anggota tata surya kita, termasuk planet bumi, dikenai lubang hitam, yang berarti akan tersedot gravitasi yang sangat kuat, maka semua yang ada di permukaan bumi termasuk manusia akan terangkat kemudian kaki-kakinya akan terlepas dan akhirnya tubuh manusia akan tercerai-berai hingga enam puluh empat bagian. Sedangkan pada saat yang sama, matahari akan tersedot, termasuk energi nuklirnya hingga habis, sedangkan planet seluruh anggota tata surya kita dan matahari juga akan bersama-sama tersedot, hingga akan menyatu karena sedotan gravitasi yang sangat kuat. Jelaslah bahwa cahaya bulan dan tentu saja cahaya sumbernya yaitu matahari akan menghilang. Maka seluruh tata surya kita akan lebur sehingga mengganggu keseimbangan galaksi kita, dan akibat universalnya, keseimbangan Bima Sakti ini akan berdampak pada keseimbangan posisi dan energi alam semesta, sehingga kiamat hanyalah soal waktu.",
      "text_translation": "Maka apabila mata terbelalak (ketakutan), ",
      "text": "فَاِذَا بَرِقَ الْبَصَرُۙ",
      "text_translation_en": "But [on that Day,] when the eyesight is by fear confounded,",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "In these verses, Allah explains the three signs of the coming of Judgment, namely: 1. If the eyes are wide (because of fear). At that time, the eye was unable to witness something very powerful. In another verse the same meaning is stated, namely: They came in a hurry (fulfilling the call) by raising their heads, while their eyes did not flicker and their hearts were blank. (Ibrahim \/ 14: 43) 1.If the moon has been permanently eclipsed, it is not like the lunar eclipse of the moon. 1. The sun and month are collected. This means that the sun and moon meet each other, both rising and setting in the same place, causing the dark atmosphere of the universe. Even though such a situation has never happened, each is in a predetermined position. Allah says: It is not possible for the sun to chase the moon and the night cannot precede the day. Each circulates on the path. (Yasin \/ 36: 40) It was then that disbelievers realized how God's promise came true. Everyone is trying to save themselves. According to scientific studies, doomsday scenarios vary, some are in the form of large scenarios (Grand Scenarios), there are also \"local\" scenarios, although the impact can be universal and affect the entire universe. In the Grand Scenario the system of the universe undergoes a system change that worsens even drastically so that the universe as a system collapses and the end comes. The second type of scenario is \"local\", meaning that it only occurs in one of the galaxies or solar system. It is likely that this event took place in the Milky Way galaxy or even in our solar system, where humans are. One possible scenario is that black holes lead to our solar system. If members of our solar system, including planet Earth, are subjected to black holes, which means that gravity will be sucked very strongly, then everything on the surface of the earth including humans will be lifted up then legs will be released and eventually the human body will be scattered up to six fifty four parts. Meanwhile, at the same time, the sun will be sucked up, including its nuclear energy until it runs out, while the planets of all members of our solar system and the sun will also be sucked together, so they will come together because of a very strong gravitational straw. It is clear that the light of the moon and of course the source of light which is the sun will disappear. Then our entire solar system will dissolve so that it disrupts the balance of our galaxy, and as a result of its universality, the balance of the Milky Way will have an impact on the balance of the position and energy of the universe, so that doomsday is only a matter of time.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menerangkan tiga hal tanda kedatangan hari Kiamat, yakni:\n\n1.Apabila mata terbelalak (karena ketakutan). Pada waktu itu, mata tidak sanggup menyaksikan sesuatu hal yang sangat dahsyat. Dalam ayat lain tercantum makna yang sama, yakni:\n\nMereka datang tergesa-gesa (memenuhi panggilan) dengan mengangkat kepalanya, sedang mata mereka tidak berkedip-kedip dan hati mereka kosong. (Ibrahim\/14: 43)\n\n1.Apabila bulan telah hilang cahayanya untuk selama-lamanya, bukan seperti keadaan waktu gerhana bulan yang hanya berlangsung sebentar saja.\n\n1.Matahari dan bulan dikumpulkan. Artinya matahari dan bulan saling bertemu, keduanya terbit dan terbenam pada tempat yang sama, menyebabkan gelapnya suasana alam semesta ini. Padahal keadaan begitu tidak pernah terjadi, masing-masing berada dalam posisi yang telah ditentukan. Allah berfirman:\n\nTidaklah mungkin bagi matahari mengejar bulan dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya. (Yasin\/36: 40)\n\nPada saat itulah manusia yang kafir menyadari betapa janji Allah menjadi kenyataan. Semua orang berusaha hendak menyelamatkan diri.\n\nMenurut kajian ilmiah, skenario kiamat ada bermacam-macam, ada yang berupa skenario besar (Grand Scenario), ada pula skenario \"lokal\" walaupun dampaknya bisa universal dan berpengaruh kepada seluruh alam semesta. Pada Grand Scenario sistem alam semesta mengalami suatu perubahan sistem yang memburuk bahkan bisa secara drastis sehingga alam semesta sebagai sistem menjadi ambruk dan kiamat datang. \n\nSkenario jenis kedua bersifat \"lokal\", artinya hanya terjadi di salah satu galaksi atau tata surya. Besar kemungkinan bahwa kejadian ini berlangsung di galaksi Bima Sakti atau bahkan di tata surya kita, di mana manusia berada. Salah satu skenario yang mungkin adalah mengarahnya lubang hitam (black hole) ke tata surya kita. Bila anggota tata surya kita, termasuk planet bumi, dikenai lubang hitam, yang berarti akan tersedot gravitasi yang sangat kuat, maka semua yang ada di permukaan bumi termasuk manusia akan terangkat kemudian kaki-kakinya akan terlepas dan akhirnya tubuh manusia akan tercerai-berai hingga enam puluh empat bagian. Sedangkan pada saat yang sama, matahari akan tersedot, termasuk energi nuklirnya hingga habis, sedangkan planet seluruh anggota tata surya kita dan matahari juga akan bersama-sama tersedot, hingga akan menyatu karena sedotan gravitasi yang sangat kuat. Jelaslah bahwa cahaya bulan dan tentu saja cahaya sumbernya yaitu matahari akan menghilang. Maka seluruh tata surya kita akan lebur sehingga mengganggu keseimbangan galaksi kita, dan akibat universalnya, keseimbangan Bima Sakti ini akan berdampak pada keseimbangan posisi dan energi alam semesta, sehingga kiamat hanyalah soal waktu.",
      "text_translation": "dan bulan pun telah hilang cahayanya,",
      "text": "وَخَسَفَ الْقَمَرُۙ",
      "text_translation_en": "and the moon is darkened,",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "In these verses, Allah explains the three signs of the coming of Judgment, namely: 1. If the eyes are wide (because of fear). At that time, the eye was unable to witness something very powerful. In another verse the same meaning is stated, namely: They came in a hurry (fulfilling the call) by raising their heads, while their eyes did not flicker and their hearts were blank. (Ibrahim \/ 14: 43) 1.If the moon has been permanently eclipsed, it is not like the lunar eclipse of the moon. 1. The sun and month are collected. This means that the sun and moon meet each other, both rising and setting in the same place, causing the dark atmosphere of the universe. Even though such a situation has never happened, each is in a predetermined position. Allah says: It is not possible for the sun to chase the moon and the night cannot precede the day. Each circulates on the path. (Yasin \/ 36: 40) It was then that disbelievers realized how God's promise came true. Everyone is trying to save themselves. According to scientific studies, doomsday scenarios vary, some are in the form of large scenarios (Grand Scenarios), there are also \"local\" scenarios, although the impact can be universal and affect the entire universe. In the Grand Scenario the system of the universe undergoes a system change that worsens even drastically so that the universe as a system collapses and the end comes. The second type of scenario is \"local\", meaning that it only occurs in one of the galaxies or solar system. It is likely that this event took place in the Milky Way galaxy or even in our solar system, where humans are. One possible scenario is that black holes lead to our solar system. If members of our solar system, including planet Earth, are subjected to black holes, which means that gravity will be sucked very strongly, then everything on the surface of the earth including humans will be lifted up then legs will be released and eventually the human body will be scattered up to six fifty four parts. Meanwhile, at the same time, the sun will be sucked up, including its nuclear energy until it runs out, while the planets of all members of our solar system and the sun will also be sucked together, so they will come together because of a very strong gravitational straw. It is clear that the light of the moon and of course the source of light which is the sun will disappear. Then our entire solar system will dissolve so that it disrupts the balance of our galaxy, and as a result of its universality, the balance of the Milky Way will have an impact on the balance of the position and energy of the universe, so that doomsday is only a matter of time.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menerangkan tiga hal tanda kedatangan hari Kiamat, yakni:\n\n1.Apabila mata terbelalak (karena ketakutan). Pada waktu itu, mata tidak sanggup menyaksikan sesuatu hal yang sangat dahsyat. Dalam ayat lain tercantum makna yang sama, yakni:\n\nMereka datang tergesa-gesa (memenuhi panggilan) dengan mengangkat kepalanya, sedang mata mereka tidak berkedip-kedip dan hati mereka kosong. (Ibrahim\/14: 43)\n\n1.Apabila bulan telah hilang cahayanya untuk selama-lamanya, bukan seperti keadaan waktu gerhana bulan yang hanya berlangsung sebentar saja.\n\n1.Matahari dan bulan dikumpulkan. Artinya matahari dan bulan saling bertemu, keduanya terbit dan terbenam pada tempat yang sama, menyebabkan gelapnya suasana alam semesta ini. Padahal keadaan begitu tidak pernah terjadi, masing-masing berada dalam posisi yang telah ditentukan. Allah berfirman:\n\nTidaklah mungkin bagi matahari mengejar bulan dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya. (Yasin\/36: 40)\n\nPada saat itulah manusia yang kafir menyadari betapa janji Allah menjadi kenyataan. Semua orang berusaha hendak menyelamatkan diri.\n\nMenurut kajian ilmiah, skenario kiamat ada bermacam-macam, ada yang berupa skenario besar (Grand Scenario), ada pula skenario \"lokal\" walaupun dampaknya bisa universal dan berpengaruh kepada seluruh alam semesta. Pada Grand Scenario sistem alam semesta mengalami suatu perubahan sistem yang memburuk bahkan bisa secara drastis sehingga alam semesta sebagai sistem menjadi ambruk dan kiamat datang. \n\nSkenario jenis kedua bersifat \"lokal\", artinya hanya terjadi di salah satu galaksi atau tata surya. Besar kemungkinan bahwa kejadian ini berlangsung di galaksi Bima Sakti atau bahkan di tata surya kita, di mana manusia berada. Salah satu skenario yang mungkin adalah mengarahnya lubang hitam (black hole) ke tata surya kita. Bila anggota tata surya kita, termasuk planet bumi, dikenai lubang hitam, yang berarti akan tersedot gravitasi yang sangat kuat, maka semua yang ada di permukaan bumi termasuk manusia akan terangkat kemudian kaki-kakinya akan terlepas dan akhirnya tubuh manusia akan tercerai-berai hingga enam puluh empat bagian. Sedangkan pada saat yang sama, matahari akan tersedot, termasuk energi nuklirnya hingga habis, sedangkan planet seluruh anggota tata surya kita dan matahari juga akan bersama-sama tersedot, hingga akan menyatu karena sedotan gravitasi yang sangat kuat. Jelaslah bahwa cahaya bulan dan tentu saja cahaya sumbernya yaitu matahari akan menghilang. Maka seluruh tata surya kita akan lebur sehingga mengganggu keseimbangan galaksi kita, dan akibat universalnya, keseimbangan Bima Sakti ini akan berdampak pada keseimbangan posisi dan energi alam semesta, sehingga kiamat hanyalah soal waktu.",
      "text_translation": "lalu matahari dan bulan dikumpulkan, ",
      "text": "وَجُمِعَ الشَّمْسُ وَالْقَمَرُۙ",
      "text_translation_en": "and the sun and the moon are brought together",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "God insists that on the Day of Resurrection people say, \"Where is the place to run?\" Each person is trying to find a way to save themselves. Some interpret this verse as \"Where the hell to escape the fire of hell?\" Of course, the people who were meant were the unbelievers, because at that time no one believed the coming of the Day of Judgment as mentioned in some of the Prophet's hadiths. Can those unbelievers save themselves? No!",
      "text_tafsir": "Allah menegaskan bahwa pada hari Kiamat itu manusia berkata, \"Ke manakah tempat lari?\" Masing-masing orang berusaha mencari jalan untuk menyelamatkan diri. Sebagian mengartikan ayat ini dengan \"Ke manakah tempat lari menghindari api neraka?\" Tentulah manusia yang dimaksudkan adalah orang-orang kafir, karena pada saat itu orang-orang mukmin tidak ada yang menyangsikan kedatangan hari Kiamat itu seperti disebutkan dalam beberapa hadis Nabi. Apakah orang-orang kafir itu dapat menyelamatkan diri? Tidak!",
      "text_translation": "pada hari itu manusia berkata, “Ke mana tempat lari?”",
      "text": "يَقُوْلُ الْاِنْسَانُ يَوْمَىِٕذٍ اَيْنَ الْمَفَرُّۚ",
      "text_translation_en": "on that Day will man exclaim \"Whither to flee?\"",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "In this verse it is emphasized that there is no place for protection. There is not one protection that can save them from the torment of God. No fort or hill or weapon can be used. Thus in another verse Allah declares: Obey the call of your Lord before the coming of Allah one day that cannot be denied (by Allah's command). On that day you will find no shelter, nor will you deny (your sins). (Asi-Syura \/ 42: 47)",
      "text_tafsir": "Dalam ayat ini ditegaskan bahwa sekali-kali tidak ada tempat berlindung. Tidak ada satu perlindungan pun yang mungkin menyelamatkan mereka dari siksaan Allah. Tidak ada benteng maupun bukit atau senjata yang dapat digunakan. Demikian dalam ayat lain Allah menegaskan:\n\nPatuhilah seruan Tuhanmu sebelum datang dari Allah suatu hari yang tidak dapat ditolak (atas perintah dari Allah). Pada hari itu kamu tidak memperoleh tempat berlindung dan tidak (pula) dapat mengingkari (dosa-dosamu). (asy-Syura\/42: 47)",
      "text_translation": "Tidak! Tidak ada tempat berlindung!",
      "text": "كَلَّا لَا وَزَرَۗ",
      "text_translation_en": "But nay: no refuge [for thee, O man]!",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "This verse then describes the actual situation and where the people are to be gathered. Only to God is man returning. In a place of misery or in a place of happiness full of happiness. Everything depends on the will of God. He was the sole Ruler of the day. All humans return to God without exception. That's where the last destination of life is. Allah says: And verily unto Allah is the end (of all things). (an-Najm \/ 53: 42)",
      "text_tafsir": "Kemudian dalam ayat ini diterangkan keadaan yang sebenarnya dan ke mana manusia hendak dikumpulkan. Hanya kepada Allah tempat manusia kembali. Di tempat penuh kesengsaraan atau di tempat penuh nikmat penuh kebahagiaan. Semuanya tergantung kepada kehendak Allah. Dia Penguasa Tunggal di hari itu. Semua manusia kembali kepada Allah tanpa kecuali. Ke sanalah tujuan perjalanan hidup yang terakhir. Allah berfirman:\n\nDan sesungguhnya kepada Tuhanmulah kesudahannya (segala sesuatu). (an-Najm\/53: 42)",
      "text_translation": "Hanya kepada Tuhanmu tempat kembali pada hari itu.",
      "text": "اِلٰى رَبِّكَ يَوْمَىِٕذِ ِۨالْمُسْتَقَرُّۗ",
      "text_translation_en": "With thy Sustainer, on that Day, the journey's end will be!",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "This verse explains that on that day the people preached what he had done and what he was neglecting. To humans told when the time has come to reckon and weigh the deeds. All will be clearly explained, which good deeds have been done and which should have been done but could no longer be carried out. Likewise, what should have been done in order to avoid the punishment of Allah and achieve His reward. Nothing escapes the news, small or large works, new or obsolete. Ibn 'Abbas interpreted this verse by explaining that what was told was not just a bad and good deed of someone before he died, but also all his works, thoughts, and habits. Everyone will witness before him all of his manifestations, as stated in other verses: And put a book (charity note), then you will see a sinner fearing what is (written) in it, and they say, \"What woe we, what book is this, there is nothing left, the little and the big but all of them are recorded, \"and they found (all) what they had done. And your Lord has not wronged anyone. (al-Kahf \/ 18: 49) In connection with this, it is also mentioned in the hadith of the Messenger of Allah (PBUH): Seven kinds of acts of a servant who keep the merit flowing for those who have died: people who teach knowledge, people who make streams, people who dig the well, the person who planted the date palm tree, the person who built the mosque, the person who inherited (distributed) the Manuscripts (holy book of the Qur'an), and the person who left the child (offspring) who begged forgiveness for him after he died. (History of Abu Nu'aim and al-Baihaqi from Anas bin Malik)",
      "text_tafsir": "Ayat ini menerangkan bahwa pada hari itu diberitakan kepada manusia apa yang telah dikerjakannya dan apa yang dilalaikannya. Kepada manusia diceritakan ketika telah tiba waktunya menghisab dan menimbang amalannya. Semua akan dibeberkan dengan jelas, mana perbuatan baik yang telah dikerjakan dan mana yang seharusnya dikerjakan tapi tidak sempat lagi dilaksanakan. Demikian pula mana yang semestinya dahulu diperbuat guna menghindarkan diri dari azab Allah dan mencapai pahala-Nya. Tidak ada yang luput dari pemberitaan itu, karya yang kecil maupun yang besar, yang baru maupun yang usang.\n\nIbnu 'Abbas mengartikan ayat ini dengan menjelaskan bahwa yang diceritakan tidak hanya sekadar perbuatan buruk dan baik seseorang menjelang dia meninggal dunia, tetapi juga segala karya, pikiran, dan kebiasaannya. Semua orang akan menyaksikan sendiri di hadapannya segala wujud amaliahnya, sebagaimana disebutkan dalam ayat lain:\n\nDan diletakkanlah kitab (catatan amal), lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata, \"Betapa celaka kami, kitab apakah ini, tidak ada yang tertinggal, yang kecil dan yang besar melainkan tercatat semuanya,\" dan mereka dapati (semua) apa yang telah mereka kerjakan. Dan Tuhanmu tidak menzalimi seorang jua pun. (al-Kahf\/18: 49)\n\nSehubungan dengan hal ini, disebutkan pula dalam hadis Rasulullah saw:\n\nTujuh macam perbuatan seorang hamba yang tetap mengalir pahalanya bagi orang yang sudah wafat: orang yang mengajarkan ilmu, orang yang membuat aliran sungai, orang yang menggali sumur, orang yang menanam pohon kurma, orang yang mendirikan masjid, orang yang mewariskan (menyebarluaskan) mushaf (kitab suci Al-Qur'an), dan orang yang meninggalkan anak (keturunan) yang memohonkan ampunan baginya setelah ia meninggal. (Riwayat Abu Nu'aim dan al-Baihaqi dari Anas bin Malik)",
      "text_translation": "Pada hari itu diberitakan kepada manusia apa yang telah dikerjakannya dan apa yang dilalaikannya.",
      "text": "يُنَبَّؤُا الْاِنْسَانُ يَوْمَىِٕذٍۢ بِمَا قَدَّمَ وَاَخَّرَۗ",
      "text_translation_en": "Man will be apprised, on that Day, of what he has done and what he has left undone:",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "In this verse, Allah explains that man himself is a witness. There is no need for others to tell him because all parts of his body are witnesses of everything he has done, honestly without lying. Those who do evil are tortured and cannot be avoided. Hearing, vision, feet, hands and all members of the body reveal everything they have done. Today we keep their mouths shut; their hands will say to us, and their feet will testify to what they used to do. (Yasin \/ 36: 65) Even though it has been explained in the Qur'an that the Day of Judgment will come and humans will be responsible for their deeds, but humans still want to put forward various reasons to debate God's decision, for following their desires.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa diri manusia itu sendiri menjadi saksi. Tidak perlu orang lain menceritakan kepadanya karena semua bagian tubuhnya menjadi saksi atas segala yang telah dikerjakannya, dengan jujur tanpa berbohong. Siapa yang berbuat jahat diberi siksaan dan tidak bisa dihindari. Pendengaran, penglihatan, kaki, tangan, dan semua anggota tubuh membeberkan segala yang telah dikerjakannya.\n\nPada hari ini Kami tutup mulut mereka; tangan mereka akan berkata kepada Kami dan kaki mereka akan memberi kesaksian terhadap apa yang dahulu mereka kerjakan. (Yasin\/36: 65)\n\nMeskipun telah diterangkan dalam Al-Qur'an akan datangnya hari Kiamat dan manusia mempertanggungjawabkan amalnya, tetapi manusia tetap saja ingin mengajukan berbagai alasan untuk mendebat keputusan Allah, karena mengikuti hawa nafsunya.",
      "text_translation": "Bahkan manusia menjadi saksi atas dirinya sendiri,",
      "text": "بَلِ الْاِنْسَانُ عَلٰى نَفْسِهٖ بَصِيْرَةٌۙ",
      "text_translation_en": "nay, but man shall against himself be an eye-witness,",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "In this verse it is explained that even though man tries to propose various reasons to cover up all his mistakes, and hide all his bad deeds, but all of them will not be useful because his limbs will be witnesses to him. In another verse it says: Read your book, suffice yourself today as a count of yourself. (al-Isra '\/ 17: 14) Today we keep their mouths closed; their hands will say to us, and their feet will testify to what they used to do. (Yasin \/ 36: 65) From the sign of the above verse, we can also learn that the beliefs of the polytheists associating partners with God and worshiping statues or idols, and their unbelief on the Day of Resurrection are false beliefs. Their own little hearts actually don't recognize that. Therefore, all the reasons that they present to reject the truth are actually false reasons. They say something that is against their own conscience.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa biarpun manusia berusaha mengajukan berbagai alasan guna menutupi segala kesalahannya, dan menyembunyikan segala perbuatan jeleknya, namun semua itu tidak akan berguna karena anggota tubuhnya akan menjadi saksi atas dirinya. Dalam ayat lain disebutkan:\n\nBacalah kitabmu, cukuplah dirimu sendiri pada hari ini sebagai penghitung atas dirimu. (al-Isra'\/17: 14)\n\nPada hari ini Kami tutup mulut mereka; tangan mereka akan berkata kepada Kami dan kaki mereka akan memberi kesaksian terhadap apa yang dahulu mereka kerjakan. (Yasin\/36: 65)\n\nDari isyarat ayat di atas dapat pula kita mengambil pelajaran bahwa keyakinan orang musyrik mempersekutukan Allah dan menyembah patung atau berhala, serta ketidakpercayaan mereka pada hari kebangkitan adalah kepercayaan yang salah. Hati kecil mereka sendiri sesungguhnya tidak mengakui yang demikian. Oleh karena itu, segala alasan yang mereka kemukakan guna menolak kebenaran, sebenarnya adalah alasan palsu. Mereka mengucapkan sesuatu yang bertentangan dengan kehendak hati nurani sendiri.",
      "text_translation": "dan meskipun dia mengemukakan alasan-alasannya.",
      "text": "وَّلَوْ اَلْقٰى مَعَاذِيْرَهٗۗ",
      "text_translation_en": "even though he may veil himself in excuses.",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "In this verse, Allah forbids the Prophet Muhammad to move his tongue to read the Qur'an in order to hasten it. In other words, Allah forbade the Prophet saw to move his tongue and lips to hasten the reading of Gabriel because he was afraid to read it. \" He is calm in receiving revelation, and does not have to rush to catch it. In another verse there is a similar meaning: Allah is the real King, and do not rush (recite) the Qur'an before it is revealed to you, and say, \"My Lord, add to my knowledge.\" (thaha \/ 20: 114) Allah forbade the Holy Prophet to copy Gabriel's reading sentence after sentence, so that Muhammad could memorize and understand the verse well. that was revealed.",
      "text_tafsir": "Dalam ayat ini, Allah melarang Nabi Muhammad menggerakkan lidahnya untuk membaca Al-Qur'an karena hendak cepat-cepat menguasainya. Dalam bahasa lain, Allah melarang Nabi saw menggerak-gerakkan lidah dan bibirnya untuk cepat-cepat menangkap bacaan Jibril karena takut bacaan itu luput dari ingatannya.\"\n\nHal ini terjadi ketika Surah thaha turun, dan semenjak ada teguran Allah dalam ayat ke 16 ini, tentu beliau sudah tenang dalam menerima wahyu, dan tidak perlu cepat-cepat menangkapnya. Pada ayat lain terdapat maksud yang sama, yakni:\n\nMaka Mahatinggi Allah, Raja yang sebenar-benarnya. Dan janganlah engkau (Muhammad) tergesa-gesa (membaca) Al-Qur'an sebelum selesai diwahyukan kepadamu, dan katakanlah, \"Ya Tuhanku, tambahkanlah ilmu kepadaku.\" (thaha\/20: 114)\n\nAllah melarang Nabi saw meniru bacaan Jibril kalimat demi kalimat sebelum selesai membacakannya, agar Nabi Muhammad dapat menghafal dan memahami dengan baik ayat yang diturunkan itu.",
      "text_translation": "Jangan engkau (Muhammad) gerakkan lidahmu (untuk membaca Al-Qur'an) karena hendak cepat-cepat (menguasai)nya.",
      "text": "لَا تُحَرِّكْ بِهٖ لِسَانَكَ لِتَعْجَلَ بِهٖۗ",
      "text_translation_en": "MOVE NOT thy tongue in haste, [repeating the words of the revelation:]",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "Allah explained that the prohibition of following Gabriel's reading while he was reading it was because of the fact that it was Allah's responsibility to collect the revelation in Muhammad's chest and make it good for him to read it. Allah is responsible for how the Qur'an is stored in the chest or memory of Muhammad, and secures it in its calf. It was Allah who gave him guidance in how to read the verse properly and in order that Muhammad memorized and never forgot. When Gabriel had finished reading the verses that were to be taken down, Muhammad saw to read them again. He will always find himself remembering and memorizing those verses. He stressed that at the time of reading Gabriel, Muhammad should be silent and listen to his reading. On the other hand, this verse also means that when the verses of Allah have been read to Muhammad, he should immediately practice his laws and his laws. Ever since this decree, the Messenger has always followed and listened attentively to the revelations that Gabriel read. After Gabriel left, he read it, and it remains in his memory. It is stated in the hadith of al-Bukhari's history that Ibn 'Abbas said: After the decree, the Prophet always listened and watched when Gabriel came, after Gabriel left him to read it as he was told. (History of al-Bukhari from Ibn 'Abbas).",
      "text_tafsir": "Allah menjelaskan bahwa larangan mengikuti bacaan Jibril ketika ia sedang membacakannya adalah karena sesungguhnya atas tanggungan Allah-lah mengumpulkan wahyu itu di dalam dada Muhammad dan membuatnya pandai membacanya. Allah-lah yang bertanggung jawab bagaimana supaya Al-Qur'an itu tersimpan dengan baik dalam dada atau ingatan Muhammad, dan memantapkannya dalam kalbunya. Allah pula yang memberikan bimbingan kepadanya bagaimana cara membaca ayat itu dengan sempurna dan teratur, sehingga Muhammad hafal dan tidak lupa selama-lamanya.\n\nApabila Jibril telah selesai membacakan ayat-ayat yang harus diturunkan, hendaklah Muhammad saw membacanya kembali. Nanti ia akan mendapatkan dirinya selalu ingat dan hafal ayat-ayat itu. Tegasnya pada waktu Jibril membaca, hendaklah Muhammad diam dan mendengarkan bacaannya.\n\nDari sudut lain, ayat ini juga berarti bahwa bila telah selesai dibacakan kepada Muhammad ayat-ayat Allah, hendaklah ia segera mengamalkan hukum-hukum dan syariat-syariatnya.\n\nSemenjak perintah ini turun, Rasulullah senantiasa mengikuti dan mendengarkan dengan penuh perhatian wahyu yang dibacakan Jibril. Setelah Jibril pergi, barulah beliau membacanya dan bacaannya itu tetap tinggal dalam ingatan beliau. Diterangkan dalam hadis riwayat al-Bukhari bahwa Ibnu 'Abbas berkata:\n\nSetelah perintah itu turun, Rasulullah selalu mendengarkan dan memperhatikan ketika Jibril datang, setelah Jibril pergi beliau membacanya sebagaimana diajarkan Jibril. (Riwayat al-Bukhari dari Ibnu 'Abbas).",
      "text_translation": "Sesungguhnya Kami yang akan mengumpulkannya (di dadamu) dan membacakannya. ",
      "text": "اِنَّ عَلَيْنَا جَمْعَهٗ وَقُرْاٰنَهٗ ۚ",
      "text_translation_en": "for, behold, it is for Us to gather it [in thy heart,] and to cause it to be read [as it ought to be read].",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "Allah explained that the prohibition of following Gabriel's reading while he was reading it was because of the fact that it was Allah's responsibility to collect the revelation in Muhammad's chest and make it good for him to read it. Allah is responsible for how the Qur'an is stored in the chest or memory of Muhammad, and secures it in its calf. It was Allah who gave him guidance in how to read the verse properly and in order that Muhammad memorized and never forgot. When Gabriel had finished reading the verses that were to be taken down, Muhammad saw to read them again. He will always find himself remembering and memorizing those verses. He stressed that at the time of reading Gabriel, Muhammad should be silent and listen to his reading. On the other hand, this verse also means that when the verses of Allah have been read to Muhammad, he should immediately practice his laws and his laws. Ever since this decree, the Messenger has always followed and listened attentively to the revelations that Gabriel read. After Gabriel left, he read it, and it remains in his memory. It is stated in the hadith of al-Bukhari's history that Ibn 'Abbas said: After the decree, the Prophet always listened and watched when Gabriel came, after Gabriel left him to read it as he was told. (History of al-Bukhari from Ibn 'Abbas).",
      "text_tafsir": "Allah menjelaskan bahwa larangan mengikuti bacaan Jibril ketika ia sedang membacakannya adalah karena sesungguhnya atas tanggungan Allah-lah mengumpulkan wahyu itu di dalam dada Muhammad dan membuatnya pandai membacanya. Allah-lah yang bertanggung jawab bagaimana supaya Al-Qur'an itu tersimpan dengan baik dalam dada atau ingatan Muhammad, dan memantapkannya dalam kalbunya. Allah pula yang memberikan bimbingan kepadanya bagaimana cara membaca ayat itu dengan sempurna dan teratur, sehingga Muhammad hafal dan tidak lupa selama-lamanya.\n\nApabila Jibril telah selesai membacakan ayat-ayat yang harus diturunkan, hendaklah Muhammad saw membacanya kembali. Nanti ia akan mendapatkan dirinya selalu ingat dan hafal ayat-ayat itu. Tegasnya pada waktu Jibril membaca, hendaklah Muhammad diam dan mendengarkan bacaannya.\n\nDari sudut lain, ayat ini juga berarti bahwa bila telah selesai dibacakan kepada Muhammad ayat-ayat Allah, hendaklah ia segera mengamalkan hukum-hukum dan syariat-syariatnya.\n\nSemenjak perintah ini turun, Rasulullah senantiasa mengikuti dan mendengarkan dengan penuh perhatian wahyu yang dibacakan Jibril. Setelah Jibril pergi, barulah beliau membacanya dan bacaannya itu tetap tinggal dalam ingatan beliau. Diterangkan dalam hadis riwayat al-Bukhari bahwa Ibnu 'Abbas berkata:\n\nSetelah perintah itu turun, Rasulullah selalu mendengarkan dan memperhatikan ketika Jibril datang, setelah Jibril pergi beliau membacanya sebagaimana diajarkan Jibril. (Riwayat al-Bukhari dari Ibnu 'Abbas).",
      "text_translation": "Apabila Kami telah selesai membacakannya maka ikutilah bacaannya itu. ",
      "text": "فَاِذَا قَرَأْنٰهُ فَاتَّبِعْ قُرْاٰنَهٗ ۚ",
      "text_translation_en": "Thus, when We recite it, follow thou its wording [with all thy mind]:",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "This verse explains the assurance of Allah that the truth of Allah is the explanation. This means that after Gabriel finished reading the Qur'an to the Prophet Muhammad (peace be upon him), Allah immediately gave him an explanation through the instincts that were implanted into the Prophet's chest, so that the meaning of this verse was exactly as Allah wanted him to know. It is Allah who has revealed to the Prophet all the secrets, laws, and knowledge of the Qur'an perfectly. Thus, there can be no doubt that the Qur'an is from Allah.",
      "text_tafsir": "Ayat ini menjelaskan adanya jaminan Allah bahwa sesungguhnya atas tanggungan Allah-lah penjelasannya. Maksudnya setelah Jibril selesai membacakan Al-Qur'an itu kepada Nabi Muhammad saw, maka Allah langsung memberikan penjelasan kepada beliau melalui ilham-ilham yang ditanamkan ke dalam dada Nabi saw, sehingga pengertian ayat ini secara sempurna sebagaimana yang dikehendaki Allah dapat diketahui Nabi saw. Allah pula yang menyampaikan kepada Nabi segala rahasia, hukum-hukum, dan pengetahuan Al-Qur'an itu secara sempurna. Dengan begitu, tidak dapat diragukan sedikit pun bahwa sesungguhnya Al-Qur'an itu dari sisi Allah.",
      "text_translation": "Kemudian sesungguhnya Kami yang akan menjelaskannya. ",
      "text": "ثُمَّ اِنَّ عَلَيْنَا بَيَانَهٗ ۗ",
      "text_translation_en": "and then, behold, it will be for Us to make its meaning clear.",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "In this verse, God condemns the life of a world-loving Muslim. God calls out, \"Absolutely not. Surely you (mankind) love the life of the world and leave the hereafter.\" With this verse there is a general conclusion that loving life is one of the whole human nature. There are some who wish for the happiness of the hereafter, but those who love the life of the world and who deny the existence of the resurrection are far greater.",
      "text_tafsir": "Dalam ayat ini, Allah mencela kehidupan orang musyrik yang sangat mencintai dunia. Allah menyerukan, \"Sekali-kali jangan. Sesungguhnya kamu (hai manusia) mencintai kehidupan dunia dan meninggalkan kehidupan akhirat.\" Dengan ayat ini terdapat suatu kesimpulan umum bahwa mencintai kehidupan adalah salah satu watak manusia seluruhnya. Memang ada sebagian yang mengharapkan kebahagiaan akhirat, namun yang mencintai hidup dunia serta mendustai adanya hari kebangkitan jauh lebih besar jumlahnya.",
      "text_translation": "Tidak! Bahkan kamu mencintai kehidupan dunia, ",
      "text": "كَلَّا بَلْ تُحِبُّوْنَ الْعَاجِلَةَۙ",
      "text_translation_en": "NAY, but [most of] you love this fleeting life,",
      "juz_number": 29
    },
    "21": {
      "text_tafsir_en": "Being influenced by worldly life is often accompanied by a false attitude of revelation, and forgetting about the afterlife and not even believing in its coming.",
      "text_tafsir": "Terpengaruh dengan kehidupan duniawi biasanya dibarengi dengan sikap mendustai wahyu, serta melupakan kehidupan hari akhirat dan bahkan tidak percaya dengan kedatangannya.",
      "text_translation": "dan mengabaikan (kehidupan) akhirat. ",
      "text": "وَتَذَرُوْنَ الْاٰخِرَةَۗ",
      "text_translation_en": "and give no thought to the life to come [and to Judgment Day]!",
      "juz_number": 29
    },
    "22": {
      "text_tafsir_en": "This verse describes some of the events of man on the day of resurrection when the faces of believers at that time were radiant. The happy and cheerful people are the candidates for heaven. They are the bright-eyed ones who look forward to meeting their Lord. Everywhere they can see Him. This means that they look directly to God without a wall (hijab). Such is the conclusion of the scholars of Sunnah scholars based on authentic hadiths that explain more about the meaning of seeing God mentioned in this verse. It is said that fortunate believers see God with their own eyes in the hereafter as they see the full moon shining a bright light with no clouds beneath it. The Hadith of al-Bukhari mentions this: You will see your Lord with your own eyes (openly) as you see the moon (full), and you will not rush to see Him. If you can afford not to leave before sunrise and sunset then do so. (History of al-Bukhari and Muslim by Jarir bin 'Abdillah) Although there is a clear statement from this verse 22, it is reinforced by some of the above hadiths that affirm that the believer would see the face of God himself, but some of the salaf scholars tried to proclaim it ) the meaning of the verses and the hadiths. The Mujahid (a well-known tabiin) thinks that the meaning of seeing God in heaven is \"seeing the reward that is with Allah\". But this is considered not to be based on strong reasons, because the word \"nadhara\" (look) in Arabic actually means looking with one's own eyes instead of looking with the eyes and so on. The question of \"will man see God on the Day of Judgment or not?\" has been a question that has been disputed (literally) since time immemorial. Sunnah scholars still believe that believers must see God based on the above verse, plus the evidence of various authentic hadiths. On the contrary the Mu'tazilah scholars assert that it is impossible for man to see the face and substance of Allah based on the sound of verse 103 of Surah al-An'am: He cannot be reached by sight, but He can see it. This verse, according to Mu'tazilah, is limited in its view of the favors, pleasures, and rewards provided by God. The hereafter is a supernatural question, which we cannot measure in comparison with what it is today. The simple and safe way of not getting involved in such a contentious dispute is to \"fully believe what the verse says without discussing it again. What is the true meaning, we give it to God. There are still many other fields of ijtihad (thought). to understand the meaning of the Holy Qur'anic verses. \" Here we quote some hadiths about seeing Allah in the hereafter: People ask Allah's Messenger (may peace be upon him), \"O Messenger of Allah, can we see our Lord on the Day of Judgment?\" He replied, \"Is it difficult for you to see the sun and the moon that are not blocked by the clouds?\" They answered, \"No.\" He said again, \"So you see your Lord.\" (The History of al-Bukhari and the Muslims of Abu Hurairah) A prophet from the Holy Prophet (may peace be upon him) reported that he said, \"When the people of heaven have entered into heaven, Allah said, 'Do you want anything more to add?' You have made our faces shine, have you not brought us into heaven, and delivered us from the flames of fire? God answered and then the hijab was revealed, and there is nothing more pleasing to them than to see their God. \" Then he read this verse (Jonah 10:26): lilladhina ahsanu al-husna wa ziyadah (Muslim History)",
      "text_tafsir": "Ayat ini menerangkan sebagian hal ihwal manusia pada hari kebangkitan saat wajah-wajah orang beriman pada waktu itu berseri-seri. Golongan yang gembira dan berwajah ceria inilah calon penghuni surga. Merekalah yang berwajah cerah yang mengharapkan perjumpaan dengan Tuhannya.\n\nDi mana pun mereka dapat melihat-Nya. Artinya mereka langsung memandang kepada Allah tanpa dinding pembatas (hijab). Demikian kesimpulan pendapat ulama ahli sunnah berdasarkan hadis-hadis sahih yang menerangkan lebih lanjut tentang makna melihat Tuhan yang disebutkan dalam ayat ini. Dikatakan bahwa orang yang beriman yang beruntung melihat Allah dengan mata kepalanya sendiri pada hari akhirat sebagaimana mereka melihat bulan purnama yang bersinar terang benderang yang tidak ada awan di bawahnya. Hadis al-Bukhari yang menyebutkan hal itu berbunyi:\n\nSesungguhnya kamu akan melihat Tuhanmu dengan mata kepalamu sendiri (terang-terang) sebagaimana kamu melihat bulan (purnama), kamu tidak berdesak-desakan dalam melihat-Nya. Jika kamu mampu tidak meninggalkan salat sebelum terbit matahari dan terbenam matahari maka lakukanlah. (Riwayat al-Bukhari dan Muslim dari Jarir bin 'Abdillah)\n\nSekalipun ada keterangan yang jelas dari ayat 22 ini yang diperkuat dengan beberapa hadis di atas yang menegaskan bahwa manusia mukmin nanti melihat sendiri wajah Allah itu, namun sebagian dari ulama salaf mencoba mentakwilkan (memalingkan) pengertian ayat dan hadis-hadis tersebut. Mujahid (seorang tabiin yang terkenal) berpendapat bahwa arti melihat Allah di dalam surga adalah \"melihat pahala yang ada di sisi Allah\". Namun hal demikian dianggap tidak berdasarkan alasan yang kuat, sebab kata-kata \"nadhara\" (melihat) dalam bahasa Arab betul-betul berarti melihat dengan mata kepala sendiri bukan melihat dengan mata hati dan sebagainya.\n\nPermasalahan tentang \"apakah manusia nanti melihat Allah pada hari Kiamat atau tidak?\" menjadi persoalan yang diperselisihkan (khilafiah) sejak dari dahulu. Ulama ahli sunnah tetap berpendirian bahwa orang mukmin pasti melihat Allah berdasarkan ayat di atas, ditambah keterangan dari berbagai hadis sahih. Sebaliknya ulama-ulama Mu'tazilah menegaskan tidak mungkin sama sekali manusia melihat wajah dan zat Allah berdasarkan bunyi ayat ke 103 Surah al-An'am: Dia tidak dapat dicapai oleh penglihatan mata, sedang Dia dapat melihat segala penglihatan itu.\n\nAyat ini, menurut Mu'tazilah, terbatas pengertiannya pada melihat nikmat, keridaan, dan pahala yang disediakan Allah. Persoalan akhirat adalah persoalan gaib, tidak dapat kita ukur dalam perbandingan dengan apa yang ada sekarang.\n\nJalan yang ringkas dan selamat serta tidak terlibat dalam pertikaian yang berlarut-larut itu adalah \"mengimani sepenuhnya apa yang diberikan ayat tanpa membahasnya lagi. Bagaimana pengertian yang sesungguhnya, kita serahkan kepada Allah saja. Masih banyak lapangan ijtihad (pemikiran) yang lain bila seseorang ingin mendalami maksud ayat-ayat suci Al-Qur'an.\"\n\nBerikut ini kita kutip beberapa hadis tentang melihat Allah di akhirat:\n\nOrang-orang bertanya kepada Rasulullah saw, \"Wahai Rasulullah apakah kami dapat melihat Tuhan kami di hari Kiamat kelak?\" Beliau menjawab, \"Apakah sulit bagi kalian melihat matahari dan bulan yang tidak dihalangi oleh awan?\" Mereka menjawab, \"Tidak.\" Beliau bersabda lagi, \"Demikian pula kamu melihat Tuhanmu.\" (Riwayat al-Bukhari dan Muslim dari Abu Hurairah)\n\nDiriwayatkan dari suhaib dari Nabi saw bahwa beliau bersabda, \"Bila penduduk surga telah masuk ke dalam surga, Allah berfirman, 'Apakah engkau ingin lagi sesuatu yang hendak Aku tambahkan? Mereka menjawab, 'Bukankah Engkau sudah cerahkan wajah kami, bukankah telah Engkau masukkan kami ke dalam surga. Dan telah Engkau lepaskan kami dari api neraka? Allah menjawab dan kemudian hijab pun tersingkap, maka tiadalah sesuatu pemberian yang lebih mereka senangi selain daripada melihat Tuhan mereka.\" Kemudian beliau membaca ayat ini (Yunus\/10: 26): lilladhina ahsanu al-husna wa ziyadah (Riwayat Muslim)",
      "text_translation": "Wajah-wajah (orang mukmin) pada hari itu berseri-seri,",
      "text": "وُجُوْهٌ يَّوْمَىِٕذٍ نَّاضِرَةٌۙ",
      "text_translation_en": "Some faces will on that Day be bright with happiness,",
      "juz_number": 29
    },
    "23": {
      "text_tafsir_en": "This verse describes some of the events of man on the day of resurrection when the faces of believers at that time were radiant. The happy and cheerful people are the candidates for heaven. They are the bright-eyed ones who look forward to meeting their Lord. Everywhere they can see Him. This means that they look directly to God without a wall (hijab). Such is the conclusion of the scholars of Sunnah scholars based on authentic hadiths that explain more about the meaning of seeing God mentioned in this verse. It is said that fortunate believers see God with their own eyes in the hereafter as they see the full moon shining a bright light with no clouds beneath it. The Hadith of al-Bukhari mentions this: You will see your Lord with your own eyes (openly) as you see the moon (full), and you will not rush to see Him. If you can afford not to leave before sunrise and sunset then do so. (History of al-Bukhari and Muslim by Jarir bin 'Abdillah) Although there is a clear statement from this verse 22, it is reinforced by some of the above hadiths that affirm that the believer would see the face of God himself, but some of the salaf scholars tried to proclaim it ) the meaning of the verses and the hadiths. The Mujahid (a well-known tabiin) thinks that the meaning of seeing God in heaven is \"seeing the reward that is with Allah\". But this is considered not to be based on strong reasons, because the word \"nadhara\" (look) in Arabic actually means looking with one's own eyes instead of looking with the eyes and so on. The question of \"will man see God on the Day of Judgment or not?\" has been a question that has been disputed (literally) since time immemorial. Sunnah scholars still believe that believers must see God based on the above verse, plus the evidence of various authentic hadiths. On the contrary the Mu'tazilah scholars assert that it is impossible for man to see the face and substance of Allah based on the sound of verse 103 of Surah al-An'am: He cannot be reached by sight, but He can see it. This verse, according to Mu'tazilah, is limited in its view of the favors, pleasures, and rewards provided by God. The hereafter is a supernatural question, which we cannot measure in comparison with what it is today. The simple and safe way of not getting involved in such a contentious dispute is to \"fully believe what the verse says without discussing it again. What is the true meaning, we give it to God. There are still many other fields of ijtihad (thought). to understand the meaning of the Holy Qur'anic verses. \" Here we quote some hadiths about seeing Allah in the hereafter: People ask Allah's Messenger (may peace be upon him), \"O Messenger of Allah, can we see our Lord on the Day of Judgment?\" He replied, \"Is it difficult for you to see the sun and the moon that are not blocked by the clouds?\" They answered, \"No.\" He said again, \"So you see your Lord.\" (The History of al-Bukhari and the Muslims of Abu Hurairah) A prophet from the Holy Prophet (may peace be upon him) reported that he said, \"When the people of heaven have entered into heaven, Allah said, 'Do you want anything more to add?' You have made our faces shine, have you not brought us into heaven, and delivered us from the flames of fire? God answered and then the hijab was revealed, and there is nothing more pleasing to them than to see their God. \" Then he read this verse (Jonah 10:26): lilladhina ahsanu al-husna wa ziyadah (Muslim History)",
      "text_tafsir": "Ayat ini menerangkan sebagian hal ihwal manusia pada hari kebangkitan saat wajah-wajah orang beriman pada waktu itu berseri-seri. Golongan yang gembira dan berwajah ceria inilah calon penghuni surga. Merekalah yang berwajah cerah yang mengharapkan perjumpaan dengan Tuhannya.\n\nDi mana pun mereka dapat melihat-Nya. Artinya mereka langsung memandang kepada Allah tanpa dinding pembatas (hijab). Demikian kesimpulan pendapat ulama ahli sunnah berdasarkan hadis-hadis sahih yang menerangkan lebih lanjut tentang makna melihat Tuhan yang disebutkan dalam ayat ini. Dikatakan bahwa orang yang beriman yang beruntung melihat Allah dengan mata kepalanya sendiri pada hari akhirat sebagaimana mereka melihat bulan purnama yang bersinar terang benderang yang tidak ada awan di bawahnya. Hadis al-Bukhari yang menyebutkan hal itu berbunyi:\n\nSesungguhnya kamu akan melihat Tuhanmu dengan mata kepalamu sendiri (terang-terang) sebagaimana kamu melihat bulan (purnama), kamu tidak berdesak-desakan dalam melihat-Nya. Jika kamu mampu tidak meninggalkan salat sebelum terbit matahari dan terbenam matahari maka lakukanlah. (Riwayat al-Bukhari dan Muslim dari Jarir bin 'Abdillah)\n\nSekalipun ada keterangan yang jelas dari ayat 22 ini yang diperkuat dengan beberapa hadis di atas yang menegaskan bahwa manusia mukmin nanti melihat sendiri wajah Allah itu, namun sebagian dari ulama salaf mencoba mentakwilkan (memalingkan) pengertian ayat dan hadis-hadis tersebut. Mujahid (seorang tabiin yang terkenal) berpendapat bahwa arti melihat Allah di dalam surga adalah \"melihat pahala yang ada di sisi Allah\". Namun hal demikian dianggap tidak berdasarkan alasan yang kuat, sebab kata-kata \"nadhara\" (melihat) dalam bahasa Arab betul-betul berarti melihat dengan mata kepala sendiri bukan melihat dengan mata hati dan sebagainya.\n\nPermasalahan tentang \"apakah manusia nanti melihat Allah pada hari Kiamat atau tidak?\" menjadi persoalan yang diperselisihkan (khilafiah) sejak dari dahulu. Ulama ahli sunnah tetap berpendirian bahwa orang mukmin pasti melihat Allah berdasarkan ayat di atas, ditambah keterangan dari berbagai hadis sahih. Sebaliknya ulama-ulama Mu'tazilah menegaskan tidak mungkin sama sekali manusia melihat wajah dan zat Allah berdasarkan bunyi ayat ke 103 Surah al-An'am: Dia tidak dapat dicapai oleh penglihatan mata, sedang Dia dapat melihat segala penglihatan itu.\n\nAyat ini, menurut Mu'tazilah, terbatas pengertiannya pada melihat nikmat, keridaan, dan pahala yang disediakan Allah. Persoalan akhirat adalah persoalan gaib, tidak dapat kita ukur dalam perbandingan dengan apa yang ada sekarang.\n\nJalan yang ringkas dan selamat serta tidak terlibat dalam pertikaian yang berlarut-larut itu adalah \"mengimani sepenuhnya apa yang diberikan ayat tanpa membahasnya lagi. Bagaimana pengertian yang sesungguhnya, kita serahkan kepada Allah saja. Masih banyak lapangan ijtihad (pemikiran) yang lain bila seseorang ingin mendalami maksud ayat-ayat suci Al-Qur'an.\"\n\nBerikut ini kita kutip beberapa hadis tentang melihat Allah di akhirat:\n\nOrang-orang bertanya kepada Rasulullah saw, \"Wahai Rasulullah apakah kami dapat melihat Tuhan kami di hari Kiamat kelak?\" Beliau menjawab, \"Apakah sulit bagi kalian melihat matahari dan bulan yang tidak dihalangi oleh awan?\" Mereka menjawab, \"Tidak.\" Beliau bersabda lagi, \"Demikian pula kamu melihat Tuhanmu.\" (Riwayat al-Bukhari dan Muslim dari Abu Hurairah)\n\nDiriwayatkan dari suhaib dari Nabi saw bahwa beliau bersabda, \"Bila penduduk surga telah masuk ke dalam surga, Allah berfirman, 'Apakah engkau ingin lagi sesuatu yang hendak Aku tambahkan? Mereka menjawab, 'Bukankah Engkau sudah cerahkan wajah kami, bukankah telah Engkau masukkan kami ke dalam surga. Dan telah Engkau lepaskan kami dari api neraka? Allah menjawab dan kemudian hijab pun tersingkap, maka tiadalah sesuatu pemberian yang lebih mereka senangi selain daripada melihat Tuhan mereka.\" Kemudian beliau membaca ayat ini (Yunus\/10: 26): lilladhina ahsanu al-husna wa ziyadah (Riwayat Muslim)",
      "text_translation": "memandang Tuhannya. ",
      "text": "اِلٰى رَبِّهَا نَاظِرَةٌ ۚ",
      "text_translation_en": "looking up to their Sustainer;",
      "juz_number": 29
    },
    "24": {
      "text_tafsir_en": "The following verse explains that the faces of the infidels on that day were gloomy. They were mourning, sour-faced, symbolizing incredible sadness and fear. They were convinced of a terrible catastrophe, as God had said: On that day there was a glowing white face, and there was a gloomy black face. As for those with dark eyes, they said, \"Why are you disbelievers after believing? Therefore suffer the punishment for your disbelief.\" (Ali 'Imran \/ 3: 106) As for the faces of the believers at that time their faces became white. They are in the grace of God and remain in it, as He says: On that day there will be radiant, laughing and happy faces, and on that day there will be (dust) faces covered with dust ( gloomy), covered by darkness (afflicted with humiliation and distress). They are the disbelievers. (Job \/ 80: 38-42)",
      "text_tafsir": "Ayat berikut ini menjelaskan bahwa wajah orang-orang kafir pada hari itu muram. Mereka bermuram durja, berwajah masam melambangkan kesedihan dan ketakutan yang luar biasa. Mereka yakin akan ditimpa malapetaka yang dahsyat, sebagaimana firman Allah:\n\nPada hari itu ada wajah yang putih berseri, dan ada pula wajah yang hitam muram. Adapun orang-orang yang berwajah hitam muram (kepada mereka dikatakan), \"Mengapa kamu kafir setelah beriman? Karena itu rasakanlah azab disebabkan kekafiranmu itu.\" (Ali 'Imran\/3: 106)\n\nAdapun wajah orang-orang mukmin ketika itu menjadi putih berseri mukanya. Mereka berada dalam rahmat Allah (surga) dan kekal di dalamnya, sebagaimana firman-Nya:\n\nPada hari itu ada wajah-wajah yang berseri-seri, tertawa dan gembira ria, dan pada hari itu ada (pula) wajah-wajah yang tertutup debu (suram), tertutup oleh kegelapan (ditimpa kehinaan dan kesusahan). Mereka itulah orang-orang kafir yang durhaka. ('Abasa\/80: 38-42)",
      "text_translation": "Dan wajah-wajah (orang kafir) pada hari itu muram, ",
      "text": "وَوُجُوْهٌ يَّوْمَىِٕذٍۢ بَاسِرَةٌۙ",
      "text_translation_en": "and some faces will on that Day be overcast with despair,",
      "juz_number": 29
    },
    "25": {
      "text_tafsir_en": "The following verse explains that the faces of the infidels on that day were gloomy. They were mourning, sour-faced, symbolizing incredible sadness and fear. They were convinced of a terrible catastrophe, as God had said: On that day there was a glowing white face, and there was a gloomy black face. As for those with dark eyes, they said, \"Why are you disbelievers after believing? Therefore suffer the punishment for your disbelief.\" (Ali 'Imran \/ 3: 106) As for the faces of the believers at that time their faces became white. They are in the grace of God and remain in it, as He says: On that day there will be radiant, laughing and happy faces, and on that day there will be (dust) faces covered with dust ( gloomy), covered by darkness (afflicted with humiliation and distress). They are the disbelievers. (Job \/ 80: 38-42)",
      "text_tafsir": "Ayat berikut ini menjelaskan bahwa wajah orang-orang kafir pada hari itu muram. Mereka bermuram durja, berwajah masam melambangkan kesedihan dan ketakutan yang luar biasa. Mereka yakin akan ditimpa malapetaka yang dahsyat, sebagaimana firman Allah:\n\nPada hari itu ada wajah yang putih berseri, dan ada pula wajah yang hitam muram. Adapun orang-orang yang berwajah hitam muram (kepada mereka dikatakan), \"Mengapa kamu kafir setelah beriman? Karena itu rasakanlah azab disebabkan kekafiranmu itu.\" (Ali 'Imran\/3: 106)\n\nAdapun wajah orang-orang mukmin ketika itu menjadi putih berseri mukanya. Mereka berada dalam rahmat Allah (surga) dan kekal di dalamnya, sebagaimana firman-Nya:\n\nPada hari itu ada wajah-wajah yang berseri-seri, tertawa dan gembira ria, dan pada hari itu ada (pula) wajah-wajah yang tertutup debu (suram), tertutup oleh kegelapan (ditimpa kehinaan dan kesusahan). Mereka itulah orang-orang kafir yang durhaka. ('Abasa\/80: 38-42)",
      "text_translation": "mereka yakin bahwa akan ditimpakan kepadanya malapetaka yang sangat dahsyat.",
      "text": "تَظُنُّ اَنْ يُّفْعَلَ بِهَا فَاقِرَةٌ ۗ",
      "text_translation_en": "knowing that a crushing calamity is about to befall them.",
      "juz_number": 29
    },
    "26": {
      "text_tafsir_en": "In this verse, God calls on mankind to never forget the Hereafter. When a person's breath has reached the esophagus then repentance is of no use. Never be influenced by worldly life and remember that in time, the human soul will be taken away by the angels of death. When the soul divorces the body, the human relation to all that he possesses is lost and he will face a new phase of his eternal and eternal life. In another verse, Allah says: Then why (does it not) when (life) has reached the throat, and you see it. (al-Waqi'ah \/ 56: 83-84)",
      "text_tafsir": "Dalam ayat ini, Allah menyerukan manusia supaya sekali-kali tidak melupakan akhirat. Apabila napas seseorang telah sampai ke kerongkongan maka pertobatan tidak ada lagi gunanya. Jangan sekali-kali terpengaruh dengan kehidupan duniawi dan ingatlah bahwa pada waktunya, jiwa manusia akan dicabut oleh malaikat maut. Bila nyawa bercerai dengan tubuh, maka hubungan manusia dengan segala apa yang dimilikinya terputus dan ia akan menghadapi babak baru dari kehidupannya yang kekal dan abadi. Dalam ayat lain, Allah berfirman:\n\nMaka kalau begitu mengapa (tidak mencegah) ketika (nyawa) telah sampai di kerongkongan, dan kamu ketika itu melihat. (al-Waqi'ah\/56: 83-84)",
      "text_translation": "Tidak! Apabila (nyawa) telah sampai ke kerongkongan,",
      "text": "كَلَّآ اِذَا بَلَغَتِ التَّرَاقِيَۙ",
      "text_translation_en": "NAY, but when [the last breath] comes up to the throat [of a dying man],",
      "juz_number": 29
    },
    "27": {
      "text_tafsir_en": "This verse describes the mood of the person in his heart when his family asks, \"Who can heal?\" In general, when a person is dying, his family and relatives are overwhelmed by the anxiety, \"Who and what doctor can cure him of his illness?\" This means that medical efforts are still being made, but one must be convinced that it is dead, and no one can save it from that provision. All without looking fur, even this mortal will surely be destroyed. Only God himself is not destroyed. According to Ibn 'Abbas, this verse means \"who is he who takes away his life, whether it is an angel of doom or an angel of mercy\". Anyway, they asked each other if the deceased was happy or unhappy with his death. Humans did not know before the death of the angel that he would be saved or wretched.",
      "text_tafsir": "Ayat ini menggambarkan suasana orang yang dalam sakratulmaut ketika keluarganya bertanya-tanya, \"Siapakah yang dapat menyembuhkan?\" Secara umum, pada saat seseorang sedang sakratulmaut, kaum famili dan sanak keluarganya ditimpa oleh kegelisahan, \"Siapa dan dokter mana gerangan yang dapat menyembuhkan dia dari sakitnya?\" Artinya usaha-usaha pengobatan tetap dilakukan, namun orang harus yakin kalau memang sudah ajal, tidak seorang pun yang dapat menyelamatkannya dari ketentuan Allah itu. Semuanya tanpa pandang bulu, bahkan semua yang fana ini pasti akan hancur. Hanya Allah sendiri yang tidak hancur.\n\nMenurut Ibnu 'Abbas, ayat ini berarti \"siapakah gerangan yang mencabut nyawanya, apakah malaikat azab atau malaikat rahmat\". Pokoknya terjadi saling bertanya, apakah si mayat berbahagia atau celaka dengan kematiannya. Manusia memang tidak mengetahui sebelum kedatangan malaikat maut apakah ia akan selamat atau celaka.",
      "text_translation": "dan dikatakan (kepadanya), “Siapa yang dapat menyembuhkan?”",
      "text": "وَقِيْلَ مَنْ ۜرَاقٍۙ",
      "text_translation_en": "and people ask, \"Is there any wizard [that could save him]?\"",
      "juz_number": 29
    },
    "28": {
      "text_tafsir_en": "These verses illustrate that the person facing the sacrament believes that this is the moment of separation from the world. In other words it can be said that at the time of death, a new person was convinced that it was time to separate forever from the world, property, family, and relatives. God purposely utters the words of dhanna (which actually means to think) because even when the soul is about to float, he still longs to live again due to his excessive love for this mortal life. Humans are not yet sure of their own death. The statement of this verse that says \"the left calf is linked to the right calf\" means that he is no longer able to move both of his calves (legs). He is also unable to move his trunk as his organs and tissues have stopped working. The words iltaffa (linked) are interpreted by Ibn 'Abbas in connection with the moment of death between the weight of the world and the great fear of the hereafter. Cling to reinforcements, and that's where the torture of death can only be felt by the concerned.",
      "text_tafsir": "Ayat-ayat ini menggambarkan bahwa orang yang sedang menghadapi sakratulmaut itu yakin bahwa itulah saat perpisahan dengan dunia. Dalam bahasa lain dapat dikatakan bahwa di saat kematian datang, seseorang baru merasa yakin bahwa telah tiba saatnya berpisah buat selama-lamanya dengan dunia, harta, keluarga, dan sanak famili.\n\nAllah sengaja menyebutkan kata-kata dhanna (yang sebenarnya berarti menyangka) karena pada saat jiwa akan melayang itu pun, dia masih sangat ingin hidup lagi disebabkan kecintaannya yang berlebihan terhadap kehidupan yang fana ini. Manusia belum begitu yakin akan kematiannya sendiri.\n\nPernyataan ayat ini yang menyebutkan \"betis kirinya telah bertaut dengan betis kanan\" mengandung arti bahwa dia sudah tidak dapat menggerakkan kedua betisnya (kaki)nya. Bahkan ia juga tidak lagi dapat menggerakkan batang tubuhnya karena organ dan jaringan tubuh telah berhenti bekerja.\n\nKata-kata iltaffa (bertaut) diartikan Ibnu 'Abbas dengan bertautnya di saat kematian itu antara beratnya meninggalkan dunia ini dengan ketakutan yang luar biasa menghadapi akhirat. Bertautlah bala dengan bala, dan disitulah letaknya siksaan sakratulmaut yang hanya dapat dirasakan oleh yang bersangkutan.",
      "text_translation": "Dan dia yakin bahwa itulah waktu perpisahan (dengan dunia), ",
      "text": "وَّظَنَّ اَنَّهُ الْفِرَاقُۙ",
      "text_translation_en": "the while he [himself] knows that this is the parting,",
      "juz_number": 29
    },
    "29": {
      "text_tafsir_en": "These verses illustrate that the person facing the sacrament believes that this is the moment of separation from the world. In other words it can be said that at the time of death, a new person was convinced that it was time to separate forever from the world, property, family, and relatives. God purposely utters the words of dhanna (which actually means to think) because even when the soul is about to float, he still longs to live again due to his excessive love for this mortal life. Humans are not yet sure of their own death. The statement of this verse that says \"the left calf is linked to the right calf\" means that he is no longer able to move both of his calves (legs). He is also unable to move his trunk as his organs and tissues have stopped working. The words iltaffa (linked) are interpreted by Ibn 'Abbas in connection with the moment of death between the weight of the world and the great fear of the hereafter. Cling to reinforcements, and that's where the torture of death can only be felt by the concerned.",
      "text_tafsir": "Ayat-ayat ini menggambarkan bahwa orang yang sedang menghadapi sakratulmaut itu yakin bahwa itulah saat perpisahan dengan dunia. Dalam bahasa lain dapat dikatakan bahwa di saat kematian datang, seseorang baru merasa yakin bahwa telah tiba saatnya berpisah buat selama-lamanya dengan dunia, harta, keluarga, dan sanak famili.\n\nAllah sengaja menyebutkan kata-kata dhanna (yang sebenarnya berarti menyangka) karena pada saat jiwa akan melayang itu pun, dia masih sangat ingin hidup lagi disebabkan kecintaannya yang berlebihan terhadap kehidupan yang fana ini. Manusia belum begitu yakin akan kematiannya sendiri.\n\nPernyataan ayat ini yang menyebutkan \"betis kirinya telah bertaut dengan betis kanan\" mengandung arti bahwa dia sudah tidak dapat menggerakkan kedua betisnya (kaki)nya. Bahkan ia juga tidak lagi dapat menggerakkan batang tubuhnya karena organ dan jaringan tubuh telah berhenti bekerja.\n\nKata-kata iltaffa (bertaut) diartikan Ibnu 'Abbas dengan bertautnya di saat kematian itu antara beratnya meninggalkan dunia ini dengan ketakutan yang luar biasa menghadapi akhirat. Bertautlah bala dengan bala, dan disitulah letaknya siksaan sakratulmaut yang hanya dapat dirasakan oleh yang bersangkutan.",
      "text_translation": "dan bertaut betis (kiri) dengan betis (kanan),",
      "text": "وَالْتَفَّتِ السَّاقُ بِالسَّاقِۙ",
      "text_translation_en": "and is enwrapped in the pangs of death",
      "juz_number": 29
    },
    "30": {
      "text_tafsir_en": "This verse confirms that on that day a man is brought to his Lord, that is to say, whether he will be placed in hell or in heaven. According to Ibn 'Abbas, this verse is a story of unbelievers who are not accepted by Allah, the spirits who never once believed and did only what they pleased. The meaning of this verse is related to another verse: And He is the sovereign over all his servants, and he sent to you the guardian angels, so that when death comes to any of you, our angels take away his life, and they do not forget his job. Then they (the servants of Allah) are returned to Allah, their true ruler. Know that all law is upon him. And He is the fastest calculator. (al-An'am \/ 6: 61-62)",
      "text_tafsir": "Ayat ini menegaskan bahwa pada hari itu manusia dihalau kepada Tuhannya, yakni dikembalikan apakah dia akan ditempatkan di neraka atau di dalam surga.\n\nMenurut Ibnu 'Abbas, ayat ini merupakan pemberitaan tentang orang kafir yang tidak diterima di sisi Allah, roh yang dahulu tidak pernah mau beriman dan hanya berbuat menurut apa yang disukainya. Pengertian ayat ini dikaitkan dengan ayat lain:\n\nDan Dialah Penguasa mutlak atas semua hamba-Nya, dan diutus-Nya kepadamu malaikat-malaikat penjaga, sehingga apabila kematian datang kepada salah seorang di antara kamu, malaikat-malaikat Kami mencabut nyawanya, dan mereka tidak melalaikan tugasnya. Kemudian mereka (hamba-hamba Allah) dikembalikan kepada Allah, penguasa mereka yang sebenarnya. Ketahuilah bahwa segala hukum (pada hari itu) ada pada-Nya. Dan Dialah pembuat perhitungan yang paling cepat. (al-An'am\/6: 61-62)",
      "text_translation": "kepada Tuhanmulah pada hari itu kamu dihalau. ",
      "text": "اِلٰى رَبِّكَ يَوْمَىِٕذِ ِۨالْمَسَاقُ ۗ ࣖ",
      "text_translation_en": "at that time towards thy Sustainer does he feel impelled to turn!",
      "juz_number": 29
    },
    "31": {
      "text_tafsir_en": "These verses make it clear that the unbelievers would not justify the apostles, and turn away from the truth and would not perform the prayers. He has always denied the Messenger of Allah and the Qur'an, and has never denied Allah. He kept company with him and believed that God was one. He also refuses to perform the duties imposed upon him, and always opposes and turns away from the commandments of God, and is influenced by worldly pleasures.",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa orang kafir itu tidak mau membenarkan rasul, dan berpaling dari kebenaran serta tidak mau mengerjakan salat. Ia selalu mendustakan Rasulullah dan Al-Qur'an, dan tidak mau mengesakan Allah. Ia tetap menyekutukan-Nya dan meyakini bahwa Tuhan itu berbilang. Ia juga tidak mau mengerjakan kewajiban-kewajiban yang dibebankan kepadanya, dan selalu menentang dan berpaling dari perintah Tuhan, serta terpengaruh oleh kesenangan duniawi.",
      "text_translation": "Karena dia (dahulu) tidak mau membenarkan (Al-Qur'an dan Rasul) dan tidak mau melaksanakan salat, ",
      "text": "فَلَا صَدَّقَ وَلَا صَلّٰىۙ",
      "text_translation_en": "[Useless, though, will be his repentance: for [as long as he was alive] he did not accept the truth, nor did he pray [for enlightenment],",
      "juz_number": 29
    },
    "32": {
      "text_tafsir_en": "These verses make it clear that the unbelievers would not justify the apostles, and turn away from the truth and would not perform the prayers. He has always denied the Messenger of Allah and the Qur'an, and has never denied Allah. He kept company with him and believed that God was one. He also refuses to perform the duties imposed upon him, and always opposes and turns away from the commandments of God, and is influenced by worldly pleasures.",
      "text_tafsir": "Ayat-ayat ini menerangkan bahwa orang kafir itu tidak mau membenarkan rasul, dan berpaling dari kebenaran serta tidak mau mengerjakan salat. Ia selalu mendustakan Rasulullah dan Al-Qur'an, dan tidak mau mengesakan Allah. Ia tetap menyekutukan-Nya dan meyakini bahwa Tuhan itu berbilang. Ia juga tidak mau mengerjakan kewajiban-kewajiban yang dibebankan kepadanya, dan selalu menentang dan berpaling dari perintah Tuhan, serta terpengaruh oleh kesenangan duniawi.",
      "text_translation": "tetapi justru dia mendustakan (Rasul) dan berpaling (dari kebenaran), ",
      "text": "وَلٰكِنْ كَذَّبَ وَتَوَلّٰىۙ",
      "text_translation_en": "but, on the contrary, he gave the lie to the truth and turned away [from it],",
      "juz_number": 29
    },
    "33": {
      "text_tafsir_en": "This verse goes on to explain that the disbeliever not only challenged and did not want to obey God, he even went to his family and relatives to share his attitudes arrogantly and arrogantly. People who deny God always act against Divine truth with their hearts, and act and act daily with that attitude. More than that, he feels proud and arrogant about what he does. Not the slightest goodness in the sight of God is inherent in that person, outward or inward.",
      "text_tafsir": "Ayat ini selanjutnya menjelaskan bahwa orang kafir itu tidak hanya menantang dan tidak mau patuh kepada Allah, bahkan dia mendatangi keluarga dan sanak familinya untuk menceritakan segala sikapnya itu dengan sombong dan angkuh.\n\nOrang-orang yang mengingkari Allah selalu bersikap mendustakan kebenaran Ilahi dengan hatinya, serta berbuat dan bertindak sehari-hari dengan sikap itu. Lebih dari itu, dia merasa bangga dan sombong terhadap apa yang dikerjakannya. Tidak sedikit pun kebaikan menurut pandangan Allah yang melekat pada diri orang itu, lahiriah maupun batiniah.",
      "text_translation": "kemudian dia pergi kepada keluarganya dengan sombong.",
      "text": "ثُمَّ ذَهَبَ اِلٰٓى اَهْلِهٖ يَتَمَطّٰىۗ",
      "text_translation_en": "and then went arrogantly back to what he had come from.",
      "juz_number": 29
    },
    "34": {
      "text_tafsir_en": "This verse confirms that in a threatening tone, Allah reminds the unbeliever of the coming of an accident for him. This remark means a threat and a strong warning. They are the ones who deserve the most and deserve torture. The Arabs say that sentence to someone who does a disgraceful deed.",
      "text_tafsir": "Ayat ini menegaskan bahwa dengan nada mengancam, Allah mengingatkan orang kafir akan kedatangan kecelakaan baginya. Ucapan ini berarti suatu ancaman dan peringatan keras. Merekalah yang paling patut dan pantas menerima siksaan. Orang Arab mengucapkan kalimat itu kepada seseorang yang mengerjakan perbuatan tercela.",
      "text_translation": "Celakalah kamu! Maka celakalah! ",
      "text": "اَوْلٰى لَكَ فَاَوْلٰىۙ",
      "text_translation_en": "[And yet, O man, thine end comes hourly] nearer unto thee, and nearer –",
      "juz_number": 29
    },
    "35": {
      "text_tafsir_en": "The threat was repeated once more to reinforce, \"Accident to disbelievers and accidents to them.\" It is narrated by interpreters from the Qatadah that one day the Messenger of Allah (may peace be upon him) took hold of Abu Jahal's arms while shouting at the enemy of Allah, \"Woe to you, Abu Jahal, you wretch!\" Abu Jahal replied with pride, \"Muhammad, are you threatening me? By Allah, you cannot do anything for me, even the God you worship! . \" But on the day of the battle of Badr, God destroyed Abu Jahal with a terrible death. When the news of Abu Jahal's death was conveyed to the Messenger of Allah, he said, \"Verily, every people has a Pharaoh (the most arrogant one), then Pharaoh of this people is Abu Jahal.\" Sa'id bin Jubair asked Ibn 'Abbas about this word \"hall of fa fa hall\", was it something that the Prophet said came from himself or did Allah send it? Ibn 'Abbas replied, \"It is he who speaks it, then Allah decrees revelation according to what he has said.\" This curse of Allah applies to people who are like Abu Jahal who will appear at all times.",
      "text_tafsir": "Ancaman ini diulang sekali lagi untuk memperkuatnya, \"Kecelakaanlah bagi orang kafir dan kecelakaan baginya.\" Diriwayatkan oleh ahli-ahli tafsir dari Qatadah bahwa pada suatu hari Rasulullah saw memegang erat-erat lengan Abu Jahal sambil menghardik musuh Allah itu, \"Celaka engkau hai Abu Jahal, celaka engkau!\" Abu Jahal menjawab dengan sombong, \"Muhammad, engkau mengancamku? Demi Allah, tak sanggup engkau berbuat sesuatu terhadapku, bahkan Tuhan yang engkau sembah juga tidak! Demi Allah, saya ini lebih perkasa dari segala orang yang berjalan antara bukit ini, dari segala penduduk Mekah.\" Tetapi di hari pertempuran Badar, Allah membinasakan Abu Jahal dengan kematian yang buruk sekali. Ketika berita tewasnya Abu Jahal disampaikan kepada Rasulullah, beliau bersabda, \"Sesungguhnya setiap umat itu ada Fir'aunnya (ada orang yang paling sombong), maka Fir'aun dari umat ini adalah Abu Jahal.\"\n\nSa'id bin Jubair bertanya kepada Ibnu 'Abbas tentang perkataan \"aula laka fa aula\" ini, apakah sesuatu yang diucapkan Nabi ini berasal dari dirinya atau memang Allah yang menyuruhnya? Ibnu 'Abbas menjawab, \"Benar beliau yang mengucapkannya, kemudian Allah menurunkan wahyu sama dengan ucapan beliau itu.\" Kutukan Allah ini berlaku bagi orang yang berwatak seperti Abu Jahal yang akan muncul pada setiap masa.",
      "text_translation": "Sekali lagi, celakalah kamu (manusia)! Maka celakalah! ",
      "text": "ثُمَّ اَوْلٰى لَكَ فَاَوْلٰىۗ",
      "text_translation_en": "and ever nearer unto thee, and nearer!",
      "juz_number": 29
    },
    "36": {
      "text_tafsir_en": "This verse presents the argument about the truth of the resurrection day by using the sentence question, namely whether humans are made useless (without accountability)? Are humans created and then allowed to live at will, without any commands and prohibitions from God that must be obeyed? Is after he died, God did not ask for his life, in the grave and in the future of Padang Mahsyar? Allah says: Indeed, the Day of Judgment will come, I keep it a secret (the time) so that everyone is rewarded in accordance with what he has tried. (thaha \/ 20:15) Other words of God: And We did not create the heavens and the earth and what is between them in vain. That is the opinion of those who disbelieve, so woe to those who disbelieve because they will go to hell. (sad \/ 38: 27) The evidence behind the understanding of this verse is to convince humans who doubt about the day of the resurrection, and reject or strongly deny those who deny it, either because of carelessness, stubbornness, or just because they want to play with the verse holy days.",
      "text_tafsir": "Ayat ini mengemukakan dalil tentang kebenaran hari kebangkitan dengan menggunakan kalimat pertanyaan, yaitu apakah manusia dijadikan percuma begitu saja (tanpa pertanggungjawaban)? Apakah manusia diciptakan kemudian dibiarkan hidup seenaknya, tanpa ada perintah dan larangan dari Allah yang harus ditaatinya? Apakah setelah ia mati, Allah tidak meminta pertanggungjawaban hidupnya, di alam kubur dan di Padang Mahsyar kelak?\n\nAllah berfirman:\n\nSungguh, hari Kiamat itu akan datang, Aku merahasiakan (waktunya) agar setiap orang dibalas sesuai dengan apa yang telah dia usahakan. (thaha\/20: 15)\n\nFirman Allah lainnya:\n\nDan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan sia-sia. Itu anggapan orang-orang kafir, maka celakalah orang-orang yang kafir itu karena mereka akan masuk neraka. (sad\/38: 27)\n\nDalil yang terdapat di balik pengertian ayat ini adalah meyakinkan kepada manusia yang ragu tentang adanya hari kebangkitan, dan menolak atau membantah dengan keras orang yang mengingkarinya, baik karena kecerobohan, sikap keras kepala, atau hanya karena ingin mempermainkan ayat-ayat suci.",
      "text_translation": "Apakah manusia mengira, dia akan dibiarkan begitu saja (tanpa pertanggungjawaban)?",
      "text": "اَيَحْسَبُ الْاِنْسَانُ اَنْ يُّتْرَكَ سُدًىۗ",
      "text_translation_en": "DOES MAN, then, think that he is to be left to himself to go about at will?",
      "juz_number": 29
    },
    "37": {
      "text_tafsir_en": "In these verses, Allah reminds us about the origin of human creation, that is, it was created from a drop of semen that was shed (into the womb) Then the semen became a clot of blood, then Allah created, and perfected it. Allah also made of him a pair of men and women. This verse reminds people who deny how the semen was created by God into flesh with which humans were created perfectly through the process of pregnancy. It is also easy for God to revive humans, then turn them off and on again. Male sperm and female egg cells are mixed into one to create a perfect human being, complete with sight and hearing, both male and female types. So did humans never think that the Creator from all the processes of that event would be able to destroy the world and then create the Day of Resurrection and humans who have been resurrected to life again? This is an affirmation for people who want to think if they are still doubtful about God's power to revive people who have died.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah mengingatkan kembali tentang asal mula penciptaan manusia, yaitu ia diciptakan dari setetes air mani yang ditumpahkan (ke dalam rahim) Kemudian mani itu menjadi segumpal darah, lalu Allah menciptakan, dan menyempurnakannya. Allah juga menjadikan dari padanya sepasang laki-laki dan perempuan.\n\nAyat ini mengingatkan manusia yang ingkar bagaimana air mani itu diciptakan Allah menjadi daging yang dengannya manusia diciptakan dengan sempurna melalui proses kehamilan. Adalah hal yang mudah juga bagi Allah menghidupkan manusia, kemudian mematikan dan menghidupkannya kembali.\n\nSperma laki-laki dan sel telur perempuan bercampur menjadi satu sehingga tercipta manusia yang sempurna, lengkap dengan penglihatan dan pendengaran, baik dari jenis laki-laki maupun perempuan. Maka apakah manusia tidak pernah memikirkan bahwa sang Pencipta dari segala proses kejadian itu mampu pula menghancurkan dunia ini kemudian menciptakan hari Kiamat serta manusia yang telah mati dibangkitkan hidup kembali?\n\nIni suatu penegasan bagi manusia yang mau berpikir andaikata masih ragu-ragu tentang kekuasaan Allah untuk menghidupkan kembali manusia yang telah mati.",
      "text_translation": "Bukankah dia mulanya hanya setetes mani yang ditumpahkan (ke dalam rahim), ",
      "text": "اَلَمْ يَكُ نُطْفَةً مِّنْ مَّنِيٍّ يُّمْنٰى ",
      "text_translation_en": "Was he not once a [mere] drop of sperm that had been spilt,",
      "juz_number": 29
    },
    "38": {
      "text_tafsir_en": "In these verses, Allah reminds us about the origin of human creation, that is, it was created from a drop of semen that was shed (into the womb) Then the semen became a clot of blood, then Allah created, and perfected it. Allah also made of him a pair of men and women. This verse reminds people who deny how the semen was created by God into flesh with which humans were created perfectly through the process of pregnancy. It is also easy for God to revive humans, then turn them off and on again. Male sperm and female egg cells are mixed into one to create a perfect human being, complete with sight and hearing, both male and female types. So did humans never think that the Creator from all the processes of that event would be able to destroy the world and then create the Day of Resurrection and humans who have been resurrected to life again? This is an affirmation for people who want to think if they are still doubtful about God's power to revive people who have died.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah mengingatkan kembali tentang asal mula penciptaan manusia, yaitu ia diciptakan dari setetes air mani yang ditumpahkan (ke dalam rahim) Kemudian mani itu menjadi segumpal darah, lalu Allah menciptakan, dan menyempurnakannya. Allah juga menjadikan dari padanya sepasang laki-laki dan perempuan.\n\nAyat ini mengingatkan manusia yang ingkar bagaimana air mani itu diciptakan Allah menjadi daging yang dengannya manusia diciptakan dengan sempurna melalui proses kehamilan. Adalah hal yang mudah juga bagi Allah menghidupkan manusia, kemudian mematikan dan menghidupkannya kembali.\n\nSperma laki-laki dan sel telur perempuan bercampur menjadi satu sehingga tercipta manusia yang sempurna, lengkap dengan penglihatan dan pendengaran, baik dari jenis laki-laki maupun perempuan. Maka apakah manusia tidak pernah memikirkan bahwa sang Pencipta dari segala proses kejadian itu mampu pula menghancurkan dunia ini kemudian menciptakan hari Kiamat serta manusia yang telah mati dibangkitkan hidup kembali?\n\nIni suatu penegasan bagi manusia yang mau berpikir andaikata masih ragu-ragu tentang kekuasaan Allah untuk menghidupkan kembali manusia yang telah mati.",
      "text_translation": "kemudian (mani itu) menjadi sesuatu yang melekat, lalu Allah menciptakannya dan menyempurnakannya, ",
      "text": "ثُمَّ كَانَ عَلَقَةً فَخَلَقَ فَسَوّٰىۙ",
      "text_translation_en": "and thereafter became a germ-cell - whereupon He created and formed [it] in accordance with what [it] was meant to be,",
      "juz_number": 29
    },
    "39": {
      "text_tafsir_en": "In these verses, Allah reminds us about the origin of human creation, that is, it was created from a drop of semen that was shed (into the womb) Then the semen became a clot of blood, then Allah created, and perfected it. Allah also made of him a pair of men and women. This verse reminds people who deny how the semen was created by God into flesh with which humans were created perfectly through the process of pregnancy. It is also easy for God to revive humans, then turn them off and on again. Male sperm and female egg cells are mixed into one to create a perfect human being, complete with sight and hearing, both male and female types. So did humans never think that the Creator from all the processes of that event would be able to destroy the world and then create the Day of Resurrection and humans who have been resurrected to life again? This is an affirmation for people who want to think if they are still doubtful about God's power to revive people who have died.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah mengingatkan kembali tentang asal mula penciptaan manusia, yaitu ia diciptakan dari setetes air mani yang ditumpahkan (ke dalam rahim) Kemudian mani itu menjadi segumpal darah, lalu Allah menciptakan, dan menyempurnakannya. Allah juga menjadikan dari padanya sepasang laki-laki dan perempuan.\n\nAyat ini mengingatkan manusia yang ingkar bagaimana air mani itu diciptakan Allah menjadi daging yang dengannya manusia diciptakan dengan sempurna melalui proses kehamilan. Adalah hal yang mudah juga bagi Allah menghidupkan manusia, kemudian mematikan dan menghidupkannya kembali.\n\nSperma laki-laki dan sel telur perempuan bercampur menjadi satu sehingga tercipta manusia yang sempurna, lengkap dengan penglihatan dan pendengaran, baik dari jenis laki-laki maupun perempuan. Maka apakah manusia tidak pernah memikirkan bahwa sang Pencipta dari segala proses kejadian itu mampu pula menghancurkan dunia ini kemudian menciptakan hari Kiamat serta manusia yang telah mati dibangkitkan hidup kembali?\n\nIni suatu penegasan bagi manusia yang mau berpikir andaikata masih ragu-ragu tentang kekuasaan Allah untuk menghidupkan kembali manusia yang telah mati.",
      "text_translation": "lalu Dia menjadikan darinya sepasang laki-laki dan perempuan. ",
      "text": "فَجَعَلَ مِنْهُ الزَّوْجَيْنِ الذَّكَرَ وَالْاُنْثٰىۗ",
      "text_translation_en": "and fashioned out of it the two sexes, the male and the female?",
      "juz_number": 29
    },
    "40": {
      "text_tafsir_en": "This verse is the answer to all of this, is it not God who does so, has the power to raise the dead? The meaning of this statement is that the substance that created the perfect creature from the drop of semen cannot bring back the dead. That would have been easier for him. That is why God declares in His Word: And He is the beginning of creation, And then He repeats it, and it is easier for Him. He has the highest nature in heaven and on earth. And He is the Mighty, the Wise. (ar-Romans \/ 30: 27) In some hadith it is said that after reading this surah, Allah's Messenger (may peace be upon him) prayed: After reciting Surah al-Qiyamah, the Prophet prayed, \"Subhanaka Allahumma wa bala (Glory be to you, Allah, and you Almighty (Ibn Mardawaih History of Abu Hurairah) Similarly, when he finished reciting Surah at-Tin, he prayed: Allah's Messenger (may peace be upon him) said: Whoever reads Surah at-Tin to the end, let him pray, \"Bala wa'ana dhalikum minasy-martyrs (Yes, I testify of it). And whoever reads Surah al-Qiyamah to the end, let him pray, \"Bala\" (yes, You are the Almighty). And whoever reads Surah al-Mursalat to the end, let him pray, \"Amanna billahi (we believe in Allah).\" (History of Ahmad, Abu Dawud, at-Tirmidhi, ibn al-Mindhir, Ibn Mardawaih, al-Baihaqi, (al-magistrate of Abu Hurairah) The above prayers were read by the Messenger of Allah (Muhammad SAW) after reciting verses like this while praying, while in prayer he did not do so and there was no explanation or explanation for it.",
      "text_tafsir": "Ayat ini merupakan jawaban dari semua itu, bahwa bukankah Allah yang berbuat demikian, berkuasa pula menghidupkan orang yang telah mati? Maksud pernyataan ini adalah apakah Zat yang menciptakan makhluk yang sempurna dari setetes air mani itu tidak sanggup mengembalikan orang yang sudah meninggal? Justru yang demikian itu lebih mudah bagi-Nya. Begitulah Allah menegaskan dalam firman-Nya:\n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. Dia memiliki sifat yang Mahatinggi di langit dan di bumi. Dan Dialah Yang Mahaperkasa, Mahabijaksana. (ar-Rum\/30: 27)\n\nDalam beberapa hadis disebutkan bahwa bila selesai membaca surah ini, Rasulullah saw berdoa:\n\nSelepas membaca Surah al-Qiyamah, Rasulullah memanjatkan doa, \"Subhanaka Allahumma wa bala (Maha Suci Engkau ya Allah dan Engkaulah yang Mahakuasa). (Riwayat Ibnu Mardawaih dari Abu Hurairah) \n\nDemikian pula bila selesai membaca Surah at-Tin, beliau berdoa:\n\nRasulullah bersabda: Siapa saja yang membaca Surah at-Tin sampai selesai, hendaklah ia berdoa, \"Bala wa'ana dhalikum minasy-syahidin (Ya , saya bersaksi atas hal tersebut). Dan siapa yang membaca Surah al-Qiyamah sampai akhir, hendaklah ia berdoa, \"Bala\" (ya, Engkaulah yang Mahakuasa). Dan siapa yang membaca Surah al-Mursalat hingga akhir, hendaklah ia berdoa, \"Amanna billahi (kami beriman kepada Allah). (Riwayat Ahmad, Abu Dawud, at-Tirmidhi, ibnu al-Mindhir, Ibnu Mardawaih, al-Baihaqi, dan disahihkan oleh al-hakim dari Abu Hurairah)\n\nDoa-doa di atas dibaca Rasulullah setelah membaca ayat-ayat seperti ini ketika di luar salat. Sedangkan ketika dalam salat, beliau tidak melakukannya dan tidak terdapat keterangan atau dalil tentang hal itu.",
      "text_translation": "Bukankah (Allah yang berbuat) demikian berkuasa (pula) menghidupkan orang mati?",
      "text": "اَلَيْسَ ذٰلِكَ بِقٰدِرٍ عَلٰٓى اَنْ يُّحْيِ َۧ الْمَوْتٰى ࣖ",
      "text_translation_en": "Is not He, then; able to bring the dead back to life?",
      "juz_number": 29
    }
  },
  "name": "القيٰمة",
  "name_translation_en": "The Resurrection",
  "name_translation": "Hari Kiamat",
  "name_latin": "Al-Qiyamah"
}