{
  "number": 77,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 50,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, God swore to the angels that spread the good. Al-Mursalat (angels sent) are the angels who are responsible for conveying the Divine favor or gift to a people or inflicting torture on other groups who deserve it. Some scholars interpret al-mursalat with a breeze that blows in every direction at the command of God to spread grace and favor to the world.",
      "text_tafsir": "Dalam ayat ini, Allah bersumpah dengan malaikat-malaikat yang menyebarkan kebaikan. Al-Mursalat (malaikat-malaikat yang diutus) adalah para malaikat yang bertugas untuk menyampaikan nikmat atau karunia Ilahi kepada suatu kaum atau mendatangkan siksaan kepada kelompok lain yang pantas menerimanya. Sebagian ulama mengartikan al-mursalat itu dengan angin yang bertiup terus-menerus ke segala arah atas perintah Tuhan untuk menyebarkan rahmat dan nikmat ke dunia ini.",
      "text_translation": "Demi (malaikat-malaikat) yang diutus untuk membawa kebaikan,",
      "text": "وَالْمُرْسَلٰتِ عُرْفًاۙ",
      "text_translation_en": "CONSIDER these [messages,] sent forth in waves",
      "juz_number": 29
    },
    "2": {
      "text_tafsir_en": "God also swears by the wind that blows in the wind. Others interpret al-'nature with angels as far away from error as strong winds that blow blowing dust or dust on rocks. Others interpret it as wind blowing rain.",
      "text_tafsir": "Allah juga bersumpah dengan angin yang bertiup dengan kencang. Ada pula yang mengartikan al-'asifat dengan malaikat-malaikat yang menjauhkan diri dari kebatilan sebagaimana halnya angin kencang yang berhembus meniup onggokan tanah atau debu di atas batu. Yang lain menafsirkannya dengan angin yang menyebarkan air hujan.",
      "text_translation": "dan (malaikat-malaikat) yang terbang dengan kencangnya,",
      "text": "فَالْعٰصِفٰتِ عَصْفًاۙ",
      "text_translation_en": "and then storming on with a tempest's force!",
      "juz_number": 29
    },
    "3": {
      "text_tafsir_en": "Then God swore to the angels who spread His grace in abundance. There are various interpretations of the word nasyirat here. Some interpret it as the angel who spreads death to the person who was pronounced dead without even knowing it. Some interpret it as an angel that spreads and enlists God's laws to all His prophets and apostles.",
      "text_tafsir": "Selanjutnya Allah bersumpah dengan malaikat-malaikat yang menyebarkan rahmat-Nya seluas-luasnya. Terdapat berbagai macam penafsiran tentang kata an-nasyirat di sini. Ada yang mengartikannya dengan malaikat yang menebarkan maut kepada orang yang ditetapkan kematiannya tanpa diketahui sedikit pun. Ada pula yang menafsirkannya dengan malaikat yang menebarkan dan meratakan syariat-syariat Allah kepada sekalian nabi dan rasul-Nya.",
      "text_translation": "dan (malaikat-malaikat) yang menyebarkan (rahmat Allah) dengan seluas-luasnya,",
      "text": "وَّالنّٰشِرٰتِ نَشْرًاۙ",
      "text_translation_en": "Consider these [messages] that spread [the truth] far and wide,",
      "juz_number": 29
    },
    "4": {
      "text_tafsir_en": "God also swore with the angels to distinguish between right and wrong, to distinguish between guidance and error. Some disbelievers interpret al-fariqat as the wind that can distinguish who brings mercy and who is in charge of harming many people. In other words, the wind of mercy and the wind of disaster.",
      "text_tafsir": "Allah bersumpah pula dengan para malaikat yang membedakan antara yang hak dengan yang batil dengan sejelas-jelasnya, membedakan antara petunjuk dan kesesatan.\n\nSebagian mufasir mengartikan al-fariqat dengan angin yang dapat membedakan mana yang membawa rahmat dan mana yang bertugas merusak manusia banyak. Dengan kata lain, angin pembawa rahmat dan angin pembawa bencana.",
      "text_translation": "dan (malaikat-malaikat) yang membedakan (antara yang baik dan yang buruk) dengan sejelas-jelasnya,",
      "text": "فَالْفٰرِقٰتِ فَرْقًاۙ",
      "text_translation_en": "thus separating [right and wrong] with all clarity,",
      "juz_number": 29
    },
    "5": {
      "text_tafsir_en": "In this verse, God swears by an angel who is responsible for bringing revelation to the prophets and apostles. However, as in previous verses, some interpret this al-mulqiyat with a wind that sends down the warning of God's disaster to mankind.",
      "text_tafsir": "Dalam ayat ini, Allah bersumpah dengan malaikat yang bertugas membawa wahyu kepada para nabi dan rasul. Akan tetapi, seperti pada ayat-ayat sebelumnya, ada yang mengartikan al-mulqiyat ini dengan angin yang menurunkan peringatan akan bencana Allah kepada manusia.",
      "text_translation": "dan (malaikat-malaikat) yang menyampaikan wahyu,",
      "text": "فَالْمُلْقِيٰتِ ذِكْرًاۙ",
      "text_translation_en": "and then giving forth a reminder,",
      "juz_number": 29
    },
    "6": {
      "text_tafsir_en": "In this verse it is stated that the coming of revelation to the prophets brought by angels was to give reasons to counter the unbelief of the Muslims to the day of resurrection, and to threaten them with painful torment when they disobeyed God's command.",
      "text_tafsir": "Dalam ayat ini ditegaskan bahwa kedatangan wahyu kepada para nabi yang dibawa oleh malaikat adalah untuk menyampaikan alasan guna membantah ketidakpercayaan orang musyrik kepada adanya hari kebangkitan, dan untuk mengancam mereka dengan azab yang pedih bila mereka membangkang perintah Tuhan.",
      "text_translation": "untuk menolak alasan-alasan atau memberi peringatan.",
      "text": "عُذْرًا اَوْ نُذْرًاۙ",
      "text_translation_en": "[promising] freedom from blame or [offering] a warning!",
      "juz_number": 29
    },
    "7": {
      "text_tafsir_en": "After swearing with some of His creatures above, in this verse, God emphasizes that what is promised to man will surely happen. The promise was the day of resurrection, the end of the resurrection, the resurrection of all living beings from the past, present, and future. All of this is according to the affirmation of this verse!",
      "text_tafsir": "Setelah bersumpah dengan beberapa macam makhluk-Nya di atas, maka dalam ayat ini, Allah menegaskan bahwa sesungguhnya apa yang telah dijanjikan kepada manusia itu pasti akan terjadi. Yang dijanjikan itu adalah datangnya hari kebangkitan, terjadinya kiamat, dihidupkannya kembali segala makhluk yang sudah mati sejak dahulu, sekarang, hingga yang akan datang dan dikumpulkan di Padang Mahsyar. Semuanya itu menurut penegasan ayat ini pasti akan terjadi!",
      "text_translation": "Sungguh, apa yang dijanjikan kepadamu pasti terjadi.",
      "text": "اِنَّمَا تُوْعَدُوْنَ لَوَاقِعٌۗ",
      "text_translation_en": "BEHOLD, all that you are told to expect will surely come to pass.",
      "juz_number": 29
    },
    "8": {
      "text_tafsir_en": "In this verse, God explains that at the time of the Day of Resurrection, the light of the stars was taken away because the source had been corrupted, as it says in another verse: And when the stars fall. (at-Takwir \/ 81: 2)",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa pada waktu kedatangan hari Kiamat itu, cahaya bintang-bintang telah dihilangkan karena sumbernya telah berantakan, sebagaimana tersebut dalam ayat lain:\n\nDan apabila bintang-bintang berjatuhan. (at-Takwir\/81: 2)",
      "text_translation": "Maka apabila bintang-bintang dihapuskan,",
      "text": "فَاِذَا النُّجُوْمُ طُمِسَتْۙ",
      "text_translation_en": "Thus, [it will come to pass] when the stars are effaced,",
      "juz_number": 29
    },
    "9": {
      "text_tafsir_en": "It was also said when the sky broke apart falling apart in pieces due to the occurrence of earthquake shocks that are very powerful due to objects colliding with each other sky. Thus a number of other verses tell the same thing, namely: And (remember) on the day (when) the sky broke out giving off a white fog and the angels were sent down (in waves). (al-Furqan \/ 25: 25)",
      "text_tafsir": "Dikatakan pula bila langit pecah hancur berantakan berkeping-keping karena terjadinya guncangan gempa yang sangat dahsyat akibat benda-benda langit beradu sesamanya. Demikianlah beberapa ayat lain menceritakan hal yang sama, yakni:\n\nDan (ingatlah) pada hari (ketika) langit pecah mengeluarkan kabut putih dan para malaikat diturunkan (secara) bergelombang. (al-Furqan\/25: 25)",
      "text_translation": "dan apabila langit terbelah,",
      "text": "وَاِذَا السَّمَاۤءُ فُرِجَتْۙ",
      "text_translation_en": "and when the sky is rent asunder,",
      "juz_number": 29
    },
    "10": {
      "text_tafsir_en": "This verse says that the mountains were crushed to dust. In another verse it is said that the coming of the Day of Judgment causes the mountains to flutter like cotton or feathers that are blown away or crushed to pieces. Allah's Word: And they ask you about the mountains, then say, \"My Lord will destroy it (on the Day of Resurrection).\" (thaha \/ 20: 105)",
      "text_tafsir": "Ayat ini menyebutkan bahwa gunung-gunung dihancurkan menjadi debu. Dalam ayat lain disebutkan kedatangan hari Kiamat menyebabkan gunung-gunung beterbangan bagaikan kapas atau bulu yang diterbangkan angin atau dihancurkan sehancur-hancurnya. Firman Allah: \n\nDan mereka bertanya kepadamu (Muhammad) tentang gunung-gunung, maka katakanlah, \"Tuhanku akan menghancurkannya (pada hari Kiamat) sehancur-hancurnya.\" (thaha\/20: 105)",
      "text_translation": "dan apabila gunung-gunung dihancurkan menjadi debu,",
      "text": "وَاِذَا الْجِبَالُ نُسِفَتْۙ",
      "text_translation_en": "and when the mountains are scattered like dust,",
      "juz_number": 29
    },
    "11": {
      "text_tafsir_en": "In this verse it is stated that with the coming of the Day of Judgment, the prophets and apostles are gathered together with their people. The purpose is for the prophet and the apostle to be given the opportunity to account for their prophetic and apostolic mission before God and his people as witnesses. And how, if We bring a witness from every people, and We bring you (Muhammad) as a witness against them. (Nisa '\/ 4: 41)",
      "text_tafsir": "Dalam ayat ini ditegaskan bahwa dengan kedatangan hari Kiamat, para nabi dan rasul dikumpulkan bersama-sama umat masing-masing. Tujuannya agar nabi dan rasul itu diberi kesempatan untuk mempertanggungjawabkan misi kenabian dan kerasulan mereka di hadapan Allah serta umatnya sebagai saksi. \n\nDan bagaimanakah (keadaan orang kafir nanti), jika Kami mendatangkan seorang saksi (Rasul) dari setiap umat dan Kami mendatangkan engkau (Muhammad) sebagai saksi atas mereka. (an-Nisa'\/4: 41)",
      "text_translation": "dan apabila rasul-rasul telah ditetapkan waktunya.",
      "text": "وَاِذَا الرُّسُلُ اُقِّتَتْۗ",
      "text_translation_en": "and when all the apostles are called together at a time appointed...",
      "juz_number": 29
    },
    "12": {
      "text_tafsir_en": "This verse argues that to what extent were the affairs of the people with their apostles suspended, that the unbelievers should be punished or humiliated, and instead believers would receive pleasure and protection from God? This verse is a threat to the seriousness of the problems faced by the people of that day, and the weight of human responsibility before God.",
      "text_tafsir": "Ayat ini menegaskan bahwa sampai kapankah urusan umat dengan rasul mereka ditangguhkan, sehingga yang kafir harus diazab atau mendapatkan kehinaan, dan sebaliknya yang beriman memperoleh kenikmatan dan pemeliharaan dari Allah? Ayat ini merupakan ancaman betapa hebatnya masalah-masalah yang dihadapi umat di hari itu, dan betapa beratnya tanggung jawab manusia di hadapan Allah kelak.",
      "text_translation": "(Niscaya dikatakan kepada mereka), “Sampai hari apakah ditangguhkan (azab orang-orang kafir itu)?”",
      "text": "لِاَيِّ يَوْمٍ اُجِّلَتْۗ",
      "text_translation_en": "For what day has the term [of all this] been set?",
      "juz_number": 29
    },
    "13": {
      "text_tafsir_en": "Then God explained that on that promised day He finished everything that was happening between the two beings. It was on that day that the Divine Court was able to judge everything justly. That is the day called Yaumul-Fasl (separation day).",
      "text_tafsir": "Kemudian Allah menerangkan bahwa pada hari yang dijanjikan itu Dia menyelesaikan segala perkara yang terjadi di antara sesama makhluk. Pada hari itulah tegaknya Mahkamah Ilahi yang mengadili segala perkara dengan seadil-adilnya. Itulah hari yang disebut Yaumul-Fasl (hari pemisah).",
      "text_translation": "Sampai hari keputusan.",
      "text": "لِيَوْمِ الْفَصْلِۚ",
      "text_translation_en": "For the Day of Distinction [between the true and the false]!",
      "juz_number": 29
    },
    "14": {
      "text_tafsir_en": "In this verse, God shows how terrible that day was in the form of a question to Prophet Muhammad, \"Do you know what a separation day is?\" What is the day when their people and apostles are gathered together?",
      "text_tafsir": "Dalam ayat ini, Allah menunjukkan betapa dahsyatnya hari itu dalam bentuk pertanyaan kepada Nabi Muhammad, \"Tahukah engkau apakah hari pemisah itu?\" Apakah hari saat umat dan rasul mereka masing-masing dikumpulkan?",
      "text_translation": "Dan tahukah kamu apakah hari ke-putusan itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا يَوْمُ الْفَصْلِۗ",
      "text_translation_en": "And what could make thee conceive what that Day of Distinction will be?",
      "juz_number": 29
    },
    "15": {
      "text_tafsir_en": "Then God himself explained the answer to the question mentioned in the verse above. On that day doom and humiliation come upon those who deny Allah and His Messenger and His holy book. The doom will be brought down to those who love to deny what the apostles have said and said. All unbelievers still doubt what Allah says. However, God will not break His promise. Another verse states: (On) the day (when) the earth will be replaced by another earth and (so) the heavens, and they (mankind) will gather (in the Field of Mercy) before the One True God, the Almighty. (Ibrahim \/ 14 :: 48)",
      "text_tafsir": "Kemudian Allah sendiri menjelaskan jawaban dari pertanyaan yang disebutkan dalam ayat di atas. Pada hari itu azab dan kehinaan menimpa orang-orang yang mendustakan Allah dan Rasul serta kitab suci yang diturunkan-Nya. Azab akan dijatuhkan kepada manusia yang suka mendustakan apa yang telah disampaikan dan diceritakan para rasul.\n\nSemua orang kafir masih ragu terhadap semua yang ditegaskan Allah. Akan tetapi, Allah tidak akan menyalahi janji-Nya. Ayat lain menegaskan:\n\n(Yaitu) pada hari (ketika) bumi diganti dengan bumi yang lain dan (demikian pula) langit, dan mereka (manusia) berkumpul (di Padang Mahsyar) menghadap Allah Yang Maha Esa, Mahaperkasa. (Ibrahim\/14:: 48)",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran).",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "Woe on that Day unto those who give the lie to the truth!",
      "juz_number": 29
    },
    "16": {
      "text_tafsir_en": "This verse begins with God's question, \"Do we not destroy those who have denied His Messenger before you?\" The history of the prophets and apostles and their people records that almost every nation that has obeyed God and His apostles has been destroyed with all kinds of torments one after another. Sometimes God destroys them with a flood like the fate of the people of Noah, when their land was drowned by God in floods. Some were swallowed up by the earth after it was hit by a terrible earthquake, just like the people of Lot. Others were attacked by a strong wind for 8 days and 7 nights, causing the death of all but the believers, the people of Prophet Saleh. That's the way it is. Such a question of Allah contains a subtle warning that the disbelieving man should go astray, for however, obeying the rules of Allah will not change. In this case, anyone who disbelieves either in the present or in the future will still suffer from his punishment. Therefore, people should be aware before any useless regret comes.",
      "text_tafsir": "Ayat ini dimulai dengan pertanyaan Allah, \"Apakah Kami tidak membinasakan orang-orang yang telah mendustakan rasul-Nya sebelum kamu?\" Sejarah para nabi dan rasul bersama kaumnya mencatat bahwa hampir setiap bangsa yang telah mendurhakai Allah dan rasul-Nya telah dibinasakan dengan berbagai macam azab yang satu dengan yang lainnya berbeda.\n\nTerkadang Allah menghancurkan mereka dengan banjir seperti nasib yang telah diderita oleh umat Nabi Nuh, ketika negeri mereka ditenggelamkan Allah dengan air bah. Ada yang ditelan binasa oleh bumi setelah negeri itu dilanda oleh gempa yang sangat hebat, seperti halnya umat Nabi Lut. Ada pula yang diserang angin kencang selama 8 hari 7 malam, yang menyebabkan seluruh penduduknya tewas, kecuali orang yang beriman, yakni umat Nabi Saleh. Begitulah seterusnya.\n\nPertanyaan Allah yang demikian mengandung suatu peringatan halus agar manusia yang masih kafir itu hendaknya mawas diri, sebab bagaimana pun juga sunatullah peraturan Allah yang berlaku tidak akan diubah. Dalam hal ini, siapa yang kafir baik dahulu maupun sekarang atau pada masa yang akan datang, tetap akan merasakan siksaan dari-Nya. Oleh karena itu, hendaklah manusia sadar sebelum datang penyesalan yang tiada berguna.",
      "text_translation": "Bukankah telah Kami binasakan orang-orang yang dahulu?",
      "text": "اَلَمْ نُهْلِكِ الْاَوَّلِيْنَۗ",
      "text_translation_en": "Did We not destroy [so many of] those [sinners] of olden days?",
      "juz_number": 29
    },
    "17": {
      "text_tafsir_en": "This verse states that the doom of Allah upon the nations of old has changed over time. One people perishes, there are other similar ones. At the same time they will perish if they do not learn from the history of their ancestors who obeyed Allah and His Messenger. With the downfall of the Qur'an, God warned the Meccans to challenge and reject the Prophet Muhammad and also to those who lived after him now and in the future. Humans should always learn from history, because history will come to itself.",
      "text_tafsir": "Ayat ini menyatakan bahwa azab Allah yang menimpa bangsa-bangsa dahulu kala itu silih berganti datangnya. Umat yang satu binasa, ada umat lain yang serupa. Pada saatnya mereka akan binasa pula bila tidak mau belajar dari sejarah nenek moyang mereka yang mendurhakai Allah dan rasul-Nya.\n\nDengan penurunan Al-Qur'an, Allah memperingatkan orang Mekah yang bersikap menantang dan mendustakan Nabi Muhammad dan juga kepada umat yang hidup sesudah beliau pada masa kini dan akan datang. Hendaklah umat manusia selalu belajar dari sejarah, karena sejarah itu akan datang mengulang dirinya.",
      "text_translation": "Lalu Kami susulkan (azab Kami terhadap) orang-orang yang datang kemudian.",
      "text": "ثُمَّ نُتْبِعُهُمُ الْاٰخِرِيْنَ ",
      "text_translation_en": "And We shall let them be followed by those of later times:",
      "juz_number": 29
    },
    "18": {
      "text_tafsir_en": "In this verse, God again emphasizes that what He did for the people in the past will be the same as He did for the people today. Because His Sunnah from that time to the present has remained the same, nothing will change. That's how He destroyed the sinners because of their deeds and attitudes.",
      "text_tafsir": "Dalam ayat ini, Allah sekali lagi menegaskan bahwa apa yang telah diperbuat-Nya terhadap umat dahulu akan sama saja dengan apa yang dilakukan-Nya terhadap umat sekarang. Sebab sunnah-Nya sejak dahulu sampai sekarang tetap sama, tidak akan berubah sedikit pun. Begitulah Dia telah menghancurkan orang-orang yang berdosa akibat perbuatan dan sikap mereka yang mendustai-Nya.",
      "text_translation": "Demikianlah Kami perlakukan orang-orang yang berdosa.",
      "text": "كَذٰلِكَ نَفْعَلُ بِالْمُجْرِمِيْنَ ",
      "text_translation_en": "[for] thus do We deal with such as are lost in sin.",
      "juz_number": 29
    },
    "19": {
      "text_tafsir_en": "This verse contains God's condemnation of those who deny Him and His prophets and apostles with the curse of \"Woe to those who deny\". The repetition of the oaths and criticisms contained in this Surah al-Mursalat, while intended to emphasize the meaning (ta'kid), also contains another meaning, that such criticism is not only practiced in the hereafter, but is also manifested in this world. Imam al-Qurthubi says the word wail is repeated in this chapter to indicate that for each nation that rejects Allah, there is a different torture to what other nations have accepted. Each of the ancient prophets who had been in rebellion had received different Divine torments from one another.",
      "text_tafsir": "Ayat ini berisi kecaman Allah terhadap orang-orang yang mendustakan-Nya serta para nabi dan rasul-Nya dengan kecaman \"celakalah orang yang mendustakan\".\n\nPengulangan sumpah dan kecaman yang terdapat dalam Surah al-Mursalat ini, di samping dimaksudkan untuk menegaskan arti (ta'kid), juga mengandung pengertian lain, yakni bahwa kecaman tersebut tidak hanya diberlakukan di akhirat, melainkan juga diperlihatkan-Nya di dunia ini.\n\nImam al-Qurthubi mengatakan kata wail diulang-ulang dalam surah ini untuk menunjukkan bahwa untuk masing-masing bangsa yang mendustakan Allah, diberikan siksaan yang berlainan dengan apa yang diterima oleh bangsa lain sebelumnya. Masing-masing umat nabi dahulu kala yang bersikap membangkang telah menerima siksaan Ilahi yang berlainan satu dengan lainnya.",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran).",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "Woe on that Day unto those who give the lie to the truth!",
      "juz_number": 29
    },
    "20": {
      "text_tafsir_en": "In this verse, Allah reminds us again with the question, \"Wasn't man made from a low drop of water?\" This despised water called sperm is stored in a sturdy place, the mother's womb. That's where the father's semen with the mother's egg cell mixes and follows the step-by-step process of events which is arranged very neatly and thoroughly by the Almighty. After sufficient time has been set, a human candidate is born in the form of a baby. The three verses above repeat again about the role of semen in human development. However, in this verse the uterus is specifically mentioned. For this reason, the emphasis of interpretation related to this verse is the womb. According to science, the uterus or uterus is a place where embryos and fetuses grow and develop, before being born in the form of an intact human child. The uterus is mentioned as a sturdy and safe place for several reasons, namely: 1. Its location is protected because it is located between the pelvic bones. It is held firmly on both sides by the muscles, which at the same time gives the uterus freedom to move and grow to several hundred times its previous size, at the peak of the uterus before giving birth. 2. At the time of pregnancy, a liquid called progesterone, or commonly referred to as the pregnancy hormone, is produced, which functions to lower the frequency of uterine contractions. 3. Embrio in the womb is surrounded by several layers of membranes that produce a liquid where the embryo is swimming in it. This prevents the embryo from being damaged by external impacts. There is one other verse that indicates the stages of development and security that the uterus offers to the fetus: ... He makes you in your mother's stomach event after event in three darkness. That which (does) is Allah, your Lord, the Lord of the kingdom. There is no god but Him; then why can you be turned away? (az-Zumar \/ 39: 6) Regarding the stages we have discussed before. As for the safety of the fetus in the womb, experts found a three-layer membrane (in the above paragraph mentioned with 'three darkness) that can secure the fetus while in the womb, namely: 1. The amniotic membrane layer containing fluid so that the fetus in swimming state. This condition protects the fetus if there is a collision from the outside. In addition, this swimming position provides an opportunity for the fetus to position themselves when they are born. 2. Chorion membrane layer 3. Decidua membrane layer Some researchers connect the three layers of darkness in the above paragraph with the amniotic membrane layer that surrounds the uterus, the uterine wall itself, and the abdominal wall in the abdomen.",
      "text_tafsir": "Pada ayat ini, Allah mengingatkan kembali dengan suatu pertanyaan, \"Tidakkah manusia itu dijadikan dari setetes air yang hina?\" Air yang hina yang disebut mani ini tersimpan dalam tempat yang kokoh yakni rahim ibu. Di situlah mani sang ayah dengan sel telur ibu bercampur dan mengikuti proses kejadian tahap demi tahap yang diatur dengan sangat rapi dan teliti oleh yang Mahakuasa. Setelah cukup waktu yang ditetapkan, maka lahirlah calon manusia itu dalam bentuk bayi.\n\nKetiga ayat di atas kembali mengulang mengenai peran air mani dalam perkembangan manusia. Namun, dalam ayat ini disebutkan rahim secara khusus. Untuk itu, tekanan interpretasi yang berkait dengan ayat ini adalah rahim.\n\nMenurut sains, rahim atau uterus adalah tempat dimana embrio dan janin tumbuh dan berkembang, sebelum dilahirkan dalam bentuk anak manusia yang utuh. Rahim disebutkan sebagai tempat yang kokoh dan aman karena beberapa hal, yaitu:\n\n1.Letaknya terlindung karena terletak di antara tulang panggul. Ia 'dipegang secara kuat di kedua sisinya oleh otot-otot, yang pada saat bersamaan memberikan kebebasan kepada rahim untuk bergerak dan tumbuh sampai beberapa ratus kali ukuran sebelumnya, pada saat puncak kandungan sebelum melahirkan.\n\n2.Pada saat kehamilan, dihasilkan suatu cairan yang dinamakan progesteron, atau biasa disebut sebagai hormon kehamilan, yang berfungsi untuk merendahkan frekuensi kontraksi rahim.\n\n3.Embrio yang ada di dalam rahim dikelilingi oleh beberapa lapisan membran yang menghasilkan suatu cairan dimana embrio itu berenang di dalamnya. Hal ini menjaga embrio dari kemungkinan rusak akibat benturan dari luar.\n\nAda satu ayat lain yang mengindikasikan tahapan-tahapan pengembangan dan keamanan yang ditawarkan rahim kepada janin:\n\n... Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian dalam tiga kegelapan. Yang (berbuat) demikian itu adalah Allah, Tuhan kamu, Tuhan yang memiliki kerajaan. Tidak ada tuhan selain Dia; maka mengapa kamu dapat dipalingkan? (az-Zumar\/39: 6)\n\nMengenai tahapan-tahapan sudah kita bahas di depan. Sedangkan mengenai keamanan janin di dalam rahim, para ahli menemukan adanya tiga lapis membran (di dalam ayat di atas disebutkan dengan 'tiga kegelapan) yang dapat mengamankan janin selama berada di dalam rahim, yaitu:\n\n1.Lapisan membran amnion yang mengandung cairan sehingga janin dalam keadaan berenang. Kondisi demikian ini melindungi janin apabila ada benturan dari luar. Di samping itu, posisi berenang ini memberikan kesempatan kepada janin dalam memposisikan diri saat akan dilahirkan.\n\n2.Lapisan membran chorion\n\n3.Lapisan membran decidua\n\nBeberapa peneliti menghubungkan tiga lapisan kegelapan dalam ayat di atas dengan lapisan membran amniotik yang mengelilingi rahim, dinding rahim itu sendiri, dan dinding abdomen di bagian perut.",
      "text_translation": "Bukankah Kami menciptakan kamu dari air yang hina (mani),",
      "text": "اَلَمْ نَخْلُقْكُّمْ مِّنْ مَّاۤءٍ مَّهِيْنٍۙ",
      "text_translation_en": "Did We not create you out of a humble fluid",
      "juz_number": 29
    },
    "21": {
      "text_tafsir_en": "In this verse, Allah reminds us again with the question, \"Wasn't man made from a low drop of water?\" This despised water called sperm is stored in a sturdy place, the mother's womb. That's where the father's semen with the mother's egg cell mixes and follows the step-by-step process of events which is arranged very neatly and thoroughly by the Almighty. After sufficient time has been set, a human candidate is born in the form of a baby. The three verses above repeat again about the role of semen in human development. However, in this verse the uterus is specifically mentioned. For this reason, the emphasis of interpretation related to this verse is the womb. According to science, the uterus or uterus is a place where embryos and fetuses grow and develop, before being born in the form of an intact human child. The uterus is mentioned as a sturdy and safe place for several reasons, namely: 1. Its location is protected because it is located between the pelvic bones. It is held firmly on both sides by the muscles, which at the same time gives the uterus freedom to move and grow to several hundred times its previous size, at the peak of the uterus before giving birth. 2. At the time of pregnancy, a liquid called progesterone, or commonly referred to as the pregnancy hormone, is produced, which functions to lower the frequency of uterine contractions. 3. Embrio in the womb is surrounded by several layers of membranes that produce a liquid where the embryo is swimming in it. This prevents the embryo from being damaged by external impacts. There is one other verse that indicates the stages of development and security that the uterus offers to the fetus: ... He makes you in your mother's stomach event after event in three darkness. That which (does) is Allah, your Lord, the Lord of the kingdom. There is no god but Him; then why can you be turned away? (az-Zumar \/ 39: 6) Regarding the stages we have discussed before. As for the safety of the fetus in the womb, experts found a three-layer membrane (in the above paragraph mentioned with 'three darkness) that can secure the fetus while in the womb, namely: 1. The amniotic membrane layer containing fluid so that the fetus in swimming state. This condition protects the fetus if there is a collision from the outside. In addition, this swimming position provides an opportunity for the fetus to position themselves when they are born. 2. Chorion membrane layer 3. Decidua membrane layer Some researchers connect the three layers of darkness in the above paragraph with the amniotic membrane layer that surrounds the uterus, the uterine wall itself, and the abdominal wall in the abdomen.",
      "text_tafsir": "Pada ayat ini, Allah mengingatkan kembali dengan suatu pertanyaan, \"Tidakkah manusia itu dijadikan dari setetes air yang hina?\" Air yang hina yang disebut mani ini tersimpan dalam tempat yang kokoh yakni rahim ibu. Di situlah mani sang ayah dengan sel telur ibu bercampur dan mengikuti proses kejadian tahap demi tahap yang diatur dengan sangat rapi dan teliti oleh yang Mahakuasa. Setelah cukup waktu yang ditetapkan, maka lahirlah calon manusia itu dalam bentuk bayi.\n\nKetiga ayat di atas kembali mengulang mengenai peran air mani dalam perkembangan manusia. Namun, dalam ayat ini disebutkan rahim secara khusus. Untuk itu, tekanan interpretasi yang berkait dengan ayat ini adalah rahim.\n\nMenurut sains, rahim atau uterus adalah tempat dimana embrio dan janin tumbuh dan berkembang, sebelum dilahirkan dalam bentuk anak manusia yang utuh. Rahim disebutkan sebagai tempat yang kokoh dan aman karena beberapa hal, yaitu:\n\n1.Letaknya terlindung karena terletak di antara tulang panggul. Ia 'dipegang secara kuat di kedua sisinya oleh otot-otot, yang pada saat bersamaan memberikan kebebasan kepada rahim untuk bergerak dan tumbuh sampai beberapa ratus kali ukuran sebelumnya, pada saat puncak kandungan sebelum melahirkan.\n\n2.Pada saat kehamilan, dihasilkan suatu cairan yang dinamakan progesteron, atau biasa disebut sebagai hormon kehamilan, yang berfungsi untuk merendahkan frekuensi kontraksi rahim.\n\n3.Embrio yang ada di dalam rahim dikelilingi oleh beberapa lapisan membran yang menghasilkan suatu cairan dimana embrio itu berenang di dalamnya. Hal ini menjaga embrio dari kemungkinan rusak akibat benturan dari luar.\n\nAda satu ayat lain yang mengindikasikan tahapan-tahapan pengembangan dan keamanan yang ditawarkan rahim kepada janin:\n\n... Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian dalam tiga kegelapan. Yang (berbuat) demikian itu adalah Allah, Tuhan kamu, Tuhan yang memiliki kerajaan. Tidak ada tuhan selain Dia; maka mengapa kamu dapat dipalingkan? (az-Zumar\/39: 6)\n\nMengenai tahapan-tahapan sudah kita bahas di depan. Sedangkan mengenai keamanan janin di dalam rahim, para ahli menemukan adanya tiga lapis membran (di dalam ayat di atas disebutkan dengan 'tiga kegelapan) yang dapat mengamankan janin selama berada di dalam rahim, yaitu:\n\n1.Lapisan membran amnion yang mengandung cairan sehingga janin dalam keadaan berenang. Kondisi demikian ini melindungi janin apabila ada benturan dari luar. Di samping itu, posisi berenang ini memberikan kesempatan kepada janin dalam memposisikan diri saat akan dilahirkan.\n\n2.Lapisan membran chorion\n\n3.Lapisan membran decidua\n\nBeberapa peneliti menghubungkan tiga lapisan kegelapan dalam ayat di atas dengan lapisan membran amniotik yang mengelilingi rahim, dinding rahim itu sendiri, dan dinding abdomen di bagian perut.",
      "text_translation": "kemudian Kami letakkan ia dalam tempat yang kokoh (rahim),",
      "text": "فَجَعَلْنٰهُ فِيْ قَرَارٍ مَّكِيْنٍ",
      "text_translation_en": "which We then let remain in [the womb's] firm keeping",
      "juz_number": 29
    },
    "22": {
      "text_tafsir_en": "In this verse, Allah reminds us again with the question, \"Wasn't man made from a low drop of water?\" This despised water called sperm is stored in a sturdy place, the mother's womb. That's where the father's semen with the mother's egg cell mixes and follows the step-by-step process of events which is arranged very neatly and thoroughly by the Almighty. After sufficient time has been set, a human candidate is born in the form of a baby. The three verses above repeat again about the role of semen in human development. However, in this verse the uterus is specifically mentioned. For this reason, the emphasis of interpretation related to this verse is the womb. According to science, the uterus or uterus is a place where embryos and fetuses grow and develop, before being born in the form of an intact human child. The uterus is mentioned as a sturdy and safe place for several reasons, namely: 1. Its location is protected because it is located between the pelvic bones. It is held firmly on both sides by the muscles, which at the same time gives the uterus freedom to move and grow to several hundred times its previous size, at the peak of the uterus before giving birth. 2. At the time of pregnancy, a liquid called progesterone, or commonly referred to as the pregnancy hormone, is produced, which functions to lower the frequency of uterine contractions. 3. Embrio in the womb is surrounded by several layers of membranes that produce a liquid where the embryo is swimming in it. This prevents the embryo from being damaged by external impacts. There is one other verse that indicates the stages of development and security that the uterus offers to the fetus: ... He makes you in your mother's stomach event after event in three darkness. That which (does) is Allah, your Lord, the Lord of the kingdom. There is no god but Him; then why can you be turned away? (az-Zumar \/ 39: 6) Regarding the stages we have discussed before. As for the safety of the fetus in the womb, experts found a three-layer membrane (in the above paragraph mentioned with 'three darkness) that can secure the fetus while in the womb, namely: 1. The amniotic membrane layer containing fluid so that the fetus in swimming state. This condition protects the fetus if there is a collision from the outside. In addition, this swimming position provides an opportunity for the fetus to position themselves when they are born. 2. Chorion membrane layer 3. Decidua membrane layer Some researchers connect the three layers of darkness in the above paragraph with the amniotic membrane layer that surrounds the uterus, the uterine wall itself, and the abdominal wall in the abdomen.",
      "text_tafsir": "Pada ayat ini, Allah mengingatkan kembali dengan suatu pertanyaan, \"Tidakkah manusia itu dijadikan dari setetes air yang hina?\" Air yang hina yang disebut mani ini tersimpan dalam tempat yang kokoh yakni rahim ibu. Di situlah mani sang ayah dengan sel telur ibu bercampur dan mengikuti proses kejadian tahap demi tahap yang diatur dengan sangat rapi dan teliti oleh yang Mahakuasa. Setelah cukup waktu yang ditetapkan, maka lahirlah calon manusia itu dalam bentuk bayi.\n\nKetiga ayat di atas kembali mengulang mengenai peran air mani dalam perkembangan manusia. Namun, dalam ayat ini disebutkan rahim secara khusus. Untuk itu, tekanan interpretasi yang berkait dengan ayat ini adalah rahim.\n\nMenurut sains, rahim atau uterus adalah tempat dimana embrio dan janin tumbuh dan berkembang, sebelum dilahirkan dalam bentuk anak manusia yang utuh. Rahim disebutkan sebagai tempat yang kokoh dan aman karena beberapa hal, yaitu:\n\n1.Letaknya terlindung karena terletak di antara tulang panggul. Ia 'dipegang secara kuat di kedua sisinya oleh otot-otot, yang pada saat bersamaan memberikan kebebasan kepada rahim untuk bergerak dan tumbuh sampai beberapa ratus kali ukuran sebelumnya, pada saat puncak kandungan sebelum melahirkan.\n\n2.Pada saat kehamilan, dihasilkan suatu cairan yang dinamakan progesteron, atau biasa disebut sebagai hormon kehamilan, yang berfungsi untuk merendahkan frekuensi kontraksi rahim.\n\n3.Embrio yang ada di dalam rahim dikelilingi oleh beberapa lapisan membran yang menghasilkan suatu cairan dimana embrio itu berenang di dalamnya. Hal ini menjaga embrio dari kemungkinan rusak akibat benturan dari luar.\n\nAda satu ayat lain yang mengindikasikan tahapan-tahapan pengembangan dan keamanan yang ditawarkan rahim kepada janin:\n\n... Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian dalam tiga kegelapan. Yang (berbuat) demikian itu adalah Allah, Tuhan kamu, Tuhan yang memiliki kerajaan. Tidak ada tuhan selain Dia; maka mengapa kamu dapat dipalingkan? (az-Zumar\/39: 6)\n\nMengenai tahapan-tahapan sudah kita bahas di depan. Sedangkan mengenai keamanan janin di dalam rahim, para ahli menemukan adanya tiga lapis membran (di dalam ayat di atas disebutkan dengan 'tiga kegelapan) yang dapat mengamankan janin selama berada di dalam rahim, yaitu:\n\n1.Lapisan membran amnion yang mengandung cairan sehingga janin dalam keadaan berenang. Kondisi demikian ini melindungi janin apabila ada benturan dari luar. Di samping itu, posisi berenang ini memberikan kesempatan kepada janin dalam memposisikan diri saat akan dilahirkan.\n\n2.Lapisan membran chorion\n\n3.Lapisan membran decidua\n\nBeberapa peneliti menghubungkan tiga lapisan kegelapan dalam ayat di atas dengan lapisan membran amniotik yang mengelilingi rahim, dinding rahim itu sendiri, dan dinding abdomen di bagian perut.",
      "text_translation": "sampai waktu yang ditentukan,",
      "text": "اِلٰى قَدَرٍ مَّعْلُوْمٍۙ",
      "text_translation_en": "for a term pre-ordained?",
      "juz_number": 29
    },
    "23": {
      "text_tafsir_en": "In the matter of regulating and determining the length of time the child is \"stored\" in the womb and then determining if he must be born as a perfect child into this realm, is only God's business. Humans may know through their minds, but the matter of the arrangement remains in the hands of the Almighty. Regarding this problem, God emphasized that He was the best in determining. How precise, beautiful and harmonious the human event that He created can be compared, for example, with the shape and appearance of animals. Even though the types of animal creatures are nothing defective or awkward according to our vision, but the creation and composition of the anatomy of the human body remains far more perfect, beautiful, and attractive, compared to all living things. By meditating on that, then we conclude that indeed God is the best to determine. This verse contains an invitation for humans to think and infer their attitude towards the substance that makes it. Is it not proper for humans to be grateful and thank Him? Is it not proper for humans to abandon their disobedience and stubbornness after fully realizing how loving God is, and how God has guided this life by sending His apostles to teach the teachings of His Oneness?",
      "text_tafsir": "Dalam urusan mengatur dan menetapkan masa lamanya si anak \"tersimpan\" dalam rahim itu dan kemudian menetapkan bila dia harus lahir sebagai anak yang sempurna ke alam ini, adalah urusan Allah semata. Manusia boleh mengetahui lewat pikirannya, namun soal pengaturannya tetaplah di tangan Yang Mahakuasa. Terhadap soal ini, Allah menegaskan bahwa Dialah sebaik-baiknya yang menentukan.\n\nBetapa tepat, indah, dan harmonis kejadian manusia yang diciptakan-Nya itu dapat kita bandingkan, umpamanya, dengan bentuk dan rupa hewan. Sekalipun jenis makhluk hewan itu tidak ada yang cacat maupun yang janggal menurut penglihatan kita, namun ciptaan dan susunan anatomi tubuh manusia tetap jauh lebih sempurna, indah, dan menarik, dibandingkan dengan segala makhluk hidup yang ada. Dengan merenungkan hal itu, barulah kita menyimpulkan bahwa memang Tuhanlah yang sebaik-baik menentukan.\n\nAyat ini mengandung ajakan bagi manusia untuk berpikir dan menyimpulkan sikap hidupnya terhadap Zat yang menjadikan itu. Apakah tidak patut manusia bersyukur dan berterima kasih kepada-Nya? Apakah tidak selayaknya kalau manusia menanggalkan sikap ingkar dan keras kepalanya setelah ia menyadari sepenuhnya betapa kasih sayang Allah, dan betapa Allah telah membimbing kehidupan ini dengan mengirim rasul-Nya guna mengajarkan ajaran tentang keesaan-Nya?",
      "text_translation": "lalu Kami tentukan (bentuknya), maka (Kamilah) sebaik-baik yang menentukan.",
      "text": "فَقَدَرْنَاۖ فَنِعْمَ الْقٰدِرُوْنَ ",
      "text_translation_en": "Thus have We determined [the nature of man's creation]: and excellent indeed is Our power to determine [what is to be]!",
      "juz_number": 29
    },
    "24": {
      "text_tafsir_en": "In this verse, God explains that in spite of all this, it is true that man does not want to change his character and character, but is a curse of the curse, and moreover seeks to evoke that Divine truth by associating him with other creatures of His creation, and completely unsure of the Day of Resurrection, the day that man receives a reward for his good deeds, the Lord threatens the second time, \"Woe to that day for those who deny it!\"",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa terlepas dari semua itu kalau memang manusia tak mau mengubah tabiat dan karakternya, tetap saja kafir laknat, dan lebih dari itu juga berusaha merongrong kewibawaan Ilahi itu dengan mempersekutukan-Nya dengan makhluk lain ciptaan-Nya, dan sama sekali tidak yakin adanya hari kebangkitan, hari manusia menerima ganjaran amal perbuatan baiknya, maka Tuhan mengancam untuk kedua kalinya, \"Celaka besarlah pada hari itu bagi orang-orang yang mendustakan.\"",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran).",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "Woe, on that Day unto those who give the lie to the truth!",
      "juz_number": 29
    },
    "25": {
      "text_tafsir_en": "After mentioning various forms of His favors around the process of human events, then in this verse, God invites people to pay close attention to His favors that are on this horizon. This was revealed by God with the sentence question, \"Didn't We have created a vast and spread-out earth as a gathering place and a place to live together for a living. Scientifically, this planet and its atmosphere has been created by God correctly and precisely. Our earth and the atmosphere contains substances or materials that support the existence of life processes, including the presence of nitrogen gas (N2) which is not harmful to living things, but is very necessary for the emergence of a life process, and oxygen gas (O2), which is needed in the survival of all living beings, therefore, on earth all life is gathered (for more details see the Qur'an and its interpretation Volume 5 Surah Ibrahim \/ 14: 19).",
      "text_tafsir": "Setelah menyebutkan berbagai rupa nikmat-Nya di sekitar proses kejadian manusia, maka dalam ayat ini, Allah mengajak manusia memperhatikan dengan seksama terhadap nikmat-Nya yang ada di cakrawala ini. Hal ini diungkapkan Allah dengan kalimat pertanyaan, \"Bukankah Kami telah menciptakan bumi yang terhampar dan terbentang begitu luas sebagai tempat berkumpul dan tempat hidup bersama-sama mencari penghidupan.\n\nSecara saintifik, planet bumi ini beserta atmosfernya telah diciptakan Allah dengan benar dan tepat. Bumi kita dan atmosfernya mengandung substansi atau materi yang mendukung adanya proses kehidupan, antara lain adanya gas nitrogen (N2) yang tak berbahaya bagi makhluk hidup, namun sangat dibutuhkan untuk timbulnya suatu proses kehidupan, dan gas oksigen (O2), yang sangat dibutuhkan dalam kelangsungan kehidupan semua makhluk hidup. Oleh sebab itu, di bumi semua kehidupan berkumpul (lebih detail lihat Al-Qur'an dan Tafsirnya Jilid 5 Surah Ibrahim\/14:19).",
      "text_translation": "Bukankah Kami jadikan bumi untuk (tempat) berkumpul,",
      "text": "اَلَمْ نَجْعَلِ الْاَرْضَ كِفَاتًاۙ",
      "text_translation_en": "Have We not caused the earth to hold within itself",
      "juz_number": 29
    },
    "26": {
      "text_tafsir_en": "The usefulness of the earth was created and the gathering place was not only for the living who lived on its surface, but also for those who had died to be buried in their stomachs. That is why the earth is said for people who are still alive and who have died. Kifat in Arabic means the grave of the deceased and the home of the living. According to scientists, the upper part of the earth is the plates of the earth's crust that interact with each other and cause deformation of the earth's crust, which, among others, is manifested by the formation of mountains, volcanoes and earthquakes. High mountains participate in the hydrological cycle where water is finally deposited on land and becomes a source of human drinking water and other life.",
      "text_tafsir": "Kegunaan bumi diciptakan terhampar dan tempat berkumpul bukan saja untuk yang masih hidup yang tinggal di atas permukaannya, melainkan juga bagi yang telah meninggal dunia untuk dikuburkan dalam perutnya. Itulah sebabnya dikatakan bumi untuk orang yang masih hidup dan yang sudah meninggal. Kifat dalam bahasa Arab berarti kuburan bagi yang meninggal dan rumah bagi yang masih hidup.\n\nMenurut para ilmuwan, bagian atas bumi merupakan lempengan-lempengan kulit bumi yang saling berinteraksi satu sama lain dan mengakibatkan terjadinya deformasi kerak bumi yang antara lain dimanifestasikan dengan pembentukan pegunungan, gunung api dan gempa bumi. Pegunungan-pegunungan yang tinggi ikut serta dalam siklus hidrologi dimana air akhirnya tersimpan di daratan dan menjadi sumber air minum manusia dan kehidupan lainnya.",
      "text_translation": "bagi yang masih hidup dan yang sudah mati?",
      "text": "اَحْيَاۤءً وَّاَمْوَاتًاۙ",
      "text_translation_en": "the living and the dead?",
      "juz_number": 29
    },
    "27": {
      "text_tafsir_en": "In addition, God directs the human attention to the purpose of creating a mountain that rises high from the surface of the earth. It is said to be a cliff and thus, people feel at ease living on the earth. It is the mountain that serves as a pillar for maintaining the balance of the earth. Occasionally some of the bodies of the mountains are submerged in land or in seas or rivers. Then God asks people to think about the fresh water they drink every day, as a gift from Him. He is the one who according to this verse gives drink. Sometimes the water is poured down from the sky brought by rain that comes from clouds or melting snow and sometimes it flows from streams or springs from springs, under cracks or mountains, and so on.",
      "text_tafsir": "Selain itu, Allah juga mengarahkan perhatian manusia kepada tujuan penciptaan gunung yang menjulang tinggi dari permukaan bumi. Ia dikatakan sebagai pasak bumi dan dengan demikian, manusia merasa tenteram tinggal di bumi. Gunung itulah yang bertugas sebagai pasak tiang untuk menjaga keseimbangan bumi tersebut. Terkadang sebagian badan gunung-gunung itu terbenam dalam tanah atau dalam laut maupun sungai-sungai.\n\nSelanjutnya Allah mengajak manusia memikirkan tentang air tawar yang diminum setiap hari, sebagai anugerah dari-Nya. Dialah yang menurut ayat ini memberikan minum. Terkadang air itu tercurah dari langit yang dibawa hujan yang berasal dari gumpalan awan atau dari salju mencair dan adakalanya pula mengalir dari anak-anak sungai atau memancar dari mata air, di bawah celah-celah gunung maupun di pinggir kali, dan sebagainya.",
      "text_translation": "Dan Kami jadikan padanya gunung-gunung yang tinggi, dan Kami beri minum kamu dengan air tawar?",
      "text": "وَّجَعَلْنَا فِيْهَا رَوَاسِيَ شٰمِخٰتٍ وَّاَسْقَيْنٰكُمْ مَّاۤءً فُرَاتًاۗ",
      "text_translation_en": "and have We not set on it proud, firm mountains, and given you sweet water to drink?",
      "juz_number": 29
    },
    "28": {
      "text_tafsir_en": "Therefore, for those who still deny the favor of God it is the curse of this verse, \"Woe to that day for those who deny it.\"",
      "text_tafsir": "Oleh karena itu, bagi siapa yang masih mendustakan nikmat Allah itu terkena oleh kutukan ayat ini, \"Celaka besarlah pada hari itu bagi orang-orang yang mendustakan.\"",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran).",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "Woe on that Day unto those who give the lie to the truth!",
      "juz_number": 29
    },
    "29": {
      "text_tafsir_en": "In this verse, God explains that the unfortunate people who are to be cast into Hell will be rebuked by the guardian angels with a loud voice that they will go to the torment and torment that they had denied while in the world.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa orang-orang yang bernasib malang yang hendak dimasukkan ke dalam neraka Jahanam, akan ditegur oleh malaikat penjaga dengan suara keras agar mereka pergi kepada azab dan siksaan yang didustakan ketika masih di dunia dahulu.",
      "text_translation": "(Akan dikatakan), “Pergilah kamu mendapatkan apa (azab) yang dahulu kamu dustakan.",
      "text": "اِنْطَلِقُوْٓا اِلٰى مَا كُنْتُمْ بِهٖ تُكَذِّبُوْنَۚ",
      "text_translation_en": "GO ON towards that [resurrection] which you were wont to call a lie!",
      "juz_number": 29
    },
    "30": {
      "text_tafsir_en": "The smoke fog is three-dimensional. One section on the right, one branch on the left, and the third on their shoulders, so that they are encircled in it and cannot go out again. In another verse, God says: \"We have prepared a hell for the unjust, and they have besieged it. (al-Kahf \/ 18: 29)",
      "text_tafsir": "Gumpalan asap neraka itu bercabang tiga. Satu bagian di sebelah kanan, satu cabang di kiri, dan yang ketiga di atas pundak mereka, sehingga mereka terkepung di dalamnya dan tidak dapat keluar lagi. Di dalam ayat yang lain, Allah berfirman:\n\nSesungguhnya Kami telah menyediakan neraka bagi orang zalim, yang gejolaknya mengepung mereka. (al-Kahf\/18: 29)",
      "text_translation": "Pergilah kamu mendapatkan naungan (asap api neraka) yang mempunyai tiga cabang, ",
      "text": "اِنْطَلِقُوْٓا اِلٰى ظِلٍّ ذِيْ ثَلٰثِ شُعَبٍ ",
      "text_translation_en": "Go on towards the threefold shadow",
      "juz_number": 29
    },
    "31": {
      "text_tafsir_en": "God says in this verse that even the hell is said to have protection but not to protect them from the heat of hell fire. There is no place to rest and a place to rest from the heat. It is also emphasized here that their protection is not as secure as a believer, for no one can protect them from the fiery heat of hell fire. The other verse describes: (They) in the heat of very hot wind and boiling water, and in the shade of black smoke, not cold and unpleasant. (al-Waqi'ah \/ 56: 42-44)",
      "text_tafsir": "Allah mengatakan dalam ayat ini bahwa biarpun neraka itu disebutkan punya lindungan namun bukan melindungi mereka dari panasnya api neraka. Tidak ada tempat beristirahat dan tempat berteduh dari kepanasan. Ditegaskan pula di sini bahwa lindungan mereka bukan lindungan seperti yang diperoleh seorang mukmin, karena tidak ada yang dapat menaungi mereka dari panas gejolak api neraka.\n\nAyat lain menerangkan:\n\n(Mereka) dalam siksaan angin yang sangat panas dan air yang mendidih, dan naungan asap yang hitam, tidak sejuk dan tidak menyenangkan. (al-Waqi'ah\/56: 42-44)",
      "text_translation": "yang tidak melindungi dan tidak pula menolak nyala api neraka.” ",
      "text": "لَا ظَلِيْلٍ وَّلَا يُغْنِيْ مِنَ اللَّهَبِۗ",
      "text_translation_en": "that will offer no [cooling] shade and will be of no avail against the flame",
      "juz_number": 29
    },
    "32": {
      "text_tafsir_en": "Allah also mentioned that hell always cast fireworks as high and as high as the palace around the corner. God equated the fiery hell of Hell with a very large yellow camel and moved fast. God repeated the threat of accidents to people who refused because they could not avoid the terrible torture.",
      "text_tafsir": "Allah menyebutkan pula bahwa neraka itu selalu melontarkan bunga api sebesar dan setinggi istana ke seluruh penjuru. Allah mengumpamakan gejolak api neraka Jahanam yang sangat dahsyat itu dengan unta kuning yang sangat banyak dan bergerak cepat. Allah mengulangi lagi ancamannya bahwa kecelakaan bagi orang yang mendustakan karena mereka tidak dapat mengelakkan diri dari siksaan yang begitu hebat.",
      "text_translation": "Sungguh, (neraka) itu menyemburkan bunga api (sebesar dan setinggi) istana, ",
      "text": "اِنَّهَا تَرْمِيْ بِشَرَرٍ كَالْقَصْرِۚ",
      "text_translation_en": "which – behold!- will throw up sparks like [burning] logs,",
      "juz_number": 29
    },
    "33": {
      "text_tafsir_en": "Allah also mentioned that hell always cast fireworks as high and as high as the palace around the corner. God equated the fiery hell of Hell with a very large yellow camel and moved fast. God repeated the threat of accidents to people who refused because they could not avoid the terrible torture.",
      "text_tafsir": "Allah menyebutkan pula bahwa neraka itu selalu melontarkan bunga api sebesar dan setinggi istana ke seluruh penjuru. Allah mengumpamakan gejolak api neraka Jahanam yang sangat dahsyat itu dengan unta kuning yang sangat banyak dan bergerak cepat. Allah mengulangi lagi ancamannya bahwa kecelakaan bagi orang yang mendustakan karena mereka tidak dapat mengelakkan diri dari siksaan yang begitu hebat.",
      "text_translation": "seakan-akan iring-iringan unta yang kuning.",
      "text": "كَاَنَّهٗ جِمٰلَتٌ صُفْرٌۗ",
      "text_translation_en": "like giant fiery ropes!",
      "juz_number": 29
    },
    "34": {
      "text_tafsir_en": "Allah also mentioned that hell always cast fireworks as high and as high as the palace around the corner. God equated the fiery hell of Hell with a very large yellow camel and moved fast. God repeated the threat of accidents to people who refused because they could not avoid the terrible torture.",
      "text_tafsir": "Allah menyebutkan pula bahwa neraka itu selalu melontarkan bunga api sebesar dan setinggi istana ke seluruh penjuru. Allah mengumpamakan gejolak api neraka Jahanam yang sangat dahsyat itu dengan unta kuning yang sangat banyak dan bergerak cepat. Allah mengulangi lagi ancamannya bahwa kecelakaan bagi orang yang mendustakan karena mereka tidak dapat mengelakkan diri dari siksaan yang begitu hebat.",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran). ",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "Woe on that Day unto those who give the lie to the truth –",
      "juz_number": 29
    },
    "35": {
      "text_tafsir_en": "In this verse, Allah explains that on that day man cannot speak and is simply amazed by the severity of the situation. They are not allowed to speak, and even if it is permitted, it is useless.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa pada hari itu manusia tidak bisa berbicara dan hanya terpukau karena kedahsyatan keadaan. Mereka tidak diizinkan berbicara, dan andaikata diizinkan pun, hal itu tidak ada gunanya.",
      "text_translation": "Inilah hari, saat mereka tidak dapat berbicara, ",
      "text": "هٰذَا يَوْمُ لَا يَنْطِقُوْنَۙ",
      "text_translation_en": "that Day on which they will not [be able to] utter a word,",
      "juz_number": 29
    },
    "36": {
      "text_tafsir_en": "Allah further explained that they were not permitted to ask for pity, because that day was not a day of self-defense, but a day of acceptance. They can complain and regret their fate, but to file a rebuttal is no longer possible because God's decision cannot be contested. In Surah al-An'am \/ 6:23, the polytheists on that day stated that they did not want the polytheists any more. In Surah an-Nisa '\/ 4: 42 it is stated that they cannot hide their speech, and in the verses az-Zumar \/ 39: 31 it is mentioned that they disbelieve in the face of Allah, accuse each other, and blame one another.",
      "text_tafsir": "Allah selanjutnya menerangkan bahwa mereka tidak diizinkan untuk minta uzur, sebab hari itu bukanlah hari pembelaan diri, tetapi hari untuk menerima keputusan. Mereka dapat mengeluh dan menyesali nasib, namun untuk mengajukan sanggahan tidak mungkin lagi karena keputusan Allah tidak dapat diganggu gugat. Dalam Surah al-An'am\/6: 23, orang musyrik di hari itu menyatakan bahwa mereka tidak mau musyrik lagi. Pada Surah an-Nisa'\/4: 42 disebutkan bahwa mereka tidak bisa menyembunyikan pembicaraannya, dan dalam ayat az-Zumar\/39: 31 disebutkan mereka orang-orang kafir berdebat di muka Allah, saling menuduh, dan saling menyalahkan.",
      "text_translation": "dan tidak diizinkan kepada mereka mengemukakan alasan agar mereka dimaafkan. ",
      "text": "وَلَا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُوْنَ ",
      "text_translation_en": "nor be allowed to proffer excuses!",
      "juz_number": 29
    },
    "37": {
      "text_tafsir_en": "In this verse, Allah repeats His threat that a major accident on that day will be for the believer. Because the apostle had invited them to believe and threaten by warning them with the impending doom they were facing. Unfortunately they did not want to accept and listen to the invitation.",
      "text_tafsir": "Dalam ayat ini, Allah mengulangi lagi ancaman-Nya bahwa kecelakaan besar di hari itu bagi orang yang mendustakan. Sebab rasul telah mengajak mereka supaya beriman dan mengancam dengan memperingatkan mereka dengan akan datangnya azab yang mereka hadapi itu. Sayang mereka tidak mau menerima dan mendengarkan ajakan itu.",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran). ",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "Woe on that Day unto those who give the lie to the truth –",
      "juz_number": 29
    },
    "38": {
      "text_tafsir_en": "God explains that today is the day of decision. This is the day that separates truth and falsehood, the day when truth and falsehood are revealed. On that day, God brought together all the people who had lived on this earth from the time of Adam to the end of time in one place. The purpose is to give them a legal decision on who is wrong and who is right, so that everyone has their rights.",
      "text_tafsir": "Allah menerangkan bahwa hari ini adalah hari keputusan. Inilah hari yang memisahkan antara kebenaran dan kebatilan, hari ketika diungkapkan kebenaran dan kepalsuan seseorang.\n\nDi hari itu, Allah menghimpun semua manusia yang pernah hidup di dunia ini sejak zaman Nabi Adam sampai akhir masa pada tempat yang satu. Tujuannya untuk memberikan suatu keputusan hukum buat mereka siapa yang salah dan siapa yang benar, sehingga masing-masing orang memperoleh haknya.",
      "text_translation": "Inilah hari keputusan; (pada hari ini) Kami kumpulkan kamu dan orang-orang yang terdahulu. ",
      "text": "هٰذَا يَوْمُ الْفَصْلِ جَمَعْنٰكُمْ وَالْاَوَّلِيْنَ ",
      "text_translation_en": "that Day of Distinction [between the true and the false, when they will be told]: \"We have brought you together with those [sinners] of olden times;",
      "juz_number": 29
    },
    "39": {
      "text_tafsir_en": "In this verse, God challenges by mocking the unbelievers and those who feel they have the power to defend themselves, to use their wisdom and deceit to save themselves from their torment. In addition, this verse provides a powerful lesson for those who oppose Islam, who always deceive and ridicule those who believe that in the future they will find out how weak their motives are.",
      "text_tafsir": "Dalam ayat ini, Allah menantang dengan cara mengejek orang-orang kafir dan orang-orang yang merasa mempunyai kekuatan membela diri, untuk menggunakan kepandaian dan tipu dayanya guna menyelamatkan diri dari siksaan-Nya.\n\nSelain itu, ayat ini memberikan suatu pelajaran keras bagi orang-orang yang menentang agama Islam, yang selalu menipu dan mempermainkan orang-orang yang beriman bahwa kelak pada saatnya mereka akan mengetahui betapa lemahnya alasan mereka yang suka mengolok-olokkan agama itu.",
      "text_translation": "Maka jika kamu punya tipu daya, maka lakukanlah (tipu daya) itu terhadap-Ku. ",
      "text": "فَاِنْ كَانَ لَكُمْ كَيْدٌ فَكِيْدُوْنِ ",
      "text_translation_en": "and if you [think that you] have a subterfuge left, try to outwit Me!\"",
      "juz_number": 29
    },
    "40": {
      "text_tafsir_en": "God repeats His threat that a great accident on the day of the resurrection of those who reject Him. It was an accident for them on the Day of Resurrection because that time proved to be a weakness and they faced the God they were lying to. At such a time it was evident how null and void the charges they had believed had been.",
      "text_tafsir": "Allah mengulangi lagi ancaman-Nya bahwa kecelakaan besar di hari kebangkitan bagi orang-orang yang mendustakan-Nya. Kecelakaan buat mereka di hari kebangkitan karena waktu itulah terbukti kelemahan dan mereka berhadapan dengan Allah yang mereka dustai. Pada saat seperti itu terbukti betapa batalnya dakwaan yang mereka yakini selama ini.",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran).",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ࣖ ",
      "text_translation_en": "Woe on that Day unto those who give the lie to the truth!",
      "juz_number": 29
    },
    "41": {
      "text_tafsir_en": "In this verse and the next verse God describes the pleasures of those who fear the shade of heaven in (around) springs, under the shade trees that flow down the rivers below, they never feel the hot air and the turmoil of fire that burns. In this verse, God says: They and their partners are in the shade, leaning on the couch. (Yasin \/ 36: 56)",
      "text_tafsir": "Dalam ayat ini dan ayat berikutnya Allah menerangkan berbagai kenikmatan buat orang-orang yang bertakwa yaitu naungan surga yang berada di (sekitar) mata air, di bawah pohon rindang yang mengalir anak-anak sungai di bawahnya, tidak pernah mereka merasakan udara panas dan gejolak api yang membakar. Dalam ayat ini, Allah berfirman:\n\nMereka dan pasangan-pasangannya berada dalam tempat yang teduh, bersandar di atas dipan-dipan. (Yasin\/36: 56)",
      "text_translation": "Sungguh, orang-orang yang bertakwa berada dalam naungan (pepohonan surga yang teduh) dan (di sekitar) mata air, ",
      "text": "اِنَّ الْمُتَّقِيْنَ فِيْ ظِلٰلٍ وَّعُيُوْنٍۙ",
      "text_translation_en": "[AS AGAINST this,] behold, the God-conscious shall dwell amidst [cooling] shades and springs,",
      "juz_number": 29
    },
    "42": {
      "text_tafsir_en": "In this verse, God explains that in heaven there are rivers, various kinds of fruits that taste sweet and delicious, that can be picked and eaten whenever desired without any interruption. Those who eat it do not need to worry and worry about it if they eat too much.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa di dalam surga terdapat anak sungai, berbagai jenis buah-buahan yang cita rasanya manis dan lezat, boleh dipetik dan dimakan kapan saja dikehendaki tanpa ada yang mengganggu. Bagi yang memakannya tidak perlu takut dan khawatir akan menimbulkan penyakit kalau terlalu banyak memakannya.",
      "text_translation": "dan buah-buahan yang mereka sukai. ",
      "text": "وَّفَوَاكِهَ مِمَّا يَشْتَهُوْنَۗ",
      "text_translation_en": "and [partake of] whatever fruit they may desire;",
      "juz_number": 29
    },
    "43": {
      "text_tafsir_en": "The inhabitants of heaven are welcomed with a friendly response from their guardians, who say that people who did good in the ancient world were allowed to enjoy all the fruits and drinks that were available forever. They will not be sick nor will they have to worry about being exhausted. This is the answer to all their hardships by first obeying God, striving to be close to Him.",
      "text_tafsir": "Penduduk surga diterima dengan sambutan yang ramah dari penjaganya, yang mengatakan bahwa orang yang berbuat baik di dunia dahulu, dibolehkan menikmati segala buah-buahan dan minuman yang telah tersedia selama-lamanya. Mereka tidak akan sakit dan tidak pula perlu khawatir akan habis. Inilah balasan terhadap segala jerih payah mereka dulu dengan beramal menaati Allah, berjuang bersungguh-sungguh mendekatkan diri kepada-Nya.",
      "text_translation": "(Katakan kepada mereka), “Makan dan minumlah dengan rasa nikmat sebagai balasan dari apa yang telah kamu kerjakan.” ",
      "text": "كُلُوْا وَاشْرَبُوْا هَنِيْۤـًٔا ۢبِمَا كُنْتُمْ تَعْمَلُوْنَ ",
      "text_translation_en": "[and they will be told:] \"Eat and drink in good cheer in return for what you did [in life]!\"",
      "juz_number": 29
    },
    "44": {
      "text_tafsir_en": "God then explained that all these pleasures were a gift from Him in retribution for the righteous, and those who always practiced good deeds on the basis of selfishness and devotion to Him. There is no benefit of retribution from Allah's reward as stated in another verse: Indeed, those who believe and do good, We will never waste the reward of those who do good. (al-Kahf \/ 18: 30)",
      "text_tafsir": "Selanjutnya Allah menerangkan bahwa semua kenikmatan itu merupakan pemberian dari-Nya sebagai pembalasan bagi orang yang bertakwa, dan orang yang senantiasa mengamalkan kebaikan dengan dasar dan menghambakan diri kepada-Nya. Tidak ada kebaikan yang luput dari pembalasan pahala Allah sebagaimana disebutkan dalam ayat lain:\n\nSungguh, mereka yang beriman dan mengerjakan kebajikan, Kami benar-benar tidak akan menyia-nyiakan pahala orang yang mengerjakan perbuatan yang baik itu. (al-Kahf\/18: 30)",
      "text_translation": "Sungguh, demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. ",
      "text": "اِنَّا كَذٰلِكَ نَجْزِى الْمُحْسِنِيْنَ ",
      "text_translation_en": "Thus, behold, do We reward the doers of good;",
      "juz_number": 29
    },
    "45": {
      "text_tafsir_en": "In this verse God again curses those who deny Him, \"Woe to those who deny (Us) on that day.\" Woe to them for denying what God has given them, the glory of the righteous and their humiliation on the Day of Judgment. How unlucky the fate of that person is.",
      "text_tafsir": "Dalam ayat ini sekali lagi Allah mengutuk orang-orang yang mendustakan-Nya, \"Kecelakaan bagi orang-orang yang mendustakan (Kami) pada hari itu.\" Kecelakaan bagi mereka karena mendustakan apa yang telah diberikan Allah, yaitu kemuliaan orang bertakwa dan dengan kehinaan mereka pada hari Kiamat. Sungguh sial nasib orang yang mendustakan itu.",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran). ",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "[but] woe on that Day unto those who give the lie to the truth!",
      "juz_number": 29
    },
    "46": {
      "text_tafsir_en": "Then in this verse God calls and threatens with His word that they may eat and enjoy the rest of the pleasures of living in such a small world, for in due time Allah will perform such acts of torment and torment as they are repeatedly cast upon nations before them.",
      "text_tafsir": "Kemudian dalam ayat ini Allah berseru dan mengancam dengan firman-Nya agar mereka makan dan menikmati sisa-sisa kesenangan hidup di dunia yang tinggal sedikit itu, sebab kelak pada waktunya Allah akan memberlakukan sunah berupa kedatangan siksa dan azab buat mereka seperti berulang-ulang dijatuhkan pada bangsa-bangsa sebelum mereka.",
      "text_translation": "(Katakan kepada orang-orang kafir), “Makan dan bersenang-senanglah kamu (di dunia) sebentar, sesungguhnya kamu orang-orang durhaka!”",
      "text": "كُلُوْا وَتَمَتَّعُوْا قَلِيْلًا اِنَّكُمْ مُّجْرِمُوْنَ ",
      "text_translation_en": "EAT [your fill] and enjoy your life for a little while, O you who are lost in sin!",
      "juz_number": 29
    },
    "47": {
      "text_tafsir_en": "Allah then repeated His reproach and threat to those who rejected Him. They have done an act that causes them to be immersed in eternal torment and misery. Whereas in the world they enjoy very little and no time at all.",
      "text_tafsir": "Allah lalu mengulangi lagi celaan dan ancaman-Nya kepada orang yang mendustakan-Nya. Mereka telah melakukan suatu perbuatan yang menyebabkan diri mereka terbenam dalam azab dan kesengsaraan abadi. Padahal di dunia mereka cuma menikmati kesenangan yang sangat sedikit dan tiada lama waktunya.",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran). ",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "[But] woe on that Day unto those who give the lie to the truth,",
      "juz_number": 29
    },
    "48": {
      "text_tafsir_en": "It is reported that this verse came down when the Messenger of Allah (may peace be upon him) preached to the people of Saqif, a country not far from Mecca to pray to Allah. They replied with pride, \"We will not bow (salat) because it is not our custom.\" The Prophet replied that there is no good for a religion that does not have a bow and bow worship. Some say this commandment is that when the disbelievers are brought before God in the Hereafter, they cannot do it, because they do not work on earth. Allah declares that they are commanded to bow, but they refuse. When they were told to obey and obey and fear God and on that day all eyes fell on fear, they were stubborn.",
      "text_tafsir": "Diriwayatkan bahwa ayat ini turun ketika Rasulullah saw berdakwah menyuruh penduduk negeri Saqif, suatu negeri yang tidak jauh dari Mekah untuk salat menyembah Allah. Mereka menjawab dengan sombong, \"Kami tak akan ruku' (salat) karena bukan merupakan suatu kebiasaan kami.\" Nabi menjawab bahwa tidak ada kebaikan bagi suatu agama yang tidak ada padanya ruku' dan sujud. Ada yang mengatakan perintah ini adalah ketika orang-orang kafir disuruh sujud di hadapan Allah di hari akhirat, mereka tak sanggup melakukannya, sebab tidak biasa mengerjakan di atas dunia.\n\nAllah menyatakan bahwa mereka diperintahkan ruku' (mengerjakan salat), tetapi mereka enggan. Apabila disuruh patuh dan taat serta takut kepada Allah dan pada hari yang di waktu itu semua mata tunduk karena takut, mereka bersikap keras kepala.",
      "text_translation": "Dan apabila dikatakan kepada mereka, “Rukuklah,” mereka tidak mau rukuk.",
      "text": "وَاِذَا قِيْلَ لَهُمُ ارْكَعُوْا لَا يَرْكَعُوْنَ ",
      "text_translation_en": "and when they are told, \"Bow down [before God]\", do not bow down:",
      "juz_number": 29
    },
    "49": {
      "text_tafsir_en": "In closing these last two verses, God repeats His curse on those who reject His commands and prohibitions. What a tragedy for a person who denies his disobedience and does not want to leave his ban. After denouncing the unbelievers very hard to follow the true religion, God concluded this chapter by asserting that the Muslims would not listen to the advice of those who asked them to follow the Divine teachings for the sake of their lives here and hereafter. Allah says, \"Then what words other than the Qur'an will they believe?\" So with the clear and easy-to-understand evidence of the Qur'an accompanied by clear evidence, they do not want to believe, so what further truth can lead them to Divine guidance? \"From this last verse it is clear that Allah has established the Qur'anic teachings of the world and the Hereafter, bringing together all the available evidence, complete with all its essentials, and thus the Qur'an is the only known book of scripture containing human evidence. so clear and complete that only humans do not want to believe before the end of their life.",
      "text_tafsir": "Sebagai penutup dari dua ayat terakhir ini, Allah mengulang kembali kutukan-Nya terhadap orang-orang yang mendustakan perintah dan larangan-Nya. Kecelakaan besar bagi orang yang mendustakan karena tidak patuh kepada perintah-Nya dan tidak mau meninggalkan larangan-Nya.\n\nSetelah mencela orang kafir dengan sangat keras agar mengikuti agama yang benar, maka Allah mengakhiri surah ini dengan menegaskan bahwa orang-orang musyrik itu sama sekali tidak mau mendengarkan nasihat para dai yang mengajak mereka untuk mengikuti ajaran Ilahi bagi kepentingan kehidupan mereka di dunia dan akhirat. Allah mengatakan, \"Maka kepada perkataan apakah selain Al-Qur'an mereka akan beriman?\" Jadi dengan keterangan-keterangan Al-Qur'an yang begitu jelas dan mudah dimengerti disertai dengan bukti-bukti yang jelas, mereka tidak juga mau beriman, maka manakah lagi kebenaran yang mampu membawa mereka kepada petunjuk Ilahi?\"\n\nDari ayat terakhir ini jelaslah bahwa Allah telah menetapkan ajaran Al-Qur'an tentang dunia dan akhirat yang menghimpun sekalian keterangan yang ada, lengkap dengan segala seluk-beluknya sebagai alasan yang kuat. Dengan demikian, Al-Qur'an satu-satunya kitab suci yang dikenal manusia yang mengandung keterangan yang begitu jelas dan lengkap. Hanya manusia tidak mau beriman menjelang ajal datang mencabut kehidupannya.",
      "text_translation": "Celakalah pada hari itu, bagi mereka yang mendustakan (kebenaran)! ",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ",
      "text_translation_en": "woe on that Day unto those who give the to the truth!",
      "juz_number": 29
    },
    "50": {
      "text_tafsir_en": "In closing these last two verses, God repeats His curse on those who reject His commands and prohibitions. What a tragedy for a person who denies his disobedience and does not want to leave his ban. After denouncing the unbelievers very hard to follow the true religion, God concluded this chapter by asserting that the Muslims would not listen to the advice of those who asked them to follow the Divine teachings for the sake of their lives here and hereafter. Allah says, \"Then what words other than the Qur'an will they believe?\" So with the clear and easy-to-understand evidence of the Qur'an accompanied by clear evidence, they do not want to believe, so what further truth can lead them to Divine guidance? \"From this last verse it is clear that Allah has established the Qur'anic teachings of the world and the Hereafter, bringing together all the available evidence, complete with all its essentials, and thus the Qur'an is the only known book of scripture containing human evidence. so clear and complete that only humans do not want to believe before the end of their life.",
      "text_tafsir": "Sebagai penutup dari dua ayat terakhir ini, Allah mengulang kembali kutukan-Nya terhadap orang-orang yang mendustakan perintah dan larangan-Nya. Kecelakaan besar bagi orang yang mendustakan karena tidak patuh kepada perintah-Nya dan tidak mau meninggalkan larangan-Nya.\n\nSetelah mencela orang kafir dengan sangat keras agar mengikuti agama yang benar, maka Allah mengakhiri surah ini dengan menegaskan bahwa orang-orang musyrik itu sama sekali tidak mau mendengarkan nasihat para dai yang mengajak mereka untuk mengikuti ajaran Ilahi bagi kepentingan kehidupan mereka di dunia dan akhirat. Allah mengatakan, \"Maka kepada perkataan apakah selain Al-Qur'an mereka akan beriman?\" Jadi dengan keterangan-keterangan Al-Qur'an yang begitu jelas dan mudah dimengerti disertai dengan bukti-bukti yang jelas, mereka tidak juga mau beriman, maka manakah lagi kebenaran yang mampu membawa mereka kepada petunjuk Ilahi?\"\n\nDari ayat terakhir ini jelaslah bahwa Allah telah menetapkan ajaran Al-Qur'an tentang dunia dan akhirat yang menghimpun sekalian keterangan yang ada, lengkap dengan segala seluk-beluknya sebagai alasan yang kuat. Dengan demikian, Al-Qur'an satu-satunya kitab suci yang dikenal manusia yang mengandung keterangan yang begitu jelas dan lengkap. Hanya manusia tidak mau beriman menjelang ajal datang mencabut kehidupannya.",
      "text_translation": "Maka kepada ajaran manakah (selain Al-Qur'an) ini mereka akan beriman?",
      "text": "فَبِاَيِّ حَدِيْثٍۢ بَعْدَهٗ يُؤْمِنُوْنَ ࣖ   ۔",
      "text_translation_en": "In what other tiding, then, will they, after this, believe?",
      "juz_number": 29
    }
  },
  "name": "المرسلٰت",
  "name_translation_en": "The Emissaries",
  "name_translation": "Malaikat Yang Diutus",
  "name_latin": "Al-Mursalat"
}