{
  "number": 81,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 29,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, God explains that if the sun had rolled, it would have lost its light and fallen in disarray with the destruction of the universe once inhabited by living beings on earth, then all the worlds would be destroyed by moving to another.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa jika matahari telah digulung, telah padam cahayanya dan jatuh berantakan bersamaan dengan hancurnya alam semesta yang pernah didiami oleh makhluk-makhluk yang hidup di dunia, maka musnahlah segala alam karena berpindah kepada alam yang lain.",
      "text_translation": "Apabila matahari digulung,",
      "text": "اِذَا الشَّمْسُ كُوِّرَتْۖ",
      "text_translation_en": "WHEN THE SUN is shrouded in darkness,",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "When the stars fall and erase all their light.",
      "text_tafsir": "Apabila bintang-bintang berjatuhan dan padam sekalian cahayanya.",
      "text_translation": "dan apabila bintang-bintang berjatuhan,",
      "text": "وَاِذَا النُّجُوْمُ انْكَدَرَتْۖ",
      "text_translation_en": "and when the stars lose their light,",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "And when mountains are destroyed after being pulled from the earth, they are blown up in the sky when an earthquake is so devastating that the mountains are released from the bottom and thrown in the sky like clouds blown by wind like cotton. For a scientific study of Surah at-Takwir \/ 81: 1-3, also see the scientific study of Surah al-haqqah \/ 69: 13-16 and Surah al-Ma'arij \/ 70: 8. When the process towards the Big Crunch takes place, that is the process of compaction or shrinkage of the universe, then all matter breaks down again into fundamental matter such as quarks, electrons and so on. The forces such as gravity, electromagnetic, strong nuclear and weak nuclear are reuniting. That's when the celestial bodies begin to lose their gravitational forces, and as a result there are massive collisions between stars, this is a picture of 'falling stars, because of the loss of their gravitational forces. The sun which is also a type of star experiences the same thing. When the celestial bodies approach each other, the strength of the outer gravity may exceed the grip of the plasma's power inside the stars (including the sun). The result is that the volume of the sun and other stars will expand. The sun will become larger in volume, but its internal pressure is reduced, and enough to stop the energy that produces a nuclear fusion reaction. As a result, sunlight (which expands it) will fade to red. When the development of the sun's volume has reached its maximum, the sun will experience contraction and its volume will decrease and decrease continuously, shrinking which eventually becomes a super-dense black spot (dwarf black hole). Is this what is meant by the sun being rolled up in paragraph 1 above? Collisions also occur between planets, so the earth collides with other planets. As a result of this event the destruction of the mountains. All of these processes will lead to Big Crunch and return to singularity.",
      "text_tafsir": "Dan apabila gunung-gunung dihancurkan setelah dicabut dari bumi, diterbangkan di angkasa ketika terjadinya gempa yang amat dahsyat sehingga gunung-gunung itu terlepas dari dasarnya dan dilemparkan di angkasa seperti awan yang ditiup angin laksana kapas.\n\nUntuk telaah ilmiah Surah at-Takwir\/81: 1-3 ini, lihat pula telaah ilmiah Surah al-haqqah\/69: 13-16 dan Surah al-Ma'arij\/70: 8. Ketika terjadi proses ke arah Big Crunch itu, yaitu proses pemadatan atau penyusutan alam semesta, maka semua materi pecah kembali menjadi materi-materi fundamental seperti quark, elektron dan sebagainya. Gaya-gaya seperti gaya gravitasi, elektromagnetik, nuklir kuat dan nuklir lemah mulai menyatu kembali. Saat itulah benda-benda langit mulai kehilangan gaya-gaya gravitasinya, dan akibatnya terjadilah tabrakan-tabrakan dahsyat antar bintang, inilah gambaran 'bintang-bintang berjatuhan, karena kehilangan gaya-gaya gravitasinya. \n\nMatahari yang juga merupakan jenis bintang mengalami hal sama. Ketika benda-benda langit saling mendekat, kekuatan gravitasi bagian luar boleh jadi akan melebihi cengkeraman kekuatan plasma di dalam bintang-bintang itu (termasuk matahari). Akibatnya adalah volume matahari dan bintang-bintang yang lain akan memuai. Matahari akan menjadi lebih besar volumenya, namun tekanan internalnya berkurang, dan cukup untuk menghentikan energi yang menghasilkan reaksi perpaduan nuklirnya. Akibatnya sinar matahari (yang memuai itu) akan meredup menjadi merah. Ketika pengembangan volume matahari telah mencapai maksimum, maka matahari akan mengalami kontraksi dan volumenya akan menurun dan menurun terus, mengecil yang akhirnya menjadi bintik hitam yang super-padat (dwarf black hole atau bintik hitam kerdil). Inikah yang dimaksud dengan matahari digulung pada ayat 1 di atas? \n\nBenturan juga terjadi antar-planet, sehingga bumi berbenturan dengan planet-planet lainnya. Akibat peristiwa inilah terjadinya kehancuran gunung-gunung. Semua proses ini akan mengarah ke Big Crunch dan kembali menjadi singularity.",
      "text_translation": "dan apabila gunung-gunung dihancurkan,",
      "text": "وَاِذَا الْجِبَالُ سُيِّرَتْۖ",
      "text_translation_en": "and when the mountains are made to vanish,",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "And when the camel's camels, which were among the most cherished of the Arabs, were abandoned and ignored by their owners because of the terror of the Day of Judgment. This illustrates the horror of the Day of Judgment which, if it were to be expected, if a man had a camel he would have been left behind because he was too busy thinking of his own safety.",
      "text_tafsir": "Dan apabila unta-unta bunting yang termasuk benda paling dihargai oleh orang-orang Arab, ditinggalkan dan tidak dipedulikan oleh pemiliknya karena kedahsyatan hari Kiamat tersebut. Hal ini menggambarkan kedahsyatan hari Kiamat yang jika diperkirakan, jika ada seorang laki-laki mempunyai unta yang bunting tentu ditinggalkan karena terlalu sibuk memikirkan keselamatan dirinya sendiri.",
      "text_translation": "dan apabila unta-unta yang bunting ditinggalkan (tidak terurus),",
      "text": "وَاِذَا الْعِشَارُ عُطِّلَتْۖ",
      "text_translation_en": "and when she-camels big with young, about to give birth, are left untended,",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "And when wild beasts are gathered and destroyed.",
      "text_tafsir": "Dan apabila binatang-binatang liar dikumpulkan dan dimusnahkan.",
      "text_translation": "dan apabila binatang-binatang liar dikumpulkan,",
      "text": "وَاِذَا الْوُحُوْشُ حُشِرَتْۖ",
      "text_translation_en": "and when all beasts are gathered together,",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "And when the oceans are made to overflow, they become one, and they burn with a fiery fire that was kept beneath the earth. After God described some of the events that were the beginning of the destruction of the universe and the death of all beings on it, God explained what happened next regarding the resurrection.",
      "text_tafsir": "Dan apabila lautan-lautan dijadikan meluap, sehingga menjadi satu, kemudian menyala dengan kobaran api yang tadinya terpendam di bawah bumi tersebut.\n\nSetelah Allah menerangkan beberapa peristiwa yang menjadi permulaan hancurnya alam semesta dan matinya semua makhluk yang berada di atasnya, maka Allah menjelaskan apa yang terjadi setelah itu tentang kebangkitan.",
      "text_translation": "dan apabila lautan dipanaskan,",
      "text": "وَاِذَا الْبِحَارُ سُجِّرَتْۖ",
      "text_translation_en": "and when the seas boil over,",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "And if the spirits are reunited with the body to enter life in the afterlife. This verse implies that the spirits remained intact after death and on the Day of Resurrection returned to their bodies. Other opinions mention the meaning of this verse with the meeting of groups of people including ashabul-yamin with the group ashabusy-syimal. Ibn 'Abbas said that the meaning of this verse is the meeting of the spirits of those who believe with their partners in heaven and the spirits of unbelievers are met with the helpers of demons.",
      "text_tafsir": "Dan apabila roh-roh dipertemukan kembali dengan tubuh untuk memasuki kehidupan di alam akhirat. Ayat ini mengandung isyarat bahwa roh-roh itu tetap utuh setelah mati dan pada hari Kiamat dikembalikan lagi pada badannya.\n\nPendapat lain menyebutkan arti ayat ini dengan bertemunya kelompok orang-orang termasuk ashabul-yamin dengan kelompok ashabusy-syimal. Ibnu 'Abbas mengatakan bahwa arti ayat ini adalah dipertemukannya roh orang-orang yang beriman dengan pasangan-pasangannya di surga dan roh orang-orang kafir dipertemukan dengan setan-setan pembantunya.",
      "text_translation": "dan apabila roh-roh dipertemukan (dengan tubuh), ",
      "text": "وَاِذَا النُّفُوْسُ زُوِّجَتْۖ",
      "text_translation_en": "and when all human beings are coupled [with their deeds],",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "And if female babies who are buried alive are asked, for what sin was she killed? In this verse God explains that babies who have been buried alive will be revived before the person who buries them and is asked for sin whether they were killed. The answer to this question gives a deeper impression to the killer because the baby girl will answer that she was buried alive with no sin at all, just because her parents were afraid of poverty and poverty. The custom of the Arabs in the time of Jahiliah was very far beyond humanity. Some of them did not bury the lives of their daughters, but he gave him a job by herding goats in the desert with fur clothes and letting them live in loneliness. And there are those who let their daughter live to the age of six years later he said to his mother, \"Dress this child in good clothes, because a pilgrimage will visit her aunt.\" Previously he had dug a well in the desert. After he reached his daughter at the edge of the well, then said, \"Look, what's in the well.\" Then the girl was kicked from behind and after falling into the well was buried and leveled with the ground. And some of them do even more cruel than this. After coming to Islam, the cruelty outside the fairy of humanity was replaced by a friendly and loving attitude. Among the reasons for killing girls in the Jahiliah period is because girls are considered to have no economic value that can benefit the family. Another reason is because girls are considered to be very weak, are often victims of sexual harassment or because women are seen as male teasers who can bring shame to the family. In Surah an-Nahl \/ 16: 58, Allah describes a man who got the birth of his daughter with a black face for holding back anger. Yet if someone from them is given the news with (birth) daughter, his face turns black (red), and he is very angry. (an-Nahl \/ 16: 58) Islam is a religion that respects women, just as it respects men. Therefore, Islam forbids the killing of male and female infants, either because of poverty or because of fear of poverty. Allah says: Do not kill your children for poverty. We are the ones who provide sustenance to you and to them. (al-An'am \/ 6: 151)",
      "text_tafsir": "Dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya, karena dosa apakah dia dibunuh? Dalam ayat ini Allah menerangkan bahwa bayi-bayi yang pernah dikubur hidup-hidup akan dihidupkan kembali di hadapan orang yang menguburkannya dan ditanya karena dosa apakah dia dibunuh. Jawaban pertanyaan ini memberikan kesan yang lebih dalam kepada si pembunuhnya karena bayi perempuan itu akan menjawab bahwa ia dikubur hidup-hidup tanpa dosa sama sekali, hanya karena orang tuanya takut dihinggapi kefakiran dan kemiskinan. Kebiasaan orang Arab pada zaman Jahiliah ini sangat di luar peri kemanusiaan.\n\nDi kalangan mereka ada yang tidak mengubur hidup-hidup anaknya yang perempuan, tetapi ia memberikan pekerjaan kepadanya dengan menggembalakan kambing di padang pasir dengan pakaian bulu dan membiarkan hidup dalam kesepian.\n\nDan ada pula yang membiarkan anak perempuannya itu hidup sampai umur enam tahun kemudian ia berkata kepada ibunya, \"Dandanilah anak ini dengan pakaian yang baik, karena akan dibawa ziarah mengunjungi bibinya.\" Sebelumnya ia telah menggali sebuah sumur di padang pasir. Setelah ia sampai dengan anak perempuannya itu di tepi sumur itu, lalu berkata, \"Tengok, apa yang ada dalam sumur itu.\" Kemudian anak perempuan itu ditendang dari belakang dan setelah jatuh ke dalam sumur itu lalu ditimbun dan diratakan dengan tanah. Dan di antara mereka ada yang berbuat lebih kejam lagi daripada ini. Setelah datang agama Islam, maka kekejaman yang di luar peri kemanusiaan itu diganti dengan sikap yang penuh ramah dan kesayangan.\n\nDi antara alasan pembunuhan anak perempuan di masa Jahiliah adalah karena anak perempuan dianggap tidak punya nilai ekonomis yang bisa menguntungkan keluarga. Alasan lain adalah karena anak perempuan dianggap sangat lemah, sering menjadi korban pelecehan seksual atau karena perempuan dianggap sebagai penggoda laki-laki yang bisa membuat malu keluarga.\n\nDalam Surah an-Nahl\/16: 58, Allah menggambarkan seorang laki-laki yang mendapat kelahiran putrinya dengan wajah hitam karena menahan marah.\n\nPadahal apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, wajahnya menjadi hitam (merah padam), dan dia sangat marah. (an-Nahl\/16: 58)\n\nIslam adalah agama yang menghormati perempuan, sama seperti menghormati laki-laki. Oleh sebab itu, Islam melarang pembunuhan bayi laki-laki maupun perempuan, baik karena kemiskinan atau karena takut miskin. Allah berfirman:\n\nJanganlah membunuh anak-anakmu karena miskin. Kamilah yang memberi rezeki kepadamu dan kepada mereka. (al-An'am\/6: 151)",
      "text_translation": "dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya, ",
      "text": "وَاِذَا الْمَوْءٗدَةُ سُىِٕلَتْۖ ",
      "text_translation_en": "and when the girl-child that was buried alive is made to ask",
      "juz_number": 30
    },
    "9": {
      "text_tafsir_en": "And if female babies who are buried alive are asked, for what sin was she killed? In this verse God explains that babies who have been buried alive will be revived before the person who buries them and is asked for sin whether they were killed. The answer to this question gives a deeper impression to the killer because the baby girl will answer that she was buried alive with no sin at all, just because her parents were afraid of poverty and poverty. The custom of the Arabs in the time of Jahiliah was very far beyond humanity. Some of them did not bury the lives of their daughters, but he gave him a job by herding goats in the desert with fur clothes and letting them live in loneliness. And there are those who let their daughter live to the age of six years later he said to his mother, \"Dress this child in good clothes, because a pilgrimage will visit her aunt.\" Previously he had dug a well in the desert. After he reached his daughter at the edge of the well, then said, \"Look, what's in the well.\" Then the girl was kicked from behind and after falling into the well was buried and leveled with the ground. And some of them do even more cruel than this. After coming to Islam, the cruelty outside the fairy of humanity was replaced by a friendly and loving attitude. Among the reasons for killing girls in the Jahiliah period is because girls are considered to have no economic value that can benefit the family. Another reason is because girls are considered to be very weak, are often victims of sexual harassment or because women are seen as male teasers who can bring shame to the family. In Surah an-Nahl \/ 16: 58, Allah describes a man who got the birth of his daughter with a black face for holding back anger. Yet if someone from them is given the news with (birth) daughter, his face turns black (red), and he is very angry. (an-Nahl \/ 16: 58) Islam is a religion that respects women, just as it respects men. Therefore, Islam forbids the killing of male and female infants, either because of poverty or because of fear of poverty. Allah says: Do not kill your children for poverty. We are the ones who provide sustenance to you and to them. (al-An'am \/ 6: 151)",
      "text_tafsir": "Dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya, karena dosa apakah dia dibunuh? Dalam ayat ini Allah menerangkan bahwa bayi-bayi yang pernah dikubur hidup-hidup akan dihidupkan kembali di hadapan orang yang menguburkannya dan ditanya karena dosa apakah dia dibunuh. Jawaban pertanyaan ini memberikan kesan yang lebih dalam kepada si pembunuhnya karena bayi perempuan itu akan menjawab bahwa ia dikubur hidup-hidup tanpa dosa sama sekali, hanya karena orang tuanya takut dihinggapi kefakiran dan kemiskinan. Kebiasaan orang Arab pada zaman Jahiliah ini sangat di luar peri kemanusiaan.\n\nDi kalangan mereka ada yang tidak mengubur hidup-hidup anaknya yang perempuan, tetapi ia memberikan pekerjaan kepadanya dengan menggembalakan kambing di padang pasir dengan pakaian bulu dan membiarkan hidup dalam kesepian.\n\nDan ada pula yang membiarkan anak perempuannya itu hidup sampai umur enam tahun kemudian ia berkata kepada ibunya, \"Dandanilah anak ini dengan pakaian yang baik, karena akan dibawa ziarah mengunjungi bibinya.\" Sebelumnya ia telah menggali sebuah sumur di padang pasir. Setelah ia sampai dengan anak perempuannya itu di tepi sumur itu, lalu berkata, \"Tengok, apa yang ada dalam sumur itu.\" Kemudian anak perempuan itu ditendang dari belakang dan setelah jatuh ke dalam sumur itu lalu ditimbun dan diratakan dengan tanah. Dan di antara mereka ada yang berbuat lebih kejam lagi daripada ini. Setelah datang agama Islam, maka kekejaman yang di luar peri kemanusiaan itu diganti dengan sikap yang penuh ramah dan kesayangan.\n\nDi antara alasan pembunuhan anak perempuan di masa Jahiliah adalah karena anak perempuan dianggap tidak punya nilai ekonomis yang bisa menguntungkan keluarga. Alasan lain adalah karena anak perempuan dianggap sangat lemah, sering menjadi korban pelecehan seksual atau karena perempuan dianggap sebagai penggoda laki-laki yang bisa membuat malu keluarga.\n\nDalam Surah an-Nahl\/16: 58, Allah menggambarkan seorang laki-laki yang mendapat kelahiran putrinya dengan wajah hitam karena menahan marah.\n\nPadahal apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, wajahnya menjadi hitam (merah padam), dan dia sangat marah. (an-Nahl\/16: 58)\n\nIslam adalah agama yang menghormati perempuan, sama seperti menghormati laki-laki. Oleh sebab itu, Islam melarang pembunuhan bayi laki-laki maupun perempuan, baik karena kemiskinan atau karena takut miskin. Allah berfirman:\n\nJanganlah membunuh anak-anakmu karena miskin. Kamilah yang memberi rezeki kepadamu dan kepada mereka. (al-An'am\/6: 151)",
      "text_translation": "karena dosa apa dia dibunuh? ",
      "text": "بِاَيِّ ذَنْۢبٍ قُتِلَتْۚ",
      "text_translation_en": "for what crime she had been slain,",
      "juz_number": 30
    },
    "10": {
      "text_tafsir_en": "In this verse it is explained that if the records of human deeds are opened, then they will see the good or evil they have done while in the world. They will be astonished because they did not expect everything to be neatly and meticulously recorded. Allah says: And put a book (the record of charity), then you will see that sinners are afraid of what is (written) in it, and they say, \"What a woe to us, what book is this, no one is left behind, little and the great but all recorded, \"and they found (all) what they had done (written). And your Lord has not wronged anyone. (al-Kahf \/ 18: 49) What is the form of the book or record of human deeds done in Padang Mahsyar is unknown to us. But if humans alone are able to create a variety of recording devices that are so sophisticated and thorough, we believe that God the creator of man has a system and a way to record the actions, words, and contents of the human heart with better results than what humans can make.",
      "text_tafsir": "Dalam ayat ini dijelaskan apabila catatan-catatan amal perbuatan manusia dibuka, maka mereka akan melihat kebajikan atau kejahatan yang mereka perbuat ketika di dunia. Mereka akan tercengang keheranan karena tidak menyangka semuanya tercatat rapi dan teliti. Allah berfirman:\n\nDan diletakkanlah kitab (catatan amal), lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata, \"Betapa celaka kami, kitab apakah ini, tidak ada yang tertinggal, yang kecil dan yang besar melainkan tercatat semuanya,\" dan mereka dapati (semua) apa yang telah mereka kerjakan (tertulis). Dan Tuhanmu tidak menzalimi seorang jua pun. (al-Kahf\/18: 49)\n\nBagaimana bentuk kitab atau catatan amal perbuatan manusia itu di Padang Mahsyar tidak kita ketahui. Namun kalau manusia saja mampu menciptakan berbagai alat perekam yang begitu canggih dan teliti, kita percaya bahwa Allah Sang Pencipta manusia punya sistem dan cara untuk merekam perbuatan, perkataan, dan isi hati manusia dengan hasil yang lebih baik dari apa yang dapat dibuat manusia.",
      "text_translation": "Dan apabila lembaran-lembaran (catatan amal) telah dibuka lebar-lebar, ",
      "text": "وَاِذَا الصُّحُفُ نُشِرَتْۖ",
      "text_translation_en": "and when the scrolls [of men's deeds] are unfolded,",
      "juz_number": 30
    },
    "11": {
      "text_tafsir_en": "And when the sky is dissolved due to the destruction of the planets inside it. The sky is so wide that it can fold like paper. The Word of God: (Remember) in the day of heaven We roll like rolls of sheets of paper. (al-Anbiya '\/ 21: 104)",
      "text_tafsir": "Dan apabila langit dilenyapkan karena kehancuran planet-planet yang ada di dalamnya. Langit yang begitu luas dapat dilipat seperti melipat kertas. Firman Allah:\n\n(Ingatlah) pada hari langit Kami gulung seperti menggulung lembaran-lembaran kertas. (al-Anbiya'\/21: 104)",
      "text_translation": "dan apabila langit dilenyapkan, ",
      "text": "وَاِذَا السَّمَاۤءُ كُشِطَتْۖ",
      "text_translation_en": "and when heaven is laid bare,",
      "juz_number": 30
    },
    "12": {
      "text_tafsir_en": "And when the Hell of hell prepared for tormenting the unbelievers and the wicked was lightened so great that the people who entered it felt the most terrible pain. That is the punishment that Allah inflicts on those who disobey Him. The Word of God: Verily, We have provided for those who disbelieve in chains, shackles and flames. (al-Insan \/ 76: 4)",
      "text_tafsir": "Dan apabila neraka Jahim yang disediakan untuk menyiksa orang-orang kafir dan durhaka telah dinyalakan sehebat-hebatnya sehingga orang yang memasukinya merasa kesakitan yang paling dahsyat. Itulah azab yang diancamkan Allah kepada orang-orang yang mengingkari-Nya. Firman Allah:\n\nSungguh, Kami telah menyediakan bagi orang-orang kafir rantai, belenggu dan neraka yang menyala-nyala. (al-Insan\/76: 4)",
      "text_translation": "dan apabila neraka Jahim dinyalakan, ",
      "text": "وَاِذَا الْجَحِيْمُ سُعِّرَتْۖ",
      "text_translation_en": "and when the blazing fire [of hell] is kindled bright,",
      "juz_number": 30
    },
    "13": {
      "text_tafsir_en": "And when the heaven is drawn to those who enter it, it is the believers who fear. This is a reward for their hard work and their efforts in jihad to uphold the religion of God and carry out religious orders. Allah says: And heaven is near to those who fear. (asy-Syu'ara '\/ 26: 90)",
      "text_tafsir": "Dan apabila surga didekatkan kepada orang-orang yang akan memasukinya yaitu orang-orang mukmin yang bertakwa. Ini adalah balasan atas jerih payah dan usaha mereka berjihad menegakkan agama Allah dan menjalankan perintah agama. Allah berfirman:\n\nDan surga didekatkan kepada orang-orang yang bertakwa. (asy-Syu'ara'\/26: 90)",
      "text_translation": "dan apabila surga didekatkan, ",
      "text": "وَاِذَا الْجَنَّةُ اُزْلِفَتْۖ",
      "text_translation_en": "and when paradise is brought into view:",
      "juz_number": 30
    },
    "14": {
      "text_tafsir_en": "If all the events mentioned before this verse had occurred, every soul would know what it had done. Most human beings while living in the world are deceived by the devil's temptations. They will find their deeds on the Day of Judgment unacceptable to God but away from His mercy and under His wrath. People whose charities are surrounded by joy, do not benefit from it except for hard work and hardship. Everyone is obliged to look to their deeds with religious glasses and weigh them in the proper scales, for God does not accept deeds of charity except that they come from a heart full of faith and sincerity.",
      "text_tafsir": "Jika semua peristiwa-peristiwa yang disebutkan sebelum ayat ini telah terjadi, tiap jiwa akan mengetahui apa yang telah dikerjakannya. Sebagian besar dari manusia ketika hidup di dunia tertipu oleh godaan setan. Mereka akan menjumpai amal perbuatan mereka pada hari Kiamat tidak diterima oleh Allah bahkan dijauhkan dari rahmat-Nya dan berada di bawah murka-Nya.\n\nOrang-orang yang amal perbuatannya diselubungi dengan ria, tidak mendapat faedah dari amalnya itu kecuali sekadar kepayahan dan kesulitan. Setiap orang wajib memandang kepada amal perbuatannya dengan kaca mata agama dan menimbangnya dengan timbangan yang benar, sebab Allah tidak menerima amal perbuatan melainkan yang muncul dari hati yang penuh dengan keimanan dan keikhlasan.",
      "text_translation": "setiap jiwa akan mengetahui apa yang telah dikerjakannya. ",
      "text": "عَلِمَتْ نَفْسٌ مَّآ اَحْضَرَتْۗ",
      "text_translation_en": "[on that Day] every human being will come to know what he has prepared [for himself].",
      "juz_number": 30
    },
    "15": {
      "text_tafsir_en": "In these verses, God swears by the stars and the sun goes down. The stars are not all visible by day, but they will shine at night. God swears by the stars because in their changing circumstances, invisible during the day and shining at night, is a sign of God's sovereignty over the course of his journey.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah bersumpah demi bintang-bintang yang beredar dan terbenam. Bintang-bintang itu semuanya tidak tampak oleh penglihatan pada siang hari, namun akan kelihatan bersinar pada malam hari. Allah bersumpah dengan bintang-bintang itu karena dalam keadaannya yang silih berganti, tidak tampak ketika siang dan bersinar pada malam hari, merupakan tanda atas kekuasaan Allah yang mengatur perjalanannya.",
      "text_translation": "Aku bersumpah demi bintang-bintang,",
      "text": "فَلَآ اُقْسِمُ بِالْخُنَّسِۙ",
      "text_translation_en": "BUT NAY! I call to witness the revolving stars,",
      "juz_number": 30
    },
    "16": {
      "text_tafsir_en": "In these verses, God swears by the stars and the sun goes down. The stars are not all visible by day, but they will shine at night. God swears by the stars because in their changing circumstances, invisible during the day and shining at night, is a sign of God's sovereignty over the course of his journey.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah bersumpah demi bintang-bintang yang beredar dan terbenam. Bintang-bintang itu semuanya tidak tampak oleh penglihatan pada siang hari, namun akan kelihatan bersinar pada malam hari. Allah bersumpah dengan bintang-bintang itu karena dalam keadaannya yang silih berganti, tidak tampak ketika siang dan bersinar pada malam hari, merupakan tanda atas kekuasaan Allah yang mengatur perjalanannya.",
      "text_translation": "yang beredar dan terbenam, ",
      "text": "الْجَوَارِ الْكُنَّسِۙ",
      "text_translation_en": "the planets that run their course and set,",
      "juz_number": 30
    },
    "17": {
      "text_tafsir_en": "In this verse, God swears by night that he is about to leave his darkness.",
      "text_tafsir": "Dalam ayat ini, Allah bersumpah demi malam apabila telah hampir meninggalkan gelapnya.",
      "text_translation": "demi malam apabila telah larut, ",
      "text": "وَالَّيْلِ اِذَا عَسْعَسَۙ",
      "text_translation_en": "and the night as it darkly falls,",
      "juz_number": 30
    },
    "18": {
      "text_tafsir_en": "Then in this verse Allah swears by dawn when the dawn begins and shines. The dawn time is used by God in swearing because this time raises joyous hope for every human who wakes up in the face of a new day. At that time they can find the necessities of life to replace the lost and get ready for the future. Then Allah explained what was the object of his oath, with His word in the following verse.",
      "text_tafsir": "Kemudian dalam ayat ini Allah bersumpah demi subuh apabila fajar mulai menyingsing dan bersinar. Waktu subuh digunakan Allah dalam bersumpah karena waktu ini menimbulkan harapan yang menggembirakan bagi setiap manusia yang bangun pagi karena menghadapi hari yang baru. Saat itu mereka dapat menemukan hajat keperluan hidupnya mengganti yang hilang dan bersiap-siap untuk yang akan datang.\n\nKemudian Allah menerangkan apa yang dijadikan objek sumpahnya itu, dengan firman-Nya pada ayat berikut ini.",
      "text_translation": "dan demi subuh apabila fajar telah menyingsing, ",
      "text": "وَالصُّبْحِ اِذَا تَنَفَّسَۙ",
      "text_translation_en": "and the morn as it softly breathes:",
      "juz_number": 30
    },
    "19": {
      "text_tafsir_en": "In these verses, God explains the object of the oath mentioned in verses 15-18 above, in fact, what Muhammad saw about the events of the Day of Judgment was not the words of a shaman or the thumbs up. However, it was a revelation that the angel Gabriel brought to her Lord. Allah has blessed the messenger who brought the Qur'an, the Angel of Gabriel, with five kinds of qualities that have priority: 1. That is honorable in the sight of his Lord because Allah gives him the most precious thing of guidance, and commands him to deliver that guidance to him. His prophets passed on to His servants. 2.Who has the power to keep the Qur'an far from forgetful or mistaken nature. 3.The one who stands high in the presence of Allah who has the Throne. 4.Who is led among angels by his authority. 5.It is believed to convey revelation because it is protected from traits and deviations.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menjelaskan objek sumpah yang disebutkan dalam ayat 15-18 di atas, yaitu sesungguhnya apa yang diberitahukan oleh Muhammad saw tentang peristiwa-peristiwa hari Kiamat bukanlah kata-kata seorang dukun atau isapan jempol. Akan tetapi, benar-benar wahyu yang dibawa oleh Malaikat Jibril dari Tuhannya. Allah telah menyifati utusan yang membawa Al-Qur'an tersebut, yaitu Malaikat Jibril, dengan lima macam sifat yang mengandung keutamaan:\n\n1.Yang mulia pada sisi Tuhannya karena Allah memberikan padanya sesuatu yang paling berharga yaitu hidayah, dan memerintahkannya untuk menyampaikan hidayah itu kepada para nabi-Nya diteruskan kepada para hamba-Nya.\n\n2.Yang mempunyai kekuatan dalam memelihara Al-Qur'an jauh dari sifat pelupa atau keliru.\n\n3.Yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai 'Arasy.\n\n4.Yang ditaati di kalangan malaikat karena kewenangannya.\n\n5.Yang dipercaya untuk menyampaikan wahyu karena terpelihara dari sifat-sifat khianat dan penyelewengan.",
      "text_translation": "sesungguhnya (Al-Qur'an) itu benar-benar firman (Allah yang dibawa oleh) utusan yang mulia (Jibril),",
      "text": "اِنَّهٗ لَقَوْلُ رَسُوْلٍ كَرِيْمٍۙ",
      "text_translation_en": "behold, this [divine writ] is indeed the [inspired] word of a noble apostle,",
      "juz_number": 30
    },
    "20": {
      "text_tafsir_en": "In these verses, God explains the object of the oath mentioned in verses 15-18 above, in fact, what Muhammad saw about the events of the Day of Judgment was not the words of a shaman or the thumbs up. However, it was a revelation that the angel Gabriel brought to her Lord. Allah has blessed the messenger who brought the Qur'an, the Angel of Gabriel, with five kinds of qualities that have priority: 1. That is honorable in the sight of his Lord because Allah gives him the most precious thing of guidance, and commands him to deliver that guidance to him. His prophets passed on to His servants. 2.Who has the power to keep the Qur'an far from forgetful or mistaken nature. 3.The one who stands high in the presence of Allah who has the Throne. 4.Who is led among angels by his authority. 5.It is believed to convey revelation because it is protected from traits and deviations.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menjelaskan objek sumpah yang disebutkan dalam ayat 15-18 di atas, yaitu sesungguhnya apa yang diberitahukan oleh Muhammad saw tentang peristiwa-peristiwa hari Kiamat bukanlah kata-kata seorang dukun atau isapan jempol. Akan tetapi, benar-benar wahyu yang dibawa oleh Malaikat Jibril dari Tuhannya. Allah telah menyifati utusan yang membawa Al-Qur'an tersebut, yaitu Malaikat Jibril, dengan lima macam sifat yang mengandung keutamaan:\n\n1.Yang mulia pada sisi Tuhannya karena Allah memberikan padanya sesuatu yang paling berharga yaitu hidayah, dan memerintahkannya untuk menyampaikan hidayah itu kepada para nabi-Nya diteruskan kepada para hamba-Nya.\n\n2.Yang mempunyai kekuatan dalam memelihara Al-Qur'an jauh dari sifat pelupa atau keliru.\n\n3.Yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai 'Arasy.\n\n4.Yang ditaati di kalangan malaikat karena kewenangannya.\n\n5.Yang dipercaya untuk menyampaikan wahyu karena terpelihara dari sifat-sifat khianat dan penyelewengan.",
      "text_translation": "yang memiliki kekuatan, memiliki kedudukan tinggi di sisi (Allah) yang memiliki ‘Arsy,",
      "text": "ذِيْ قُوَّةٍ عِنْدَ ذِى الْعَرْشِ مَكِيْنٍۙ",
      "text_translation_en": "with strength endowed, secure with Him who in almightiness is enthroned",
      "juz_number": 30
    },
    "21": {
      "text_tafsir_en": "In these verses, God explains the object of the oath mentioned in verses 15-18 above, in fact, what Muhammad saw about the events of the Day of Judgment was not the words of a shaman or the thumbs up. However, it was a revelation that the angel Gabriel brought to her Lord. Allah has blessed the messenger who brought the Qur'an, the Angel of Gabriel, with five kinds of qualities that have priority: 1. That is honorable in the sight of his Lord because Allah gives him the most precious thing of guidance, and commands him to deliver that guidance to him. His prophets passed on to His servants. 2.Who has the power to keep the Qur'an far from forgetful or mistaken nature. 3.The one who stands high in the presence of Allah who has the Throne. 4.Who is led among angels by his authority. 5.It is believed to convey revelation because it is protected from traits and deviations.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menjelaskan objek sumpah yang disebutkan dalam ayat 15-18 di atas, yaitu sesungguhnya apa yang diberitahukan oleh Muhammad saw tentang peristiwa-peristiwa hari Kiamat bukanlah kata-kata seorang dukun atau isapan jempol. Akan tetapi, benar-benar wahyu yang dibawa oleh Malaikat Jibril dari Tuhannya. Allah telah menyifati utusan yang membawa Al-Qur'an tersebut, yaitu Malaikat Jibril, dengan lima macam sifat yang mengandung keutamaan:\n\n1.Yang mulia pada sisi Tuhannya karena Allah memberikan padanya sesuatu yang paling berharga yaitu hidayah, dan memerintahkannya untuk menyampaikan hidayah itu kepada para nabi-Nya diteruskan kepada para hamba-Nya.\n\n2.Yang mempunyai kekuatan dalam memelihara Al-Qur'an jauh dari sifat pelupa atau keliru.\n\n3.Yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai 'Arasy.\n\n4.Yang ditaati di kalangan malaikat karena kewenangannya.\n\n5.Yang dipercaya untuk menyampaikan wahyu karena terpelihara dari sifat-sifat khianat dan penyelewengan.",
      "text_translation": "yang di sana (di alam malaikat) ditaati dan dipercaya.",
      "text": "مُّطَاعٍ ثَمَّ اَمِيْنٍۗ",
      "text_translation_en": "[the word] of one to be heeded, and worthy of trust!",
      "juz_number": 30
    },
    "22": {
      "text_tafsir_en": "In this verse, Allah quotes the Prophet Muhammad by saying that Muhammad was not a madman, as the infidels of Mecca claimed. The phrase \"your friend\" in this verse is the reason for explaining their lies. After all, everyone will know his or her friend's daily routine. The Quraysh had always been associated with the Prophet Muhammad since he was a child and knew his truthfulness. Therefore, they honored him with the words \"al-Amin\" before he became a prophet. He never lied, did not promise, or betrayed, so that anything he accuses the Prophet of insanity, witchcraft, or lying is simply a lie.",
      "text_tafsir": "Dalam ayat ini, Allah menyifati Nabi Muhammad dengan mengatakan bahwa Muhammad itu bukanlah orang gila, sebagaimana yang dituduhkan oleh orang-orang kafir Mekah.\n\nKalimat \"temanmu\" dalam ayat ini merupakan alasan untuk menerangkan kedustaan mereka. Sebab, setiap orang akan mengenal tabiat temannya yang sehari-hari bergaul dengannya. Orang-orang Quraisy itu selalu bergaul dengan Nabi Muhammad semenjak beliau masih kecil dan mengetahui kejujuran beliau. Oleh karena itu, mereka memberikan julukan kehormatan kepadanya dengan kata-kata \"al-Amin\" sebelum beliau menjadi nabi.\n\nBeliau tidak pernah berdusta, menyalahi janji, atau berkhianat, sehingga apa-apa yang dituduhkan kepada Nabi Muhammad itu tentang sifat gila, tukang sihir, atau pendusta adalah bohong semata.",
      "text_translation": "Dan temanmu (Muhammad) itu bukanlah orang gila. ",
      "text": "وَمَا صَاحِبُكُمْ بِمَجْنُوْنٍۚ",
      "text_translation_en": "For, this fellow-man of yours is not a madman:",
      "juz_number": 30
    },
    "23": {
      "text_tafsir_en": "Prophet Muhammad had seen Gabriel in his original form twice in his life. First, when he was in the Cave of Hira before the descent of Surah al-Muddatstsir, and second, when he ascended to the seventh heaven. Allah's Word And indeed, he (Muhammad) saw it (in his original form) at another time, (that is) in Sidratul Muntaha. (an-Najm \/ 53: 13-14)",
      "text_tafsir": "Nabi Muhammad pernah melihat Jibril dalam bentuk yang asli dua kali dalam hidupnya. Pertama, ketika beliau berada di Gua Hira sebelum turunnya Surah al-Muddatstsir, dan kedua, ketika beliau mi'raj ke langit ketujuh. Firman Allah \n\nDan sungguh, dia (Muhammad) telah melihatnya (dalam rupanya yang asli) pada waktu yang lain, (yaitu) di Sidratul Muntaha. (an-Najm\/53: 13-14)",
      "text_translation": "Dan sungguh, dia (Muhammad) telah melihatnya (Jibril) di ufuk yang terang. ",
      "text": "وَلَقَدْ رَاٰهُ بِالْاُفُقِ الْمُبِيْنِۚ",
      "text_translation_en": "he truly beheld [the angel - beheld] him on the clear horizon;",
      "juz_number": 30
    },
    "24": {
      "text_tafsir_en": "This verse explains that the Prophet Muhammad was not an idiot in communicating all the visions that the angel Gabriel had given him. In addition, he is a very reliable person who has never changed a single revelation in his own words.",
      "text_tafsir": "Ayat ini menerangkan bahwa Nabi Muhammad bukanlah seorang bakhil dalam menyampaikan seluruh wahyu yang disampaikan malaikat Jibril kepadanya. Di samping itu, beliau adalah seorang yang sangat dipercaya karena tidak pernah mengubah wahyu walaupun satu huruf dengan ucapannya sendiri.",
      "text_translation": "Dan dia (Muhammad) bukanlah seorang yang kikir (enggan) untuk menerangkan yang gaib.",
      "text": "وَمَا هُوَ عَلَى الْغَيْبِ بِضَنِيْنٍۚ",
      "text_translation_en": "and he is not one to begrudge others the knowledge [of whatever has been revealed to him] out of that which is beyond the reach of human Perception.",
      "juz_number": 30
    },
    "25": {
      "text_tafsir_en": "In this verse, God explains that the Qur'an is not a cursed word of the devil, nor is it a word that Satan placed on Muhammad's tongue when it disturbed his mind as the Quraysh claimed. Muhammad has been known since childhood with a healthy mind and never acted treacherously. Therefore, what Muhammad describes in the hereafter, heaven, and hell is not the word of the devil.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa Al-Qur'an bukanlah perkataan setan yang terkutuk, dan bukanlah perkataan yang diletakkan oleh setan di atas lidah Muhammad ketika mengganggu akalnya seperti yang dituduhkan oleh orang Quraisy. Muhammad sudah terkenal sejak kecilnya dengan pikiran yang sehat dan tidak pernah berbuat khianat. Oleh karena itu, apa yang diterangkan oleh Muhammad tentang berita akhirat, surga, dan neraka bukanlah perkataan setan.",
      "text_translation": "Dan (Al-Qur'an) itu bukanlah perkataan setan yang terkutuk,",
      "text": "وَمَا هُوَ بِقَوْلِ شَيْطٰنٍ رَّجِيْمٍۚ",
      "text_translation_en": "Nor is this [message] the word of any satanic force accursed.",
      "juz_number": 30
    },
    "26": {
      "text_tafsir_en": "Then Allah made it clear that the Quraysh people had strayed far from the path of truth, and did not know the way of wisdom, so Allah asked them, \"Where are you going?\" The meaning is that after it was explained that the Qur'an really came from Allah and in it contained lessons and instructions that guided mankind to the straight path, asked the unbelievers, \"Which way will you take again?\"",
      "text_tafsir": "Kemudian Allah menerangkan bahwa orang-orang Quraisy itu telah sesat, jauh dari jalan kebenaran, dan tidak mengetahui jalan kebijaksanaan, sehingga Allah bertanya kepada mereka, \"Maka ke manakah kamu akan pergi?\" Maksudnya ialah sesudah diterangkan bahwa Al-Qur'an itu benar-benar datang dari Allah dan di dalamnya terdapat pelajaran dan petunjuk yang membimbing manusia ke jalan yang lurus, ditanyakan kepada orang-orang kafir itu, \"Jalan manakah yang akan kamu tempuh lagi?\"",
      "text_translation": "maka ke manakah kamu akan pergi?",
      "text": "فَاَيْنَ تَذْهَبُوْنَۗ",
      "text_translation_en": "Whither, then, will you go?",
      "juz_number": 30
    },
    "27": {
      "text_tafsir_en": "Then Allah declares that the Qur'an is nothing more than a warning to the universe, for those whose hearts are inclined to goodness. However, not all people can benefit from this Qur'an. The beneficiaries are those who want to go the straight way. As for those who stray from the path, he cannot benefit from the warnings of the Qur'an.",
      "text_tafsir": "Kemudian Allah menyatakan bahwa Al-Qur'an itu tiada lain hanya peringatan bagi semesta alam, bagi mereka yang mempunyai hati cenderung kepada kebaikan. Namun demikian, tidak semua manusia dapat mengambil manfaat dari Al-Qur'an ini. Yang mengambil manfaat ialah siapa yang mau menempuh jalan yang lurus. Adapun orang yang menyimpang dari jalan itu, maka ia tidak dapat mengambil manfaat dari peringatan Al-Qur'an.",
      "text_translation": "(Al-Qur'an) itu tidak lain adalah peringatan bagi seluruh alam, ",
      "text": "اِنْ هُوَ اِلَّا ذِكْرٌ لِّلْعٰلَمِيْنَۙ",
      "text_translation_en": "This [message] is no less than a reminder to all mankind –",
      "juz_number": 30
    },
    "28": {
      "text_tafsir_en": "Then Allah declares that the Qur'an is nothing more than a warning to the universe, for those whose hearts are inclined to goodness. However, not all people can benefit from this Qur'an. The beneficiaries are those who want to go the straight way. As for those who stray from the path, he cannot benefit from the warnings of the Qur'an.",
      "text_tafsir": "Kemudian Allah menyatakan bahwa Al-Qur'an itu tiada lain hanya peringatan bagi semesta alam, bagi mereka yang mempunyai hati cenderung kepada kebaikan. Namun demikian, tidak semua manusia dapat mengambil manfaat dari Al-Qur'an ini. Yang mengambil manfaat ialah siapa yang mau menempuh jalan yang lurus. Adapun orang yang menyimpang dari jalan itu, maka ia tidak dapat mengambil manfaat dari peringatan Al-Qur'an.",
      "text_translation": "(yaitu) bagi siapa di antara kamu yang menghendaki menempuh jalan yang lurus. ",
      "text": "لِمَنْ شَاۤءَ مِنْكُمْ اَنْ يَّسْتَقِيْمَۗ",
      "text_translation_en": "to everyone of you who wills to walk a straight way.",
      "juz_number": 30
    },
    "29": {
      "text_tafsir_en": "In this verse, God says that man does not have his own will to do what he wants as long as it is not in accordance with God's will.",
      "text_tafsir": "Dalam ayat ini, Allah mengatakan bahwa manusia tidak mempunyai kehendak sendiri untuk berbuat sesuatu yang dikehendakinya bilamana tidak sesuai dengan kehendak Allah.",
      "text_translation": "Dan kamu tidak dapat menghendaki (menempuh jalan itu) kecuali apabila dikehendaki Allah, Tuhan seluruh alam.",
      "text": "وَمَا تَشَاۤءُوْنَ اِلَّآ اَنْ يَّشَاۤءَ اللّٰهُ رَبُّ الْعٰلَمِيْنَ ࣖ",
      "text_translation_en": "But you cannot will it unless God, the Sustainer of all the worlds, wills [to show you that way].",
      "juz_number": 30
    }
  },
  "name": "التكوير",
  "name_translation_en": "The Overthrowing",
  "name_translation": "Penggulungan",
  "name_latin": "At-Takwir"
}