{
  "number": 83,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 36,
  "ayat": {
    "1": {
      "text_tafsir_en": "The great torment and humiliation of the Day of Judgment are for those who cheat and weigh. God had given a threat to those who cheated in the market and considered what was happening at the shopping centers in Mecca and Medina at that time. It is reported that in Medinah there was a man named Abu Juhainah. It has two kinds of large and small scales. When he buys wheat or dates from farmers, he uses a large rate, but when he sells to others he uses a small rate. Such acts show greed, want to profit for themselves even in the way of harm to others. Against such people, the Prophet Muhammad made such a terrible threat in this hadith: There are five things that are answered in five things: There is never a people who break the promise, but God will let that people control their enemies. They will never decide something with a sentence that is not decreed by Allah, but will spread widely among them. Adultery is never widespread among them, but the danger of death is widespread. They never cheat in the weeds and weigh, but they lose the fertility of the plants and the drought. And never will those who withhold their alms, but will be punished by the rain (long drought). (History of ath-thabrani from Ibn 'Abbas)",
      "text_tafsir": "Azab dan kehinaan yang besar pada hari Kiamat disediakan bagi orang-orang yang curang dalam menakar dan menimbang. Allah telah menyampaikan ancaman yang pedas kepada orang-orang yang curang dalam menakar dan menimbang yang terjadi di tempat-tempat jual beli di Mekah dan Medinah pada waktu itu.\n\nDiriwayatkan bahwa di Medinah ada seorang laki-laki bernama Abu Juhainah. Ia mempunyai dua macam takaran yang besar dan yang kecil. Bila ia membeli gandum atau kurma dari para petani, ia mempergunakan takaran yang besar, akan tetapi jika ia menjual kepada orang lain ia mempergunakan takaran yang kecil.\n\nPerbuatan seperti itu menunjukkan adanya sifat tamak, ingin mencari keuntungan bagi dirinya sendiri walaupun dengan jalan merugikan orang lain. Terhadap orang seperti itu, Nabi Muhammad telah memberi ancaman yang pedas sekali seperti tersebut dalam hadis ini:\n\nAda lima perkara yang dibalas dengan lima perkara: Tidak pernah suatu kaum yang melanggar janji, melainkan Allah akan membiarkan kaum itu dikuasai musuhnya. Tidak pernah mereka yang memutuskan suatu perkara dengan hukuman yang tidak diturunkan oleh Allah, melainkan akan tersebar luaslah kefakiran di kalangan mereka. Perzinaan tidak pernah meluas di kalangan mereka secara luas, melainkan akan tersebar luaslah bahaya kematian. Tidak pernah mereka yang berbuat curang dalam menakar dan menimbang, melainkan mereka akan kehilangan kesuburan tumbuh-tumbuhan dan ditimpa musim kemarau. Dan tidak pernah mereka yang menahan zakat, melainkan akan diazab dengan tertahannya hujan (kemarau yang panjang). (Riwayat ath-thabrani dari Ibnu 'Abbas)",
      "text_translation": "Celakalah bagi orang-orang yang curang (dalam menakar dan menimbang)! ",
      "text": "وَيْلٌ لِّلْمُطَفِّفِيْنَۙ",
      "text_translation_en": "WOE UNTO THOSE who give short measure:",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In these two verses, God describes the behavior of a person who will become a resident of hell. They are the people who want to meet their needs or scales when buying because they don't want to lose. On the other hand, when selling to others, they reduce their rates or scales. Those who reduced the scales and the scales gained a great deal of sin because by doing so, he was considered to have devoured the property of another without the will of his owner. God forbid such a thing. Allah says: And do not eat with you in vain. (al-Baqarah \/ 2: 188) The meaning here is to cover all the sizes and weights commonly used in the sale and in connection with the reduction of the rights of others. So much of what we see in our lives today is reductions that are detrimental to others, such as selling gas containers that do not meet the standards, reducing the liter of gasoline sold, the fabric seller reducing the size of the cloth it sells. Included in the reduction of a very harmful and dangerous rate is corruption. Corruption reduces funds for a project from redesign to benefit themselves, or decreases the quality of materials needed in the project and replaces them with lower quality materials. This verse reminds people to avoid practices that harm others and that the threat of punishment is huge in the world and the hereafter. The verse that asks men to fulfill and perfect the scales is the word of God: And perfect the measure when you measure, and weigh it with the right weights. That's the main (for you) and the better result. (al-Isra '\/ 17: 35)",
      "text_tafsir": "Dalam dua ayat ini, Allah menjelaskan perilaku orang yang akan menjadi penghuni neraka. Mereka adalah orang-orang yang ingin dipenuhi takaran atau timbangannya ketika membeli karena tidak mau rugi. Sebaliknya, apabila menjual kepada orang lain, mereka akan mengurangi takaran atau timbangannya. \n\nOrang-orang yang mengurangi takaran dan timbangan mendapat dosa yang besar karena dengan perbuatan itu, dia dianggap telah memakan harta orang lain tanpa kerelaan pemiliknya. Allah melarang perbuatan yang demikian itu. Allah berfirman:\n\nDan janganlah kamu makan harta di antara kamu dengan jalan yang batil. (al-Baqarah\/2: 188)\n\nYang dimaksud dengan takaran di sini mencakup segala ukuran dan timbangan yang biasa dipakai dalam jual beli dan terkait dengan pengurangan hak orang lain. Banyak sekali kita jumpai dalam kehidupan sekarang ini pengurangan-pengurangan yang merugikan orang lain, seperti menjual tabung gas yang isinya tidak sesuai dengan standar, mengurangi literan bensin yang dijual, penjual kain yang mengurangi ukuran kain yang dijualnya. Termasuk dalam pengurangan takaran yang sangat merugikan dan berbahaya adalah korupsi. Pelaku korupsi mengurangi dana sebuah proyek dari perencanaan semula demi memperoleh keuntungan untuk diri sendiri, atau mengurangi kualitas bahan yang diperlukan dalam proyek tersebut dan menggantinya dengan bahan yang berkualitas lebih rendah.\n\nAyat ini mengingatkan manusia untuk menjauhi praktek-praktek yang merugikan orang lain dan ancaman hukumannya sangat besar di dunia dan akhirat. Ayat senada yang menyuruh manusia untuk memenuhi dan menyempurnakan timbangan adalah firman Allah:\n\nDan sempurnakanlah takaran apabila kamu menakar, dan timbanglah dengan timbangan yang benar. Itulah yang lebih utama (bagimu) dan lebih baik akibatnya. (al-Isra'\/17: 35)",
      "text_translation": "(Yaitu) orang-orang yang apabila menerima takaran dari orang lain mereka minta dicukupkan, ",
      "text": "الَّذِيْنَ اِذَا اكْتَالُوْا عَلَى النَّاسِ يَسْتَوْفُوْنَۖ",
      "text_translation_en": "those who, when they are to receive their due from [other] people, demand that it be given in full –",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "In these two verses, God describes the behavior of a person who will become a resident of hell. They are the people who want to meet their needs or scales when buying because they don't want to lose. On the other hand, when selling to others, they reduce their rates or scales. Those who reduced the scales and the scales gained a great deal of sin because by doing so, he was considered to have devoured the property of another without the will of his owner. God forbid such a thing. Allah says: And do not eat with you in vain. (al-Baqarah \/ 2: 188) The meaning here is to cover all the sizes and weights commonly used in the sale and in connection with the reduction of the rights of others. So much of what we see in our lives today is reductions that are detrimental to others, such as selling gas containers that do not meet the standards, reducing the liter of gasoline sold, the fabric seller reducing the size of the cloth it sells. Included in the reduction of a very harmful and dangerous rate is corruption. Corruption reduces funds for a project from redesign to benefit themselves, or decreases the quality of materials needed in the project and replaces them with lower quality materials. This verse reminds people to avoid practices that harm others and that the threat of punishment is huge in the world and the hereafter. The verse that asks men to fulfill and perfect the scales is the word of God: And perfect the measure when you measure, and weigh it with the right weights. That's the main (for you) and the better result. (al-Isra '\/ 17: 35)",
      "text_tafsir": "Dalam dua ayat ini, Allah menjelaskan perilaku orang yang akan menjadi penghuni neraka. Mereka adalah orang-orang yang ingin dipenuhi takaran atau timbangannya ketika membeli karena tidak mau rugi. Sebaliknya, apabila menjual kepada orang lain, mereka akan mengurangi takaran atau timbangannya. \n\nOrang-orang yang mengurangi takaran dan timbangan mendapat dosa yang besar karena dengan perbuatan itu, dia dianggap telah memakan harta orang lain tanpa kerelaan pemiliknya. Allah melarang perbuatan yang demikian itu. Allah berfirman:\n\nDan janganlah kamu makan harta di antara kamu dengan jalan yang batil. (al-Baqarah\/2: 188)\n\nYang dimaksud dengan takaran di sini mencakup segala ukuran dan timbangan yang biasa dipakai dalam jual beli dan terkait dengan pengurangan hak orang lain. Banyak sekali kita jumpai dalam kehidupan sekarang ini pengurangan-pengurangan yang merugikan orang lain, seperti menjual tabung gas yang isinya tidak sesuai dengan standar, mengurangi literan bensin yang dijual, penjual kain yang mengurangi ukuran kain yang dijualnya. Termasuk dalam pengurangan takaran yang sangat merugikan dan berbahaya adalah korupsi. Pelaku korupsi mengurangi dana sebuah proyek dari perencanaan semula demi memperoleh keuntungan untuk diri sendiri, atau mengurangi kualitas bahan yang diperlukan dalam proyek tersebut dan menggantinya dengan bahan yang berkualitas lebih rendah.\n\nAyat ini mengingatkan manusia untuk menjauhi praktek-praktek yang merugikan orang lain dan ancaman hukumannya sangat besar di dunia dan akhirat. Ayat senada yang menyuruh manusia untuk memenuhi dan menyempurnakan timbangan adalah firman Allah:\n\nDan sempurnakanlah takaran apabila kamu menakar, dan timbanglah dengan timbangan yang benar. Itulah yang lebih utama (bagimu) dan lebih baik akibatnya. (al-Isra'\/17: 35)",
      "text_translation": "dan apabila mereka menakar atau menimbang (untuk orang lain), mereka mengurangi. ",
      "text": "وَاِذَا كَالُوْهُمْ اَوْ وَّزَنُوْهُمْ يُخْسِرُوْنَۗ",
      "text_translation_en": "but when they have to measure or weigh whatever they owe to others, give less than what is due!",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "This verse denounces those who reduce their measurements and scales with the question whether they think the resurrection day will never exist. Because, if they just think, do not believe there is a day of resurrection, of course they are not moved to avoid cheating. Indeed they did not expect a day of reckoning, as the word of God: Surely they never expected to count. (an-Naba '\/ 78: 27)",
      "text_tafsir": "Ayat ini mencela orang-orang yang mengurangi takaran dan timbangan dengan pertanyaan apakah mereka itu menyangka hari kebangkitan itu tidak akan pernah ada. Sebab, jika mereka menyangka saja, belum meyakini adanya hari kebangkitan, tentu mereka tidak tergugah untuk menghindari kecurangan. Memang mereka itu tidak mengharapkan adanya hari penghitungan, sebagaimana firman Allah:\n\nSesungguhnya dahulu mereka tidak pernah mengharapkan perhitungan. (an-Naba'\/78: 27)",
      "text_translation": "Tidakkah mereka itu mengira, bahwa sesungguhnya mereka akan dibangkitkan, ",
      "text": "اَلَا يَظُنُّ اُولٰۤىِٕكَ اَنَّهُمْ مَّبْعُوْثُوْنَۙ",
      "text_translation_en": "Do they not know that they are bound to be raised from the dead",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "They will be raised to reckon on the Day of Judgment. Allah explained that at that time all mankind stood before Allah Rabbul 'Alamin to be judged and examined all his deeds while living in the world. Everything is reckoned with justice because God is just. The scales are a symbol of justice which must always be upheld and maintained.",
      "text_tafsir": "Mereka akan dibangkitkan untuk dihisab pada hari pembalasan. Allah menerangkan bahwa ketika itu semua umat manusia berdiri menghadap Allah Rabbul 'Alamin untuk dihisab dan diperiksa segala amal perbuatannya selama hidup di dunia. Semuanya dihisab dengan penuh keadilan karena Allah Mahaadil. Timbangan itu adalah lambang keadilan yang senantiasa harus ditegakkan dan dipertahankan.",
      "text_translation": "pada suatu hari yang besar, ",
      "text": "لِيَوْمٍ عَظِيْمٍۙ",
      "text_translation_en": "[and called to account] on an awesome Day –",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "They will be raised to reckon on the Day of Judgment. Allah explained that at that time all mankind stood before Allah Rabbul 'Alamin to be judged and examined all his deeds while living in the world. Everything is reckoned with justice because God is just. The scales are a symbol of justice which must always be upheld and maintained.",
      "text_tafsir": "Mereka akan dibangkitkan untuk dihisab pada hari pembalasan. Allah menerangkan bahwa ketika itu semua umat manusia berdiri menghadap Allah Rabbul 'Alamin untuk dihisab dan diperiksa segala amal perbuatannya selama hidup di dunia. Semuanya dihisab dengan penuh keadilan karena Allah Mahaadil. Timbangan itu adalah lambang keadilan yang senantiasa harus ditegakkan dan dipertahankan.",
      "text_translation": "(yaitu) pada hari (ketika) semua orang bangkit menghadap Tuhan seluruh alam.",
      "text": "يَّوْمَ يَقُوْمُ النَّاسُ لِرَبِّ الْعٰلَمِيْنَۗ",
      "text_translation_en": "the Day when all men shall stand before the Sustainer of all the worlds?",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "These verses explain to those who do not believe in the Day of Resurrection that their actions must be accounted for. They cannot avoid God's punishment because each human being is watched by an angel who records all his deeds. The notebooks of those who disobey God are kept in Sijjin, the written book. In it recorded crime and human fraud. These notes will be used as a measure to reckon them.",
      "text_tafsir": "Ayat-ayat ini menjelaskan kepada orang-orang yang tidak percaya terhadap hari kebangkitan bahwa perbuatan mereka harus dipertanggungjawabkan. Mereka tidak bisa menghindari hukuman Allah karena masing-masing manusia diawasi oleh malaikat yang mencatat semua perbuatannya . \n\nBuku catatan orang-orang yang durhaka kepada Allah akan disimpan di Sijjin, yaitu kitab yang tertulis. Di dalamnya tercatat kejahatan dan kecurangan manusia. Catatan-catatan inilah yang akan dijadikan takaran untuk menghisab mereka.",
      "text_translation": "Sekali-kali jangan begitu! Sesungguhnya catatan orang yang durhaka benar-benar tersimpan dalam Sijjin. ",
      "text": "كَلَّآ اِنَّ كِتٰبَ الْفُجَّارِ لَفِيْ سِجِّيْنٍۗ",
      "text_translation_en": "NAY, VERILY, the record of the wicked is indeed [set down] in a mode inescapable!",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "These verses explain to those who do not believe in the Day of Resurrection that their actions must be accounted for. They cannot avoid God's punishment because each human being is watched by an angel who records all his deeds. The notebooks of those who disobey God are kept in Sijjin, the written book. In it recorded crime and human fraud. These notes will be used as a measure to reckon them.",
      "text_tafsir": "Ayat-ayat ini menjelaskan kepada orang-orang yang tidak percaya terhadap hari kebangkitan bahwa perbuatan mereka harus dipertanggungjawabkan. Mereka tidak bisa menghindari hukuman Allah karena masing-masing manusia diawasi oleh malaikat yang mencatat semua perbuatannya . \n\nBuku catatan orang-orang yang durhaka kepada Allah akan disimpan di Sijjin, yaitu kitab yang tertulis. Di dalamnya tercatat kejahatan dan kecurangan manusia. Catatan-catatan inilah yang akan dijadikan takaran untuk menghisab mereka.",
      "text_translation": "Dan tahukah engkau apakah Sijjin itu? ",
      "text": "وَمَآ اَدْرٰىكَ مَا سِجِّيْنٌۗ",
      "text_translation_en": "And what could make thee conceive what that that mode inescapable will be?",
      "juz_number": 30
    },
    "9": {
      "text_tafsir_en": "These verses explain to those who do not believe in the Day of Resurrection that their actions must be accounted for. They cannot avoid God's punishment because each human being is watched by an angel who records all his deeds. The notebooks of those who disobey God are kept in Sijjin, the written book. In it recorded crime and human fraud. These notes will be used as a measure to reckon them.",
      "text_tafsir": "Ayat-ayat ini menjelaskan kepada orang-orang yang tidak percaya terhadap hari kebangkitan bahwa perbuatan mereka harus dipertanggungjawabkan. Mereka tidak bisa menghindari hukuman Allah karena masing-masing manusia diawasi oleh malaikat yang mencatat semua perbuatannya . \n\nBuku catatan orang-orang yang durhaka kepada Allah akan disimpan di Sijjin, yaitu kitab yang tertulis. Di dalamnya tercatat kejahatan dan kecurangan manusia. Catatan-catatan inilah yang akan dijadikan takaran untuk menghisab mereka.",
      "text_translation": "(Yaitu) Kitab yang berisi catatan (amal).",
      "text": "كِتٰبٌ مَّرْقُوْمٌۗ",
      "text_translation_en": "A record [indelibly] inscribed!",
      "juz_number": 30
    },
    "10": {
      "text_tafsir_en": "These two verses again threaten those who deny the day of retribution with a very painful torment, which is hell. Threats and punishments for those who deny the day of resurrection are very painful, because to deny the Day of Judgment means to renounce the justice of God, and the laws of the religious law that are in effect in the world and consequently in the hereafter.",
      "text_tafsir": "Dua ayat ini kembali mengancam orang-orang yang mendustakan hari pembalasan dengan azab yang sangat pedih, yaitu neraka. Ancaman dan hukuman bagi orang-orang yang mengingkari hari kebangkitan memang sangat pedih, karena mengingkari hari kiamat berarti mengingkari keadilan Allah, dan hukum-hukum syariat agama yang berlaku di dunia dan berakibat di akhirat.",
      "text_translation": "Celakalah pada hari itu, bagi orang-orang yang mendustakan! ",
      "text": "وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَۙ",
      "text_translation_en": "Woe on that Day unto those who give the lie to the truth –",
      "juz_number": 30
    },
    "11": {
      "text_tafsir_en": "These two verses again threaten those who deny the day of retribution with a very painful torment, which is hell. Threats and punishments for those who deny the day of resurrection are very painful, because to deny the Day of Judgment means to renounce the justice of God, and the laws of the religious law that are in effect in the world and consequently in the hereafter.",
      "text_tafsir": "Dua ayat ini kembali mengancam orang-orang yang mendustakan hari pembalasan dengan azab yang sangat pedih, yaitu neraka. Ancaman dan hukuman bagi orang-orang yang mengingkari hari kebangkitan memang sangat pedih, karena mengingkari hari kiamat berarti mengingkari keadilan Allah, dan hukum-hukum syariat agama yang berlaku di dunia dan berakibat di akhirat.",
      "text_translation": "(yaitu) orang-orang yang mendustakannya (hari pembalasan).",
      "text": "الَّذِيْنَ يُكَذِّبُوْنَ بِيَوْمِ الدِّيْنِۗ",
      "text_translation_en": "those who give the lie to the [coming of] Judgment Day:",
      "juz_number": 30
    },
    "12": {
      "text_tafsir_en": "This verse makes it clear that no human is opposed to the Day of Judgment except for those who always cross religious boundaries, whose hearts are covered by unbelief, and whose warnings and threats are no longer useful. Allah said: Verily those who disbelieve, it is the same for them, you (Muhammad) warn or you do not warn, they will not believe. (al-Baqarah \/ 2: 6) Another trait of the human being who avoids the Day of Judgment is drowning in the commission of great sins, indifferent to the commandments and prohibitions of God, more concerned with worldly pleasures than the afterlife. The Word of God: So those who go beyond the limits, and give priority to the life of the world, indeed, abstain. (an Nazi's \/ 79: 37-39)",
      "text_tafsir": "Ayat ini menjelaskan bahwa tidak ada manusia yang mengingkari hari Kiamat kecuali orang-orang yang selalu melampaui batas-batas agama, yang tertutup hatinya oleh kekafiran, dan yang tidak lagi bermanfaat baginya berbagai peringatan dan ancaman. Allah berfirman:\n\nSesungguhnya orang-orang kafir, sama saja bagi mereka, engkau (Muhammad) beri peringatan atau tidak engkau beri peringatan, mereka tidak akan beriman. (al-Baqarah\/2: 6)\n\nSifat lain dari manusia yang mengingkari hari Kiamat adalah tenggelam dalam perbuatan dosa-dosa besar, acuh tak acuh terhadap perintah dan larangan Allah, lebih mementingkan kesenangan duniawi daripada kehidupan akhirat. Firman Allah:\n\nMaka adapun orang yang melampaui batas, dan lebih mengutamakan kehidupan dunia, maka sungguh, nerakalah tempat tinggalnya. (an-Nazi'at\/79: 37-39)",
      "text_translation": "Dan tidak ada yang mendustakannya (hari pembalasan) kecuali setiap orang yang melampaui batas dan berdosa,",
      "text": "وَمَا يُكَذِّبُ بِهٖٓ اِلَّا كُلُّ مُعْتَدٍ اَثِيْمٍۙ",
      "text_translation_en": "for, none gives the lie to it but such as are wont to transgress against all that is [and are] immersed in sin:",
      "juz_number": 30
    },
    "13": {
      "text_tafsir_en": "This verse explains that when the Qur'anic verses are read to those who go beyond the limits, it is always sinful, they do not believe in the Hereafter and the Qur'an as a scripture that contains the instructions of Allah to guide mankind to the path straight to the happiness of the world and the hereafter, they do not want to listen to it in earnest or hear its contents. They even say that the Qur'an is a tale of ancient people dictated to the Prophet Muhammad. The Word of Allah: And the disbelievers say, \"(The Qur'an) is nothing but a lie that he (Muhammad) has created, assisted by others,\" Indeed, they have committed iniquity and a lie big. And they said, \"(It is only) the fairy tales of the ancients, who were asked to write it, and then recited it to them morning and evening.\" Say (Muhammad), \"It is revealed by Allah who knows the secrets of heaven and earth. Indeed, He is Forgiving, Merciful.\" (al-Furqan \/ 25: 4-6)",
      "text_tafsir": "Ayat ini menjelaskan bahwa ketika dibacakan ayat-ayat Al-Qur'an kepada orang-orang yang melampaui batas, selalu berdosa, tidak mempercayai hari akhirat dan Al-Qur'an sebagai kitab suci yang berisi petunjuk-petunjuk Allah untuk mengantarkan manusia ke jalan yang lurus menuju kebahagiaan dunia dan akhirat, mereka tidak mau mendengarkannya dengan khusyuk atau menyimak isinya. Mereka bahkan mengatakan bahwa Al-Qur'an itu adalah dongeng-dongeng orang-orang dahulu yang didiktekan kepada Nabi Muhammad. Firman Allah:\n\nDan orang-orang kafir berkata, \"(Al-Qur'an) ini tidak lain hanyalah kebohongan yang diada-adakan oleh dia (Muhammad), dibantu oleh orang-orang lain,\" Sungguh, mereka telah berbuat zalim dan dusta yang besar. Dan mereka berkata, \"(Itu hanya) dongeng-dongeng orang-orang terdahulu, yang diminta agar dituliskan, lalu dibacakanlah dongeng itu kepadanya setiap pagi dan petang.\" Katakanlah (Muhammad), \"(Al-Qur'an) itu diturunkan oleh (Allah) yang mengetahui rahasia di langit dan di bumi. Sungguh, Dia Maha Pengampun, Maha Penyayang.\" (al-Furqan\/25: 4-6)",
      "text_translation": "yang apabila dibacakan kepadanya ayat-ayat Kami, dia berkata, “Itu adalah dongeng orang-orang dahulu.” ",
      "text": "اِذَا تُتْلٰى عَلَيْهِ اٰيٰتُنَا قَالَ اَسَاطِيْرُ الْاَوَّلِيْنَۗ",
      "text_translation_en": "[and so,] whenever Our messages are conveyed to them, they but say, \"Fables of ancient times!\"",
      "juz_number": 30
    },
    "14": {
      "text_tafsir_en": "In this verse, God contradicts the accusations of the infidels of Mecca who claim that the Qur'an is a folklore. Not at all. Actually what they always try to do is cover their hearts. Their sinful behavior caused their hearts to become hard, dark, and covered with rusty metal. Therefore, they cannot distinguish between heavy lies and blinding truths. Such a heart can only be cleansed with perfect repentance.",
      "text_tafsir": "Dalam ayat ini, Allah membantah tuduhan orang-orang kafir Mekah yang mengatakan bahwa Al-Qur'an itu dongengan orang dahulu. Sama sekali bukan demikian. Sebenarnya apa yang selalu mereka usahakan itu menutup hati mereka. Kebiasaan mereka berbuat dosa telah menyebabkan hati mereka jadi keras, gelap, dan tertutup laksana logam yang berkarat. Oleh karena itu, mereka tidak dapat membedakan antara dusta yang berat dengan kebenaran yang terang benderang. Hati yang demikian hanya bisa dibersihkan dengan tobat yang sempurna.",
      "text_translation": "Sekali-kali tidak! Bahkan apa yang mereka kerjakan itu telah menutupi hati mereka. ",
      "text": "كَلَّا بَلْ ۜرَانَ عَلٰى قُلُوْبِهِمْ مَّا كَانُوْا يَكْسِبُوْنَ ",
      "text_translation_en": "Nay, but their hearts are corroded by all [the evil] that they were wont to do!",
      "juz_number": 30
    },
    "15": {
      "text_tafsir_en": "This verse explains that unbelievers who do not want to recognize the Qur'an as the revelation of Allah are blocked from His mercy in this world and the hereafter. They are prevented from the greatest favor for a servant, namely looking and seeing Allah in the hereafter. Imam Shafi'i said that this verse can be used as an argument that the believers will not be prevented from looking at Allah in the hereafter, as He says: Faces (believers) on that day beamed, looking at their Lord. (al-Qiyamah \/ 75: 22-23)",
      "text_tafsir": "Ayat ini menjelaskan bahwa orang-orang kafir yang tidak mau mengakui Al-Qur'an sebagai wahyu Allah terhalang dari rahmat-Nya di dunia dan akhirat. Mereka terhalang dari nikmat terbesar bagi seorang hamba, yaitu memandang dan melihat Allah di akhirat. Imam Syafi'i mengatakan ayat ini bisa dijadikan dalil bahwa orang-orang Mukmin tidak akan terhalangi dari memandang Allah di akhirat, sebagaimana firman-Nya:\n\nWajah-wajah (orang mukmin) pada hari itu berseri-seri, memandang Tuhannya. (al-Qiyamah\/75: 22-23)",
      "text_translation": "Sekali-kali tidak! Sesungguhnya mereka pada hari itu benar-benar terhalang dari (melihat) Tuhannya. ",
      "text": "كَلَّآ اِنَّهُمْ عَنْ رَّبِّهِمْ يَوْمَىِٕذٍ لَّمَحْجُوْبُوْنَۗ",
      "text_translation_en": "Nay, verily, from [the grace of] their Sustainer shall they on that Day be debarred;",
      "juz_number": 30
    },
    "16": {
      "text_tafsir_en": "Having been turned away from the mercy of God and unable to achieve the goals he had envisioned on the Day of Judgment, the unbelievers really went into a fiery hell.",
      "text_tafsir": "Setelah dijauhkan dari rahmat Allah dan tidak dapat mencapai cita-cita yang diangan-angankannya pada hari pembalasan, orang-orang kafir itu benar-benar masuk neraka Jahim yang sangat panas.",
      "text_translation": "Kemudian, sesungguhnya mereka benar-benar masuk neraka. ",
      "text": "ثُمَّ اِنَّهُمْ لَصَالُوا الْجَحِيْمِۗ",
      "text_translation_en": "and then, behold, they shall enter the blazing fire",
      "juz_number": 30
    },
    "17": {
      "text_tafsir_en": "Then they were told words that were insulting so their suffering multiplied. In addition to physical suffering, they also suffer from psychosis (psychosis). This is the torment they always deny when in the world. This is the response to their attitude of refusing the true news of the apostles, just as they think humans will never be resurrected, the Qur'an is a folk tale, Muhammad is just a witch or a liar, and many other charges . In the future, it will become clear how much of the truth of the truth can be witnessed by their senses. How sad it is for a person who is suffering from torment to be punished when he is punished severely, when he is able to find his way to safety if he is truly faithful and fearful.",
      "text_tafsir": "Kemudian dikatakan kepada mereka ucapan yang mengandung cercaan sehingga penderitaan mereka itu berlipat ganda. Di samping penderitaan fisik, mereka juga menderita secara psikis (kejiwaan). Inilah azab yang selalu mereka dustakan ketika di dunia. Inilah balasan terhadap sikap mereka mendustakan berita-berita rasul yang benar, seperti anggapan mereka bahwa manusia tidak akan dibangkitkan kembali, Al-Qur'an itu dongengan orang-orang dahulu, Muhammad saw itu hanya seorang tukang sihir atau pendusta, dan berbagai macam tuduhan lainnya.\n\nDi akhirat nanti, akan menjadi jelas bagaimana fakta kebenaran yang sesungguhnya yang dapat disaksikan oleh pancaindra mereka. Alangkah sedihnya dirasakan oleh seorang yang sedang menderita azab bila diberi kecaman yang sangat menusuk hatinya, padahal ia sempat menempuh jalan keselamatannya jika ia benar-benar beriman dan bertakwa.",
      "text_translation": "Kemudian, dikatakan (kepada mereka), “Inilah (azab) yang dahulu kamu dustakan.”",
      "text": "ثُمَّ يُقَالُ هٰذَا الَّذِيْ كُنْتُمْ بِهٖ تُكَذِّبُوْنَۗ",
      "text_translation_en": "and be told: \"This is the [very thing] to which you were wont to give the lie!\"",
      "juz_number": 30
    },
    "18": {
      "text_tafsir_en": "In this verse, God contradicts the accusations of the wicked who deny the Day of Resurrection and the truth of the Qur'an. Not always. Indeed the book of the faithful is kept in a high place called 'Illiyyun, which is witnessed by the angels of the muqarrabin (close to God).",
      "text_tafsir": "Dalam ayat ini, Allah membantah tuduhan orang-orang durhaka yang mengingkari hari kebangkitan dan kebenaran Al-Qur'an. Sekali-kali tidak demikian. Sesungguhnya kitab orang-orang yang berbakti disimpan dalam suatu tempat yang tinggi yang diberi nama 'Illiyyun, yang disaksikan oleh malaikat-malaikat muqarrabin (yang dekat dengan Allah).",
      "text_translation": "Sekali-kali tidak! Sesungguhnya catatan orang-orang yang berbakti benar-benar tersimpan dalam ’Illiyyin. ",
      "text": "كَلَّآ اِنَّ كِتٰبَ الْاَبْرَارِ لَفِيْ عِلِّيِّيْنَۗ ",
      "text_translation_en": "NAY, VERILY - the record of the truly virtuous is [set down] in a mode most lofty!",
      "juz_number": 30
    },
    "19": {
      "text_tafsir_en": "To show the greatness of 'Illiyyun, God raised the question, \"Do you know what' Illiyyun is?\" Allah then explained it directly, \"That is the book written and witnessed by angels brought near to God.\"",
      "text_tafsir": "Untuk memperlihatkan keagungan 'Illiyyun itu, Allah mengemukakan pertanyaan, \"Tahukah kamu apakah 'Illiyyun itu?\" Allah lalu menjelaskannya langsung, \"Yaitu kitab yang tertulis dan disaksikan oleh para malaikat yang didekatkan kepada Allah.\"",
      "text_translation": "Dan tahukah engkau apakah ’Illiyyin itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا عِلِّيُّوْنَۗ",
      "text_translation_en": "And what could make thee conceive what that mode most lofty will be?",
      "juz_number": 30
    },
    "20": {
      "text_tafsir_en": "To show the greatness of 'Illiyyun, God raised the question, \"Do you know what' Illiyyun is?\" Allah then explained it directly, \"That is the book written and witnessed by angels brought near to God.\"",
      "text_tafsir": "Untuk memperlihatkan keagungan 'Illiyyun itu, Allah mengemukakan pertanyaan, \"Tahukah kamu apakah 'Illiyyun itu?\" Allah lalu menjelaskannya langsung, \"Yaitu kitab yang tertulis dan disaksikan oleh para malaikat yang didekatkan kepada Allah.\"",
      "text_translation": "(Yaitu) Kitab yang berisi catatan (amal),",
      "text": "كِتٰبٌ مَّرْقُوْمٌۙ",
      "text_translation_en": "A record [indelibly] inscribed,",
      "juz_number": 30
    },
    "21": {
      "text_tafsir_en": "To show the greatness of 'Illiyyun, God raised the question, \"Do you know what' Illiyyun is?\" Allah then explained it directly, \"That is the book written and witnessed by angels brought near to God.\"",
      "text_tafsir": "Untuk memperlihatkan keagungan 'Illiyyun itu, Allah mengemukakan pertanyaan, \"Tahukah kamu apakah 'Illiyyun itu?\" Allah lalu menjelaskannya langsung, \"Yaitu kitab yang tertulis dan disaksikan oleh para malaikat yang didekatkan kepada Allah.\"",
      "text_translation": "yang disaksikan oleh (malaikat-malaikat) yang didekatkan (kepada Allah). ",
      "text": "يَّشْهَدُهُ الْمُقَرَّبُوْنَۗ",
      "text_translation_en": "witnessed~ by all who have [ever] been drawn close unto God.",
      "juz_number": 30
    },
    "22": {
      "text_tafsir_en": "After describing the book of devotees named 'Illiyyun, then Allah describes the situation of the devotee (al-abrar) in detail. Indeed, those who justify what Muhammad saw bring, are in great enjoyment, heaven.",
      "text_tafsir": "Setelah menerangkan kitab orang-orang yang berbakti yang diberi nama 'Illiyyun, lalu Allah menerangkan keadaan orang yang berbakti (al-abrar) itu secara terperinci. Sesungguhnya mereka yang membenarkan apa-apa yang dibawa oleh Muhammad saw itu, benar-benar berada dalam kenikmatan yang besar, yaitu surga.",
      "text_translation": "Sesungguhnya orang-orang yang berbakti benar-benar berada dalam (surga yang penuh) kenikmatan,",
      "text": "اِنَّ الْاَبْرَارَ لَفِيْ نَعِيْمٍۙ",
      "text_translation_en": "Behold, [in the life to come] the truly virtuous will indeed be in bliss:",
      "juz_number": 30
    },
    "23": {
      "text_tafsir_en": "They sit on the couch while looking at the various pleasures of heaven such as angels, their children dying before being provided in heaven to serve their parents, various foods and drinks, and so on.",
      "text_tafsir": "Mereka duduk di atas dipan-dipan sambil memandang berbagai macam kenikmatan surga seperti bidadari, anak-anak mereka yang mati sebelum balig yang disediakan dalam surga untuk berkhidmat kepada orang tuanya, aneka macam makanan dan minuman, dan sebagainya.",
      "text_translation": "mereka (duduk) di atas dipan-dipan melepas pandangan. ",
      "text": "عَلَى الْاَرَاۤىِٕكِ يَنْظُرُوْنَۙ",
      "text_translation_en": "[resting on couches, they will look up [to God]:",
      "juz_number": 30
    },
    "24": {
      "text_tafsir_en": "In this verse it is explained that the signs of happiness appear on their faces. People who see it can feel the pleasures of their lives full of pleasure as stated in the word of God: On that day there were faces that beamed, laughing and joyful. ('Abasa \/ 80: 38-39)",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa tanda-tanda kebahagiaan itu tampak pada wajah-wajah mereka. Orang yang melihatnya dapat merasakan kesenangan hidup mereka yang penuh dengan kenikmatan seperti tercantum dalam firman Allah:\n\nPada hari itu ada wajah-wajah yang berseri-seri, tertawa dan gembira ria. ('Abasa\/80: 38-39)",
      "text_translation": "Kamu dapat mengetahui dari wajah mereka kesenangan hidup yang penuh kenikmatan.",
      "text": "تَعْرِفُ فِيْ وُجُوْهِهِمْ نَضْرَةَ النَّعِيْمِۚ",
      "text_translation_en": "upon their faces thou wilt see the brightness of bliss.",
      "juz_number": 30
    },
    "25": {
      "text_tafsir_en": "In this verse it is explained that devoted people are given to drink from pure khamar which is clean from mixture and not intoxicating. The khamar is kept in a sealed place so that it is protected from pollution.",
      "text_tafsir": "Dalam ayat ini dijelaskan bahwa orang-orang yang berbakti itu diberi minum dari khamar murni yang bersih dari campuran dan tidak memabukkan. Khamar itu disimpan di tempat yang tersegel sehingga terpelihara dari pencemaran.",
      "text_translation": "Mereka diberi minum dari khamar murni (tidak memabukkan) yang (tempatnya) masih dilak (disegel), ",
      "text": "يُسْقَوْنَ مِنْ رَّحِيْقٍ مَّخْتُوْمٍۙ",
      "text_translation_en": "They will be given a drink of pure wine whereon the seal [of God] will have been set,",
      "juz_number": 30
    },
    "26": {
      "text_tafsir_en": "The seal is a musk and in order to achieve such enjoyment, one must compete in order to exercise obedience and devotion to God. Whoever worships him will quickly cross the as-sirathal-mustaqim bridge which is on fire.",
      "text_tafsir": "Segelnya adalah kasturi dan untuk mencapai kenikmatan yang demikian itu, hendaklah orang berlomba-lomba dalam rangka melaksanakan ketaatan dan ketakwaan kepada Allah. Barang siapa yang giat beribadah kepada-Nya, maka akan cepat pula melintasi jembatan as-sirathal-mustaqim yang berada di atas api neraka.",
      "text_translation": "laknya dari kasturi. Dan untuk yang demikian itu hendaknya orang berlomba-lomba. ",
      "text": "خِتٰمُهٗ مِسْكٌ ۗوَفِيْ ذٰلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُوْنَۗ",
      "text_translation_en": "pouring forth with a fragrance of musk. To that [wine of paradise], then, let all such aspire as [are willing to] aspire to things of high account:",
      "juz_number": 30
    },
    "27": {
      "text_tafsir_en": "In these two verses it is explained that the mixture of pure khamar is from tasnim who come from high regions. Tasnim is a spring which is the source of drinking water for those who are brought near to Allah.",
      "text_tafsir": "Dalam dua ayat ini dijelaskan bahwa campuran khamar murni itu ialah dari tasnim yang datang dari daerah yang tinggi. Tasnim adalah mata air yang menjadi sumber air minum orang-orang yang didekatkan kepada Allah.",
      "text_translation": "Dan campurannya dari tasnim, ",
      "text": "وَمِزَاجُهٗ مِنْ تَسْنِيْمٍۙ",
      "text_translation_en": "for it is composed of all that is most exalting",
      "juz_number": 30
    },
    "28": {
      "text_tafsir_en": "In these two verses it is explained that the mixture of pure khamar is from tasnim who come from high regions. Tasnim is a spring which is the source of drinking water for those who are brought near to Allah.",
      "text_tafsir": "Dalam dua ayat ini dijelaskan bahwa campuran khamar murni itu ialah dari tasnim yang datang dari daerah yang tinggi. Tasnim adalah mata air yang menjadi sumber air minum orang-orang yang didekatkan kepada Allah.",
      "text_translation": "(yaitu) mata air yang diminum oleh mereka yang dekat (kepada Allah). ",
      "text": "عَيْنًا يَّشْرَبُ بِهَا الْمُقَرَّبُوْنَۗ",
      "text_translation_en": "a source [of bliss] whereof those who are drawn close unto God shall drink.",
      "juz_number": 30
    },
    "29": {
      "text_tafsir_en": "Indeed, those who go beyond the limits of sin and of old sin always laugh at the believers. When the Prophet Muhammad brought the Qur'an with the Islamic teachings of virtue, he received great opposition from the Meccans. This match was mainly from his grandparents who had been accustomed to worship idols. They are against whatever teachings come from outside that are contrary to their beliefs. It has become the norm for big people who rely on power and material or wealth that they are always cynical or insulting others who are not in line with their beliefs and culture.",
      "text_tafsir": "Sesungguhnya orang-orang yang melampaui batas dan berdosa dahulu selalu menertawakan orang-orang yang beriman. Ketika Nabi Muhammad membawa Al-Qur'an dengan ajaran Islam yang mengandung kebajikan, ia mendapatkan perlawanan yang hebat dari orang-orang musyrik Mekah. Perlawanan ini terutama dari para pembesarnya yang sejak nenek moyangnya sudah biasa menyembah patung berhala. Mereka menentang ajaran apa saja yang datang dari luar yang bertentangan dengan kepercayaan mereka.\n\nTelah menjadi kebiasaan bagi orang-orang besar yang bersandar kepada kekuasaan dan kebendaan atau kekayaan bahwa mereka selalu bersikap sinis atau mencemoohkan pihak lain yang tidak sejalan dengan kepercayaan dan kebudayaan mereka.",
      "text_translation": "Sesungguhnya orang-orang yang berdosa adalah mereka yang dahulu menertawakan orang-orang yang beriman.",
      "text": "اِنَّ الَّذِيْنَ اَجْرَمُوْا كَانُوْا مِنَ الَّذِيْنَ اٰمَنُوْا يَضْحَكُوْنَۖ",
      "text_translation_en": "BEHOLD, those who have abandoned themselves to sin are wont to laugh at such as have attained to faith",
      "juz_number": 30
    },
    "30": {
      "text_tafsir_en": "When the believers pass before them, the sinners signal each other with blinking eyes that contain elements of ridicule and ridicule. When they returned to their relatives, they boasted that they had acted against the followers of Muhammad (peace be upon him) with various acts of ridicule, ridicule, and hostility.",
      "text_tafsir": "Apabila orang-orang yang beriman lewat di hadapan mereka, orang-orang yang berdosa itu saling memberi isyarat dengan kedipan mata yang mengandung unsur ejekan dan cemoohan. Apabila kembali kepada kaum kerabatnya, mereka membangga-banggakan diri karena telah mengadakan tindakan terhadap pengikut-pengikut Muhammad saw dengan berbagai tindakan yang mengandung unsur ejekan, cemoohan, dan permusuhan.",
      "text_translation": "Dan apabila mereka (orang-orang yang beriman) melintas di hadapan mereka, mereka saling mengedip-ngedipkan matanya,",
      "text": "وَاِذَا مَرُّوْا بِهِمْ يَتَغَامَزُوْنَۖ",
      "text_translation_en": "and whenever they pass by them, they wink at one another [derisively];",
      "juz_number": 30
    },
    "31": {
      "text_tafsir_en": "When the believers pass before them, the sinners signal each other with blinking eyes that contain elements of ridicule and ridicule. When they returned to their relatives, they boasted that they had acted against the followers of Muhammad (peace be upon him) with various acts of ridicule, ridicule, and hostility.",
      "text_tafsir": "Apabila orang-orang yang beriman lewat di hadapan mereka, orang-orang yang berdosa itu saling memberi isyarat dengan kedipan mata yang mengandung unsur ejekan dan cemoohan. Apabila kembali kepada kaum kerabatnya, mereka membangga-banggakan diri karena telah mengadakan tindakan terhadap pengikut-pengikut Muhammad saw dengan berbagai tindakan yang mengandung unsur ejekan, cemoohan, dan permusuhan.",
      "text_translation": "dan apabila kembali kepada kaumnya, mereka kembali dengan gembira ria. ",
      "text": "وَاِذَا انْقَلَبُوْٓا اِلٰٓى اَهْلِهِمُ انْقَلَبُوْا فَكِهِيْنَۖ",
      "text_translation_en": "and whenever they return to people of their own kind, they return full of jests;",
      "juz_number": 30
    },
    "32": {
      "text_tafsir_en": "When looking at the believers, the sinners said that they actually saw people who were completely astray and deviated from the truth, changing the beliefs they once had from their ancestors about idolatry.",
      "text_tafsir": "Apabila melihat orang-orang Mukmin, orang-orang yang berdosa itu berkata bahwa sesungguhnya mereka melihat orang yang benar-benar sesat dan menyimpang dari kebenaran, karena mengubah kepercayaan yang sejak dahulu kala mereka warisi dari nenek moyang mereka tentang penyembahan berhala.",
      "text_translation": "Dan apabila mereka melihat (orang-orang mukmin), mereka mengatakan, “Sesungguhnya mereka benar-benar orang-orang sesat,”",
      "text": "وَاِذَا رَاَوْهُمْ قَالُوْٓا اِنَّ هٰٓؤُلَاۤءِ لَضَاۤلُّوْنَۙ",
      "text_translation_en": "and whenever they see those [who believe,] they say, \"Behold, these [people] have indeed gone astray!\"",
      "juz_number": 30
    },
    "33": {
      "text_tafsir_en": "Allah asserts that the disbelievers living in the world are not assigned to protect or protect the believers. They have no authority over the believers because the believers are not under their control. Therefore, they do not have the right to ridicule, watch over, and hurt faithful sincere believers in God.",
      "text_tafsir": "Allah menegaskan bahwa orang-orang kafir itu hidup di dunia tidak ditugaskan untuk melindungi atau menjaga orang-orang Mukmin. Mereka tidak berwenang menjaga orang-orang Mukmin karena orang-orang Mukmin tidak berada di bawah kekuasaan mereka. Oleh sebab itu, mereka tidak berhak mengejek, mengawasi, dan menyakiti orang-orang Mukmin yang tulus ikhlas beriman kepada Allah.",
      "text_translation": "padahal (orang-orang yang berdosa itu), mereka tidak diutus sebagai penjaga (orang-orang mukmin). ",
      "text": "وَمَآ اُرْسِلُوْا عَلَيْهِمْ حٰفِظِيْنَۗ",
      "text_translation_en": "And, withal, they have no call to watch over [the beliefs of] others...",
      "juz_number": 30
    },
    "34": {
      "text_tafsir_en": "In this verse, Allah explains that on the day of vengeance it is the turn of believers in heaven to mock those who are suffering from the punishment of hell. On that day, the believers will laugh widely because they witness the merits and various kinds of pleasures that are in accordance with God's promise. They also laughed at unbelievers who once in the world had ridiculed them.",
      "text_tafsir": "Dalam ayat ini, Allah menjelaskan bahwa pada hari pembalasan giliran orang-orang Mukmin dalam surga mencemoohkan orang-orang kafir yang sedang menderita azab neraka. Pada hari itu, orang-orang yang beriman akan tertawa lebar karena menyaksikan pahala dan berbagai macam kenikmatan yang sesuai dengan janji Allah. Mereka juga menertawakan orang-orang kafir yang dahulu di dunia pernah mencemoohkan mereka.",
      "text_translation": "Maka pada hari ini, orang-orang yang beriman yang menertawakan orang-orang kafir, ",
      "text": "فَالْيَوْمَ الَّذِيْنَ اٰمَنُوْا مِنَ الْكُفَّارِ يَضْحَكُوْنَۙ",
      "text_translation_en": "But on the Day [of Judgment], they who had attained to faith will [be able to] laugh at the [erstwhile] deniers of the truth:",
      "juz_number": 30
    },
    "35": {
      "text_tafsir_en": "They sat on the couch while watching what Allah had done to the unbelievers in hell.",
      "text_tafsir": "Mereka duduk santai di atas dipan-dipan sambil memandang apa yang diperbuat oleh Allah terhadap orang-orang kafir dalam neraka.",
      "text_translation": "mereka (duduk) di atas dipan-dipan melepas pandangan.",
      "text": "عَلَى الْاَرَاۤىِٕكِ يَنْظُرُوْنَۗ",
      "text_translation_en": "[for, resting in paradise] on couches, they will look on [and say to themselves]:",
      "juz_number": 30
    },
    "36": {
      "text_tafsir_en": "They assured that in fact the infidels were not persecuted, but were only rewarded for what they had done. Because, the reply is usually taken from the type of action, the good is rewarded with good, and the evil is rewarded with evil.",
      "text_tafsir": "Mereka meyakinkan bahwa sesungguhnya orang-orang kafir itu tidak dianiaya, tetapi hanya diberi balasan terhadap apa yang dahulu mereka kerjakan. Sebab, balasan itu biasanya diambil dari jenis perbuatan, yang baik dibalas dengan baik, dan yang jahat dibalas dengan jahat.",
      "text_translation": "Apakah orang-orang kafir itu diberi balasan (hukuman) terhadap apa yang telah mereka perbuat? ",
      "text": "هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوْا يَفْعَلُوْنَ ࣖ",
      "text_translation_en": "\"Are these deniers of the truth being [thus] requited for [aught but] what they were wont to do?\"",
      "juz_number": 30
    }
  },
  "name": "المطفّفين",
  "name_translation_en": "Defrauding",
  "name_translation": "Orang-Orang Curang",
  "name_latin": "Al-Mutaffifin"
}