{
  "number": 86,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 17,
  "ayat": {
    "1": {
      "text_tafsir_en": "In these verses and in some other verses, God swears by the heavens, the sun, the moon, and the night, for in them are things, forms, journeys, springs and sinks; then this extraordinary and extraordinary state of affairs is proof to those who think and observe that there is a creator of the Almighty, no ally in its creation. In these verses, God swears by the heavens and the stars that rise at night. Its rays break the darkness, and guide the way to mankind in the dark of the earth and the sea. From that star, man can know the rainy season and the other things he needs in life. There are several meanings by the infidels regarding the star. The best opinion is what defines it as a shining star.",
      "text_tafsir": "Dalam ayat-ayat ini dan pada beberapa ayat lain, Allah bersumpah dengan langit, matahari, bulan, dan malam karena terdapat padanya hal-hal, bentuk-bentuk, perjalanan-perjalanan, terbit dan tenggelamnya; maka keadaan yang ajaib dan luar biasa ini adalah bukti bagi orang yang berpikir dan memperhatikan bahwa ada penciptanya Yang Mahakuasa, tidak ada sekutu dalam penciptaannya.\n\nDalam ayat-ayat ini, Allah bersumpah dengan langit dan bintang yang terbit pada malam hari. Sinarnya memecahkan kegelapan, dan menjadi petunjuk jalan kepada manusia pada waktu gelap di bumi dan di laut. Dari bintang itu, manusia dapat mengetahui musim hujan dan hal-hal lain yang diperlukannya dalam kehidupan. Ada beberapa arti yang dikemukakan oleh para mufasir mengenai bintang tersebut. Pendapat yang terbaik adalah yang mengartikannya sebagai bintang yang bercahaya.",
      "text_translation": "Demi langit dan yang datang pada malam hari.",
      "text": "وَالسَّمَاۤءِ وَالطَّارِقِۙ ",
      "text_translation_en": "CONSIDER the heavens and that which comes in the night!",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In these verses and in some other verses, God swears by the heavens, the sun, the moon, and the night, for in them are things, forms, journeys, springs and sinks; then this extraordinary and extraordinary state of affairs is proof to those who think and observe that there is a creator of the Almighty, no ally in its creation. In these verses, God swears by the heavens and the stars that rise at night. Its rays break the darkness, and guide the way to mankind in the dark of the earth and the sea. From that star, man can know the rainy season and the other things he needs in life. There are several meanings by the infidels regarding the star. The best opinion is what defines it as a shining star.",
      "text_tafsir": "Dalam ayat-ayat ini dan pada beberapa ayat lain, Allah bersumpah dengan langit, matahari, bulan, dan malam karena terdapat padanya hal-hal, bentuk-bentuk, perjalanan-perjalanan, terbit dan tenggelamnya; maka keadaan yang ajaib dan luar biasa ini adalah bukti bagi orang yang berpikir dan memperhatikan bahwa ada penciptanya Yang Mahakuasa, tidak ada sekutu dalam penciptaannya.\n\nDalam ayat-ayat ini, Allah bersumpah dengan langit dan bintang yang terbit pada malam hari. Sinarnya memecahkan kegelapan, dan menjadi petunjuk jalan kepada manusia pada waktu gelap di bumi dan di laut. Dari bintang itu, manusia dapat mengetahui musim hujan dan hal-hal lain yang diperlukannya dalam kehidupan. Ada beberapa arti yang dikemukakan oleh para mufasir mengenai bintang tersebut. Pendapat yang terbaik adalah yang mengartikannya sebagai bintang yang bercahaya.",
      "text_translation": "Dan tahukah kamu apakah yang datang pada malam hari itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا الطَّارِقُۙ ",
      "text_translation_en": "And what could make thee conceive what it is that comes in the night?",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "In these verses and in some other verses, God swears by the heavens, the sun, the moon, and the night, for in them are things, forms, journeys, springs and sinks; then this extraordinary and extraordinary state of affairs is proof to those who think and observe that there is a creator of the Almighty, no ally in its creation. In these verses, God swears by the heavens and the stars that rise at night. Its rays break the darkness, and guide the way to mankind in the dark of the earth and the sea. From that star, man can know the rainy season and the other things he needs in life. There are several meanings by the infidels regarding the star. The best opinion is what defines it as a shining star.",
      "text_tafsir": "Dalam ayat-ayat ini dan pada beberapa ayat lain, Allah bersumpah dengan langit, matahari, bulan, dan malam karena terdapat padanya hal-hal, bentuk-bentuk, perjalanan-perjalanan, terbit dan tenggelamnya; maka keadaan yang ajaib dan luar biasa ini adalah bukti bagi orang yang berpikir dan memperhatikan bahwa ada penciptanya Yang Mahakuasa, tidak ada sekutu dalam penciptaannya.\n\nDalam ayat-ayat ini, Allah bersumpah dengan langit dan bintang yang terbit pada malam hari. Sinarnya memecahkan kegelapan, dan menjadi petunjuk jalan kepada manusia pada waktu gelap di bumi dan di laut. Dari bintang itu, manusia dapat mengetahui musim hujan dan hal-hal lain yang diperlukannya dalam kehidupan. Ada beberapa arti yang dikemukakan oleh para mufasir mengenai bintang tersebut. Pendapat yang terbaik adalah yang mengartikannya sebagai bintang yang bercahaya.",
      "text_translation": "(yaitu) bintang yang bersinar tajam,",
      "text": "النَّجْمُ الثَّاقِبُۙ ",
      "text_translation_en": "It is the star that pierces through [life's] darkness:",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "In this verse, Allah explains that each person has a guardian and a regulator of his needs throughout his entire life journey until his death. Regarding this human guardian, there are two meanings, namely: 1. Guardians of angels who pay attention to and count human actions, as the word of God: There is not a word that is spoken but there is on the side of the guardian angel who is always ready (taking notes). (Qaf \/ 50: 18) 1. Guardians of angels who always accompany each moment and maintain daily life, as the word of God: For him (humans) there are angels who always take care of him in turn, from front and back. They guard it by God's command. (ar-Ra'd \/ 13: 11) The word Tariq, the name of the 86th surah, comes from the root of the word Tharaqa whose basic meaning is to hit hard enough to make a sound. Taking into account the root word which can be interpreted as 'beating \/ beating,' hitting hard. The thsaqib derived from the word tsaqaba means to pierce or penetrate something solid. The Qur'an seems to direct us to an important scientific reality, which is towards what is currently known as the pulsar star, taken from the English verb to pulse, which means to vibrate, to beat with a regular rhythm. Thus, the surah above sounds or means a star that knocks at night and makes a hole. Through research by Jocelyn Bell Burnell, doctoral student and his supervisor Antony Hewish at Cambridge University in 1967, it was found that radio signals emitted regularly from outer space. However, at that time it was not yet known which celestial object was the source of the vibrations. Jocelyn Bell (at that time did not yet have the name of Burnell, her husband) marked the record he had obtained with LGM, short for Little Green Men, because the signal was like a message coming from a transmitter delivered by intelligent beings (intellegent life). Shortly thereafter, this pulsar was interpreted to originate from a rotating and isolated neutron star. The mass of the star on its way to death is so dense that it is depicted as a teaspoon sized pulsar material weighing 1 billion tons, and has such great gravity. These stars, which turn into pulsars through supernova explosions, are among the brightest and fastest-moving celestial bodies in space. Some pulsars rotate 600 times per second. If this star continues to collapse, then what is known as a black hole is born. When the radio telescope is connected to a 'loud speaker' it will sound like the sound of someone knocking on the door (ath-Tariq), which comes from a star making a hole, to later become a black hole. Finally God reminds that every soul has a guardian. That what Allah said before, about the stars, is haqq, then the word of God that every soul has a guardian is haqq. This verse is a warning for humans to always be aware that God is always watching.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa setiap orang ada penjaga dan pengatur keperluannya dalam seluruh perjalanan hidupnya hingga ajalnya tiba. Mengenai penjaga manusia ini, terdapat dua pengertian, yaitu:\n\n1.Penjaga dari malaikat yang memperhatikan dan menghitung perbuatan manusia, sebagaimana firman Allah:\n\nTidak ada suatu kata yang diucapkannya melainkan ada di sisinya malaikat pengawas yang selalu siap (mencatat). (Qaf\/50: 18)\n\n1.Penjaga dari malaikat yang selalu mendampingi setiap saat dan memelihara kehidupan sehari-hari, sebagaimana firman Allah:\n\nBaginya (manusia) ada malaikat-malaikat yang selalu menjaganya bergiliran, dari depan dan belakangnya. Mereka menjaganya atas perintah Allah. (ar-Ra'd\/13: 11)\n\nKata thariq, nama surah ke-86 ini, berasal dari akar kata tharaqa yang makna dasarnya adalah memukul dengan cukup keras untuk menimbulkan suara. Dengan mempertimbangkan akar kata yang dapat diartikan sebagai 'berdenyut\/berdetak, 'memukul keras. Adapun tsaqib yang berasal dari kata tsaqaba memiliki arti melubangi atau menembus sesuatu yang padat. Al-Qur'an tampaknya mengarahkan kita pada sebuah kenyataan ilmiah penting, yakni menuju ke arah apa yang pada saat ini dikenal dengan bintang pulsar, yang diambil dari kata kerja bahasa Inggris to pulse, yang berarti bergetar, berdenyut dengan irama teratur. Dengan demikian, surah di atas berbunyi atau berarti sebuah bintang yang mengetuk di malam hari dan membuat lubang.\n\nMelalui penelitian oleh Jocelyn Bell Burnell, mahasiswa doktoral bersama pembimbingnya Antony Hewish di Universitas Cambridge pada tahun 1967, ditemukan adanya sinyal radio yang terpancar secara teratur dari luar angkasa. Namun demikian, pada saat itu belum diketahui benda langit mana yang menjadi sumber getaran tersebut. Jocelyn Bell (ketika itu belum menyandang nama Burnell, suaminya) menandai rekaman yang diperolehnya dengan LGM, kependekan dari Little Green Men, sebab sinyal tersebut seperti sebuah pesan datang dari sebuah pemancar yang disampaikan oleh makhluk cerdas (intellegent life). Tidak lama kemudian, pulsar ini diinterpretasikan berasal dari bintang neutron yang berotasi dan terisolasi. Massa bintang yang sedang menuju 'kematiannya ini sangat padat dimana digambarkan materi pulsar seukuran satu sendok teh memiliki berat 1 miliar ton, dan memiliki gravitasi yang demikian besar. Bintang-bintang ini, yang berubah menjadi pulsar melalui ledakan supernova, termasuk benda-benda langit yang paling terang dan bergerak paling cepat di ruang angkasa. Sejumlah pulsar berputar 600 kali per detik. Bila bintang ini terus menuju keruntuhannya, maka lahirlah apa yang dikenal sebagai black hole (lubang hitam).\n\nApabila teleskop radio ini dihubungkan dengan 'loud speaker maka akan terdengar seperti suara orang mengetuk pintu (ath-thariq), yang berasal dari bintang sedang membuat lubang, untuk kemudian menjadi lubang hitam.\n\nAkhirnya Allah mengingatkan bahwa setiap jiwa ada penjaganya. Bahwa apa yang difirmankan Allah sebelumnya, tentang bintang-bintang, adalah haqq, maka firman Allah bahwa setiap jiwa ada penjaganya adalah haqq. Ayat ini merupakan peringatan bagi manusia untuk selalu sadar bahwa Allah senantiasa mengamati.",
      "text_translation": "setiap orang pasti ada penjaganya.",
      "text": "اِنْ كُلُّ نَفْسٍ لَّمَّا عَلَيْهَا حَافِظٌۗ ",
      "text_translation_en": "[for] no human being has ever been left unguarded.",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, Allah reminds people to pay attention to whether they were created. This means that God commands people to think and pay close attention to what they are made of. Thus, he can know the power of his creator and also know that if the creator can create it from material that has no sign of life at all, then surely He will more easily revive it.",
      "text_tafsir": "Pada ayat ini, Allah mengingatkan manusia agar memperhatikan dari apakah ia diciptakan. Hal ini berarti bahwa Allah memerintahkan manusia untuk berpikir dan memperhatikan dengan sungguh-sungguh dari apa ia dijadikan. Dengan demikian, ia dapat mengetahui kekuasaan penciptanya dan mengetahui pula bahwa bila penciptanya dapat menciptakannya dari bahan yang tidak memiliki tanda-tanda kehidupan sedikit pun, maka tentulah Ia akan lebih mudah menghidupkannya kembali.",
      "text_translation": "Maka hendaklah manusia memperhatikan dari apa dia diciptakan.",
      "text": "فَلْيَنْظُرِ الْاِنْسَانُ مِمَّ خُلِقَ ",
      "text_translation_en": "LET MAN, then, observe out of what he has been created:",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "In these verses, Allah explains that man was made from water that shines forth from the backbone (as-sulb) and the breastbone of men. This statement of God is in response to the question in the previous verse.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menerangkan bahwa manusia dijadikan-Nya dari air yang terpancar, yang keluar dari antara tulang punggung (as-sulb) dan tulang dada laki-laki. Pernyataan Allah ini adalah sebagai jawaban atas pertanyaan pada ayat terdahulu.",
      "text_translation": "Dia diciptakan dari air (mani) yang terpancar,",
      "text": "خُلِقَ مِنْ مَّاۤءٍ دَافِقٍۙ ",
      "text_translation_en": "he has been created out of a seminal fluid",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "In these verses, Allah explains that man was made from water that shines forth from the backbone (as-sulb) and the breastbone of men. This statement of God is in response to the question in the previous verse.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menerangkan bahwa manusia dijadikan-Nya dari air yang terpancar, yang keluar dari antara tulang punggung (as-sulb) dan tulang dada laki-laki. Pernyataan Allah ini adalah sebagai jawaban atas pertanyaan pada ayat terdahulu.",
      "text_translation": "yang keluar dari antara tulang punggung (sulbi) dan tulang dada.",
      "text": "يَّخْرُجُ مِنْۢ بَيْنِ الصُّلْبِ وَالتَّرَاۤىِٕبِۗ ",
      "text_translation_en": "issuing from between the loins [of man] and the pelvic arch [of woman].",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "In this verse, God explains that He really has the power to bring people back to life. Allah says: Say (Muhammad), \"He who gives life to him first created it, and He is the All-Knowing of all things.\" He is the Most High in the heavens and the earth, and He is the All-Powerful, the All-Wise (ar-30\/27)",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa Ia benar-benar berkuasa untuk mengembalikan manusia hidup sesudah mati. Allah berfirman:\n\nKatakanlah (Muhammad), \"Yang akan menghidupkannya ialah (Allah) yang menciptakannya pertama kali. Dan Dia Maha Mengetahui tentang segala makhluk. (Yasin\/36: 79)\n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. Dia memiliki sifat yang Mahatinggi di langit dan di bumi. Dan Dialah Yang Mahaperkasa, Mahabijaksana. (ar-Rum\/30: 27)",
      "text_translation": "Sungguh, Allah benar-benar kuasa untuk mengembalikannya (hidup setelah mati).",
      "text": "اِنَّهٗ عَلٰى رَجْعِهٖ لَقَادِرٌۗ ",
      "text_translation_en": "Now, verily, He [who thus creates man in the first instance] is well able to bring him back [to life]",
      "juz_number": 30
    },
    "9": {
      "text_tafsir_en": "In these verses it is explained that God will raise people back on the day when all secrets are revealed, which is the Day of Resurrection. At that time, no one can escape what has been determined in return for his deeds, that is, heaven for the righteous and hell for the unrighteous and the transgression of Allah. In the hereafter, all mankind will receive a reward according to their deeds. So, everyone will earn as much as the charity has done in the world. There is not a single power that can change it, and no helper can help it except the power of God alone, as His word says: And there is no (other) one who can help him except Allah; and he won't be able to defend himself. (al-Kahf \/ 18: 43)",
      "text_tafsir": "Dalam ayat-ayat ini diterangkan bahwa Allah akan membangkitkan manusia kembali pada hari yang ditampakkan segala rahasia, yaitu hari Kiamat. Ketika itu, tidak seorang pun dapat luput dari apa yang sudah ditentukan sebagai balasan atas perbuatannya, yaitu surga bagi yang beramal saleh dan neraka bagi yang durhaka dan melanggar perintah Allah.\n\nKetika di akhirat, semua manusia akan memperoleh balasan sesuai dengan perbuatan masing-masing. Jadi, setiap orang akan memperoleh sebagaimana amal yang telah dilakukan di dunia. Tidak ada satu kekuatan pun yang dapat mengubahnya dan tidak ada penolong yang dapat membantunya kecuali kekuasaan Allah semata, sebagaimana firman-Nya:\n\nDan tidak ada (lagi) baginya segolongan pun yang dapat menolongnya selain Allah; dan dia pun tidak akan dapat membela dirinya. (al-Kahf\/18: 43)",
      "text_translation": "Pada hari ditampakkan segala rahasia,",
      "text": "يَوْمَ تُبْلَى السَّرَاۤىِٕرُۙ ",
      "text_translation_en": "on the Day when all secrets will be laid bare,",
      "juz_number": 30
    },
    "10": {
      "text_tafsir_en": "In these verses it is explained that God will raise people back on the day when all secrets are revealed, which is the Day of Resurrection. At that time, no one can escape what has been determined in return for his deeds, that is, heaven for the righteous and hell for the unrighteous and the transgression of Allah. In the hereafter, all mankind will receive a reward according to their deeds. So, everyone will earn as much as the charity has done in the world. There is not a single power that can change it, and no helper can help it except the power of God alone, as His word says: And there is no (other) one who can help him except Allah; and he won't be able to defend himself. (al-Kahf \/ 18: 43)",
      "text_tafsir": "Dalam ayat-ayat ini diterangkan bahwa Allah akan membangkitkan manusia kembali pada hari yang ditampakkan segala rahasia, yaitu hari Kiamat. Ketika itu, tidak seorang pun dapat luput dari apa yang sudah ditentukan sebagai balasan atas perbuatannya, yaitu surga bagi yang beramal saleh dan neraka bagi yang durhaka dan melanggar perintah Allah.\n\nKetika di akhirat, semua manusia akan memperoleh balasan sesuai dengan perbuatan masing-masing. Jadi, setiap orang akan memperoleh sebagaimana amal yang telah dilakukan di dunia. Tidak ada satu kekuatan pun yang dapat mengubahnya dan tidak ada penolong yang dapat membantunya kecuali kekuasaan Allah semata, sebagaimana firman-Nya:\n\nDan tidak ada (lagi) baginya segolongan pun yang dapat menolongnya selain Allah; dan dia pun tidak akan dapat membela dirinya. (al-Kahf\/18: 43)",
      "text_translation": "maka manusia tidak lagi mempunyai suatu kekuatan dan tidak (pula) ada penolong.",
      "text": "فَمَا لَهٗ مِنْ قُوَّةٍ وَّلَا نَاصِرٍۗ ",
      "text_translation_en": "and [man] will have neither strength nor helper!",
      "juz_number": 30
    },
    "11": {
      "text_tafsir_en": "In this verse, God swears by the sky that it contains the rain that most people hope for, because it is the rain that makes the barren land fertile, which makes the living creatures on the earth live and makes the air cold.",
      "text_tafsir": "Dalam ayat ini, Allah bersumpah dengan langit yang mengandung hujan yang sangat diharapkan manusia, karena hujanlah yang menjadikan tanah tandus menjadi subur, yang membuat makhluk yang berada di bumi hidup dan yang menjadikan udara panas menjadi sejuk.",
      "text_translation": "Demi langit yang mengandung hujan,",
      "text": "وَالسَّمَاۤءِ ذَاتِ الرَّجْعِۙ ",
      "text_translation_en": "Consider the heavens, ever-revolving,",
      "juz_number": 30
    },
    "12": {
      "text_tafsir_en": "God swears by the earth that there are plants and fruits that are indispensable to the lives of humans and their livestock.",
      "text_tafsir": "Allah bersumpah dengan bumi yang mempunyai tumbuh-tumbuhan dan buah-buahan yang sangat diperlukan untuk kehidupan manusia dan binatang ternak mereka.",
      "text_translation": "dan bumi yang mempunyai tumbuh-tumbuhan,",
      "text": "وَالْاَرْضِ ذَاتِ الصَّدْعِۙ ",
      "text_translation_en": "and the earth, bursting forth with plants!",
      "juz_number": 30
    },
    "13": {
      "text_tafsir_en": "Allah confirms that His oath with heaven and earth states that in fact the Qur'an brought by the Prophet Muhammad is truly the word of God which separates the right from the vanity, and is not at all a joke. Thus, the Qur'an should be a guide for all humans. Allah explained in the Qur'an about the rights and vanity because of the limited ability of the human mind to know.",
      "text_tafsir": "Allah menegaskan bahwa sumpah-Nya dengan langit dan bumi itu menyatakan bahwa sesungguhnya Al-Qur'an yang dibawa oleh Nabi Muhammad benar-benar firman Allah yang memisahkan antara yang hak dan yang batil, dan sama sekali bukanlah senda gurau. Dengan demikian, sudah seharusnya Al-Qur'an menjadi petunjuk bagi seluruh manusia. Allah menjelaskan di dalam Al-Qur'an tentang yang hak dan batil karena keterbatasan kemampuan akal manusia untuk mengetahuinya.",
      "text_translation": "sungguh, (Al-Qur'an) itu benar-benar firman pemisah (antara yang hak dan yang batil),",
      "text": "اِنَّهٗ لَقَوْلٌ فَصْلٌۙ ",
      "text_translation_en": "BEHOLD, this [divine writ] is indeed a word that between truth and falsehood,",
      "juz_number": 30
    },
    "14": {
      "text_tafsir_en": "Allah confirms that His oath with heaven and earth states that in fact the Qur'an brought by the Prophet Muhammad is truly the word of God which separates the right from the vanity, and is not at all a joke. Thus, the Qur'an should be a guide for all humans. Allah explained in the Qur'an about the rights and vanity because of the limited ability of the human mind to know.",
      "text_tafsir": "Allah menegaskan bahwa sumpah-Nya dengan langit dan bumi itu menyatakan bahwa sesungguhnya Al-Qur'an yang dibawa oleh Nabi Muhammad benar-benar firman Allah yang memisahkan antara yang hak dan yang batil, dan sama sekali bukanlah senda gurau. Dengan demikian, sudah seharusnya Al-Qur'an menjadi petunjuk bagi seluruh manusia. Allah menjelaskan di dalam Al-Qur'an tentang yang hak dan batil karena keterbatasan kemampuan akal manusia untuk mengetahuinya.",
      "text_translation": "dan (Al-Qur'an) itu bukanlah sendagurauan.",
      "text": "وَّمَا هُوَ بِالْهَزْلِۗ ",
      "text_translation_en": "and is no idle tale.",
      "juz_number": 30
    },
    "15": {
      "text_tafsir_en": "Allah explains that the unbelievers are plotting evil by saying that there is no resurrection, as Allah explains in the following verses about what they have said: And they will say (again), \"Life is only in this world.\" , and we will not be resurrected. \" (al-An'am \/ 6: 29) And he made a parable for Us and forgot the origin of it; he said, \"Who can revive the bones, which have perished?\" (Yasin \/ 36: 78) The trick is in the form of slanderous claims that the Prophet Muhammad was a magician, a poet, or a madman. At the top, they planned to kill the Prophet Muhammad, as Allah said: And (remember), when the unbelievers (Quraysh) thought of deceiving you (Muhammad) to capture and imprison you or kill you, or kill you. They make a deception and God thwarts it. Allah is the best of all retribution. (al-Anfal \/ 8: 30)",
      "text_tafsir": "Allah menerangkan bahwa orang kafir merencanakan tipu daya yang jahat dengan mengatakan tidak ada hari kebangkitan, sebagaimana diterangkan Allah dalam ayat-ayat berikut ini tentang apa-apa yang telah mereka katakan:\n\nDan tentu mereka akan mengatakan (pula), \"Hidup hanyalah di dunia ini, dan kita tidak akan dibangkitkan.\" (al-An'am\/6: 29)\n\nDan dia membuat perumpamaan bagi Kami dan melupakan asal kejadiannya; dia berkata, \"Siapakah yang dapat menghidupkan tulang-belulang, yang telah hancur luluh?\" (Yasin\/36: 78)\n\nTipu daya itu adakalanya berupa fitnah yang menyatakan bahwa Nabi Muhammad tukang sihir, penyair, atau gila. Pada puncaknya, mereka merencanakan untuk membunuh Nabi Muhammad, sebagaimana firman Allah:\n\nDan (ingatlah), ketika orang-orang kafir (Quraisy) memikirkan tipu daya terhadapmu (Muhammad) untuk menangkap dan memenjarakanmu atau membunuhmu, atau mengusirmu. Mereka membuat tipu daya dan Allah menggagalkan tipu daya itu. Allah adalah sebaik-baik pembalas tipu daya. (al-Anfal\/8: 30)",
      "text_translation": "Sungguh, mereka (orang kafir) merencanakan tipu daya yang jahat.",
      "text": "اِنَّهُمْ يَكِيْدُوْنَ كَيْدًاۙ ",
      "text_translation_en": "Behold, they [who refuse to accept it] devise many a false argument [to disprove its truth];",
      "juz_number": 30
    },
    "16": {
      "text_tafsir_en": "This verse explains that Allah faced their evil plan by helping His Messenger and elevating His religion.",
      "text_tafsir": "Ayat ini menerangkan bahwa Allah menghadapi rencana jahat mereka itu dengan menolong Rasul-Nya dan mengangkat agama-Nya.",
      "text_translation": "Dan Aku pun membuat rencana (tipu daya) yang jitu.",
      "text": "وَّاَكِيْدُ كَيْدًاۖ ",
      "text_translation_en": "but I shall bring all their scheming to nought.",
      "juz_number": 30
    },
    "17": {
      "text_tafsir_en": "Allah told the Prophet Muhammad to continue his preaching and did not expect the infidels to be punished quickly. Allah holds His torment to increase their sins, so that when Allah decrees His punishment, no one will have mercy on them. Allah said: We let them have a good time, and then We forced them into a severe torment. (Luqman \/ 31: 24)",
      "text_tafsir": "Allah menyuruh Nabi Muhammad agar meneruskan dakwahnya dan tidak mengharapkan agar orang kafir cepat-cepat mendapat siksa. Allah menangguhkan siksa-Nya agar dosa mereka bertambah banyak, sehingga bila Allah menurunkan azab-Nya nanti, tidak akan ada seorang pun lagi yang menaruh kasihan kepada mereka. Allah berfirman:\n\nKami biarkan mereka bersenang-senang sebentar, kemudian Kami paksa mereka (masuk) ke dalam azab yang keras. (Luqman\/31: 24)",
      "text_translation": "Karena itu berilah penangguhan kepada orang-orang kafir itu. Berilah mereka itu kesempatan untuk sementara waktu.",
      "text": "فَمَهِّلِ الْكٰفِرِيْنَ اَمْهِلْهُمْ رُوَيْدًا ࣖ ",
      "text_translation_en": "Let, then, the deniers of the truth have their will: let them have their will for a little while.",
      "juz_number": 30
    }
  },
  "name": "الطارق",
  "name_translation_en": "The Morning Star",
  "name_translation": "Yang Datang Di Malam Hari",
  "name_latin": "At-Tariq"
}