{
  "number": 90,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 20,
  "ayat": {
    "1": {
      "text_tafsir_en": "This verse literally translates, \"I do not swear by this country.\" The word \"no\" (lA) in the verse serves to reinforce, because of that, \"I swear by this country.\" Or the verse reads, \"No, I swear by this country,\" which also means stress. God swore to the city of Mecca, where there was a Ka'ba aimed at mankind from all corners since the day Abraham was established to perform pilgrimage. In addition, the city has been a center of commerce for a long time. Since it is visited every year from all corners, the city is also called Ummul-Qura (Mother of States). The city is prosperous despite its surrounding desert.",
      "text_tafsir": "Ayat ini secara harfiah terjemahannya, \"Aku tidak bersumpah dengan negeri ini.\" Kata \"tidak\" (lA) dalam ayat itu berfungsi menguatkan, karena itu maksudnya, \"Aku benar-benar bersumpah dengan negeri ini.\" Atau ayat itu dibaca, \"Tidak! Aku bersumpah dengan negeri ini,\" yang juga bermakna menekankan. \n\nAllah bersumpah dengan kota Mekah, tempat di mana terdapat Ka'bah yang dituju oleh manusia dari segala penjuru semenjak didirikan oleh Nabi Ibrahim sampai sekarang untuk melaksanakan ibadah haji. Di samping itu, kota ini juga menjadi pusat perdagangan semenjak lama sekali. Karena didatangi setiap tahun dari segenap penjuru itu, maka kota itu dinamai juga Ummul-Qura (Induk Negeri-negeri). Kota itu makmur sekalipun sekelilingnya padang pasir.",
      "text_translation": "Aku bersumpah dengan negeri ini (Mekah),",
      "text": "لَآ اُقْسِمُ بِهٰذَا الْبَلَدِۙ",
      "text_translation_en": "NAY! I call to witness this land –",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "The word hill in the verse means \"housed\". The point is that this city is also the birthplace of the Prophet Muhammad who is the greatest and final prophet who brought the religion of Islam. Thus, Allah swears by the great city of Mecca because of the birthplace of the great man, namely Muhammad. There are also those who interpret the hill in the verse as \"halal\", that is lawful for the Prophet to fight in that city when fought, what is not lawful for others.",
      "text_tafsir": "Kata hill dalam ayat itu berarti \"bertempat\". Maksudnya adalah bahwa kota ini adalah juga tempat lahir Nabi Muhammad yang merupakan nabi terbesar dan terakhir yang membawa agama Islam. Dengan demikian, Allah bersumpah dengan kota Mekah yang agung karena tempat kelahiran manusia agung, yaitu Muhammad saw. Ada pula yang menafsirkan hill dalam ayat itu \"halal\", yaitu halal bagi Nabi berperang dalam kota itu bila diperangi, apa yang tidak dihalalkan bagi orang lain.",
      "text_translation": "dan engkau (Muhammad), bertempat di negeri (Mekah) ini,",
      "text": "وَاَنْتَ حِلٌّۢ بِهٰذَا الْبَلَدِۙ",
      "text_translation_en": "this land in which thou art free to dwell -",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "Allah swore to a father, Abraham, and his son, Ishmael, who would later send down Muhammad. Thus, God swore to the ancestors of the prophet Muhammad after Allah swore to him and his city of birth, indicating the relationship of the two prophets. Others interpret the \"father\" with Adam as the father of mankind and his grandson who was born after that.",
      "text_tafsir": "Allah bersumpah dengan seorang ayah, yaitu Ibrahim, dan anaknya, yaitu Ismail yang nanti menurunkan Nabi Muhammad. Dengan demikian, Allah bersumpah dengan nenek moyang Nabi Muhammad setelah sebelumnya Allah bersumpah dengan beliau dan kota kelahiran beliau, yang menunjukkan pertalian kedua nabi tersebut. Ada pula yang menafsirkan \"ayah\" dengan Adam yang merupakan ayah umat manusia dan anak cucunya yang lahir sesudah itu siapa saja.",
      "text_translation": "dan demi (pertalian) bapak dan anaknya.",
      "text": "وَوَالِدٍ وَّمَا وَلَدَۙ",
      "text_translation_en": "and [I call to witness] parent and offspring:",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "After swearing, God conveys an important message that He is about to make, which is why He needs to swear first. The message is that humans are born in trouble. That is, humans can no longer live without difficulty as experienced by their ancestors, Adam and Eve, in heaven, because everything is available. But they have to live with difficulty first: try, find sustenance, overcome various obstacles, and so on. Based on that struggle, God judges the human. The greater the struggle done by humans and the greater the benefits that the struggle provides for the human race, the higher the value of that human being in God's sight. Once the Prophet Muhammad was in this city, he needed to fight for the truth to be real and the evil to disappear. Likewise all humans. Therefore, dead humans should leave services.",
      "text_tafsir": "Setelah bersumpah, Allah menyampaikan pesan penting yang hendak dikemukakan-Nya yang karena itu Ia perlu terlebih dahulu bersumpah. Pesan itu adalah bahwa manusia terlahir dalam kesulitan. Maksudnya, manusia tidak bisa lagi hidup tanpa susah payah sebagaimana dialami oleh nenek moyang mereka, Adam dan Hawa, di surga, karena semuanya tersedia. Tetapi mereka harus hidup dengan terlebih dahulu bersusah payah: berusaha, mencari rezeki, mengatasi berbagai rintangan, dan sebagainya. Berdasarkan perjuangan itulah, Allah menilai manusia tersebut. Semakin besar perjuangan yang dilakukan manusia dan semakin besar manfaat yang diberikan hasil perjuangannya itu bagi umat manusia, semakin tinggi nilai manusia itu dalam pandangan Allah. Begitu pulalah Nabi Muhammad di kota ini, beliau perlu berjuang agar kebenaran menjadi nyata dan kebatilan menjadi sirna. Demikian pula seluruh manusia. Oleh karena itu, manusia mati seharusnya meninggalkan jasa.",
      "text_translation": "Sungguh, Kami telah menciptakan manusia berada dalam susah payah.",
      "text": "لَقَدْ خَلَقْنَا الْاِنْسَانَ فِيْ كَبَدٍۗ",
      "text_translation_en": "Verily, We have created man into [a life of] pain, toil and trial.",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, Allah asks whether people who are always in trouble, and to be able to live must be able to overcome those difficulties, can boast after succeeding in the struggle. Bragging, for example, thinks he is so powerful that he believes that no one will be able to rival and defeat him, including God himself. He should not have this view because if there is someone who is great, there will definitely be more people who are greater than him. On top of all that is great, God is the greatest of all that is great, as He said: And above every knowledgeable person there is more to know. (Joseph \/ 12: 76)",
      "text_tafsir": "Dalam ayat ini, Allah bertanya apakah manusia yang selalu berada dalam kesulitan, dan untuk bisa hidup harus mampu mengatasi kesulitan itu, dapat menyombongkan dirinya setelah berhasil dalam perjuangan itu. Menyombongkan diri itu misalnya menyangka dirinya begitu kuasanya sehingga berpandangan bahwa tidak akan ada seorang pun yang akan mampu menyaingi dan mengalahkannya, termasuk Allah sendiri. Ia tidak boleh berpandangan demikian karena bila ada seorang yang hebat, pasti akan ada lagi orang yang lebih hebat darinya. Di atas segala yang hebat itu, Allah adalah yang terhebat dari segala yang hebat, sebagaimana difirmankan-Nya:\n\nDan di atas setiap orang yang berpengetahuan ada yang lebih mengetahui. (Yusuf\/12: 76)",
      "text_translation": "Apakah dia (manusia) itu mengira bahwa tidak ada sesuatu pun yang berkuasa atasnya?",
      "text": "اَيَحْسَبُ اَنْ لَّنْ يَّقْدِرَ عَلَيْهِ اَحَدٌ ۘ",
      "text_translation_en": "Does he, then, think that no one has power over him?",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "His arrogance is about his spending to help others. The expenditure in his eyes was so great that he considered it futile. He felt the expense was so great that no one would be able to match it, so he became arrogant.",
      "text_tafsir": "Kesombongannya itu misalnya berkenaan pengeluarannya untuk membantu orang lain. Pengeluaran itu dalam pandangannya sudah begitu besar, sehingga dianggapnya sia-sia. Ia merasa pengeluaran itu sudah sangat banyak sehingga tidak akan ada seorang pun yang akan mampu menandinginya, karena itu ia menjadi sombong.",
      "text_translation": "Dia mengatakan, “Aku telah menghabiskan harta yang banyak.” ",
      "text": "يَقُوْلُ اَهْلَكْتُ مَالًا لُّبَدًاۗ",
      "text_translation_en": "He boasts, \"I have spent wealth abundant!\"",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "God asks about the person who is proud of his expenses, \"Does he think that no one sees his actions?\" That is, if he is arrogant with the expenditure, it means that he sacrificed his wealth just to find a name, then the sacrifice will not be accepted by Him. Do not think that God does not see his actions and does not know the motives behind the good deeds, which are unknown to humans.",
      "text_tafsir": "Allah bertanya mengenai orang yang sombong dengan pengeluarannya itu, \"Apakah ia mengira bahwa tidak seorang pun yang melihat perbuatannya itu?\" Artinya, bila ia sombong dengan pengeluarannya itu, berarti ia mengorbankan kekayaannya hanya untuk mencari nama, maka pengorbanan itu tidak akan diterima-Nya. Jangan ia menyangka bahwa Allah tidak melihat perbuatannya itu dan tidak mengetahui motif di balik perbuatan baiknya itu, yang tidak diketahui oleh manusia.",
      "text_translation": "Apakah dia mengira bahwa tidak ada sesuatu pun yang melihatnya?",
      "text": "اَيَحْسَبُ اَنْ لَّمْ يَرَهٗٓ اَحَدٌۗ",
      "text_translation_en": "Does he, then, think that no one sees him?",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "God then asked the man, \"Did we not give him two eyes?\" That is, in order to gain wealth, he needs two eyes, then who gives him those two eyes instead of God? To make a living he needs to talk, then who gave him a tongue and two lips to speak? In her upbringing, she breastfed both her mother's milk, who provided the milk instead of God? Thus, the success is due to God's help and love. Therefore, he does not need to brag about his wealth. In addition, eyes, tongue, and lust are God's undeserved kindness. He will meet the two paths that God has provided, the right way and the wrong way. He has to use that eye, tongue, and lust for the way that God approves.",
      "text_tafsir": "Allah selanjutnya bertanya mengenai orang itu, \"Tidakkah Kami beri ia dua mata?\" Artinya, untuk dapat mencari kekayaan, ia perlu dua mata, lalu siapakah yang memberinya dua mata itu bila bukan Allah? Untuk mencari rezeki ia perlu berbicara, lalu siapakah yang telah memberinya lidah dan dua bibir untuk mampu bicara? Dalam membesarkannya, ia telah menyusu pada kedua susu ibunya, siapakah yang telah menyediakan air susu ibunya itu bila bukan Allah? Dengan demikian, keberhasilannya adalah karena bantuan dan kasih sayang Allah. Oleh karena itu, ia tidak perlu menyombongkan dirinya karena hartanya.\n\nDi samping itu, mata, lidah, dan nafsu adalah nikmat Allah kepadanya yang tiada taranya. Ia akan bertemu dengan dua jalan yang disediakan Allah, yaitu jalan yang benar dan jalan yang salah. Ia perlu menggunakan mata, lidah, dan nafsu itu untuk jalan yang diridai oleh Allah.",
      "text_translation": "Bukankah Kami telah menjadikan untuknya sepasang mata,",
      "text": "اَلَمْ نَجْعَلْ لَّهٗ عَيْنَيْنِۙ",
      "text_translation_en": "Have We not given him two eyes,",
      "juz_number": 30
    },
    "9": {
      "text_tafsir_en": "God then asked the man, \"Did we not give him two eyes?\" That is, in order to gain wealth, he needs two eyes, then who gives him those two eyes instead of God? To make a living he needs to talk, then who gave him a tongue and two lips to speak? In her upbringing, she breastfed both her mother's milk, who provided the milk instead of God? Thus, the success is due to God's help and love. Therefore, he does not need to brag about his wealth. In addition, eyes, tongue, and lust are God's undeserved kindness. He will meet the two paths that God has provided, the right way and the wrong way. He has to use that eye, tongue, and lust for the way that God approves.",
      "text_tafsir": "Allah selanjutnya bertanya mengenai orang itu, \"Tidakkah Kami beri ia dua mata?\" Artinya, untuk dapat mencari kekayaan, ia perlu dua mata, lalu siapakah yang memberinya dua mata itu bila bukan Allah? Untuk mencari rezeki ia perlu berbicara, lalu siapakah yang telah memberinya lidah dan dua bibir untuk mampu bicara? Dalam membesarkannya, ia telah menyusu pada kedua susu ibunya, siapakah yang telah menyediakan air susu ibunya itu bila bukan Allah? Dengan demikian, keberhasilannya adalah karena bantuan dan kasih sayang Allah. Oleh karena itu, ia tidak perlu menyombongkan dirinya karena hartanya.\n\nDi samping itu, mata, lidah, dan nafsu adalah nikmat Allah kepadanya yang tiada taranya. Ia akan bertemu dengan dua jalan yang disediakan Allah, yaitu jalan yang benar dan jalan yang salah. Ia perlu menggunakan mata, lidah, dan nafsu itu untuk jalan yang diridai oleh Allah.",
      "text_translation": "dan lidah dan sepasang bibir?",
      "text": "وَلِسَانًا وَّشَفَتَيْنِۙ",
      "text_translation_en": "and a tongue, and a pair of lips,",
      "juz_number": 30
    },
    "10": {
      "text_tafsir_en": "God then asked the man, \"Did we not give him two eyes?\" That is, in order to gain wealth, he needs two eyes, then who gives him those two eyes instead of God? To make a living he needs to talk, then who gave him a tongue and two lips to speak? In her upbringing, she breastfed both her mother's milk, who provided the milk instead of God? Thus, the success is due to God's help and love. Therefore, he does not need to brag about his wealth. In addition, eyes, tongue, and lust are God's undeserved kindness. He will meet the two paths that God has provided, the right way and the wrong way. He has to use that eye, tongue, and lust for the way that God approves.",
      "text_tafsir": "Allah selanjutnya bertanya mengenai orang itu, \"Tidakkah Kami beri ia dua mata?\" Artinya, untuk dapat mencari kekayaan, ia perlu dua mata, lalu siapakah yang memberinya dua mata itu bila bukan Allah? Untuk mencari rezeki ia perlu berbicara, lalu siapakah yang telah memberinya lidah dan dua bibir untuk mampu bicara? Dalam membesarkannya, ia telah menyusu pada kedua susu ibunya, siapakah yang telah menyediakan air susu ibunya itu bila bukan Allah? Dengan demikian, keberhasilannya adalah karena bantuan dan kasih sayang Allah. Oleh karena itu, ia tidak perlu menyombongkan dirinya karena hartanya.\n\nDi samping itu, mata, lidah, dan nafsu adalah nikmat Allah kepadanya yang tiada taranya. Ia akan bertemu dengan dua jalan yang disediakan Allah, yaitu jalan yang benar dan jalan yang salah. Ia perlu menggunakan mata, lidah, dan nafsu itu untuk jalan yang diridai oleh Allah.",
      "text_translation": "Dan Kami telah menunjukkan kepadanya dua jalan (kebajikan dan kejahatan),",
      "text": "وَهَدَيْنٰهُ النَّجْدَيْنِۙ",
      "text_translation_en": "and shown him the two highways [of good and evil]?",
      "juz_number": 30
    },
    "11": {
      "text_tafsir_en": "In this verse, God asks, \"Shouldn't he tidy up the steep climb?\" That is, humans should work hard and fight as much as possible to overcome all obstacles in order to successfully complete big jobs and leave big services.",
      "text_tafsir": "Dalam ayat ini, Allah bertanya, \"Apakah tidak sebaiknya ia merapikan jalan mendaki yang terjal?\" Artinya, manusia seharusnya bekerja keras dan berjuang semaksimal mungkin mengatasi segala rintangan supaya berhasil menyelesaikan pekerjaan-pekerjaan besar dan meninggalkan jasa-jasa besar.",
      "text_translation": "tetapi dia tidak menempuh jalan yang mendaki dan sukar?",
      "text": "فَلَا اقْتَحَمَ الْعَقَبَةَ ۖ",
      "text_translation_en": "But he would not try to ascend the steep uphill road...",
      "juz_number": 30
    },
    "12": {
      "text_tafsir_en": "God asks people to motivate them, \"What is a steep climb?\" That is, big jobs are indeed difficult to do but must be overcome.",
      "text_tafsir": "Allah bertanya kepada manusia untuk memotivasi mereka, \"Apakah jalan mendaki yang terjal itu?\" Artinya, pekerjaan-pekerjaan besar itu memang sulit dikerjakan tetapi harus diatasi.",
      "text_translation": "Dan tahukah kamu apakah jalan yang mendaki dan sukar itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا الْعَقَبَةُ ۗ",
      "text_translation_en": "And what could make thee conceive what it is, that steep uphill road?",
      "juz_number": 30
    },
    "13": {
      "text_tafsir_en": "Allah insisted that the great work that was difficult to do was to free the slaves. That was because slavery at that time was very deeply penetrated into the daily lives of people, both in the Arab world and beyond. All human activities, such as trade, agriculture, military, even daily life, etc., could not have proceeded well at that time without slaves doing heavy work. But Allah asks Muslims to abolish slavery. The implementation is indeed not all at once, but gradually. A master should be able to free his slaves, this is what they feel is very heavy. Slaughtering is also carried out through other means, for example by sanctions for violations where the penalty is to free slaves. Also by giving an opportunity to the slave to redeem himself.",
      "text_tafsir": "Allah menegaskan bahwa pekerjaan besar yang sulit dilaksanakan itu adalah memerdekakan budak. Hal itu karena perbudakan pada waktu itu sudah sangat dalam merasuk ke dalam kehidupan masyarakat sehari-hari, baik di dunia Arab maupun di luarnya. Segala aktivitas manusia, seperti perdagangan, pertanian, kemiliteran, bahkan kehidupan sehari-hari, dan sebagainya, tidak akan bisa berjalan dengan baik pada waktu itu tanpa adanya budak yang mengerjakan pekerjaan-pekerjaan berat. Namun Allah meminta umat Islam agar menghapus perbudakan. Pelaksanaannya memang tidak sekaligus, tetapi berangsur-angsur. Seorang tuan seharusnya dapat memerdekakan budaknya, inilah yang dirasakan mereka sangat berat. Pemerdekaan budak juga dilakukan melalui cara-cara lain, misalnya dengan sanksi pelanggaran-pelanggaran yang hukumannya adalah memerdekakan budak. Juga dengan cara memberi kesempatan kepada budak itu untuk menebus dirinya.",
      "text_translation": "(yaitu) melepaskan perbudakan (hamba sahaya),",
      "text": "فَكُّ رَقَبَةٍۙ",
      "text_translation_en": "[It is] the freeing of one's neck [from the burden of sin],",
      "juz_number": 30
    },
    "14": {
      "text_tafsir_en": "Other big and hard jobs that are difficult to do are to feed people during the famine, the economic chaos, and so on. That's because those who give also need it. However, Allah is testing Muslims, whether they are willing and able to do it.",
      "text_tafsir": "Pekerjaan besar dan berat lainnya yang sulit dikerjakan adalah memberi makan orang pada musim kelaparan, ekonomi morat-marit, dan sebagainya. Hal itu karena yang memberi juga membutuhkannya. Namun demikian, Allah menguji umat Islam, apakah mereka mau dan mampu mengerjakannya.",
      "text_translation": "atau memberi makan pada hari terjadi kelaparan,",
      "text": "اَوْ اِطْعَامٌ فِيْ يَوْمٍ ذِيْ مَسْغَبَةٍۙ",
      "text_translation_en": "or the feeding, upon a day of [one's own] hunger,",
      "juz_number": 30
    },
    "15": {
      "text_tafsir_en": "Feeding hungry people during famine is first aimed at orphans who have family relations with the giver. Who else would want to pay attention to them if they were not their own family because their parents are gone? Attention to the family must take precedence as the following words of the Prophet Muhammad: Alms to the poor are alms (one charity), alms to people who have family relations there are two charities, alms and silaturrahim. (History of Ahmad, at-Tirmidhi, and an-Nasa'i). Furthermore, the main concern is the poor people who are thrown to the ground, those who are so poor that they have no place to shelter. They are for example homeless people, homeless people, street children, and so on.",
      "text_tafsir": "Memberi makan orang yang lapar pada masa kelaparan pertama sekali ditujukan pada anak-anak yatim yang ada hubungan keluarga dengan pemberi. Siapa lagi yang akan mau memperhatikan mereka bila bukan keluarga sendiri karena orang tuanya sudah tiada? Perhatian pada keluarga memang harus didahulukan sebagaimana sabda Rasulullah saw berikut:\n\nSedekah kepada orang miskin adalah sedekah (satu amal), sedekah kepada orang yang punya hubungan keluarga ada dua amal, sedekah dan silaturrahim. (Riwayat Ahmad, at-Tirmidhi, dan an-Nasa'i).\n\nSelanjutnya yang perlu mendapat perhatian utama adalah orang-orang miskin yang terhempas ke tanah, yaitu orang-orang yang begitu miskinnya sehingga tidak punya tempat untuk berteduh. Mereka misalnya tunawisma, gelandangan, anak jalanan, dan sebagainya.",
      "text_translation": "(kepada) anak yatim yang ada hubungan kerabat,",
      "text": "يَّتِيْمًا ذَا مَقْرَبَةٍۙ",
      "text_translation_en": "of an orphan near of kin,",
      "juz_number": 30
    },
    "16": {
      "text_tafsir_en": "Feeding hungry people during famine is first aimed at orphans who have family relations with the giver. Who else would want to pay attention to them if they were not their own family because their parents are gone? Attention to the family must take precedence as the following words of the Prophet Muhammad: Alms to the poor are alms (one charity), alms to people who have family relations there are two charities, alms and silaturrahim. (History of Ahmad, at-Tirmidhi, and an-Nasa'i). Furthermore, the main concern is the poor people who are thrown to the ground, those who are so poor that they have no place to shelter. They are for example homeless people, homeless people, street children, and so on.",
      "text_tafsir": "Memberi makan orang yang lapar pada masa kelaparan pertama sekali ditujukan pada anak-anak yatim yang ada hubungan keluarga dengan pemberi. Siapa lagi yang akan mau memperhatikan mereka bila bukan keluarga sendiri karena orang tuanya sudah tiada? Perhatian pada keluarga memang harus didahulukan sebagaimana sabda Rasulullah saw berikut:\n\nSedekah kepada orang miskin adalah sedekah (satu amal), sedekah kepada orang yang punya hubungan keluarga ada dua amal, sedekah dan silaturrahim. (Riwayat Ahmad, at-Tirmidhi, dan an-Nasa'i).\n\nSelanjutnya yang perlu mendapat perhatian utama adalah orang-orang miskin yang terhempas ke tanah, yaitu orang-orang yang begitu miskinnya sehingga tidak punya tempat untuk berteduh. Mereka misalnya tunawisma, gelandangan, anak jalanan, dan sebagainya.",
      "text_translation": "atau orang miskin yang sangat fakir.",
      "text": "اَوْ مِسْكِيْنًا ذَا مَتْرَبَةٍۗ",
      "text_translation_en": "or of a needy [stranger] lying in the dust –",
      "juz_number": 30
    },
    "17": {
      "text_tafsir_en": "The other hard work is believing and admonishing each other to be patient and loving among fellow Muslims. Patience is the ability to hold back, to endure adversity, and to work hard to overcome it. Muslims should be able to prove their faith by exercising their patience, and encouraging other Muslims to do so. Also hard to do is loving others like loving yourself or your family. However, Muslims should be able to prove their faith by exercising their mutual love, just as the Messenger of Allah said: The Merciful is the Most Merciful. Love those who are on earth, so those who are in heaven will love you. (History of at-Tirmidhi, Abu Dawud, and Ahmad of Abdullah bin 'Amr).",
      "text_tafsir": "Pekerjaan berat lainnya adalah beriman dan saling menasihati untuk sabar dan menyayangi antara sesama Muslim. Sabar adalah kemampuan menahan diri, tabah menghadapi kesulitan, dan usaha keras mengatasi kesulitan tersebut. Kaum Muslimin harus mampu membuktikan imannya dengan melaksanakan sikap sabar itu, dan mendorong kaum Muslimin lainnya untuk melaksanakannya.\n\nJuga yang berat melaksanakannya adalah menyayangi orang lain seperti menyayangi diri sendiri atau keluarga sendiri. Akan tetapi, umat Islam harus mampu membuktikan imannya dengan melaksanakan sikap saling menyayangi itu, sebagaimana juga diperintahkan Rasulullah:\n\nOrang yang penyayang disayang oleh Yang Maha Penyayang. Sayangilah orang yang ada di bumi, maka yang ada di langit akan menyayangi kalian. (Riwayat at-Tirmidhi, Abu Dawud, dan Ahmad dari Abdullah bin 'Amr).",
      "text_translation": "Kemudian dia termasuk orang-orang yang beriman dan saling berpesan untuk bersabar dan saling berpesan untuk berkasih sayang.",
      "text": "ثُمَّ كَانَ مِنَ الَّذِيْنَ اٰمَنُوْا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِۗ",
      "text_translation_en": "and being, withal, of those who have attained to faith, and who enjoin upon one another patience in adversity, and enjoin upon one another compassion.",
      "juz_number": 30
    },
    "18": {
      "text_tafsir_en": "Muslims who succeed in performing the above difficult tasks are classified as \"right-wing\". The response of the \"right-wingers\" is a graceful heaven, as stated in Surah al-Waqi'ah \/ 56: 27-40.",
      "text_tafsir": "Kaum Muslimin yang berhasil melaksanakan pekerjaan-pekerjaan sulit di atas digolongkan sebagai \"golongan kanan\". Balasan bagi \"golongan kanan\" tersebut adalah surga yang penuh nikmat, sebagaimana dinyatakan dalam Surah al-Waqi'ah\/56: 27-40.",
      "text_translation": "Mereka (orang-orang yang beriman dan saling berpesan itu) adalah golongan kanan.",
      "text": "اُولٰۤىِٕكَ اَصْحٰبُ الْمَيْمَنَةِۗ",
      "text_translation_en": "Such are they that have attained to righteousness;",
      "juz_number": 30
    },
    "19": {
      "text_tafsir_en": "Those who deny it do not want to carry out those big and difficult jobs. They are called ashabul-masyamah, which is the left. Their place is a hell that is tightly closed, so that hell is so unusually hot. They certainly will suffer greatly in it. As such, he finds life's unparalleled hardships in the afterlife, nothing compared to the difficulties of doing good works of time in the world.",
      "text_tafsir": "Mereka yang ingkar tidak mau melaksanakan pekerjaan-pekerjaan besar dan sulit itu. Mereka disebut ashabul-masy'amah, yaitu golongan kiri. Tempat mereka adalah neraka yang tertutup rapat, sehingga neraka begitu luar biasa panasnya. Mereka itu tentu akan sangat menderita di dalamnya. Dengan demikian, ia menemukan kesulitan hidup yang tiada taranya di akhirat, tidak sebanding dengan kesulitan mengerjakan perbuat-perbuatan baik waktu di dunia.",
      "text_translation": "Dan orang-orang yang kafir kepada ayat-ayat Kami, mereka itu adalah golongan kiri.",
      "text": "وَالَّذِيْنَ كَفَرُوْا بِاٰيٰتِنَا هُمْ اَصْحٰبُ الْمَشْئَمَةِۗ",
      "text_translation_en": "whereas those who are bent on denying the truth of Our messages – they are such as have lost themselves in evil,",
      "juz_number": 30
    },
    "20": {
      "text_tafsir_en": "Those who deny it do not want to carry out those big and difficult jobs. They are called ashabul-masyamah, which is the left. Their place is a hell that is tightly closed, so that hell is so unusually hot. They certainly will suffer greatly in it. As such, he finds life's unparalleled hardships in the afterlife, nothing compared to the difficulties of doing good works of time in the world.",
      "text_tafsir": "Mereka yang ingkar tidak mau melaksanakan pekerjaan-pekerjaan besar dan sulit itu. Mereka disebut ashabul-masy'amah, yaitu golongan kiri. Tempat mereka adalah neraka yang tertutup rapat, sehingga neraka begitu luar biasa panasnya. Mereka itu tentu akan sangat menderita di dalamnya. Dengan demikian, ia menemukan kesulitan hidup yang tiada taranya di akhirat, tidak sebanding dengan kesulitan mengerjakan perbuat-perbuatan baik waktu di dunia.",
      "text_translation": "Mereka berada dalam neraka yang ditutup rapat.",
      "text": "عَلَيْهِمْ نَارٌ مُّؤْصَدَةٌ ࣖ",
      "text_translation_en": "[with] fire closing in upon them.",
      "juz_number": 30
    }
  },
  "name": "البلد",
  "name_translation_en": "The City",
  "name_translation": "Negeri",
  "name_latin": "Al-Balad"
}