{
  "number": 91,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 15,
  "ayat": {
    "1": {
      "text_tafsir_en": "Allah swears by the sun and its light at the very light of the day and contrasts with the moment before darkness which covered the universe. Then Allah swears by the moon which is opposite to the sun, because it is not the source of light but only receives light from the sun. According to scientific studies, light in the morning is the most complete wealth of wavelengths. Therefore, the morning sun's best properties for humans. The sun is the main energy source for humans, while the light consists of visible light, infrared, and ultraviolet. Visible light has seven different spectra and each has different uses for the human body. The infrared is useful for reducing pain in the muscles, and ultraviolet functions as a phytocatalyst which accelerates the change of pro-vitamin D in human skin into vitamin D.",
      "text_tafsir": "Allah bersumpah dengan matahari dan cahayanya pada waktu duha yang sangat terang dan kontras dengan sesaat sebelumnya di mana kegelapan menutup alam ini. Kemudian Allah bersumpah dengan bulan yang bertolak belakang dengan matahari, sebab ia bukan sumber cahaya tetapi hanya menerima cahaya dari matahari.\n\nMenurut kajian ilmiah, cahaya di pagi hari adalah yang paling lengkap kekayaan panjang gelombangnya. Oleh karena itu, cahaya matahari pagi paling baik khasiatnya bagi manusia. Matahari adalah sumber energi utama bagi manusia, sedang cahayanya terdiri dari cahaya tampak, inframerah, dan ultraviolet. Cahaya tampak memiliki tujuh spektrum yang berbeda dan masing-masing memiliki kegunaan yang berbeda bagi tubuh manusia. Adapun inframerah bermanfaat untuk mengurangi rasa sakit pada otot-otot, dan ultraviolet berfungsi sebagai fitokatalis yang mempercepat perubahan pro-vitamin D yang ada pada kulit manusia menjadi vitamin D.",
      "text_translation": "Demi matahari dan sinarnya pada pagi hari,",
      "text": "وَالشَّمْسِ وَضُحٰىهَاۖ",
      "text_translation_en": "CONSIDER the sun and its radiant brightness,",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "Allah swears by the sun and its light at the very light of the day and contrasts with the moment before darkness which covered the universe. Then Allah swears by the moon which is opposite to the sun, because it is not the source of light but only receives light from the sun. According to scientific studies, light in the morning is the most complete wealth of wavelengths. Therefore, the morning sun's best properties for humans. The sun is the main energy source for humans, while the light consists of visible light, infrared, and ultraviolet. Visible light has seven different spectra and each has different uses for the human body. The infrared is useful for reducing pain in the muscles, and ultraviolet functions as a phytocatalyst which accelerates the change of pro-vitamin D in human skin into vitamin D.",
      "text_tafsir": "Allah bersumpah dengan matahari dan cahayanya pada waktu duha yang sangat terang dan kontras dengan sesaat sebelumnya di mana kegelapan menutup alam ini. Kemudian Allah bersumpah dengan bulan yang bertolak belakang dengan matahari, sebab ia bukan sumber cahaya tetapi hanya menerima cahaya dari matahari.\n\nMenurut kajian ilmiah, cahaya di pagi hari adalah yang paling lengkap kekayaan panjang gelombangnya. Oleh karena itu, cahaya matahari pagi paling baik khasiatnya bagi manusia. Matahari adalah sumber energi utama bagi manusia, sedang cahayanya terdiri dari cahaya tampak, inframerah, dan ultraviolet. Cahaya tampak memiliki tujuh spektrum yang berbeda dan masing-masing memiliki kegunaan yang berbeda bagi tubuh manusia. Adapun inframerah bermanfaat untuk mengurangi rasa sakit pada otot-otot, dan ultraviolet berfungsi sebagai fitokatalis yang mempercepat perubahan pro-vitamin D yang ada pada kulit manusia menjadi vitamin D.",
      "text_translation": "demi bulan apabila mengiringinya,",
      "text": "وَالْقَمَرِ اِذَا تَلٰىهَاۖ",
      "text_translation_en": "and the moon as it reflects the sun!",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "Then Allah swears by day and night. The day reveals the sun, while the night hides the sun. With this, Allah gives a signal about the moon and earth's rotation system to the sun as a marker of time for humans. The rotation of the earth towards the sun gives rise to a system of time shamsiah markings while the rotation of the moon towards the earth gives rise to the qomariyah time marker. The movement of these three celestial bodies which is so structured shows how powerful God is.",
      "text_tafsir": "Selanjutnya Allah bersumpah dengan siang dan malam. Siang menampakkan matahari, sedangkan malam menyembunyikan matahari. Dengan ini, Allah memberikan isyarat tentang sistem perputaran bulan dan bumi terhadap matahari sebagai penanda waktu bagi manusia. Perputaran bumi terhadap matahari menimbulkan sistem penanda waktu syamsiah sedang perputaran bulan terhadap bumi menimbulkan penanda waktu qomariyah. Pergerakan ketiga benda langit ini yang begitu terstruktur tersebut menunjukkan betapa kuasa Allah.",
      "text_translation": "demi siang apabila menampakkannya,",
      "text": "وَالنَّهَارِ اِذَا جَلّٰىهَاۖ",
      "text_translation_en": "Consider the day as it reveals the world,",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "Then Allah swears by day and night. The day reveals the sun, while the night hides the sun. With this, Allah gives a signal about the moon and earth's rotation system to the sun as a marker of time for humans. The rotation of the earth towards the sun gives rise to a system of time shamsiah markings while the rotation of the moon towards the earth gives rise to the qomariyah time marker. The movement of these three celestial bodies which is so structured shows how powerful God is.",
      "text_tafsir": "Selanjutnya Allah bersumpah dengan siang dan malam. Siang menampakkan matahari, sedangkan malam menyembunyikan matahari. Dengan ini, Allah memberikan isyarat tentang sistem perputaran bulan dan bumi terhadap matahari sebagai penanda waktu bagi manusia. Perputaran bumi terhadap matahari menimbulkan sistem penanda waktu syamsiah sedang perputaran bulan terhadap bumi menimbulkan penanda waktu qomariyah. Pergerakan ketiga benda langit ini yang begitu terstruktur tersebut menunjukkan betapa kuasa Allah.",
      "text_translation": "demi malam apabila menutupinya (gelap gulita),",
      "text": "وَالَّيْلِ اِذَا يَغْشٰىهَاۖ",
      "text_translation_en": "and the night as it veils it darkly!",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "Furthermore, Allah swears by heaven and earth. The sky, which is the cosmos and all of its contents, supports the sky so that it still functions as the roof of the earth. And the earth is spread out so that it provides the potential that humans can use to live on it.",
      "text_tafsir": "Selanjutnya lagi, Allah bersumpah dengan langit dan bumi. Langit, yaitu kosmos beserta segala isinya, menyangga langit itu sehingga tetap berfungsi sebagai atap bumi. Dan bumi itu terhampar sehingga menyediakan potensi-potensi yang dapat dimanfaatkan manusia untuk hidup di atasnya.",
      "text_translation": "demi langit serta pembinaannya (yang menakjubkan),",
      "text": "وَالسَّمَاۤءِ وَمَا بَنٰىهَاۖ",
      "text_translation_en": "Consider the sky and its wondrous make,",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "Furthermore, Allah swears by heaven and earth. The sky, which is the cosmos and all of its contents, supports the sky so that it still functions as the roof of the earth. And the earth is spread out so that it provides the potential that humans can use to live on it.",
      "text_tafsir": "Selanjutnya lagi, Allah bersumpah dengan langit dan bumi. Langit, yaitu kosmos beserta segala isinya, menyangga langit itu sehingga tetap berfungsi sebagai atap bumi. Dan bumi itu terhampar sehingga menyediakan potensi-potensi yang dapat dimanfaatkan manusia untuk hidup di atasnya.",
      "text_translation": "demi bumi serta penghamparannya,",
      "text": "وَالْاَرْضِ وَمَا طَحٰىهَاۖ",
      "text_translation_en": "and the earth and all its expanse!",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "Finally, God swears by the human self He has created with perfect physical and psychological conditions. After creating it perfectly, God enters into man the potential for evil and good.",
      "text_tafsir": "Terakhir, Allah bersumpah dengan diri manusia yang telah Ia ciptakan dengan kondisi fisik dan psikis yang sempurna. Setelah menciptakannya secara sempurna, Allah memasukkan ke dalam diri manusia potensi jahat dan baik.",
      "text_translation": "demi jiwa serta penyempurnaan (ciptaan)nya,",
      "text": "وَنَفْسٍ وَّمَا سَوّٰىهَاۖ",
      "text_translation_en": "Consider the human self, and how it is formed in accordance with what it is meant to be,",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "Finally, God swears by the human self He has created with perfect physical and psychological conditions. After creating it perfectly, God enters into man the potential for evil and good.",
      "text_tafsir": "Terakhir, Allah bersumpah dengan diri manusia yang telah Ia ciptakan dengan kondisi fisik dan psikis yang sempurna. Setelah menciptakannya secara sempurna, Allah memasukkan ke dalam diri manusia potensi jahat dan baik.",
      "text_translation": "maka Dia mengilhamkan kepadanya (jalan) kejahatan dan ketakwaannya,",
      "text": "فَاَلْهَمَهَا فُجُوْرَهَا وَتَقْوٰىهَاۖ",
      "text_translation_en": "and how it is imbued with moral failings as well as with consciousness of God!",
      "juz_number": 30
    },
    "9": {
      "text_tafsir_en": "In these verses, God emphasizes the message that is so important that He needs to swear. The message is that the person who purifies himself, that is to control himself so that only good works will be blessed, will be happy in the world and especially in the hereafter. But those who defile themselves, following their passions and committing sinful acts, will be doomed, unhappy in the world and in the hereafter to hell.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menegaskan pesan yang begitu pentingnya sehingga untuk itu Ia perlu bersumpah. Pesan itu adalah bahwa orang yang membersihkan dirinya, yaitu mengendalikan dirinya sehingga hanya mengerjakan perbuatan-perbuatan baik, akan beruntung, yaitu bahagia di dunia dan terutama di akhirat. Sedangkan orang yang mengotori dirinya, yaitu mengikuti hawa nafsunya sehingga melakukan perbuatan-perbuatan dosa, akan celaka, yaitu tidak bahagia di dunia dan di akhirat masuk neraka.",
      "text_translation": "sungguh beruntung orang yang menyucikannya (jiwa itu),",
      "text": "قَدْ اَفْلَحَ مَنْ زَكّٰىهَاۖ",
      "text_translation_en": "To a happy state shall indeed attain he who causes this [self] to grow in purity,",
      "juz_number": 30
    },
    "10": {
      "text_tafsir_en": "In these verses, God emphasizes the message that is so important that He needs to swear. The message is that the person who purifies himself, that is to control himself so that only good works will be blessed, will be happy in the world and especially in the hereafter. But those who defile themselves, following their passions and committing sinful acts, will be doomed, unhappy in the world and in the hereafter to hell.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah menegaskan pesan yang begitu pentingnya sehingga untuk itu Ia perlu bersumpah. Pesan itu adalah bahwa orang yang membersihkan dirinya, yaitu mengendalikan dirinya sehingga hanya mengerjakan perbuatan-perbuatan baik, akan beruntung, yaitu bahagia di dunia dan terutama di akhirat. Sedangkan orang yang mengotori dirinya, yaitu mengikuti hawa nafsunya sehingga melakukan perbuatan-perbuatan dosa, akan celaka, yaitu tidak bahagia di dunia dan di akhirat masuk neraka.",
      "text_translation": "dan sungguh rugi orang yang mengotorinya.",
      "text": "وَقَدْ خَابَ مَنْ دَسّٰىهَاۗ",
      "text_translation_en": "and truly lost is he who buries it [in darkness].",
      "juz_number": 30
    },
    "11": {
      "text_tafsir_en": "The Samudites were the people of Prophet Saleh. They have rejected and rejected the prophecies and teachings that Saleh brought from God. Prophet Saleh was miraculously given by God as a test for his people, a female camel from a large rock, to match the skill of the people who were very standard in the art of stone sculpture. If they were standard in the art of the statue that the statue would appear to be alive, then the miracle of Prophet Saleh was to portray a female camel actually living from a rock. However, they did not acknowledge it, and tried to kill the camel.",
      "text_tafsir": "Kaum Samud adalah umat Nabi Saleh. Mereka telah mendustakan dan mengingkari kenabian dan ajaran-ajaran yang dibawa Nabi Saleh dari Allah. Nabi Saleh diberi mukjizat oleh Allah sebagai ujian bagi kaumnya, yaitu seekor unta betina yang dijelmakan dari sebuah batu besar, untuk menandingi keahlian kaum itu yang sangat piawai dalam seni patung dari batu. Bila mereka piawai dalam seni patung sehingga patung itu terlihat bagaikan hidup, maka mukjizat Nabi Saleh adalah menjelmakan seekor unta betina yang benar-benar hidup dari sebuah batu. Akan tetapi, mereka tidak mengakuinya, dan berusaha membunuh unta itu.",
      "text_translation": "(Kaum) samud telah mendustakan (rasulnya) karena mereka melampaui batas (zalim),",
      "text": "كَذَّبَتْ ثَمُوْدُ بِطَغْوٰىهَآ  ۖ",
      "text_translation_en": "TO [THIS] TRUTH gave the lie, in their overweening arrogance, [the tribe of] Thamud,",
      "juz_number": 30
    },
    "12": {
      "text_tafsir_en": "The beginning of the tragedy for the Samuds was when one of their most evil, Qudar bin Salif, appeared. He was a very brave, mighty, and fierce man. He came to provoke his people to kill the miracle camel of the Prophet Saleh.",
      "text_tafsir": "Awal kecelakaan bagi kaum Samud adalah ketika tampil seorang yang paling jahat dari mereka, yaitu Qudar bin Salif. Ia adalah seorang yang sangat berani, perkasa, dan bengis. Ia datang memprovokasi kaumnya untuk membunuh unta betina mukjizat Nabi Saleh.",
      "text_translation": "ketika bangkit orang yang paling celaka di antara mereka,",
      "text": "اِذِ انْۢبَعَثَ اَشْقٰىهَاۖ",
      "text_translation_en": "when that most hapless wretch from among them rushed forward [to commit his evil deed],",
      "juz_number": 30
    },
    "13": {
      "text_tafsir_en": "Saleh warned his people not to disturb the camel. He warned that the camel was a miracle from God, and his right to have a drink with them, had to be respected. He also warned that if they bothered him, they would be in danger.",
      "text_tafsir": "Nabi Saleh memperingatkan kaumnya agar tidak mengganggu unta itu. Ia memperingatkan bahwa unta itu adalah mukjizat dari Allah, dan haknya untuk memperoleh minum berselang hari dengan mereka, harus dihormati. Ia memperingatkan pula bahwa bila mereka mengganggunya, mereka akan mendapat bahaya.",
      "text_translation": "lalu Rasul Allah (Saleh) berkata kepada mereka, “(Biarkanlah) unta betina dari Allah ini dengan minumannya.”",
      "text": "فَقَالَ لَهُمْ رَسُوْلُ اللّٰهِ نَاقَةَ اللّٰهِ وَسُقْيٰهَاۗ",
      "text_translation_en": "although God's apostle had told them, \"It is a she-camel belonging to God, so let her drink [and do her no harm]!\"",
      "juz_number": 30
    },
    "14": {
      "text_tafsir_en": "However, the people viewed Prophet Saleh as a lie, as well as the camel as a miracle, and considered the Prophet's monument to be negligent. They seized the camels in large numbers, and Qudar bin Salif killed him by cutting them into pieces. In the end God made their land level with the earth, sending forth lightning that was accompanied by a terrible earthquake, in return for their rebellion and sins.",
      "text_tafsir": "Akan tetapi, kaumnya memandang Nabi Saleh bohong, begitu juga unta itu sebagai mukjizat, dan menganggap sepi peringatan Nabi Saleh tersebut. Unta itu mereka tangkap beramai-ramai, lalu Qudar bin Salif membunuhnya dengan cara memotong-motongnya. Akhirnya Allah meratakan negeri mereka dengan tanah, dengan mengirim petir yang menggelegar yang diiringi gempa yang dahsyat, sebagai balasan pembangkangan dan dosa-dosa mereka.",
      "text_translation": "Namun mereka mendustakannya dan menyembelihnya, karena itu Tuhan membinasakan mereka karena dosanya, lalu diratakan-Nya (dengan tanah),",
      "text": "فَكَذَّبُوْهُ فَعَقَرُوْهَاۖ فَدَمْدَمَ عَلَيْهِمْ رَبُّهُمْ بِذَنْۢبِهِمْ فَسَوّٰىهَاۖ",
      "text_translation_en": "But they gave him the lie, and cruelly slaughtered her - whereupon their Sustainer visited them with utter destruction for this their sin, destroying them all alike:",
      "juz_number": 30
    },
    "15": {
      "text_tafsir_en": "God does not care about the disaster He inflicts on them with such great sacrifice. That was because of their very rebellious rebellion, the killing of the female camel (miracle) that He had revealed to His prophet.",
      "text_tafsir": "Allah tidak peduli bencana yang Ia timpakan kepada mereka dengan korban yang begitu besar. Hal itu karena pembangkangan mereka yang sudah sangat keterlaluan, yaitu membunuh unta betina (mukjizat) yang diturunkan-Nya kepada nabi-Nya.",
      "text_translation": "dan Dia tidak takut terhadap akibatnya.",
      "text": "وَلَا يَخَافُ عُقْبٰهَا ࣖ",
      "text_translation_en": "for none [of them] had any fear of what might befall them.",
      "juz_number": 30
    }
  },
  "name": "الشمس",
  "name_translation_en": "The Sun",
  "name_translation": "Matahari",
  "name_latin": "Asy-Syams"
}