{
  "number": 93,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 11,
  "ayat": {
    "1": {
      "text_tafsir_en": "In these verses, Allah swears by two signs of His greatness, the dhuha (the time of the rising of the sun) with its light and night and its darkness and silence, that He did not abandon His Messenger, Muhammad, nor rebuke him, as people say or the Prophet's own feelings.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah bersumpah dengan dua macam tanda-tanda kebesaran-Nya, yaitu dhuha (waktu matahari naik sepenggalah) bersama cahayanya dan malam beserta kegelapan dan kesunyiannya, bahwa Dia tidak meninggalkan Rasul-Nya, Muhammad, dan tidak pula memarahinya, sebagaimana orang-orang mengatakannya atau perasaan Rasulullah sendiri.",
      "text_translation": "Demi waktu duha (ketika matahari naik sepenggalah),",
      "text": "وَالضُّحٰىۙ",
      "text_translation_en": "CONSIDER the bright morning hours,",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In these verses, Allah swears by two signs of His greatness, the dhuha (the time of the rising of the sun) with its light and night and its darkness and silence, that He did not abandon His Messenger, Muhammad, nor rebuke him, as people say or the Prophet's own feelings.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah bersumpah dengan dua macam tanda-tanda kebesaran-Nya, yaitu dhuha (waktu matahari naik sepenggalah) bersama cahayanya dan malam beserta kegelapan dan kesunyiannya, bahwa Dia tidak meninggalkan Rasul-Nya, Muhammad, dan tidak pula memarahinya, sebagaimana orang-orang mengatakannya atau perasaan Rasulullah sendiri.",
      "text_translation": "dan demi malam apabila telah sunyi,",
      "text": "وَالَّيْلِ اِذَا سَجٰىۙ",
      "text_translation_en": "and the night when it grows still and dark.",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "In these verses, Allah swears by two signs of His greatness, the dhuha (the time of the rising of the sun) with its light and night and its darkness and silence, that He did not abandon His Messenger, Muhammad, nor rebuke him, as people say or the Prophet's own feelings.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah bersumpah dengan dua macam tanda-tanda kebesaran-Nya, yaitu dhuha (waktu matahari naik sepenggalah) bersama cahayanya dan malam beserta kegelapan dan kesunyiannya, bahwa Dia tidak meninggalkan Rasul-Nya, Muhammad, dan tidak pula memarahinya, sebagaimana orang-orang mengatakannya atau perasaan Rasulullah sendiri.",
      "text_translation": "Tuhanmu tidak meninggalkan engkau (Muhammad) dan tidak (pula) membencimu,",
      "text": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلٰىۗ",
      "text_translation_en": "Thy Sustainer has not forsaken thee, nor does He scorn thee:",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "In this verse, God reveals something that stretches the chest of the Prophet and rests his soul, that the Prophet's condition in his life in the coming days will be better than in the past. His fame will increase and his name will be known. God will always guide him to glory and to greatness. It was as if God were saying to His Messenger, \"Do you think that I will leave you? Even now, your position on my side is stronger and closer than ever.\" The promise of Allah to the Prophet Muhammad continued to be evident since the name of the Prophet (saw) became more and more popular, his position growing stronger, reaching a level never reached by the apostles before. Allah has made Prophet Muhammad a mercy, a guide, and a light to all of His world and to all His servants. Allah made love to Prophet Muhammad including his love for him; following the Prophet and obeying it is the way to obtain His favors, and to make the people of the Prophet a witness to all mankind. The Prophet himself had spread the religion of Allah according to His will to the ends of the earth. It is an unparalleled greatness, an unrivaled excellence, and a glory that no one can count on. All of these are the gifts of God to those whom He wills.",
      "text_tafsir": "Dalam ayat ini, Allah mengungkapkan sesuatu yang melapangkan dada Nabi saw dan menenteramkan jiwanya, bahwa keadaan Nabi dalam kehidupannya di hari-hari mendatang akan lebih baik dibandingkan dengan hari-hari yang telah lalu. Kebesarannya akan bertambah dan namanya akan lebih dikenal. Allah akan selalu membimbingnya untuk mencapai kemuliaan dan untuk menuju kepada kebesaran.\n\nSeakan-akan Allah mengatakan kepada Rasul-Nya, \"Apakah engkau kira bahwa Aku akan meninggalkanmu? Bahkan kedudukanmu di sisi-Ku sekarang lebih kukuh dan lebih dekat dari masa yang sudah-sudah.\"\n\nJanji Allah kepada Nabi Muhammad terus terbukti karena sejak itu nama Nabi saw semakin terkenal, kedudukannya semakin bertambah kuat, sehingga mencapai tingkat yang tidak pernah dicapai oleh para rasul sebelumnya. Allah telah menjadikan Nabi Muhammad sebagai rahmat, petunjuk, dan cahaya untuk seluruh alam dan seluruh hamba-Nya. Allah menjadikan cinta kepada Nabi Muhammad termasuk cinta kepada-Nya juga; mengikuti Nabi dan mematuhinya adalah jalan untuk memperoleh nikmat-nikmat-Nya, serta menjadikan umat Nabi sebagai saksi-saksi untuk manusia seluruhnya. Nabi saw sendiri telah menyiarkan agama Allah sesuai dengan kehendak-Nya sehingga sampai ke pelosok-pelosok dunia.\n\nIni adalah suatu kebesaran yang tiada bandingnya, suatu keunggulan yang tiada taranya, dan suatu kemuliaan yang tidak ada yang dapat mengimbanginya. Semua itu adalah anugerah Allah yang diberikan kepada orang yang dikehendaki-Nya.",
      "text_translation": "dan sungguh, yang kemudian itu lebih baik bagimu dari yang permulaan.",
      "text": "وَلَلْاٰخِرَةُ خَيْرٌ لَّكَ مِنَ الْاُوْلٰىۗ",
      "text_translation_en": "for, indeed, the life to come will be better for thee than this earlier part [of thy life]!",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, God sends the good news to the Prophet Muhammad, that He will continue to bestow His grace upon him, that he may be happy and happy. Among His gifts was the continuing revelation of revelation thereafter as a guide for the Prophet and his people to find happiness in life in this world and in the hereafter. He will prevail over the religion that Muhammad carried over all other religions, and he will rise above all mankind.",
      "text_tafsir": "Dalam ayat ini, Allah menyampaikan berita gembira kepada Nabi Muhammad, bahwa Dia akan terus-menerus melimpahkan anugerah-Nya kepada beliau, sehingga beliau menjadi senang dan bahagia. Di antara pemberian-Nya itu ialah turunnya wahyu terus-menerus setelah itu sebagai petunjuk bagi Nabi saw dan umatnya untuk mendapat kebahagiaan hidup di dunia dan hari akhirat. Dia akan memenangkan agama yang dibawa Nabi Muhammad atas seluruh agama lainnya dan Dia akan mengangkat kedudukannya di atas kedudukan manusia seluruhnya.",
      "text_translation": "Dan sungguh, kelak Tuhanmu pasti memberikan karunia-Nya kepadamu, sehingga engkau menjadi puas.",
      "text": "وَلَسَوْفَ يُعْطِيْكَ رَبُّكَ فَتَرْضٰىۗ",
      "text_translation_en": "And, indeed, in time will thy Sustainer grant thee [what thy heart desires], and thou shalt be well-pleased.",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "In this verse, God recalls the blessings Muhammad received, saying, \"Are you Muhammad, an orphan, with no father in charge of your education, upholding your interests and guiding you, but I have guarded, protected, and guided you and kept you from the sins of ignorance of the people of ignorance and their evils, that you may obtain the title of perfect Man. \" The Prophet (saws) was living orphaned because his father passed away while he was still in his mother's womb. When he was born, God preserved Muhammad by making his grandfather, Abdul Muththalib, love and love him. The Prophet Muhammad was in his care and guidance until Abdul Muththalib died, when he was eight years old. With the death of Abdul Muththalib, the Prophet Muhammad became the dependent of his uncle, Abu thalib, based on the will of Abdul Muththalib. Abu alib had devoted all his attention to the care of the Holy Prophet, until he grew up and became an apostle. After Muhammad was made an apostle, the Quraysh oppressed and afflicted him, but Abu the cross continued to defend him from all threats of the Muslims until Abu Talib died. With the death of Abu Talib, the Quraysh had the opportunity to harm the Prophet by intervening with the wicked among them which forced him to emigrate. What a wonderful combination of Allah and His care for Prophet Muhammad. Usually a child's anxiety is the cause of his or her demise because there are no caregivers and mentors in charge. Moreover, the atmosphere and attitude of the people of Mecca is more than enough to mislead the Prophet. however, the protection of God is too restrictive to prevent him from accompanying them. Thus, he became a very honest, trustworthy, never lying, and never ignorant young man of sin.",
      "text_tafsir": "Dalam ayat ini, Allah mengingatkan nikmat yang pernah diterima Nabi Muhammad dengan mengatakan, \"Bukankah engkau hai Muhammad seorang anak yatim, tidak mempunyai ayah yang bertanggung jawab atas pendidikanmu, menanggulangi kepentingan serta membimbingmu, tetapi Aku telah menjaga, melindungi, dan membimbingmu serta menjauhkanmu dari dosa-dosa perilaku orang-orang Jahiliah dan keburukan mereka, sehingga engkau memperoleh julukan Manusia sempurna.\"\n\nNabi saw hidup dalam keadaan yatim karena ayahnya meninggal dunia sedangkan ia masih dalam kandungan ibunya. Ketika lahir, Allah memelihara Muhammad saw dengan cara menjadikan kakeknya, Abdul Muththalib, mengasihi dan menyayanginya. Nabi Muhammad berada dalam asuhan dan bimbingannya sampai Abdul Muththalib wafat, sedang umur Nabi ketika itu delapan tahun. Dengan meninggalnya Abdul Muththalib, Nabi Muhammad menjadi tanggungan paman beliau, Abu thalib, berdasarkan wasiat dari Abdul Muththalib. Abu thalib telah mengerahkan semua perhatiannya untuk mengasuh Nabi saw, sehingga beliau meningkat dewasa dan diangkat menjadi rasul. Setelah Muhammad diangkat menjadi rasul, orang-orang Quraisy memusuhi dan menyakitinya, tetapi Abu thalib terus membelanya dari semua ancaman orang musyrik hingga Abu thalib wafat.\n\nDengan wafatnya Abu thalib, bangsa Quraisy mendapat peluang untuk menyakiti Nabi dengan perantaraan orang-orang jahat di kalangan mereka yang menyebabkan beliau terpaksa hijrah.\n\nBetapa hebatnya penggemblengan Allah dan asuhan-Nya terhadap Nabi Muhammad. Biasanya keyatiman seorang anak menjadi sebab kehancuran akhlaknya karena tidak ada pengasuh dan pembimbing yang bertanggung jawab. Apalagi suasana dan sikap penduduk Mekah lebih dari cukup untuk menyesatkan Nabi saw. akan tetapi, perlindungan Allah yang sangat rapi dapat mencegah beliau menemani mereka. Dengan demikian, jadilah beliau seorang pemuda yang sangat jujur, terpercaya, tidak pernah berdusta, dan tidak pernah berlumur dengan dosa orang-orang Jahiliah.",
      "text_translation": "Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungi(mu),",
      "text": "اَلَمْ يَجِدْكَ يَتِيْمًا فَاٰوٰىۖ",
      "text_translation_en": "Has He not found thee an orphan, and given thee shelter?",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "In this verse, God declares, that He found the Prophet Muhammad in ignorance of the Shari'ah and did not know the Qur'an. Then Allah gave him guidance. What puzzled the Prophet Muhammad was what he saw among the Arabs himself about the humility of the creed, the weakness of their judgment due to the influence of wrong assumptions, the cruelty of their deeds, and their fragile and hostile state. They were headed for destruction by using foreigners who were commoners among them consisting of Persians, Jews, and Romans. What steps should be taken to correct their beliefs, free them from the influence of bad customs, and what steps should be taken to wake them up from a sound sleep? Other prophets were not in a better state than they were. But even then, God did not allow the Prophet Muhammad to carry out his preaching without his help. God even gave him a revelation that explained to him the path he needed to take in trying to improve his people. Allah said: And thus We revealed to you (Muhammad) the Spirit by our Command. Previously you did not know what the Book is or what it is, but We have made it light, so that We guide whom We desire among our servants. (Asi-Syura \/ 42: 52)",
      "text_tafsir": "Dalam ayat ini, Allah mengungkapkan, bahwa Dia mendapatkan Nabi Muhammad dalam keadaan tidak mengerti tentang syariat dan tidak mengetahui tentang Al-Qur'an. Kemudian Allah memberikan petunjuk kepadanya.\n\nHal yang sangat membingungkan Nabi Muhammad adalah apa yang dilihatnya di kalangan bangsa Arab sendiri tentang kerendahan akidah, kelemahan pertimbangan disebabkan pengaruh dugaan-dugaan yang salah, kejelekan amal perbuatan, dan keadaan mereka yang terpecah-belah dan suka bermusuhan. Mereka menuju kepada kehancuran karena memakai orang-orang asing yang leluasa bertindak di kalangan mereka yang terdiri dari bangsa Persi, Habsyi, dan Romawi.\n\nJalan apakah yang harus ditempuh untuk membetulkan akidah-akidah mereka, membebaskan mereka dari pengaruh adat istiadat yang buruk itu, dan cara bagaimana yang harus dijalankan untuk membangunkan mereka dari tidur yang nyenyak itu?\n\nUmat-umat nabi lain pun tidak lebih baik keadaannya daripada umatnya. Tetapi walaupun begitu, Allah tidak membiarkan Nabi Muhammad menjalankan dakwah tanpa bantuan-Nya. Allah bahkan memberikan wahyu yang menjelaskan kepadanya jalan yang harus ditempuh dalam usaha memperbaiki keadaan kaumnya. Allah berfirman:\n\nDan demikianlah Kami wahyukan kepadamu (Muhammad) ruh (Al-Qur'an) dengan perintah Kami. Sebelumnya engkau tidaklah mengetahui apakah Kitab (Al-Qur'an) dan apakah iman itu, tetapi Kami jadikan Al-Qur'an itu cahaya, dengan itu Kami memberi petunjuk siapa yang Kami kehendaki di antara hamba-hamba Kami. (asy-Syura\/42: 52)",
      "text_translation": "dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk,",
      "text": "وَوَجَدَكَ ضَاۤلًّا فَهَدٰىۖ",
      "text_translation_en": "And found thee lost on thy way, and guided thee?",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "In this verse, Allah declares that Prophet Muhammad was a poor man. Her father left no inheritance for her except a female camel and a female servant. Then Allah gave him the great fortune of trading Khadijah and added to the treasure that Khadijah bestowed on him in the struggle to uphold the religion of Allah. From the above statements, Allah has indeed told the Prophet Muhammad that He is caring for the orphan, avoiding it from confusion, and making it sufficient. Allah will not leave Prophet Muhammad for the rest of his life.",
      "text_tafsir": "Dalam ayat ini, Allah menyatakan bahwa Nabi Muhammad adalah seorang yang miskin. Ayahnya tidak meninggalkan pusaka baginya kecuali seekor unta betina dan seorang hamba sahaya perempuan. Kemudian Allah memberinya harta benda berupa keuntungan yang amat besar dari memperdagangkan harta Khadijah dan ditambah pula dengan harta yang dihibahkan Khadijah kepadanya dalam perjuangan menegakkan agama Allah.\n\nDari keterangan-keterangan tersebut di atas, sesungguhnya Allah mengatakan kepada Nabi Muhammad bahwa Dialah yang memeliharanya dalam keadaan yatim, menghindarkannya dari kebingungan, dan menjadikannya berkecukupan. Allah tidak akan meninggalkan Nabi Muhammad selama hidupnya.",
      "text_translation": "dan Dia mendapatimu sebagai seorang yang kekurangan, lalu Dia memberikan kecukupan.",
      "text": "وَوَجَدَكَ عَاۤىِٕلًا فَاَغْنٰىۗ",
      "text_translation_en": "And found thee in want, and given thee sufficiency?",
      "juz_number": 30
    },
    "9": {
      "text_tafsir_en": "After stating in the previous verses about the various favors given to the Prophet Muhammad, in this verse, Allah asks His Prophet to be grateful for those favors, and not despise orphans and abuse their rights. Instead, the Prophet Muhammad was asked to educate them with manners and manners, and to instill noble virtues in their souls, so that they became useful members of society, not the seeds of evil that harmed those who interacted with them. The Prophet Muhammad said: I (the people) and those who raise orphans in heaven (very close), like these two (two fingers, that is the index finger and middle finger). have felt the bitterness of living in a state of helplessness so that they can feel the bitterness in others. Allah has rescued Prophet Muhammad from misery and humiliation, so he should honor all orphans as a sign of gratitude for the blessings God bestowed on him.",
      "text_tafsir": "Sesudah menyatakan dalam ayat-ayat terdahulu tentang bermacam-macam nikmat yang diberikan kepada Nabi Muhammad, maka pada ayat ini, Allah meminta kepada Nabi-Nya agar mensyukuri nikmat-nikmat tersebut, serta tidak menghina anak-anak yatim dan memperkosa haknya.\n\nSebaliknya, Nabi Muhammad diminta mendidik mereka dengan adab dan sopan-santun, serta menanamkan akhlak yang mulia dalam jiwa mereka, sehingga mereka menjadi anggota masyarakat yang berguna, tidak menjadi bibit kejahatan yang merusak orang-orang yang bergaul dengannya. Nabi Muhammad bersabda:\n\nAku (kedudukanku) dan orang yang mengasuh anak yatim di surga (sangat dekat), seperti dua ini (dua jari, yaitu telunjuk dan jari tengah).(Riwayat at-Tirmidhi dari Sahl bin Sa'ad)\n\nBarang siapa yang telah merasa kepahitan hidup dalam serba kekurangan maka selayaknya ia dapat merasakan kepahitan itu pada orang lain. Allah telah menghindarkan Nabi Muhammad dari kesengsaraan dan kehinaan, maka selayaknya Nabi memuliakan semua anak yatim sebagai tanda mensyukuri nikmat-nikmat yang dilimpahkan Allah kepadanya.",
      "text_translation": "Maka terhadap anak yatim janganlah engkau berlaku sewenang-wenang.",
      "text": "فَاَمَّا الْيَتِيْمَ فَلَا تَقْهَرْۗ",
      "text_translation_en": "Therefore, the orphan shalt thou never wrong,",
      "juz_number": 30
    },
    "10": {
      "text_tafsir_en": "In this verse, Allah instructs the Prophet Muhammad that those who ask him for something do not be rebuffed and rebuked, instead they are given something or are refused gently. There is an opinion that what is meant by the word as-sa'il is the person who is asking for directions, so this petitioner should be served gently while fulfilling his request.",
      "text_tafsir": "Dalam ayat ini, Allah memerintahkan kepada Nabi Muhammad agar orang-orang yang meminta sesuatu kepadanya jangan ditolak dengan kasar dan dibentak, malah sebaliknya diberi sesuatu atau ditolak secara halus. Ada pendapat bahwa yang dimaksud dengan kata as-sa'il adalah orang yang memohon petunjuk, maka hendaknya pemohon ini dilayani dengan lemah lembut sambil memenuhi permohonannya.",
      "text_translation": "Dan terhadap orang yang meminta-minta janganlah engkau menghardik(nya).",
      "text": "وَاَمَّا السَّاۤىِٕلَ فَلَا تَنْهَرْ",
      "text_translation_en": "and him that seeks [thy] help shalt thou never chide,",
      "juz_number": 30
    },
    "11": {
      "text_tafsir_en": "In this verse, God reiterated to the Prophet Muhammad to increase his gift to the poor and the poor and to thank, mention, and remember the favors of Allah bestowed upon him. Mentioning the favors of God bestowed upon us is not to boast, but to be grateful and to expect others to be grateful for the blessings that they have received. In a hadith, the Prophet (peace be upon him) said: He who does not thank man does not thank God. (History of Abu Dawud and at-Tirmizi of Abu Hurairah). It is not uncommon for people to think of their wealth as a source of non-charity, and they often hear about their shortcomings. On the contrary, generous people always show their gifts and sacrifices from the wealth they are given by expressing gratitude and thanks to God for His bounty.",
      "text_tafsir": "Dalam ayat ini, Allah menegaskan lagi kepada Nabi Muhammad agar memperbanyak pemberiannya kepada orang-orang fakir dan miskin serta mensyukuri, menyebut, dan mengingat nikmat Allah yang telah dilimpahkan kepadanya. Menyebut-nyebut nikmat Allah yang telah dilimpahkan kepada kita bukanlah untuk membangga-banggakan diri, tetapi untuk mensyukuri dan mengharapkan orang lain mensyukuri pula nikmat yang telah diperolehnya. Dalam sebuah hadis, Nabi saw mengatakan:\n\nOrang yang tidak berterima kasih kepada manusia tidak mensyukuri Allah. (Riwayat Abu Dawud dan at-Tirmizi dari Abu Hurairah).\n\nKebiasaan orang-orang kikir sering menyembunyikan harta kekayaannya untuk menjadi alasan tidak bersedekah, dan mereka selalu memperdengarkan kekurangan. Sebaliknya, orang-orang dermawan senantiasa menampakkan pemberian dan pengorbanan mereka dari harta kekayaan yang dianugerahkan kepada mereka dengan menyatakan syukur dan terima kasih kepada Allah atas limpahan karunia-Nya itu.",
      "text_translation": "Dan terhadap nikmat Tuhanmu hendaklah engkau nyatakan (dengan bersyukur).",
      "text": "وَاَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ ࣖ",
      "text_translation_en": "and of thy Sustainer's blessings shalt thou [ever] speak.",
      "juz_number": 30
    }
  },
  "name": "الضحى",
  "name_translation_en": "The Morning Hours",
  "name_translation": "Duha",
  "name_latin": "Ad-Duha"
}