{
  "number": 97,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 5,
  "ayat": {
    "1": {
      "text_tafsir_en": "There are four places in the Qur'an that describe his descent to the Prophet (saw): 1. In Surah al-Qadr. 2. In Surah ad-Dukhan, it is in his word: ha Mim. For the sake of the Book (the Qur'an), we have revealed it on the blessed night. Indeed, we are the ones who warn you. On (that night) all matters of wisdom are revealed, (that is) our affairs. Truly, We are the messengers, the mercy of your Lord. Truly, He is Hearing, Knowing. (ad-Dukhan \/ 44: 1-6) 3. In Surah al-Baqarah, it is in His Word: The month of Ramadan is (the month) in which the Qur'an is revealed, as a guide to mankind and explanations of mankind that clue and the difference (between the true and the false). (al-Baqarah \/ 2: 185) 4. In Surah al-Anfal, that is, in his Word: And know that indeed all that you possess is a spoils of war, then one-fifth for Allah, the Messenger, the Messenger, the orphan, the poor, and ibn sabil, (if so) if you believe in Allah and what We sent down to Our servant on the day of Furqan, that is, on the day of the two armies. God is omnipotent. (al-Anfal \/ 8: 41) Surah al-Qadr says that the descent of the Qur'an from the Far Mahfudh to Jerusalem is clear on the eve of Lailatul Qadr. Surah ad-Dukhan verse reinforces the descent of the Qur'an on the blessed night, Surah al-Baqarah verse shows the descent of the Qur'an during the month of Ramadan. Whereas Surah al-Anfal \/ 8: 41 above describes the solution of dividing the war in the Badr War. This war is called yaumul-furqan because it is a battle between the Islamic army and the infidel army, where victory is in the hands of the Islamic army. In this verse it is revealed that Allah sent the Qur'an for the first time to the Holy Prophet on a glorious night. It is then gradually revealed gradually according to the events and circumstances which it desires for a period of twenty-two more years as a guide for mankind in achieving the happiness of living in the world and in the hereafter. In connection with the above description, scholars say that the words anzala and nazzala are different in meaning and meaning. Therefore, the meaning of the anzalnahu in Surah al-Qadr shows the first and only downfall of the Holy Qur'anic scriptures from the Far Mahfudh to the celestial world. Then was passed down gradually from heaven to the Prophet Muhammad, whom the Angel Gabriel carried for 22 years, 2 months and 22 days. Whereas the meaning of nazzala means lowered gradually. There is no doubt that people desperately need the Qur'an as a guide that explains something they are skeptical of in matters related to religious matters or worldly issues. The Qur'an also explains to them the events of man and the coming events of the day of resurrection. Humans need such a hold because without it they cannot understand the principles of true happiness to formulate rules and laws. Therefore, it is a valid opinion that states that a person cannot escape from religion and spiritual guidance which determines the size and value of a thing after knowing the facts and the efficacy of something.",
      "text_tafsir": "Terdapat empat tempat dalam Al-Qur'an yang menerangkan tentang penurunannya kepada Nabi saw yaitu:\n\n1.Dalam Surah al-Qadr.\n\n2.Dalam Surah ad-Dukhan, yaitu pada firman-Nya:\n\nha Mim. Demi Kitab (Al-Qur'an) yang jelas, sesungguhnya Kami menurunkannya pada malam yang diberkahi. Sungguh, Kamilah yang memberi peringatan. Pada (malam itu) dijelaskan segala urusan yang penuh hikmah, (yaitu) urusan dari sisi Kami. Sungguh, Kamilah yang mengutus rasul-rasul, sebagai rahmat dari Tuhanmu. Sungguh, Dia Maha Mendengar, Maha Mengetahui. (ad-Dukhan\/44: 1-6)\n\n3.Dalam Surah al-Baqarah, yaitu pada firman-Nya:\n\nBulan Ramadan adalah (bulan) yang di dalamnya diturunkan Al-Qur'an, sebagai petunjuk bagi manusia dan penjelasan-penjelasan mengenai petunjuk itu dan pembeda (antara yang benar dan yang batil). (al-Baqarah\/2: 185)\n\n4.Dalam Surah al-Anfal, yaitu pada firman-Nya:\n\nDan ketahuilah, sesungguhnya segala yang kamu peroleh sebagai rampasan perang, maka seperlima untuk Allah, Rasul, kerabat Rasul, anak yatim, orang miskin dan ibnu sabil, (demikian) jika kamu beriman kepada Allah dan kepada apa yang Kami turunkan kepada hamba Kami (Muhammad) di hari Furqan, yaitu pada hari bertemunya dua pasukan. Allah Mahakuasa atas segala sesuatu. (al-Anfal\/8: 41)\n\nAyat Surah al-Qadr menyatakan bahwa turunnya Al-Qur'an dari Lauh Mahfudh ke Baitul-'Izzah jelas pada malam Lailatul Qadr. Ayat Surah ad-Dukhan menguatkan turunnya Al-Qur'an pada malam yang diberkahi, ayat Surah al-Baqarah menunjukkan turunnya Al-Qur'an pada bulan Ramadan. Sedangkan Surah al-Anfal\/8: 41 di atas menerangkan penyelesaian pembagian rampasan perang pada Perang Badar. Perang ini disebut yaumul-furqan karena merupakan pertempuran antara tentara Islam dengan tentara kafir, di mana kemenangan berada di tangan tentara Islam. \n\nDalam ayat ini diungkapkan bahwa Allah menurunkan Al-Qur'an pertama kali kepada Nabi saw pada malam yang mulia. Kemudian diturunkan terus-menerus secara berangsur-angsur menurut peristiwa dan suasana yang menghendakinya dalam jangka waktu dua puluh dua tahun lebih sebagai petunjuk bagi manusia dalam mencapai kebahagiaan hidup di dunia dan di akhirat nanti.\n\nSehubungan dengan uraian di atas, para ulama mengatakan bahwa kata anzala dan nazzala berbeda penggunaan dan maknanya. Oleh sebab itu, makna anzalnahu dalam Surah al-Qadr menunjukkan turunnya kitab suci Al-Qur'an pertama kali dan sekaligus dari Lauh Mahfudh ke langit dunia. Kemudian diturunkan berangsur-angsur dari langit dunia kepada Nabi Muhammad, yang dibawa oleh Malaikat Jibril selama 22 tahun, 2 bulan dan 22 hari. Sedangkan makna nazzala bermakna diturunkan berangsur-angsur.\n\nTidak diragukan lagi bahwa manusia sangat memerlukan Al-Qur'an sebagai pedoman yang menjelaskan sesuatu yang mereka ragukan dalam hal-hal yang berhubungan dengan soal-soal keagamaan atau masalah-masalah duniawi. Al-Qur'an juga menerangkan kepada mereka kejadian manusia dan kejadian yang akan datang ketika datangnya hari kebangkitan.\n\nManusia memerlukan pegangan tersebut karena tanpanya, mereka tidak dapat memahami prinsip-prinsip kemaslahatan yang sebenarnya untuk membentuk peraturan-peraturan dan undang-undang. Oleh sebab itu, benarlah pendapat yang menyatakan bahwa manusia tidak dapat melepaskan diri dari agama dan petunjuk rohani yang menentukan ukuran dan nilai sesuatu setelah mengetahui secara ilmiah keadaan dan khasiat sesuatu.",
      "text_translation": "Sesungguhnya Kami telah menurunkannya (Al-Qur'an) pada malam qadar.",
      "text": "اِنَّآ اَنْزَلْنٰهُ فِيْ لَيْلَةِ الْقَدْرِ ",
      "text_translation_en": "BEHOLD, from on high have We bestowed this [divine writ] on Night of Destiny.",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "Later in this verse, God expresses the priority of Lailatul-Qadr which is unknown to scholars and scientists, however high is their knowledge. Even the understanding and knowledge of His Prophet could not determine the greatness and importance of that night. Only God knows all the supernatural, the creation of the universe, which creates it from nothing to existence.",
      "text_tafsir": "Kemudian dalam ayat ini, Allah menyatakan keutamaan Lailatul-Qadr yang tidak dapat diketahui oleh para ulama dan ilmuwan, bagaimanapun tingginya ilmu pengetahuan mereka. Pengertian dan pengetahuan Nabi-Nya pun tidak sanggup menentukan kebesaran dan keutamaan malam itu. Hanya Allah yang mengetahui segala hal yang gaib, yang menciptakan alam semesta, yang mewujudkannya dari tidak ada menjadi ada.",
      "text_translation": "Dan tahukah kamu apakah malam kemuliaan itu?",
      "text": "وَمَآ اَدْرٰىكَ مَا لَيْلَةُ الْقَدْرِۗ",
      "text_translation_en": "And what could make thee conceive what it is, that Night of Destiny?",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "In this verse, God describes the true priority of Lailatul-Qadr. That night was a night that shone a light of guidance as the beginning of the tragedy 'which was brought down to human happiness. That night was also the first stone laying of the Islamic Shari'ah, as the religion of the end of mankind, in keeping with their lifelong devotion. That night was the most important of all the thousands of months that they went through with the sin of greed and endless misery. That night's worship has the added value of glory and reward better than a thousand-month worship The word \"thousand\" in this verse does not mean to determine its number. However, it does mean to say as many infinite as God's word says: Each of them wants to be given a thousand years of age. (al-Baqarah \/ 2: 96). Is there a more glorious night than the night in which the light of guidance has been shed for mankind after centuries of misguidedness and disbelief? Is there a greater glory than the night in which the full light of divine enlightenment illuminated the soul of Muhammad who was sent as a mercy to all mankind, conveying glad tidings and threats and calling them to the straight path, making them a people free from the bondage of slavery and oppression of the tyrannical rulers of the east and the west, and uniting them after divisions and hostilities? So it is a myth that Muslims have made the night a feast because it is the time of the downfall of the basic law that directs mankind in the best interests of them. This decline also renews their promise to God in relation to soul and wealth as a token of gratitude for the favor of His gift and for the reward of His reward.",
      "text_tafsir": "Pada ayat ini, Allah menerangkan keutamaan Lailatul-Qadr yang sebenarnya. Malam itu adalah suatu malam yang memancarkan cahaya hidayah sebagai permulaan tasyri' yang diturunkan untuk kebahagiaan manusia. Malam itu juga sebagai peletakan batu pertama syariat Islam, sebagai agama penghabisan bagi umat manusia, yang sesuai dengan kemaslahatan mereka sepanjang zaman. Malam tersebut lebih utama dari seribu bulan yang mereka lalui dengan bergelimang dosa kemusyrikan dan kesesatan yang tidak berkesudahan. Ibadah pada malam itu mempunyai nilai tambah berupa kemuliaan dan ganjaran yang lebih baik dari ibadah seribu bulan\n\nSebutan kata \"seribu\" dalam ayat ini tidak bermaksud untuk menentukan bilangannya. Akan tetapi, maksudnya untuk menyatakan banyaknya yang tidak terhingga sebagaimana yang dikehendaki dengan firman Allah:\n\nMasing-masing dari mereka ingin diberi umur seribu tahun. (al-Baqarah\/2: 96).\n\nApakah ada malam yang lebih mulia daripada malam yang padanya mulai diturunkan cahaya hidayah untuk manusia setelah berabad-abad lamanya mereka berada dalam kesesatan dan kekufuran? Apakah ada kemuliaan yang lebih agung daripada malam di mana cahaya purnama ilmu makrifah ketuhanan menerangi jiwa Muhammad saw yang diutus sebagai rahmat untuk seluruh manusia, menyampaikan berita gembira dan ancaman serta memanggil mereka ke jalan yang lurus, menjadikan mereka umat yang melepaskan manusia dari belenggu perbudakan dan penindasan penguasa yang zalim di timur dan barat, dan mempersatukan mereka sesudah berpecah-belah dan bermusuh-musuhan?\n\nMaka seyogyanya umat Islam menjadikan malam tersebut sebagai hari raya karena malam itu merupakan waktu turunnya undang-undang dasar samawi yang mengarahkan manusia ke arah yang bermanfaat bagi mereka. Penurunan ini juga memperbaharui janji mereka dengan Tuhan yang berhubungan dengan jiwa dan harta sebagai tanda syukur atas nikmat pemberian-Nya serta mengharapkan pahala balasan-Nya.",
      "text_translation": "Malam kemuliaan itu lebih baik daripada seribu bulan.",
      "text": "لَيْلَةُ الْقَدْرِ ەۙ خَيْرٌ مِّنْ اَلْفِ شَهْرٍۗ",
      "text_translation_en": "The Night of Destiny is better than a thousand months:",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "In this verse, God declares part of the special privilege of the night, the descent of angels with Gabriel from the realm of angels to the appearance of the Prophet (saws), especially Gabriel giving the revelation. Gabriel's appearance to the Prophet saw in his original form was a command of God, after He had prepared His Prophet to receive the revelation that He would convey to mankind with virtues and blessings. The descent of angels to earth is by God's permission, we do not need to investigate how and what is the secret. Let's just trust him. As for what man can know about the secrets of this world, it is as little as is explained in the word of God: Whereas you are given a little knowledge. (al-Isra '\/ 17: 85) That night (Lailatul-Qadr) is the feast of the Muslims because it is the time of the descent of the Qur'an and a night of thanksgiving to Allah for the goodness and pleasure which He has bestowed. At that time, the angels were thanking people for the greatness of the night of Qadar, as a sign of human glory being the caliphate of God on earth. Among the signs of Lailatul-Qadr is a sunrise with no radiant light. Ibn 'Abbas narrated that the Prophet said about Lailatul-Qadr: Lailatul qadar was a calm and sunny night, not hot or cold, and the morning sun was bright red. (History of Abu Dawud)",
      "text_tafsir": "Dalam ayat ini, Allah menyatakan sebagian dari keistimewaan malam tersebut, yaitu turunnya para malaikat bersama Jibril dari alam malaikat sehingga tampak oleh Nabi saw, terutama Jibril yang menyampaikan wahyu. Penampakan Jibril kepada Nabi saw dalam rupanya yang asli adalah perintah Allah, setelah Ia mempersiapkan Nabi-Nya untuk menerima wahyu yang akan disampaikannya kepada manusia yang mengandung kebajikan dan keberkahan.\n\nTurunnya malaikat ke bumi adalah dengan izin Allah, tidak perlu kita menyelidiki bagaimana cara dan apa rahasianya. Kita cukup beriman saja dengannya. Adapun yang dapat diketahui manusia tentang rahasia alam ini hanya sedikit sekali, sebagaimana diterangkan dalam firman Allah:\n\nSedangkan kamu diberi pengetahuan hanya sedikit. (al-Isra'\/17: 85)\n\nMalam itu (Lailatul-Qadr) adalah hari raya umat Islam karena merupakan waktu turunnya Al-Qur'an dan malam bersyukur kepada Allah atas kebajikan serta kenikmatan yang dikaruniakan-Nya. Pada saat itu, malaikat ikut bersyukur bersama manusia atas kebesaran malam Qadar, sebagai tanda kemuliaan manusia yang menjadi khalifah Allah di muka bumi.\n\nDi antara tanda-tanda Lailatul-Qadr adalah matahari terbit tanpa sinarnya yang memancar. Ibnu 'Abbas meriwayatkan bahwa Rasulullah bersabda tentang Lailatul-Qadr:\n\nLailatul qadar adalah malam yang tenang dan cerah, tidak panas dan tidak dingin, serta matahari pada pagi harinya berwarna merah terang. (Riwayat Abu Dawud)",
      "text_translation": "Pada malam itu turun para malaikat dan Ruh (Jibril) dengan izin Tuhannya untuk mengatur semua urusan.",
      "text": "تَنَزَّلُ الْمَلٰۤىِٕكَةُ وَالرُّوْحُ فِيْهَا بِاِذْنِ رَبِّهِمْۚ مِنْ كُلِّ اَمْرٍۛ",
      "text_translation_en": "in hosts descend in it the angels, bearing divine inspiration by their Sustainer's leave; from all [evil] that may happen",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, God declares that the night is full of virtues and blessings from the beginning to the dawn, because of the descent of the Qur'an witnessed by angels when Allah spreads the breast of His Prophet and facilitates the way of imparting guidance and guidance to His people.",
      "text_tafsir": "Dalam ayat ini, Allah menyatakan bahwa malam tersebut dipenuhi kebajikan dan keberkahan dari permulaan sampai terbit fajar, karena turunnya Al-Qur'an yang disaksikan oleh para malaikat ketika Allah melapangkan dada Nabi-Nya dan memudahkan jalan untuk menyampaikan petunjuk serta bimbingan kepada umatnya.",
      "text_translation": "Sejahteralah (malam itu) sampai terbit fajar.",
      "text": "سَلٰمٌ ۛهِيَ حَتّٰى مَطْلَعِ الْفَجْرِ ࣖ",
      "text_translation_en": "does it make secure, until the rise of dawn.",
      "juz_number": 30
    }
  },
  "name": "القدر",
  "name_translation_en": "The Power, Fate",
  "name_translation": "Kemuliaan",
  "name_latin": "Al-Qadr"
}