{
  "number": 99,
  "source_tafsir": "Aplikasi Quran Kementrian Agama Republik Indonesia",
  "sum_ayat": 8,
  "ayat": {
    "1": {
      "text_tafsir_en": "In this verse, God reveals that the earth trembles and shakes violently, as the Word of God describes in another verse: O mankind! Fear your Lord; indeed, the shaking (day) of the End was a great (event). (al-hajj \/ 22: 1) When the earth is shaken violently. (al-Waqi'ah \/ 56: 4). This description shows how terrible the situation was. It is intended to attract unbelievers to think and reflect on it. It was as if they were told that if the earth as a solid object could tremble violently on that day, then why would they not be conscious of their own negligence by abandoning their infidelity.",
      "text_tafsir": "Dalam ayat ini, Allah mengungkapkan bahwa bumi bergeletar dan berguncang sedahsyat-dahsyatnya, sebagaimana diterangkan firman Allah dalam ayat lain:\n\nWahai manusia! Bertakwalah kepada Tuhanmu; sungguh, guncangan (hari) Kiamat itu adalah suatu (kejadian) yang sangat besar. (al-hajj\/22: 1)\n\nApabila bumi diguncangkan sedahsyat-dahsyatnya. (al-Waqi'ah\/56: 4).\n\nKeterangan ini menunjukkan tentang dahsyatnya keadaan ketika itu. Hal itu dimaksudkan untuk menarik perhatian orang-orang kafir agar memikirkan dan merenungkannya. Seakan-akan dikatakan kepada mereka bahwa apabila bumi sebagai benda padat bisa bergeletar dengan dahsyat pada hari itu, maka mengapa mereka sendiri tidak mau sadar dari kelalaian dengan meninggalkan kekafirannya.",
      "text_translation": "Apabila bumi diguncangkan dengan guncangan yang dahsyat,",
      "text": "اِذَا زُلْزِلَتِ الْاَرْضُ زِلْزَالَهَاۙ",
      "text_translation_en": "WHEN THE EARTH quakes with her [last] mighty quaking,",
      "juz_number": 30
    },
    "2": {
      "text_tafsir_en": "In this verse, God states that on the day that the sun rose, because of its terrible, the earth was spewing out its hidden contents in the form of metal, treasure, and corpses. In another verse, God says: And when the earth is at rest, and what is in it is made desolate, and is empty. (Al-Insyiqaq \/ 84: 3-4) For example, as happened with the eruption of Krakatoa in 1883, the earthquake and tsunami in Aceh in 2004, a mud volcano in Sidoarjo, East Java since 2006, and others are so powerful that take out the lava and fill the stomach. The shock on the day of the end is even more terrible.",
      "text_tafsir": "Dalam ayat ini, Allah menyatakan bahwa pada hari terjadi kegun-cangan itu, karena dahsyatnya, bumi menghamburkan isi perutnya yang terpendam berupa logam, harta simpanan, dan mayat-mayat dari kubur. Dalam ayat lain, Allah berfirman:\n\nDan apabila bumi diratakan, dan memuntahkan apa yang ada di dalamnya dan menjadi kosong. (al-Insyiqaq\/84: 3-4)\n\nContohnya, sebagaimana terjadi dengan letusan gunung Krakatau pada tahun 1883, gempa dan tsunami di Aceh pada tahun 2004, lumpur panas di Sidoarjo Jawa Timur sejak tahun 2006, dan lain-lain yang begitu dahsyat sehingga mengeluarkan lava dan isi perut bumi. Guncangan pada hari kiamat jauh lebih dahsyat lagi.",
      "text_translation": "dan bumi telah mengeluarkan beban-beban berat (yang dikandung)nya,",
      "text": "وَاَخْرَجَتِ الْاَرْضُ اَثْقَالَهَاۙ",
      "text_translation_en": "and [when] the earth yields up her burdens,",
      "juz_number": 30
    },
    "3": {
      "text_tafsir_en": "In this verse, God reveals that the people who experienced and witnessed the terrible events and shocked those who saw it, said, \"What is the meaning of the earth? What has never happened before?\" In another verse, God says: And you see men drunk, but they are not drunk. (al-hajj \/ 22: 2)",
      "text_tafsir": "Dalam ayat ini, Allah mengungkapkan bahwa orang-orang yang mengalami dan menyaksikan kejadian yang dahsyat dan membuat terperanjat orang-orang yang melihatnya, berkata, \"Apa gerangan yang terjadi pada bumi. Ini belum pernah terjadi sebelumnya?\" Dalam ayat lain, Allah berfirman:\n\nDan kamu melihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk. (al-hajj\/22: 2)",
      "text_translation": "Dan manusia bertanya, “Apa yang terjadi pada bumi ini?”",
      "text": "وَقَالَ الْاِنْسَانُ مَا لَهَاۚ",
      "text_translation_en": "and man cries out, \"What has happened to her?\" -",
      "juz_number": 30
    },
    "4": {
      "text_tafsir_en": "In this verse, Allah states that when that terrible shock occurs, when the earth shakes and experiences destruction and destruction, it is as if he explains to humans that this unprecedented event is not according to the provisions that apply to the universe under ordinary circumstances. God explained that the cause of the shock was only at His command. When the earth is ordered to be destroyed, the earth will be destroyed. Basically verses 1-5 above pertain to Judgment Day. But from a smaller scale these verses can be interpreted by the geological process of the earthquake, which of course is much smaller than the doomsday event later. As explained earlier according to scientific studies that the earth's crust plates move and interact with one another. In places where they meet, these plates cause an earthquake. An example is Indonesia which is the meeting place of three plates: Eurasia, Pacific, and Indo-Australia. When the two plates meet, then there is continuous pressure (load), and if the plates can no longer bear the pressure (load), then release the burden that has accumulated for hundreds of years, and is released in the form of an earthquake. On that day the earth 'told the news. The heavy burden released in the form of an earthquake is a geological process that runs for years. And so on, after every load is released, the load collection process occurs again. This geological process or geological news can be recorded both naturally and using geophysical equipment or geodesy (see also an-Naml \/ 27: 88, ath-thur \/ 52: 6). The study of earthquakes can also be seen in Surah an-Naba '\/ 78: 17-20.",
      "text_tafsir": "Dalam ayat ini, Allah menyatakan bahwa ketika terjadinya keguncangan yang dahsyat itu, saat bumi bergetar dan mengalami kehancuran serta kerusakan, seakan-akan ia menjelaskan kepada manusia bahwa kejadian yang belum pernah terjadi ini tidak menurut ketentuan yang berlaku bagi alam semesta dalam keadaan biasa.\n\nAllah menjelaskan bahwa sebab terjadinya keguncangan tersebut adalah atas perintah-Nya semata. Ketika bumi diperintahkan hancur, maka bumi akan hancur luluh.\n\nPada dasarnya ayat 1-5 di atas berkenaan dengan hari kiamat. Namun dari sekala lebih kecil ayat-ayat tersebut dapat ditafsirkan dengan proses geologi terjadinya gempa, yang sudah barang tentu besarannya jauh lebih kecil dibanding kejadian kiamat kelak.\n\nSeperti telah dijelaskan sebelumnya menurut kajian ilmiah bahwa lempengan-lempengan kulit bumi bergerak dan saling berinteraksi satu sama lain. Pada tempat-tempat saling bertemu, pertemuan lempengan ini menimbulkan gempa bumi. Sebagai contoh adalah Indonesia yang merupakan tempat pertemuan tiga lempeng: Eurasia, Pasifik, dan Indo-Australia. Bila dua lempeng bertemu, maka terjadi tekanan (beban) yang terus menerus, dan bila lempengan tidak tahan lagi menahan tekanan (beban) tersebut, maka lepaslah beban yang telah terkumpul ratusan tahun itu, dan dikeluarkan dalam bentuk gempa bumi.\n\nPada hari itu bumi 'menceritakan beritanya. Beban berat yang dikeluarkan dalam bentuk gempa bumi, merupakan satu proses geologi yang berjalan bertahun-tahun. Begitu seterusnya, setiap selesai beban dilepaskan, kembali proses pengumpulan beban terjadi. Proses geologi atau berita geologi ini dapat direkam baik secara alami maupun dengan menggunakan peralatan geofisika ataupun geodesi (lihat juga an-Naml\/27: 88, ath-thur\/52: 6). Telaah tentang gempa bumi dapat dilihat pula pada Surah an-Naba'\/78: 17-20.",
      "text_translation": "Pada hari itu bumi menyampaikan beritanya,",
      "text": "يَوْمَىِٕذٍ تُحَدِّثُ اَخْبَارَهَاۙ",
      "text_translation_en": "on that Day will she recount all her tidings,",
      "juz_number": 30
    },
    "5": {
      "text_tafsir_en": "In this verse, Allah states that when that terrible shock occurs, when the earth shakes and experiences destruction and destruction, it is as if he explains to humans that this unprecedented event is not according to the provisions that apply to the universe under ordinary circumstances. God explained that the cause of the shock was only at His command. When the earth is ordered to be destroyed, the earth will be destroyed. Basically verses 1-5 above pertain to Judgment Day. But from a smaller scale these verses can be interpreted by the geological process of the earthquake, which of course is much smaller than the doomsday event later. As explained earlier according to scientific studies that the earth's crust plates move and interact with one another. In places where they meet, these plates cause an earthquake. An example is Indonesia which is the meeting place of three plates: Eurasia, Pacific, and Indo-Australia. When the two plates meet, then there is continuous pressure (load), and if the plates can no longer bear the pressure (load), then release the burden that has accumulated for hundreds of years, and is released in the form of an earthquake. On that day the earth 'told the news. The heavy burden released in the form of an earthquake is a geological process that runs for years. And so on, after every load is released, the load collection process occurs again. This geological process or geological news can be recorded both naturally and using geophysical equipment or geodesy (see also an-Naml \/ 27: 88, ath-thur \/ 52: 6). The study of earthquakes can also be seen in Surah an-Naba '\/ 78: 17-20.",
      "text_tafsir": "Dalam ayat ini, Allah menyatakan bahwa ketika terjadinya keguncangan yang dahsyat itu, saat bumi bergetar dan mengalami kehancuran serta kerusakan, seakan-akan ia menjelaskan kepada manusia bahwa kejadian yang belum pernah terjadi ini tidak menurut ketentuan yang berlaku bagi alam semesta dalam keadaan biasa.\n\nAllah menjelaskan bahwa sebab terjadinya keguncangan tersebut adalah atas perintah-Nya semata. Ketika bumi diperintahkan hancur, maka bumi akan hancur luluh.\n\nPada dasarnya ayat 1-5 di atas berkenaan dengan hari kiamat. Namun dari sekala lebih kecil ayat-ayat tersebut dapat ditafsirkan dengan proses geologi terjadinya gempa, yang sudah barang tentu besarannya jauh lebih kecil dibanding kejadian kiamat kelak.\n\nSeperti telah dijelaskan sebelumnya menurut kajian ilmiah bahwa lempengan-lempengan kulit bumi bergerak dan saling berinteraksi satu sama lain. Pada tempat-tempat saling bertemu, pertemuan lempengan ini menimbulkan gempa bumi. Sebagai contoh adalah Indonesia yang merupakan tempat pertemuan tiga lempeng: Eurasia, Pasifik, dan Indo-Australia. Bila dua lempeng bertemu, maka terjadi tekanan (beban) yang terus menerus, dan bila lempengan tidak tahan lagi menahan tekanan (beban) tersebut, maka lepaslah beban yang telah terkumpul ratusan tahun itu, dan dikeluarkan dalam bentuk gempa bumi.\n\nPada hari itu bumi 'menceritakan beritanya. Beban berat yang dikeluarkan dalam bentuk gempa bumi, merupakan satu proses geologi yang berjalan bertahun-tahun. Begitu seterusnya, setiap selesai beban dilepaskan, kembali proses pengumpulan beban terjadi. Proses geologi atau berita geologi ini dapat direkam baik secara alami maupun dengan menggunakan peralatan geofisika ataupun geodesi (lihat juga an-Naml\/27: 88, ath-thur\/52: 6). Telaah tentang gempa bumi dapat dilihat pula pada Surah an-Naba'\/78: 17-20.",
      "text_translation": "karena sesungguhnya Tuhanmu telah memerintahkan (yang sedemikian itu) padanya.",
      "text": "بِاَنَّ رَبَّكَ اَوْحٰى لَهَاۗ",
      "text_translation_en": "as thy Sustainer will have inspired her to do!",
      "juz_number": 30
    },
    "6": {
      "text_tafsir_en": "In this verse, Allah explains that on the day of the destruction and destruction of the earth and the occurrence of new nature and new life, humans emerge in different and grouped circumstances. People who do good deeds are not the same as bad people. Obedient people are not the same as those who commit immorality. They appear to show God what they have done and to reap the fruits of their efforts while living in the world.",
      "text_tafsir": "Dalam ayat ini, Allah menerangkan bahwa pada hari terjadinya kerusakan dan kehancuran bagi bumi serta terjadinya alam baru dan hidup baru, muncullah manusia dalam keadaan yang berbeda-beda dan berkelompok. Orang-orang yang beramal baik tidak sama dengan orang-orang jahat. Orang-orang yang taat tidak sama dengan orang yang berbuat maksiat. Mereka muncul untuk diperlihatkan Allah kepada mereka apa yang telah mereka lakukan dan untuk memetik hasil usaha mereka selama hidup di dunia.",
      "text_translation": "Pada hari itu manusia keluar dari kuburnya dalam keadaan berkelompok-kelompok, untuk diperlihatkan kepada mereka (balasan) semua perbuatannya.",
      "text": "يَوْمَىِٕذٍ يَّصْدُرُ النَّاسُ اَشْتَاتًا ەۙ لِّيُرَوْا اَعْمَالَهُمْۗ",
      "text_translation_en": "On that Day will all men come forward, cut off from one another, to be shown their [past] deeds.",
      "juz_number": 30
    },
    "7": {
      "text_tafsir_en": "In these verses, God details their respective charities. Those who do good, even if only heavy atoms will receive their reward, and those who do evil even when only heavy atoms will feel their reward. The good deeds of the unbelievers cannot help and liberate them from their suffering. They will suffer forever in hell.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah merincikan balasan amal masing-masing. Barang siapa beramal baik, walaupun hanya seberat atom niscaya akan diterima balasannya, dan begitu pula yang beramal jahat walaupun hanya seberat atom akan merasakan balasannya. Amal kebajikan orang-orang kafir tidak dapat menolong dan melepaskannya dari siksa karena kekafirannya. Mereka akan tetap sengsara selama-lamanya di dalam neraka.",
      "text_translation": "Maka barangsiapa mengerjakan kebaikan seberat zarrah, niscaya dia akan melihat (balasan)nya,",
      "text": "فَمَنْ يَّعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَّرَهٗۚ",
      "text_translation_en": "And so, he who shall have done an atom's weight of good, shall behold it;",
      "juz_number": 30
    },
    "8": {
      "text_tafsir_en": "In these verses, God details their respective charities. Those who do good, even if only heavy atoms will receive their reward, and those who do evil even when only heavy atoms will feel their reward. The good deeds of the unbelievers cannot help and liberate them from their suffering. They will suffer forever in hell.",
      "text_tafsir": "Dalam ayat-ayat ini, Allah merincikan balasan amal masing-masing. Barang siapa beramal baik, walaupun hanya seberat atom niscaya akan diterima balasannya, dan begitu pula yang beramal jahat walaupun hanya seberat atom akan merasakan balasannya. Amal kebajikan orang-orang kafir tidak dapat menolong dan melepaskannya dari siksa karena kekafirannya. Mereka akan tetap sengsara selama-lamanya di dalam neraka.",
      "text_translation": "dan barangsiapa mengerjakan kejahatan seberat zarrah, niscaya dia akan melihat (balasan)nya.",
      "text": "وَمَنْ يَّعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَّرَهٗ ࣖ",
      "text_translation_en": "and he who shall have done an atom's weight of evil, shall behold it.",
      "juz_number": 30
    }
  },
  "name": "الزلزلة",
  "name_translation_en": "The Earthquake",
  "name_translation": "Guncangan",
  "name_latin": "Az-Zalzalah"
}